{"Genre": "Crime", "Reviews": [{"Review": "The birth of a legend....  This is it...the novel in which Sir Arthur ushered the world’s greatest second best detective (after Batman) into our collective consciousness. Being the non-conformist rebel that I am, I started off bassackwards by reading The Valley of Fear and then The Adventure of the Final Problem because those were the two stories with Moriarty in them. Shocking, I know, but that’s just how I roll. Btw, it still really chaffs my cheeks that Doyle wrote 56 short stories and 4 nove"}, {"Review": "(A-) 82% | Very GoodNotes: Despite its mediocre sojourn to Utah, it's an enjoyable read, and an interesting look at the original version of Holmes."}, {"Review": "Arthur Conan Doyle's first Sherlock Holmes novel is utterly unimpressive. In short, the book starts like this:[image error]and mid-way turns into this:And I am not even joking. The novel begins with Holmes and Watson meeting, moving into their Baker Street apartment and then investigating a murder of a man found in an abandoned house. At the half point, however, the story completely changes its course and becomes the most awkward introduction of the murderer's back story and motives involving Mo"}, {"Review": "بالرغم من أعجابي الشديد بشخصية شيرلوك هولمز منذ الصغر بسبب مسلسل الانيمي الشهير في الثمانيناتوالذي قدم بشكل \"كلب\"، بينما بنفس الوقت قدمه ديزني بشكل فأر، في فيلم وكوميكس بمجلة ميكيوبعد سنوات طويلة، شاهدت بالصدفة فيلم شيرلوك هولمز لروبرت داوني جونيور..لم أتحمس له بالبداية، لكنه أيضا جذبني بذكاء الحبكة وقوتهاواخيرا، منذ أيام شاهدت الحلقة الاولي من مسلسل شيرلوك، بعد الضجة المثارة حول موسمها الاخيريقدم المسلسل صورة معاصرة لشيرلوك، بشكل ذكي ومثير، الحلقة الاولي بعنوان \"دراسة في اللون البمبي\"، ذكرني بع"}, {"Review": "Sherlock Holmes and the case of the Killer Mormons!But more about that later...Ok, the big deal about this one is that you get to see the Sherlock/Watson meet-cute. I mean, this is one of the most important meetings in the history of all literature! Come on, people! Get excited!It's only fair to mention that I've read and reread all of these stories a bjillion times, and these are by far my favorite classic characters.Well, except for Lizzie & Mr. Darcy...But I know I haven't read P&P as"}, {"Review": "SO I DID IT. CONGRATULATE ME. I read an adult book and a classic and I survived!! *flings confetti over self* Okay, except that actually I listened to an audio and I'm 100% sure the audio is the only reason I survived it, because, gawsh...while it's incredibly interesting, it's written so incredibly boringly. The writing is potato. That's all I can say. Maybe I'm not \"appreciating the arts\"...but the whole thing is like a monologue!! Where are the scenes??! Where is the development?!?!? Gah. And"}, {"Review": " The Game is on!  ENTER THE DETECTIVE It's in this very first novel where the great character Sherlock Holmes, along with Dr. John Watson, are introduced to the audience in their first case together.It wasn't an instantenous success, but gladly it was appreciated soon enough to the point that when the author, Sir Arhur Conan Doyle, wanted to \"kill\" the character, not only their loyal fans wrote letters against the decision (something unheard at those times) for not saying that even people in Lon"}, {"Review": "This nifty novel ( really a novella) the first Sherlock Holmes book written in 1887, is rather strange since it is set both in the culture, of brimming Victorian London, 1881, and the  dry , very hot desolate deserts of the savage wastelands of Utah, 1847 , nothing here...before there was a state established there or giving that name. Or even part of the United States, since technically still Mexican territory , neglected by them and ruled by the Ute Indians... hence the appropriate appellation"}, {"Review": "A Study in Scarlet (Sherlock Holmes, #1), Arthur Conan Doyle A Study in Scarlet is an 1887 detective novel by British author Arthur Conan Doyle. Written in 1886, the story marks the first appearance of Sherlock Holmes and Dr. Watson, who would become two of the most famous characters in popular fiction. The book's title derives from a speech given by Holmes, a consulting detective, to his friend and chronicler Watson on the nature of his work, in which he describes the story's murder investigati"}, {"Review": "  An anti-review  I don’t read reviews of books, of which I am damn sure I will be reading it very soon. Now, I don’t know how this habit affects my reading.So, what happened was..I was not aware of the fact that “I had to be surprised when the second part of the book starts and wonder what happened to the story with Sherlock Holmes in it and how that mystery was solved! Moreover, I had to wonder whether the second part was from some other book, somehow got binded in my copy and curse the publis"}, {"Review": "A STUDY IN SCARLET!!! First group-read for the intact official Non-Crunchy-Sans Pants- for no reason that I can figure out...but none-the-less...NON pants wearing GRs classic reading group. [image error]I read A STUDY IN SCARLET waaaaaaaay back in my younger days- and remembered very little of it. To be perfectly honest- I remembered the title...and reading it- but nothing else. Whether it is my memory...or the fact that it wasn't memorable can be argued- but I liked it. A LOT.[image error]Setti"}, {"Review": "  “There is a mystery about this which stimulates the imagination; where there is no imagination there is no horror”  I’m going to keep this short and (somewhat) sweet, because this is a very short little introduction that started it all. Everyone’s favorite original detective is Sherlock Holmes, and I’ve been wanting to see how it all began for a long while now! But I can honestly say that I was not prepared for the last half of this tiny book. Yet, I am still happy that I can finally say I’ve"}, {"Review": "Mysteries are my go to palette cleanser in between denser reads. I have a few go to series, but as my current contemporary series may be winding down, I am always on the lookout for mysteries both old and new. Even though the phrase \"elementary, my dear Watson,\" has become part of the vernacular, I have never read a single Sherlock Holmes story. Looking to alleviate that, I decided to encounter Holmes and Watson when they first met in Sir Arthur Conan Doyle's first novella, A Study in Scarlet, c"}, {"Review": "This is an underwhelming debut for one of literature’s most famous characters. Doyle’s Sherlock is in the nascent stage here and isn’t the fully fleshed out character, readers came to know. The steady and reliable narrator, Dr. John Watson gets introduced to Holmes in Watson’s attempts to find a roommate. “Can two odd Victorian Era men share a flat without driving each other crazy?”Sure, why not.Watson takes measure of Holmes:Although the illustration below belies it, the producers of the TV sho"}, {"Review": "The first Sherlock Holmes and Doctor John Watson novel, Arthur Conan Doyle's A Study in Scarlet is just lots of fun! The scenes, especially in part 1 are ones we've seen interpreted in shows like BBC's Sherlock, but it's definitely enjoyable to read about (as well as watch) how it all started. In my mind, this book is most compelling for bringing Holmes and Watson together (and for making Watson the chronicler and foil of Holmes' amazing deductions). Doyle makes Holmes every bit as interesting a"}, {"Review": "Gregson and Lestrade had watched the maneuvers of their amateur companion with considerable curiosity and some contempt. They evidently failed to appreciate the fact, which I had begun to realize, that Sherlock Holmes's smallest actions were all directed towards some definite and practical end.This is the first Sherlock Holmes story, a novel which introduces the now legendary detecting team of Sherlock Holmes and Dr. Watson. Watson is looking for a roommate and is introduced to Holmes with some"}, {"Review": "This was a reread. I have read this book many times. It still holds up well. Sherlock Holmes is here, intact, unchanged, canon.Both Lestrade and Watson are a foil to Sherlock's genius. I liked reliving the case and its unraveling. It was a nicety to concentrate on the serious side but also the humor. Rache!Books like this always hold up. The prose is so modern sounding. Books that came after ASiS, are sometimes so outdated. But not here. Sherlock's various incarnations - I wouldn't say pale in c"}, {"Review": "Marvelous to see how the rules of detective fiction/noir are placed so meticulous and clear in this, the first Sherlock Holmes novel. Halfway the locale turns exotic--Holmes already knows who the culprit is--and, fittingly, the motive is but half the story! What a feeling of pervasive excitement the mid 19th century had with these cerebral, albeit universal, yarns of suspense.As slight-yet-surprising as James Bond's first foray, Ian Fleming's \"Casino Royale.\""}, {"Review": "Ah! My dear reader of review, I see you have just returned from Afghanistan, in a black cab, driven by an Italian driver, on your way here you stopped for breakfast at a McDonald's where you were served by a pregnant red-headed lady. I am sure you are wondering how I know all this. Well, my dear fellow (I have also immediately deduced your gender) I have my methods. Now, to the matter of writing this A Study in Scarlet review, that, my friend, is a three pipes problem.Wait! Don't go away just ye"}, {"Review": "“There is no satisfaction in vengeance unless the offender has time to realize who it is that strikes him, and why retribution has come upon him.” Sherlock Holmes is a legend. I've watched movies and TV shows, heard stories and read adaptions, but to this day I never read the original work. I wondered if original Sherlock would own up to BBC Sherlock, and so he did. But while their personalities are quite similiar, their stories still differ a lot, which was to be expected. I have to admit that"}, {"Review": "Not related to the book yetThis is the book that completes my 2011 Goodreads Reading Challenge! 275 books and I still have 3 days to spare. My first target was 200 because that was the the annual target of the author Nicholas Sparks as he said in one of his interviews. But I achieved it in September so I changed it to 250. But I achieved 250 on the last week of October and I thought I could still read 25 more. So, here I am, proud that I was able to read 275 books!!! Last year, I only read 196 b"}, {"Review": "It seems like it would be an odd way to tell such a story, in two disparate parts, but both parts of the story are well-told and gripping. Though, I found the adventure in Utah to be particularly edge-of-the-seat. There’s a reason Holmes was such a popular character. Arthur Conan Doyle wove fascinating tales.I’d recommend this book for all fiction readers—unless you’re a Mormon with anger issues, then you might want to just pass."}, {"Review": "Sherlock Holmes is a dick. And I don’t mean that as a reference to the character being a private detective. Sure, he may be brilliant, but he’s also arrogant, condescending, cold, rude, self-absorbed and generally an insufferable douche bag. If Watson wasn’t such a brown-noser, he’d have snapped and pimp slapped the shit out of Holmes about five minutes after meeting him. It’d been a long time since I’d read any of the stories, and I thought I’d check some out after watching Robert Downey Jr. pl"}, {"Review": "I realized recently that I never reread Sherlock Holmes. I received collected SH for Christmas when I was nine, and read it all (with the exception of Hound of the Baskervilles, which I skipped at the time because I was afraid it might involve bad things happening to dogs) over vacation. I enjoyed the stories very much but at this point only remember colorful details and quirky solutions -- some orange seeds, a secret snake, men with red hair, different colors of mud.I don't know what happened t"}, {"Review": "Read for Popsugar's 2018 Reading Challenge: a book with your favorite color in the titleThe beginning was great, as we got to see Watson meet Holmes for the first time, and discover some of his quirky personality traits. We see them jump into a little murder case, and work through that with the police force, which was all awesome. Halfway through the book, it shifts to different characters to sort of explain a bunch of backstory about how Sherlock figured it out, but I found this portion to be t"}, {"Review": "Rating: 4 starsThis is my first Sherlock Holmes novel and yes, I am ashamed for not having read it earlier. I suppose that, what LOTR trilogy is to the fantasy world, Sherlock Holmes is to the detective/crime genre. Reading it is kind of like getting a degree. So anyway friends, I have graduated and am finally an official member of the crime/mystery fandom. And I am most definitely a part of the bandwagon of Sherlock Homes fans. Okay, off to the plot them:“A Study in Scarlet” introduces the famo"}, {"Review": "Los libros cortos me producen algo extraño: no puedo entrar en la historia y en los personajes (Con excepción de los libros del único y gran Franz Kafka). Cuando siento que estoy camino a meterme en la historia, el libro se acaba y no puedo hacerme muy amigo con los personajes o incluso con la historia.Es el caso de este libro. A pesar de la importancia que tiene Conan Doyle en la literatura policial, no me convenció. Es raro, Holmes conoce a Watson, investigan el caso de la casa abandonada, se"}, {"Review": "You should read this if you like: Sherlock Holmes stories or its many adaptations, detective novels, short mysteries, Victorian London setting. What a delightful read! Sherlock Holmes and his detective stories have always been a favorite of mine. But while I’m very familiar with the numerous TV and film adaptations of the series, ASIC was my first foray into the novels. As expected the reading experience was slightly different, but equally entertaining. In A Study in Scarlet, author Arthur Conan"}, {"Review": "3.85En esta brillante y corta historia, Sir Arthur Conan Doyle nos introduce al descarado y sumamente analítico detective Sherlock Holmes y a su inseparable acompañante, el doctor militar John Watson —como dato, esto representa una de las más grandes presentaciones en el mundo literario y cinematográfico—. Doyle nos otorga un caso realmente misterioso, que conforme avanza la secuencia de los sucesos el lector espera ir resolviendo junto al gran detective. Se nos otorgan pistas y revelaciones per"}, {"Review": "★★★☆☆ “There's the scarlet thread of murder running through the colourless skein of life, and our duty is to unravel it, and isolate it, and expose every inch of it.” Here we have the first ever Sherlock Holmes mystery originally published in the magazine, Beeton's Christmas Annual in 1887. Read as part of a buddy reads twofer since apparently much of our group, including myself, is OCD and can’t simply skip ahead to book two. Although none of the four novels are connected it’s still nice to see"}], "ID": "102868", "Name": "A Study in Scarlet"}