{"Genre": "Crime", "Reviews": [{"Review": " In the morning, there's another girl floating dead in the lake. Easily one of the better mystery/thrillers I've read this year. After disappointments from old favourites with Since We Fell and newly-hyped thrillers like Final Girls, I managed to find a really creepy, suspenseful story from an author who has always been a bit hit and miss for me.The book starts with a very dramatic and gruesomely exciting opening chapter. I've grown to appreciate slow build novels, but thrillers that pull out a"}, {"Review": " Gina never asked about the garage. That thought would keep her awake every night for years after, pulsing hot against her eyelids. I should have asked. Should have known. But she'd never asked, she didn't know, and in the end, that was what destroyed her. There were some things that I didn't totally like in the book, but for the most part it was really good! **Mild Spoilers**It's been a few years now and Gina is now Gwen and she is living in Stillhouse Lake, TN <-- I live in TN =) Gwen is li"}, {"Review": "My reviews can also be found at: https://deesradreadsandreviews.wordpr...I’ve been trying to stay away from reading any new series until I finish the ones I’ve already started. However, I’ve been seeing “Stillhouse Lake” pop up everywhere lately, and after reading the description and a few reviews, I had to admit, I was intrigued. I decided I had to read it... and I’m really glad I did.Normally, Gina Royal is home at three in the afternoon, but her husband, Mel, has called and asked her to pick"}, {"Review": "This was exciting from beginning to end! I love this spin on the typical serial killer thriller; here, we see the focus on the family the monster left behind. My nerves constantly ramped up as the tension grew; this was compulsive reading at its finest and I'm so glad I was able to snag this with my Kindle Unlimited membership. I was a bit surprised to see so many typos and formatting issues though; I don't read enough finished ebook copies to know if maybe this is normal? Anyway, it wasn't enou"}, {"Review": "This is probably one of the best psychological thrillers I have read in a while. It had me questioning myself at every twist and turn. I was literally on the edge of my seat during the last three-quarters of the book. I could even feel the paranoia of the main character. Totally messed with my mind!!"}, {"Review": "4.5, PSA: if your partner has a “secret room” burn it TO THE GROUND stars!!! Full review featured on my blog Recipe and a Read!!!Gina Royal is a good wife. She is an exceptional mother. She takes care of house and home like a juggernaut – doing what society, and her husband has told her is her most important job, to the detriment of her own well-being. She loves her children with everything she has, and while her marriage has its hiccups and that proverbial “spark” may be gone, Mel is a good fat"}, {"Review": " Stillhouse Lake is a great book. I mean, stay-up-until-2:00-a.m.-to-finish-it great. I read the whole thing in just a few hours, and my heart was pounding pretty fast for a while afterward!\"I'm glad I've escaped a hell I had hardly even recognized when I was burning in it. Glad that I've pulled the kids out, too.\"Gina Royal had your typical, everyday life. Her marriage to her husband Mel had its ups and downs, but for the most part, they were happy, and she felt comfortable raising their two ch"}, {"Review": "5 Stars!Chilling, Thrilling and Wholly Satisfying.Imagine waking up one day to find out that you don’t know the man you are married to. Worse yet, that he is a monster. And what’s even more horrifying? That you will never be safe after what he has done. This is the story of “Stillhouse Lake” - and boy is it one helluva ride. On the day that Gina Royal comes home to find that a car has smashed into the garage, her life literally comes crashing down before her. Turns out her husband Melvin Royal,"}, {"Review": "Update: 13/3/18. This is currently on offer: 0.99p in the UK, $0.99 in the US (I think) - and $2.99 in Canada. It's the same price for Killman Creek, too! Loved. This. Book.Damn. This ends with cliffhanger that I didn't see coming, though I probably should have. I feel like doing a reread, already. The story is told in the first and third person perspectives - though, the third person is for the prologue, then it switches to (Gina/Gwen's) first person perspective.Gina Royal, thinks she's got a p"}, {"Review": "3.5 starsImagine coming home with your kids one day and finding your garage smashed in by a drunk driver. Then even worse, finding out that your husband has been using that garage as a little chop 'em up shop.Complete with dead body. That's what happens to Gina Royal. The bad thing is? She lived with this dude and had two children by him and never knew that he was one of the most prolific serial killers around.  Gina is also arrested and tried as his accomplice, because just how could she not kn"}, {"Review": "What a fascinating premise! A story told from the perspective of a serial killer’s wife. Told after he is discovered, she and her family have had to go into hiding, changing their identities. Dealing with the trolls who want to punish them for her husband’s crimes. And she still struggles with how she never knew. This is so well done. There’s a great level of suspense and tension throughout the book. A real creepiness factor. It’s really rare for me to read a mystery that literally gives me chil"}, {"Review": "A breakneck pace and lots of serial killer chills!I'm not a huge fan of serial killer reads, but with so many great reviews I purchased this one and read it straight through leaving all my other reads languishing until I finished!Gina Royal is a shy housewife with two children she dotes on. She was living a normal life( so she thought) until one day she was confronted with her husbands \"other\" life and is forced to change her name and power up in order to protect her kids and herself! I really l"}, {"Review": "I am sorry guys but this did nothing for me I DNF at 40% the premise started out fast paced easily read but for me just nothing was going on the beginning was a good start but by the time Gwen had moved to Stillwater Lake it slowed somewhat which bored me there was too much explanation & not enough movement. The characters were likeable but flawed.It was a shame really as I had high hopes for this series again I am in the minority but so be it I always say how it is at least I am honest in m"}, {"Review": "Psychological thriller.Started with accident, drunk driver destroyed the garage of serial killer Melvin Royal. Did gruesome killings there. Fooled his wife and kids for years, now they are on the run from people that didn't believe the fact they didn't know what he was doing in that garage. Changing names, schools. Wife Gina always prepared to move if they are discovered. This unstable emotional state taking a toll on all of them. Parts gets little boring, but keep reading. Has a very surprising"}, {"Review": "Book Blog | BookstagramAfter reading this I am going to be on high alert-code orange, for any signs my darling husband is a deranged serial killer.I mean, he has a serious deep-rooted hate for bunnies, so that’s got to be red flag number one. All I need now is to find a locked room in our house that I’m never allowed to go in, and it’s all but basically confirmed. I’m going to have to kill him.But we’ll cross that bridge when we get to it.Stillhouse Lake by Rachel Caine is a different twist on t"}, {"Review": "Two warnings before you begin this taut thriller: It ends on a cliffhanger (book two is available and there is a third book not yet out), and there is a degree of graphic detail about women who are tortured before they are killed.Gina Royal thinks she’s living a wonderful, suburban life with a loving husband and two great kids. Then she comes home one day to a street clogged with police cars and ambulances. A car accident has revealed that her husband’s hobby in the garage—one she never inquired"}, {"Review": " 4 Stars for Stillhouse Lake  Gina never asked about the garage. That thought would keep her awake every night for years after. I should have asked. Should have known. But she's never asked, she didn't know, and in the end, that was what destroyed her.  And so the story begins.....I was in the mood for an engrossing thriller and this turned out to be exactly that, making it one of the best thrillers I've read this year! Though she starts off weak Gina/Gwen quickly becomes a likable character. Sh"}, {"Review": "Quick, gripping read with a premise unlike anything else I'd ever read. I grew to love the main character as the book went on, even after being initially put off by her. The younger characters were realistically flawed and likeable. While I did manage to guess a bit of what was really going on, it was a wild and enjoyable ride. I'm definitely going to be watching out for the next in the series, which is released in December.Gwen Proctor underwent a metamorphosis. Once she was Gina Royal, loyal a"}, {"Review": "I finally finished this book. It's been on my currently reading shelf for a month, and I think I read four other books in the time it took me to read this short thriller, but it's finally done. Okay, thoughts-- if it wasn't for the final forty pages I think I would've given this book 2 stars. I can see why this book is popular, and would not sway anyone away from reading it, but there was just so many small things in this story that just kept distracting me as I read it, so many details that I f"}, {"Review": "A fast-paced and intense psychological thriller. Pulls you right in and doesn't let go. Who can be trusted? Is there anywhere that is safe? I loved how strong and fierce Gwen was. She can definitely hold her own. Others are often destroyed by all that she has gone through. Had me thinking about what life is like for those left behind after a crime -- both the perpetrator's and the victim's families. The ending sets you up perfectly for book two in the series. Can't wait to read it!"}, {"Review": "Five extremely intense stars!!!Cannot even imagine being married to a serial killer.... how could you not question your judgment from that point on? How could you ever trust anybody else again? How could you ever feel safe?The author did an absolutely amazing job of putting you in Gina/Gwen‘s head for the duration of this book.... I felt just as paranoid and on edge as Gina/Gwen did.... this book was extremely hard to put down, I just needed to know what was going to happen to this family next.."}, {"Review": "3.5 stars. Chilling. Mysterious. Dark. Suspenseful. Eerie. Engrossing.Gwen Proctor hasn’t always been Gwen Proctor. She used to be Gina Royal. Gina Royal was a quiet stay at home mother of two beautiful children who came home one day to find out her husband of nine years was a serial killer. Years later, she is living miles away in a house on the edge of Stillhouse Lake, she and her children having taken on new identities. One day, a body mirroring the victims of Gwen’s ex-husband is found float"}, {"Review": "This was such an entertaining exploration into the idea of \"not knowing who you married.\" Warning though - VERY gory and unsettling. We know that doesn't bother me, but I wanted to give you all a heads up. Video review: https://www.youtube.com/watch?v=6Hd2L..."}, {"Review": "What's in your garage?  Vehicles, auxiliary fridge, access to the furnace?  Seems normal enough, at least that's what is in my garage.  But let's say your garage has been converted into a workshop with access limited to an outside door.  And what if that outside entrance is kept locked?  Just what could your spouse be tinkering around with in there?  Hmmm?Stillhouse Lake in Tennessee.  Sounds tranquil enough, but Gwen Proctor's carefully manufactured life is about to implode. She, along with her"}, {"Review": "Gina Royal returned home one night with her children in the car to find their home surrounded in the many vehicles of first responders and their flashing lights. Fearing the worst Gina announces that this is her home to only be forced from her car and put into handcuffs in front of her kids. Having no clue what is going on Gina is shocked and mortified when she finds out that a car has crashed into her home revealing that her husband's private work area was hiding his victims. Now years later Gi"}, {"Review": "Imagine coming home one afternoon after a normal, typical day and having your life turned inside out, upside down in a second. Well, that’s what happened to Gwen Proctor, formerly known as Gina Royal, the identity she had to give up so she and her two children, Lanny and Connor (also new names) could survive. A freak accident exposed her now ex-husband Mel Royal as a brutal serial killer and the court of public opinion viewed Gwen as an accomplice. She was tried and acquitted in the real court o"}, {"Review": "Exceptional, nonstop suspense from an experienced author (Rachel Caine is a pseudonym). There are so many ways this plot could have been made trite or shallow, and none of them show up. When readers start the story, one disbelieves the protagonist's naivete. Yet for the rest of the book, the protagonist describes her boomerang reactions especially to protect her children, and the horrific online fallout. Along with the reader, she self-examines again and again the question of her guilt exactly o"}, {"Review": "In general, I'm picky about endings. A bad ending can ruin the whole book for me. But a good ending can definitely sell me the next book.However, a blatant cliffhanger attempt to sell me the next book is what we have here, and it left me really not wanting to ever read anything by this author again.But this is something I've seen before, and I just realized I'd seen it with this same publisher. Could it be that the editors are forcing the writers into this? Whatever happened to that good old pap"}, {"Review": "Find all of my reviews at: http://52bookminimum.blogspot.com/ 3.5 StarsGina thought she had the perfect life. Happily (enough) married to Mel, mother of two, she was a real Suzy Homemaker. That is, until a drunk driver crashed into their garage and uncovered her husband’s little secret . . . .  (Mitchell still can’t figure out why Gina would be upset about discovering she was married to the perfect man.)Anywho, fast forward a year where we meet the new and improved Gina . . . .  Now known as Gwe"}, {"Review": "  \"Everyone runs from the monster. Everyone except the monster slayer...\"   Yes!!! Our heroine is facing the unexpected consequences of her ex-husband's actions and they aren't pretty. In fact, they put her and her children at significant risk which means she is always in a proactive defense mode. Like she can't even breathe. She always has to stay one step ahead of any possible threat and her exhaustion is palpable. But her passion for her responsibility as a parent is even more tangible. I abs"}], "ID": "33128934", "Name": "Stillhouse Lake"}