{"Name": "Heaven Sent", "Image": "https://images.gr-assets.com/books/1526989735l/40192264.jpg", "Reviews": [{"Review": "'The world is mired in lies, chaos and darkness, mate.'...'You're a bringer of truth, order and light.''Not any more, I've had enough.'The fourth book in the Cato Kwong crime series goes beyond the thin blue line of crime fiction and delves deep into the personal lives of its characters to provide not only a well written police procedural, but a book that humanizes the darker elements unlawful acts have on those who serve and protect as well as their loved ones.Immediately the thing that sticks out about Heaven Sent is the connection the author has with the characters who traverse the streets of Fremantle, Western Australia, on either side of the law; Kwong is complex and not without his flaws. He's instantly likable and a well defined character, his actions often to the detriment of his family but the betterment of the Fremantle public. While, the elusive murderer who taunts police in a macabre game of cat and mouse is omnipresent, growing more dramatic and menacing with each chapter.The place-setting and pacing are on point, with each murder adding a notch of intensity to Kwong's plight; take down the serial killer who targets the homeless and taunts the police.Throw in an interesting journalistic angle and some beefy side plots and Heaven Sent becomes one meaty read that doesn't disappoint. My rating: 5/5 stars. Despite being the fourth book in the series, Heaven Sent is easily accessible to new readers, that said, I definitely want to check out the earlier books given how much I enjoyed this one. Highly recommend."}, {"Review": "It has been nearly four years since we the reading public were acquainted with Philip 'Cato' Kwong. Since then things have changed dramatically for the popular and easy going detective. For one he is now well away from rural WA in Fremantle and with wife number 2 (Sharon Wang), baby Ellie and improving relations with his teenage son things are seemingly going well.But that feeling is shaken when a series of murders of homeless people see Cato bumped up to major Crime. While there are a few obvious suspects they all end up going nowhere as it becomes apparent the killer is playing games with authorities. Complicating matters is a local reporter Norman Lip is in communications with the killer, that not only puts his life in danger but also gives the killer what he wants, a way to reel in and kill Cato. When his son is attacked and then a homeless friend is found dead it's clear the killer's real target is Cato and he will have his work cut out trying to protect his family and work out who from his past is responsible.For people new to the series there are plenty of subtle hints as to Cato's private and work-life to bring you up to speed quickly while the storyline is perfectly easy to get into for anyone who loves gritty no-nonsense crime/thrillers. There is a strong theme of social issues with the plight of the homeless and the difficultness of raising a family and the toll it takes on those caught in the middle like Cato's son who deals with his dads and mums families. The story can at times feel claustrophobic but that creates a sense of the reality of genuine and paranoia. "}, {"Review": "*https://mrsbbookreviews.wordpress.comAlan Carter is a Ned Kelly Award Winner, but until now I have not had the privilege of reading any of his work. I was assured by the author himself after listening to a talk given to celebrate the release of Heaven Sent, the fourth issue in the popular Cato Kwong crime thriller series, that newcomers can enjoy each novel in this series as a standalone. Heaven Sent, my freshman outing with Alan Carter, proved to be a most valuable reading experience. Based on my appreciation of Heaven Sent and the writing of Alan Carter, I am going to make it a priority to check out Carter’s previous novels.Heaven Sent re-introduces Detective Sergeant Philip Cato Kwong to those who are fans of the series. For first timers, do not be discouraged, Carter fills in any gaps, so the reader never feels at a disadvantage. Cato has just entered a new phase in his life, he is content with his new wife and baby daughter. He is also back on his old stomping ground, working in the Major Crimes division in Fremantle. It doesn’t take long before Cato is fully immersed in a complex case involving a series of murders of homeless people inhabiting the Fremantle area and beyond. To complicate matters further, the killer sets their sights on Kwong himself and investigative journalist Norman Lip, who becomes heavily embroiled in this case. As the murders tally up, so do the false leads and dead ends. Cato is on a race against time to stop this killer in their tracks before they make a deadly move on his family.This fourth outing in the Cato Kwong crime thriller series, has been eagerly anticipated by fans of the formidable Philip Cato Kwong. Heaven Sent is well worth the wait and it is a solid addition to this popular book series. What immediately struck me about Heaven Sent was the excellent balance Carter maintained between a cutting edge police procedural, a clever plot, the use of realistic characters and an evocative setting. It is always a little tricky for a writer to get all of these elements exactly right in a novel, but Alan Carter shows his audience he is a force to be reckoned with.Heaven Sent would not be the great novel it is without the enigmatic Philip Cato Kwong. Carter clearly knows his lead inside and out. Carter completely embodies Cato and as a result, the reader sees all of his good points; such as his dedication to his job, his relentless attitude to the law, the love his has for family and the respect he has gained from his colleagues. However, Cato is far from perfect, which makes him all the more authentic. We see Cato’s failings as the book progresses, his ill choices and the struggles he faces between balancing work with fatherhood. Carter’s outline of his lead is second to none, it cannot be faulted and it is easy to see why this series is so popular. Likewise, readers will find the periphery characters add plenty of substance to this novel. The outer characters really stand on their own feet, thanks to their interactions with Cato on a personal and professional level, along with the haunting voice of the killer.Alan Carter does a superb job of conveying his setting. It was a breath of fresh air to see such a well known location to me, Fremantle in Western Australia, captured in such a convincing manner by the author. Clearly Carter knows Fremantle like the back of his hand, but somehow Carter managed to tease out aspects of this local area that made me view Fremantle with a different set of eyes. Fremantle’s dark underbelly and social issues were spot on, thanks to Alan Carter’s top notch storytelling skills. I was also overjoyed to see my own local city, Rockingham, mentioned in the novel, what an added surprise! These aspects certainly contributed to my increased enjoyment of Heaven Sent.In other reviews of this title, it has been mentioned that Alan Carter writes crime thriller novels with a conscious awareness of a social issue. I’m a keen to explore more of his back titles based on this new understanding. In Heaven Sent, Carter carefully unravels the sorry state of affairs around the homeless. In tackling this growing social issue, Carter unpacks any misconceptions and assumptions we may have about who becomes homeless and why. It was an eye opener and I liked the way in which Carter connected this issue to the broader focus of Heaven Sent. It was an interesting angle and it gave the book a sense of elevation.Onto the central crime itself, a killer targeting the homeless around the Fremantle area and the subsequent focus on Detective Cato, this was an intriguing case. I enjoyed the ground work, the nitty gritty of the police tactics and the way in which the case was approached by Cato Kwong, along with his colleagues and the edgy journalist Norman Lip. What came as a surprise to me was the significant role the media can play in a case like the one presented in Heaven Sent. I appreciated the media influence aspects in the novel very much. Carter wraps his fourth instalment in the Cato Kwong series up well and for those who are fans of The Marlborough Man, you will be pleased with the brief link to this novel in Heaven Sent.My fresh acquaintance with the work of Alan Carter, with his latest novel, Heaven Sent, has been such a welcome experience and I feel very fortunate to have discovered Carter’s work. If you have an appreciation for the fine art of crime writing from an Australian angle, Heaven Sent, or any of Alan Carter’s back list titles will be sure to fulfil any craving you have for good quality Australian crime writing."}, {"Review": "Sometimes you start reading a series book about a favourite character, and really start to wonder if the author is annoyed with them, subconsciously punishing them for being too popular, or just enjoying applying the thumb screws for a change. Whatever is going on, Alan Carter isn't making it easy for the popular, easy-going, and seemingly content Philip 'Cato' Kwong in HEAVEN SENT.Settled in his personal life with a new wife, new daughter and a tricky but improving relationship with his teenage son, Kwong's professional life is relatively stable as well - at least he's not serving his time in the remote reaches of WA on the \"stock squad\". He's back in Fremantle, and seconded to major crime when a series of murders of homeless people escalates. Whilst Kwong is dealing with the more traditional elements of a serial killer investigation, journalist Norman Lip is taking a more dangerous path - flirting online with the killer. Especially as it starts to look like this killer has thought this through much more carefully than Lip and has a very personal grudge against Cato Kwong.For readers new to this series, you'll find plenty here to give you hints and tips about Cato Kwong's background - including the acquiring of his nickname. You'll find out enough about his policing past to fill in the gaps, and more than enough about his personal life to explain his satisfaction with his current circumstances, and his almost wilful blindness to some of the struggles his wife Sharon is experiencing with new motherhood. If it's any consolation his domestic blindspot also includes his teenage son who is struggling with two parents who have moved onto other partners, other kids, and other lives. There's plenty there to make the reader really want to give Kwong a good shouting at in places. Which is the great part of this series - Kwong feels like a real person, he's a good cop, who is capable of making good, inspired and profoundly daft decisions. He's a good bloke who loves his family and totally and utterly doesn't get what's happening around him all at the same time. He's caring, concerned, blithely ignorant and utterly interconnected. In other words he's real, and annoying and endearing all at the same time.The plot here is also something that readers who are new to the series will be able to go with also, as will welded on fans (HEAVEN SENT is book number 4). As always there's a social issue at the core - in this case homelessness in a society that's seemingly well off and privileged. The sense of community is strong, with homeless support services, police and local government all too aware of the people who live rough in the place. The fact that the killer is also able to tap into that local knowledge creates a claustrophobic overlay, reminding you that few people are ever really truly under the radar.Dotted throughout, as always, are perfect little observations, Sharon Wang in her struggles with new motherhood and isolation, is still able to summons a bit of fierce when required. Kwong's old love interest and colleague Tess, reminds us of the never-ending problem of toxic male violence that many women live with. Naomi Lip, journalist Norman's sister, wheelchair bound and physically restricted reminds us that mental acuity, wit and ability are often less visible, but much stronger.HEAVEN SENT has been much anticipated, as it's been a bit of a gap since the last outing with Cato Kwong. Let's hope there's plenty more to come.https://www.austcrimefiction.org/revi..."}], "Genre": "Crime", "ID": "40192264", "Desc": ""}