{"Genre": "Crime", "Reviews": [{"Review": "As seen on The ReadventurerI am giving Gone Girl 3 stars, but only begrudgingly. In my mind, any book that takes me 3 months and 20 different tries to read is not worth 3 (i-liked-it on Goodreads) stars, especially a book written by an author I already respect. And I am not kidding, for me the first half of Gone Girl was a PURE TORTURE to read.Amy Dunn disappears on the day of her 5th wedding anniversary. All gradually uncovered evidence suggests that her husband, Nick, is somehow involved. Did"}, {"Review": "AMY DUNNEI am Amy. I’m so perfect you may want to puke. It’s okay, I have that effect on everyone, even my parents. They noticed I was so perfect when I was a little girl and so they wrote some vastly popular children’s books called The Adventures of Amazing Amy. You may have been given them to read in school, and you may have puked on them. I am so self-regarding I can’t pass a mirror without congratulating it that it’s reflecting me and not somebody else. I forgot to mention that I have a perf"}, {"Review": "I'm pretty selective about new releases, but Gone Girl's opening (about a man studying his wife's skull in bed) and unique alternating POV structure promised a kind of He Said, She Said Crimes and Misdemeanors, a The Secret History with a sense of humor. I did really like the structure, along with some of the zingers, and some of the saucier images, but that's about it.From the Kushner epigraph to the name checking of Noel Coward on page 68 to the use of Pygmalion as a verb 20 pages after that ("}, {"Review": "This book is such a steaming pile of shit for so many reasons and hands down the worst book I have ever read. There is a huge cloud of smug over Gone Girl. This was such an unpleasant read that I started taking notes of all the ridiculous parts. It also didn't help matters that I figured out the ending before page 100.There are lots and lots of f-bombs and swearing which says a lot since I cuss like a sailor. For me to pick up on that means it's excessive and adds nothing to the story. Then ther"}, {"Review": "This book was just way too much fun – and I mean that in a good way. I’m taking a leisurely drive down the garden path of the story, when BAM – right in the middle it makes a u-turn and we are on the damn highway doing 90 miles an hour (commonly referred to as a plot twist). Sweet Mother of Mercy!There is not much to say without the risk of giving up some detail that’s best left secret. Soooo many time I wanted to just take one little peek at the end to see what happens to Nick and Amy. But I di"}, {"Review": "The first person narrative meant being in the thoughts of 2 very sick people the whole book and it left me feeling yucky. The author portrayed the minds of sadistic, narcissistic sociopaths making it a very dark book. And for some reason, I actually didn't find anything that happened a surprise. That made the story boring which may also have been because I didn't like or care about either of the unrepentant, unenlightened, and self absorbed characters. I just couldn't relate. Even getting some b"}, {"Review": "Quite simply, this is one of the best novels of the year. It's a thriller in the best tradition of Alfred Hitchcock and layered with brilliantly written characters; it's the kind of book that's nearly impossible to put down. The surprises and twists keep the reader guessing up until the final page, and my first thought upon finishing the novel was that I wanted to read it a second time."}, {"Review": "Oh, COME ON.Everyone (and I do mean EVERYONE ) loves this hateful book? Kind of makes me weep for the future. It's not even all that clever. It must be the depravity of it all. Suckers.AND, If I ever read the words *fucking bitch* again it will be too soon. "}, {"Review": "3 1/2 stars.This is going to be a hard review to write because I feel so conflicted about my final rating and just how much I actually liked this book. For one thing, I think the second half is a big improvement on the first half and, though this is my least favourite book by Ms Flynn, I can see in some ways why other reviewers see this as her strongest work.Let me ask this question: is it possible to be objective when writing a book review? Can a book ever be objectively \"good\", even though som"}, {"Review": "4.5I'm never getting married- I can't risk this"}, {"Review": "***MORE MOVIE NEWS*** Gossipy sources say that Neil Patrick Harris will play Amy's creepy ex, Desi, and Tyler Perry will play Ben Affleck/Nick's scumbag lawyer. If this thing isn't a blockbuster, I'll eat my hat.***UPDATE 7/25/2013***Amy Dunne's role in the film offered to Rosamund Pike, whoever she might be. Good role for any actress as it's a potential star-maker.***GONE GIRL CUPCAKES********UPDATE 3/26/2013*****See bottom of review. I think I need to re-think this oppositional review.***UPDAT"}, {"Review": "Marguerite Yourcenar wrote long ago that \"the mask, given time, comes to be the face itself.\" This can work for good or bad, but the more hideous the secrets, the more carefully that mask is constructed. So what if you discovered after five years of marriage that you'd only seen the mask, and never the real face of your spouse? Once those dark truths were revealed, could you stay married to that person? Knowledge is power, and never more so than in an intimate relationship.What if your spouse kn"}, {"Review": "(Original image credit: Kate Beaton)That was my immediate reaction after finishing this book. Pretty clearly that's not how it ends. It doesn't END that way. Yet, when I tapped Shadow's screen to turn the page (Shadow's my Nook's name, FYI) - there were only acknowledgements. And then I thought about it... I gave it just a few minutes' thought, and I decided that I thought the ending was appropriate. Fucked up? Oh my, yes. But fitting too, in a way. We do dig our own graves, don't we? This book"}, {"Review": "*************** Summary: I loved it while despising it, how 'bout that? Oh dear, I'm caught between realizing that this is one of the most inconsistent plot-and-characterization-wise books I've read in a long time - as well as one of the most entertaining stay-up-all-night-to-finish books.  Hmmmm.This book unapologetically flew through the bestsellers and awards lists like a hurricane last year, being praised for its dark nature and unexpected twist and intricate plot (a.k.a. the reasons why I a"}, {"Review": "Gone Girl is astounding. It is a gripping story of the courtship and marriage of a narcissist and a sociopath. They appear to be experiencing the normal setbacks of life during our recent financial meltdown: job loss, relocation, mounting debt, family illness etc. etc. It is easy to identify with them individually, which makes it harder to know who to root for when the wife disappears on the morning of their fifth wedding anniversary and the husband becomes the prime suspect. Neither seems to be"}, {"Review": "Read for Popsugar's 2018 Reading Challenge #41: A Bestseller From the Year You Graduated High School re-read March 2018yup, Nick and Amy are still two of the most fucked up characters I've ever had the pleasure of reading about. and I still love them.------------------------------------------WELL. HOLY SHIT.This book was insane. I was sort of spoiled by GIFs on Tumblr previous to reading the book, but I WAS STILL SO INTO IT. The ending was not at all what I was expecting, and I like that. (view"}, {"Review": "Mr. PeanutThe Seducer/The Conqueror/The DiscovererThreatsand now this.all of them are amazing stories about a wife gone missing or murdered, and the husband's journey through grief and suspicion with a bevvy of unreliable narrators. i'm actually not some sicko who is drawn to stories of murdered women, but these happen to be exceptional books that are strikingly similar in the way they unspool, and - yeah - they all have the same central action.every single one of them is a twisty-turny narrativ"}, {"Review": "Gillian Flynn hands you a little black box. \"What's this?\" you ask. \"Just open it,\" she says, twitching an eyebrow at you. Just a tiny movement, a gentle follicular nudge. \"Is this a puzzle box?\" you ask, wary. \"I keep seeing people playing with ones just like it on the train. There is a huge stack of them at Target. These aren't really my thing.\"\"I know, but this is a really tricky one,\" she says. \"I want to see if you can figure it out.\"Now it's a challenge. She has challenged you. Your ego is"}, {"Review": "Twisty like a pretzel, dark like unadulterated chocolate, and as compelling as a twisted car wreck, this thriller delivers! On their fifth anniversary, Nick and Amy's marriage implodes when Amy goes missing and Nick is hardly as distraught as he ought to be. Too much plot summary would detract from the pleasure of reading the book for yourself. Suffice it to say, this is one psychological mind bender accompanied by witty, incisive, laser beam writing; if you like that type of thriller, this one"}, {"Review": "You know those books that are a complete chore to read? The ones you'll do anything -- playing Words with Friends, cleaning the house, scrubbing toilets -- to avoid reading? Then a few weeks go by and you've gotten dumber, because in doing your damnedest to avoid reading said book, menial tasks have turned your brain to mush?Yeah.Gone Girl has gone to my \"sucked\" shelf. Look. If I want to hear about bored, unhappily married people, I'll talk to my married friends or delve into something by a cap"}, {"Review": "**WARNING: THIS REVIEW CONTAINS EXPLICIT LANGUAGE, CAPS LOCK OF RAGE, AND OCCASIONAL SPOILERS (we will let you know when spoilers kick in). You have been warned.**Thea’s Take:(There will be spoilers, but I’ll give you warning when they kick in.)I started Gone Girl knowing only these things.Gone Girl is:A. One of the bestselling books of 2012, recipient of multiple awards from critics and readers alike, across genres and categories.B. Gillian Flynn’s latest novel, with a rumored HUGE twist somewh"}, {"Review": "*5 Stars!*While it feels a bit off referring to this deeply deranged book as a \"fun read\", that's exactly what I'm gonna call it. Because for the time spent reading, this book entirely owned me. My focus, my world, my thoughts, were swept away by these insanely unrivaled characters and the darkness of their story. And the suspense of it all left me in a constant state of guessing — straight to its twisted end.Gone Girl is not a happy, feel-good love story with just a few bumps in an otherwise si"}, {"Review": "I've been completely fangirling over Gillian Flynn since her debut Sharp Objects six years ago. It remains one of my all-time-favorites, along with Flynn's sophomore novel Dark Places. No one writes the inner workings of warped and damaged human psychology better than this woman. With complete conviction I place her in the same category alongside the likes of Flannery O'Connor and Shirley Jackson. Flynn has a devilish, uncanny flair for creating memorable characters and twisty plots that drive d"}, {"Review": "This book was such a mindfuck and I've never read anything like it before."}, {"Review": "5 starsThe thrill is real. Had huge expectations about this book and they were all met. Exciting story, wonderfully written, had me at the edge of the seat all the time.Was it worth reading? - Heck yes.Do I recommend it? - Of course. A million times.Would I read it again? - Definitely."}, {"Review": "This book is featured on this week's Throwback Thursday @ https://readrantrockandroll.com/2017/...Nick and Amy Dunne are preparing to celebrate their 5th wedding anniversary when suddenly, Amy disappears and as the investigation unfolds, it appears that the marriage wasn’t as perfect as it seemed. Others begin to wonder if Nick could be the perpetrator and the book will leave you wondering what really happened to Amy throughout.I loved this book, and honestly, I couldn’t predict what was going t"}, {"Review": "So I decided it would be a little fun to put my own spin on this by casting Gone Girl in the following way:Amy Poehler as the sociopathic Amy Dunne.Nick Cage as Nick Dunne.And Desi Arnaz as Desi Collings.In the beginning Amy manipulates the reader with her diary entries into thinking:But halfway through the reader discovers:While Nick does wrong by cheating on his wife, Amy decides to stage an elaborate scene to teach him a lesson and turn the public on him--even go so far as to write years of f"}, {"Review": "Okay, here is the thing. I like dark and twisted stories. The twisted plotlines and authentically scarred characters pull me and I am hooked. Gillian Flynn wrote such a story line very well in Sharp Objects. That story is messed up but beautiful all the same. Donna Tartt and Tana French are other authors that know how to write about those dark places in the human soul. But it isn't just darkness in these stories that I love, there is also intensely developed characters and character driven plot"}, {"Review": "If you asked me at the halfway point what I thought I’d rate this book, I would have told you five stars with absolute conviction. And I would have rated it thusly, had it maintained its momentum throughout. Sadly, it did not. The first two thirds of this book were brilliant. I’m talking world class, fuck, I wish I could weave a plot so intricately, type of brilliance. But then I got to the “big reveal” (cue gasps) and it soared too close to the sun. Its wings caught fire, and I spent the last t"}, {"Review": "Pardon my French but \"Gone Girl\" by Gillian Flynn is a fucking masterpiece! Twist after twist after twist. You think the plot is going one way, and then it spits venom in your face, gives you a heart attack, and just for the hell of it, turns itself into a three-headed monster just to save face. Whew! I know a lot of people gripe about the ending, but I thought it was 100% accurate of Nick and Amy's sick and desperate relationship. Flynn's writing is deliciously wicked. Her prose is dark and dem"}], "ID": "19288043", "Name": "Gone Girl"}