{"Genre": "Crime", "Reviews": [{"Review": "*Trigger Warning, book contains very explicit content and violence.*Inspired by one of the busiest seaports on the West Coast in the US, Townsend was a well-documented hot spot for smuggling in the late 1880’s. This makes it a perfect setting for a historical fiction novel with such a daring plot. Amidst the dirt of the trade, the characters are edgy, the scenes are explicit and the atmosphere reeks of dark, pungent alleys, infused with betrayal, espionage and murder. From the Author’s Note:San"}, {"Review": "So, I’m a fan of mysteries and historical fiction. The idea of a mystery taking place in the 1880s sounded right up my alley. Add in a female protagonist and I was all set to like it. Unfortunately, it didn’t engage me the way I hoped. The writing was as dense as pea soup. Alma Rosales goes undercover as a man to find who is stealing opium from her boss, Delphine, who is also her former lover. But I really didn’t take an interest in Alma. I had trouble buying into her ability to pose as a man. S"}, {"Review": "I was pleasantly surprised by Katrina Carrasco's The Best Bad Things which I picked up through NetGalley. I thought the premise behind this story was new and refreshing. Set in America's Gilded Age, The Best Bad Things illustrates how women were treated during that time, the juxtaposition of poverty with the onset of industrialization. Carrasco takes advantage of these happenings highlighting the building of the Railroad system and the opium epidemic within the context of the story. The main cha"}, {"Review": "I was so excited to read this one, but it really ended up being a let down for me! I couldn't finish it. I found the writing really dense and dry and I was just so bored. Apparently fighting and opium smuggling are not my thing. A lot of people clearly had a much better experience, so I'd say give it a try if the blurb sounds interesting, but this one was just not for me.*I received a free copy of this book from NetGalley in exchange for an honest review."}, {"Review": "A vivd cast of characters, a strong decisive style, and a burning tension throughout make The Best Bad Things a book I can highly recommend. Alma Rosales is a smart, savvy character who will not be forgotten any time soon. A great debut novel.Thank you to NetGalley, Farrar, Straus, and Giroux, and Katrina Carrasco for the advanced copy for review.Full review can be found here: https://paulspicks.blog/2018/05/09/th...Please check out all my reviews: https://paulspicks.blog"}, {"Review": "Washington Territory, 1887: Alma Rosales has been dismissed from the Pinkerton's Detective Agency for her questionable behavior and after a brief stint in California as a P.I., she's working for her former lover Delphine, the head of an opium smuggling ring.Disguised as a man named Jack Camp, Rosales infiltrates the local organization on the docks of Port Townsend to discover who has been stealing product from Delphine.  She manages to earn the trust of the crew and their boss, Nathaniel Wheeler"}, {"Review": ". : ☾⋆ — 3 ★ READ THIS REVIEW ON MY BLOG!!!https://bit.ly/2C22f0rARC provided from the publisher via NetGalley in exchange for an honest review (thank you Farrar, Straus and Giroux!!)The Best Bad Things follows Alma Rosales, a gender-fluid, half Mexican, bisexual Pinkerton agent in the late 1880s in Port Townsend, Washington. Alma, working undercover for her former-lover-turned-boss, infiltrates the local drug outpost disguised as a male dockworker in the hunt for stolen opium from a West Coast"}, {"Review": "A shape shifting Pinkerton operator in Port Townsend, before Washington became a state. Well written with much mystery and enough intrigue. Hopefully there will be more from this author in a series that promises originality and style."}, {"Review": "3.5 Stars. "}, {"Review": "This was not for me. Alma Rosales was a completely unbelievable character, and I couldn't suspend my disbelief. I wanted to love this book and the description attracted me mostly because of Alma. She isn't like anybody I've read about before and that appealed to me--I'd love to read more with gender fluid characters of color in a different book. But beyond the almost superhuman protagonist (she can fight anybody and miraculously heal!), I wasn't into the writing style or the violence, especially"}, {"Review": "The highest compliment I can pay this book is to say that it completely consumed my brain while I was reading it -- everything that happened in my day made me think of it, and I spent most of my waking moments at least 15% in its world. Everything in that world is distinctive and fully formed, from the environment to the relationships and the characters, and the comfort with which Carrasco addresses the complexities of gender is impressive and reassuring. So, basically: Better than Cats, would r"}, {"Review": "This book sounded like it was tailor-made for me. Female Pinkerton agent in pre-statehood Washington (Port Townsend, to be exact), AND she likes the ladies? I've never wanted Netgalley to approve me for a book than this one. It did not disappoint!While it has a strong mystery plot as the backbone, the real draw of this book is the main character (who is bisexual, as it turns out). Alma is one of the toughest protagonists I've read in a long time. Is Alma good or bad? Is she the law or a criminal"}, {"Review": "3.5 Stars Alma Rosales is a new sort of heroine. She’s smart. She’s brash. She’s a snoop and a spy. She’s daring, sharp-tongued and maybe a little too full of herself. Her self-confidence is both a blessing and a curse as she sets off on high-adrenaline historical fiction suspenseful thrill ride. A former detective for the notorious Pinkerton agency, Alma, fired but unwilling to give up the hunt, begins her work for a jasmine-dripped woman named Delphine. Alma goes undercover as a man named Jack"}, {"Review": "I received this from netgalley.com in exchange for a review. Alma Rosales is searching for stolen opium. Shifting between a lady and her male persona Jack Camp, she lies, cheats and kills to find what she is looking for.It was an effort to get through this, having to read over the previous pages to keep track of the story. The writing was okay, but the story and its characters were a struggle to follow. 2☆"}, {"Review": "This bloody, thrilling, mysterious book left me breathless and wanting more. It’s unlike anything else, a remarkable and revelatory debut tackling the intersections of gender, violence, lust, greed, and power against the historical backdrop of late 19th century Washington State in the age of mining, shipping, and opium smuggling. This novel’s protagonist resists gender categorization although many will likely attempt to put Alma Rosales and Jack Camp into neat boxes. Don’t fall for it. Stay in t"}, {"Review": "I came for a great read and I got a major motion picture in my head! Reading The Best Bad Things is like being plunged into a queer historical action-adventure movie, with the character-driven nuance of prestige TV—and literary fiction. To say that this novel pulses with life is as close to literal as can be; Katrina Carrasco takes us inside the physicality of her fearless, calculating, inimitable protagonist Alma Rosales to a degree I’ve rarely experienced before as a reader, and all without re"}, {"Review": "This book started off with a bang and I remember thinking, \"Oh man...this is going to be an awesome book.\" Sadly though, for me personally, things started to go downhill shortly thereafter and I could barely sustain enough interest to finish it. To be clear, I don't think this is necessarily a BAD book. There is some very solid writing in here. I think it just wasn't a match for me.The book does have a damn fine opening though. Lots of action and Alma/Jack is an intriguing lead character. I love"}, {"Review": "A novel set in 1887 in Port Townsend, Washington, starring Alma Rosales: ex-Pinkerton detective, current opium smuggler. Alma is newly arrived in Port Townsend, and is there on a mission. Part One: figure out who is the head of the opium game in town. Part Two: take his place. As you might imagine, this turns out to be far more complicated than she originally planned, and the plot turns on blackmail, murder, torture, bribes, backstabbing, moles, broken promises, fake interrogations, mistaken ide"}, {"Review": "This was one of final books I read in 2018, (well I listened to the audiobook, although I have also bought the book and will be reading it the traditional way very soon) but even before I finished it, The Best Bad Things shot rapidly to the joint top of my books of the year list. Everything about this book seriously excellent; the writing is raw and compelling, leaving me utterly spellbound from the outset. There's a broad cast of characters but it's not confusing, they're all so well created an"}, {"Review": "Hm. Some things are better than the sum of their parts, like the 2016 Super Bowl Champion NE Patriots. This book is the opposite. Everything is in place for a terrific historical suspense thriller – a compelling protagonist, a richly researched time and place, a dramatic plot with a lot of competing interests, beautifully written sentences and a fine ear for dialog, many good secondary characters. And yet, at least for me, this book was a bit of a slog. Honestly, if any of the above were NOT tru"}, {"Review": "Its easy to dismiss some of the violent, gritty periods in history as the product of excess testosterone and insufficient civilization. But the story of the women who chose to dress as men, and swagger their way through the early part of the century defies that explanation. Alma Rosales is a ruthless, ambitious ex-Pinkerton detective. She works as a man named Jack Camp. More than bisexual, Rosales/Camp seems to have no fixed sexual identity at all; she slips into either of her identities with ea"}, {"Review": "Who knew that sleepy Port Townsend could ever have been so exciting? This was compelling reading and I never considered putting it down, but this is a brutal book. There is a lot of sex, a lot of violence, and a lot of mixing of the two. If any of that bothers you, consider this a warning. The ending left a bad taste in my mouth and I'm still struggling with my overall rating for this. Very interesting heroine, but not sure that I would read another. On the other hand, it looks like a next book"}, {"Review": "Queer bisexual mystery of my dreams, where have you been all my life?! I love queer, subversive characters. Gritty mysteries. Well-written sexual tension. Yet I've never gotten all three in one book -- until The Best Bad Things. I found myself constantly delighted by how Carrasco's characters transgress the social norms we (or at least I) usually assume were in place during the late 1800s. As a queer person, it was so incredibly refreshing to read.The book really picked up for me about halfway t"}, {"Review": "108 pages in but I wasn't hooked by the characters or the plot. The story features a woman who goes undercover as Alan to sniff out the snitches in 1870s west coast. I had trouble following all the characters and who was double-crossing whom. After reading a few other reviews that shared the same feelings I had, I decided to put this book to rest, at least for now. "}, {"Review": "I received this book as a Goodreads Giveaway, and I would like to thank the publisher for sending me a copy. Carrasco's historical novel, thickly plotted and populated with disreputable characters, tells a story of violence and backstabbing amid nineteenth-century America's western smugglers. Though rich in historical and sensory detail, the action and characterization of the characters often comes over the top, making for a story not fully engaging. "}, {"Review": "Probably 3.5 stars. Gritty & gripping. (Sometimes too gritty.) I enjoyed the feminist bent to the story, but that piece of it didn't feel fully authentic in a few spots. Could have been trimmed a bit to make the story tighter. The atmosphere tied in well with other books I've read such as By Gaslight and A Moment in the Sun. Overall, a rip-roaring read. "}, {"Review": "A wild, violence-filled ride full of the most colorful characters and a real sense of how wild the wild west used to be. THE BEST BAD THINGS suffers from being too: too gritty, too in your face, too over the top, even as Alma is a fascinating character I'd be interested in reading more of."}, {"Review": "DNF @ 10%"}, {"Review": "The premise is great, but the choppy style of the writing was offputting."}, {"Review": "Rating: 4.5 starsThis book is bursting with personality. You know when an author merely tells a story with their writing? In The Best Bad Things, Carrasco's writing is the story. This book is fierce, loud, and unforgettable. The characters are not cardboard cutouts. Our main character (Alma) is a sexually driven, bisexual, hispanic, kick ass, heroine that defies ALL molds set for women in historical fictions. We have Delphine, a beautifully mysterious Head of All Operations, all around boss with"}], "ID": "37941735", "Name": "The Best Bad Things"}