{"Genre": "Crime", "Reviews": [{"Review": "Jack is back! After his last outing this was much in doubt. This hard drinking, Xanax popping, ex-garda, attracts violence like no other. Here he actually saves a man from drowning, a man bent on killing himself. He actually did a good deed, but the old adage, no good deed goes unpunished, is so true here, as he finds out much to his dismay. He will take another personal hit, and this one is hard to get over. People who friend Jack, seem to have short lives, and so it will prove again.With his t"}, {"Review": "For those not familiar with ‘The Jack Taylor Series’ by Ken Bruen a bit of back story is in order. Taylor is the creation of Ken Bruen, starting back from the year 2001. With 14 books now released in the series to date, the series is about the protagonist ‘Jack Taylor’ who is a cop turned private eye in Galway, Ireland.The series begins with “The Guards” released in 2001, where Jack is initially a member of the ‘Gardaí’, which is the Irish equivalent of a police force. Sincere to his job in the"}, {"Review": "No one does Irish Noir like Ken Bruen, brutal, violent, lyrical with a musical quality in the prose, often sharp and staccato set in beautiful Galway, although it's underbelly of crime and horror once again slams into the broken but well read PI Jack Taylor's life. A shock that Jack is still of this world and for once, happy, in a relationship with Marion, whose son Joffrey is not so taken with her beau. This is not going to last long, this is Jack after all, and Bruen is not going to let this s"}, {"Review": "3.5 stars rounded down to 3.Thanks to Grove Atlantic for sending me this eARC through NetGalley. This is my first book in this series, but I have watched several of the tv adaptations. I would have understood it better if I had read the previous books in the series, but it worked ok as a stand alone. Jack Taylor is an ex Garda(police) now working as a PI. He is approached by a man who wants him to find out who murdered his 2 sons. Jack is an alcoholic and bitter about his lot in life--a failed m"}, {"Review": "EXCERPT: I turned very slightly, moved my face close to supercop, whispered, \"I'm going to shoot him on Friday, at about three in the afternoon, so you can be there to make the big arrest.\"He moved back a step. \"Are you serious?\"I pondered, then, \"Maybe it's the drink talking.\"Debated. Added, \"Could be Thursday. I'm lousy with dates.\"ABOUT THIS BOOK: Ken Bruen has been called \"hard to resist, with his aching Irish heart, silvery tongue, and bleak noir sensibility\" (New York Times Book Review). H"}, {"Review": "After finishing The Emerald Lie, I wasn’t sure if Jack Taylor would be with us much longer. Yet here he is…bleary eyed & bushy tailed. But there’s something odd about him. It’s like he’s…*gasp*…happy. He’s cut down on drink & cigs, quit the PI biz & has a new woman in his life. Initially the only fly in the ointment is her pompous 9 year old son. But who are we kidding? This is Ken Bruen & he seems to revel in putting Jack through the ringer. In the prologue, we watch as teenage"}, {"Review": "3 hard to rate this one starsMy reviews can be seen here: https://wordpress.com/post/yayareadsl...Jack Taylor is not one of the characters I would like to know. Seriously, he is one messed up dude, drinker, drugs, and profanity seem to be his mantra. Of course dealing in the underworld he inhabits would definitely make more a bit abrasive right? This seems to be the fourteenth book in the series and I feel as if I am a bit behind understanding Jack as this is my first book about him and his esca"}, {"Review": "Marilyn Stasio of the New York Times Book Review calls author Ken Bruen “hard to resist, with his aching Irish heart, silvery tongue, and bleak noir sensibility.” How right she is. And 13 turns out to be Ken’s lucky number. Because his baker’s dozen in the Jack Taylor crime fiction series — known as Ireland’s most distinctive — is an absolute winner. Riveting, hard-bitten and darkly funny, IN THE GALWAY SILENCE makes you feel anything but ... you want to shout its raves o'er the roiling waves of"}, {"Review": "“The Irish can abide almost anything save silence.”A few paragraphs into a new Jack Taylor novel and you hear the musicality and fall into the familiar rhythms of Ken Bruen’s prose. It is distinctive, like listening for the first time to your favourite band’s new album, you instantly the instrumentation and look forward to new tunes. Nobody in crime fiction writes like Ken Bruen. It is not just the words he uses, it is the way he puts them on the page.Ex-Garda, Jack Taylor is a violent and poeti"}, {"Review": "I received a copy of this book from the publisher through NetGalley to read and review.IN THE GALWAY SILENCE by Ken Bruen is the 14th book in the Jack Taylor series, and opens with Jack doing well and in a relationship with a woman named Marion that is giving him much to be thankful for; with the sole exception being her nasty young son who goes out of his way to antagonize Jack and sabotage his relationship with the mother at every turn.Jack is happily unemployed, and doesn’t wish to take on an"}, {"Review": "Jack Taylor has to be one of the most fascinating characters ever written. I NEVER get tired of following Jack through the chaos that is his life. Ken Bruen has never failed to deliver anything less than stellar when it comes to the Jack Taylor series. THE GALWAY SILENCE is no exception."}, {"Review": "Irish noir!Even when things are looking up it seems like Jack Taylor's only way is down. When he rescues a suicide from drowning his life moves in a different direction, including a competitive killer who plays one-up-manship with Jack. A bleak Irish detective novel complete with wonderful stereotypes that reek of Jameson Whiskey and Irish fatalism is served in large doses.Staccato presentation leads from one scenario to another, with Jack giving the reader a sotto voice, often self deprecating"}, {"Review": "Ken Bruen does it again - number 14 in my favourite series. Jack Taylor, ex guard, no saint, Irish noir that is at times hilarious, written in Bruen's inimitable style with paragraphs that more closely resemble verse than prose. It's original, unusual and continues to entertain as it appears that Jack might have at long last found contentment. Still loves the Jameson and still dabbles in uppers, but he has a new girlfriend, a new apartment with glorious views and little sign of trouble on the ho"}, {"Review": " Although I have seen the TV series, this is the first book of his I have read. It's like being on a roller coaster without having a chance to catch your breath. Perhaps if I had read others in the series, it would have been easier to follow but it jumped around so much that it was hard for me to keep up. Jack Taylor has many problems, more than one person should have and his use of drugs and alcohol don't help matters. This involves a secret group of bad people killing others and Taylor trying"}, {"Review": "Jack is back. He’s bought an apartment. He has a new lady in his life and seems to be happy. The only little fly in the ointment is her obnoxious nine year old son Joffrey who gives Jack no end of trouble. But happiness and Jack don’t go together and he is still his old pill popping, drinking, ill humoured self. The book is full of dark humour and twists and turns with many characters out to get Jack. I like that Bruen puts in references to today’s news and has no trouble telling us how he feels"}, {"Review": "If you like mysteries that are dark, bleak and, at times, humorous, the Jack Taylor novels by Ken Bruen in general, and In the Galway Silence in particular, are just the ticket. Jack Taylor is his own worst enemy, as he attempts to solve a double-murder while managing his often chaotic personal life, with his usual Irish charm and blarney. Where Jack goes, confusion follows. Ken Bruen's prose quite often reads like poetry and the staggered style loosely imitates Jack's human condition as he goes"}, {"Review": "I want to thank NetGalley and Grove Atlantic for providing me with a digital copy of this bookThis is my first read of a Ken Bruen novel (Jack Taylor series #13) so I must admit I am a bit of a neophyte when it comes to following Bruen’s style of storytelling. How it compares to other books within the series is for others to say, but for me it is a difficult novel to read. The discourse is rapid and choppy and at times difficult to follow.Jack Taylor says he is happy, although his drinking and d"}, {"Review": "Ken Bruen deserves his own category. Rather, Jack Taylor, his angst ridden, retired P.I. who has seemingly found stasis in his beloved Galway, defies cliched norms. While let's hope the events of Bruen's life don't coincide with those of Jack, I can't help but surmise that he shares with his alter ego the disgust with which he perceives the world of 2017. Beginning with revulsion at the current occupant of the White House, he notes with horror the unfolding of news from, among others, mass shoot"}, {"Review": "No one writes like Bruen. This is a one sitting book and as usual the worse possible thing(s) that can happen to Jack do. Honestly, I don't know how he get's up each day... and he has horrible taste/luck with women. Maybe Jack should leave Ireland for good ...."}, {"Review": "This is the 13th outing for Jack Taylor, disgraced ex-Garda, heavy drinker, all round misanthrope with a heart of gold - or maybe butter. Now a private detective who gets results, usually by default. Set in Galway on the West coast of Ireland, this city on the edge of the sea before it starts rolling away to America, has much to recommend it as a location for crime fiction. A small city, with an excellent university, myriad bars and restaurants, and tourism an important part of its economy, it o"}, {"Review": "Excellent. Brief is on a long roll. Each book more terse, elliptical, and emotional than the last. Jack Taylor, Bruen’s series hero/anti- hero here faces his demons, internal and external set against the back drop of a decaying Ireland and world. Tense, well written, and thoughtful- crime novels don’t get any better."}, {"Review": "Ken Bruen gets better and better with age. One learns what to hear, what to watch and what to read along with a great Jack Taylor storyline in each novel. A little recap of characters from the past is a nice touch along with a new nasty piece of work makes this one of Bruen’s best. "}, {"Review": "I have a spiral notebook dedicated to Ken Bruen where I take notes on his books. I don’t write down the plots, which are memorable in themselves. Rather, his Jack Taylor novels (and a number of his other works as well) contain an encyclopedic range of quotations, reading suggestions, music references and other pop culture nuggets that are all worth seeking out and sampling. Regardless of how well-read you may be, he will lead you to something new and startling.Bruen has a distinctive style, comp"}, {"Review": "Další anti-detektivka od Kena Bruena, spíš sled vztekle depresivních myšlenek a zuřivých činů než kriminálka. Ale stejně, i když mě to hladí proti srsti, i když jsou postavy vyvázány z logiky a jsou spíše unášeny náhodnými impulsy, čtu stále další Bruenovy knihy. Ta nikotinem prosáklá nervnost a vztek mě prostě přitahuje. Nehledě na strohý styl. Byť jsou si jednotlivé knihy hodně podobné. Taylor dostane případ. Taylor chodí po hospodách a chlastá. Taylorovi vezmou případ. Taylor chodí po hospodá"}, {"Review": "IN THE GALWAY SILENCE. (2018). Ken Bruen. **1/2.It has probably been 10 – 12 years since I last read a book by Bruen. I used to be a dedicated fan of his works, then suddenly I wasn’t interested anymore. When my wife came home from the library with a copy of this, his latest book, I felt that I owed Bruen a read to see if there was anything different about what has gone on over the last several years. Bottom line: Bruen is still writing the same non-book over and over. I’ve ordered several of hi"}, {"Review": "Ken Bruen's 'In the Galway Silence' is the 19th book in the Jack Taylor series. It is as fresh a read as I could have hoped for. Considered an action packed mystery, it is truthfully its own genre, one that only could have been conceived and executed by Bruen, who holds a doctorate in metaphysics. If he had studied epistemology, I don't think the book would have been this good.In case you're wondering, Jack still drinks way too much, has trouble with women, and has naughty surprises coming out o"}, {"Review": "This is the 14th book in the Jack Taylor series. In this outing, Taylor still drinks too much and continues taking Xanax and has a new woman in his life. On the surface his life seems to have settled. It doesn’t last long, just long enough for a wealthy Frenchman to find him and ask Taylor to investigate the murder of his twin sons. Added to that, he stopped a man from committing suicide, who, in turn, became a confidante passing on information on the murder case. There’s also a mysterious perso"}, {"Review": "Bruen has a unique writing style that takes, for me at least, some getting used to. This is only the second of his books I’ve read, and the first Jack Taylor, although I have seen the JT television series. Because of the way it was written, with incomplete sentences and sketchy details, I was able to sail right through it, but I realized after finishing it that the abbreviated prose hid a much deeper story. But you have to read between the lines. The review says that Jack is enjoying a period of"}, {"Review": "4.5 definitely. Even if I *might* have been mad enough at one point to slam the book closed and throw it down (I won't give away when...) I'm still madly in love with Ken's unique writing style, and ability to make you root for what some might view as \"the bad guy\". His poetic leanings, and use of pop culture references are what keep me waitin' and anticipatin' each new offering. Thank, good sir, for yet another wonderful read!"}, {"Review": "This is the latest in the fantastic Jack Taylor series of books and I absolutely loved it. Some readers have said they struggle with the style of writing but for me (especially having watched the excellent tv series) it is just like it is Jack thinking out loud and the narrative flows beautifully. There is the main part of the story running through (the murders by an ex-army killer for hire with his own problems) with smaller sub plots alongside, and as usual ex-Garda turned private investigator"}], "ID": "39218054", "Name": "In the Galway Silence"}