{"Name": "A Serial Killer's Daughter: My Story of Faith, Love, and Overcoming", "Image": "https://images.gr-assets.com/books/1529215326l/38915935.jpg", "Reviews": [{"Review": "A Serial Killer’s Daughter: My Story of Faith, Love, and OvercomingI approached this book with my mind and feelings completely open and was really surprised how much I came away with from it. Kerri Rawson is fresh and likable as she tells her story of growing up in her family in Kansas. She describes it as just a totally normal, semi-dysfunctional family who works, goes to school, has vacations. Pretty typical family, it seems. She comes across very real as she shares her story and I find it like reading something a friend could be relating about what a really awful period in their life was like. The situation is just so unimaginable, and I just felt horrible for Kerri and her family, and all of the families.It gets a little bit repetitive on a few things, the spiritual theme, and other items that come up repeatedly perhaps after a while, but if that helped her get through all of what she describes well, more power to her. What I didn’t expect were some of the stories of situations she ended up in growing up with her dad that turned harrowing that she shares. In hindsight, she, of course, sees them differently after she learns of his killing past. I found this book better than I expected and well laid out. I’m glad I purchased this very heartfelt book, as it told so much more than just the BTK aspect of the family. They became real people to me by the midst of the book, not just headlines, due to her writing.Also on my BookZone blog:https://wordpress.com/post/bookblog20..."}, {"Review": "It is a serious and terrible sorrow when others must carry the burden and fall-out of someone else’s criminal acts. “The Serial Killer’s Daughter: My Story of Faith, Love, and Overcoming” (2019) fortunately is a rare and highly articulate memoir written by Kerri Rawson. Rawson’s father, Dennis Radner, the self-identified BTK, ruthlessly murdered 10 people, (2 victims were children) in Wichita, KS. (1974-1991). Radner is serving 10 consecutive life sentences for these crimes in the Kansas El Dorado Correctional Facility.In February 2005, Rawson called her husband Darian to let him know that a man was outside their Michigan apartment building clearly looking at their window, she was frightened, until the man identified himself at her door as an FBI agent. Unable to call her mother, or other family members, she learned the horrific truth that her father was apprehended for the notorious BTK crimes that for decades had terrorized residents of her Kansas home town. Her seemingly loving devoted father was a married family man, a military veteran, a dedicated church official and Boy Scout leader-- the BTK monster committed multiple heinous murders, he was believed to live in the community undetected for decades, leaving clues and taunting the authorities. Rawson’s life would never be the same after she learned her father’s vile and sickening truth: that he confessed to the BTK murderers. The shock and terror of her father’s crimes would haunt Rawson, her family, friends, associates, and community for years afterward. Rawson experienced symptoms of severe anxiety from trauma, depression, and PTSD.Although Rawson suffered from occasional night terrors as a child, her life had been normal and ordinary. Enjoying a close relationship with her parents; she did well in school, and went camping and hiking with her father and brother. In her teens, she turned to her Christian faith and spirituality to sustain her in grief after the death of her beloved cousin, Michelle (1996). Many parts of the book read like a novel, slowing the storyline down somewhat, yet there is no correct way to tell a story like this. Rawson was especially careful to tell only her story, there is little written about her mother Paula, who was granted a quick divorce from her husband (m.1971- 2005) without the customary waiting period. Unable to sell the family home, an unidentified buyer bought the property and the house was torn down. Several years would pass without Rawson writing to her father as she engaged the necessary services of a specialized trauma therapist. Rawson also wrote about avoiding the shadows of silence and shame, of further spirituality, forgiveness and mercy, as her courageous journey of healing moved forward. Rawson graduated from Kansas State University, she and her husband Darian live in Michigan with their two young children. ** With thanks and appreciation to Thomas Nelson Books via NetGalley for the DDC for the purpose of review"}, {"Review": "I've grown to love what memoirs can reveal about our shared humanity when the author is willing to dig deep. True crime, on the other hand, has always given me nightmares. Enter the true crime memoir. It turns out I love true crime memoirs! When super creepy, criminal acts are filtered through the very personal, introspective lens of a memoir, I can handle it. I can stop covering my eyes. I can peer a little more closely into the depths of humanity.Kerri Rawson's astonishingly candid book about learning her beloved father had been leading a double life as a serial killer her entire life is the mother of all True Crime Memoirs. It touched me to my core. I'm all for the \"complicated father-daughter-relationship\" memoir, and it doesn't get any more complicated than \"my dad is a serial killer.\" What I love about this book is how she fully explores the heart's confusion around knowing someone's a monster yet loving them anyway. She's so honest and pure in these moments, and her voice truly moved me.I also really appreciated the thread of dark humor that she weaves into her story. Being able to laugh at your pain is such a hallmark of surviving crime, trauma, and abuse, and Kerri Rawson has all that in spades. Even in the darkest moments of her story, she tosses out unexpected one liners that endeared me to her even more. She's funny, and it turns out she's also a very talented writer and storyteller.The first half of the book moves a bit slowly as she describes her family's life \"pre-BTK,\" as in before anyone knew about her dad's double life. But this part of the story still has lots of payoff as it establishes the close relationship she had with her dad, as well as lays the foundations for her religious beliefs that would ultimately see her through her darkest hours. When she finally gets to \"after-BTK\" about halfway through the book, the story accelerates to lightning speeds, and I had to give myself a few little breaks only because it had gotten so intense.Even though the cover screams \"true crime,\" I hope this memoir will find a wider readership, as I truly loved it and found it to be a deft and moving account of a life that most of us can hardly even begin to imagine."}, {"Review": "I really wanted to LOVE this book, because I love memoirs and true crime most of nearly any genre... but I just didn’t love this book. There was too much born again Christian ideology in this book that felt just as alienating on the page as it does in life. However in Rawson’s defense, if there is ever a time to look to forms of fundamentalist faith for meaning I suppose it is when your dad is a serial killer and you’ve been traumatized to the point where you really need a close personal connection to anything good whatsoever."}, {"Review": "This is the introduction to the book:On February 25, 2005, my father, Dennis Lynn Rader, was arrested for murder. In the weeks that followed, I learned he was the serial killer known as BTK (Bind, Torture, Kill), who had terrorized my hometown of Wichita, Kansas, for three decades. As he confessed on national television to the brutal killings of eight adults and two children, I struggled to comprehend the fact that the first twenty-six years of my life had been a lie. My father was not the man I’d known him to be. Since his arrest, I’ve fought hard to come to terms with the truth about my dad. I’ve wrestled with shame, guilt, anger, and hatred. I’ve accepted the fact that I am a crime victim, dating back to the days my mom carried me in her womb. I no longer fight the past nor try to hide it. It just is. It happened and it’s terrible. Terrible to dream about, terrible to think about, terrible to talk about. Incalculable loss, trauma, emotional abuse, depression, anxiety, posttraumatic stress—these things leave scars. I’ve struggled with forgiveness, fought for understanding, tried to put the ruptured pieces of my life and my family’s life back together. It’s an ongoing battle. But hope, truth, and love—the things that are good and right in this world—continue to fight through the darkness and overcome the nightmares. I am a survivor who has found resilience and resistance in faith, courage, and my sure stubbornness to never give up.That quite sums the book up in a quite full-rounded way. It's obvious to me that the author has suffered—and suffers—immensely at the hands of her normal father, who is also the serial-killer Dennis Rader, known as BTK.One of the absolutely best things about this book, is the author's ordinariness, or rather, her being who she is; this book does not suffer from the sensationalism (in spite of the book's title) that usually marrs autobiographies that have been spruced up to gallant or even evade the truth, in service of tabloid fodder. She writes about her usual days before knowing her father's BTK, as in this paragraph:In January 1974, Dad murdered Joseph and Julie Otero and their two youngest children, Josie, age eleven, and Joey, age nine. The three older Otero children found their family’s bodies after walking home from school.Another powerful stylistic trait throughout the book, is the author's jumps through time, even in the same paragraph at times, giving way to a kind of stream-of-consciousness feel. Still, most of the book is very coherently written:Mom found comfort in the chime that went off in the hospital right after Grandpa died. It meant a baby had been born at almost the exact moment my grandpa passed. Mom told me later that Dad had wept over his father’s body. Wrecked with grief, he had walked hunched over down the hospital hallway. She said, “I don’t think your dad had ever sat beside someone who died before.” When I heard these words, I was filled with sorrow, picturing Dad next to Grandpa’s frail body. Dad was grieved over the loss of his father—he had loved him, very much. It’s impossible for me to reckon that with Dad taking the lives of ten innocent people.There are a lot of Bible references throughout the book, and still, it's obvious to see that the author has accepted help from other sources, e.g. therapy and family members.There are several mind-boggling episodes in this book, unlike most serial-killer books that I've read (and I have read quite a few), especially when the author reveals herself as human in all kinds of facets, as here:Mom said, “Did you know I was teasing him this fall that he spelled like that guy—BTK?” I grinned a bit at this, trying to stifle a laugh, as I checked Mom’s face.She was trying to hide a smirk, too, and when our eyes met, we both started giggling. It felt good to laugh.People died. I’m not supposed to be laughing ever again.“I asked your dad once why would BTK use a cereal box to communicate with the police—like it was reported in the news. He said, ‘Cereal—like a serial killer.’”I didn’t know whether to laugh or cry at that one.“Where did he get those boxes? We don’t eat that type of cereal.” And that’s what my poor mom is wondering.Mom continued: “When I got interviewed, they asked what was behind our hidden door. I asked, ‘What door?’ They said the one in the kitchen behind the table. I said, ‘You mean the door the dryer is behind?’” I snorted, tried to contain it, and gave up, laughing out loud.Mom and Grandma followed. “The police asked me about safety-deposit boxes—I don’t know why.”Later, we learned that Dad used secret ones to store BTK items. Mom’s face turned serious, her voice lower.“Early last year, there was a special about the thirtieth anniversary of the first murders, what happened to the Oteros. It was on TV. Your dad watched it.” Oh. I didn’t know he had watched it.The letters from and to Dennis Rader are also quite mind-boggling. This one from the author to her father:We weren’t very thrilled to see your written interview with the local TV station. We also didn’t like seeing your poems and letters on TV. We know you can and will do what you want to do, but we would really appreciate it if you could control that stuff better. Any publicity is bad for the family, especially for the ones that live in Kansas.Brian and I have the grace of living in areas where we’re not known; and that’s been a blessing these last three months. Mom and everyone else doesn’t have that grace. We’re asking you to stop this type of communication on behalf of us. I have shared this view with your lawyers, and they were going to talk to you about it.Mom is having the hardest time with everything that has happened. Brian and I share a different kind of bond with you than she does. It is easier for children to love their parents unconditionally (and vice versa) than it is for spouses. For her own sake, she might need to start distancing herself from you, and you’re going to have to try to understand that. She’s stronger than we all thought and she’s going to get through this, just as the rest of us are. We refuse to let the bad stuff win. Mom shared 34 good years with you, Brian 29 years, and me 26 years. We’re trying to hold on to that—not let the other things define you or us. You should not let that define you either. You’re stronger and better than that.I love you and I know you’re trying to do the right things. I’m truly sorry your life has turned out this way. I want you to know you’re loved and cared for. You’re loved by your children, family, and most importantly God, whose love and forgiveness is much more powerful and greater than any on earth could be. I’ll write again soon.Their correspondence changes over time, as the author comes to terms with what's happening while being severely affected with PTSD due to her father's legal crimes. All in all, I feel the book should have been shortened, but on the other hand, its length does serve a purpose. All in all, this is a very human feel of how it can be to be closely related to a person who's committed crimes that were highly publicised for a while and most likely, due to sensationalistic \"true-crime tv series\", always be current to serial-killer boffins."}, {"Review": "Ok...as you probly noticed I didn’t finish reading it. I made it a few chapters in and it’s literally the girl’s life story...”my uncle was great because he was always quick with a joke.....Grampa pulled me close and told me how proud he was of my graduation.....Dad killed the Otero family one morning when my Mom was pregnant with me...Grandma’s house was always my favorite place to visit, especially on the holidays, she always had the classic Christmas music playing while we all sat around and told stories.....” it’s just a run-of-the-mill telling of a normal, boring, sprinkled with affection for her family biography with a quick mention every 10 pages or so of one of her dad’s crimes. I was expecting a whole lot more. Maybe some stories of the family wondering where he was late one night.?! Or her and her brother stumbling upon a strange article of clothing in the garage. Or even a mention of how he seems just a little TOO into the murder investigation as it was ongoing. Nada. Zip. Zilch. I gave up. She seems like a nice girl, well-written, and it’s terrible what she’s had to endure, but I can’t help but think what the victims families must think as they read this account as she tries to come across as “another victim.” It’s definitely written with that tone! Idk...I guess she IS technically a “victim” in all this but...c’mon. Bottom-line for me with this one is I didn’t crack this book to hear all about her ups and downs, highs and lows, and every other memory along the way. I would’ve turned to the Lifetime Network for that. Which is EXACTLY where this story is headed! STAT! "}, {"Review": "I had no idea this book existed until I came across it in the bookstore. I've been interested in this case for a long time, particularly the family aspect of it, and I'm really impressed that Kerri Rawson had the courage to write this book and share this story. The book itself is a mixed bag. I always appreciate when people who aren't writers by trade still write their books themselves. But the risk of that is that the writing is not of the highest quality, and that is the case here. There's also an entire section of the book devoted to a hiking trip that feels like it serves almost no purpose (although I believe it is where the author's faith in God was renewed, which seems like a bi of a stretch to me, but who am I to deny her experience?). Those caveats aside, though, the story itself is so fascinating that I raced through the book, and her writing, in its modesty, is extremely honest. There is more talk of god than I would like, but if that's what lead her to a state of relative stability and forgiveness then more power to her. It's a staggering situation to try to wrap your mind around, and she does put you in her shoes. I'm not sure how interesting this book would be to someone who wasn't already interested in this case, but for someone like me it was very gripping."}, {"Review": "As someone who has lived in Park City, KS for the last twenty years, I couldn't not read this book. I've been a true crime reader for 30 years, long before I moved to the area, and having BTK arrested in a place that was home to me was jarring. Reading this book -- one of dozens of true crime books I've read over the years -- and knowing the places she mentions and having lived much of the same life made me think and evaluate. However, I would not actually classify this as true crime, but more of a memoir of a person who is unfortunately thrust into a true crime world. I'm not a devout Christian and much of the faith based parts of the book were not my thing, but the author writes from the heart and gives you her authentic experience. It's great that she was able to finally find peace through her beliefs. This is a story of a childhood, a betrayal, and how she came to be able to find a life with the knowledge of that betrayal. Not necessarily a must read if you're looking for true crime details, but it's an interesting journey to take."}, {"Review": "This was really boring. I kept losing interest. I didn’t need to know the minute details of a summer camping trip in the early 90s to understand that BTK masqueraded as a good father for decades. I wanted to hear about the process of reconciling the father and the serial killer. That’s why I wanted to read this book. However, I don’t need the author’s entire life story to get there. —-I received a copy of this book from the publisher in exchange for an honest review. I was not paid for this review."}, {"Review": " Kerri Rawson's life was forever changed on February 25, 2005. FBI.... Your dad.....B.T.K.... That's how Kerri found out her father was the notorious Wichita serial killer known as B.T.K. Dennis Rader chose that name for himself when he began writing letters to the police to claim his murders. He called himself B.T.K. because it stands for how he killed his victims. \"Bind. Torture. Kill\"  He hid this side of his life from his family for 31 years. He was married.He had two kids.He was the President of their Church.He worked down the hall from law enforcement for Y E A R S and no one knew.No one knew he had created a shed with a false back so he could hide his \"kill kit.\" No one knew the hallway and closets in their house had false bottoms. No one could have ever expected this to happen in their tiny neighborhood and Kerri definitely didn't think her dad could be behind it.In Kerri's book, \"A Serial Killer's Daughter\" she doesn't really focus on the crimes B.T.K. committed. She decides instead to focus on her father, the man she knew and loved; not the monster she was just introduced to. In a way, she humanizes him. She remembers the man who hiked the Grand Canyon with her. The man she worshiped as a child. The man who held her tightly when she was sick and looked over her family. The man that taught her how to live. Looking back it seem as though she was slowly realizing everything that he taught her was to protect her from people like him. He taught her to always ask for a badge when officers introduced himself/herself. He taught her to place a broom handle in the track of her sliding glass doors to prevent it from opening. Little did she know that was because he killed a woman by coming into her house through a sliding glass door.Dennis Rader was just an average guy, raising his family, and hiding a dark secret.But after years of therapy, separation, forgiveness , and quite literally the Grace of God, Kerri found a way to forgive her father for everything. She believes that God will forgive him when the time comes, so it only seems fair that she forgive him too.Huge thanks to NetGalley, Nelson Books, and Kerri Rawson for finding the courage to tell her story!This review and other true crime reviews can be found at A Reader's Diary!"}, {"Review": "Thank you to Net Galley, Nelson Books and the author for an e-ARC of this title in exchange for my honest review. I will say that I'd purchased a copy, then, the same day received the ARC. I should also say that I am an online sleuth, so I'm more than picky about true crime. That said, I'm afraid this book will be a bit misclassified. If true crime scares you, this won't. I'm also seeing it classified as Christian. Yes, she references God, but I wouldn't call it a Christian title. I think, forced to choose a genre, I think I'd have to go with Memoir. This book touched me to my core. It's so easy to stand on the sidelines and wonder how a serial killer's family \"should\" have known, or why it happened, but Kerri shows us that it's not as black and white as you'd think. As a daughter, how in the world do you now live your life, knowing your past really was a lie? I hope that Joseph DeAngelo's daughter's (the Golden State Killer) get a chance to read this, or connect with Kerri, because they are all part of a horrifying club you can't wish away. This book is honest, and raw, poignant and well done. Highly recommended."}, {"Review": "I will admit it: I am a true crime addict. Books, documentaries, articles....you name it and I will devour it so it really takes a lot to make me sit down and think twice about something. Kerri Rawson has made me think. Of all the books I have read about serial killers and mass murderers (and it's kind of a lot) I have never read a book written by the child of one of those killers until now. I am in awe at the strength this woman must have to be able to put so much into writing this book. Every honest and raw detail is right there for the world and it is incredible. The first half of A Serial Killer's Daughter mainly focuses on Rawson's childhood and her misplaced faith. Honestly that wasn't the book I was looking forward to reading so even though it does give some interesting insight to her relationship with her father and God, I didn't feel that pull I was expecting had to question the reasoning behind the book. I started getting the impression that Rawson was simply writing a memoir and using her father's crimes to sell it, rather than telling the story the book had advertised. Honestly, I thought about simply putting it down and calling it a day.Don’t pull out the pitchforks yet…I’m not finished.I was compelled to continue the book. Maybe it was the constant foreshadowing at the end of each chapter (which drove me absolutely insane, by the way) but something was telling me that this was a story I needed to read and I had to keep going. Whatever that something was…was right! Once I struggled through reading about Rawson’s childhood, the father she had known growing up and her losing battle with her faith I flew through the remainder of the book. It facinatined me to have that inside look at Rader’s arrest and how the family dealt with the notoriety that came with it. We always think about the victims but never realize that those the criminal left behind are victims too and Rawson really opened my eyes to the other side of this story. She doesn’t go into great detail about the murders her father had committed over the years, which is fine, the book isn’t about him anyway, but she does give a very real and honestly account of how she felt and managed during this time of her life. Very real and incredibly raw, Rawson brings every skeleton out of her closet in A Serial Killer’s Daughter. Although I am not a religious person, I respect that she brought her struggle with her faith into the open as well. She has a story to tell and this is a must read for crime addicts as well as anyone struggling through life. Honestly, everyone can take something beneficial away from this book. I have, and will continue to, recommend this book to everyone looking for something a little different to read. Thank you to NetGalley and the publisher for providing me with a copy of this book to read and provide my honest opinion."}, {"Review": "Once I started reading, I couldn't put it down so it was an easy, quick, and interesting read. It followed her life before her dad was arrested and her life after and what she went through afterwords in the aftermath of finding out her father was a serial killer and wasn't who she thought he was. Her life descended into a living hell of anxiety, depression, PTSD, night terrors and having to somehow live with the fact that her dad was indeed a serial killer. It does a good job of showing how a person can be like Jekyll and Hyde, how someone could live a double life, and lie and betray not only to their family but everyone around them. She talks about growing up with a man that she loved and then the other man that she didn't know, that was a stranger to her, like he was two people in one.It reminds me how sometimes you can never really know someone and also how someone can put on a show/pretend/act/not let their true self out, whatever you want to call it, and hide part of themselves from others. It also shows how there's a good and bad side/light and dark side to everyone. His family and everyone around him was duped, played, \"pawns in his game\". I liked this book because it helps to show the psychology and nature behind these types of people and because it talks about true crime/violence and the real effects of it on his family, and how his own family is also a victim of his crimes and how it has hurt and affected them as well as the families of those he murdered.Be warned though because at times this was a really hard and uncomfortable read when it went into the murders he committed. Luckily she didn't go into a lot of graphic details but it is disturbing enough even without the details.It feels weird giving a 5 star rating to a book about such a terrible topic, but it gets 5 stars because I think it was a good book, even thought it's a horrible and hard topic. Thank you to Netgalley for the advanced copy in exchange for an honest review."}, {"Review": "\"A Serial Killer's Daughter\" by Kerri Rawson is the story of Kerri, not just her dad who is the convicted BTK killer. Before you throw this book out saying oh she is just trying to make her dad look no that is not it at all. She is sharing how she grew up with a man as a dad that she had no idea led a behind the scenes life of being a serial killer. It does start out with her giving some history of her dad's life before he married her mom and their life together before she was born. But most of the book is about her life with her dad and how she thought he was a normal dad. I chose to read this book because we have a tendency as a society that serial killers also create victims of their family. What do I mean by that well their families think everything is normal and that serial killers are someone else. They have hopes and dreams of a normal life and the serial killer especially when they are caught have killed their hopes and dreams. She writes on how she was broken by her dad's arrest and how she did at first did not think it could be true. But over time she had to come to terms with how her dad is a psychopath and that she was also a victim. She never glorifies her dad she just talks about him like he was any other dad but she does realize as the years go on past his arrest that he was emotionally abusive to her family and that was a hard pill to swallow. I liked this book as she focuses on her faith helping thru things and it was a reminder to me not to treat the families or friends of serial killers horrible as most of the time they had no idea and they are victims of the killer themselves. I highly recommend this book especially since we never truly know every person in our lives.I received a complimentary copy of this book from NetGalley. Opinions expressed in this review are completely my own."}, {"Review": "When learning about a serial killer - do you ever wonder about his friends and family? Wonder what it was like for them to learn this about someone they loved or if they had always known there was something off? Kerri Rawson gives us the answers of her experience in this book - learning she is the daughter of a serial killer.The book starts on a cold February day when an FBI agent shows up at Kerri’s apartment to tell her that her father is in custody and to question her. On that day, Kerri loses a sense of the self identity she has always known and gains a new identity - BTK’s daughter.Kerri is very honest in her book of all the complicated feelings that come at every part of learning that someone she loved very much had a secret second life going on that none of them had any clue about. She shares stories from her childhood - seen now through a different lens - like learning her father committed a murder just a month after a family vacation.In college, Kerri called her dad for advice on whether to move to a certain apartment. It had a sliding glass door which made her nervous since when she was little she heard of a neighbor who was killed after someone broke her glass door with a cinder block. Kerri’s dad told her the apartment looked safe and she moved in. Later she learned her father was the killer who had broken that neighbor’s glass door.After learning the full extent of her father’s crimes and the 10 people he killed, Rawson wrote:“Seven families were destroyed by my father, never to be the same again. Eight: his family — my family — too. My family — not his, no longer his. No longer his.” Thank you Kerri for sharing your story and all the complicated feelings of your world being turned upside down on that February day that divided your life into Before and After. Thank you to Netgalley and Thomas Nelson for providing a copy of the book in exchange for my honest review."}, {"Review": "When you find an FBI agent outside your house you would probably think the worst but nothing could have prepared Kerri Rawson for what she was about to learn. Raised in a Christian household, close to other family members on her mom and dad's side she spent most of her time with them and outside if she could. Although Kerri and her brother knew to keep on their dad's good side their lives were pretty happy but all this meant nothing when she learned her father was a serial killer, having been arrested and identified as BTK, someone Kerri had been more than aware of all her life without realising she actually lived with him.I wasn't sure what to expect as Kerri was not only so closely and personally linked to such a sadistic killer, but also was a committed Christian, something I most definitely am not. What I found was a book written in an easy, open manner by a woman not afraid to show how her life had been shattered without feeling sorry for herself or forgetting that the families of her father's victims had suffered far more.There is a strong message of hope within this book and I really wanted Kerri and her family to emerge the other side of their nightmare with the courage to live their own lives in the way the majority of us wouldn't give a second thought to. That she struggled with her faith, her ability to forgive, to even get out of bed in the morning wasn't hidden or glossed over in any way and I admired her and her fortitude far more than I thought I would. I finished the book hoping she can find a lasting peace, for herself and those who have suffered alongside her. I was able to read a copy of this book thanks to Netgalley and the publishers and would recommend it to anyone who enjoys true crime biographies or books with a history that has to be overcome through personal strength and faith of some kind."}, {"Review": "More reviews and book-ish content @ Club Book Mobile & Andrea RBKA Serial Killer's Daughter: My Story of Faith, Love and Overcoming by Kerri Rawson is by a woman who is the daughter of BTK. Given this occurred in Kansas, I was quite familiar with Kerri's father's crimes. However, this story, above all else, was about Kerri. It was about the before of her life and then the after. Before, she was living a relatively normal life, as she went to school, college, got married, etc. Then, there was the after as she discovers (along with the rest of the world) that her father is Wichita's most notorious serial killer. Everything she thought she knew is different now in an unimaginable realization. Throughout, Kerri tells a honest and authentic story. She shares the depths of her emotions as she reflects on the before of her life, and then had to process everything that was revealed about the man she thought she knew. This was an incredibly powerful read as she centers her story in a reality that she could have never imagined. She shares how she struggles, especially with her own mental health and grief, and she also shares where she found comfort and even forgiveness. it was an emotional read, but again, it was Kerri taking ownership of her story and showing how she has found a way through it all."}, {"Review": "I've always enjoyed reading about the lives of serial killers and to find a book about one of the killers I find the most interest was amazing. This book was really good however because it wasn't another account of what Dennis Raider AKA BTK did. It was partly that but it was mostly about how his daughter viewed it, and how she reacted to the news that her loving father was a serial killer. It was very sad to read this book because you can tell that the woman loved her father because he was her father and she had fond memories but you can also tell from her words how much she hates what he did. I can't imagine having to go through something so terrible. I found this book very interesting and I had to see what happened. This book was also good because of all of the emotion that was in it. It wasn't just a factual retelling it had a lot of feeling put into the pages. Great book you won't want to put it down once you open it so get ready for a marathon read."}, {"Review": "I have to say I was pleasantly surprised with this book. I often wonder what it must be like being the family of a serial killer. Especially one as known as BTK. Often intrigued with the \"how\" aspects of serial killers early lives and upbringing, it was interesting to get the perspective of Dennis Radar's daughter throughout her childhood and adulthood. I can't imagine what she (and her family) went through, but she did an excellent job of telling her story. The only reason I did not give the book 5 stars, was because of the repetitive themes and religious/spiritual undertones; although I do respect that this is how she navigated her way through everything (so all the power to her). Ultimately, I think it is a great story and really let's you get a different take on the \"normal\" side of BTK. I wish you well Kerri & family."}, {"Review": "Kerri grows up with her parents & brother in Kansas during the time that the BTK killer terrifies their neighborhood and surrounding community. Years later, Kerri finds an FBI agent at her door in Michigan, and learned that her father was arrested as the BTK killer, and he confessed to the murders. Kerri explains the utter confusion and dismay that their family goes through - her father committed his first murder before she was even born. She openly shares about the PTSD and emotional struggles that she has encounter since her father's arrest. The book was interesting though it's so hard to comprehend what they had to go through, as well as what the families of the victims went through. The flow of the book was a little jagged for me with some flashbacks to youth that seemed a little disjointed to me."}, {"Review": "Thoroughly enjoyed this book. I read it very quickly and enjoyed that the perspective of the daughter was incredibly unique especially because she felt as though her dad could never have been that person until she finally started tying everything together. I think this is a perspective a lot of us having been waiting for in regards to BTK and it's even more surprising at how open his daughter was in this book.My only criticism is that she spent more time on the actual crimes themselves and her relationship with her dad post-incarceration but I can only ask so much of someone who also a victim."}], "Genre": "Crime", "ID": "38915935", "Desc": ""}