{"Genre": "Crime", "Reviews": [{"Review": " \"The killing business has its own gravitational pull, and if you get too close, or stay too long, you'll never break free.\"Man oh man, Barry Eisler knows how to write thrillers! His books featuring \"retired\" hitman John Rain, and his newer books featuring troubled sex crimes detective Livia Lone are fantastic, but this one really hits a home run. Way to get my heart pounding!Livia is leading the Seattle Police Department's involvement with the FBI in a joint investigation of a child pornography"}, {"Review": "John Rain is a hitman offered a job targeting three individuals. He turns down the job, but is swept up in the action when one of the targets, Livia Lone, survives the attempted hit. Not only is John involved, but so are various others with connections to Rain and Livia.Told using alternating points of view, this novel has a lot of characters and multiple storylines. Even though there was a lot going on, it was easy to follow and everything was wrapped up by the end.This book is part of a series"}, {"Review": "New York Times bestselling author Barry Eisler (The Night Trade) merges his two most popular franchises in his latest action-packed thriller. This time around, Detective Livia Lone of the Seattle PD sex crimes unit has her eyes set on bringing down an evil child pornography ring. Because the ring has gone international, though, it’s a federal case, and Lone is forced to partake in a joint investigation between the Seattle police department and the FBI.After making headway on the case, Lone is th"}, {"Review": "My review of The Killer Collective can be found at High Fever Books.Ever since Barry Eisler’s newest series character Liva Lone appeared on the scene in her eponymous 2016 debut, I was waiting for the day she would cross paths with the author’s original creation, John Rain. Finally, that day has come, and the two — along with their many and various colleagues — share page space in The Killer Collective. Like Eisler’s 2011 novel, The Detatchment, The Killer Collective brings together all of the v"}, {"Review": "This may be one of the best books I've read in the last (linear) year!I devoured the book in a twenty-four hour period - something I haven't done in the last few years.The Killer Collective brings together a bunch of Eisler's characters: John Rain, Livia Lone, Dox, \"the angel of death\" Larison, Ben Treven, Colonel Horton, Delilah (yay!)... For me - having Rain, Dox, and Delilah together felt like seeing old friends, and adding Livia into the mix added to the book's complexity and emotion - as we"}, {"Review": "Not the worst book Eisler has written, but overall it’s disappointing.Eisler wrote some very good paragraphs, some showing keen insight into the human condition. Ultimately, though, the book is tedious and simply goes on too long. Eisler, like many writers in the genre, goes to great lengths to establish credibility, such as providing detailed information on weapons and locations, but he fails to address, much less correct, fundamental issues such as the nature of his characters’ work and their"}, {"Review": "I started out reading thrillers years ago through a book club where our first pick was THE GOLD COAST by Nelson Demille. I have continued enjoyed to enjoy the genre on a regular basis thanks to excellent writers and Megan Beatie of MB Communications who sends excellent novels for me to review. Author Barry Eisler has written many thriller series, but THE KILLER COLLECTIVE is a standalone book. It does have protagonists John Rain, Livia Lone and Ben Treven from earlier series. Livia Lone works fo"}, {"Review": "This was a pretty ambitious project for author Barry Eisler since he weaved together most of the characters in his previous books into a seamless story line. I liked the Detachment which required him to do the same thing, but I thought he did it here much better, and with more characters to boot.Eisler sets the scene well from the very beginning by introducing one of the main villains from the first act. He quickly introduces him without making him cartoonish. He quickly establishes all of his p"}, {"Review": "I am loving this... no spoilers but... You know how irritating it is when a writer creates a memorable character, then a series, and you love every book. Then he stops and writes another series and you love that, and then he stops and writes another series. You get annoyed because you have to wait for a bit longer each time. (Sorry Barry - not really complaining). AND THEN ....He does this brilliant thing and puts them all in the same book. Much appreciated Mr Eisler - now to persuade the Robert"}, {"Review": "Not bad, but there is still just a bit too much casual killing in these series; maybe get a little more surgical in the next one? This one is the tried and true “get the gang together” plot device after Lone discovers something nefarious with Nat Sec dimensions while investigating a pedophile ring. For all the killing there is also a bit too much Serious Talk on the relationship side. There’s a nice comic description of mansplaining in action though and some other good bits such as Delilah trapp"}, {"Review": "This thriller is a quick, easy page-turner. I haven't read any of Eisler's other books, and that was a my problem with this one. I felt as though I was dropped in the middle of the story. Apparently the characters appear in other series written by Eisler.The author is a good writer and knows how to create suspense, but if you want a stand-alone, I would not recommend this."}, {"Review": "This book was a free Kindle download this month so I didn’t have any expectations going. Turns out I couldn’t put this thriller down and am glad I had the day off to enjoy it."}, {"Review": "PW Starred: In this crackling-good thriller from bestseller Eisler (The Night Trade), Seattle PD sex crimes detective Livia Lone, assassin John Rain, and former Marine sniper Dox form a testy alliance to combat a vile conspiracy involving corrupt and toxic government agencies. When Livia survives an assassination attempt while investigating an international child pornography ring, she learns that those behind the hit may work for the FBI. Livia recruits Dox, her partner from The Night Trade, to"}, {"Review": "Eisler knocks it out of the parkI've been an avid fan of Barry Eisler's work for a long time. When I heard he was working on another team up book in the vein of his previous 'The Detachment' that included Livia Lone, plus a couple of other characters not in the previous book, I was excited and knew that my expectations were going to be high. I'm happy to say he blew way past what I had hoped for. This may be the best novel he's written--and after the last two Livia and Rain prequel books that's"}, {"Review": "Eisler has written another page turner, and like “The detachment”, there is something satisfying about being all of the past characters together - more satifying than when gobs of Marvel characters are in the same movie by far. MINOR SPOILER ALERT.As usual, Eisler’s realistic view of black ops and technology makes the book better than most other spy stories. He is up there with LaCarré at least.I have previously complained on the old forum, and even to Barry in person, that his attentio. To deta"}, {"Review": "Excellent Rarely do I give five star reviews. The majority of my reading is purely my form of escape and I read virtually every day to relax and escape. I find so much repetition and narrowly focused plots in much of the published books today, and while entertaining, they lack in reality or creativity or are just another story about terrorists or some superman who kills everything.This book was creative and centered on theme not well used in today's typical action novels. The characters are quit"}, {"Review": "An investigation of an international child porn ring has deadly consequenceswhen it threatens to expose the rich and powerful. Seattle detective and sex crime avenger Livia Lone is in the cross hairs. But the bad guys make a crucial mistake when they try to terminate an elite group of killers. The mercenaries join Lone in a battle that will cross the globe. I liked this book overall. It is okay as a standalone but reading the prior novels and learning the back stories adds richness to the story."}, {"Review": "A great thriller that I liked for other reasons It is a terrific thriller, fast paced, never boring, with a plot that, though complicated, never caused me to feel lost. It was obviously well researched, and never did I get that feeling I get with some books, of, “oh, please!” doubts.One reason I liked it so much is that the characters were well developed, three dimensional, with characteristics to both admire and not admire so much. In other words, they felt real.Another reason is the author’s w"}, {"Review": "This was my first Barry Eisler read. Picked up the ebook on Amazon's Early E-book Reader offer --or whatever it is called.Absolutely loved the tale. I am going to have to go back and read more about John Rain and Livia Lone in their perspective collections. Maybe even the four books featuring Treven. From Tokyo to the US to Paris -- this book is filled with tension, action and an unnerving plot. It is the kind that makes your stomach knot up (like when you binge watch too many episodes of Law &a"}, {"Review": "All star cast and fabulous plottingRain, Dox, Livia, Larrison, Delilah, Kanezsaki, and more. Virtually every character I've ever liked in an Eisler novel. Brilliant pacing. And I feel like an idiot stating: I laughed and I cried, but it's true. I loved Dox calling Larrison \"the angel of death\" and almost everything about Livia, and especially Livia and Dox, touches me deeply. Well, except for when she's dealing with sadistic child abusers, human traffickers, and rapists. Then I simply cheer and"}, {"Review": "This book was just so much fun. I didn't want to put it down. After reading so much Barry Eisler over the years, it was just an absolute pleasure to have Rain and Dox and Livia and Larison the Angel of Death and Delilah together. I hope Barry brings them all back for the Killer Collective II (though he'll obviously come up with a better name given his self-imposed compulsion to ensure his books have the right titles. The book starts off strong, adding in character after character brilliantly, wi"}, {"Review": "This was a Kindle First Reads for January.This was my first Barry Eisler book, and I'm not sure I understand all the 5-star reviews. It's a good story (and would probably make a good movie), but it is very slow. It can definitely be read as a stand-alone, since the author goes to great (and long-winded) lengths to explain each and every characters back story in detail. Add to that, that every decision is preceded by either the characters inner monologue weighing pros and cons, or the group discu"}, {"Review": "Wow I could not put this book down!I was hooked from the first page and could not put the book down.Each character is described with just enough information for the reader to connect with that character and understand their thought process.Just enough details were given though out the book that allows the reader to develop a picture in their mind without over doing it.Lots of action, companionship, and even lost love.Ties up all lose ends at end of book.Really good book and look forward to readi"}, {"Review": "I actually really liked this book. At first, it was a little crazy to follow with all of the characters and various points of view. However, that became one of the things I ended up liking after I got to know the characters. I like that elements of the story were based in truth and the author provides various references at the end. I also liked the intrigue and mystery in the story. Overall, a good read for those who enjoy the suspense and mystery, plus a little romance as well. I would definite"}, {"Review": "A Well Executed TaleMy title should give you a clue, if you happened to miss it in the book 's name! A police detective, on administrative leave while one of her cases is under review, becomes involved with a group of assassins trying to eliminate a collective of extremists who abuse children for fun and profit. The case takes the odd assortment of across the United States and to Paris to take out the founders of this heinous group. This novel will satisfy anyone's need for mystery, violence, an"}, {"Review": "Free Prime first reads book. Took me a little to get into it. I did not know it was like a Justice League of characters from various series by Eisler. The action and suspense were good. There were a lot of characters, all well enough developed and interesting, and it was easy to keep track of who was who and the inter- relationships. The love story aspects were fine - a little over done. IHaving read this, though, I'm not sure I want to go back and read earlier installments of any of the series."}, {"Review": "Rain and Company To my surprise, it’s been awhile since I had read about John Rain. I have all of the early books and enjoyed them. Somehow I had gotten away from him. This book reminded me of how good the series is. It was good to see everyone together in one book. Happy to report no one has lost a step. As per usual, the characters are well defined and have developed nicely, especially Rain and Dox. The plot was good. Lots of action. The book was satisfying on several levels. Highly recommende"}, {"Review": "Another great Eisler read. Have read all the Rain books and they are all terrific reads. Livia Lone is a great new character that you can really empathize with. Love the idea of this group getting together for what turns out to be a great reason and new readers will get an insight to most of the characters. For me its one of those books you don't want to end but at the same time you say to yourself \"just one more chapter\". "}, {"Review": "This book was nothing like I thought and everything I needed. I’ve never read this author before and I happened to stumble upon this jewel on Goodreads First Reads. I was so glad that I decided to read it. The book grabbed my attention within the first couple of pages, I was hooked. Reading this book gave me “Mission Impossible” vibes in book form and I absolutely LOVED it. I have to read more from this author. "}, {"Review": "A fast-moving story involving John Rain and Livia Lone, two individuals from the collection of Barry Eisler books, along with other friends with short fuses and fast trigger fingers. The team tackles a problem with child pornography and endangerment/torture practiced by a small group of agents from the Secret Service and some members of Congress.A very interesting and scary story that once you start reading is hard to put down."}], "ID": "40492305", "Name": "The Killer Collective"}