{"Genre": "Crime", "Reviews": [{"Review": "Welcome back to 12 Bar Cafe.. to Cormoran Strike's.Welcome back in London,and to actually Being Strike.I still see him as \"Hugh Jackman\" :),with some hair style to match, & Emma Watson as his adorable blonde, smart secretary, Robin.And Welcome to The Case of the Manuscript of....Bombyx Mori “..writers are a savage breed, Mr. Strike. If you want life-long friendship and selfless camaraderie, join the army and learn to kill. If you want a lifetime of temporary alliances with peers who will glo"}, {"Review": " Wicked brilliant!  ( Yes ;) Pun intended! ) HERE COMES CORMORAN & ROBIN AGAIN! If you are respectably active on the reading community, it will be no surprise that this \"Robert Galbraith\" is really the mega-famous writer J.K. Rowling, author of the ultra-mega-famous book series of Harry Potter. Why bother on making up the pseudonym when it was revealed after like two weeks when the first novel of this different series got out, that's a mystery to me! (Yes, another pun intended :P ).Evidently"}, {"Review": "(A-) 82% | Very GoodNotes: Wherein there are many meals, and nearly every important chat occurs in a restaurant, pub, or over tea and biscuits."}, {"Review": "J.K Rowling releases a novel under a pseudonym? Then announces that said novels sequel is already written and will be released in 2014??This is how I imagine she looks right now.Edit Feb 2014: We have a name, release date AND a synopsis?!?! Bloody hell!"}, {"Review": " "}, {"Review": "I FINALLY FINISHED THIS THING. And it was great! I actually liked this book more than the first one, but just by a hair. Highly recommend getting the audiobooks for these. "}, {"Review": "2.5 stars - SpoilersDisappointing, it wasn't awful but it wasn't good either. It was all rather predictable and generic, I wouldn't have minded the cliches and obviousness of it all if the main characters (Strike and Robin) had stood out in some way. Sadly, they didn't. I didn't care about either of them… I actually kind of hated both. -I wasn't a fan of the writing, there were a number of times where I came across sentences that didn't flow very well. Some of the more 'difficult' words seemed t"}, {"Review": " \"...Writers are a savage breed, Mr. Strike. If you want life-long friendship and selfless camaraderie, join the army and learn to kill. If you want a lifetime of temporary alliances with peers who will glory in your every failure, write novels.\" And just like that, J.K. Rowling under the pseudonym of Robert Galbraith takes on the familiar to her world of writing and publishing, bringing to light the petty conflicts, backstabbing attitudes, hurtful gossips and inflated egos. The bared claws and"}, {"Review": "As much as I enjoyed the first Strike book this second venture was rather a let down. What we have in \"The Silkworm\" are alternating chapters of the main character lamenting about the pain he is suffering from his injured leg, and his assistant Robin suffering from angst about her relationship with her soon to be husband. These concepts were rather new and interesting in the first installment, but have grown weary and tiresome being constantly replayed in this second. The pair travel from bar to"}, {"Review": "أنه وقت معرفة سبب أخر وراء أستخدام جي كي رولينج أسما مستعارا لكتابة تلك السلسلة \"الكُتّاب قطيع متوحش، سيد سترايك. إن أردت أن تكوّن علاقات تدوم العمر كله وصداقات حميمة خالية من الأنانية، أنضم للجيش وتعلم كيف تقتلوإن أردت حياة مليئة بالتحالفات المؤقتة، مع أقران يأتي فخرهم ومجدهم من أي لحظة فشل لك، فلتكتب روايات\" أو أكتب مراجعات مثلا، لا فارقففي هذه الرواية القضية الدموية الكثير من الغيرة والأحقاد، تشبيهات أدبية وأستعارات فجة، محاكاة ساخرة غير لائقة، مجازات غير أخلاقية..وبيست سيلرزفي هذه القضية يقت"}, {"Review": "The Silkworm is the tenth J.K. Rowling novel I’ve read. I believe that after ten often gargantuan novels I can make fairly accurate generalizations about her writing. And it saddens me to say that she keeps making the same mistakes.Most glaring is her treatment of female characters. In the Cormoran Strike mystery series, we have another female character of much greater intrigue shunted to the side in favor of a male protagonist, aka Hermione Granger Syndrome. Robin is Strike’s young personal ass"}, {"Review": "4.5* When I finished The Silkworm two weeks ago I was planning to give it 4* for reasons that I will discuss later. I decided to upgrade my rating when I went to visit my mum and I saw the novel on the nightstand, halfway read. “It’s really good, isn’t it”, I asked her with excitement in my voice. I realized then that I enjoyed this more than I did other mysteries so why not give it full recognition. J.K. Rowling (also known as Robert Galbraith) can do no wrong. She is a brilliant story teller a"}, {"Review": "I love a good detective story and Galbraith really delivered on this one. Either she is a master of the red herring or I am an incurably gullible old sod because I was firmly convinced I knew who it was for two thirds of the book, only to have it turn out to be someone I never even considered suspecting. There were several twists that were surprising and intriguing. She plays with the concept of the manor house mystery by staging a convenient party for all of the suspects to attend where the det"}, {"Review": "How did the people rate a book not yet published? I am confused."}, {"Review": "The Silkworm (Cormoran Strike #2), Robert Galbraith (Pseudonym), J.K. RowlingThe Silkworm is a 2014 crime fiction novel by J. K. Rowling, published under the pseudonym Robert Galbraith. It is the second novel in the Cormoran Strike series of detective novels and was followed by Career of Evil in 2015. Several months after solving the Lula Landry case and seeing a sharp improvement in business, Cormoran Strike is tasked by Leonora Quine with locating her novelist husband Owen. Owen, a former lite"}, {"Review": "Find all of my reviews at: http://52bookminimum.blogspot.com/I read this book MONTHS ago and never got around to writing a review . . .  Thanks for the reminder. Now that all of my friends are reading/have already read Book #3 I figured it was time to get off my butt.The Silkworm is the follow up to “Robert Galbraith’s” bestseller The Cuckoo’s Calling. The difference this time around is everyone knows the author is really J.K. Rowling. The leading male, Cormoran Strike, is a little different too"}, {"Review": "Reading J.K. Rowling’s writing for adult audiences reminds me irresistibly of bumping into grade-school teachers on the street. There’s the obvious comparison, of course, which is not having to pretend that sex and crass language don’t exist anymore, realizing your former educator is an actual human being, an experience, for some, that can feel surreal. If you’re really lucky, of course, you make friends with your old teacher, have coffee together. You start to view them complexly. Now that you’"}, {"Review": "I remember being in a trance after reading the first book in the series. And now I am again at the same emotional state. I don't know what makes J.K. Rowling's books so charming to the eye and mind but when you start a book of hers you get lost in it. The main characters, Cormoran and Robin, they're both incredibly well-structured. I'd also like to add that there's quite a lot of character development, something rarely seen in detective novels, or at least that's my opinion. Cormoran weans off C"}, {"Review": "Re-read February 2018: Okay, so now having finished my first re-read of this book, I am so tempted to up the rating to five stars. A large portion of that desire comes from listening to the audio this time around. There’s something really satisfying about Robert Glenister’s voice narrating this story; it most definitely increased my enjoyment.Another part is that this just feels like the ideal murder mystery to me right now. It was exactly what I was craving, plus some. I love all the clues and"}, {"Review": "“There are always loose ends in real life.”Preordered, arrived and read right away.I'm not sure if I liked this one better or the first one. Though a lot of really weird stuff happened in this book (or better in the book in this book) I enjoyed it a lot. And for my part, I did not know the murderer until the end.Well, this is J.K. Rowling so what is there left to say?Find more of my books on Instagram"}, {"Review": "Sjećam se kad je izašao Zov kukavice da se HP čeljad masovno dala u pljuvanje knjige, a Rowlingovoj su smjesta pripisali trenutnu književnu smrt. Moram priznati da je i mene iznenadila činjenicom da je odlučila napisati krimić ali baš zbog toga mi je još više porasla u očima, jer malo je danas pisaca koji se usude probati nešto drugo; obično ogromna većina ostaje vjerna žanru kojim su se proslavili. Jako mi drago da J.K ne spada u tu grupu, nego da i dalje radi na sebi i istražuje svoj talent.Ov"}, {"Review": "3.5 "}, {"Review": "An author decides to put out a tell all book bashing some of his fellow authors and even some of the women in his life. His wife then contacts my lovely Strike to help her find him. I'd have left his arse gone but what do I know? Strike ends up finding his dead body and decides to stay on the case.I love Strike and Robin. This team is just so much fun to read about. I keep wanting them to hook up but then I don't want them to either. I remember that ruined several other great relationships and I"}, {"Review": "Cormoran Strike's business is now better than afloat following his last high-profile case. When the wife of a missing writer asks for his help to find him, Strike opts to take the case even though he probably won't get a fee from the seemingly down and out woman. What appears to be a cut-and-dried investigation turns into something much more.I enjoyed this so much I hated seeing it end. There's nothing ordinary about the writing, the story slowly unfolding while expertly crafting vivid character"}, {"Review": "Genuinely liked this book even more than the Cuckoo's Calling, which is saying something. Loved the initial dive into the main character's personal lives, loved the central mystery in this one, and honestly can't wait to keep reading this series. I am so pleasantly surprised and can't believe I waited this long to read them.Joe and I have been listening to these books together on our commute and it's been the perfect series for both of us to enjoy, and puzzle around who we think is behind the mu"}, {"Review": "I enjoyed this more that The Cuckoo's Calling. I think that Galbraith/Rowling is getting better at this type of writing. I remember reading somewhere that it was easy to tell that it was Rowling because her style came through - but I cannot see any similarities between this and Harry Potter at all.I will say, though, that the first two Strike books use a similar formula. All the players are laid out at the beginning and then Strike goes through meeting with each of them throughout the book. In e"}, {"Review": "Good slow mystery is probably my favorite thing to read. The author knows about the publishing industry. Any famous author most know about it, the good, the bad and the ugly. And oh my God this story was an ugly succeed. The book is not your normal mystery novel. It has no action at all, tons of dialogs and inner thoughts, but I love these characters with their positive and negative attitudes. Plotting and creating not perfect personalities are some of the strongest virtues of this author and we"}, {"Review": "Update 21/09/14: Rating: 4,25 stars.My overall thoughts on The Silkworm were similar to those I had about The Cuckoo's Calling. It started out pretty slow-paced (the course of the investigation requiring many descriptive parts) and for a while there was a lot of random-sounding information, but once it picked up and I started connecting dots and making predictions (all of which turned out to be wrong; I royally suck at solving mysteries) I was totally HOOKED.The mystery was very intriguing (a mi"}, {"Review": " \"Ha, ha, ha, thou entanglest thyself in thine own work like a silkworm, John Webster\" ~ The White Devil Owen Quine was the man. He was the author who thought a day was wasted if he hadn't made his readers gag at least twice, according to Jerry. Owen Quine's books was simply gory and disgusting. His final book was a tribute to the equally gory and disgusting people in the publishing world, disguised as six prominent characters in the plot. Appropriate names, describing their secrets, was ascribe"}, {"Review": "There are some things that I think this series has really got going for it. It totally has that old school detective story vibe going for it along with engaging characters and settings even the plots are really pretty good. This reminds me a little of a T.V. series though where the detectives solve a case an episode. But will this story be for you? Well I guess that depends on a few things. There is something about Robert Galbraith’s (aka J. K. Rowling) that will forever feel a little bit like c"}], "ID": "18214414", "Name": "The Silkworm"}