{"Genre": "Crime", "Reviews": [{"Review": " 3.5 stars “Corniest serial killer ever.”A Killer’s Mind is an entertaining, easy to read thriller about “the corniest serial killer ever.” This book is full of snarky characters, wacky murderers, and quirky characters (including a cat and fish).  Zoe Bentley, a forensic psychologist who consults for the FBI, has a unique connection to her job. She loves what she does for a living, which allows her to get inside the sick and twisted minds of psychopaths and unlock their motivations in hopes of h"}, {"Review": "My first venture into the world of Mike Omer’s writing will surely not be one I forget. A serial killer novel that flips the genre on its head, Omer keeps the reader guessing throughout, in a piece that loses no momentum the deeper the plot. Dr. Zoe Bentley is an accomplished forensic psychologist with a passion for her work. When she is contracted to consult for the FBI, she leaps at the opportunity, getting neck-deep into a case that has been chilling Chicago to its core. While the local profi"}, {"Review": "Like many books in this genre, “A Killer’s Mind” began with a description of the killer at work, putting the finishing touches on his latest conquest. What was refreshing was that author Mike Omer gave us just enough of a taste in the first chapter to entice readers to keep turning pages.The author introduces us to Zoe Bentley, a forensic psychologist who is good at her job but doesn’t feel she gets the recognition she deserves. Tatum Grey is an FBI agent, “promoted” to his current position due"}, {"Review": "4.0 Stars—- I just finished my first book by Mike Omer and for the most part I thoroughly enjoyed it. The book tells the story of FBI consultant/psychologist Zoe Bentley and her work assisting the FBI and Chicago police in working the case of a serial killer with the worst nickname ever —-“The Strangling Undertaker.” Bentley is assigned to work the case with FBI agent Tatum Gray, who is an enjoyable cut-up and the antithesis to the no-nonsense, no-fun, all work Bentley. The book alternates betwe"}, {"Review": "Pretty good but predictable ending.A Killer's Mind was one of those kindle books that jumped at me. Having no idea what it was actually about - I was still intrigued to read it. Yes, I am one of those people who barely reads the synopsis before clicking the book. It usually ends up being a good.. but for the terrible ones. Well, I end up having trust issues with myself.In this book, you will meet Zoe. She basically grew up around murder mysteries. In the town she grew up in, three murders happen"}, {"Review": "An FBI serial killer book, interesting characters, that I liked for the Chicago setting.Some of the best mystery-thriller Chicago books are authored by Sara Paretsky--suggesting readers start with those if they haven't already read them."}, {"Review": "A KILLER'S MINDI loved this book, it was my pick of the Kindle First books for July- I did not even have to agonize over the choices this month, loved the brief description.Zoe and Tatum make a great team, albeit not exactly willingly. There is a lot of humor spread throughout the pages making this a fun read even though it's about a serial killer. Looking forward to the next book."}, {"Review": "full review...A Killer's Mind was easily one of the most 'surprise-reads' I've read all year! The book is a real page turner, and I can't recommend it enough for all suspense-murder-thriller lovers!The book came to me as a freebie with 'prime book of the month', and I literally picked it up in a whim! You know they say never judge a book by its cover or title...but that's exactly what I did! 😂The book tells the tale of 'Zoe' a forensic psychologist, who works in conjunction with the FBI, in tryi"}, {"Review": "A Killer's Mind was boom shakalakabambam. It was a fantastic read. Its one of the best thrillers I've read in a while."}, {"Review": "I really enjoyed this book! It is one of the most interesting and entertaining books I've read this year. I wish I could give half stars (I find myself wishing this a lot), but this book for me is 4.5 stars. The basic plot isn't anything new, but it was well written and for me it had just the right amount of suspense. There is a serial killer on the loose and the FBI is sent in to assist a police department. Of course the agent is set up to be a rogue agent with a problematic past and the police"}, {"Review": "Really liked the beginning. Then the story took on a perverted unclean feeling. To much 12 year old boy junior high mentality. Listened with TTS. Not Clean. Crude and Foul Language. "}, {"Review": "I picked this up on Kindle First and had no expectations of it. This was an intriguing story about a serial killer who tries to embalm his victims to keep them with him as long as possible.Zoe is a psychologist who is working as a profiler with the FBI. She met her first killer at the age of fourteen, but no one took her seriously. As she gets closer to this current killer she starts to see a connection from the person who got away from her when she was a teen. Will people listen to her this tim"}, {"Review": "What if you knew her and found her dead on the ground..This was my Amazon First choice for July. Zoe Bentley is a forensic psychiatrist who is a civilian consultant for the BAU. She has been fascinated by serial killers since coming into contact with one, when she was fourteen. Agent Tatum Gray was just 'promoted' to Quantico from L.A., after making too many waves. Tatum and Zoe are sent to Chicago to consult with police about a bizarre serial killer known as the Strangling Undertaker. He's alre"}, {"Review": "I didn't \"like\" A KILLER'S MIND by Mike Omer, I LOVED it! Hooks. Cliffhangers. And an incredible twist (or seven) kept me riveted to the pages—with a blanket nearby to hide under when it got too intense!"}, {"Review": "A killers mind is an amazing thriller that will keep you guessing until the very end. I love that the story is told from all points of view, from Zoe Bentley (profiler), the FBI agent, to the killer and even the victims, this give a truly excellent and well rounded account of the crimes and detective work. I feel this is how all thrillers, crime, and mysteries should be written. I found the characters endearing and made you care what was going to happen to them next, the story draws you in with"}, {"Review": "Are you serious?!I was enjoying this book up until the end it went downhill quickly. In what world would a doctor that is untrained in hostage situations decide that running into a crime scene and stripping was a good idea. Seriously?! The entire situation would have never worked. Zoe would have never been a suitable replacement for his current victim as she was badly beaten from a previous altercation. The author basically contradicted his entire book at the end. Zoe would have known based on h"}, {"Review": "I didn't love this Kindle First book, but I didn't hate it, either. I am on the fence as about reading the next book (thank you Mike Omer/Amazon for making it clear this was the first in a series).The majority of this book is set in present day, but there are a few chapters that take place in 1997, when Zoe is a teen and there have been multiple killings in her small town. I actually liked those chapters the most, because Zoe seems to have a lot more personality. Present day Zoe seems to look fo"}, {"Review": "DNF @ 103 pages.The novel really isn't working for me. The premise is interesting, but the writing so far reads as shallow and cheesy; and all the characters come across as juvenile, which is an odd feeling when they are supposed to work in law enforcement. Zoe, especially, is introduced as an expert in her field, but she sounds like a total hack most of the time. It's very hard to believe her observations have any value when she whips them out without having investigated... much of anything, re"}, {"Review": "A really well written crime thriller with an original concept, I sailed through it and have already pre-ordered part 2!Something very Silence of the Lambs about it - which is praise indeed. Edge of your seat stuff, believable, gripping, a great read."}, {"Review": "I received a copy of this story from my husband after a friend of his suggested it to him. Needless to say, this was an interesting pull-you-in kind of story. While I have read crime/mystery type stories before, I'm usually hesitant when it's by a male author. Sorry, but the few I have read were written by men and somewhat boring, in my opinion. Perhaps, it was because the main character was a male? Yet, I'm not sure that's right since I've read lots of stories with a male lead and have never ha"}, {"Review": "4.3 Out Of 5 \"Profiler\" STARS A Killer's Mind is morbidly fascinating and generally creepy.  Compulsively readable, or listenable, I couldn't put it down.  I had some issues with the way some elements played out and some minor believability issues, but nothing too major.  I got this book as a Kindle First and bought the narration and it was totally worth it.  I really like stories about Profilers, I find the whole process quite intriguing.  Narration by Brittany Pressley was very well done…I lik"}, {"Review": "This review was originally posted on Books of My Heart 3.5 hearts A Killer's Mind is a book I got as a Prime member in their Kindle First program. I generally seem to chose mysteries, action or thriller, or suspense stories.  Zoe is a forensic psychologist consultant to the FBI and works with their agents.  She is currently based at the BAU near Washington, DC.The focus was primarily on the case and its details. The chapters alternate between Zoe's past, when she developed the desire to become a"}, {"Review": "I'm hooked on this new series! For me, characters come first. I need to feel their emotions, and care about what happens to them. That can mean I want them to succeed with a happily-ever-after ending or die violent deaths, but either way I have to feel the intensity. Mike Omer brought me characters I immediately connected with and cared about. They're realistic and quirky and unique. Even the minor characters stand out. I absolutely loved Marvin, who is Tatum's grandfather and had me laughing ou"}, {"Review": "I liked this. I thought it was well-plotted, had likable characters, and was sometimes funny. The writing was pretty good, but there were a few parts here and there where the dialogue felt a little off. However, I enjoyed it all enough to give this four stars and would definitely be interested in reading the next book in the series. "}, {"Review": "Hasta la mitad fue un libro \"bueno\", divertido incluso a pesar del tema que trata (como estar en un episodio de Bones)...el último tercio el ritmo se intensificó de una forma que no pude parar de leer."}, {"Review": "Whew! That was a wild ride that kept me up into the wee hours tonight! Loved it! Mike Omer is a new favorite in this genre. 🎉"}, {"Review": "This book had by undivided attention from start to finish. I found myself entranced in the characters and counting down the minutes till I could open the book back up. The way the chapters are written and Zoe and Tatum's chemistry—Mike is really on to something here. Im looking forward to the next book. "}, {"Review": "I started this book without reading the reviews or other works by the author. It was recommended via kindle unlimited to me. I read a lot of books, 300+ a year so I do love when I get a new author suggestion. A few chapters in to the book I was concerned that I had already read it and forgot to mark it but I continued anyways, Thank goodness i did! It has some parallels with a book I have read before but it is definitely unique. I loved the writing, characters, backstory, time flips, ending... a"}, {"Review": "This has to be one of the worst books that I have ever read.Full review coming soon. "}, {"Review": "love Love Love love this book!!!"}], "ID": "37647561", "Name": "A Killer's Mind"}