{"Genre": "Crime", "Reviews": [{"Review": "First and foremost, a large thank you to Matthew Pritchard and Sapere Books for providing me with a copy of this publication, which allows me to provide you with an unbiased review.When the publisher asked me to read this piece, I was taken in by the description provided on the dust jacket. Anything with a serial killer element is sure to bring chills up the spine and keep the reader connected throughout the journey. Danny Sanchez is a reporter for a small newspaper in a British retirement commu"}, {"Review": "Scarecrow, the first novel to feature tough-as-nails journalist Danny Sanchez, is nothing less than a superb thriller, far superior to many I have experienced. The plot has many different facets to it - a sick and twisted serial killer, amazing character development and taut, fast-moving prose. Add to that a large dollop of intrigue and you've got all the ingredients for a compelling and unputdownable read. I loved how intelligent the killer was, he was smart enough to keep in the favour of some"}, {"Review": "4.5Danny Sanchez, a perceptive and sharp journalist is covering the story of a house which is in the process of being demolished. But when a body is found buried inside one of the walls, the simple task of writing a report turns to an investigation, which would take him back to decades earlier, to another country and to the realm of a cold-hearted and twisted serial killer.Scarecrow, the first book in the series, is a well-written, fast paced and gruesomely engaging book. With smartly put twists"}, {"Review": "I would like to thank Netgalley and Sapere Books for an advance copy of Scarecrow, the first thriller to feature Almería based journalist Danny Sanchez.When a house demolition uncovers a mutilated corpse it reminds Danny of the first big case he covered as a journalist in 1995 when “Scarecrow” murdered five Englishmen in a horrific manner before being caught and incarcerated in a high security hospital where he still remains. Danny is the only one seeing the link as, for various reasons, neither"}, {"Review": "This novel is not for the faint hearted, I repeat definitely, not for the faint hearted! The novel is of the crime genre but it is extremely dark & edgy. It reminded me in a way of The Poet by Michael Connelly but the author gives it his own unique stamp!The novel opens & we are instantly transported to Almeria Spain; investigative journalist Danny Sanchez is covering the unjust demolition of an elderly retired ex-pat couple’s villa. I liked that the author had featured something we do h"}, {"Review": "I would like to thank Sapere books and the Author for a free copy of this book in exchange of an honest review.4,5 Stars rounded to 5 Stars.This book was a very agreeable surprise after hitting a rather long slump with thrillers lately. Danny Sanchez, a journalist half british half Spanisch and working in the fascinating Almeria Province in southern Spain, was supposed to simply cover the story of a house being demolished. There was a surprise waiting for them however, a body trapped between two"}, {"Review": "I would like to thank NetGalley and Endeavour Press for giving me the opportunity to read this which I voluntarily reviewed.This is the first book I've read by Mr Pritchard but I'll definitely be reading more.I was drawn to this book primarily because of the locations, Spain and England.As I live in Spain I could relate to the problems their beaurocracy causes.This is a very dark and graphic novel and is not for the faint hearted.The characters, both good and bad, are all well drawn and believab"}, {"Review": "I enjoyed reading this book. I got it as a arc e book from net galley. It had a good story to it. I liked the variety of characters in it. I hope to read more books by this author."}, {"Review": "Inhaltlich top! Aber der Schreibstil hat mich nicht vom Hocker gehaun, obs an der Übersetzung lag oder wirklich so stockend ist, kann ich nicht beurteilen."}, {"Review": "Scarecrow by Matthew PritchardPublished by Salt Publishing.“When Danny Sanchez, a hard-bitten journalist working in the Almeria region of Spain is sent to cover the demolition of the home of a retired expat couple, he lands a much bigger – and more grisly – story than he bargained for. As the diggers begin to tear down the house, a body, partially decomposed, its face swathed in a strange black sheath, is suddenly revealed dangling in the depths of the brickwork…”There’s been an asesinato. In fa"}, {"Review": "‘How could that be? Fifteen years later and here was another body, exactly the same.’Danny Sanchez, a journalist working in Spain, is covering the judicial demolition of a villa belonging to Arthur and Peggy Cooke, an ex-patriate British couple in the Almería province of Spain. It’s a sad event for the Cookes. They were one of eleven families whose homes are to be demolished for construction irregularities. Danny has been covering the story for some time: construction irregularities are a huge i"}, {"Review": "WOW WOW WOW!!!!This is a new author for me and OMG what a read.Danny Sanchez is a journalist and while in England he covered the Scarecrow killings a set of grisly murders where young men are tortured, castrated and their faces made up using gaudy makeup. The killer was caught and now resides in Deepmere a psychiatric hospital. Danny leaves England for pastures new and moves to Spain. He is covering a humanitarian story of an English couple who are having their home demolished due to not having"}, {"Review": "After reading Matthew Pritchard's Stolen Lives (a suspenseful mystery based on Spain's baby trafficking scandal), I found Kindle Unlimited offered Pritchard's Scarecrow, the first in the Danny Sanchez novels. It turned out to be a serial killer plot that was gruesome, but suspenseful. Set in Spain and London, journalist Danny Sanchez deals with problems with his newspaper, his mother, and a breaking story concerning a body encased in the walls of a house in the process of being demolished.In thi"}, {"Review": "Scarecrow is the debut novel by Matthew Pritchard, credit where credit is due, you would never know that this is his first, a crime thriller, with a really heavy leaning on the thriller part, Scarecrow is absolutely gripping from the off through to the end, Pritchard confidently does not bother to waste time describing things down to the finest point of minute details which is my usual gripe with this kind of novel, instead using a couple of sentences to set the scene using very well written cha"}, {"Review": "A page turner! First in a new gripping thriller series: A crime thriller from a different perspective: that of a journalist. Danny Sanchez is a young reporter with a Spanish Newspaper. He’s bilingual: English and Spanish having been brought up in England.A mutilated body is discovered hidden in the structure of a new house. Danny covers the story and it isn’t long before Danny manages to lead the Spanish police to uncover another body similarly mutilated and hidden. Although the Spanish Police d"}, {"Review": "Action from the startOverall, a very enjoyable book. Danny Sanchez, a reporter for a local ex-pat newspaper, is attending the demolition of the home owned by an English couple when a dead body is found hidden within the walls of the house. Chillingly, something about the body reminds Danny of a case he covered in the UK several years ago. He is determined to investigate – is it a ‘copycat’ murder or worse, is it linked to the old case and has the killer moved to Spain? The action moves along at"}, {"Review": "Intriguing, suspenseful and insightful, Scarecrow is an unpredictable thriller that held my attention and didn’t let go. The funny thing is that I lived in Andalusia for decades and Matthew Pritchard really seems to get its culture, traditions and quirks. He applies his keen journalist eye and exposes some of the most unsettling aspects of life in Southern Spain. But the best part is the actual murder mystery, which spans decades over two countries and involves tons of suspects. Journalist Danny"}, {"Review": "This is a gritty crime thriller which is different in that the person investigating the crimes, is a journalist. Danny Sanchez moved to Spain several years ago but when a body is discovered buried in the walls of a house, he starts to suspect the murder is linked to a case he worked on in the UK. The ‘scarecrow’ was imprisoned in the UK and the Police were certain he was the killer but Danny has his doubts. He works closely with other journalists in Spain and the UK and together they piece it al"}, {"Review": "Danny Sanchez is a journalist who covers the demolition of a house in Spain. . And during this unjustified and cruel destruction of a couples home by the govt anise is discovered hidden in the wall. Sanchez recognizes something familiar between the condition of this body and something he covered in his past in England. And so begins the search for the serial killer behind these cruel and furious murders.This is an easy and fast read which is good because I found myself reading constantly to see"}, {"Review": "Meet Danny Sanchez of Book One of the Danny Sanchez Crime Thrillers by Matthew Pritchard. Danny is an investigative journalist located in southeastern Spain. Just as the local paper is faltering, victims of a probable serial killer surface. Very odd disposal locations and signature evidence on each victim. As Danny had worked as a journalist in Britain prior to his relocation to Spain, he returned to his prior haunts to link 10 year old unsolved serial murders to the current ones in Spain. At gr"}, {"Review": "Excellent new crime seriesDanny Sanchez is an interesting addition to the ‘detective’ genre. As a reporter for a local paper in Almeria his presence isn’t welcomed by either the local or the UK police. Consequently he has to resort to subterfuge in order to carry out an investigation nobody in authority appears to want to pursue.The author obviously knows the Spanish setting, and especially the British ‘expat’ community, well. He sets up an intriguing mystery and uncovers it in a way that keeps"}, {"Review": "Riveting readFor a debut novel ... this is a real page turner! Pritchard has done an excellent job with the characters; great lead character with lots of layers to him and the \"villain\" of the story is expertly crafted and not revealed until the final moments!!Will keep you on your toes with the pace and plot which flows so well and the description of Spain is flawless.I have never personally been but after reading this I feel like I was there as the writing was so descriptive it just made you f"}, {"Review": "Scarecrow is a well-written, gripping novel - not for the faint hearted! The author’s physical descriptions of the characters brought them to life in my imagination and his ability to describe the depths of depravity some are capable of left me horrified and gasping for breath. This was well balanced by a well-meaning, justice-seeking protagonist who relentlessly chased the truth using his investigative skills as a journalist. There are exciting, unforeseen twists in the plot which kept me guess"}, {"Review": "A thoroughly enjoyable read, I loved this book, full of investigate journalism to find a story after an dead body is found in a villa that is being demolished in Spain.Danny Sanchez is a likeable character. He has been doing a story on the villa's under threat of demolish where he lives and is there when the body is found. Furthermore, he goes on to find another body buried in a different house and informs the police. This one brings back memories from a story from earlier in his career called t"}, {"Review": "Though not usually a fan of serial killer plots, I was attracted by the idea of a main character being an investigative journalist. I'm very glad I went for it as I think I've found a new author. The author's real life experience makes the Danny Sanchez character all the more interesting. I particularly liked the added detail of Sanchez being bilingual and showing us Spain through the eyes of both the Spanish and the ex-pats. It kept me engaged throughout and I enjoyed the uncovering of the kill"}, {"Review": "Not my genre, but I really enjoyed the novel despite the rather awful subject matter. All through the book the situations Danny found himself in we’re just ordinary situations that basically did not require violence and shooting together out of. He used reason.Danny’s trip to Britain seemed to signal a change in writing style from sunny Spain to gloomy England, despite the fact that the mystery was starting to be solved.Danny was an ordinary bloke who had confront a horrifically disturbing probl"}, {"Review": "The book that got me into this fantastic author. You would never guess the book is Pritchard's debut, as the style is so assured: the characters are sharply drawn and believable, the dialogue is smart and witty, and the pace of the book is cracking. Pritchard is one of those writers who doesn't waste a single word. Highly recommended. "}, {"Review": "The book that got me into this fantastic author. You would never guess the book is Pritchard's debut, as the style is so assured: the characters are sharply drawn and believable, the dialogue is smart and witty, and the pace of the book is cracking. Pritchard is one of those writers who doesn't waste a single word. Highly recommended. "}, {"Review": "**Four and 1/2 stars!!In a word: A nail-biting murder mystery with a distinct European flavor, steady pacing that leads to an exciting finish, and characters with depth and humor.It was a long time since Danny had been in a house like this: the sofa with its neatly arranged cushions, lace doilies set out on the coffee table, a valance above the window made to match the fabric of the curtains. Leather-bound volumes of Reader’s Digest were arranged in the bookcases that lined the walls. A carriage"}, {"Review": "Had the opportunity to review the book for Sapere Books - not sure if I would have purchased this or not. However not the best book I have read - I struggled to get into the book but did persevere til the end. Unfortunately I found the story really slow. "}], "ID": "18669528", "Name": "Scarecrow (Danny Sanchez, #1)"}