{"Name": "A Spark of Light", "Image": "https://images.gr-assets.com/books/1524516512l/39072210.jpg", "Reviews": [{"Review": "\nWe are all drowning slowly in the tide of our opinions, oblivious that we are taking on water every time we open our mouths.\nIsn’t that the truth? Regardless of topic, circumstance or person—and whether you have the guts or gumption to share it—deep down, we all have an opinion about everything. Each of us find ourselves walking through life, in our own versions of reality, shaped by past experiences, mistakes, upbringing, religion and oftentimes age. There are those who hold steadfast in their beliefs, some who waver after hearing a compelling argument and others that toe the rudimentary line of hypocrisy. Where will you stand after reading this mighty piece of compelling fiction? Is it powerful enough to spark change? Before you duck your head and try to sneak away quietly or raise your hackles in preparation to defend your stance on abortion, just know, that’s not really what this book is about. I see the big takeaway as being the acknowledgment that there are always multiple points of view in every argument; even if you don’t agree with them. Regardless of what side you find yourself on—pro-life or pro-choice—this story will expose you to BOTH. It’s a conversation starter, in the least.Will Jodi Picoult make you examine your own stance on abortion and why you hold those beliefs so tight?—you bet. In typical Picoult fashion, she doesn’t play it safe. In fact, she’s BOLD and unrelenting in her examination of each and every angle of abortion. She’s also balanced, informative and unafraid to open that contentious can of worms. Her body of work is thought-provoking and feels incredibly important on some level; even more so given our current political climate. I guess you could say, Ms. Picoult wowed me with this one.Not only was I impressed by her approach to the topic itself, but by the cast of characters she created to tell the story and the structure in which she chose to tell it. Told completely in reverse, things could have gone one of two ways. Fortunately for me, I landed on the side of appreciation. Picoult telling the story in this manner allowed me to be an active participant—piecing together some aspects of the storyline that might have been less impactful if told in the typical sequence. It’s a different experience starting with the end—well most of it—and working your way back to the beginning to uncover how each character came to be at the The Center the very morning a crazed gunman opens fire. The timeline might lead you believe you know exactly how the story is going to unfold, but don’t be so quick to jump to conclusions. Ms. Picoult has a few well-played tricks up her sleeve.More than anything else, it was the cast I found myself completely enamored with. Well, the majority of them.Topping that list was Dr. Louie. A man raised Catholic in the south, he was a lone flower blooming brightly in a fire-scorched forest. Somehow, he managed to look past his own religious beliefs to fill a void few others would—simply because he felt in his heart it was the right thing to do. I wholly admired his sacrifice, compassion, and his use of “verbicaine”. Reading in the Author’s Note that his character closely resembles an actual doctor, one Picoult spent time with during her research, made my heart skip a beat. To know there are superheroes of his sort out in the world right now, left me with some semblance of hope.Second up was Hugh and his fifteen-year-old daughter, Wren. Growing up motherless—especially when she makes the choice to leave you behind—probably isn’t easy, but Hugh did he damndest to make sure Wren never felt that absence. Their bond over stars and space spoke to me on some entirely different level. The reality is though, there are some things as a teenage girl that you just can’t voice to your father. And I would be remiss if my love-obsessed heart didn’t mention Izzy. I can’t say much, for fear of giving anything away, but her naivety in thinking things could never work out with her fiancé because they came from different backgrounds was gut-wrenching. Color me smitten with their storyline.I guess by now, I’ve made my point—this was a FANTASTIC experience for me. I’ve lost count of how many of Ms. Picoult’s books I’ve read over the years, but one thing I know with certainty, this has earned the top spot. I’m hopeful this story will spark even more discussion about what it means for women, in this day and age, to have their reproductive rights so tightly controlled. To not have a say when it comes to your own body and health not only feels unfair, but wrong.\n“Laws are black and white. The lives of women are a thousand shades of gray.”\n*I don’t know how I ended up with the most amazing #bookbestie EVER, but I did! It might have been my incessant whining or non-stop musings about the pretty cover, either way, she pulled it off and landed an early copy in my hands. I can’t say it enough—THANK YOU, Haley! I owe you big time.*"}, {"Review": "\nShe wondered if the only way any of us can find what we stand for is by first locating what we stand against.\nI got a really pleasant surprise a couple of years ago when I picked up Small Great Things on a whim and discovered that Picoult is actually much more vicious and hard-hitting than I'd expected. Her covers look like chick-lit, but it seems she takes very current, often controversial, topics and examines them through the eyes of complex and relatable characters.However, I think this book doesn't quite hit the emotions it's aiming for. The novel is so focused on the issue and providing lots of information that it often becomes a dry and dispassionate read. At times, A Spark of Light reads almost like an \"Abortion Myths Dispelled\" pamphlet. I still want to give it three stars for what I'm tempted to call an important or even necessary read, but I don't think it dives much deeper than the surface.Picoult tells the story of a gunman barging into Missisippi's only abortion clinic and taking the doctors and patients hostage. We soon discover that the shooter is a man called George whose daughter recently had an abortion. The story takes place over a single day and is told in reverse, moving through the perspectives of many characters who all have different circumstances and agendas.Picoult's characters are quick to point out inaccuracies in the arguments of anti-choice protestors but, overall, the perspectives are relatively balanced. There are no monsters on either side and the author carefully explores why each individual believes what they believe. Dr. Louie Ward (based on real-life abortion provider, Dr. Willie Parker) is a Christian who offers abortions because he believes it is his religious duty to offer compassion instead of judgement to women; Joy is at the clinic because she just had an abortion; young Wren is seeking contraception; Janine is an anti-abortion activist who is there to infiltrate the clinic. This is just a sample of the characters. Outside, the hostage negotiator in charge is Wren's dad, and elsewhere a girl called Beth faces murder charges for illegally terminating her own pregnancy. The characters are diverse in race, wealth, and sexuality.Lots of viewpoints are covered, as are the laws that make Mississippi the most restrictive state on abortion. The dialogue and internal monologues of the characters feel somewhat didactic, though perhaps that was unavoidable. Many conversations exist to educate the reader on the realities, laws and myths of abortion, and honestly it feels like it. Though the characters' situations all seem likely to evoke sympathy, the book itself is too lesson-driven to offer much in the way of emotional attachment.The unusual timeline of the novel also didn't really work for me. I'm not sure I understand it's purpose. By beginning at the end, we know most of what will happen, and the few details intended to surprise us are not actually that surprising.It's undeniably an informative and well-researched book on a hot topic, going so far as to consider the relationship between abortion politics and race politics. It's unfortunate that, though interesting, the book seemed to hold me at a distance from the characters-- perhaps the author's decision to try to equally portray such opposing viewpoints made it impossible to ever really get close to either one.If you do read the book, be sure to read the author's note. Some of the best conclusions on the abortion argument are in it.CW: Racism; abortion; gun violence; mentions of rape and incest.Blog | Facebook | Twitter | Instagram | Youtube"}, {"Review": "***NOW AVAILABLE***I am either hit or miss with this author and for me this was a miss. I knew from the blurb, which is incredibly extensive, that there will be a shooting at a women’s health clinic where abortions were being performed. I did not know however that this book was going to be entirely about abortions. This was not particularly a problem for me but here is why I didn’t really enjoy the book.First of all the book is told in reverse order so we already know the ending after the first chapter. For me this took away any mystery or intensity that I would have felt had the book been written from beginning to end. I have read other books written in this fashion but this one just didn’t flow right for me. It felt choppy and actually I got bored with it, that’s my honest opinion.The book then continues introducing characters and why they are at the clinic that day. There were a large number of characters and it took a few chapters to keep them all straight. There is the owner of the clinic, the nurse, the doctor, a woman that has just had an abortion performed and other women that are in the waiting room. I think a smaller cast of characters would have been better, particularly since at the ending I felt as though I didn’t know really know how the day ended for many of the characters. I felt there were too many loose threads.I kept waiting for the twist at the end that other reviewers had written about. When it was revealed I found it to be relevant of course but not really believable. I can’t say why because that would be a spoiler, but I don’t think it would be possible for a woman to keep this secret for so many years nor why she would feel she had to.I did care for many of the characters and how hard their decisions were for them. I feel that a woman’s body is her own and I don’t have the right to tell her what to do with it. So I can honestly say that I am pro choice. However, that said, Ms. Picoult chose to portray all of the protesters as religious zealots, uninformed and uncaring. I’m sure that just as there are many reasons for women to be deciding on an abortion there are equally many reasons why people may protest or be against abortions and it is their right to protest, legally and not abusively. I don’t want to judge those people either. In the author’s notes Ms. Picoult states “I interviewed pro-life advocates. They were not religious zealots; they were men and women who were speaking from a place of deep personal conviction. All of them were appalled by acts of violence committed in the name of unborn children”. However in the novel she did not describe any of the protestors in this manner, I kept wondering why?Reviewing this book as a work of fiction is difficult for me. I expected more of a story which would keep me interested, flow well and could be informative. I gave it a 3* because I still believe Ms. Picoult is a wonderful writer and there is some good writing here. Based on my honest feelings however I would not recommend this book.I received an ARC of this novel from the publisher through Edelweiss."}, {"Review": "My reviews can also be seen at: https://deesradreadsandreviews.wordpr...As soon as I see that a new Jodi Picoult book is going to be released, I can't wait to read it. But as much as I wanted to drag out this novel and make it last, I couldn’t stop reading. I had to find out how it all began…and how it all came together in the end. This novel is written in a way I wasn’t sure I would like. But I actually really enjoyed how the story was told. The book begins at five pm and moves backward in time with each chapter one hour earlier than the previous chapter.“The Center” was formerly known as The Center for Women and Reproductive Health. Due to the restrictions designed to make these centers disappear, The Center is now the last clinic of its kind in Mississippi. Though it’s been through many battles the fluorescent orange building is still standing, offering services and support to those who come through its doors. It is a safe space…until the day a distraught and desperate man barges into the building, opens fire, and takes everyone inside hostage.We learn the stories and hear from a variety of people inside The Center. What brought these people together on this fateful day?Fifteen-year-old Wren doesn’t think today is a good day to die.Hugh McElroy is a hostage negotiator and has dealt with all types of hostage takers. Some are drunk or high, some are on a political mission, and some are depressed and determined to take others with them. But this hostage situation is very different. In fact, Hugh should have stepped down and let someone else take over.Dr. Louie Ward is a fifty-four-year-old ob-gyn. He decided to become an ob-gyn, in honor of his mother. Dr. Ward attended mass faithfully but also became an abortion provider. He wanted women to feel that they were not alone. He knows the protestors don’t realize just how many people they know have actually visited places like The Center ……”\nWipe away the stigma and all you were left with was your neighbour, your teacher, your grocery clerk, your landlady.” \n George Goddard knew he hadn’t been the best husband, but he was determined he would be the best father possible. “It was why, this morning, he had driven all this way to The Center, the last standing abortion clinic in the state of Mississippi”. Three hours away in another part of Mississippi is seventeen year old, Beth.  She is terrified and alone and has just found out that she’s being accused of a horrible crime.Those are just a few of the characters we meet in this story. Just like in real life, we have people with many different views. I thought the characters were well-developed, their stories intriguing and heart-breaking. They are all very different yet have more in common than they would have ever thought possible.As I mentioned earlier, the way this story is told is a bit different. But in the end, I thought it was the perfect way to tell this story. I’m sure this novel will spark debates and there will be a variety of opinions. I understand it may not be for everyone. Regardless of opinion, I feel that many people will still find this book interesting and thought-provoking.I have been reading Jodi Picoult’s books for years. Her books bring important issues to the forefront, using ordinary people’s stories. In my opinion, “A Spark of Light” is another incredible and unique novel. This story will stay with me for a very long time.“It stood to reason that both life and death began with a spark of light” I'd like to thank Ballantine Books for providing me with an advanced copy of this novel."}, {"Review": "Author Jodi Picoult is no stranger to controversy, and it seems somehow fitting that she should tackle the contentious issue of a woman's right to abortion in this, her latest offering. Set in a women's reproductive health services clinic, now becoming a rare commodity, the story kick starts with a bang with a desperate gunman shooting at those within the clinic and holding them hostage. The narrative then proceeds to go back in time to the start of the day for the wide cast of characters present and the multiple reasons for their presence at the clinic. This includes clinic staff, pro life people, the desperate gunman's tale, and clinic clients. Outside, Hugh McElroy is the police hostage negotiator, alarmed to discover his 15 year old daughter, Wren, is inside the clinic with her aunt, his sister.Picoult takes an incredibly balanced approach, showcasing her impressive research skills on this incendiary topic of reproductive rights. She presents the science, the legal, religious, cultural norms, state differences, national and international angles, not to mention the issue of race, making this a novel that is thought provoking and prime material for book club discussions. She captures the intensity of the feelings people have on the topic, both pro life and those who uphold a woman's right to choose, exposing the misinformation peddled in the arguments. This is a story with plenty of tension and suspense, and the unexpected, which I found both gripping and timely, given what is happening in the world today. As such, this is a novel that I recommend highly. Many thanks to Hodder and Stoughton for an ARC. "}, {"Review": "Audiobook...Narrated by Bahni Turpin, and Jodi Picoult Favorite line: from Jodi Picoult...( reading this part herself), in the author’s notes:“Laws are black and white;lives of women are shades of gray”. I also agree with this statement: “I don’t think we, as a society will ever see eye to eye on each other’s point of views....but it’s important to have conversations and talk with each other”. My reasons for only 2 stars:.... I didn’t think much of the storytelling ofthis topic. It felt cold and controlled to me....even manipulative... too crafted.. lacking sincere emotional connection with the characters thatwe should have been caring about. I had reserved this Audiobook from the library and I received it the day it was first released. I knew I wasn’t highly excited to read it: more curious. I never requested an advance copy fromNetgalley- because I suspected this entire topic would feel like a no-win satisfying experience. I was hoping to be wrong. I wasn’t. ( for me).I’m a female who isn’t blind to what’s going on regarding this issue. I listen to the news. I’ve had many conversations about women’s choices - the government- etc. I know many women who have had abortions. I haven’t.... but had I been raped, or too poor, or too young, I would have. I didn’t have the stomach for this book.... neither the drama or the parts that dragged. I wasn’t a fan of the writing.At times descriptions felt pretentious. Other times childish. I especially didn’t feel this book worked as an audiobook.I’m not a fan of books - or a fan of myself, when I ‘press on’....while my inner voice isn’t peaceful - in partnership with the author’s purpose. I had too many debates in my own head about a fiction book on this issue. I wasn’t feeling aligned with the storyline.I’m not blaming Jodi, I’ve enjoyed at least 3 or 4 of her other books...but I didn’t enjoy this novel enough to recommend it. My inner voice was too critical throughout. The most important part of this book is found in the Author’s notes: ‘factual’ statistics.... which anyone could read in 10 minutes while they’re in a bookstore or library. I’m guessing I’m a rare bird - read other reviews- Other readers may have found this book extraordinary and powerful. You may too!  Honestly... I’m so glad I’ve finished this one."}, {"Review": "\"Today, Wren McElroy thought, was not a good day to die.\"This book begins with a hostage situation at the local Center. The Center is a place for women (and teens) to go and get birth control, have gynecological examinations, and obtain abortions. It is known as a woman's reproductive health services clinic. Naturally there are those who do not want such a clinic in their community and there are those who are thankful that it is there.One day a man bursts into the clinic and begins firing. Another man, Hugh McElroy, a police hostage negotiator is called to the scene. He has been getting a flurry of texts from his daughter and learns that she is inside the health clinic and is one of the hostages. He also learns that his sister is with Wren and has been injured.Wren and her aunt are not the only hostages. There are others and through the story we get to learn about each character, his/her past and why they are in the clinic that day. They either work at the Center or they are there for services. We are given each of their perspectives. This book is told in reverse. It starts with the hostage situation and goes back in time to the beginning of the day. For some this reverse story telling may work, for others, it may not. There is also a story-line being told in this book apart from the hostage, in a different location, but is connected to the hostage situation. I wish I would have seen even more of this character in the book. I really felt for her plight and wanted to learn what ultimately happened to her. I have fingers crossed that possibly Picoult will write about a book about her and her plight.I requested this book without even knowing what the subject matter of this book would be, I didn't care as I enjoy Jodi Picoult. She never shy's away from controversial or uncomfortable subject matter and always does her homework. Some books I enjoy more than others. This was certainly the case with this book. What I appreciated the most was that this book was not preachy. The reader is never pushed to be pro-life or pro-choice. No matter where readers stand on abortion, I believe both sides will appreciate this book. As I said, it is not preachy and does not ask the reader to pick a side. In the Author's note she gives statistics and cites laws. I also enjoyed how she gave back story on the characters and his/her reason's for being at the clinic that day. I am teetering back and forth between a 3 and a 3.5 star rating for this book. I will admit, I wasn't a fan of how this book was told in reverse. I might have enjoyed it more if it was told from beginning to end instead of end to beginning. What worked for me in this book were the various voices as I stated above. Plus, there is a little secret revealed at the end which leads to an aha moment. I appreciate that she took on such important and timely subject matter. Regardless of where one stands on the issues, I think she did a very good job of telling the story. Thank you to Random House Publishing - Ballantine and NetGalley who provided me with a copy of this book in exchange for an honest review.Read all my reviews at www.openbookpost.com"}, {"Review": "I tried to like this book, I really did, but I found it to be preachy and boring as batshit. I kept finding excuses to put it down and not get back to it, which is unlike me. The reverse chronology of the chapters I found to be disjointed and annoying, and because of this I couldn't connect with any of the characters. And a graphic abortion scene? I mean really? Does anybody need to read that? I know this is Jodi Picoult and it will probably be a mega seller, but it just didn't do it for me.My thanks to Allen & Unwin for an uncorrected proof to read and review. The opinions are entirely my own."}, {"Review": "3.5 rounded up.Jodie Picoult is a prolific writer, and if you’ve read any of her books, you know she confronts head on some tough, controversial and always relevant issues. This one couldn’t be more timely with this predominantly conservative Supreme Court we will more than likely have, who could possibly reverse Roe v Wade. We see mass shootings and hostage situations too frequently on the news. This book takes us inside a hostage situation, where people are shot inside an women’s clinic that provides abortion services. Picoult has done a terrific job of reflecting both pro-choice and pro-life points of view. Most people who read this book will probably have their own opinion on the issue, and what happens here most likely isn’t going to change that. At the very least by giving us characters with different perspectives, those who want their babies, those who don’t, or those who do, but just can’t because of circumstances, she gives us a chance to see things differently from where we may stand.I’m not going to focus at all on the plot, but rather on the number of things that I liked about this story. I liked how the hostages, some of whom didn’t know each other connected. I liked how Picoult moves rapidly from character to character and gives us each of their stories. In this cast of characters, my favorite was Louie, the abortion doctor, who was pro-life but wanted those who wanted an abortion to have it safely. He remembers his mother. It made me think about how easily we judge people without knowing what they have experienced. It made me think about the victims of these types of crimes and of how little we know them except for a few things they tell us in the news. What didn’t quite work for me was the structure of the book which reads backwards in time and I’m not really sure why. It didn’t add anything to the story for me. It felt repetitive at times. There were a couple of relationship twists which I guessed, but ultimately did made sense for the story and were realistic. Picoult could have been preachy, but she wasn’t. She has written a thought provoking story, one that encourages dialogue. In the end what I liked about the book outweighed what I didn’t like so I will round up it to 4 stars. I received an advanced copy of this book from Random House Publishing Group - Ballantine through NetGalley."}, {"Review": "4.5 Brilliant and Harrowing Stars* (rounded up)With “A Spark of Light” Jodi Picoult does it again! This time however, the path she takes to get to the finish line is a little different.As we all know, Jodi Picoult is no stranger to controversy. Nor does she shy away from topics that others would never conceive of. One of her many talents lies in her ability to remain neutral while weaving stories about the most contentious of subjects. This is one of those times. In “A Spark of Light,” several women find themselves in a bad situation. They are either there by choice or by need. The end result however, is the same. A gunman has arrived at “The Center” (a women’s reproductive health clinic), and he has a bone to pick. Hugh is the hostage negotiator and he is trying to calm George Godfrey, the gunman down, while also trying to keep it together himself. Why, you ask? Both Hugh’s teenage daughter, Wren and his sister Bex, are inside and he doesn’t know why. Will it become a choice they live to regret? Janine is a Pro-Lifer. Whatever her reasons were for going to the clinic got thrown out the window when Joy, a woman who just had an abortion, needed help. Can Janine and Joy put their views aside and help each other during this trying time?Dr. Ward is the Clinic OB-GYN. He is also a Pro-Lifer, who has made it his life’s work to help women get abortions safely, when the alternative is unthinkable. Now it is his life that hangs in the balance. Izzy is a nurse at the Clinic. She is doing her best to calm everyone down in the face extreme danger.Beth is underage. In Mississippi, having an abortion under the age of Eighteen without the consent of a parent or a legal guardian is Illegal. Beth had a choice to make and now she is paying the ultimate price.“A Spark of Light” is one of Jodi Picoult's most challenging and controversial books to date. Abortion is a very hot topic in the United States. You can’t turn on the news, flip open a newspaper or search the internet without the topic cropping up. Everyone I know feels passionately about this subject, I know I do. That said, in this book, Jodi Picoult does a brilliant job of keeping her thoughts neutral, making it such that you feel for each person and each party (whether it’s Pro-Life or Pro-Choice) and have more compassion for everyone involved and that is one heck of a feat. Ms. Picoult accomplished the same achievement in one of my favorite novels of hers, “Small Great Things” and that speaks volumes. “A Spark of Light” was told by multiple points of view, in reverse chronological order, starting with 6 p.m. and working backwards to 5 p.m., then 4. p.m., and 3 p.m.,.. all the way back to 8 a.m. Personally, I felt that this created a different type of tension for each of the characters versus other novels. I didn’t know how they ended up that in that time or place or what their individual situation was.  Going back in time left me more curious, scared and wondering, heart beating faster, teeth chattering. Wren, Hugh, Joy and Beth!! These are characters in whom I became fully invested. Simply put, my heart ached each time theirs did.Certain moments, were expected and then BOOM! Eyes wide.. HEART freaking BURSTING out of my chest. Jodi Picoult got me. Again. To say I loved this is an understatement. It was powerful, breathtaking, brilliant.  This is a novel which I highly recommend, for the skillful writing, the way in which Ms. Picoult is able to write about challenging subjects without taking a side and for the brilliant characters whose hearts beat in tune with mine.A huge thank you to NetGalley, Random House Publishing Group - Ballantine and Jodi Picoult for an ARC of this novel in exchange for an honest review.Published on NetGalley, Goodreads, Amazon and Twitter on 10.14.18."}, {"Review": "4 fiery stars to A Spark of Light! ⭐️ ⭐️ ⭐️ ⭐️ As a fan of her writing, I have noticed Jodi Picoult’s topics have gotten more fiery as the years have passed, and they continue to be thought-provoking. The Center is a women’s clinic serving all their health needs. Everything changes when a man with a gun enters the building, begins shooting, and takes everyone hostage. My first questions are who is this man and why is he so distraught? I knew there would be more to his story. Hugh McElroy is a hostage negotiator for the police. He arrives on scene and completes all the typical first steps in a grim and terrifying situation like this only to have his phone buzz with the news that his teen daughter, Wren, is one of the hostages. Wren shares her story inside the building, while also shedding light on the other hostages, including clinic workers among others. There is Catholic Dr. Louie who believes he exercises his faith in his daily work. A nurse hero is also there. Also inside is a pro-life protestor who disguised herself as a patient that day only to find herself on the other side of the rage she herself was feeling. The characters in this novel are what make it a cut above. I felt empathy for each complex character; it was easy to with the way they were written. The structure of the book is interesting. It goes backward through the day of the stand-off. I enjoyed it because it was different, but I had to remind myself a few times the story moves backward retracing how everyone arrives at the clinic that day. As with all her books, it seems as if Spark of Light is meant to ignite a dialogue about an important topic to many. The storytelling is second to none, all the varied emotions are checked off, the research is firmly present, and the exploration of both sides is offered. Fans of Picoult should find much to love here. I’m ecstatically grateful I had the opportunity to read an early of this book. Thank you to Random House/Ballantine. All opinions are my own. My reviews can also be found on my blog: www.jennifertarheelreader.com"}, {"Review": "Didn’t care for this book, but there’s an asterisk on that. First, I love Jodi Picoult. Her ability to see something from every point of view is the kind of extreme empathy we need more of in this county. I also love the vision of this novel. She examines abortion from the top of the iceberg and slowly works down to the broader scope of the issue, both from the perspective of pro-choice and pro-life characters.It was a risky move to write this in reverse chronological order, where every chapter goes back an hour. It paid off thematically and fit her vision well, but also created an awkward reading experience. Worse than the reverse order, however, are the multitudes of mini sections that jump point of view. I didn’t count, but there must’ve been 20 major characters, few with any kind of spotlight role. The struggle to keep track of everyone was very real. Now, I listened to the audio version which may have made it harder on me, but looking at the psychical copy I don’t think paper would’ve been any better. She uses a double space to signify character change, and each character only gets 1-2 pages before it shifts again. Had each POV shift been given a chapter number, there would likely be 200 chapters in the book. Yikes!For the vast majority of the time I listened to the book, I had no idea what was going on. I knew there was a shooter and I could remember vague sketches of character back-and-front story, but ultimately i was only able to finish by enjoying the moments of internal dialogue or occasional dramatic moment when Jodi would bring the news to life.OVERALL: while I didn’t enjoy reading A Spark of Light, I have to give kudos for its thematic success. It’s one of the few novels to really discuss abortion in a meaningful way. Actually, it’s the only one I can think of. I wish there had been fewer characters, but I also can’t see any other way to examine an issue this far-reaching. To best enjoy it, consider making a character cheat sheet as you go along so it won’t be so confusing."}, {"Review": "It’s been years since I’ve read Picoult. It’s been so long that I can’t recall which of her books I did read. This one begins at an abortion/women’s health clinic during a hostage crisis. Told in reverse chronological order, the story examines the abortion issue from both sides by presenting characters who wind up in a hostage situation for a multitude of reasons. Some are there to terminate or to prevent a pregnancy. Some are there to perform the procedure or to assist in other ways. Others are there to protest. Each has their own story, including the gunman (and his family) and the negotiator (and his family). This hot button issue is handled fairly and the research seems to be solid but I didn’t care for the reverse order of the story which minimizes rather than enhances this novel and you see the big reveal coming from a mile away."}, {"Review": "\nIt stood to reason that both life and death began with a spark of light\n5 Powerful & Thought Provoking StarsIt's a fall day and women are driving from all over the state to The Center for Women in Jackson Mississippi because it is one of the few places that women in the state can go to receive care. This includes birth control, cancer checks, ultrasounds and yes, abortions. Mississippi has the strictest law (15 weeks) that you can have one. Outside the doors, there are protesters everyday trying to change minds.Wren, a high school student goes there with her Aunt Bex to receive some care. All of a sudden a man comes barreling in and shoots the owner. He then goes on to try and shoot the doctor and any nurses that are there. This turns into a hostage situation and among them are cancer patients, women who recently had abortions, women there for birth control and women there for exams. The next few hours the hostages try to work together to save each other but also learn about each other and share experiences. Justine, a pro-life advocate shares her stories and secrets and Izzy, a nurse who ends up taking care of some of the shot patients also shares stories while trying to save lives. The real question is, is there a right side to this argument?Regardless of your stance on abortion, I think that this book does a really great job of showing both sides of the table. That's one thing I love about Jodi's books. She always completes such throughout research when writing her books and tries to show both sides of the issue at hand. This book is not overly emotional but it definitely stirs up some internal emotions based on what side of the issue you fall on. One theme I loved about this book was the Father and Daughter relationship. There are two main Father/Daughter relationships throughout the book and they were similar in many ways but at the end they became complete opposites. This book made me think about my Dad and what he would have done if he was put in either of their situations. Regardless of what each Dad chose, I felt they were acting on their own instincts to do what they thought was \"right\" for their daughters.The book is written from almost finish to start. I say almost because there's a short epilogue at the end to finish the story. Some people have criticized this writing and said it \"gave away\" the story but I understand why Picoult wrote it that way. I actually thought the suspense and emotions built as we continued to go back. A lot of the time I was asking myself \"What made them do this or that?\" \"Why did they choose this path?\" \"What happened in their past?\" As the story continues to go back all of these things reveal themselves and it all comes together. I personally liked it.Also....the ending. I said WHAT twice. Even though this is definitely not a thriller or suspense novel, Picoult always puts a few twists at the end. Gah, I just love her writing. The topics she tackles and the balance of storytelling is unbeatable. Can you tell she's my favorite author? :)All you Picoult fans, pick it up (if you haven't already). Those who are on the fence - read it. It's a winner!"}, {"Review": "Oh my god you guys, I actually read this book months ago and I’m still thinking about it today. As soon as I received a copy I dropped everything and started it and it totally blew me away. It has her trademark hard hitting subject matter and deeply moving storyline and she rips her storylines straight from the headlines like no ones else does. If you read one book I recommended this year I urge you to make it this one, I feel like we can all learn something profound from this book.The structure of this was amazing, it’s told in reverse order which always sounds super confusing but if it’s done well then it’s a little bit of magic and if anyone has the magic touch it’s Picoult. I don’t know how else to describe her writing other than to say it’s beautiful and even poetic at times and she’s writing about this god awful tragedy and still hope and beauty shines through.Abortion is arguably one of the hottest of hot button topics of all time and I so admire how Picoult examines the issue from every single angle you can think of, and also from some you would never think of yourself. She forces you to consider your own personal values and morals while doing so sensitively and with so much respect. I don’t usually expect straight up fiction novels to be twisty but she also manages to throw a knock down punch (or two) that made me gasp in disbelief. This book was total perfection in my eyes and I cannot wait to see where she takes me next.Spark of Light in three words: Profound, Emotional and Incredible."}, {"Review": "A Spark of Light by Jodi Picoult is a fictional title that tackles the very tough subject of abortion so it may not be for everyone. The story is one that doesn’t take sides but instead tries to shed light all around in a suspenseful setting. The format is also a bit different and unusual in the fact that the author chose to start at the end and go backward from there counting back the hours and one horrific day in the small community clinic.Now, for me I very much appreciate what the author tried to do with bringing this subject matter to light in a truly thought provoking read. However I’m not sure I was a fan of the format of this story when all was said in done. To be honest the first chapter or the first “hour” of the story beginning in the late afternoon was like being dropped into a warzone and a bit hard to follow when you know nothing about the characters or story and are just trying to grasp the plot.On the other hand after the first couple of hours of the day counted backward and I began to get to know the situation and characters the author’s wonderful writing really shined through. The entire middle of the book is where the meat of the story lies that will make one think and care about what is going on and the characters themselves shine through. At this point i shows why I like to give each book a chance and not give up early because at that point my rating obviously went up.When all was said and done with the book however I began to question again how I felt about where the story had gone, the format, the subject overall etc. I have to admit the end was a bit of a let down and felt it sort of fizzled after the fiery beginning and I wasn’t quite sure I found everything believable at that point. So weighing all of my feelings throughout this books I decided to go with a 3.5 rating on this one with the ups and downs but a solid story altogether.I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"Review": "This review and other non-spoilery reviews can be found @The Book PrescriptionBR this with Dr.TalaActual Rating: 3.5 stars “If we are meant to only have children who never encounter difficulty in life, then no one should be born” 🌟 This is my first book by Jodi Picoult who I have heard lot of good things about. I always avoided her books for no good reason, I just thought that they may be hyped and I wanted to give her a chance. Once I saw she was releasing this book and I read the synopsis I thought this is the book that will change our relationship.🌟 I like books that deal with medical topics specially that they are topics usually avoided for being heavy and dark ones. I don’t think it is a matter of enjoying it or not but rather than it changed something in me as a future doctor.🌟 The book started out really good and chapter 1 was amazing and I knew I would like the book, this chapter ended with a cliffhanger and it was actually the second to last chapter in the book, so the story starts from the ending to the beginning. I am not sure that I liked that and it was a bit confusing at some points and need some time taking to. I didn’t think it added anything to the story, it made the beginning good but I was less thrilled throughout the rest of the book. I mean if a character is alive by the end of the story then she must have survived an incident in chapter 3 for example for sure. (This is not an actual example from the book!).🌟 I like the writing style and I highlighted 10 great quotes on my e-reader! I heard that this is not Picoult at her best which means that she is even more awesome than she was in this book!🌟 And I need to point out that this was one of the most medically accurate books that I have ever read, I think she did a great job in the research. And she seems to go with Pro-choice more than pro-life but she doesn’t force that on readers. She just provides examples and situations that makes you compare the 2 POVs and decide for yourself! I really like that as it shows how different people think.“Just because it’s legal doesn’t mean it’s right”🌟 Every once in a while I need a wake up call as a medicine student. We tend to forget that we interact with people at their weakest states in our jobs which is emotionally draining. This was my wake up call!“The thing is, if you saw the stuff I do every day on the job. you’d do anything not to feel”🌟 Summary: A good book with great writing and it deals mainly with abortions. It provides insight to different opinions regarding that matter in a balanced way. I just didn’t like the reverse narration which had a more negative than positive impact. Definitely reading other books by Picoult in the future!Prescription: For those who are interested in the topic of abortion and for medical students in general!"}, {"Review": "Jodi Picoult is one of those reliable authors that manage to keep you turning the pages with every one of their books that you read. I was really excited to read her new one A Spark of Light because I know she always delivers the goods! A book that grabs at both sides of the story, sucks you in and brings in all the feels! This time it is about abortion.Hugh is a police negotiator called in to talk to a gunman after he opens fire at an abortion clinic. Things get very complicated for Hugh when he discovers that his 15 year-old daughter is in the clinic with his sister. Can he get this gunman to spare the hostages? Why did he open fire?As always, characters and human relationships are front and centre in this tale. Each character has a unique story, encouraging the reader to empathise with them no matter what their viewpoint. The women in the clinic, the police negotiator and the gunman himself all have a story to delve into and she does it so well! Although I struggled to empathise with the gunman, I still found myself getting sucked into his story.I loved the way this story was written. It starts at the end and then makes it's way back one chapter at a time. I thought I would get confused, but Picoult is a master at what she does. It flowed cleverly and seamlessly and there was no confusion at all.The one thing that I didn't like about this book were the twists. I saw EVERY single one of them coming. Certain things were put into place earlier in the novel that I found to make things really obvious, so when the big reveals occurred I was left feeling slightly underwhelmed. However, hopefully that's just me, and others reading will not have that problem.The subject matter is controversial of course, and like the majority of her books - she makes you think. And I certainly did ponder what my personal views were, not so much on being for or against abortion, but more about the technicalities of when is a baby actually a baby, and where exactly does that line between the rights of the unborn and the rights of the woman meet. As always, Picoult has done her research. A LOT of research. There was a particularly graphic medical procedure scene in there that unexpectedly took my breath away. It was done as tastefully as it could be, and it certainly made me ponder and re-evaluate my own beliefs. A lot of emotions were brought up, but it was worth it!Would I recommend A Spark of Light?Yes, if you enjoyed any of her other books I am sure you will appreciate this one. And if you haven't, it is certainly a good place to begin!*I received an uncorrected proof of A Spark of Light from Allen and Unwin and was not obligated to do a review.For more reviews check out my:BlogFacebookTwitterInstagram"}, {"Review": "🌠🌠🌠🌠🌠 5 Sparks of Light! No one tackles tough, controversial, timely issues, as expertly as Jodi Picoult.I have been anticipating this release for months – waiting, waiting, waiting – and I’m thrilled to report that it was every bit as wondrous and amazing as I’ve come to expect from this incredibly talented author. Her books always see me debating my own beliefs and opinions, and this one was no exception. There were questions raised throughout that I’d never ever considered. A Spark of Light was equal parts informative, emotional, and entertaining. I read it over a day and a half, neglecting other parts of my life in the process, in my rush to finish. Picoult presented all sides equally and fairly, without bias, leaving it up to the reader to make up their own minds. There were a couple of pages I had to skim read because I was too uncomfortable, but I think most readers will find themselves an emotional wreck at one point or another while reading, maybe not at the same point as me, but at some stage.I was torn over the reverse narrative that saw the novel opening at the close of the hostage situation, including the aftermath, and then working it’s way backwards in one hour increments. I hugely admire Jodi Picoult for doing something so bold and inventive, as a lot of work must’ve gone into structuring it that way. It was cleverly done how a character would reveal something about themselves, and then think about it at an earlier point in time for them, but further through the book for us. Meaning it wasn’t just a case of the author writing the end first and the beginning last, there was so much more to it than that and I was in awe while reading. The downside was that at the start of the book you had these characters who had survived this horrific experience, but you hadn’t yet experienced it with them, nor had time to form an emotional attachment. I recommend reading the beginning chapter again after finishing the novel, to gain the full emotional impact. My only other tiny complaint was that the last chapter felt a tad rushed and tacked on, and I would’ve liked a little more closure for a couple of characters, but I would estimate I was still 99% happy with the ending, and it definitely deserves all the stars, no question.Knowing the outcome for most of the characters, who lived, who died, who survived the hostage situation, etc, one chapter in, could’ve potentially been anti-climatic, but there were so many other things revealed about the characters along the way that were surprising and unexpected that it didn’t matter. All the characters had distinctive personalities, with interesting backstory’s, and a variety of compelling reasons for being at the clinic that day. I loved how two characters love of astronomy was often used to convey the dilemmas and obstacles they were facing, as well as various emotions they were experiencing, and also the explanation for the book title.Not to be missed! Drop what you are doing, and start reading."}, {"Review": "Where to start with this review? To start, A Spark of Light wasn't what I was expecting. I've read several other books by Jodi Picoult and they've all been full of tension and suspence that kept me glued to the pages. The beginning of this one was just that, an explosive, heart-stopping moment that immediately grabbed my attention. Unfortunately, for me, the main body of the book slowed considerably and was more about abortion than the hostage situation. Hugh McElroy, the hostage negotiator, discovers that his sister, Bex, and his fifteen year old daughter, Wren, are two of the victims being held hostage in the clinic. This is an interesting twist in the storyline, allowing the reader to get to know both characters from different perspectives, giving it a bit of mystery and suspence . I also enjoyed reading the individual stories about the circumstances that brought each person to the clinic that fateful morning. But the storyline lacked the momentum to hold my intrest throughout the bulk of the book and I really struggled to get to the end. I really wanted to like this book so I was determined to finish it and I'm happy I did! I really enjoyed how the story ended and it was worth reading.The story is also written with the chapers in reverse order. The most recent events are at the beginning of the book and going back in time. I didn't care for this format as we learn the story ends in chapter one, taking steam out of my desire to read the middle of the book. This is definitely not the caliber I expect from Jodi Picoult but I'm I have on a number of her novels on my shelves that I'm excited to read. So, overall, this wasn't a book for me but may be more enjoyable for other readers. With thanks to NetGalley, Ballantine Books, and Jodi Picoult for this digital ARC for me to read in exchange for my honest review."}, {"Review": "\n\n“Joy wondered how you get someone you think is blind to see what you see. It certainly can't happen when you're standing on opposite sides of a wall.”\n\n A very true statement. As such, Jodi Picoult brings opposing perspectives on abortion inside the very walls they fight, all inside one abortion clinic where they not only share differing opinions but now share the experience of being victims in a violent hostage situation. They are able to put their differences aside and work together towards one goal. Survival. Ironic? I think not. This is Jodi Picoult after all. There are more layers to this novel than a hostage scenario, and even more layers than the subject of abortion. Picoult beautifully showcases fatherhood in all its vulnerability, love, and desperation, and this was hands down my favorite element of this book. However, the controversial theme of abortion does run strong, showing how each of the very many characters came to their personal opinion/belief on the subject while shining light on laws, religion, health, race, women's rights, family culture, etc. Picoult doesn't preach. She very much shows both sides of the coin and lets the reader recognize and process how experiences shape our belief systems, and how “right versus wrong” is sinking both our ships. In her author's note at the end, she writes: \n\n“We may not see eye to eye, but we can respect each others opinions and find the truth in them. Perhaps in those honest conversations, instead of demonizing each other, we might see each other as imperfect humans, doing our best.”\n\n Ultimately, I think that is the primary theme of this novel, and it does come across. Although A Spark of Light offers an admirable message, I did not find it enjoyable to read. It is written chronologically in reverse and, in my opinion, it did not work. There are so very many characters that were hard enough to keep track of and when you add in a time line that requires an equal amount of mental energy, it becomes very taxing on the reader. If you're a follower of Picoult, you know you're going to read it anyway...so read it and take it in with an open spirit. Picoult is not asking you to change your mind for or against. She's asking you to change your heart from hate to love, to change your views from strict belief to understanding, and to change your actions from stone-thrower to healer in whatever context that may be. It's a beautiful message sadly set in a distracting format. It's worth the read though. Check it out.My favorite quote:“Parenting was like awakening to find a soap bubble in the cup of your palm, and being told you had to carry it while you parachuted from a dizzying height, climbed a mountain range, battled on the front lines. All you wanted to do was tuck it away, safe from natural disasters and violence and prejudice and sarcasm, but that was not an option. You lived in daily fear of watching it burst, of breaking it yourself. Somehow you knew that if it disappeared, you would, too.”"}, {"Review": "Jodi Picoult shines a light on a controversial issue hoping to spark conversation and understanding.SUMMARYThe day starts like any other at the Center in Jackson, Mississippi. The women’s reproductive health service clinic offers care to anyone who passes through its door. Later in the morning, a desperate and distraught gunman, George Goddard bursts in, opens fire, and takes everyone inside hostage. His daughter had recently had an abortion. After rushing to the scene Hugh McEIroy, a police hostage negotiator, sets up a command center and begins making plans to communicate with the gunman. As McEllroy’s phone vibrates with incoming texts, he glances at it and discovers, Wren, his 15-year-old daughter, and his sister, Bex, are also inside the clinic. And they are not alone. With them are the African-American traveling doctor, a heroic nurse, a older gyn patient, a woman who has come to terminate her pregnancy, and a under-cover pro-life protestor.When his daughter was younger, George had read to her from the Bible, instead of fairytales. Some stories, he knew, just don’t have happy endings. Better for Lil to understand that love was about sacrifice. That what looks like carnage, from a different angle, might be a crusade.REVIEWA SPARK OF LIGHT is a compelling story that starts at its end. In chapter one it’s 5pm and the people in the Center have been held at gunpoint for most of the day. Several of the hostages are injured and several others are dead. The succeeding chapters are structured backwards in hourly increments with each chapter detailing the thoughts and actions of each of the people in the clinic. While the backward time structure is creative and unique, it makes for a very difficult read, feeling choppy and disjointed. But keep going.Jodi Picoult’s writing is impressively direct on such a controversial subject. Using the multiple father-daughter relationships as part of the story adds a nice sentimental touch. Picoult’s research had her talking to people on both sides of the abortion and contraception issue. She is hopeful that this book will inspire debate and conversation. You have to commend her efforts. Her epilogue provides some sobering facts and statistics. Author Jodi Picoult is the author of twenty-four novels, many which have been New York Times bestsellers, including A Spark of Light She lives in New Hampshire with her husband and three children. Thanks to Netgalley and Ballantine Books for an advance reading copy of this book in exchange for an honest review. “We are all drowning slowly in the tide of our opinions, oblivious that we are taking on water every time we open our mouths.” Publisher \tBallantine BooksPublished \tOctober 2, 2018Review\twww.bluestockingreviews.com"}, {"Review": "Jodi Piccoult really likes to take an issue and hash it out from both sides. I think the subject matter here was going to be hard to read no matter what because abortion is such a hot-button topic with little to no gray area in the middle, and like so much in the current political climate, is very divisive. I found myself very drawn into the story, which centers on a group of people trapped in a clinic during a mass shooting. The characters were engaging. The layout of the story bounced around quite a bit forward and back through various timelines and flashbacks, starting at the end of the hostage shooting and traveling generally backwards in time, which by the end, was cool, but at the beginning, was admittedly confusing. Still, I very much enjoyed this overall. Trigger Warnings: (view spoiler)[ murder, violence, mass shooting, rape, graphic description of medical procedure, abortion, abuse  (hide spoiler)]Please excuse typos/name misspellings. Entered on screen reader."}, {"Review": "3 I was disappointed starsMy reviews can be found here: https://yayareadslotsofbooks.wordpres...Abortion has divided us as a nation into what seems to be two camps, either it seems you are pro abortion or you are against it. It is an issue that has been fought over ever since the controversial Roe vs Wade decision in 1973. Never one to shy away from a contentious subject, Jodi Picoult tackles the question of abortion on in her new book, A Spark of Light.It is hard to keep your head clear and read a book such as this, and try not to judge what the author says and feels. It is quite evident that Ms Picoult falls on the side of abortion in her treatment of this topic. We do, in her characters, see those who are present in a clinic waiting either for their abortions or looking to prepare for one when a gunman, purported to be pro life enters the clinic kills two people and then holds the others hostage. A negotiator from the police department is called to the scene, not realizing at first that his daughter and his aunt are inside that clinic, the aunt wounded by the gunman and his daughter hiding in a closet. It is a tense climate, one where the negotiator has more than a job in his mind, his beloved daughter is inside and he must save her.What I appreciated about the book was the handling of this disputed topic. It is one we see so often in the news as one side accuses the other with no real solutions to this quagmire we find ourselves in. Should women have rights...absolutely, should the unborn have rights..well there lies the issue does it not? “We are all drowning slowly in the tide of our opinions, oblivious that we are taking on water every time we open our mouths.”I have always thought the strength in Ms Picoult's writing was her ability to do just that write a story that moved you from one point to another. Unfortunately for me, this book fell a bit short in that. I found the story jumped around too much, it was like static you hear and then wonder why it happened. There was too much back and forthing in the book causing me at times to be confused, asking myself huh where are we, who are we portraying? I never expected this book to change my opinion about abortion. I don't really think any book could. I just believe that this subject was a bit marred by the unevenness of the telling, the format not being conducive to this hot button topic, and for those reasons, I am somewhat disappointed.Thank you to Jodi Picoult, Ballantine Books and NetGalley for a copy of this novel. "}, {"Review": "It’s really hard to write a review with so many different POVs. Especially when the subject matter is a tough topic such as abortion.In A Spark of Light, you hear every side. You understand and/or you don’t. The story is told in reverse which I loved. Anytime a story is told differently like that is a win for me. There are a ton of characters in this story, each come with different beliefs and upbringings. The novel starts at 5pm with an active shooter holding his hostages in the only abortion clinic in Mississippi. Throughout the story we learn how all these characters got to this moment. I won’t say much else besides I loved it! I could not stop reading, I just HAD to know! That ending tho!!!!!!I recommend this one! Thanks to Random House for gifting me a copy! 5 Stars! "}], "Genre": "Crime", "ID": "39072210", "Desc": ""}