{"Genre": "Crime", "Reviews": [{"Review": "My thanks to Ben Willis at Orion Publishing Group for sending me a paperback copy of ‘The Silent Patient’ I have given an honest unbiased review in exchange*Alicia Berenson was discovered standing over her husband - he’d been tied to a chair and shot in the face five times. Alicia gives no explanation and refuses to speak. She’s admitted to a psychiatric unit, ‘The Grove’ in North London, and six years later she still hasn’t spoken - not one single word!Theo Faber is a criminal psychotherapist w"}, {"Review": " Wow, I'm still reeling from that ending! A mindblowing, to-die for twist! A fast read that kept me intrigued from beginning to end, although the shocker came at the end. Wait......wait......what just happened? This was how I felt as a read the last few chapters!Alicia Berenson is such a mysterious, intriguing character and I was trying to figure her out the entire novel.  I kept asking myself, \"What is up with Alicia?\"She is a famous, talented painter and happily married to her husband, Gabriel"}, {"Review": "I feel like I should preface my review by stating that I have read A LOT of psychological thrillers, and coupling that with the fact that this was my most anticipated read of 2019 gave The Silent Patient a great deal of pressure. This will still be an overall positive review, but I felt I had to include some honest thoughts here as well for those readers who may need their expectations in line like I clearly did. The premise here is simply incredible; we have a woman named Alicia Berenson who is"}, {"Review": "Teetering between a 4 and a 4.5Alicia Berenson is a famous painter who has been admitted to the Grove, a forensic unit in North London. She has been charged with murdering her husband, Graham, who is a fashion photographer, after he returns home late one evening. After shooting Graham, Alicia has never spoken again.Theo Faber is a criminal psychotherapist who accepted a job at the Grove in the hopes of working with Alicia. He is obsessed with learning her motive. He knows he can get her to talk."}, {"Review": "Dear Alex Michaelides,Brav-the-fuck-o dude 👏👏👏\"Her silence was like a mirror - reflecting yourself back at you.And it was often an ugly sight.\"And that, my friends, sums up this book perfectly.Dark psychological suspense is my favorite genre and books like this one are exactly the reason why. This book is the very definition of a page-turner. From the very first page I was seduced by the magnetic writing style of Alex Michaelides.Nothing is as it seems in this novel. This story is complex and mu"}, {"Review": "Whoa! This was brilliant! This book right here is the reason that I love psychological thrillers. This has become an overly saturated genre with every one taking a stab at writing these twisty little mind fucks but more often than not they fall flat. It takes a talented mind and writer to pull off a really shocking twist successfully. Alex Michaelides has done just that because I did not see that coming at all and for that I thank you! *claps hands* Alicia Berenson appears to have it all. She's"}, {"Review": "Silence speaks volumes. It may be the silence of reproach. It may be the silence of speechless shock, fear or guilt. It may be the silence of rage. Perhaps it is a watchful, patient silence. It may also be the silence of simply having nothing to say. After a woman murders her husband and refuses to speak, a therapist whose stock –in-trade is speech is determined to uncover the motivation behind such a heinous act. This is a sneaky psychological thriller that left me at a loss for words."}, {"Review": "Promising to be the debut novel of the season, I decided to make this my first read of 2019! I am glad I did not wait any longer...Alicia Berenson was a famous painter, married to an in-demand fashion photographer, living what appears to be a life that others would envy...till she kills her husband by shooting him in the face, five times, and never speaks another word. Her only assertion about what happened is her self portrait, Alcestis, named after the tragic heroine of the Greek tragedy by Eu"}, {"Review": "Well looks like I’m the outlier on this book as I have been reading many glowing 5 star reviews. Maybe I’ve been reading too many thrillers lately. For me to love a thriller all of the characters have to be well developed and intricate to the story, the plot has to be a good one and have more to offer than just the “thrill”, or wow factor at the end of the book. I found the characters to be shallow and the plot seemed to run off in several directions throughout the course of the novel. I should"}, {"Review": "Having seen a lot of good reviews about this book I was in 2 minds whether to read it. sometimes the books that have the most hype are not always the best books and can be quite a disappointment.I was held captive and read it in 1 sitting. Alicia is standing covered in blood next to her dead husband Gabriel, who has been shot in the face several times. The obvious scenario is that she shot him?Alicia was taken to a psychiatric facility called The Grove, where she has not spoken for 6 years. Will"}, {"Review": "Do you play chess? I don’t, more of a tic-tac-toe aficionado TBH. But I’ve always admired the ability to think 10 moves ahead when faced with a worthy opponent. Here we have 2 well matched MC’s, each with a plan & motive that may end up being their downfall.Alicia Berenson used to be one half of a glamorous couple. She was a beautiful, successful artist deeply in love with her husband Gabriel. Which of course begs the question…why did she shoot him in the face 5X? You’ll have to come to your"}, {"Review": "Astonishing, unputdownable and spellbinding stuff here!Loved....loved....loved! This book is exactly what I needed…...a fast-paced and fully absorbing thriller that I literally could not put down or stop thinking about. This was some fantastic storytelling!THE SILENT PATIENT by ALEX MICHAELIDES is a dazzling, fascinating, compelling, and an absolutely fabulous psychological thriller novel that was quite the immersive and thrilling book to read. Right from the very beginning I knew that this book"}, {"Review": "Greatest thanks to Celadon Books and author Alix Michaelides for the incredible chance to read and review this book.If you are skeptical about my review, because I love so many books as well as authors, let me clarify. This is without doubt the best book I have read this far. I cannot say more than it is without doubt the most fascinating reads. It will be released in February 2019 and is a MUST READ.Let me begin. The author has not only presented a work so intricate and absorbing, it fits a gen"}, {"Review": "You can check out all of my reviews.https://readalongwithsue.blogspot.com/Although I’ve read and experienced these type of twists before in other books I have to say that this authors premise was excellent.I loved that it was based in an Asylum. Around disturbed mental health patients.Alicia is an artist, a painter. Gabriel her husband. When Alicia is found by her husbands body all clues point towards her as the killer. But Alicia is silent.She neither speaks, or defends herself.Did the shock or"}, {"Review": "Blog | Facebook | Twitter | Instagram | Pinterest  A book that speaks about feelings, and lack of them. Love and emotions. Art and passion. Psychology and memories. And how our childhood might define who we will become. I have never felt such urgency to read another chapter as I have felt it with The Silent Patient. Such impatience, such excitement. It’s a feeling I wish I can get with all the books in my life.ALICIAAlicia Berenson writes a diary as a release, an outlet – and to prove to her bel"}, {"Review": "This book is absolutely captivating, suspenseful, and intriguing. I devoured it quickly!The novel follows Theo Faber, a psychotherapist who started working at a medical facility where an artist named Alice Berenson is confined. Alice became a notorious figure after murdering her husband. Her fame is surrounded by increased public interest due to her silence. Alice, is not any murderer, she simply stopped talking after the crime.Theo is eager to work with her and get her talking. He wants to unde"}, {"Review": "Holy MotherF*cker.This book has literally just blown my mind.Those of you who follow my blog or are a member of THE Book Club on Facebook will know that I suffer from chronic FOMO and despite having over 400 books on my kindle, when a new book is being discussed over on Twitter and all the bloggers are literally salivating over it and the publishers have allowed some of them to read the sampler and it appears the entire blogging community are involved EXCEPT ME, I immediately contacted the delic"}, {"Review": "I know you have all heard the hype about this book. Well believe the hype, it is really that good. The very first chapter opens with Alicia Berenson standing in her living room covered in blood. There is blood on the walls and the floors and all over her. She is standing in front of a chair that her husband is sitting in, with his face blown off. He has been shot 5 times in the face at close range. His wrists and ankles bound with wire. Alicia is bleeding from both wrists that have been slashed."}, {"Review": "Jaw. On. Floor.There's that moment in The Silent Patient. The \"Wait, what? What??\" moment that you're so often promised on the jacket copy, or in blurbs stamped on the front, or--well, you know.You get promised it, but you don't really expect it. And as I was reading The Silent Patient, which takes a while to really start firing on all cylinders (which is not a plus for a shorter novel like this), I thought, \"Ok. It's a little sluggish, and if X happens, then Y will and then will get Z and--\"And"}, {"Review": "I just finished The Silent Patient and now I understand all the hype. Yes, the hype is deserved!When psychotherapist Theo Faber is offered a job at a psychiatric clinic where Alicia Berenson is treated, he doesn't hesitate one second to accept it. Theo has been following Alicia's case for years, since she had been charged with a murder of her husband. Alicia has not spoken since the murder, she keeps silent, surviving day by day in the clinic under high sedation. The Silent Patient was such a sm"}, {"Review": "Have you ever seen a game of cards which is nothing but a battle of wills where the two players seem nonchalant, but there is this edge in their attitude, just a sliver, which tells you that something is just about to happen?!! And something does happen, one of the players folds, just surrenders!! What does one do then? Believe it to be true and end the game or look underneath this sleight of hand and get to the real truth??Alex Michaelides, in his debut, has played this chilling hand of surrend"}, {"Review": " hmmph 3 SOLID STARS.My boy, AJ FINN, author of The Woman in the Window, blurbed this book. And I was hyped. Ultimately, not even a well furnished quote from one of my favorite go-to-thriller authors wasn't able to save this mess. Even when sis snapped with a shocking and explosive twist I NEVER coming, I still was exasperated about the whole book overall. The writing.....wasn't really my cup of tea. I'll give you the tea: I couldn't connect with any of the characters and another tantalizing tho"}, {"Review": "This was an excellent debut by Alex Michaelides. Though it got off to a slow start, the consistent build of intrigue kept me raptly listening. I generally don't \"do\" audiobooks but I was fortunate to win this in a giveaway. I have to say that this is the best audio book I have ever tried. Kudos to the narrators for not putting me to sleep! Overall, The Silent Patient was a clever psychological thriller with plot twists I never saw coming and really, that is the thrill of the thriller, isn't it?"}, {"Review": "This is an outstanding debut psychological thriller! I really enjoyed it and it kept me fascinated. Alicia Berenson is a happily married artist who loves her husband. Until she kills him. Or did she? Alicia never speaks a word after the murder so she was sent to a mental institution called The Grove. Alicia is The Silent Patient - she doesn't speak to anyone at all. Theo is a criminal psychotherapist who thinks he can save Alicia so he maneuvers to obtain a position at The Grove in order to work"}, {"Review": "As soon as I heard about this book, I knew I had to read it. The Silent Patient was a very enjoyable book and a solid 4.5 stars. Alicia is a famous painter and seems to have it all-a beautiful house, wealth and a loving husband named Gabriel. That’s why everyone was utterly shocked when Alicia is accused of shooting and killing Gabriel. Why would she kill her loving husband? To make matters worse, Alicia refuses to speak in her defense and is ultimately sent to The Grove-a secure forensic unit."}, {"Review": "I must confess; I have sinned. The Silent Patient is the reason I have sinned; the reason I was gluttonous. My sinning began at page one, yes - it was there that I found myself gorging, gulping, slurping down every sentence, devouring page after page until I reached the end. I know I should feel remorseful but the only feeling I’m left with upon completion of The Silent Patient is that of pure satisfaction. The Silent Patient is a staggering, twisted, satisfying and savory read. It’s yet another"}, {"Review": "Why I love itby AJ FinnSince Gone Girl conquered the globe in 2012, bookstore shelves have creaked beneath the weight of countless psychological thrillers. Another 44 were published in the past eight seconds alone—and precious few of these novels actually qualify as psychological suspense. More often than not, they focus on an imperiled protagonist—usually a young woman—whose psychology is neither nuanced nor particularly … well, particular. We might rattle around in the heroine’s head, but abse"}, {"Review": "This unpredictable psychological thriller examines the relationship between psychotherapist Theo Faber and his patient Alicia Berenson, who becomes mute after she is hospitalized for murdering her husband. This riveting book explores the broadening and narrowing of lines between doctor and patient and how, at times, they even intertwine. This shocking debut will be the breakout hit of the new year and will keep readers guessing until the very last page."}, {"Review": "An excellent, slow-burning psychological thriller; sharp, clever and with a whammy that genuinely took me by surprise (it takes a lot to do this). Kudos to the author. More, please. "}, {"Review": "Daaaamn. I did not see that ending coming! I read a lot of mystery and suspense novels, so I feel like I can spot what's coming fairly easily, but this one took me totally by surprise. I'm not the least bit shocked that this book has already been optioned for a film even before it's release. I almost wish I didn't know what happens so that I could enjoy it all over again.What a fantastic debut by a new author! I can't wait to read his next one (and the one after that)."}], "ID": "40097951", "Name": "The Silent Patient"}