{"Genre": "Crime", "Reviews": [{"Review": "Having loved I Am Watching You, I was really looking forward to The Friend. I’m pleased to say that I absolutely LOVED it.The Friend had me gripped and intrigued throughout, as I wasn’t sure where the story was going, so eagerly needed to read more to find out. This thought provoking psychological thriller was full of mystery, intrigue, suspense and an impressively manipulative character. Ooh, I do love a good sociopath to keep me on my toes!I really don’t want to go into detail about the plot,"}, {"Review": "2.0 Stars— After being floored with how good the first thriller I read from Teresa Driscoll (“I Am Watching You”) was, I was not as impressed with “The Friend”. In my opinion, “The Friend” took a very long time for anything (and I do mean anything) to happen, and when it did, it was very slow developing. 90% of the novel is the main character, Sophie, telling her story of meeting and becoming friends with the new woman in town, Emma. Emma appears to Sophie to be a perfect new friend , but some o"}, {"Review": "The book begins with Sophie on a train ride, hours from home, when she receives a devastating phone call that her 4 year old son has been rushed to the hospital and in need of surgery. Sophie left Ben with her good friend Emma and her son Theo for just one night. How did this happen? We flashback to the beginning of Emma and Sophie's friendship. Through these flashbacks we see all the warning signs that Emma may not be the friend she thinks she is. I have to be honest and say that this book just"}, {"Review": "EXCERPT: I had seen the worst of what two people can do to each other. My neighbours and friends. How could I be all right?I had walked into a room, happy and relaxed, with my son waiting for me on the doorstep. Unknowing. Innocent. Me. Sophie. The woman who allegedly had this chocolate box life. I had walked in smiling and been met with a scene which I never, ever want anyone to imagine. Not my son. Not my husband. Not even the police Inspector with the wrong notebook and all the wrong ideas ab"}, {"Review": "What a twisted and disturbing read! A very fast paced and enjoyable story that I read in a day.Emma moves to the villiage with her son and soon Sophie and her son Ben become friends, despite the rumours flying around about the newcomer. Sophie believed that she could trust Emma with Ben.. until one day when Emma is hours away on a train and news comes through that he has been hurt in an accident.I really did feel for Sophie and waned things to work out for her. Thanks to Amazon Publishing and Th"}, {"Review": "Unfortunately, this book did not hold my attention at all for some reason. I can't even pin down the issue I had with it, but I felt it was kind of scattered and the jumps back and forth in time were not done smoothly. Obviously, I am in the minority in not having enjoyed The Friend, and if you do read it, I hope you like it much better than I did. Sadly, this was a miss for me. On to the next one! Find more reviews and bookish fun at http://www.princessandpen.com"}, {"Review": "I usually ask others to read books from different countries and origins. But my own practice lacks that determination. I would try to avoid foreign authors may be due to my comfort zone with Indian authors. Not just that once in a while when I take books of the said category my mind went through a hell lot of tantrums. It makes me feel \"I am not getting it Vishnu. Don't read more\". But then my heart pursue it till my mind able to cope up with narration style. \"The Friend\" by Teresa Driscoll was"}, {"Review": "Compelling and dramatic! A mother's worst nightmare!Sophie thought she could trust Emma to care for Theo and Ben and to keep them safe. She was wrong.'The boys... There's been some kind of accident, Sophie.'More than two hundred miles away, my child is in a hospital bed being cared for by strangers.Sophie and Mark Hill and their four year old son, Ben, have moved to a small village in Devon. Mark must still commute to London until he can relocate his business closer to Devin. Why Devon? 'I'll fe"}, {"Review": "Thoroughly enjoyed this one, it's had me banging through it ALL DAY. So imagine that you are stuck on a train, miles from home, your child has been in an accident with his friend - the hospital don't know which is which - the injuries are severe perhaps more for one than the other - what do you do? Well there isn't a lot you CAN do except pray for the train to go faster and reflect on what has brought you here...Therein lies the premise for \"The Friend\" - a twisty psychological thriller that fol"}, {"Review": "Sophie has suddenly found herself trapped in every loving parents worst nightmare.She is on a train,hours from.home and has just received a chilling phone call.Her four year old son Ben and his young friend are in hospital after a serious accident.Sophie is at her wits end,she thought Ben would be safe with her best friend Emma.Someone Sophie had bared her soul to,despite the village rumours.But now Sophie is beginning to wonder if she has made a unforgivable mistake.Because how well does she kn"}, {"Review": "As in Teresa Driscoll’s first psychological thriller, ( I am Watching You) we begin this journey on a train...On this train we meet Sophie. She is miles away from home when she gets the call that her son Ben has been in a serious accident while under the care of her new friend Emma. A woman she bonded with immediately when Emma moved into her old friend Caroline’s house, with her young son Theo, in tow. A woman that nobody else seems to like or trust. Told in alternating chapters of “Today” and"}, {"Review": "I had trouble putting this novel down last night to go bed! An excellent thriller to read if your looking for one.*Thank you to the publisher and Netgalley for an arc in exchange for an honest review."}, {"Review": "This is a story which packs great pace, as good thrillers should. Sophie is on a train and distraught as her son Ben is one of two boys in hospital. Her husband Mark is on the train as well. The story alternates between the present and the past. The story in the past starts off when Emma moves into town with her son Theo. Sophie likes her immediately and they get along very well. A shocking murder follows unnerving the local residents. While it seems an open and shut case initially, there is a h"}, {"Review": "I really enjoyed reading I Am Watching You but I have to say that The Friend was even better! Emma moves into Sophie's little town and they become fast friends. Emma is charming and spontaneous. Their sons are about the same age and they become good friends as well. Not everyone is so smitten with Emma though which causes a lot of conflict. Despite wild rumors flying about town, Sophie easily dismisses them as small town gossip.The Friend is fast paced and kept me up well into the night because"}, {"Review": "Sophie is on the train when she receives a chilling call informing her that her son Ben and his friend were in an accident. Sophie had left Ben in her friend Emma’s care and the on whole trip back reflects on the past which led to the current dreadful situation. Did she make a big mistake in trusting Emma because how well do you actually know somebody ? The Friend is a fast moving psychological thriller with an exciting twist that I didn't see coming. Narrated in flashback the book builds up the"}, {"Review": "I received a free e-copy of The Friend by Teresa Driscoll from NetGalley for my review. The friend is a phychological thriller. Sophie, the main character, lives in a small village of Tedbury. She meets a new woman in Tedbury who has a son, just like she does. They become friends and the boys get along well with one another. A set of events leads Sophie's son to be injured while under the care of her new friend. Should she have trusted her friend to watch her son? A very fast read with lots of s"}, {"Review": "Well, now. If, like me, you have trust issues sometimes and don't like meeting new people, let this story be a lesson!Sophie is traveling on a train with her husband when she gets a phone call to say her four year old son, Ben, is in hospital. Sophie had left Ben in the care of her friend, Emma. She thought Emma could be trusted. They were kindred spirits after all. But how well does Sophie know Emma anyway? Was what happened to Ben truly an accident? Or is there something more sinister going on"}, {"Review": "DNF @ 48%. Just ...... so.... boring ... and slow. Sorry. "}, {"Review": "I adore this author and have loved everything by her. And this book - wow! From the first electrifying, attention grabbing page I was hooked. I could not part with this story. I read it in one sitting, the characters taking root in my head and demanding my full attention. And even now, days later, they haven't let go. I am still thinking of their motivations, the events that led them to do what they did. The writing is exquisite, there are so many wow moments. This author goes from strength to s"}, {"Review": "When Emma and her son Theo moved to Tedbury Cross, Sophie welcomed her as they quickly became friends. As Sophie and her husband Mark had a son Ben who wasn’t much older than Theo, Sophie and Emma became fast friends as did Ben and Theo. But as much as Sophie liked Emma, people in the town, including Mark didn’t like Emma, warned her about Emma and soon there were whispers and rumours about Emma. Why did Emma move here? How could Emma afford the beautiful house she had? Why did Emma avoid talk o"}, {"Review": "I really enjoyed Driscoll’s first novel I Am Watching You, but was disappointed by this one.  \"But at the time there was no clue to the future – the consequences.\" Emma and her young son Theo are new to a small UK village and Emma is super suspicious as a death rocks the village. She is the title “Friend” to Sophie, a dissatisfied housewife who lives in the village with her son Ben and husband. The whole novel focuses on who really is Emma? What happened in her past to make her so shady? Why did"}, {"Review": "I purchased this book after reading I am watching you, some months earlier, i'm guessing this book followed as it had a few of the previous characters. I have to say that I was disappointed from the off. After 2 chapters it was evident what the plot line would be, mainly because the book jumped from present to past, present kind of giving the story away. Yes there were a few mediocre surprises along the way but nothing exciting and I found the characters very dull indeed. I kept reading as I tho"}, {"Review": "I was completely hooked from beginning to end in this fantastic psychological thriller. Full of suspense, I can honestly say I had no idea at all which way the plot would go until the twist was laid out before me. It was definitely one of those 'Noooooo' moments as I finally realised what was going on!Sophie is on a train back from London, desperate to get to the hospital where she has been informed her son and his friend are both in critical condition after an accident. She left Ben in the care"}, {"Review": "3.4/5Full review at https://smileaturself.wordpress.com/2...Things that worked out for me :> There is a learning from the book, not about friendship, but I now know there is something called Selective Mutism which can cover up child. I love it when I take away such things from a novel. (extra star just for this)> Friendship between Sophie and Helen. It was pure, and what I think everyone should have. It warmed my heart.> Stating past and present together can lead to a lot of confusion t"}, {"Review": "Full review to be posted on blog.*Loved way story way told - present day with Sophie on train alternating with past to when Sophie & Emma's friendship first began.*Story is told mostly from Sophie's POV.*Full of intrigue, full of twists that you don't see coming, especially at the end and quite a few scary moments - this is one intense, chilling read!*This book will play on your emotions and have you questioning whether this friendship is really all that it appears to be."}, {"Review": "I’m actually glad to be finished with this book. I really couldn’t get into this book. Really felt the book was so slow, nothing really happening and then when it finally gets good, it’s over"}, {"Review": "To read the full review click on the link belowhttps://storyofabooknerd.blogspot.com...'The Friend' by Teresa Driscoll is an intriguing psychological thriller with the amalgamation of thrill, suspense, drama and mystery which keeps you at the edge of your seat until you find out the climax.The story moves to and fro, from present day to past through a series of flashbacks. In the beginning of the story, the chapters were a little slow paced and boring as I was unable to understand what is actual"}, {"Review": "This is my second by this author and both have been superb stories. Definitely a favourite of mine and I'm happy to see she has another coming out in February as well. You just knew the friend was going to turn out to be anything but in this one, it's just wondering how much damage she was going to wreak upon those she encountered along the way.....I did like young Theo, along with that tale of his little robin rescue. That was sweet. Helen was another lovely character. It was clever how most of"}, {"Review": "fast paced, psychological thriller. I enjoyed the book a lot.Thrillers are my favorite genres, I love to guess what happened, I love the ones which surprise me more. Though I did suspect that Emma was upto to something, couldn't guess what exactly it was. There are books which make you want to guess what happened and books which makes you live in the moment. This book belonged to the latter category. I did feel bad for Theo, he deserved more love. I loved the characters and how the suspense gets"}, {"Review": "I came across The Friend accidentally on Audible and it sounded too good to miss – a child in danger, a friend who is not who she seems, secrets, lies, a race against time. Just what the doctor ordered for my daily commute, I thought!Driscoll’s writing drew me in rapidly and I really enjoyed the dual time format of the novel. Here we have Sophie, a young mother on a train who gets a phone call that her four-year old son Ben has been hurt in an accident and is being rushed to hospital as they spe"}], "ID": "35906836", "Name": "The Friend"}