{"Name": "Hunting Annabelle", "Image": "https://images.gr-assets.com/books/1522684783l/35612376.jpg", "Reviews": [{"Review": "3.5 Unexpected Stars for Hunting Annabelle It's no secret I enjoy reading about psychotic killers and aggressive, unremorseful sociopaths. Thrillers are my jam! \nHunting Annabelle\n had all of that, along with a damaged MC that you can't help but feel some sympathy for. Yikes, did I just admit I found a sociopath endearing? Yes, I did! I was intrigued by the premise of the book. Sean Suh is a killer. He is fighting demons daily, trying not to kill again. Then he meets Annabelle. He falls hard - there is something about her that draws him in completely. Then Annabelle is kidnapped right before his eyes. No one believes she is in danger. It's up to him to save her. At first, Sean's quest was interesting. As he uncovers more about Annabelle's past, we see that there is a lot more lurking under her shiny exterior and things aren't always what they seem. Things seemed to drag a bit though towards the middle. I wasn't surprised by the reveal as I felt things were neatly leading in that direction. It was a bit outlandish but then again - it's fiction. I can roll with it & I did for the most part. The implausible scenario surrounding the reveal actually helped make it a little more interesting. Things had become a little stale during Sean's quest to find Annabelle. Still, the ending really pulled the book together for me. It was different and unexpected and I wholeheartedly approve! I can actually see another book coming from this duo and I'd definitely be curious to see what they get into. Thank you Wendy Heard, Harlequin-Mira and Netgalley for the opportunity to review an arc of this thriller."}, {"Review": "This book will make your mind spin and your palms sweat, an edge of your seat ride into crazy town!Oh how I love to spend time in the mind of a psychopath! Although in the case of Sean you were never quite sure if he was a psychopath or a victim? This really was what set this book a bit apart, the not knowing if you were sympathetic towards the bad guy or the good guy... but good or bad Sean was definitely an odd duck...Sean has recently been released from a psychiatric hospital, for reasons you’re not completely sure of until later in the book... his mother and he have relocated from San Francisco to Texas, The assumption is that Sean has brought shame on the family.... Shawn’s mother is a controlling, judgemental, condescending, neurosurgeon.... so I’m guessing there weren’t a ton of hugs and kisses and complements in Sean’s past... Shawn is an artist who spends his days drawing at a local amusement park, that is where he meets Annabelle... Shawn is immediately entranced by Annabel, and Annabelle seems to be charmed by quirky Sean... while on their first date somebody kidnaps Annabelle, and Sean is determined to find her... so who took Annabel? And why? And does Sean have something to do with this?Oh the mind f***!Sean was both off putting an endearing, someone you wanted to give a hug and run away from.... I really had no idea if he was good or bad, or innocent or guilty, until the bitter end... Annabel was complicated, I really never could get a complete handle on her character.... two characters I didn’t necessarily like, but they were so well developed flaws and all! The book completely sucks you in from the beginning, this lonely eccentric character with an artist hand, what is really going on inside him? The pace slows down a bit in the middle with the search for Annabel, although I felt every piece of this puzzle was necessary.... then that ending! Wow that was explosive an unexpected and has you thinking to yourself what the actual f*** did I just read?A dark and twisty creepy story that will keep you on your toes throughout, absolutely recommend!*** A huge thank you to Harlequin Mira for my copy of this book ***"}, {"Review": "Unfortunately, Hunting Annabelle wasn't the story for me. I did not like this. It started out promising, as the author's writing is actually quite strong, but the story, yeah, just did not do it for me.Around the 50% mark it turned for me and I never got my interest back. Our protagonist, Sean Suh, is a Korean-American in his early 20s who you discover early on has some pretty strong urges to hurt and kill young women. In fact, you learn that he acted on these urges at least once in a severe enough manner to have him sentenced to a psychiatric prison. However, at the point where we meet him, he is living with his overbearing and severe mother in a different state from where he committed his crime(s).As I mentioned, I enjoyed the beginning. It started off strong. It is revealed to you over time the extent of Sean's illness and resulting actions and I enjoyed the way that was slowly unfolded for us. He is very much an unreliable narrator and it is unclear early on how much of his thoughts you can actually believe as the truth.After a certain point however it just got to be too much. Then plot twists occurred where my eyes legit almost rolled out of my head. I just didn't buy what the author was trying to sell. It completely lost me on the story. By the final 20% I just couldn't. I had to push to make it through. However, just because this story wasn't for me, in no way makes this a bad book. The author's writing style is very fluid and easy to read. The suspense and uncertainty at the beginning definitely kept me turning the pages. If you are okay with the plot twists, this could probably be a really strong book for you. It is very violent, very messy, very over-the-top but also explores some interesting topics of identity and mental health. There are readers for every story but unfortunately, this one just didn't work for me. I want to thank the publisher, Harlequin - MIRA, for providing me with a copy of this book to read and review. I always appreciate the opportunity and I would read more books by Wendy Heard in the future.**Please note, the protagonist in this has been diagnosed with schizophrenia but he doesn't self-identify as such and I in no way can comment on how the rep was for that."}, {"Review": "FIVE STARSSean Suh. His name doesn’t exactly roll off the tongue, but that doesn’t matter. It works. Sean Suh is the main character, otherwise known as the UNRELIABLE NARRATOR, in debut author Wendy Heard’s novel, Hunting Annabelle. Is he a serial killer? Is he insane? Or just a one-time killer? You won’t know until the very end…(tease tease)!You will know that he is an odd duck. I guarantee he will command your full attention from page one. Delectably untrustworthy, yet incredibly sympathetic…what is this madness???? Sean is an admitted killer, but just try and resist his charm and vulnerable personality! He’s fresh out of an institution for the criminally insane. A Korean-American, living in a very white, good ole boy type- Austin, TX, in the 1980’s. Sean’s mother is an overbearing neurosurgeon that constantly disapproves of Sean, mainly his choice of goth style clothing—strangely enough. You can’t help but feel Sean’s pain and confusion through the many psychotropic meds his own mom dispenses to him every day. Is Sean really a schizophrenic? Or is it just the drugs making him feel crazy? Ahhhh, these things I pondered for pages!Sean is a gifted artist and completely friendless until he meets college student, Annabelle, at the amusement park where he spends his days secretly drawing the patrons he watches. Annabelle’s glowing copper aura (yes, Sean, has the fascinating ability to hallucinate color into life) is the most beautiful sight Sean has ever seen. When Annabelle is suddenly kidnapped during, coincidentally, her first date with Sean, he is thrust into the relentless pursuit to find and save her. A good portion of the story is spent on Sean investigating Annabelle’s family and friends, trying desperately to figure out who would want to hurt her. Sean quickly catches the attention of law enforcement and of course, appears to be the most likely suspect.The ending is crazy, but it had to be, otherwise the story wouldn’t work. So just go with it! I love this quirky novel and it was like sticky paper in my ears-I couldn’t put it down! The audio version is terrific! HUNTING ANNABELLE has been compared frequently to YOU by Caroline Kepnes, but I like it so much better than that one--mainly because of the finely drawn personality of Sean Suh. It is a closer cousin to the wonderful The Good Son by You-jeong Jeong.Happy reading! If you love twisty serial killer stories, without too much graphic stuff and a little humor, try this one soon! I loved it!"}, {"Review": "3.5 terrifying starsSean is quite a troubled young man, recently released from a mental institution after being convicted of a grisly murder. Sean is mentally ill, raised by what seems to be an uncaring brilliant neurosurgeon mother, he tries to escape the hallucinations, the psychotropic drugs the delusions, and the overwhelming urge to kill. He sees auras indicative of his schizophrenia, and then one day in a park he frequents he meets Annabelle and there is an instant connection. Could this be love for Sean? Can he believe he is somewhat normal?  What about Annabelle, a young brilliant woman from a troubled past working her way through medical school. How can she be attracted to a man such as Sean? Then the awful happens and Annabelle is kidnapped in sight of Sean. He runs to save her but is too late. What now, now that he is involved in this with a history such as his, how will this end? Is Sean ever the least bit reliable or is he a born killer? As Sean works his way in a desperate attempt to find Annabelle secrets and lies emerge sending him on a chase where no one will seem to win.This was quite a tale of a contorted tangled web. The suspense stay at a fevered pace as Ms Heard takes us on a journey with characters who are demented, maniacal and unhinged.  Recommended for those who like to travel with characters who are teetering  on the edge of sanity versus insanity.Thank you to Wendy Heard, Harlequin-Mira, and NetGalley for a copy of this frightening tale. My reviews can be sen here: http://yayareadslotsofbooks.wordpress..."}, {"Review": "Hunting Annabelle features Sean, a twenty-something young man battling the personal demons surrounding his profound mental illness, when a girl he just met is kidnapped before his eyes...or was she? What follows is his pursuit to find out what happened to Annabelle while simultaneously being investigated by the police as the prime suspect in her disappearance. I enjoyed the first third of this book, however, the novelty of the plot was quickly ruined for me. I became bored with Sean's endeavor to uncover the truth but still engaged enough to want to find out what actually happened to Annabelle. Without giving anything away I can only say that I found the revelation to be so implausible that it borderlined on absurd. Too hokey for my liking although I did enjoy the conclusion of the story. It's kinda refreshing when the bad guy wins. I was provided an ARC of this book by the publisher in exchange for an honest review."}, {"Review": "Hunting Annabelle, Wendy Heard's impressive debut novel, is a truly engrossing read. From the moment I picked it up those pages were feverishly turning, faster and faster I flew until it was completely devoured. Despite having not been born until the late 1980s I thoroughly enjoyed the references to the times and thought it added a distinct mystique and intrigue to the story, and I loved how Heard builds her characters until they are complex, multi-layered and incredibly realistic. I found antagonist Sean Suh absolutely fascinating, and it's safe to say I was riveted.There is such a wicked sense of foreboding that runs for the duration, and the author evokes a chilling, spine-tingling atmosphere that literally had goosebumps appearing on my arms at certain points. There are many twists and turns and the suspense is slowly ratcheted up over the course of the novel until it culminates in a breathtaking crescendo that shook me to the core. By making the antagonist someone who clearly has psychiatric issues and is one sandwich short of a picnic she adds an extra dose of unpredictability that often comes with the territory when it comes to individuals with mental health problems. Highly recommended and fully deserving of all the stars!Many thanks to MIRA for an ARC."}, {"Review": "I received a free e-copy of Annabelle by Wendy Heard from NetGalley for my honest opinion.A creepy, chilling psychological thriller that pulls you in in the first few pages. Sean, who is mentally ill, is a man who loses track of times. Sean, recently out of a mental institution, is living with his mother and is still very unstable. While visiting the local them park he meets, a beautiful girl named Annabelle. Annabelle spends the day with Sean, and then asks him to meet her again the next day. When Sean goes to meet Annabelle the next day, he witnesses Annabelle being kidnapped. He reports it to the police. The police suspect that Sean is behind the kidnapping. A gripping read that will have you second guessing everything. "}, {"Review": "Hunting Annabelle... what a fascinating premise. Sean is battling his on demons with his mental illness. He has just been released from a mental institution for his previous horrible crimes and is trying to live a \"normal life\".Sean meets Annabelle at the park one day and instantly falls for her. They decide to go on a date and Sean swears that he sees someone kindnap Annabelle in a white truck on their first date. What follows is a twisty, dark, and creepy journey trying to find out what happened to Annabelle.It became a bit stale for me in this journey to find Annabelle... felt like it went on a tad bit too long. I was curious to see what happened to Annabelle of course. BUT, once the story was finally revealed behind Annabelle's disappearance I think I fell over in my chair with eye rolling. I found it so implausible.. and over the top. Overall, this wasn't a bad mystery but wish the reveal was a lot better. 3 stars for Hunting Annabelle.Huge thank you to Harlequin/Mira for the arc in exchange for my honest thoughts.Publication date: 12/18/18Published to GR: 11/15/18"}, {"Review": "\nThanks to NetGalley and the publisher for providing me with a free, electronic ARC of this novel received in exchange for an honest review. \nSean Suh is trying to start his life over. After three years spent in a psychiatric institution for murder, he is hoping that a new city and a new home will bring about the change he so desperately wants. When he meets and quickly falls in love with Annabelle, he feels that he might finally be on the verge of a brand new life. When Annabelle is kidnapped in front of Sean’s eyes, he quickly begins to investigate her disappearance. The cops aren’t looking for her and in fact, all eyes turn to Sean when his past comes to light. Sean must not only prove his innocence but must find Annabelle, the only woman who sees the man instead of the monster. “Hunting Annabelle” by Wendy Heard is dark, twisted and dangerously addicting. A novel that hits you right from the start, it quickly becomes one you can’t put down. Sean is likable  (even when you hate yourself for liking him), and the story is well-told with a creative plot and well-developed characters. This is one of those novels where you will speculate over and over as to how it will end- and you will be wrong. I was surprised with how unexpected the ending of this novel was. The twist in this novel is one you absolutely won’t see coming. I am still not sure how I feel about the end of this novel. It seemed to change the entire direction of the story, so the expectations I had at the beginning completely changed toward the end. I can honestly say “Hunting Annabelle” is unique while still being deeply disturbing and enjoyable. I am a huge fan of psychological thrillers, and all things psychopath in general. “Hunting Annabelle” definitely checked all of the boxes for me on this one. To know that this novel is the first by Ms. Heard is even more impressive. Although I am still unsure about how I feel about the ending, this novel has to get a five-star rating. Not just for the psychological aspect of the plot, but also the constant, “pull you in” action and unique plot line. Ms. Heard has found her writing zone- and I look forward to so much more. "}, {"Review": "It's 1986, and Sean Suh is a reclusive, artistic, and troubled young man. He is in outpatient therapy with a licensed psychiatrist multiple times a week, and is monitored by his mother, world renowned Dr. Suh from San Francisco. After Sean was released from the mental institution he was sent to, the family moves to Texas in hopes to escape it all. Sean bumps into Annabelle one day while drawing out in public, and the two hit it off almost instantaneously. Annabelle isn't judging Sean for his appearance, his awkwardness, or the demons that he's trying to hide. Sean knows that since he's Korean, white people tend to discredit his appearance, or throw microaggressions at him, but Annabelle isn't like that. Against all recommendations from his mother and his therapist, Sean decides to go on a date with Annabelle. As the date winds down, Sean witnesses Annabelle being kidnapped. Sean blows his cover and reports the kidnapping to the police, but nobody believes him. Sean decides that if he wants Annabelle found safely, he is the best person to investigate. Nobody is better at finding a criminal deviant than a serial killer. \nHunting Annabelle\n isn't perfect, ladies and gents. I battled between 3-4 stars with this novel, because it's such a slow burn for a relatively short tale. I don't mind slow burns if they develop into a more complex and twisted story, but for 75% of this book, I was somewhat bored. Once we get to the last quarter of the book, it picks up immensely! The story completely changes route—in both it's pacing and development. If I had to rate the final 25% of the book, it would've been five stars. That's why I felt that a fair compromise to this story would be four stars.\nHunting Annabelle\n is a light thriller/mystery, at best. It's more investigative/procedural than I expected, which could work for you if you go into it knowingly. I thought the story would've been darker, and I wished it was. One aspect that I really loved reading about in this story was the casual racism thrown Sean's way throughout the story. People made generalizations, comments, and microaggressions due to Sean's Korean heritage. It's refreshing to see that the book isn't white washed. We can see how racism was, and still is, an issue in America today—I hope it opens up people's eyes. If you're interested in reading \nHunting Annabelle\n, go in with an open mind. It's not the craziest story you'll ever read, but it'll definitely be something different. Thank you Goodreads (the giveaways are the best!) and MIRA books for my advanced copy. \nHunting Annabelle\n will be released December 25, 2018!"}, {"Review": "Hunting Annabelle is a story of a mentally ill boy Sean looking for a girl he met a few days ago and who was kidnapped in front of his eyes. The problem is that nobody seems to believe Sean's story as he is a schisophrenic and might have just imagined it all. In addition, once the police learn of Sean's violent past they believe it is Sean himself who is behind Annabelle's disappearance. But is he?This was an unusual read for me. What started as an innocent type of story - 'a boy meets a girl' gradually turned into a dark and violent tale. The story is told by Sean himself which is quite refreshing as he is the villain here with his unpredictable urges to harm others that are hard for him to control. I have to admit thought that about half way through the book I thought the story was dragging on a bit. However, I can totally forgive the author for that as the ending of the book is absolutely genious! So twisted and unexpected, it sent shrills down my spine!Many thanks to NetGalley and the publisher for an ARC in exchange for an honest review."}, {"Review": "I am not sure what I just read. I feel disgusted and angry and very manipulated as I finish this book. Are there people in the world that enjoy killing? Of course, serial killers have been documented from years ago to present day. The question is do I really want to read about them and for the first 3/4 of the book I sort of fooled myself that I did but then there is a sudden shift in this story and Sean, our hero (wrong word choice) moves forward in his search for Annabelle and something happens that makes me very anxious-a big twist that I did not see coming and did not like. Wendy Heard is an exceptionally good writer, she does her research and she blindsided me a few times while reading. This book displayed exceptional character depth and a strangely believable plot line --although I feel the ending was just a lead up to a second book the writing was so strong I cannot give anything less than a 5 star review to this book (even though I really disliked the ending). Wendy Heard is writer I will be looking to hear from again. Thank you to Net Galley and the publisher for a chance to read and review this book. "}, {"Review": "This was a fantastic story told completely from Seans POV. Embarking on a journey together and as the story unfolded I felt I really got an insight into what made him tick.There was almost an air of obscurity, intrigue and mystery enveloping the whole narrative and this made for such compulsive reading with some real shockers thrown in along the way.I found myself questioning the hidden motives of every single individual here and as we are almost drip fed the answers this was almost at times like a journey of discovery: a kind of mystery tour with Annabelle the ultimate destination.I was there questioning along with Sean his state of mind as each occurrence happened to further muddy the already murky waters.Who is sending the notes? Is someone messing with Sean and also his meds? If so: who and why?Is sean's own sense of vulnerability and powerlessness about himself also being a victim as well as a predator feeding his own internal rage?Then there's his almost co-dependent relationship with his mother and also his obsession with Annabelle herself.This story has so much going on in terms of content and each thread is kind of connected on a much deeper level until a complete visage is eventually formed for the reader.I felt that I forged a connection along the way with Sean himself actually feeling an almost sense of sympathetic familiarity towards him.It was almost like getting to know the monster living in his head and making a sense of peace with it despite its compulsion of ultimate wrongness.There were also such contrasts between Sean and Annabelle: they were so different in terms of upbringing but also had such similarities that you could see why they ultimately gravitated towards each other.I also must confess to being slightly shocked at the blatant racism and intolerance portrayed here: such injustices I know exist but as it is something I have no hands-on experience with I found it sickening to behold.So I liked where this eventually took us and though I did guess some twists other reveals were complete surprises.My only criticism of this story Is that I thought the ending here was slightly abrupt but that's actually it.This is a story that captured my imagination almost instantly and once this journey started there was no getting off this train until final destination was reached: a fabulous read that I recommend highly.I voluntary reviewed an Arc of Hunting Annabelle.All opinions expressed here are entirely my own.Reviewed By Beckie Bookwormhttps://www.facebook.com/beckiebookworm/www.beckiebookworm.com"}, {"Review": "Netgalley # 66GR giveaway winA book for all Seasons read-name in the titleMany thanks go to Wendy Heard, MIRA Books, and Netgalley for the free copy of this book in exchange for my unbiased review. Sean hangs out at his local amusement park and creates art in his sketchbook. There he meets Annabelle. He finds her captivating. They make a date to hang out another day, and sat the end of that day she is abducted. Sean spends the rest of the book looking for her because everyone thinks he's crazy. Oh did I tell you that? Yeah he hasn't been out of a mental institution long. So I realize the story I just spun for you doesn't sound too exciting, and honestly there were many moments when I wasn't too excited either. I was far more interested in the relationship between him and his mother. Don't get me wrong! This book was good, just goofy. Yeah goofy that's what I'd call it. "}, {"Review": "WOW...A jaw-dropping and twisted debut thriller! This book is unlike any book I’ve read. The more I read, the harder it was to put down.EXCERPT - “Her scream echoes in my memory. I know what happened. Whether anyone believes me or not, I know.”Sean is a mentally ill young man living with his mother after being released from a psychiatric prison. He spends his days hanging out at a nearby park and sketching, where he meets Annabelle. Then Annabelle disappears.Sean is sure she’s been kidnapped—he witnessed her being taken—but the police are convinced that Sean is at the center of this crime.This ARC was provided by NetGalley and HARLEQUIN - MIRA, in exchange for my honest review. Thank you!#HuntingAnnabelle #NetGalley #Amazon"}, {"Review": "Hunting Annabelle is solid 4 stars for me. A psychological thriller, it’s a dark and unique type of book. Sean spent three years in a psychiatric hospital (released way earlier than he was actually sentenced) for killing his girlfriend. Diagnosed as a schizophrenic, he now spends his days living with his neurosurgeon mother and hanging out at a local amusement park-people watching and sketching them. This amusement park is where he meets Annabelle-a college pre-med student. Sean immediately becomes enamored with her and is distraught when it appears that she is kidnapped leaving the park. Sean becomes hell-bent on finding her and takes up a personal crusade to find her whereabouts. As Sean tries to find Annabelle, he is fought the entire time-as local authorities don’t believe him due to his past and later think he had something to do with it. It doesn’t help that Sean has lost chunks of time and begins to even doubt himself. Things aren’t always as they seem though and the ending was a total surprise. Highly recommend to fans of mysteries and psychological thrillers. "}, {"Review": "Sean Suh doesn’t do much with his days other than sitting in a park and drawing people he sees. He was in a psychiatric prison for three years and is considered rehabilitated but he’s not at sure he has been. He still has thoughts and urges that he shouldn’t have and his meds make him feel terrible. When he meets beautiful Annabelle, he has hopes that he hasn’t felt in years. But when Annabelle is kidnapped right in front of his eyes, the police give Sean a hard time and have difficulty believing anything he says. Sean’s determined to find Annabelle before it’s too late.I initially was pulled into this book. The main character, Sean Suh, reminded me of Norman Bates in The Bates Motel TV series. Both were characters with psychiatric problems with controlling mothers but they were trying so hard to get better and redeem themselves for past deeds. That was enough to keep me reading though I don’t think the book was very well written. I did have sympathy for Sean. Then I hit the last fourth of the book. That’s when the author completely lost me. The book ended up going in the direction I thought it would but I thought it was done in a very silly, cheap and gory way. I don’t want to ruin anything for anyone who wants to give this book a try but the last part of this book just turned me off and ruined anything of substance that I thought I had found in the rest of the book. It may well just be me but this isn’t one I can recommend. It had potential to be much better.Not recommended.This book was given to me by the publisher in return for an honest review."}, {"Review": "I always get a bit excited when I see a Korean-American lead in a book. Even if he's one of the most unreliable narrators I've come across in a while! No one seems to believe him when he says he saw Annabelle get abducted so it's up to him to find her. In doing so, he finds himself - or at least a part of him he was extremely confused about.As a debut, this is a fantastic start to a long career for Heard. I love where her mind went with Suh's story. While I did feel it jumped the shark a bit at the end, I wish there was just a little bit more given. From the journey Sean went through, the last parts felt a bit rushed, abrupt and uneven when it came to the rest of the story line. However, I absolutely love the fact that it was unexpected and different.Anyone who is a fan of the unreliable narrator, enjoys an off the rails story where you're not entirely sure what's going on, this is a fun ride to be on. Put on your seat belt.. or don't.. live a little dangerously and go hunting with Sean.Thank you to MIRA books for this copy!"}], "Genre": "Crime", "ID": "35612376", "Desc": ""}