{"Genre": "Crime", "Reviews": [{"Review": "'The world is mired in lies, chaos and darkness, mate.'...'You're a bringer of truth, order and light.''Not any more, I've had enough.'The fourth book in the Cato Kwong crime series goes beyond the thin blue line of crime fiction and delves deep into the personal lives of its characters to provide not only a well written police procedural, but a book that humanizes the darker elements unlawful acts have on those who serve and protect as well as their loved ones.Immediately the thing that sticks"}, {"Review": "It has been nearly four years since we the reading public were acquainted with Philip 'Cato' Kwong. Since then things have changed dramatically for the popular and easy going detective. For one he is now well away from rural WA in Fremantle and with wife number 2 (Sharon Wang), baby Ellie and improving relations with his teenage son things are seemingly going well.But that feeling is shaken when a series of murders of homeless people see Cato bumped up to major Crime. While there are a few obvio"}, {"Review": "*https://mrsbbookreviews.wordpress.comAlan Carter is a Ned Kelly Award Winner, but until now I have not had the privilege of reading any of his work. I was assured by the author himself after listening to a talk given to celebrate the release of Heaven Sent, the fourth issue in the popular Cato Kwong crime thriller series, that newcomers can enjoy each novel in this series as a standalone. Heaven Sent, my freshman outing with Alan Carter, proved to be a most valuable reading experience. Based on"}, {"Review": "Sometimes you start reading a series book about a favourite character, and really start to wonder if the author is annoyed with them, subconsciously punishing them for being too popular, or just enjoying applying the thumb screws for a change. Whatever is going on, Alan Carter isn't making it easy for the popular, easy-going, and seemingly content Philip 'Cato' Kwong in HEAVEN SENT.Settled in his personal life with a new wife, new daughter and a tricky but improving relationship with his teenage"}, {"Review": "Enjoyable read. "}, {"Review": "I'd forgotten how wild and violent the preceding novel to this book was. Well, this one is set quite a few years later. It's very entertaining although I found the ending on the edge of just too violent. "}, {"Review": "Really enjoy these books. Keep them coming Mr Carter (and find a way to keep Hutchens in there somewhere please!)"}, {"Review": "Hope this isn't the end of the Cato Kwong series. So good. Cool to link this story to Malborough Man as well. Love the local setting once again."}, {"Review": "Another enjoyable instalment in the Cato Kwong franchise. The characters are well crafted and Carter's narrative style is suspenseful and engaging. I'm not sure if Kwong as sleuth and the focus of the killer's vendetta really works. It adds an air of predictability to the book and takes away the whodunit suspense."}, {"Review": "and 1/2. This was my first but will go back and read the others in the Cato Kwong series as this was a good read. AC writes this genre very well giving the reader a fast paced page turner."}, {"Review": "Fantastic- DS Cato Wong returns in Book 4 where everyone he loves is threatened. Such a wonderful sense of place. Hurry up Book 5"}, {"Review": "A really thrilling read. I really enjoyed it."}], "ID": "40192264", "Name": "Heaven Sent"}