{"Name": "The Cuckoo's Calling", "Image": "https://images.gr-assets.com/books/1540217136l/16160797.jpg", "Reviews": [{"Review": "Feb 3rd 2014 - Extra things you should know: 1) This is a negative review. If you are looking for reviews that confirm what you are already certain of (that JKR can do no wrong) here are some examples of positive reviews for you - 1, 2, 3. 2) I used some Mary Poppins gifs to make my point in this review. It seemed funny at the time. If you find MP gifs stupid/annoying/beneath you, then please feel free to go to the reviews I linked before. 3) I will no longer reply to comments saying I am stupid or didn't get it. I will no longer reply to insults of any kind or condescending suggestions that I read the book again. If you're tempted to write something like this, save both of us some time and read the previous comments for my answers to people like you. I have way too many unwatched episodes of Law & Order to entertain trolls any longer.4) I'm sorry to all the people who have been kind and respectful, whether they agreed with me or not. You can just ignore these points.____________________________Things you should know: 1) Ms Rowling filled my childhood and early teen years with magic. I love Harry Potter and I confess to only adding this book after I found out she was the author. 2) I did not go into this with the intention to compare it to Harry Potter. I did not expect magic or wizards and I fully anticipated this being very different to the HP books. 3) I have read and enjoyed many mystery/crime novels in the past. My favourites being by Tana French and Gillian Flynn. So, there was no reason why I couldn't have enjoyed this book simply because it wasn't magical Potterland. But I didn't and, after putting a lot of thought into this, I think I finally understand why.Here's the sad truth: I can't stand Rowling's writing when she writes for adults. I actually find it painful to read. Let's be clear from the beginning, I started and never finished The Casual Vacancy because the opening didn't grab me and there was something about it - something which I couldn't put my finger on - that made it an effort to get through. A certain style to the writing which didn't agree with me. I thought perhaps it was a one-off because I'd read all her other works and never had a problem with her writing style. That's why I jumped at the chance to try another adult book by Rowling and sort out what was evidently a bout of silliness on my part. What this book did give me was an answer to why neither of Rowling's adult books worked for me.Rowling writes in an unusual manner. It's not unique to her work for adults, Harry Potter has it too, but the effect had on both is very different. Rowling's style of writing, including the dialogue between characters, is formal to the point of being old-fashioned. Part of me wants to compare it to Austen but I'm cautious of doing so because of the amount of people (usually including myself) who might read that as a compliment. Rowling's formal style doesn't work, for me, when using it in an adult mystery and pairing it with profanity and grisly murders. It feels out of place and weighs down each page with tedious descriptions that use too many awkward similes, metaphors and adjectives. \"...face the colour of corned beef...\"\"...the snow fell with soft fingertip plunks...\"\"...long-snouted cameras...\"Her descriptions all felt a bit off to me. And I particularly didn't like the unsophisticated use of big words. It's like when inexperienced indie authors go crazy with thesaurus.com, using clunky words like \"exacerbated\" and \"exorbitant\" in casual sentences that don't benefit from it. The characters in this book never check the time or look at their watches, they \"consult\" their watches. Think I'm being picky? Try reading whole pages where every sentence replaces the obvious words with complex ones and see how far you get without your brain starting to scream. And it felt like every single noun had at least one adjective before it. Not only that, but Rowling repeats similar adjectives when referring to the objects again. In one sentence, we are told she climbed the \"steel stairs\" and in the next she's continuing up the \"metal stairs\". WHY???? And also WHYYYYYY???Another example of Rowling's old-fashioned style is her frequent use of expressions like \"oh my!\" and \"goodness!\", expressions I'm sure some of you will recognise from Harry Potter characters. What is this? It's like Mary Poppins or Little Women or, I don't know, Little House on the Prairie. And maybe it works fine in all of those, same as it works fine in Harry Potter, but none of those also had a side-helping of profanity and very adult themes. They do all, however, share the formal language style.And while I think people were silly to say things about The Casual Vacancy like \"ohmigod this had, like, noooooo magic and even fewer dark lords\" when Rowling clearly said it was an adult mystery book and I wanted to say to those silly people:I still think it's entirely relevant to compare the two when looking at Rowling's writing style and the reason why sometimes it works and sometimes it really doesn't. The formal tone with simplistic language - like in Harry Potter - is okay, but dense descriptions and over-complicated sentences made it hard work and tedious in this book. It's like a very formal letter with the occasional random swear word thrown in. And it doesn't work. Not for me, anyway. The style simply doesn't fit the content; there's swearing and murders and people rescuing others by grabbing their breasts...I'm not even going to talk about the story beyond saying I found it a standard mystery that could have been good if I'd not had these other reasons for not liking it. The killer is not hard to guess for anyone familiar with crime mysteries but that isn't usually what I care about most in crime mysteries anyway. Plus, in this case, I'm just too blinded by my dislike for the writing. *sigh* I think it's fair to say that I'm finally done trying to enjoy Rowling's adult books.P.S. Yes, I did get a little overexcited when I googled Mary Poppins gifs.Blog | Leafmarks | Facebook | Twitter | Instagram | Tumblr"}, {"Review": "Dull & tedious. I was frustrated with the style of writing. There’s no action. It’s all conversation. I wanted it to be over.COURTROOM STYLE CONVERSATIONS - TELLING NOT SHOWING:Private eye Strike is investigating a death. Throughout the book Strike has long conversations with many different characters. It felt like a courtroom, asking witnesses 30 or more questions one right after the other. Many of these were discussions about what “might have happened. For example “I don’t think he would have done it because he was...” “It could have been this. But assume it’s not, then what about that?” “Why couldn’t it have been a letter to...” All these conversations are people “telling” about the past with their own subjective assumptions, conclusions, and some lies. I’d prefer Strike actively doing things to discover clues and some interesting, unexpected, or scary action.Even Robin, my favorite character, she went to Oxford to investigate something. We should have watched her and seen her interacting with people. Instead Robin “tells” what she learned to Strike afterwards. Like in the first paragraph, she is answering a bunch of questions about her past activity.The author used the word “had” a lot - more “telling” not showing.NO CLUES TO THE READER UNTIL THE TELL-ALL AT THE END:There are no clues until the last fourth of the book. Then there are a few clues but they don’t mean anything to the reader. For example one character said he noticed drops of water on the floor. I had no idea what that meant until Strike does his “tell all” at the end where he explains the long complicated story of what happened, who lied and why, what caused the water drops, etc. I prefer mysteries where the reader learns some clues along the way that mean something.ROBIN IS THE BEST PART:The best part was the beginning. I really enjoyed the character Robin, Strike’s temporary assistant. She shows up on her first day just before a new client arrives. She asks Strike if he and the client would like coffee or tea. Strike says yes without thinking. There is no coffee or tea, but she brings it, and Strike has no idea where she got it. A few times he calls her Sandra without thinking. That relationship was fun. Robin has great initiative and ideas. And she does some neat things. But she is only a small part of the story.ENDING NOT CLEAR TO ME:I didn’t understand “why” John hired Strike. This was answered, but the answer didn’t feel right.SWEARING LANGUAGE:Strike has a long conversation with Evan who used the f-word every other sentence. I was tired of hearing it. It was a long conversation. Other characters used the f-word less frequently which didn’t bother me as much.NARRATOR:The narrator Robert Glenister was good. But I grew tired of the British accent he used for many characters. “Look what I got” sounds like “Loo wha I goh.” He was probably being accurate, but it was not easy listening for long periods of time.AUTHOR:J.K. Rowling wrote this under the pseudonym Robert Galbraith.DATA:Narrative mode: 3rd person. Unabridged audiobook length: 15 hrs and 54 mins. Swearing language: strong. Sexual language: I didn’t recall any, but Ernesto corrected me saying there were a few lines by Guy Some. Number of sex scenes: one, referred to no details. Setting: current day London area, England. Book copyright: 2013. Genre: mystery."}, {"Review": "UPDATE 2: This is my final review of the book. Most of what I included in my preemptive thoughts is here, so you don't have to read this whole... thing. Potential television series title #21: LONDON STRIKE Alright, let’s address the hippogriff in the room: finding out that J.K. Rowling published a book under a pseudonym is something that I had I expected might happen post-Potter (and, embarrassingly, searched for), but when the question was brought up as to whether or not she'd write under one, she dismissed the idea, saying that people would quickly find out it was her (which, after reading The Casual Vacancy I concur with, as the tagline could have been \"WELCOME TO DURSLEYVILLE\"), so the idea was sort of debunked for me. First, I feel that it’s necessary to offer in preamble that I actually liked The Casual Vacancy. Yes, it offers some views that some may find preachy, and Rowling’s stream-of-narrative writing lacks subtlety and dilutes the rawness of her characters. However, I also found it quite affecting- in fact, I’ve since read the novel a few more times more objectively, and the craft behind it becomes more apparent with each re-read. Did Franzen handle social satire better? Yes, but Rowling is in tight possession of a unique, wry wit that’s all her own. I think that the problem that many fans had is that they’re accustomed to the J.K. Rowling who writes about morality on a large scale- great battles of good and evil staged with dragons and goblins and ghosts, entrenched in themes of friendship, love, and death. The Casual Vacancy is also a morality tale- but the characters are so clueless, self-destructive and human, that a fan of the Harry Potter books can’t help but emerge disappointed. Fortunately, The Cuckoo’s Calling doesn’t strive for such heights. When I first heard about the book (after fixing the hole in the ceiling caused by my gargantuan leap of joy) I was excited. I mean, I’d much rather see J.K. Rowling whip out that killer gift for world building that she has in the realm of science fiction or fantasy, but she is equally skilled in mystery writing. I’ve always, always thought of The Chamber of Secrets as a mystery novel. That was always the appeal of it to me, and I felt that it stood out from the rest of the books because of it. But after J.K. Rowling wrote in the FAQ section of the new Cormoran Stike website that all of the Harry Potter books are essentially who-dun-its, with the exception of the fifth, I realized that they are. Each is essentially a search for a culprit using a limited amount of clues. Potential television series title #19: BBC’S SHERLOCK HARRY—Ep. 1: “A Study in Potions”But one doesn’t even need to view the Harry Potter books as mysteries in order to expect Rowling to be a great mystery writer- the immense amount of plotting and interweaving of detail throughout the books is commendable, and alone legitimizes the size of whatever paycheck Rowling got after every book. One of the biggest problems film makers had when adapting the final books of the series is that they came to realize that details that they had carelessly discarded bore great significance in the final books. An invisibility cloak becoming a Hallow, a friend’s pet rat an animagus. We know how skilled J.K. Rowling is at creating red-herrings and false trails already. One doesn’t even need to read all of the books to understand this. Just one chapter, in the Goblet of Fire. In an interview with Charlie Rose last year, J.K. Rowling revealed that chapter 11 of the fourth installment of the series was one that she wrote and rewrote the most, in order to draw suspicion away from a newspaper article written about Mad-Eye Moody. The intention was that it was to be written so that it could be interpreted and reinterpreted by other characters and the readers, so that we wouldn’t figure out the truth about Moody’s character until the end. This shows us that Rowling has an eye for the way the reader thinks, something that comes in handy for her towards the climax of Calling. Still, I had my reservations (see all 503 pages of The Casual Vacancy).Potential television series title #7: ROBERT GALBRAITH’S (A.K.A. J.K. ROWLING’S (it’s out now, so we won’t look like douchebags for marketing it this way)) CORMORAN & ROBINBut I was pleasantly surprised by The Cuckoo’s Calling. I don’t read much mystery, although I did read a lot of Agatha Christie when I was younger and watch BBC’S Sherlock now. When I do encounter a mystery, however, I judge it by how well it manages to surprise me. For me, this includes the author laying out all the details for the reader at the beginning- no big surprises towards the end masquerading as a clever twist that are really meant to keep the reader from finding out who did it. It’s the job of a good detective—and a good mystery writer—to piece together the clues in a way that the reader doesn’t, but theoretically could have. Rowling does this, balancing a cast of characters and an assortment of clues so numerous that I can’t imagine even the most dedicated mystery savant keeping up. The suspects at one point all seem to have iron-cast motive and opportunity, Rowling quickly outsmarting the reader. The plotting and the sheer intricacy of the details woven throughout might be the most impressive that I’ve ever encountered in a modern mystery novel. The utter tautness of the book, quite frankly, blew me away. It sticks to the traditional mystery formula. Rowling doesn’t have a Gillian Flynn-like touch on the genre. There’s the obligatory introduction of each character and clue to the point where it feels like speed-dating, and there’s a long exposition at the end about what happens. I was so impressed by the ending, though, that the cookie-cutter feel of it became subdued. And everything- which is perhaps what was most refreshing- is realistic. There’s no shocking conclusion and- thankfully- no ludicrous segueways between connections. Rowling’s gift for prose is evident, once again showing her finesse at maneuvering the English language. Although hardcore mystery fans may get a little tired of Rowling’s Dickensian style, I was always interested. In the sluggish, monotonous mid-morning hours at work I found myself wanting to pick up my copy of the book to see what happened next. Her characters are great. The relationship between John and Robin is sweet but covers all its bases- I like that their friendship is just a “friendship,” but it’s not like they’re not going to each consider the romantic possibilities of the other. Cormoran’s handicapped, ex-military character felt a little too John Watson for me, but his role as a character that prevails and doesn’t wallow-for the most part-is satisfying. I enjoyed Robin’s character too, and hope her part is bigger in the next installment. The presence of socioeconomic dynamics is featured heavily throughout the novel, and plays key parts in the mystery itself, lingering among character motivations and plot connections. I thought that it was a fascinating feature to include in a mystery novel, and gave it its distinct taste- but I hope that this doesn’t become a recurring theme throughout the series. It’s relevant here, but I prefer it as the atmosphere for one mystery alone. These dynamics are relevant ones in our culture, but the way that Rowling presented it in Vacancy was found unpalatable by a lot of readers. If she keeps it in play for each of her subsequent mysteries the way she does here, then the reader might grow bored. Some series’ find their tone in a shift of setting, going from the slums to high society. It’s the job of the main characters to keep the setting grounded, and with the team of John Bristow and Robin Ellacott, Rowling’s got the materials on hand.In other ways, however, it feels like Rowling hasn’t found her tone as a writer. The ambiance here doesn’t take on the meaty, rich qualities that have characterized the most renowned mystery writers- Robert Louis Stevenson’s gift for describing shadowy alleys and nightmarish supernaturalism is his hallmark, Christie equally adept at creating grim atmospheres sans the magical realism. Rowling’s writing is beautiful, but it seems to languish in contemporaneity. In this way it’s not an escapist novel- immersive, yes, but I found myself becoming more aware of the present rather than absconding from it. Bottom line, The Cuckoo’s Calling incorporates potent mystery writing, intricate plotting, and likable characters, showcasing some of Rowling’s best skills as a writer, even if her others don’t appeal entirely to the target audience here.UPDATE: I've finished the book, and I was right about Rowling's deftness at mystery writing, particularly around the part about The Chamber of Secrets. Full review to come, but highly recommended. Not phenomenal or on par with Potter, but all the things that didn't work in Vacancy are very much present except that they work in a mystery setting, and that it's all very, very good. Tightest, most intricate plotting I've ever seen in a mystery novel. So, finding out that J.K. Rowling published a book under a pseudonym is something I'd always expected (and, embarassingly, searched for), but when the question was brought up as to whether she'd write one, she said everyone would figure it out right away (which, after reading The Casual Vacancy I concur with, as the tagline could have been \"WELCOME TO DURSLEYVILLE\"), so the idea was sort of debunked for me. I'm slightly disappointed that I haven't heard of it, which means that it hasn't received enough acclaim to cross over to the mainstream on its own, which is less than I'd like. But people- a) It's a J.K. Rowling book b) We don't have to wait for it. It's already out. I liked The Casual Vacancy. But I think that the main issue many fans had was that J.K. Rowling is an author who deals with morality on a huge scale, epic battles of good vs. evil, friendship, loneliness, adolescent turmoil and every other drama you could think of set on a stage featuring dragons and ghosts and goblins. Her knack for making rich as well as lovable characters is her hallmark, so segueing into a world where the characters are not only clueless and blind but also distinctly unlikable couldn't have been very easy for fans. Also, her voice as omniscient third-person narrator is certainly well-written as a stream of prose, but sort of diluted the significance of her characters; Vacancy also lacks the edge that made similar novels by Jonathan Franzen (The Corrections) and Maria Semple (Where'd You Go, Bernadette), better. After multiple re-readings of Vacancy, I've grown to like the book a lot more- or rather appreciate it more, because while the craft behind it becomes more obvious with each read its overcast mood is unaccompanied by a payoff.But this is a crime novel. Why am I excited for this? Because I've always, always thought of The Chamber of Secrets as a mystery novel. You don't even need to look at that book alone to know that Rowling is a master of mystery writing, the seemingly meaningless details sprinkled throughout the Harry Potter series bearing much more gravitas in later installments (much to the chagrin of filmmakers, cutting out important details due to lack of knowledge of said installments). Red herrings and false trails are an essential component in mystery writing, which she is undoubtedly skilled at creating.So I'll be much more wary of you now Ms. Rowling, and I while I would still prefer that you return to fantasy, or even science-fiction, and even though I sense that you're becoming a very hit-or-miss author, your hits are still potent enough for me to want to read anything and everything you'll ever write again."}, {"Review": "رواية ستـأسـرك من مشهد البدايةبالنسبة لي فقد أعادت ذكري حادث مثلها احزنني جدا والكثير من محبي السينما المصرية..حادث مقتل السندريللاحيث تبدأ الاحداث في لندن بوفاة نجمة عروض ازياء\"موديل\" شهيرة إثر سقوطها من شرفة منزلها في الساعات الاولي من صباح شتاء لندن القارص بأحد الأحياء الراقيةيتزاحم المصورون علي جثتها لتصويرها لأخر مرة، كما تزاحموا عليها دوما بحياتها جارتها تؤكد إنها سمعت صوت احد ما يتشاجر معها ثم رأتها تسقط..-وتكافأ جارتها بصورة صغيرة لها علي استحياء مع صورة النجمة بكل الصحف والمجلات التي تتناول الحادث-ولكن التحقيقات تكشف تكذيب جارتها لعدم مصداقية اقوالها والأدلة التي تؤكد أن القتيلة كانت وحدها قبل الحادثوتنتهي التحقيقات بالحل الامثل والاسهل لسكوتلانديار\"مــاتت منتــحرة\"هكذا يموت المشاهير ومجانين الشهرة..الأمر واضح لقد كانت تعاني من مشاكل نفسية...هكذا يقول البعضلقد كانت متحمسة جدا لرحلتها للمغرب وعقد العمل الجديد..لم تكن حزينة لدرجة الانتحار ابدا...هكذا يقول البعض الاخروفعلا من خلال التحقيقات والملابسات..وتحليلات الطب الجنائي \"دي ان ايه\" لشقتها..لن تجد اي دليل علي وجود قاتلاذن فقد ماتت منتحرةأغلــقت القضيــةوبــــدأت احداث الرواية التي بين يديك..بعد 3 شهور من ذلك الحادث\n\n\nلماذا ولدت عندما كان الثلج يتساقطكان يجب ان تاتي والوقواق يتنادياو عندما يخضر العنب في الشتلاتاو علي الاقل عندما يحشد السنونو في تجمعاتليحلق بعيدا يطيرهاربا من صيف يموت***********لماذا تموت والحملان تتوالدكان يجب ان تموت والتفاح يتساقطاو عندما يأتي الجراد يتقافزوحقول القمح تصير هشيما وفساداوكل الرياح تتنهد تصفرلاشياء جميله تموت\nروبــيـن إيلاكوت فتاة بريطانية شقراء جميلة مرت بأجمل ايام حياتها الرومانسية..خطبها حبيبها في جو رومانسي حالمتذهب للعمل كسيكرتيرة مؤقتة لدي مكتب كورموران سترايكلم تعرف عن مكتبه شئ من قبل..المؤسسة الخاصة بالتعينات لأعمال مؤقتة لم تقل لها المزيدوفوجئت بانه مكتب يعمل في شئ كان يثير خيالها الطفوليمــحـقق خـاصكـورموران ستــرايك محقق خاص ,وضابط جيش متقاعد للإصابة..يمر باصعب ايام حياتهانفصل عن خطيبته..مفلس..ليس لمكتبه عميل سوي واحد فقط..وتأتي له سكيرتيرة من مكتب التعينات المؤقتة يعلم تماما انه لن يستطيع توفير مرتبها لاكثر من اسبوع..الا اذا جاءه عميل ثريجـون بريـستو..محام من عائله ثرية..يأتي لمكتب سترايك لماض بين الاخير و اخيه المتوفييستأجره للتحقيق في قضية قلبت الرأي العام منذ 3 شهور ولكن نتائج تحقيقاتها لم تكن مرضيه له..فهو مقتنع ان البوليس اهمل في الادله وان وفاه اخته لم تكن انتحارااخته..المتبناه ..هي لــولا لانـدري..الموديل..التي شهدنا وفاتها في اول مشهد************************هي أولي تحقيقات كورموران سترايك...والذي سيصير اسما حقيقيا في عالم روايات التحقيقاتاوعدك انك ستنجذب مثلي لتري باقي الاحداث..لن احرق لك القضية فقد كتبت اغلب هذا الريفيو وانا مازلت في منتصف الروايةحتي المقطوعة الشعرية \"التي ترجمتها ترجمة ركيكة منذ بضع سطور\" التي تعود للقرن التاسع عشر واختارتها المؤلفة كمقدمه للكتاب \"ومنها عنوانه ايضا\" ستشعر انها تطاردك طوال الاحداثالاحداث قد يراها البعض بطيئة...ولا أنكر هذا فعلا فأسلوب المؤلفة يتغلغل بشكل كبير في الشخصيات ووصف الاماكن بشكل يعرقل احيانا سير الاحداثولكن من قال ان متعتي في الرواية من احداثها فقط؟... فلا تنس أنها ليست روايه اكشن وانما جريمةستحلل مع الشخصيات الجريمه وتقابل كل من كان قريب من \"لولا لاندري\" قبل وفاتها..ستستمع لشهادات مختلفه قد تكون صادقه وقد تكون ماكره تداري شيئا ما...ستتعرف وحدك علي صحه الاقوال عن طريق تدريب اكثر من ممتاز حول لغه الجسد حلل..فكر..راجع الادله..تعرف اكثر علي لولا او \"كوكو\" كما يدللها اصدقاءهاوبحرفيه الكتابه ستشعر انك فعلا \"تغلغلت\" في القضيه وعالم الشهره من منتجين سينمائين, مطربي روك وراب , مصممي ازياء..ونجمات عروض الازياء اللامعات..وستحتار مع المحقق والسكرتيره الذكيه اذا ما كانت فعلا انتحار ام جريمه قتل*********************الاماكن..لندن~~~~~~بالتاكيد من قرأ هاري بوتر قد تجول -فعليا-في \"هوجوارتس\"وتعرف كل ممراتها واماكنها حتي ولو لم تظهر في الفيلم بفضل الكتابه الحرفيه للمؤلفههنا ايضا اعتقد انك ستعشق لندن وتتمني ان تري تلك \"المشاهد المصوره\"بالكتابهكما قلت في ريفيو شفره دافنشي وغيره من روايات دان براونيفضل ان تبحث في صور الشوارع الحقيقيه والبارات التي تم ذكرها في الروايه لتتعايش اكثر مع الروايه وتري جوانب قد تكون جديده لك عن لندنستقف في ميدان بيكاديلي بعد منتصف الليل لتشهد خطبه روبينستجوب شارع دانمارك و12 بار كافيه كثيرا حيث مكتب سترايك ومحلات الجيتار والادوات الموسيقيه حولهوسترداد البارات الانجليزيه ذات الطراز الفيكتوري مع سترايك حيث يقابل شهود الحادث او يضيع الوقت ويفكر في بؤس حياته فحسبوحتي المباني العريقه التي تطل عليها نوافذ تلك البارات ..المباني التي ترجع للعشرينات والمزينه بتماثيل جاكوب ابستينوالاهم هو الاحياء الراقيه بلندن كطريق بيللامي او حي مايفير الراقي..تلك الاحياء المجاوره لكنتيجرين جاردن,الشارع الذي يقطنه الاثرياء وذوي الذوق الراقي..وكانت تقطنه ايضا \"كوكو\" لولا لاندريستركب مترو الانفاق وتعاني من اعمال البناء في شارع دانمارك وتري الوان لندن في المساءالخلاصه انك بدخولك الروايه ستضمن رحله لاحياء لندن مع جي كي رولينج افضل من يصور الاماكن سواء الخياليه او الحقيقيه*********************الشخصيات~~~~~جي كي رولينج مره أخري ترسم لنا الشخصيات بطريقه دقيقه تجعلك فعلا تتعرف عليهم وعلي شخصيتهم وماضيهم اكثر مع كل صفحه تقلبها حتي الشخصيات الثانويه او ذات الدور الصغيركل الدقه دي \"التي يعتبرها البعض مللا\" من وجهه نظري اثراء لتجربه ان تعيش بين صفحات الكتاب فعلا وتتعايش تلك القضيه التي يحاول ان يفك غموضها البطل****كــورموران ستــرايـك****اكثر شخصيه لم استطع تخيل من يقوم بالدور في خيالي..بدات بالان ريكمان \"بروفيسور سناب\" ولكنه كان اكبر..روبرت داوني جونيور لانه كان شيرلوك هولمز بالرغم من انه ليس انجليزي\" ..هيو جاكمان كان قراري النهائي..احدهم اقترح علي الانترنت \"هاجريد\" طبعا بدون مؤثرات التي صاحبته ظابط بالجيش سابق يعشق انضباط الحياه العسكريه ولكنه لا يقوي علي الاستمرار بها ليس فقط للحادث الذي علي أثره فقد قدمه اليسريمحقق خاص غارق في الدين ليس لديه سوي عميل واحد او اثنان في افضل الاحوالولا يحقق في رسائل التهديد بالقتل التي تصله بشكل منظميعشق شارلوت ولا يطيق العيش معها لانه لا يتحمل كذبها المتكررابن غير شرعي لنجم روك كبير ولكنه يكره ان تكون هذه شهرتهشخصيه معقده ولكنك ستتغلغل في اعماقه واسراره وحياته صفحه تلو الاخري حتي تصبح منتظرا لروايه اخري ومغامره جديده له كما حدث معي ****روبين إيلاكوت****هيرموني اخري..اكثر جمالا وجاذبيه..نفس الذكاء وسرعه البديهه وحسن التصرفاعجبني علاقتها بسترايك الخاصه المعقده -بدون رومانسيه- التي تنمو من فصل لاخر اعتقد انها تجعلك فعلا متشبثا بها لتعرف كيف سينتهي الامر وتتمني -كما افعل انا - ان تظل حتي النهايه وتظهر في باقي المغامرات القادمه مع سترايك تعاني من رغبه خطيبها في انتقالها \"لعمل ملائم اكثر\"ورغبتها الخاصه في تحقيق حلمها بالعمل في مكتب يثير خيالها وحبها للتحقيقات اعجبني ان المؤلفه رسمتها \"بحب\" شديد وخاصا انها تليق بالمغامره..فسنعرف من اول ظهورها ان روبين من صغرها تتمني ان تكون \"محققه خاصه\" بنفسها****\"كوكو\" لولا لاندري\"****صوره الممثله ايما ستون صوره افتراضيه لاني لم استطع تخيل لولا كسمراء كما تصفها الروايه كما انها اول ممثله جائت ببالي منذ ان شاهدت غلاف النسخه الامريكيه من الكتاب “With all the gallons of newsprint and hours of televised talk that have been poured forth on the subject of Lula Landry’s death, rarely has the question been asked: why do we care?\nعارضه ازياء شهيره ماتت.....لماذا نهتم؟حسنا , ستتعرف لماذا نهتم صفحه صفحهستتعرف علي لولا الحقيقيه او \"كوكو\"كما اطلقت علي نفسها واصدقائها كتدليلستتعرف عليها غير من شهاده اخيها ,من الاخبار والمقالات التي كتبت عنها علي الانترنت التي بحثت عنها روبين لسترايكستتعرف علي لولا اكثر من شهادات المقربين منها واحد تلو الاخر حسب قربهم منهاستتعرف اكثر واكثر علي شخصيتها من خلال رسائلها الالكترونيه المرسله حتي تصير امامك كشبح تشعر بروحها كما حدث مع سترايك في منتصف الاحداثومازلت استكمل الروايه وفعلا هذه الشخصيه الجميله -المركبه ايضا-هي ما ستجعلك فعلا تهتم..و تتسالكيف ماتت لولا لاندري؟*************************The Propaganda البــروبـاجـــندا\"عن الدعايه والكتاب وجي كي رولينج نتحدث\"~~~~~~~~~~~~~~~~~~~~دائما ما تكون الشهره سلاح ذو حدينThe Casual Vacancyمنذ اول يوم صدور الكتاب500+صفحه من قرأ منه جزء او تصفحه سريعا ولم يجده كهاري بوتر قام \"فورا\"بتقييم الكتاب بنجمه واحده فقطكل من لم يعجبه هاري بوتر كان منتظرا لحظه صدور الكتاب ليؤكد فشل المؤلفه ويقيمه بنجمه واحدهلذلك اعتقد جاء قرارها بصدور هذا الكتاب الجديد بأسم المستعاروبصراحه -مثل المؤلفه- كنت اتمني ان يطول الامر ويظل مجهولا لجزئين مثلابالرغم من اني نفسي لا اقرأ سوي الروايات الشهير مؤلفها او التي نالت نجاحا ملحوظا فاني اعتقد اني اذا قرأت الكتاب \"اذا ماتوفرت له دعايه كافيه او صدر خبر بقرب تحويله لفيلم\"اني بالتاكيد سأعشق اسلوبه وكتابتهالروايه فعلا بها تلك العنايه بالشخصيات التي طالما نجدها في سلسله هاري بوتر..تشعر ان كورمورن او روبين وحتي لولا لديهم تاريخ وماضي معروف وانت تستكشف لمحات منه من فصل لاخر\"اذا كنت متابعا لسلسله هاري بوتر وتصفحت يوما موقع \"بوترمور\" ستجد ان المؤلفه اضافت للموقع تاريخ شخصيات ثانويه كثيره منذ ميلادها\"بالفعل اذا فتحت صفحه الكتاب يوم 14 يوليو \"بعد كشف السر في كل مواقع الاخبار\"ستجد ان الكتاب 4+نجوم في الجودريدز وكل الريفيوز والمراجعات عن الكتاب في صفحته تقييمات ايجابيه لم يكن هناك تقييم بنجمه واحده الا بعد ان تم كشف السرعاما فعلا كنت اتمني ان يظل روبرت جالبريث معروفا فقط باسمه الحركي..اشعر فعلا ان جي كي رولينج كانت انتهت بالفعل من كتابه قصه حياته وتاريخه - كما يظهر في اغلفه الطبعه الاولي من الكتاب والتي انتهت كلها في 14 يوليو وصارت تباع بمئات والالاف الدولارات -وكنت محظوظا في حصولي علي احدهم-..ففي هذه الصوره ستري مالن تراه في اي طبعه اخري..معلومات عن المؤلف \"الخيالي\"روبرتستشعر فعلا قربه جدا من شخصيه سترايك نفسه**************************الــــنهـايـــة\"بدون ذكر احداث\"~~~~~~~~~الظهور الاول ولن يكون الاخير لكورموران سترايكمحقق خاص من نوع فريد..شخصيه ثريه محلل بارع وقارئ ممتاز للغه الجسدوالجميل في الامر ان تحليل لغه الجسد جاء بطريقه غير مباشره ومدمجه مع الاحداث بطريقه تجعلك من يحلل الشخصيات بنفسك مع سترايكباقي الشخصيات فعلا ستشعر انك حققت معهم بنفسك وتعرفت عليهم..تعرفت علي عالم الاثرياء والمنتجين وشركات المحاماه الكبيره,مصمموا الازياء والعارضات الجميله..مطربي الرابستتعرض لمضايقات البباراتزي ,المصورين الصحفين الذين كانوا سببا لأسوأ حوادث المشاهيركما ستتعرف علي بعض طباع الصداقات بين العاملين بالوسط الفنيستتعرف اكثر عن حياه المجندين , بالاخص اولئك الذين يذهبون في حرب لا معني لوجودهم بهاستتعرف عن حياتهم بالحياه العسكريه,وحياتهم خارجها..وكيف يتأقلم من يخرج منها مع الحياه المدنيهبالظبط كالوصف الذي وصفته المؤلفه عن اسم المؤلف المستعار\"ملحوظه: جزء من ثمن الكتاب تم التبرع به لضحايا الحرب بالجيش البريطاني كما قلت ستجد بقراءتها تدريب علي لغه الجسد والتحليللا انكر اني \"ابطأت\" معدل قرائتي كثيرا لازيد من فتره استمتاعي بالروايه والعمل الاول لسترايك وروبين وسعدت جدا بان انهيها في 4 اسابيع بالظبط كوقت التحقيقات تقريباالنهايه قد تتوقعها ولكنك لن تعرف لماذا؟ فالاسئله التي لم تتوقع ابدا اجابتها والتي تؤدي لنهايه اضمن لك حلول ذكيه لها..مفاجأه لكنك يمكنك تحليلها بتحليل الشخصيات و اقوالها..واعتقد فعلا ان حتي اعاده قراءه الروايه سيكون بنفس الاثارههل تتذكر هاري بوتر وسجين ازكبان ,او وكأس النار..وكل ذلك الغموض والترقب لتجد مفاجأت في النهايه كانت مرسوم تفاصيلها بعنايه منذ اول صفحات الاحداث \"تقريبا حدث ذلك ايضا في كل اجزاء السلسله\" الامر لايختلف هنا..تشويق,مفاجأت, ونهايه تجيب عن كل اسئلتك المعلقهارشحها بقوه لكل من يفضل قراءه روايات الجريمه والتحقيقاتارشحها بقوه لكل من يحب القراءه حول عالم الشهرهارشحها بقوه لكل من يريد تحدي في تحليل الشخصيات ولغه الجسدارشحها بقوه لكل من اعجبه جو التشويق والغموض في هاري بوترارشحها لمحبي الروايات الانجليزيه الكلاسيكيهمحمد العربيمن 2 اكتوبر 2013الي 29 اكتوبر 2013\"جزء من الريفيو تم في 18 اكتوبر 2013\"~~~~~~~~~~~~~~~~~~~~~~~~~~~~ٍٍٍٍِْ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<<<<< 14 / 7 / 2013 الريفيو الاول >>>>>معرفه خبر الكتاب \"مفاجأه عيد الميلاد:) والذي اشكر كل من سجل اعجابه به واتمني ان يكون الريفيو النهائي عند حسن ظنكمبالرغم من الظروف العصيبه التي مررت بها اليوم 14 يوليو 2013\"عيد ميلادي الثـلاثـين\" :( :(ولكني فرحت جدا بالخبر الرائع ده والذي عرفته قبل فجر اليوم ان ملكه السحر بانجلترا \"جي كي رولينج\" كتبت كتاب جديد تدور احداثه في عالم الجريمهولن انتظر معرفه خبر تلو الاخر عنه او انتظار يوم صدورهالكتاب نزل بالفعل تحت اسم مستعار لمؤلف \"روبرت جالبريث\"منذ حوالي 3 شهورطبعا \"حركه مجرمه\" من مؤلفه رائعهالكتاب روايه جريمه كلاسيكي..الكتاب بيع منه حوالي 1500 نسخه ونال استحسان كبير من النقاد وقراء الكتاب دون معرفه المؤلف الحقيقيلو نفتكر ان الكتاب السابق لاقي اعتراضات وتقييمات سلبيه كتير جدا لمجرد الحكم عليه باسم مؤلفتهلتلخيص مختصر لفكرته في الريفيوThe Casual Vacancyهذه المره الكتاب نال انتقادات بالاستحسان عاليه جدا من النقاد والقراءفعلا هديه عيد ميلاد ممتازهوطبعا دي مناسبه مهمه..عند كل الناس :(..يمكن اصعب مرحله جديده :(بس فعلا فرحت بالخبر ده الي جه في نفس اليوموطلبته في نفس اليوم من امازونوبعد رمضان بقي قرايته ان شاء اللهمحمد العربيفي 14 يوليو 2013"}, {"Review": "This is a wonderfully entertaining new crime debut, which although it contains nothing amazingly original, works really well. Firstly, there is the main character, Cormoran Strike - a wounded war veteran, with a troubled past, damaged love life and financial woes, which see him sleeping in his office when we first meet him. Strike has left the army, which provided him with the structure and home life his mother never could, and set up as a Private Detective. The only problem is, a lack of paying clients. He then receives a new temporary secretary, Robin Ellacott, with her slightly stuffy fiance and her secret desire to be a detective. Both Strike and Robin, are fully fleshed out characters that we care about deeply by the end of the book.The crime Strike is asked to investigate involves a famous supermodel, who falls (or is pushed) from her balcony on a snowy, London night. Lula Landry is the adopted daughter of a wealthy family and her adopted brother is insistent that she had no suicidal feelings when he met up with her that day. As Strike sets out to investigate, we are introduced to a cast of identifiable characters - the effeminate dress designer, drug taking Paparazzi avoiding boyfriend, disgrunted 'wannabee' film star chauffeur, elderly, dying mother, disapproving family members, etc. Although the plot is really quite a simple one, it works very well. The author has created a totally realistic scenario, with London almost becoming an extra character as Strike walks the streets and a satisfactory plot with a good cast of suspects.I would say that Cormoran Strike is the best new addition to the P I genre that I have read for a long time. He certainly deserves a series and I hope to see him appear in many more books. There were tantalising glimpses of his past which need much further exploration and perhaps the author can be kinder to him in the next book and, at least, get him a proper place to sleep. I feel he will serve the author well and deserves a little looking after! If you enjoy really intelligent, well written crime novels (P D James, etc) then this will be a book you will love. Great start to what will, hopefully, become a long running series. * Have just found out this was written by J K Rowling. I am glad I didn't know that when I read it and I hope it doesn't put her off continuing the series, now she has been 'outed' as the author. It is a good read on its own merits."}, {"Review": "Meet Cormoran's First Strike..His first 'Mystery' which haunt me from the early beginning,even the epigraph.\nWhy were you born when the snow was falling? You should have come to the cuckoo’s calling,\nIt starts When snow was falling..and a 'Cuckoo' fell...A famous model star fall off the balcony to her tragic death..the paparazzi gather around her body just as they did when she was alive..Her neighbor assert that she heard her arguing and shouting with a man \"The Killer\" right before seeing her fall.The police declare that's a lie, the DNA proves there was no stranger there..All the evidences and investigation declare she was alone. The result is what the police saw was clear from the beginning..Suicide.'Celebrities always go cuckoo..depression would drive them for that' Some say.'She was exciting about her new big contract and upcoming trip..she was far from suicide act' Others say.You'll find thorough the investigations and evidences that no trace of a killer in the scene..so ...it's SuicideCase Closed.And then our Story begins3 Months laterRobin ,A beautiful blonde young lady living her Best Romantic days after getting engaged to her boyfriend ,Went to work as a Temp secretary for some office, she \"surprised\" to find out the business of the office is her long lost childish ambition of work..It was an office of A.. Private Detective..Cormoran Strike ,An ex-Military, Private detective Living his Worst days of his life, just separated from his fiance, His office just got one client..with all his debts; He just stuck with a new temp secretary he can't even afford paying her for her only week...unless he saved by a wealthy client..John Bristow ,An unexpected new \"wealthy\" client to Strike's office, as a favor for old friendship between Strike and the latter's brother .. He came for the detective to dig up a very famous case that he didn't agree with its results...A case of his dead -adopted- sister...A Famous Model...Lula LandryYes..Lula Landry \"Cuckoo\" is the famous Model we've witnessed her tragic death at the first scene...\nWhy were you born when the snow was falling? You should have come to the cuckoo’s calling, Or when grapes are green in the cluster, Or, at least, when lithe swallows muster For their far off flying From summer dying. Why did you die when the lambs were cropping? You should have died at the apples’ dropping, When the grasshopper comes to trouble, And the wheat-fields are sodden stubble, And all winds go sighing For sweet things dying.\nAs I've said, the story will haunt you from the very early beginning, its first scene..even from this 19th Century Poem.Although I've never been into poems & poetry, But this haunting one -may be cause I've heard it also on youtube- makes me really into the mode of \"The Cuckoo's Calling\".Also I have to say that Rowling has a great epigraphs choices, like in \"Harry Potter and the Deathly Hallows\" with 2 epigraphs that fit with the final story of Harry\" Also It haunt me for a 'Déjà vu' for an accident that happened 12 years ago almost like the beginning of this novel,also in London..A death of A Sweetheart,A Cinderella of Egyptian Cinema...that her case's investigations was almost identical to the case of Cuckoo..from the first scene.. I love also the glimpse for famous tragic death of celebrity which \"pushed\" by paparazzi or even cases closed \"wrongly\" as suicide.There's also that great tribute for the soldiers who are trying to readjust with civilian life after leaving the military one for a reason or another.Some may say it's a bit slow in the first half, but I really respect, even adore that detailed characters and events..it makes me get to know more about Strike and the lovely Robin as I'm with them in the Private Detective office.. and their cool 'professional' relation.I've actually got into the case of Lula, investigated with Strike the evidences and tried to interview everyone who was near from Lula the day of her death..And I've even got a GREAT experience decipher the \"Body Language\" while investigating some characters. And by the half of the novel -As I've written most of this review, right now- I've really wondered ; Is it really a suicide..or a Murder?************************The Setting ; London*****************I used to say in Dan Brown's Novels reviews That it's better to use Illustrated edition or keep searching in Google Image search for the places he describe brilliantly in his novels. The same is here..J.K. Rowling talent in creating a beautifully Magical world in Harry Potter, or realistic fictional Pagford in The Casual Vacancy proved to be still great in describing the magic of real places as London.You'll really love to see the statue of Eros; Piccadilly Circus while Robin starts a new step in her romantic life..You'll walk up and down Denmark Street and 12 Bar Café with its Music Instruments and where The Detective office Locates. You'll be in real famous Pubs and Bars in London with its Victorian faces.And these pubs' windows view of the 1920s building decorated with statues by Jacob Epstein And on the top of all , The elegant Victorian houses at the most wealthy neighborhood and streets like Bellamy Road and Mayfair.The bottom line is ,you're invited to a lovely journey into the heart of London at the moment you start the novel.************************The Characters************One more time, like all her work, The author writes the characters -even the secondary ones- in very detailed way, you discover more about them and their past by each new chapter, which really makes you as if you actually Living with them..and in this case,you're trying to solve a hidden mystery in a case with the Detective...**** Cormoran Strike ****Make a lot of thinking who would play him, -specially it wasn't clear his age at till book two- Alan Rickman is too old, may be Robert Downey Jr. but he's not English -although it didn't stop him being Holmes - and finally Hugh Jackman :)who I stuck with, some suggested Hagrid \"without the costumes of course\" Ex-Military still love discipline of the military life; Can't live with it anymore though ..and not because of his injury.Private Detective with big debts...just a client or two in the best days..and not even investigate the crazy death threatens he got regularly. Adore his ex-fiancee Charlotte..but can't live with her lies..Illegitimate son for a famous star..Hates it'd be his \"fame\".A very complicated character that you'll love to know him better page after page.. Wanting to know more about him and may you'd end up like me ..Waiting more books for him.**** Robin Ellacott ****A New Hermione-type. Super smart,clever, got the spirit of initiative. And this time,Super beautiful. As if Jo this time assert that women are smart even those super pretty ones. I love how she got a childish dream of her being a Detective herself. and I got so attached with her complicated \"romance and nonsense free\" relation with Strike and I was praying she'd stay till the end and to see her again in the next books of the series.**** Lula Landry \"Cuckoo\" ****Emma Stone was the first face come in mind when I saw the US edition's cover,I know that at the novel she doesn't look like her at all“With all the gallons of newsprint and hours of televised talk that have been poured forth on the subject of Lula Landry’s death, rarely has the question been asked: why do we care?Why Do We Care?Well, you'll know page by page.You'll get into the real Lula or \"Cuckoo\" as she and her best pals calls her, by the testimony of her brother,the news and articles written about her that you know from Robin's internet search ,and the tales and testimonies of those who were near her, one by one by how close to her they were as the story goes.But you'll get better look into her by reading with Strike her personal emails ,clear look as if you looking into her soul,or ghost.I promise that,before the half of the novel as in my case, you'll really love to know more about that lovely ,complicated character of Lula...And you'll really Care..and wonder.How Did Lula Landry really Die?*********************** The Propaganda************* Fame sometimes is a double-edged sword..The Casual Vacancy's 500+ was rated 'one star' in few hours after its release JUST because it's not Harry-ish ; or some didn't like Harry Potter or Rowling herself.I guess that's why the decision of publishing under Pseudonym..And honestly,as the writer, I wished it'd last longer \"Even I may never hear about it unless it get good publicity or hit the news of up-coming movie based on it, And I'm sure I'll still LOVE it even if I didn't know it's Rowling's.And if you saw the Goodreads main page of the book at 14th.July 2013 you'll find all of the reviews very positive and even 4.1+ rating and it didn't start getting a '1 Star' but after the announcement of the real author.Anyway I'm sure Rowling get GREAT researching Robert-Galbraith bio. as seen on \"About the Author\" in the 1st Printing of the book -which get sold out after few minutes of the announcement and auctioned with hundredth of dollars and I was lucky to get one of these 1st prints for this small captions about the author that wasn't at any other later printings.ROBERT GALBRAITH spent several years with the Royal Military Police before being attached to the SIB (Special Investigative Branch), the plainclothes branch of the RMP. He left the military in 2003 and has been working since then in the civilian security industry. The idea for Cormoran Strike grew directly out of his own experiences and those of his military friends who returned to the civilian world. “Robert Galbraith” is a pseudonym.You'd feel Robert's really like Strike himself..It's clearly that J.K. Rowling did a lot of research about the Ex-Militarily officers and their lives. You'll touch that at many points in the novel. ***********************Finally*******Haunting Case..Check Catching introduction for the main characters .. Check Smart Investigations .. Check Real Exercise on reading the Body Language .. CheckMarvelous setting ,very realistic; still magical.. CheckI fall in love with the mystery of this novel, the characters and every thing , I've read it slowly to keep it in my hand for as long as I can. \"took me 4 weeks reading almost as the same duration of the plot\" And I'd really recommend it strongly to any crime thriller readers..I love this praiseThe Cuckoo's Calling reminds me why I fell in love with crime fiction in the first place (Val McDermid) But in my case ..The Cuckoo's Calling is why I \"newly\" fell in love with crime fiction.I loved investigatings and the detective work,with all the observation and reading the body language.I loved the characters ,Robin is wonderful ,Lula even we don't have any \"live\" scene for her even no flashbacks but I truly attached to her case ,Liked her so much,she became a name for me and also.. Cormoran Strike Became a Name.Mohammed ArabeyReading from 2nd Oct. 2013To 29th Oct. 2013Start writting the review: 18th Oct. 2013~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ٍٍٍٍِْ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<<<<<<<<<< 14 / 7 / 2013 The First Review >>>>>>>>>>The first impression about the news of the book \"My birthday surprise\" and I'd love to thank everyone like it or comment and I hope you'd like the final review..thanks for your support.Yesterday ,after Midnight it was 14th July.....My 30th Birthday :( :( :(But this News MADE My Day...And My YEARJ.K Rowling??What?This Book is J.K. Rowling's!!!!!No more wait day after day for the plot of her new book, the cover, release dates etc..No more \"negative\" reviews just for her name only after just hours of the release of the books As what happened withThe Casual VacancyThat was what made me really Super HAPPPYYYYYYYYYYYYYYYY\"And of course you know how anyone would react when He's 30I've Ordered it at the same day from AmazonAnd Truly can't wait THANK YOU Queen Jo.,Queen of wizard and witches, Queen of MagicMohammed Arabey14th July 2013"}, {"Review": "A first-time author who goes by the unassuming name of Robert Galbraith comes out with a mystery novel called \nThe Cuckoo’s Calling\n. The book receives favourable reviews and is wholeheartedly accepted by the fraction of the populace that reads it.And then (and this I borrow from reliable old Wikipedia), the Sunday Times scratches it’s stubbly chin and wonders how a first-time author with a background in the army and the civilian security industry, could write such an assured debut novel. So, after much sleuthing and an inquisitive: followed by a generous bit of loose lips launching the Queen Ship, it was revealed that Robert Galbraith was in fact J.K.Rowling.I could almost imagine Tom Riddle’s wand swishing blood-red, curlicue letters in the air:\n*Robert Galbraith is J.K.Rowling**J.K.Rowling is Robert Galbraith*\nOfcourse, all hell promptly broke loose after that. (I am also pretty sure that Madame Rowling went Loki-at- Comic-Con in the privacy of her tastefully done up living room)For me, laying my hands on the book (courtesy, the best Hufflepuff in the magical and muggle world, Mith) was nothing short of the Almighty smiling benevolently down at me with a new commandment :\nThou shalt read the new Rowling tablet. Forsaking all others, thou shalt not stir till thou has reached ye last page. Thou shalt be rewarded for thy loyalty\nAnd believe me, it was a wholly rewarding experience.----------------------------SYNOPSIS:Super-Model Lula Landry has plunged to her death from her posh Mayfair balcony. While the media has pegged it down as a suicide by a troubled star, her half-brother is convinced that she has been killed. And so, he hires Cormoran Strike, a down-on-his-luck detective to investigate the case.As Strike, aided by his new (albeit temporary) secretary, Robin; gathers clues, gets sidetracked and traverses the length and breadth of London to unravel the truth…he faces his own demons and realizes that things can get really ugly, really fast.----------------------------REVIEW:\nThe Cuckoo’s Calling\n is a delightfully straightforward murder mystery. And at it’s helm is the equally delightful Cormoran Strike. Cormoran is not your conventionally good-looking, lit-cheroot-hanging-seductively-from-his-lower lip, lady-slaying Private Eye. He is a massive, rugby-player sized man, not-so-easy-on-the-eye and burdened with a prosthetic leg (Mad-Eye Moody lives?), a vindictive ex, a grimy family background and dire finances. But, hell’s bells, he is plain out adorable. His innate decency, his blustering efforts to not sully the sexual waters with his attractive new secretary, his attention to detail and his flashes of vulnerability make him a well-rounded main lead.He is not a fabulously perfect hero and so I have the biggest crush on him. And therefore, if the book translates into a movie (please, please, please), I would fervently hope that Nathan Fillion would fill Cormoron’s shoes. I mean yes, Fillion is a dreamboat, but he has the whole clumsy-yet-suave air down to a tee and we have already seen how perfectly adequate he looks, cast as a film noir detective in CASTLE’s The Blue Butterfly.I mean, look at him:Coming to Cormoran’s new secretary, Robin…she is an absolute star. Robin is freshly engaged to a very proper young man and is gooey-eyed enough to settle for a two point five existence. But she craves excitement. Not the sordid excitement of a secret fling but the childish glee of solving a mysterious mystery. And she’s the perfect foil to Cormoron’s elegant hippo act. Infact, with her strawberry blonde hair and her transparent need to \"Run with the Doctor Detective\", she reminded me of Amy Pond: Will love transpire between Robin and Cormoran? If it does, I, for one, will be knitting booties for their bonnie babies.The Supporting cast of characters is rich and varied. I loved each one of them. From the coke-snorting Tansy to the meticulous security man to the slightly unhinged half-brother to the wolf-masking wearing boyfriend (and prime suspect) to the ego-boosting Ciara Porter to the larger than life rapper to the maliciously camp designer; I loved all their character profiles. Everyone had a solid role to play and everyone was infinitely readable.Minion kisses for all:For all the Britophiles out there, this is a treat. Modern day London effectively wears the garb of a smoky 1940s lamplit whodunnit. You are utterly charmed and steadily soak in the atmosphere like a comforting soak in a hot tub.As for the pace of the plot, it is slow and steady. There are no cliff hangers (the staple of mystery novels) at the end of each chapter. There are no high-octane moments. There are no unexpected plot twists. And yet, you carry on. Your interest never wanes. The story builds up steadily, from a strong skeleton to a steady fleshing out of detail coupled with a handful of sinews worked in with precision and finally, the end result is a fully functioning thriller.The story is no great shakes. If you have been a mystery enthusiast, you will figure out the baddie pretty soon. But the joy of reading a good crime novel is to rub your hands in glee as you poke your head over the long-suffering detective’s shoulder and go, in your head, “Ooh, ohh…I KNEW IT!” Rowling’s writing is flawless, witty and generously peppered with some choice abuses. Ron Weasley would approve. Her skill is strong as ever and shorn of any pretensions. Her observations on human fallacies are uncomfortably accurate. She holds, what could be a rambling storyline together, purely on the strength of her intuitive grasp on her characters' emotions.At the end of the day, she justifies her right to the Writing Throne.I come away, utterly and completely enchanted.----------------------------"}, {"Review": "\n“He had never been able to understand the assumption of intimacy fans felt with those they had never met.”\nI'll venture a guess that J.K.Rowling is not a stranger to this feeling. Propelled to household-name fame for her lovely gift of imagination, she gets to experience the uglier side of fans' adoration - the side that comes with suffocating hard-to-meet expectations and stifling atmosphere of demanding hype. Is it any wonder she'd look for a respite in releasing a book under a pseudonym?And yet yours truly is selfishly celebrating the infamous leak of the unknown mystery writer's true identity since otherwise I would have been quite unlikely to pick up this tome given the ever-growing size of my precariously balanced to-read pile that is beginning to dangerously resemble the Leaning Tower of Pisa.Lula Landry, a supermodel, falls to her death from her balcony; the police called it a suicide, her brother feels it was foul play and hires Cormoran Strike, a bear-like ex-soldier, to investigate. Propelled by his desperate need for money and aided by his lovely idealistic temporary secretary Robin Ellacott, Strike plunges into the shallow world of celebrity culture and London's rich and wannabe-rich, slowly unraveling the threads of the mystery of Landry's fall.The Cuckoo's Calling is an unusual mystery novel by today's industry standards. It's lacking high stakes or important villains or breakneck-fast pace or shocking twists that seem to have become almost a requirement of the genre. Its language is slow, a bit formal and occasionally reminding me of the early years of the past century rather than modern times. It's a slowly developing story, quiet and observant, focused not on the plot but on the wide tapestry of characters, spending time with them through conversations and somewhat old-fashioned 'detecting' in a way that to a certain point reminded me of the works of the Queen of the genre, Miss Agatha Christie. But only to a point, as it's missing the annoying know-it-all smug detective and instead has a gruff but very human quite flawed war veteran tuned PI Cormoran Strike:\n“Other people his age had houses and washing machines, cars and television sets, furniture and gardens and mountain bikes and lawnmowers: he had four boxes of crap, and a set of matchless memories.”\nI can barely express the enjoyment I experienced from the interactions of Strike with the wide cast of potential suspects and witnesses, most of them belonging to the world of British rich and famous; his ability to zero in on different aspects of their personalities, to study their very essence, to get them to slowly reveal their real frequently shallowly unattractive selves - so often ugly and petty - that satisfyingly replace any number of car chases or gunfights or mad dizzying dashes from place to place to place that I came to expect from the genre.\n“How could the death of someone you had never met affect you so?”\nBut what I really appreciated in this slowly developing character-centered even-keeled narrative was the ever-increasing spotlight on Lula Landry - a young woman whose death started it all, who ends up being more than just a springboard for the story but its heart, its centerpiece as we get to glimpse more of her through Strike's eyes, as we see her morph from just a pretty face into a full fleshed presence behind the story. \n“He had hoped to spot the flickering shadow of a murderer as he turned the file's pages, but instead it was the ghost of Lula herself who emerged, gazing up at him, as victims of violent crimes sometimes did, through the detritus of their interrupted lives.”\nLula may initially appear to have little substance to her, to be little but a blank slate on which gossip-hungry public is eager to project their desires and hopes and even spite. But as the novel progresses, we see the glimpses of her personality and the uglier sides of the world of fame she inhabits - the world of flashing camera lights blinding your each step and every word you say having potential to end up in a yellow press column. Rowling's disdain of such flipside of fame is palpable indeed.\n“How easy it was to capitalize on a person’s own bent for self-destruction; how simple to nudge them into non-being, then to stand back and shrug and agree that it had been the inevitable result of a chaotic, catastrophic life.”\n I quite enjoyed this book. I liked the smart mystery, the unexpected light humor, the apt descriptions (even if at times they would get a tad too wordy), the stinging satire, and, of course, the frequent grave seriousness when Rowling turns her eye to the 'real world' problems.\n“The country was lumbering towards election day. Strike turned in early on Sunday and watched the day's gaffes, counterclaims and promises being tabulated on his portable TV. There was an air of joylessness in every news report he watched. The national debt was so huge that it was diffcult to comprehend. Cuts were coming, whoever won; deep, painful cuts; and sometimes, with their weasel words, the party leaders reminded Strike of the surgeons who had told him cautiously that he might experience a degree of discomfort; they who would never personally feel the pain that was about to be inflicted.”\nI'll easily recommend this book for anyone who'd like a few enjoyable afternoons with a brainy delicious story. 4 stars and an excited anticipation for more offerings from Rowling, Galbraith or whatever name she chooses to use for her future writing endeavours.----------------------------My old pre-review (the one responsible for the discussion in the comments) is below in a spoiler tag:(view spoiler)[Here's what's puzzling me: If you are Joanne Rowling and have traveled the path from rags to riches, and have created such a strong brand name at this point thanks to your amazing imagination, why in the world would you want to hide behind a pseudonym? You have earned the recognition your name brings!I wonder if that's the result of a backlash The Casual Vacancy received from Harry Potter fans for not being, well, like 'Harry Potter'?But in this case, wouldn't writing *more* books unlike Potter under your own name eventually lead to people associating you with literature that is not about young wizards? (hide spoiler)]"}, {"Review": "I like detective novels and I am a fan of J.K. Rowling, so when I found out that this \"Robert Galbraith\" was a pseudonym of Rowling, I thought that it was the perfect combination of elements that I have to read the book as soon as possible.I have to admit that in good amount of the book I wasn't enjoying it so much. I was feeling it too slow, and nothing exciting was happening, since Cormoran Strike, the detective, wasn't doing much just asking questions to each witness and the events was getting over and over, it was tedious.My anchor to keep reading it was Robin, the secretary of Strike, since she is a wonderful character that gives a way positive and radiant atmosphere to the book when she is in the scene. I think that besides that she is smart, proactive and good hearted, also she gets excited about being in the world of private detectives and that exciment was contagious with me.There are some detective teams that the lead character is so great that sometimes the \"sidekick\" doesn't get the proper credit, but here I have to tell you that Robin is as important to the effectiveness of the novel as Cormoran, the lead character.If you took her out of the formula, the magic (pun intended) would dissapear.Okay, as I was saying, the book was slow and there were too much details about the private life of Cormoran (I mean, why do I want to read about his nephew's birthday party or all the times that he goes to get a shower in the university campus?! Geez!) I want to read about the case and I really think that the book could have less length but I guess that when it's an author with the reputation of Rowling, they can't let to print a good book with a 300+ pages, no, it has to be 400+ or nothing. I wouldn't be surprised if the second book will get 500+ pages. But I really do hope that it would be with less pages.So, the book was slow, real slow, tedious interviews, but right when I was like 20% of finishing the book, bam! the tempo changed and all the pieces of the puzzle were starting to get into place, you get a good speed of narrative and then you see Cormoran Strike as an awesome detective worthy to be side-by-side with Philip Marlowe and Sam Spade.Also, I like that the character is smoking cigarrettes. I am not pro or against smoking, I just think that it's silly that nowadays almost all authors are like too much afraid of using characters with the habit of smoke like if that would alienate the readers. I am not here to discuss about medicine and health, I just say that a private detective looks cool smoking.So, \nif you decide to read this book, please finish it\n, don't leave it in the middle of the reading because you're getting bored, I can guarantee you that the smashing ending with be worthy of keeping with the book until the great end.Bravo Rowling, you did it again! ;) If there is a second book in this series, I'll be there to read it too.\nUpdate: (June-24-2014)\nIndeed there are now a second novel and I am man of my word ;) I am reading the second book now!"}, {"Review": "Did J.K Rowling out herself that she was the author of this book using a pen name or did someone else do it? I'm pretty sure she would have told the world if she WANTED people to know she wrote this, obviously she wanted the old feeling of people not knowing who the author is and now I feel bad for her. I'll read this eventually but I'm not shitting my undies looking for a copy.UPDATE:yup, she didn't want her secret out yet:\"I had hoped to keep this secret a little longer,\" JKR said, \"because being Robert Galbraith has been such a liberating experience. It has been wonderful to publish without hype or expectation and pure pleasure to get feedback under a different name.\"ANOTHER UPDATE:Goodreads you should have left J.K. Rowling's pen name author page alone, it's not that damn necessary to make sure everyone knows she wrote this. Everyone will find out eventually. Now you've added her name as a co-author to the book as well. I don't think it's right to have the real author's name on a pen name book page, they even did it with Stephen King's pen name page as well."}, {"Review": "A hard-boiled mystery about the suspicious suicide of a supermodel and a curmudgeon as the detective, who delves into the underground world of the rich and famous, daring to ask questions no one else will.This was the first book I've ever...wait for it... read by J.K. Rowling writing under a pseudonym as Robert Galbraith. Is this your reaction?Or perhaps, you look a little like this?I know, I know.. where have I been? How could I have never read the Harry Potter series? To be honest, the hell if I know. In addition, I'm not a big fan of the fantasy genre. Anyhow, this was a great mystery novel. Although I figured out the \"who-dunnit,\" I didn't wholly realize who it was until the last 50 pages. There were some parts that lagged, but overall, the writing was very well executed. I can't compare it to any of her other books, as I haven't read them, but if you like mysteries, especially those of the \"who-dunnit\" variety, you will definitely eat this one up."}, {"Review": "3.5ish stars.Far from perfect, but far from awful. Despite its many faults it's never less than highly readable and fluid. It's never particularly pulse-pounding but it somehow always held my attention.It honestly isn't twisty or suspenseful enough for me. It's super streamlined and reads more or less like a series of neat, orderly interviews with each of the various players in the mystery. Even at the 11 o'clock reveal, there's never a sense of danger or serious tension, it's just the natural progression of things. Detective investigates mystery; detective follows lead 1; detective follows lead 2; repeat several more times; detective solves mystery; case closed. Cormoran's a decent character but I really could have done without being told 849 times how hairy he is. It seems like Rowling goes through each of his individual body parts to describe how hairy they all are. Maybe someone can explain to me why he has hot psychos and supermodels all wanting to bed him... Robin has plenty of page time but she really should have been featured a lot more! She's one of the best things the novel has going for it. I'm down to read book 2 but not in a rush.Posted in Mr. Philip's Library"}, {"Review": "The Cuckoo's Calling (Cormoran Strike #1), J.K. Rowling, Robert GalbraithThe Cuckoo's Calling is a 2013 crime fiction novel by J. K. Rowling, published under the pseudonym Robert Galbraith. It is the first novel in the Cormoran Strike series of detective novels and was followed by The Silkworm in 2014 and Career of Evil in 2015.تاریخ نخستین خوانش: دهم ژوئیه سال 2015 میلادیعنوان: آوای فاخته کتاب اول؛ جی.کی رولینگ؛ مترجم: ویدا اسلامیه؛ تهران، کتابسرای تندیس؛ 1393؛ در 656 ص؛ چاپ چهارم زمستان 1394؛ شابک: 9786001821196؛ مترجم: حامدحسین دیزبند؛ تهران، نشر دامون؛سال 1393 ؛ در 214 ص؛ شابک: 9789642714377؛کتاب دوم این سری: کرم ابریشم؛ و کتاب سوم: رد پای شیطان استنخستین رمان از مجموعه داستان‌های جنایی کورمورن استرایک است؛ که به گفته ی نویسنده بیش از هفت جلد خواهد داشت. موضوع رمان درباره ی «کورمورن استرایک»، کهنه‌ سرباز زخم‌ خورده در جنگ افغانستان است؛ که اینک به عنوان کارآگاه خصوصی، درگیر پرونده ی خودکشی یک مانکن است. ا. شربیانی"}, {"Review": "“How could the death of someone you had never met affect you so?”I remember being utterly and absolutely excited when I heard about a new J. K. Rowling. London, a detective and a dead topmodel. Yup, I was head over heels. So naturally I ordered it rightaway and started reading as soon as it arrived.I wasn't let down. While I remained a little skeptical about A Casual Vacancy (which in my eyes is unfairly rated - it's a great novel), I fell in love with The Cuckoo's Calling at first sight. The plot and dialouges are brilliant. And while our protagonist can be a bit of a bore, Robin is my absolute favourite. So is Mrs. Rowling. For eternity.Find more of my books on Instagram"}, {"Review": "I’m about to reveal my secret!!!!!!!! I have purchased lots and lots of Harry Potter’s books – you know the time that every small and big kid wanted one….well, I gave them out as birthday and Christmas presents….but me…. I haven’t read any of them….though my son devoured each book and I have the entire series in my bookcase…I just haven’t had that “read me, read me” pull….Yes, truly!!!. I started book #1 and gave up after a couple of chapters. I know….I should have persevered but I did not…….maybe one day…it did take me over 30 years to read the Lord of the Rings books (which I totally loved)...so who knows!! But wait, I am not doing a review on Harry Potter or Frodo! I’m writing about a totally different book altogether and the only connection to Magical Harry P is the author. That’s right!!! A more different genre could have never been guessed by us veracious readers!!!– And if you haven’t read all the hype about her writing something not in same genre of Harry P and using a pseudonym…then you must be one of the very few people on this planet!! And if anyone ever believed that it was “overs” for JK after the epic and magical saga of Harry P..let me just say how wrong they would be!!! Yes, even despite all the hype and build-up.A Cuckoo’s Calling by Robert Galbraith a.k.a J.K. Rolling is actually pretty good. No magic wands, no potions, witches and spells…here we have a good, gripping, and interesting mystery tale filled with supermodels, fame, family, murder, betrayal, greed that introduces a character that is not your hero norm, but wow…..by the end of the book….he’s become one of those unforgettable fiction characters that stay with you for a long time.I loved the take on rockstars!!!!!!!!!!! \n “Like other inveterate womanizers Strike had encountered, Duffield’s voice and mannerisms were slightly camp. Perhaps such men became feminized by prolonged immersion in women’s company, or perhaps it was a way of disarming their quarry.” \nCormoran Strike is a private investigator whose business is not doing too well. One-legged (lost the other in Afghanistan fighting for Britain!!), overweight, bad dresser, not handsome in the least, homeless and living in his office – a total underdog!! Really!! his father, the ageing rock star who never married Cormoran’s dead groupie mother, is even demand interest on a loan he made to C!!! But under all that is an honorable and honest human being and that’s what pulls you in and has you wanting him to win all the obstacles in his life. \n “Strike was used to playing archaeologist among the ruins of people’s traumatized memories;” \nBesides C, there are so many other memorable characters. Robin, his secretary was the other favorite of mine in this story \n“Robin was disposed to feel desperately sorry for anyone with a less fortunate love life than her own – if desperate pity could describe the exquisite pleasure she actually felt at the thought of her own comparative paradise.” \n, about a murder of Lula Landry, a supermodel.The writing style is really great - elegant prose that flows beautifully, keeping you turning page after page. I loved the Englishness in this story……..I really smiled reading this……… \n She looked away from him, drawing hard on her Rothman’s; when her mouth puckered into hard little lines around the cigarette, it looked like a cat’s anus. \n The imagery……\n“Yeah,” he said.Duffield had returned, holding another drink, cleaving his way back through the crowd, whose faces revolved after him, tugged by his aura. His legs in their tight jeans were like black pipe cleaners, and with his darkly smudged eyes he looked like a Pierrot gone bad. \nThe settings in a dark and gothic London  are so vividly written that you can feel the cold, the grayness and menace that surrounds this world of rock stars, supermodels, designers and the paparazzi.Incredible sense of place and characters that brings it and them all to life.Allright….let me just say – get this book, not because it’s a J.K. Rowling only but that it’s a great mystery read.Some quotes that I thought were great….. “How easy it was to capitalize on a person’s own bent for self-destruction; how simple to nudge them into non-being, then to stand back and shrug and agree that it had been the inevitable result of a chaotic, catastrophic life.” “The dead could only speak through the mouths of those left behind, and through the signs they left scattered behind them.”  How true is this???? “Couples tended to be of roughly equivalent personal attractiveness, though of course factors such as money often seemed to secure a partner of significantly better looks than oneself.” And yes, I am hoping we get a bit more of Cormoran Strike. I loved his way of solving the case and it would make a great series."}, {"Review": "\n16 Jul' 2013\n \nFull confession:\n Pfft yeah, I totally did grab this after I heard it was written by JK Rowling? Mostly because I hadn't even heard of this book prior to the news. But the blurb itself makes it sound like my type of novel on a cold, rainy day, regardless of the author.Look, I'd like to pretend as if I were one of those people who wouldn't give a limp banana that Rowling wrote this book. I'd love to have the same level of self-restraint to cringe my nose in disgust and walk away from the bandwagon. But, so help me God, I do love Rowling's every bit of written word, and I cannot keep away from her dry British humour, her morbidly fascinating characters, and the thoroughness she puts into her work.So, prigs to the left, please.***\nWhy did you die when the lambs were cropping?You should have died at the apple's dropping,when the grasshopper comes to trouble,and the wheat-fields are sodden stubble,And all the winds go sighing,for sweet things dying.-Christina G. Rossetti, \"A Dirge\"I knew Rowling was writing a crime novel for adults, which is why I was a little more than baffled when I picked up The Casual Vacancy and found it far from the murder-mystery I had been anticipating.This -- The Cuckoo's Calling -- is that murder-mystery I have long been salivating over. And the long wait definitely paid off; I was not disappointed. It starts on a grim, curious note. A young celebrity has died, plummeting to her untimely doom. And as Rowling does best, a note of glorified tension permeated this opening, drawing us from the very first turn of the page, into Lula Landry's tragic fate.What follows is the investigation into her death, formally written off as mental-health-induced suicide, by the most unlikely of all heroes: Cormoran Strike and his assistant, Robin.If you imagine a dashing, more contemporary version of Sherlock Holmes -- perhaps one Benedict Cumberbatch in all his dreamy-eyed glory -- you better put your panties back on because Strike is no poster-boy:\nHer accidental assailant was massive; his height, his general hairiness, coupled with a gently expanding belly, suggested a grizzly bear.\nBut no less do we come to admire this former military man. He is quick, he is astute, and he is very much human. Like always, the best part of Rowling's work is her \nability to craft such life-like characters\n, whose problems and thoughts echo only too real, that no matter how bizarre or spectacular the events, we never for a second lose our immersion in the authenticity of her world.The amount of care put into every description really does show in her prose. The small, contextual humour she manages to sneak into the narrative makes it feel as if we were sharing a secret.This novel managed to be \nstimulating, engaging, and touching\n at the same time. As leisurely as the plot unfolds, never did I lose interest in Strike's investigation. My favourite fact being that there actually was an investigation! (cue the gasps)We are taken along for the ride; no clues or tidbits are left out from us readers, bereaving us from the chance of making our own accusations. No, we are kept invested in the outcome of Strike's investigation as if we were part of it ourselves. My suspicions shifted from one character to another, never making The Cuckoo's Calling a predictable nor boring read.Strike and Robin's relationship -- initially tip-toeing on propriety -- admittedly worried me at first. This is where you know you've read one too many Young-Adult or self-proclaimed \"Adult\" novels, and actually expect Rowling to do the unforgivable and use the opportunity to build up romantic tension and, God forbid, the dreaded Love Triangle.But this is Rowling we are talking about, and she steered way clear off that iceberg. Our two protagonists' chemistry remained friendly, albeit a little professional, before turning into the warm relationship a tutor might have with his apprentice. Of course if future books take this into another direction, we will see how I take it. In the meantime, I am keeping my fingers crossed.It is dynamics such as these -- between characters, within characters -- that makes The Cuckoo's Calling such a multi-faceted and descriptive novel. We see characters through many others' eyes, and yet \nwe are left to make our own judgements, never having our thoughts made up for us\n like so many writers attempt to do.The peak of the novel, although not exactly a new or never-before-seen turn of events, still came out as a surprise for me. The small details collided into a seamless blanket that covered everything nice and smoothly. I was very satisfied with the ending; no questions left unanswered, no forced bit of cliffhanger to goad us into buying the next book ...So yes, I jumped on this bandwagon. And I do not regret it one bit.***> My review of The Silkworm> My review of Career of Evil> You can also find more reviews at my blog"}, {"Review": "  Check out Scott Reads It! for reviews, giveaways, & more!  When it was revealed that J.K. Rowling had written a novel under the pseudonym, Robert Galbraith; I knew I had to read it. Rowling filled my childhood with magic, intrigue, and beauty with her Harry Potter series so I was eager to read her sophomore adult novel. It angers me how Rowling was betrayed by a friend who had revealed that she was the genius behind The Cuckoo's Calling. Every cloud does have it's silver lining and now, millions of people will be introduced to a clever mystery noir. Another silver lining is that Rowling will be donating her royalties from The Cuckoo's Calling to charity for the next 3 years. I'm still angered how someone could have betrayed Rowling in such a cruel manner. The Cuckoo's Calling is a much stronger novel than The Casual Vacancy and will definitely appeal to a wider audience than her adult debut. The Cuckoo's Calling is filled with all of Rowling's signature wit and charm that readers love. It's extremely evident from the writing style that Rowling still has the ability to create a tour de force, a novel that will definitely be looked on fondly 50 years in the future. This novel is a triumphant return for the Queen of Literature and it proves that J.K's domain and prowess doesn't just extend to children's literature.  This is an impressive piece of literature that is filled with immense intrigue and mystery. Albeit the beginning does have it's faults and is a tad slow-paced, this novel was extremely riveting. From start to finish, The Cuckoo's Calling does have it's share of dull moments, but they are overshadowed by the brilliance of Cormoran Strike. This is the mystery novel that I've been waiting for! This novel has all of the star qualities of Stieg Larsson's novel and BBC's Sherlock. Cormoran actually really reminded me of Dr. Watson from BBC's Sherlock (Martin Freeman). Maybe it's because of their military past or that they both are a bit troubled? I really liked Cormoran, but I thought that he should confront his girlfriend and move on. I wasn't a huge fan of Robin, Cormoran's secretary because I never learned too much about her. I really didn't like how Robin put up with her boyfriend, Matthew (I think) who kept on bossing her around and Robin didn't really act like anything was wrong with that. The whole plotline with Robin was extremely predictable right from when she was interested and was too simplistic. The mystery in The Cuckoo's Calling is well-throughout with just enough intrigue to keep me peeled to the page. I actually had no idea who the killer was throughout the novel; I had my incorrect suspicions though. I really liked how Rowling explored the world of the media and celebrities in such an unique and unusual way. You never really see celebrities as actual people in novels, they are usually portrayed as these untouchable gods that ordinary people have to gloat over. The fact that Rowling to decide to add a layer of vulnerability to Landry, added an interesting touch to this book. The Cuckoo's Calling is a novel worthy of immense praise. I'll admit that the only reason I read this book was because it was written by Rowling. I'm definitely eagerly awaiting the next installment in the Comoran Strike series and I can't wait to see what antics Strike and Robin get into next. Color me surprised, but I really enjoyed The Cuckoo's Calling! "}, {"Review": "Oh, wow. I’m speechless. I am speechless at how bad this was. The only thing that kept me from quitting altogether was the characters. The only two, to be precise. I was more interested in Strike and Robin’s personal lives than that sorry excuse for a mystery plot. The entire mystery/thriller (?) element of the book and the investigation process were so painfully and mind numbingly boring that not only did I forget every single character the moment they were no longer in the scene, I also seriously couldn’t care less as to who murdered the model. I just couldn’t muster the mental fibre to give a shit. Strike and Robin were the only saving grace of this book. "}, {"Review": "I admit that I am not a great fan of contemporary detective fiction. I find most books are too grim, even perverted with gratuitous violence, or unnecessarily long-winded with too much forced, fake-philosophical contemplation from detectives instead of actual action.So I am happy to say that I enjoyed JKR's debut detective novel a lot. The minus 1 star is for the writing, which had a superfluity of totally awkward metaphors & \"artistic\" descriptions & over-complicated sentences. This grated a bit at the beginning, but as the story slowly, but surely drew me in, I forgot about them. The private detective, Cormoran Strike, was created along the much too-obvious cliche-panels of the contemporary mystery genre: ex-soldier with a past & the scars of war (a missing leg), neglected child of an uncaring mother (the rock-star father is a bit of an unexpected, but good touch), at the brink of a dysfunctional relationship, who smokes & drinks. Yet, to my surprise, I found him really likeable. His assistant, Robin was a refreshing ray of sunlight that is normally not allowed to dwell in this type of fiction, so well done, JKR.The investigation of the crime is classically & nicely built-up: you get the pieces of the jigsaw puzzle to put the whole picture together. You are gradually introduced to the circle of potential perpetrators and presented with possible motives for the murder as you learn about the personality and background of the victim. JKR places her clues inconspicuously along with the red herrings, but you can pick them up & discover the real motive fairly early in the narrative, if not the person of the murderer. Yet, the story remains interesting till the very end.I will most definitely read the next book of the series."}, {"Review": "Sale Alert: 09Jun18 Kindle Daily Deal $2.99After reading The Casual Vacancy I had decided that I probably wouldn’t read any of her adult fiction books. I didn’t expect it to be like Harry Potter but I really wasn’t expecting it to be more of a character study and it was really bleak. I was depressed after reading it. I mention this because I didn’t have very high hopes going into The Cuckoo’s Calling and therefore I am pleasantly surprised.This is a pretty straight up who-dun-it. There isn’t a lot of action or anything like that it is an intellectual, interview the people and come up with the big picture. Think Rockford Files, Simon and Simon, Nancy Drew, Angel (without the vampires).  I’ve read where some people figured it out and knew who the killer was and to them I say BRAVO…cuz I failed completely. Yes, all the clues were there and I should have been able to put it all together but I looked left when I totally should have looked right and so I was surprised. But I totally like it when I’m fooled.Strike is a likeable enough fellow. He is a bit down on his luck both professionally and personally but that is not going to stop him from trying to get something done. I was rooting for Strike he is pretty likable as a down-and-out-just-trying-to-pick-up-the-pieces-character.\n“Other people his age had houses and washing machines, cars and television sets, furniture and gardens and mountain bikes and lawnmowers: he had four boxes of crap, and a set of matchless memories.”\nHe has a very easy repore with people and a way of getting them to talk, controlling the situation without seeming like he is controlling the situation and he was a bit of a romantic in some ways even if his own romance was completely in the toilet.Robin his new temporary secretary has always dreamed of a job like this, even if her new employer doesn’t seem excited to have her there. But she is going to make the most of this experience while she is looking for a permanent position. This was a very good start to a working relationship and hmmm….could it go in the direction of a romantic entanglement eventually. Well Robin does have a fiancé now but things can change. Can’t they? I definitely see a budding relationship of some sort there, whether it turns into a strong friendship later or more I’ll be fine either way. But I think that dress will cause some problems...teheeOverall it was a decent mystery and I enjoyed the interviews with the various characters. There is quite a bit about Strike, his past, his current stalker and I liked diving into all of that. It made him feel far more real to me.  I will definitely be continuing on with this pseudonym of J.K Rowling. I’m adding this just because it was my favorite conversation of the book and I do love drunken declarations. Strike is a bit of a romantic isn’t he(view spoiler)[“R’bin,” he said, giving up and gazing down at her. “R’bin, d’you know wadda kairos mo…” He hiccoughed. “Mo…moment is?”“A kairos moment?” she repeated, hoping against hope it was not something sexual, something that she would not be able to forget afterwards, especially as the kebab shop owner was listening in and smirking behind them. “No, I don’t. Shall we go back to the office?”“You don’t know whadditis?” he asked, peering at her.“No.”“ ’SGreek,” he told her. “Kairos. Kairos moment. An’ it means,” and from somewhere in his soused brain he dredged up words of surprising clarity, “the telling moment. The special moment. The supreme moment.”Oh please, thought Robin, please don’t tell me we’re having one.“An’ d’you know what ours was, R’bin, mine an’ Charlotte’s?” he said, staring into the middle distance, his unlit cigarette hanging from his hand. “It was when she walk’d into the ward—I was in hosp’tal f’long time an’ I hadn’ seen her f’two years—no warning—an’ I saw her in the door an’ ev’ryone turned an’ saw her too, an’ she walked down the ward an’ she never said a word an,” he paused to draw breath, and hiccoughed again, “an’ she kissed me aft’ two years, an’ we were back together. Nobody talkin’. Fuckin’ beautiful. Mos’ beaut’ful woman I’ve ’ver seen. Bes’ moment of the whole fuckin’—’fmy whole fuckin’ life, prob’bly. I’m sorry, R’bin,” he added, “f’r sayin’ ‘fuckin’.’ Sorry ’bout that.”Robin felt equally inclined to laughter and tears, though she did not know why she should feel so sad.”\n(hide spoiler)]"}, {"Review": "Two words for this: simply stunning.Cormoran Strike is my new hero. What an absolutely fantastic character Robert Galbraith has created. I just love everything about him, his size, his lovely caring attitude and his fearless quest to uncover the truth of the apparent suicide of Lula Landry, supermodel. Coromoran is hired by Lula's adoptive brother, John Bristow, to investigate her death as he doesn't believe she committed suicide, albeit the Police do and have ruled it so. There is also the very suspicious uncle of Lula and John, one Tony Landry, who is their mother's brother. John Bristow has hired Cormoran as he remembered him being friends with his younger brother. Charlie, who had sadly died at aged eight many years before. There then follows one of the best investigations I have had the pleasure of reading, and I honestly thought I had been watching a drama on TV as the characters are so vividly described, together with the whole process of Coromoran's extremely sharp brain. The writing is delicious and extremely descriptive and I literally couldn't put the book down until I had finished it, it was only my sleep deprived eyes that made me put it down each night! I think we have a new PI on the block now, so everyone had better watch out as he is good, very very good. Robin is his very very likeable and extremely efficient secretary and I love her commitment to Cormoran and his failing investigative business. I do have one complaint about this book and that is that it had to end. I am now left feeling extremely sad that I don't have Strike and Robin in my life and will have to wait until the sequel (hopefully) is out. Please please take note Mr Galbraith! Very high recommended. 20/10. "}, {"Review": "For me, this book didn't stand out especially in this genre. The plot wasn't very interesting and I only really found it exciting towards the last hundred pages. The best bit for me was the characters as I loved how well they were developed and how they interacted with others, especially Cormoran Strike.The story follows Cormoran Strike, a private investigator and ex military man who has been left with a severe injury as a reminder and has to cope mentally and physically with his injury. John Bristow approaches him with a case linked to fame and tragedy as John requires Cormoran to investigate his sister, Lula Landry's apparent suicide. The famous supermodel allegedly jumped off her balcony but John believes it was murder.The opening had me immediately hooked but this went downhill quickly with lack of action and tension. About a hundred pages could have been cut from this book as nothing of real significance happened and the story was long winded at times. The actual case wasn't very intriguing and I never felt a threat of danger or tension. At times, I found myself immensely bored and I just wanted to put down the novel. However, I definitely did enjoy the characters specifically Cormoran, Robin and Guy Somé's small appearance. Cormoran is a complex, engrossing character who made a great protagonist and Robin, his temporary secretary was a fantastic addition as she is wonderfully curious, assertive and clever. Guy Somé is full of hilarious lines and his scene is without a doubt one of the best bits in the book and the funniest. Towards the end, the novel became exciting and thrilling as the story finally began to unfold and things began to link together. The ending is nicely done with a slightly shocking twist but the way the clues weave in together with the solved mystery is brilliantly done.J.K Rowling displayed versatility in writing different genres but to be honest, I think this book was mediocre and I'm not bothered about reading the next book unless I can find it cheap."}, {"Review": "For me 5 stars, I stumbled on this by accident and glad I did..Strike ia a Cornish ex-military policemen, based in London, at a very low point in his life, Strike is sinking fast. I loved his clever, sharp stubborn character, especially the prickly ebb and flow relationship with his quick witted sidekick secretary Robin.The other plus for me was the twisty, story line, I did not guess who did it at all! was rather shocked in the end but in a good way, having just read 2 out of 3 of the Larson Millennium Trilogy our author more than holds his own. Wonderfully paced, lovable relateable characters, and a stonking good mystery whodunit...\"Proper Job\" :). Later.....ha ha did not realise it was by JKR just goes to show that super writing always shines through! "}], "Genre": "Crime", "ID": "16160797", "Desc": ""}