{"Name": "Murder on the Orient Express", "Image": "https://images.gr-assets.com/books/1486131451l/853510.jpg", "Reviews": [{"Review": "5 stars to Agatha Christie's Murder on the Orient Express. I chose to read this Christie spectacular after finishing \"And There Were None.\" She's such a treasure - never disappoints.A train. A murder. Multiple suspects. Nearly an alibi for everyone. But wait, there's a motive for everyone. How did this seemingly impossible murder occur? Hercule Poirot knows.Well, I'm glad he did because I was stumped! But with good reason as this plot twist will have your knickers locked down (and not just in a bunch!).The plot is just too delicious. The characters are just fascinating. No modern day electronics. No ability to research anything other than by asking questions. And Christie wrote this nearly 100 years ago. That's why it's a 5 for me -- it's pure good storytelling without anything in the way."}, {"Review": "*للقطارات سحر غامض تحدي الزمن*دائما يلهب خيال المبدعين. والت ديزني رسم ميكي ماوس لأول مرة في القطار، جي كي رولينج فكرت في ملحمتها هاري بوتر اثناء ركوبها القطاراجاثا كريستي استلهمت رائعتها جريمة قطار الشرق السريع في رحلة لها علي متن ذلك القطار المهيب العابر للدول والقارات*وللرواية البوليسية سحر غامض تحدي الزمن*واجاثا كريستي لها روائع في هذا المجال، وجريمة قطار الشرق السريع احدهابعربة قطار ملئ بالشخصيات المختلفة المتباينة..وامرأة غامضة ترتدي كيمونو احمر تجوب العربة ليلالدرجة انه بعد 75 عاما من كتابتها سيحولها كينيث براناه -بروفيسر لوكهارت في هاري بوتر ومخرج اعادة سندريلا لديزني من عامين- لفيلم جديد ضخم في 2017برغم من ان فيلما تم انتاجه من قبل لكنه هذه المرة سيقوم هو، برناه، بدور المحقق بوارو وجوني ديب في دور راتشيت...الذي ستدور حوله الاحداثمع ميشيل فايفر، مدام جودي دانيش وغيرها من النجوم المتالقينلتكون بجانب انها من أهم الروايات البوليسية التي باعت الآلاف النسخ، تم تحويلها للسينما والراديو والتلفزيون بل ولعبة فيديو ** القــصـــة **~~~~~~~~\nمع 13 شخصية بعربة قطار نوم من قطارات الشرق السريع المتجهة من اسطنبول الي لندن، ينجح بوارو بصعوبة ان ينضم لهم في حجز مكان بها، الفضل لصديقه وأحد رؤساء شركة قطارات النوم السيد بوك ، وهناك أيضا الدكتور الذي سينضم لهم للتحقيقاتالقطار يتوقف بسبب الجليد...وجريمة قتل تحدث لشخصية حاولت الاستنجاد من قبل ببوارو ولكنه لم يرق له من اول وهلةوتبدأ التحقيقات الكلاسيكية ... لتلك القضية المعقدةوالتي لا تنفك تزداد تعقيدا بمختلف روايات الركاب المختلفين في النوع والجنس والعمر والطبقات الاجتماعية بشكل رهيبالسيدة شبارد الظريفة تؤكد أن أحدهم كان بحجرتهاواقاويل مختلفة عن شخص متنكر في ملابس مراقب عربة قطار قصير اسمر ذو صوت نسائي وبوارو نفسه وغيره يلمحون امرأة غامضة غريبة طويلة ترتدي رداء نوم احمر ذو نقوش يابانية تتجول بالعربة ليلاياللغموض، ياللغرابةياللتعقيدات التي تواجه بوارووتواجهنا معهوبشكل روتيني ناخذ اقاويل الركاب ، نفتش حقائبهم، يجلس بوارو ليفكرتعمل خلايا عقله الرماديةيضغط علي الجميع بناء علي ملاحظاتهيكتشف حقائق يفجر مفاجأتوربما تلك هي اللغز الوحيد الذي ينتهي بحلين مختلفين تمامافإيهم ستختارلا تقلق لم أحرق لك شيئاولنر لمحة من الشخصيات------------** الشخــصــيـات **---------\nالشخصيات الأثني عشر غاية في التباين والغرابةبوارو عبقري كالعادة بخلايا عقله الرماديةالسيد بوك صديقه الوسيم صاحب شركة عربات قطار النوم يحاول ان يفكر معه طول الوقت بشكل رزين لا يخلو من النمطيةالسيدة شببارد تقريبا كانت افضل شخصية وجميل ان تخيلتها بشخصية ميشيل فايفر التي ستقوم بدورها..الحوار كان ظريف جدا وكوميدي خفف كثيرا من قتامة ورعب جو الاحتجاز في القطار مع الجثةالانسة ماري شخصية بسيطة ولكنها قوية بنفس الوقت، تصويرها اعجبني جدا وللاسف دار حولها الكثير من الشكالاميرة العجوز دراجومروف بعنجهيتها المحببة للنفس، وقولها ان القدر هو الذي رتب وجود المحقق البارع بوارو في ذلك التوقيتوالسيد راتشيت الذي سيحيرنا طوال الأحداث--------------** جو الأحداث **----------\n\nكما قلت، للقطارات سحربالاخص اذا كنت ستقضي فيه وقتا ، اياما بلياليها، مع شخصيات مختلفةوللقطارات هيبة ورهبةمازلت أتذكر تلبية ابي اخيرا لطلبي لركوب القطار الذي كنت احب عندما ياخذني لمحطة مصر لرؤيته..وبمجرد ان تحرك ونحن علي متنه بدأ الهلع واصرخ وابكي واقول لا اريد ان أسافر -رغم ان المحطة التالية الي بعد 10 دقائق ولكن كيف لي ان اعرف وقتها-ولكن الرهبة الاكير مع الشعور بالاحتجاز من الجليد العاصفوقد جائت فكرة الرواية عندما حدث الأمر في قطار الشرق كانت تستقله اجاثا كريستي وقد احتجزته الامطار والسيول 24 ساعة كاملة مع ركاب مختلفين استلهمت منهم تلك الشخصيات في قطار روايتهاوزادت عليهم جثة ومراقب عربة قصير غامض وامرأة طويلة بالكيمونو الاحمر اكثر غموضا ☆☆☆☆☆وكما قلت للروايات البوليسية سحروتقريبا هذه الرواية في بناءها السردي كانت كلاسيكية وبسيطة، بلا أحداث واماكن كثيرة...بل 95% من الاحداث تدور في مكان واحد، القطار المحتجز، في غرفة الطعام أغلب الأحداث... بل وتدور في يوم وليلة تقريباومع ذلك حبكتها معقدة ورهيبة لا تصدر الا عن ملكة الجريمة والغموضيظهر جدا اجواء المعاصرة لوقت كتابة الرواية، 1934، الاختلافات السياسية في الثلاثينات، كذكر عصبة الامم، عداوة مستترة فجة بين الامريكان والانجليز المحافظين غالبا بسبب خلافات مابعد الحرب العظميوكذلك عمل الكثير من الاجانب ببغداد وحلب، سوريا والعراق، والكولونيل الانجليزي المقيم اغلب الوقت بالهندبل وأن تيمة اختطاف الاطفال الموجودة هنا مبنية علي حدث اختطاف طفل في 1932 وانتحار المربية برغم تبرئتها☆☆☆☆☆وأعود لما قلته من قبل، لاجاثا كريستي نفسها سحرفرغم الشعور انها رواية قديمة، او كلاسيكية البناء، حيث حتي يغلب علي اغلب الحوارات التي يقولها الشخصيات شئ من التطويل احيانارغم كل هذا فإنني ظللت مشدودا طوال الاحداث، لا تطويل غير مبرر ولاحشو...كل شئ في مكانهوالصفحات الاخيرة نجحت في رسم ابتسامة كبيرة علي وجهي، ظلت تتسع حتي كدت أن اضحك بصوت عالي في القطار -ترام الرمل- حتي اغلقت الرواية ونزلت المحطة ظلت تلك الابتسامة للنهاية العبقرية حقا والغير متوقعةفلتلك النهايات...سحرمحمد العربيفي قطار الشرق السريع لثلاث ليالي من 5 اكتوبر 2016الي 7 اكتوبر 2016"}, {"Review": "I’m pretty astounded by how much fun this was. I mean, this may be just me, but “early-to-mid-twentieth century mystery about train crime” doesn’t exactly scream nonstop thrill ride. But here we are!I’m also not sure why it took me so long to write this review (two months, to be exact, so actually not that long for me but still) but again, here we are.I don’t actually really want to say much on this book, which is astounding in its own right because my number one hobby is making up various excuses for me to wax romantic on various subjects and generally listen to myself.But! In this case, that would be bad. Because a lot of the rad-ness of this book is due to the twist, but the Last Thing I Ever Want To Do is spoil this twist for you. Maybe this book will not sound fun because of my saintly consideration of your twist enjoyment, but you should just tuck away in your head that it’s completely cool ok???Let’s discuss the very limited number of things I won’t feel bad about disclosing.For one thing, the way this is constructed is very fun?? It takes you through the thought process of Hercule Poirot (Extremely Cool Belgian Detective - capitalized due to its being his official, government-ordained title) as he analyzes the sitch. So it kind of feels like you’re a detective too, and if that’s not the dream I don’t know what is.If you can look me in the eyes (but please don’t, I’d like to keep these relationships strictly internet-based thanks) and tell me you wouldn’t drop everything immediately in order to become a detective and/or international spy full time, you are not someone I’m interested in knowing thanks.Agatha Christie’s writing style is also really sharp and clean (which I can detect but nevereverever apply to myself, apparently). That’s probably why her books aged so well. This one definitely did, at least.I think some people were rubbed the wrong way (horrific expression my apologies) by the constant discussion of race/nationality as an inherent and generalized part of people’s individual psychology. That would’ve upset me, probably, if it weren’t applied to e v e r y b o d y. Like, if white people got the easy way out, one, what else would be new, and two, that would be the worst ever. Instead, every point of origin mentioned (Africa, England, America, France) is given its own psychoanalytic significance. Which is honestly interesting to read about, if only from a historical standpoint.Are you guys proud of me for how well I remembered this book after two months??? I am visibly prouder of myself for remembering three things about a novel I genuinely enjoyed than most scientists are after major breakthroughs.Which is incredibly on-brand for me.Bottom line: Quick fun historical well-written! I could’ve replaced this whole review with those adjectives and been much more convincing.---------------PRE-REVIEWTHAT WAS AMAZING THAT WAS AMAZING THAT WAS AMAZING!(I hope you read that in Aziz Ansari's voice. Reevaluate your life if otherwise.)review to come yo---------------CURRENTLY-READING UPDATEmy hobbies include: hopping on bandwagons"}, {"Review": "”The train, it is as dangerous as a sea voyage!”So, this was my first Agatha Christie book and considering how much fun I had while I read it, it definitely won’t be my last. ;-) Yes, you read correctly and your mind didn’t play tricks on you:I had \nF.U.N!!!\nI actually enjoyed reading this so much I constantly found myself giggling with delight! *lol* I swear there’s nothing better than a mystery or a puzzle you need to solve and I guess in this particular case it might have even been both! ;-PThere were so many hints and inconsistencies that my head was literally spinning but being the curious person I am, I still tried my very best to be perceptive and to collect all those little treats. XD By the end of the book I felt like a squirrel, gathering all the pieces until I was finally able to make sense of them! *lol* And somehow, I don’t even know how, I actually did it!!! ;-PMaybe to watch eight seasons of “Castle” and all the Sherlock Holmes series and movies eventually paid off? Who knows!? *LOL* All I know is that I solved the mystery and I’m so damn happy I’m still grinning and laughing like crazy!!!24 hours after finishing the book! XD”Bughouse – that’s what this business is – bughouse!”Yes, I couldn’t agree more and since I don’t want to spoil anyone who still wants to read the book, I’ll write down my thoughts in this nice and tiny spoiler section! *lol* Detectives you’ve been warned! ;-PThe solution and ending:(view spoiler)[”If so and so is lying, on what point are they lying and what is the reason for the lie?”I don’t even know how often I asked myself this question throughout the entire book, it must have been pretty often though! *lol* I was always certain that it was more than one person who killed Ratchett and at some point I suspected everyone to be the murderer. XD Even the doctor and the conductor! Haha! And I think it was exactly that moment when I finally realised that I was right, because as soon as I thought it, I instantly latched onto the conductors testimony and from there on everything fell into place. ;-) I knew he must have lied and therefore been involved in the crime and then I thought about all those little hints I collected so carefully. The weapon in the spongebag, the mention of the actress, the door that was open, the incriminating pipe cleaner, the familiarity between Colonel Arbuthnot and Mary Debenham, the number of wounds on the victim and especially the remarkable difference of those mentioned stab wounds, … the list could go on and on! *lol* Once I made the connection with the Princess, it wasn’t all too hard to figure who the Countess was and after analysing every character that was on the train I came to the same conclusion as Poirot! ;-) Sure, there were some clues and hints I didn’t get, but in the end it seems like I was able to find the most important ones. XD I think the only thing I didn’t like was the ending. >_< It was rather abrupt and the righteous woman in me wasn’t okay with the way things were handled. I mean yes, it seems like Ratchett was a monster and they all had a very good reason to end his life. (Some more than others…) I don’t like the idea that they were let off the hook so easily though. I mean it was murder after all! There should have been a consequence. If everyone would take the law into their hands our society would fall into pieces! There’s a reason we have laws and courts. Well, that’s just my subjective opinion though. I know some people will say it’s just a book and that’s okay with me! ;-) I just felt a need to point it out because it really left a bad taste in my mouth. XD Guess that’s the superhero in me speaking. *lol* (hide spoiler)]All things considered I really enjoyed “Murder on the Orient Express” and I can easily recommend it to everyone who loves to get their mind into a knot! *lol* This book most certainly will keep you on your toes! Be careful not to slip! ;-P"}, {"Review": "Wahoo! I'm finally going to read a Poirot book! I have the complete blu-ray box set and love this series so much! And now I get start on one of the books! =) ♥The wonderful Hercule Poirot can not ever go on any holidays without someone being murdered. But, never-the-less he will figure it out. And a murder has taken place upon the Orient Express. The man murdered in named Ratchett, but we find out later on in the story this is an alias. Poirot has simply uncovered that the murderer is on the train - not escaped out the window into the snow they are trapped in as the murderer would want us to believe. Poirot interviews all of the passengers, makes a list and the little grey cells start to formulate. Ten QuestionsOn the paper was written:Things needing explanation1. The handkerchief marked with the initial H. Whose is it? 2. The pipe cleaner. Was it dropped by Colonel Arbuthnot? Or by someone else?3. Who wore the scarlet kimono?4. Who was the man or woman masquerading in Wagon Lit uniform?5. Why do the hands of the watch point to 1:15?6. Was the murder committed at that time?7. Was it earlier?8. Was it later?9. Can we be sure that Ratchett was stabbed by more than one person?10. What other explanation of his wounds can there be?Now, I have already seen all of the shows and movies so I know what happened and I think the ending is bloody brilliant! I'm not going to give out the spoiler to those that have not read this yet, but I think it's the perfect murder and I loved the outcome. And I was so proud and happy with Poirot's conclusion. You will just have to read the book or watch the show to find out why I say that, brilliant! \"Then,\" said Poirot, \"having placed my solution before you, I have the honour to retire from the case . . . \"MY BLOG: Melissa Martin's Reading List"}, {"Review": "Sacrée Agatha Christie!She was pretty darn amazing.I must say I never read and so much liked a book with such a boring constant setting. I mean a train? Come on, how exciting can that get? … Apparently, though, it is a great setting for mystery cases! I just now remember watching ‘‘The Tourist’’ with Angelina Jolie, and wasn’t the scene in the train the one that was going to have in impact on everything to come? Yes, it was! Trains are fast, they create blurred lines, and they are filled with strangers… We can say they add a once of suspense in stories.This is my second book by Mrs. Christie and my first in the Poirot series collection. I chose the most popular one to start with, because it always makes me wonder, with popular books, what they have that is so special and makes people want to read them. Well, this one has a lot going on for itself. Just the premise alone – a rich man is being stabbed to death twelve times in his train compartment, yet there is no sign of struggle and there was no way of exist for the murderer – had me all crazy on wanting to read this book.It is worth your time from beginning to end. The craziest thing is that at one point, when I concluded things were beginning to look too silly and unrealistic, everything turned around and I was presented with another solution. JUST when I thought Agatha Christie missed the target, Mr. Poirot’s great intelligence unravelled the case to its fullest and my eyes got so big… Let me tell you something: You may thing you have, but you have NEVER read a mystery book such as this one. And that is the truth.Care to have your mind blown? You know what you have to do ;)"}, {"Review": "\n‘’Some crimes God does not forgive!’’\nLast week, I watched (for the gazillionth time…) ITV’s 2010 production of ‘’Murder on the Orient Express’’ with the inimitable David Suchet in the role of our beloved Hercule Poirot and it prompted certain thoughts in my mind. Why is this considered one of Christie’s finest creations? Many say that, arguably, it is her best work and this view I do share.I don’t think any of us need a synopsis. To say the story is well-known would be an understatement. Even people who haven’t read the book know of the outstanding outcome and the resolution of, possibly, the most controversial murder (but is it a ‘’crime’’?) in Christie’s marvellous works. So what is it that makes this novel by the Lady of Crime so iconic and a point of reference?Is is the exceptional cast of characters, each one battling with the demons of the past? Is it the wintry atmosphere? The intense feeling of claustrophobia, of being trapped in a train, within a snowstorm, in a foreign country with a dead body lying in a compartment? Or is it the absolute, ultimate questioning of the moral values we have come to adopt? What is right and wrong? When injustice isn’t punished, to what extent can we bend the human limits? God and Law can’t always protect us...Here, Hercule discovers that his little grey cells are only a small part of the solution. It is his heart that has to do the rest.This is a jewel not only of Crime Fiction, but of Literature in general, regardless of the genre. A work that doesn’t ask the reader to think of the ‘’who has done it’’ question, but to contemplate on the ‘’what would you have done’’ issue. And as for me, I fully agree with Greta Ohlsson. Some crimes God doesn’t forgive….My reviews can be found in: https://theopinionatedreaderblog.word..."}, {"Review": "Well, ladies and gentlemen. That was fantastic! I mean, what can I say? Agatha Christie was a genius. So is David Suchet who narrated the audiobook (and played Poirot in the TV show).This story is set on a filled to capacity train, heading from Stamboul (Istanbul) to London. It's the middle of winter and the snow has built up on the tracks and forced the train to a standstill on it's way through Yugoslavia (an area that is now in Croatia). This is when the murder is discovered, which luckily for me (I can be impatient) happens within the first 50 pages.There are so many characters in this. It was a little difficult to keep them all straight but Suchet's voices helped. Let's start with the characters who aren't suspects. We have, naturally, Hercule Poirot, detective extraordinaire, Monsieur Bouc, the Wagon-Lits director and Poirot's old friend, Dr. Constantine, a doctor on the train, Pierre Michel, the conductor of the Stamboul-Calais coach, and Ratchett, the victim. Bouc is the one more quick to jump to conclusions where as Poirot is very methodical and waits till he has all the information and all the clues fit before committing to the assignment of guilt. Now for the possible murderers. Of course, all of the passengers on the train are suspects. We have Hector MacQueen, Ratchett's secretary, Edward Masterman, Ratchett's valet, Mrs. Hubbard, Greta Ohlsson, Princess Dragamiroff and her maid, Hildegarde Schmidt, the Count and Countess Andrenyi, Colonel Arbuthnot, Mr. Hardman, Antonio Foscarelli, and Mary Debenham. There are lots of interviews, collecting of evidence, and taking notes. I liked how Poirot, Bouc, and Dr. Constantine kept going over the evidence with each other. The repetition of the clues helped me keep track of all of them. With so many suspects the evidence kept going in circles and making my head spin. I had a few theories but for the first time ever one of them was right! I didn't know why I was right until Poirot started to piece things together but once he did the answer was quite clear. I felt like the conclusion was the proper way to end the story as well.Agatha Christie never fails to impress me with her ingenuity. I plan on reading many more of her novels in the near future. As Poirot would say, I pray you, join me."}, {"Review": "I fear it is impossible to say too much about this book without spoilers. Because of this I will be brief so you can never go back and say, \"I would have loved this book, but that Matthew guy from Goodreads ruined it for me!\" So, here is my quick but hopefully useful review.This is a classic mystery. You like mysteries? You have to have to read this! Characters are great! So much fun meeting and learning about them all.Current mysteries have nothing on Christie. This is very intricate and very fun to watch the clues be put together and the solution come into focus. But, now I am getting too close to spoilers.Read it! It's good!"}, {"Review": "A train stopped at midnight in the snow. A dead body found in a compartment. Twelve stab wounds leave no doubt it was murder. And Hercule Poirot, tasked with solving the crime, is certain the culprit is a passenger on the Orient Express. The first clue that Murder on the Orient express will be a laborious read arrives shortly after the murder victim is discovered. Among the clues is a scrap of paper which reads (view spoiler)[ “– member little Daisy Armstrong.”\n(hide spoiler)] From this clue, Poirot leaps to an illogical conclusion that serves as the foundation for the remainder of the book. The message on the scrap of paper leads Poirot to assert that (view spoiler)[the murder victim is a man named Cassetti who is wanted for the murder of an innocent girl named Daisy Armstrong. This connection makes about as much sense as finding a scrap of paper that reads, “– member Ms. J.K. Rowling” and assuming the person it belonged to is the long-lost fourth child of the world-renowned author. (hide spoiler)] Poirot makes the connection between the scrap of paper and the murder victim with unbearable convenience. Equally baffling is Poirot’s assertion that the murderer could not have exited through the open train window because there are no footprints in the snow. Is it so unfathomable that the murderer might have gone out the window and sidled along the train or even climbed atop it? Such oversights leave readers to wonder if Christie intends to misdirect her audience or if her leading man isn’t as bright as he first appears. Poirot dismisses probable explanations, clings to his illogical assumption about the murder victim, and proceeds to investigate the crime by interviewing every passenger on the train in a designated room. He regales each passenger with his outlandish conclusion, stating it as stone-cold fact, and observes their reactions. Reading through the same set of questions over and over again is a wearisome act, one that grows more tiresome when one remembers that characters could very well be lying, making the entire exercise feel like wasted time. When this repetitive process finally concludes, Poirot then interviews every passenger again while digging through their luggage in their individual compartments. Couldn’t he have interviewed them in their compartments to begin with? Was it necessary to drag out this process? After Poirot completes his lengthy interview process, he regales his audience with the solution to the mystery. Those hoping to solve the case themselves will be sorely disappointed, as Poirot’s ability to pinpoint the murderer is dependent on information that’s unavailable to the reader, and the answer to who stabbed the victim borders on absurd. However, despite the improbability of the reveal, Christie’s book leaves a lasting impression because of the uncomfortable questions it raises about justice. Murder on the Orient Express is a tedious read that reaches an unlikely, albeit unexpected, conclusion – one that lingers because of its themes."}, {"Review": "I read this book mostly in preparation for the 2017 film adaption, but I've always been curious about Agatha Christie. She's been recommended to me multiple different times over the course of my life, but I never felt the time was quite right to pick up one of her novels until now. The premise is very straightforward; master detective Hercule Poirot happens to be aboard the Orient Express rail car when one of the passengers is killed in the night. He is then set to the task of solving the crime while the train is excavated from a surprise snow drift. Because this is such a short mystery novel, I believe it's best to go in with as little outside knowledge as possible. In fact, there's only one thing I really want to focus on in this review and that is this. I did not guess the murderer. That is probably the biggest compliment a reviewer can pay to a mystery novel. I didn't even know what the hell was going on for most of this novel if I'm being perfectly honest. Now, call me an idiot if you feel so inclined, but I personally thought the mystery was very well written. Especially given that we discover clues in time with Hercule Poirot & are limited to knowing only what he knows. The conclusion of this novel took it to a place I never would've conceptualized & it was such a fun ride getting there.As for the rest, I recommend you pick this up and discover it for yourself. A very approachable murder mystery novel with a classic feel & unique twist!"}, {"Review": "If you've never read one of her books, this one sums up the Agatha Christie experience quite nicely.As in: You will never solve her mysteries.Don't bother trying, because it will only infuriate you when you find out that the answer to the whodunnit is something far-fetched & entirely unbelievable.Roll with it, I say! Just trust that the little Belgian detective will eventually make everything all right, and settle in for a cute (albeit old-timey) mystery.I'm not gonna bore you with a plot synopsis, but if you're a fan of stories that take place on trains, child killers getting shanked, and plenty of stereotypes thrown in for good measure...then this is the book for you!"}, {"Review": "Actual rating: 4.5 🌟This was my first, but definitely not my last, Agatha Christie book, and I truly loved it!It was a wonderful mystery that kept me guessing the whole way through.I really liked the structure of the novel. Each character getting their own chapter was a genius idea, it really helped me to get to know them. All of them seemed realistic and well developed, which was surprising, considering the amount of people and the rather short length of the book.The writing style was very atmospheric and enjoyable to read. It matched the genre perfectly."}, {"Review": "I have a confession to make. I’ve never read an Agatha Christie novel. Why is this a big deal, you might be asking yourself if you have also never jumped on the Christie train. (Train? Get it? Because this entire book takes place on a train! *laughs forever at own joke*) Well, I’m a life-long bookworm, with a degree in English literature to prove it. And Agatha Christie is the unarguable queen of an entire genre. Did you know that Agatha Christie is the best selling novelist of all time, second only to the Bible and the works of Shakespeare in terms of sales? Because I sure didn’t. I knew that she was a big deal in the mystery genre, but bestselling novelist of all time? I was unaware. But I know now, and have now taken my first step to rectifying my oversight.So the question is: what did I think of my first Christie novel? I loved it! This was the tenth installment of the Hercule Poirot series, but thankfully it was a perfect place to start. From what I’ve gathered, each Poirot novel stands perfectly well on its own, and that was definitely the case with Murder on the Orient Express. This little novel was published in 1934, and it has aged incredibly well. Even though the book was published 83 years ago, the language was incredibly simple and easy to sink into, and the plot was super engaging. I loved that all of the suspects were confined to the train with Poirot and the victim, and that Poirot had no outside assistance to aid his crime solving. Also, that ending was a complete surprise to me. I usually manage to guess plot twists and endings, especially in murder mysteries. I didn’t guess this ending, and it was refreshing.The characters were wonderfully varied. Some of them tended to almost be caricatures, but always for a reason. The star of the book, Poirot, actually took a back seat to the other characters, but this was very purposeful. Poirot is a more laid-back and introverted person than many famous detectives, which works incredibly well for his line of work. When people don’t notice you, it’s easy to observe things they’d prefer remained hidden. Sherlock Holmes has always been my favorite detective. I’ve read every single novel and short story Conan Doyle crafted about the famous man with the mind palace, and I am completely addicted to the BBC show starring Benedict Cumberbatch. Seriously, I’ve watched each episode at least half a dozen times. Not that there are many episodes to watch… *sobs in a corner* That being said, I already love Hercule Poirot. I don’t know that he’ll ever quite equal Sherlock, but I fully intend to give him every opportunity. I will be reading more Christie novels, and soon.For more of my reviews, as well as my own fiction and thoughts on life, check out my blog, Celestial Musings."}, {"Review": "\nAll aboard to the mystery!\n\nWILL THE REAL POIROT PLEASE STAND UP?\nMy visual memory of the famous fictional detective Hercule Poirot is the actor Sir Peter Ustinov, yes, I know, he doesn’t look like he’s described on books (and even according Agatha Christie’s daughter, he doesn’t behave on screen like the book detective) but when I was a kid, I’ve never read any Agatha Christie’s novels, meanwhile I have watched several of the theatrical films and TV movies made by Peter Ustinov and along with watching him in several Biblical movies, well, that image stuck in me.Curiously enough, I remember watched the 1974’s adaptation to film of Murder on the Orient Express but I didn’t remember that Ustinov wasn’t in that particular adaptation but Albert Finney. As I told you, the image of Ustinov stuck quite deep in my memories.I haven’t watched the recent work by David Suchet, that thinking about the actor, he looks indeed like it should be look like the fictional Hercule Poirot.However, now in the incoming (November 2017) new adaptation where Kenneth Branagh will perform the famous detective, and while certainly he doesn’t look like Ustinov, Finney or Suchet, I trust in the great acting skills and carisma of Branagh to deliver an amusing new version of the Poirot.\nTRAPPED WITH A MURDER!\nNot always, but it’s cleat that Agatha Christie enjoyed to find amusing ways to keep trapped her characters in a scenario where they were unable to leave the place and well knowing that a murderer is between them and even sharing space with the corpse.You can find similar trap-like situations in other books like Death on the Nile (having Poirot investigating that case too) and the famous And There Were None, for example.Here, in Murder on the Orient Express, the cast of characters are trapped in a train (The Orient Express, duh!) due a snowfall, in the middle of nowhere, so they can’t get out, and a murder is committed.Due the crime is in 1934, they haven’t ways on the train to communicate with anyone asking for help (for the crime or the snowfall), and the responsibility to find a culprit for the murder is up to the famous Hercule Poirot, that coincidentally get aboard, in the last minute, on the equally famous Orient Express.This is challenge to Poirot in the mental field, having to trust in the testimonies of strangers but......also he should do a balance between law and justice……since not all crimes need to be really solved……while other crimes deserved sharp justice.\nLYING MYSELF\nWhen I watched the trailer of the incoming new adaptation (November 2017) of Murder on the Orient Express, I knew that it was about time to read the original novel finally, and before of the premiere of the new film.I’d watched the 1974’s adaptation when I was a kid, sometime that a local TV station did a cycle of Agatha Christie’s mystery movies (theatrical and made-for-TV alike) and while I hadn’t remember many details,……well, the solution is so epic (don’t worry I won’t spoil it!) that it stuck in my head as deep as the image of Ustinov (not matter that he wasn’t in that particular adaptation!).So, for reading this novel, I had to lie myself and keeping engaged at the speed of the developments in the book, without thinking how it was solved, and you know what?...…it worked!Since I enjoyed a lot the reading of the book, not matter that I had clear how it’d end (again, I won’t spoil it! Trust me! Geez!), I had fun analyzing the clues exposed, trying to figure out how Poirot would be able to come to his own conclussions.This is an entertaining reading and rather quick to do."}, {"Review": "Okay, how do i start this? Is it possible to be shocked and not shocked at the same time? I mean, that should be a normal reaction for reading this book. Honestly, i don’t know how i’ll make a good review for this but i’ll give it a try.First of all, i’d like to say that this is one of the best books i’ve ever read in my 23 years of living. I don’t think i’m exaggerating though.Second, the way the story was written, the details, the clues — it’s like you, as the reader, are the one solving the case which actually is the reason why this book will get you so hooked. To be honest, my mind was at work all the while i’m reading this. I seriously could not stop reading and whenever i had to put the book down, it aches me. It’s a page-turner kind of book, i must say.Lastly, I’d like to admire the main character here — Hercule Poirot. The way he was written as a character, i believe, was well-thought of (if that is the perfect term for it).I was amazed with his POV because he was able to think of all possible scenarios, probabilities of each evidence happening, and how he was able to analyze anything that he was told. Seriously speaking, not all detectives are like him or could be like him with his great skills (and i meant no offense to anybody that would be able to relate themselves or anyone into this statement).The way he handled this case has got me sitting at the edge of my seat the whole time. And the fun part here, i have attempted throughout the whole read, to beat him with analyzing the evidence/s that were stated, and i think i only succeeded once.To add a few more thoughts, i actually realized that — because of this book — people (anyone) can do just about anything when forced to face with a situation that required so much emotional struggle for a person to handle. If asked to read this book again, i would say yes. So i’m giving this book 5 stars and i would probably see the movie now to compare and see a visual of what i just read.To those who haven’t read this book yet, start now and happy reading!!!!! :)🖤Just want to include something here about the movie since i decided to check it out as well and some are asking — in my opinion, it was a very fast-paced version of the book. Nothing really negative but i’d prefer the book than the movie because the investigation was more detailed. Every single detail was written (like interviews, gathering & analyzing evidences and statements, etc). Overall though, it’s basically the same. You won’t be disappointed with the movie. ** To see my full length review, click the link below: 👇🏼https://geekyalien.com/author/alexist..."}, {"Review": "The lone train chugs down the tract westward, in the cold, dark, winter's night, over a country that no longer exists, from Istanbul,Turkey, to Calais, France, then across the English Channel by boat, for home, a long, tedious, three day trip. For Hercule Poirot, just having successfully wrapped up a case, in Syria, yet he's summoned again to another. No vacation, for the tired man, London calls and he goes...The little Belgian detective (please stop calling him French), is much in demand. Becoming rich and famous, solving difficult mysteries, all over the European continent, and beyond is hard work. The Great Depression, doesn't effect him....Quite strange but the train's coaches are full at this time of year too, poor concerned Poirot, can't get a first class compartment, luckily Monsieur Bouc, a director of the train company, and friend of Hercule's, is on board, helps the detective. Second class accommodations, he receives ( apparently not that close of a friend to M. Bouc). Poirot shares a compartment with a young, likable, American Hector MacQueen, working for an evil looking fellow American, a millionaire by the name of Samuel Ratchett. The man asks Mr.Poirot, to work for him he needs a very good bodyguard desperately. Someone has threatened his life, but the detective refuses, doesn't like his face, which greatly angers the aloof millionaire, preparing to compensate Hercule, very well indeed. Past midnight the train is stopped, by a snowdrift in the middle of nowhere, what was then, Yugoslavia. It might be days, before they can be rescued worst still , a murder has been committed during the stormy night. A cry was heard, maybe a groan by Poirot...in his bunk. Ratchett, no big surprise , was butchered with numerous stabs to his body, Dr. Constantine, examines the corpse, seems puzzled by the bloody wounds...they don't make any sense. An all encompassing shadow falls on the train... No weapon is found... of course M.Bouc, hires Hercule to find the killer or killers. The bored Belgian, is revitalized, gladly accepts the assignment and challenge, a dozen passengers, French, Russian, English, Swedes and Americans, a dozen suspects...From royalty , the middle class, to servants. Later , the stained knife, in a bag is located, also a handkerchief, button, burnt letter and other items are inside the dead man's compartment. Too many clues, to be credible, all starts to clear when the victim's real identity , is found out. He was a gangster, Cassetti involved in a notorious kidnapping, back in America, obviously patterned after the Lindbergh case of the early 1930's. The problem for Hercule is, everyone of the passengers has a good alibi, Mr. or Monsieur Poirot, has a lot of time to think, nothing adds up... too many coincidences...Who knows when or if the people of the Orient Express can be saved....But from whom ? For fans of mystery stories one of the best, Agatha Christie at her prime..."}, {"Review": "All aboard the murder train!A long time ago when I was in high school and dinosaurs still roamed the earth I read a whole bunch of Agatha Christie novels. The weird thing is that I was never that big of a fan of hers. I was getting into mystery novels, she’s one of the best known writer in the genre, and the local library had a whole bunch of her stuff. At some point I realized that I prefer my murders to be a bit less civilized, and I moved onto other styles of the genre without giving much thought to ole Agatha after that. However, I recently watched the latest film adaptation done by Kenneth Branagh and even though it’s just OK that gave me the urge to check this out again. And it reminded me that classics are very often classics for a reason.Belgian detective Hercule Poirot is on-board the Orient Express along with an assortment of travelers and their servants. An American named Ratchett is stabbed to death in his compartment just as the train is stopped by snow. Circumstances make it seem that whoever killed Ratchett is probably still among the people in the first class car that night. As Poirot sorts through the evidence and questions suspects he finds contradictions that make solving the murder a very complex task.One of my reasons I stopped reading Christie was the impression that she didn’t play fair in her whodunits. (And since I’m going off very old memories I could certainly be wrong about that.) By that I mean that it seemed like the solution depended on some kind of in-story background information that a reader couldn’t possible know. There’s a touch of that here with a big piece of the plot involving a link to a famous fictional crime. (Although it’s obviously inspired by a famous real one.) Yet, that’s set up as background info that’s pretty much given to us as soon as it’s revealed so it doesn’t feel like Christie was just cheating by springing the unknown on a reader as a way to hide the killer. In fact, since the murder took place in a confined space where people were coming and going that everything you need to know is given to us as Poirot builds a timeline and uses a diagram to place the location of people in the train car at various times. One of the great things about this book is the way that Christie uses the logistics of this to actually give you all the clues while also obscuring the solution in the details. I’d also had the idea that her writing was very dry and boring. There’s actually a lot of touches of humor that I missed as a young idiot. Even though there’s a lot of dated things in terms of race, sex, and class it also felt like she was often making some sly commentary on attitudes of her time. For example, the guy working for the railroad is positive that an Italian passenger must have killed Ratchett since it was done with a knife, and while Poirot often seems to agree with him that circumstances make him a good suspect you also note that he begins outright mocking the guy for sticking with this theory as things evolve.I also very much liked the ending which again goes against my idea that these were very proper books that believe in strict law and order when the resolution here is a lot more interesting and complex.I may have to try some more of these books to see exactly what else I was wrong about."}, {"Review": "I do not like to write reviews of whodunits: you can't do justice to the analysis without explaining what happened in detail, but then it spoils the story for whoever has not read it. So, for those mystery lovers who have not read The Murder on the Orient Express so far, I will post a single line review: Go and read it! This one rocks! What are you waiting for?Now, the review for fellow mystery and Christie lovers who have read the book(or like me, re-read umpteen number of times till the pages came out of the binding!).(view spoiler)[Whodunits are like magic tricks. The writer shows you everything: the clues are all before your eyes: you rack your brains, trying to fit a solution on the jigsaw, but are unable to do so: then, in the last chapter, the author reveals that one bit of detail which you overlooked, but which was actually crucial to the solution. You kick yourself for being such an idiot, then bask in the afterglow of having been fooled by a master.A conventional whodunit has certain rules. First, there is a murder. There are a fixed number of people who could have done the murder, who are equal in terms of motive and opportunity. As the story progresses through its twists and turns, the reader keeps on guessing, shifting his suspicion from one suspect to another. If the novel is well-written, the author will succeed in totally removing suspicion from the actual murderer before the final revelation.Very rarely does an author break the basic rules and get away with it smoothly, as Agatha Christie does in this novel. It shows what a master of the craft she is.The Murder on the Orient Express is a classic locked room mystery: in the snowed-in train, one of the twelve passengers have to be guilty. And as the past history of Ratchett (the victim) as the mastermind behind the kidnapping and murder of little Daisy Armstrong comes to light, we know that we are in for a real humdinger: because there are so many people wishing him out of the way, and many of them are likely to be on the Calais coach. But when Poirot unearths the fact that each and every one of the passengers is connected to the Armstrong family in some way, we feel that Dame Agatha has stretched coincidence to the limit, even if it is in the interest of a good detective yarn.But then all is revealed: There is no coincidence. They are all there as part of a plan, and they are all guilty! In fact, Poirot is the coincidence, the joker in the pack.I have not read another mystery where all the likely suspects are guilty! This is such a grand flouting of convention that would have fallen flat on its face, had not the story been carefully structured to make it possible. The American household is possibly the only one in the world where you can find all nationalities. If such had not been the case, the connection of the occupants of the coach to the Armstrong family would have been evident much before Christie wanted to reveal it. And the snowed-in train is the only possible setting where all the suspects could be cloistered without the possibility of outside interference, as the plotters thought the train would move on, and that the murder would be attributed to a person or persons unknown. It all fits in the end.Also, this one story where the ending is just perfect.(On rereading the story, I noticed certain incidents and snippets of dialogue (especially the one between Colonel Arbuthnot and Mary Debenham) which seemed to point in one direction but on hindsight, were crystal-clear in their meaning. This is why I love rereading Christie's books... it gives valuable insights into the author's technique.) (hide spoiler)]Dame Agatha Christie might not be a great writer: there are more \"literary\" mystery writers out there, like Dorothy L. Sayers and P. D. James. But as the spinner of a classical mystery, it is my humble opinion that there is none to touch her... and that there is no sleuth to match the little Belgian with the magnificent moustaches and the egg-shaped head."}, {"Review": "Murder on the Orient Express is my second Agatha Christie novel. The first was The Murder of Roger Ackroyd which I loved and like Murder on the Orient Express I didn't guess the killer. Agatha Christie is The Best-Selling novelist of all time and pretty much invented and perfected the whodunit. Orient is neatly crafted, elegant and fun. All of Christie's novels(I'm basing this on all 2 of her books, I've read) have a simple layout, A murder is committed, an array of suspects and just enough info to pose a theory. It sounds simple and you should be able to solve it but I didn't DAMN IT! With Orient a man is murdered on a train, all 12 people on the train car are suspects, the train is snowed in and the police cannot reach it. Unfortunately for the murderer, the world famous detective Hercule Poirot is on board. This sounds so simple but I didn't guess the murderer. As soon as the murderer was revealed I felt dumb because it was so obvious and therein lies the genius of Agatha Christie. Obviously I recommend this book.Book Riot 2018 Read Harder Challenge: A classic of genre fiction ( mystery)2018 Badass Books Challenge: A classic book or a book published over 100 years ago."}, {"Review": "Murder on the Orient Express is one of Agatha Christie's most loved works. Adapted for radio, film and television, most people have some idea to what you are referring when you mention it. A classic whodunit with Christie's signature styling on characters and investigation. I adore Hercule Poirot and grew up binging on Christie's works. I read this book as a child, and of course have seen a couple of movie adaptations, but in spite of that, I still had a rollicking good time reading this again. There is something so satisfying about the ending of this one. I couldn't dream up a better conclusion. I think if you are looking to get into Christie's books, this is an excellent starting point as I feel it is a perfect example of her method!Previously: Emojiathon Book #2 complete!!!❄ = takes place in winter😓 = book I said I was going to read and then didn’t I find Christie's classic whodunits so satisfying! Never disappointing and very nostalgic for me. Full review to come. . Stay tuned!"}, {"Review": "Murder on the Orient Express, Agatha Christie, c1934Characters: Hercule Poirot, Samuel Edward Ratchett, Hector MacQueen, Masterman, Colonel Arbuthnot, Harriet Hubbard, Count Rudolf Andrenyi, Countess Elena Andrenyi, Princess Natalia Dragomiroff, Mary Debenham, Hildegarde Schmidt, Antonio Foscarel, Greta Ohlsson, Pierre Michel, Cyrus Hardman, Dr. Constantine, M. Bouc.عنوانها: قتل در قطار، قتل در قطار سریع السیر شرق، تاریخ نخستین خوانش: روز پنجم ماه آوریل سال 1977 میلادینخستین بار در سال 1934 میلادی چاپ شد، از سری داستانهای هرکول پوارو، نویسنده: آگاتا کریستی، مترجم: ناشناس، نشر: ناشناس، بسیار قدیمی، تعداد صفحات: 280مترجم: محمد گذرآبادی، ناشر: هرمس، سال نشر: 1390، چاپ دوم، تعداد صفحات: 279 صفحه، شابک: 9789643636012؛خلاصه داستان: هرکول پوآرو در هنگام سیاحت در ترکیه، با تلگرافی به لندن احضار می‌شود. او به سختی در یکی از کوپه‌های واگن تخت‌خواب‌دار قطار سریع‌السیر شرق، جا پیدا می‌کند. در قطار، پوآرو هم‌سفرانش را زیر نظر می‌گیرد، و بلافاصله متوجه می‌شود، که افرادی که در واگن او هستند، جمع ناهمگونی را تشکیل می‌دهند. در واقع از تمام طبقات اجتماعی، نماینده‌ ای در داخل این واگن وجود دارد، ولی کسی که بیشتر از بقیه توجهش را جلب می‌کند: «ساموئل راچت»، یک تاجر خیر آمریکایی است، که از چشمانش پیداست، آن‌طور که وانمود می‌کند، آدم خیرخواه و خوبی نیست. خود راچت هم به پوآرو نزدیک می‌شود، و اظهار علاقه می‌کند، که او را به عنوان محافظ خود، استخدام کند. پوآرو پیشنهاد او را نمی‌پذیرد، صرفا به این دلیل که از قیافه ی راچت خوشش نمی‌آید و ...، «قتل در قطار سریع‌ السیر شرق» در بین آثار کریستی، به غیر از «قتل راجر آکروید» بیشترین تعداد خوانشگران را داشته، اما امروز اشتهار کتاب بیشتر به خاطر فیلمی است که در سال 1974 میلادی، با همین هنوان و از روی همین اثر ساخته شد. داستان بافتی هندسی دارد: در قطار دوازده مظنون هستند، کتاب دوازده فصل دارد و دوازده بازجوئی، با یک مقدمه و یک مؤخره که کشف قتل و کشف قاتل است. ا. شربیانی"}, {"Review": "I decided to read this classic Agatha Christie story in anticipation of the new movie starring Kenneth Branagh as Hercule Poirot. I listened to the audiobook, performed by Dan Stevens, and it was a delight. A quick summary: The international detective Poirot is in Istanbul and is eager to get back to London. Thanks to help from a friend, he gets the last berth on the Orient Express, which was full of passengers. On the second night of the trip, a man is murdered, and tensions rise when the train gets stuck in a snowdrift. Poirot realizes the murderer must still be on the train, and sets out to interview everyone and figure out who is lying. This is a clever story, and I can see why it's one of Christie's most beloved mysteries.Dan Stevens' performance was so marvelous that after finishing I looked up what other books he has narrated and was thrilled to see he also did a reading of And Then There Were None. Highly recommended!Favorite Quotes\"The impossible could not have happened, therefore the impossible must be possible in spite of appearances.\" \"If you confront anyone who has lied with the truth, he will usually admit it - often out of sheer surprise. It is only necessary to guess right to produce your effect.\"\"I like to see an angry Englishman,\" said Poirot. \"They are very amusing. The more emotional they feel the less command they have of language.\""}, {"Review": "“The impossible could not have happened, therefore the impossible must be possible in spite of appearances.”I just realized that I've never written a review for this. Must have slipped my mind. Maybe because I'm so excited to see the movie adaption with Judi Dench, Rooney Mara and Daisy Ridley.Anyway, this wasn't what I had expected, and then again it was. Now, whenever I saw this book on here or in a bookshop I pictured a very diverse and interesting cast of characters and a classic murder mystery. So far so good. I also imagined sun and heat and maybe something typically oriental but my own stupidity stopped me from realizing that in Winter, you know, it's cold. Even on the Orient Express. Especially in the mountains. Well done, Kai.Apart from that I got what I wanted: a fascinating murder case, lots of suspects and an equal amount of liars, traditional detective work and a spectacular ending. The only thing this novel lacked of was suspense. And that's one thing a crime novel should have for sure. Not even the big murderer revelation was all that thrilling anymore. And Then There Were None was much better when it came to thrill and excitement.In a nutshell: I liked the book but I can't wait to love the film.Find more of my books on Instagram"}], "Genre": "Crime", "ID": "853510", "Desc": ""}