{"Genre": "Crime", "Reviews": [{"Review": "K, I'm going to put this down. I read 25%, so I'm going to refrain from giving it a rating, as it's not fair. I didn't read enough. And maybe I'll pick it up again some day, but as of right now, I'm having a hard time stomaching it for its... politics.It's a true reflection of Rowling's staunchly center-left politics, as she takes sharp digs at far leftists as well as the conservatives. That's fine. What bothered me was the incredible lack of nuance in the Israel-Palestine conversation Rowling s"}, {"Review": "(A-) 81% | Very GoodNotes: Wherein women cling devoted to manipulative men, and hugs, tea, missives, and accidental kisses stir illicit intrigue."}, {"Review": "Lethal White, the 4th volume in Cormoran Strike series, kept me at the edge of the seat/bed during the past 4 days. I think it is the best so far although some parts could have been trimmed by the editor. It starts to resemble the Harry Potter series, with each book longer and longer. If this one has 650 pages I hope the next will not have 800 or more. Rowling talent as a storyteller in so I was never bored but still, the plot could have been a bit more intense with a bit less filler. The novel"}, {"Review": "Roses r Red, Violets r Blue, the Cover's Green just to suite you.💚💚Strike & Robin are back for their biggest case so far....case full of Red Herrings & White Horses.LETHAL WHITEA blackmailed Minister, Riot in the Olympics, Mysterious Murder..Goblet of Fire, 's that you?!Plus, more unexpected twists into the personal life of Strike & Robin..Certainly I'll miss picturing Hugh & Emma as I used to since my first read, Oct.2013.Lethal White is 2 Parts book, 2 Cases.. not totally separ"}, {"Review": "I hate it when they change cover designs mid series."}, {"Review": " A little too long and overly complicated mystery BUT still well worth the read!  Lethal White picks up shortly after where Career of Evil ends at Robin and Matthew's wedding. Then the plot fast-forwards to a year later when London is preparing to host the Olympics. Strike is now famous and business is flourishing. Robin, on the other hand, is suffering from PTSD and is living in a state of misery. Two cases are at the forefront, while some side cases also get some attention. There is a lot goin"}, {"Review": "650 PAGES IS TOO MANY PAGES FOR A MYSTERY NOVEL. That being said, JKR puts together a damn good mystery and I loved all of the actual mystery parts of this story. She is the *best* at creating great and interesting and fun characters. (More Barclay in the next book, kthnx)However, I think that JKR is pretty terrible at writing romance (don't @ me) and I very, very, very much do not love the whole Robin/Strike pairing and everything surrounding those parts of the story or anything dealing with Ro"}, {"Review": "JK Rowling gives us her trademark intricate, tightly plotted, and complex crime fiction in this, the fourth of her engrossing Cormoran Strike series, set amidst the heady and euphoric background of the surprisingly successful 2012 London Olympics. It begins where Career of Evil left off, at Robin Ellacott's disastrous wedding to the sullen and resentful Matthew, with Robin over the moon at being reinstated at Strike's detective agency as partner. Strike is finding his fame is reducing his opport"}, {"Review": "\"J. K. Rowling is working on a 4th book in the series.\""}, {"Review": "confession: there are times when i feel like i am an unreliable rater/reviewer. j.k. rowling practically gave me my childhood, so i feel like the least i could do to thank her is by reading and giving all of her books 5 stars. to say im biased would be an understatement. but in the case of this book, i can say, with good conscience, it deserves all 5 of those stars.i was worried when JKR first began writing for adults, especially under the crime/mystery genre. but four books of this series have"}, {"Review": "As I decided to read this book and only this one during the past week, it dawned upon me that indeed, this book has been written by Robert Galbraith, and it's J.K. Rowling who is the ghostly figure here. I don't fear being ostracized for my rating. But most of my friends have given this book higher ratings than me.The denouement was not the balm that could assuage the page upon page of nothingness. The murderer's identity was moot. The damage was done. The bird has flown the coop. Though this wa"}, {"Review": "I can't even remember the last time I was so impatient for the next book in a series to be released."}, {"Review": "This was an okay crime story, but as I was reading “Lethal White” I couldn’t help but be frustrated by the fact that this book was TOO LONG! 600+ pages to tell a crime story is too long when the plot is so dense and the different storylines so intricate. Interwoven with that we get the story of Robin’s and Strike’s continued partnership which was another thing that quite frustrated me: This book was a case of dumb decision-making based on misunderstandings that could have been solved if only the"}, {"Review": "After I finished, \"Career of Evil,\" I could hardly wait for this next story. Perhaps my hopes and expectations were too high, as I found this disjointed and lots less than anticipated. I won't be so anxious for the next in this series if there is another. If there isn't, I won't mind that so much either. 2 of 10 stars"}, {"Review": "Robert Galbraith’s Cormoran Strike is in no doubt my favorite private eye series. I love Strike’s relationship with his now parter, Robin Ellacott. The two work so well together. I started the series with an audiobook and have continued to do so. The narrator’s voice is striking and perfect for Cormoran’s tough guy persona. Strike likes intelligent women and treats them as his equal. Always a wonderful thing to come upon in a book. There is nothing like seeing a woman with a good mind given the"}, {"Review": "This should have been a magnificent book, but in the end I am giving it four stars and saying it was very good indeed. The one star deduction is for the way the book began. At first it was just so slow - not a lot happened and Robin's endless monologues about whether she loved him or not ( and there are two possible hims there) went on and on. And on.Then we started to get into the meat of the story and crimes were committed, people went undercover, some characters acted really badly, some had t"}, {"Review": "Liked and disliked it in equal measure. I am tired of Robin and Matthew as a dysfunctional couple. At book four it feels like the author is milking a dead horse. A white horse, the book is infested with them. One more won't make any difference."}, {"Review": "4 stars right on the nose. It is another decent mystery very much in the same vein as the previous Strike novels. If you have read those you know exactly what to expect here.Lots of characters: Galbraith (Rowling) likes to fill her mysteries with characters. If you are a person that is easily confused if there are lots of characters, proceed with caution. I definitely have to stop and think about who is who from time to time.A convoluted mystery: Another thing that keeps me stopping to think is"}, {"Review": " Strike & Robin are back! This is the fourth novel in the \"Cormoran Strike\" book series. POLITICS & FAMILY DON'T MIX Cormoran Strike has become a famous detective in London, thanks to his success of catching the fearsome \"Shacklewell Ripper\"; and after re-hiring Robin Ellacott as her main partner, now he has even had to sub-contract other people to be able to cope with all the cases that have come to his office.But despite that apparent bonanza of work, nothing has prepared Cormoran Stri"}, {"Review": "This book really irritated me. The mysteries, involving blackmail and a possibly strangled child, are not very compelling until the last quarter of the book. There's an info dump in the last two chapters that sums everything up. However, my major problem is that the book is mostly filler, not mystery. That might be ok if I were really invested in the Strike/Robin relationship (or non-relationship), but I'm not. That whole will they or won't they thing is tiresome. Robin is just a complete idiot"}, {"Review": "UPD: This is how I find out?! From a newsletter on Bookdepository?!! Release date: 18th September 2018. Could I BE any more excited??Yes, I'm stooping that low! I'm using GIFs now because there are no words to express how much I'm waiting for this book, I need more of Robin and Cormoran and their unusual relationship. I'm sure that so many things are going to go down in the next one because I can't stand suspense any longer... aaaah!"}, {"Review": "I really love the Cormoran Strike series. That is why I am so excited for the next book in the series. Lethal White has been the longest we have to wait so far.To satiate my excitement I have created fan-made covers for both US and UK Editions.US EditionUK Edition"}, {"Review": "✨Pre-reading shenanigans.✨• An extract has just been released and 🤩🤩🤩🤩🤩!That is all! https://www.theguardian.com/books/201...You’re welcome!• WE FINALLY HAVE A RELEASE DATE!GOOD GOD THIS TOOK YONKS BUT I’M SO HAPPY IT IS BEING PUBLISHED THIS YEAR!"}, {"Review": "Oooh... I waited for this book to be out with such anticipation! Dropped my other reads to get through this.Overall, it turned out to be a let down. I expected a compete blowmybrainsout read, but this was just an OK read at best.It starts with Robin's wedding... The wedding part was tense enough and got me absorbed in the book right away. But once that fizzled out, the whole Strike-Robin story took a dip down and had me rather annoyed with the pair more than anything else. There was nothing in t"}, {"Review": "For added gifs, you can also check out my review here! =)Warning, spoilers ahead! But only for Cormoran/Robin stuff. I didn’t spoil the mystery. That defeats the purpose.Themes for Cormoran:- Getting the agency stable financially -->This leads him to take on a case that is lucrative instead of the usual ones guided by his morals.--->The case involves digging up dirt on a politician who is beloved by the people.-Distracting himself with a comfortable relationship with Lorelei (I call her hi"}, {"Review": "Lethal White is the fourth (4th) book in the “Cormoran Strike” series, written by Robert Galbraith (J. K. Rowling). The series primary characters are Cormoran Strike (Strike) a private detective in London and his clerk, turned investigator, turned partner Robin Ellacott. The books are mysteries centered around the crime of murder. Strike is a veteran of the Afghanistan war where he lost a leg. He manages to get around on a prosthesis often stressing his stump to great pain and irritation. Howeve"}, {"Review": "I’m not a big Harry potter fan and though have seen all the films I’ve yet to turn a page of any of the books. I’m just not into magic spells and all that malarkey. But I do admire the cleverness J. K. Rowling shows in developing a set of stories – a whole world, in fact – that has gripped so many people. My son is one of them; he’s also the reason I’ve watched the films - and played the spin-off video games too. But all of that aside, I admire Rowling most for having the versatility, the imagin"}, {"Review": "I have been very stingy with 5 star rating recently. But this book absolutely deserves to be rated 5 stars. I love this series and it just keeps getting better and better. If you love great murder mysteries with very interesting and intriguing characters, look no further. You don’t have to have read any of the other books in the series to enjoy this book, although I would highly recommend it. This will be in the running as one of the best books I have read this year, and I have read over 100 boo"}, {"Review": "3.5 starsThis book gets 5 stars for the personal/professional relationship updates between Robin and Cormoran, but only gets 2 stars for the 'murder mystery' presented in this book. I *loved* seeing all the extra page time that Robin and Cormoran finally get in regards to their individual personal lives (warning: the slow burn still burns slowly). In fact, the book is practically at the half way mark before anyone even gets murdered. Loved it! But then the mystery does take over like I said. Whi"}, {"Review": "If you're into stuff like this, you can read the full review.Bloated: \"Lethal White\" by Robert GalbraithI couldn't finish Harry Potter. It read to me like an amateur college project: it wasn't story telling, it was paint-by-number narration. It goes to show that if you tap into the right market at the right time then you're going to make a buck or two regardless of any skill or talent. With Harry Potter the first book was tightly edited, but they got progressively worse; the last ones were subje"}], "ID": "28170940", "Name": "Lethal White"}