{"Name": "The Friend", "Image": "https://images.gr-assets.com/books/1516211619l/35906836.jpg", "Reviews": [{"Review": "Having loved I Am Watching You, I was really looking forward to The Friend. I’m pleased to say that I absolutely LOVED it.The Friend had me gripped and intrigued throughout, as I wasn’t sure where the story was going, so eagerly needed to read more to find out. This thought provoking psychological thriller was full of mystery, intrigue, suspense and an impressively manipulative character. Ooh, I do love a good sociopath to keep me on my toes!I really don’t want to go into detail about the plot, because with many psychological thrillers I think it’s best to go in blind, so if you like the sound of the blurb, please give this a go. I just have to say that I was loving this story so much, I enjoyed being in the moment and never consciously tried to work out where the story was going or how it was going to end, so everything came as a surprise to me.Teresa Driscoll is very good at creating well developed and believable characters that I often find easy to connect with. However, in her thrillers, rather than her women’s fiction books (which are also wonderful, so do check those out too), I find myself feeling much more suspicious of the characters. Unsure of what will happen and which characters to fully trust. “Not every hour is equal. Ask an insomniac how long the night is” - I relate to this far more than I’d like to. As someone who has had severe insomnia for many years. I’d like to clarify that nights are exceptionally long, yet at the same time nowhere near long enough. I need more sleep!“To know the Lizard is to drive past the flat and unpromising landscape of the RNAS base, smiling inwardly at the trick of it. For, just a few miles in any of several directions from the neatly fenced but unlovely facility, there is this feast of the unexpected and unspoilt.” – It’s true, going past the military base then approaching the Lizard is so magical. The Lizard landscape is like a hidden treasure. I doubt I’ll ever become fully used to the magic of it. On another note, the power behind that neat fence steals my husband and controls my life. I sometimes feel like a character in a dystopian novel. Give me back my freedom!I loved this whole book and the epilogue too. I highly recommend this book to fans of psychological thrillers. I actually think I enjoyed The Friend even more than I Am Watching You. They are both standalone novels. Needless to say, this is yet another brilliant 5 star read from this talented author. I can’t wait to see what she comes up with next.The Friend is available to pre-order on Amazon:https://www.amazon.co.uk/gp/product/B...My review is also available on my blog here:https://littlemissnosleep.wordpress.c..."}, {"Review": "2.0 Stars— After being floored with how good the first thriller I read from Teresa Driscoll (“I Am Watching You”) was, I was not as impressed with “The Friend”. In my opinion, “The Friend” took a very long time for anything (and I do mean anything) to happen, and when it did, it was very slow developing. 90% of the novel is the main character, Sophie, telling her story of meeting and becoming friends with the new woman in town, Emma. Emma appears to Sophie to be a perfect new friend , but some of the people in Sophie’s circle of friends and family don’t like her. As the story progresses, the author reveals more and more about Emma until a major crisis takes place for which Emma gets the blame. This is the turning point of the novel, but despite being well written, the snail’s pace makes this one hard to read and enjoy. The conclusion is also a let down as I expected a lot more diabolical plot twists and a lot less information about the two ladies opening a deli. Avoid this one unless you like very slow building plots with little reward in the end. "}, {"Review": "The book begins with Sophie on a train ride, hours from home, when she receives a devastating phone call that her 4 year old son has been rushed to the hospital and in need of surgery. Sophie left Ben with her good friend Emma and her son Theo for just one night. How did this happen? We flashback to the beginning of Emma and Sophie's friendship. Through these flashbacks we see all the warning signs that Emma may not be the friend she thinks she is. I have to be honest and say that this book just didn't grip me at all. Thankfully it was a quick read and I was able to finish it but I just wasn't very impressed after turning that final page. Meh. Thank you to NetGalley for providing me with a digital ARC in exchange for my honest review."}, {"Review": "EXCERPT: I had seen the worst of what two people can do to each other. My neighbours and friends. How could I be all right?I had walked into a room, happy and relaxed, with my son waiting for me on the doorstep. Unknowing. Innocent. Me. Sophie. The woman who allegedly had this chocolate box life. I had walked in smiling and been met with a scene which I never, ever want anyone to imagine. Not my son. Not my husband. Not even the police Inspector with the wrong notebook and all the wrong ideas about all of us. It was unreal. That is what it was. Shocking and unreal. ABOUT THIS BOOK: On a train with her husband, miles from home and their four-year-old son, Ben, Sophie receives a chilling phone call. Two boys are in hospital after a tragic accident. One of them is Ben.She thought she could trust Emma, her new friend, to look after her little boy. After all, Emma’s a kindred spirit—someone Sophie was sure she could bare her soul to, despite the village rumours. But Sophie can’t shake the feeling that she’s made an unforgivable mistake and now her whole family is in danger.Because how well does she know Emma, really? Should she have trusted her at all?Time is running out. Powerless to help her child, still hours from home, Sophie is about to discover the truth. And her life will never be the same.MY THOUGHTS: Now that I am breathing normally again, am I going to be able to write a review that does The Friend by Teresa Driscoll justice? I read this book overnight, unable to put it down, consumed by the need to know what happens. It starts off light-heartedly, two women with children of a similar age meeting over a crashed furniture truck and a burst bag of parsnips. Well, it could happen to anyone. Great friendships have been struck in stranger situations. But this friendship quickly spirals into a series of dramatic, suspenseful occurrences where you are never quite sure who is reliable, and who is playing games. Manipulative games. Dangerous games that had me forgetting to breathe. The final few chapters had me crying like a baby. Teresa Driscoll had me running through the whole gamut of my emotions. I have not read her previous psychological thriller, I am Watching You, but I intend remedying that. Soon. There is not one word that I would change in this superb read. And after reading The Friend, I will be seriously questioning my own judgement next time I feel an instant affinity with someone. Thank you to Thomas and Mercer via Netgalley for providing a digital copy of The Friend by Teresa Driscoll for review. All opinions expressed in this review are entirely my own personal opinions. Please refer to my Goodreads.com profile page or the 'about' page on sandysbookaday.wordpress.com for an explanation of my rating system. This review and others are also published on my blog sandysbookaday.wordpress.com https://sandysbookaday.wordpress.com/..."}, {"Review": "What a twisted and disturbing read! A very fast paced and enjoyable story that I read in a day.Emma moves to the villiage with her son and soon Sophie and her son Ben become friends, despite the rumours flying around about the newcomer. Sophie believed that she could trust Emma with Ben.. until one day when Emma is hours away on a train and news comes through that he has been hurt in an accident.I really did feel for Sophie and waned things to work out for her. Thanks to Amazon Publishing and Thomas and Mercer via NetGalley for a copy of this book to read in exchange for my honest opinions "}, {"Review": "Compelling and dramatic! A mother's worst nightmare!Sophie thought she could trust Emma to care for Theo and Ben and to keep them safe. She was wrong.'The boys... There's been some kind of accident, Sophie.'More than two hundred miles away, my child is in a hospital bed being cared for by strangers.Sophie and Mark Hill and their four year old son, Ben, have moved to a small village in Devon. Mark must still commute to London until he can relocate his business closer to Devin. Why Devon? 'I'll feel safer in the country, Mark. A different person. More cooking. Less stressing. It's what the baby needs. What we all need.'The worst irony? I moved us to the country because I thought it would be safer.Emma Carter and her four year old son, Theo move to Tedbury shortly after the Hill family. Ben and Theo become fast friends, Sophie and Emma follow suit. We met on a Thursday. Two boys. Two mothers. Much later, and especially on that train, I will torture myself for the curiosity and excitement I felt; the enthusiasm with which I so easily opened my door to it all. When Mark meets Emma at a dinner party it seems that he doesn't feel the same way. 'You didn't like her, did you?' I turned to monitor his reaction. He shrugged. His eyes said I was right. Then Sophie's good friend, Helen, comes for a visit and it's clear that she isn't too keen on Emma, either. It was the first time Helen had ever annoyed me. She had so clearly failed to take to Emma that I even wondered if, like everyone else, she was a bit jealous.... ****The Friend by Teresa Driscoll is written with strong characters, a dynamic storyline, and a fast pace that kept me turning the pages. In a small village rumors flow like water, creating more questions than answers. The teaser drew me in and propelled me forward all the way to the startling conclusion. Of course, I had to know what had happened to Ben and Theo! Once I started I didn't want to stop until I found out!"}, {"Review": "I usually ask others to read books from different countries and origins. But my own practice lacks that determination. I would try to avoid foreign authors may be due to my comfort zone with Indian authors. Not just that once in a while when I take books of the said category my mind went through a hell lot of tantrums. It makes me feel \"I am not getting it Vishnu. Don't read more\". But then my heart pursue it till my mind able to cope up with narration style. \"The Friend\" by Teresa Driscoll was one such experience for me. Until I reached the milestone of 70 pages my mind has tried all possible distraction to leave the book but I persisted.The friend is the story of a countryside town called Tedbury. The protagonist of our story is Sophie. The author has divided suspense into two parallels. In current time Sophie got a call that her son along with another kid was admitted to the hospital. She was on the train when she received the news. During the long train journey, she recalled how she ended up in this situation. So what she recalled? There comes our mysterious character called Emma. A new lady in Tedbury who became Sophie's best friend from the day one. The lady whom disliked by his husband and closed friends but she didn't listen to. It is her (Emma's) past that is bothering current of Sophies's life. A suspense that makes you go through the book.Coming to writing style, it is a completely different experience for me. I am not kidding when I said I struggle to overcome the benchmark of 70 pages. the book is intermingled with past-present, character-emotion, story-fillers. The books not for beginners. You need to read it with full concentration. Coming to language portion, it is easy to follow. Characterization is brilliant and plots it also excellent. Only weak nerve it the narration style, if you can catch it you will love the book. I fumble for the first 3rd and that has affected my experience overall.Detailed Review Link - http://chevusread.blogspot.com/2018/0..."}, {"Review": "Thoroughly enjoyed this one, it's had me banging through it ALL DAY. So imagine that you are stuck on a train, miles from home, your child has been in an accident with his friend - the hospital don't know which is which - the injuries are severe perhaps more for one than the other - what do you do? Well there isn't a lot you CAN do except pray for the train to go faster and reflect on what has brought you here...Therein lies the premise for \"The Friend\" - a twisty psychological thriller that follows Sophie's new friendship with Emma, a seemingly perfect pal, bringing a fresh new feel to the small village they live in, both with young children, they naturally gravitate together. Suddenly though divisions within this small community seem rife, gossip about Emma abounds and maybe she isn't quite as perfect as she seems...So things I loved about this: The position the author put her main protagonist in brought a fresh feel to the genre - you know how you often read these books and the idiotic actions of characters can make you crazy - there's danger lurking and they'll run right into it, usually having forgotten to charge their phones, or not bothering to call the police because of some unrelated thing they don't want to disclose, or you know all the plot ploys by now to make sure the reader has to wait for things to be revealed. In this case the main character has no option for stupidity, she's stuck on that damn train, so apart from some very natural hysterics, she has no options. As a reader this ensured I stayed right on her side. No rolling of eyes with this one...The story told in flashback as Sophie remembers it all, is clever and quite scary in places. We do see some things from other character's points of view but it's mostly Sophie who has had a fairly rough time of it, none of which I'll give away. Still, she is ripe for this new friendship, one that might be more toxic than even our external characters are beginning to realise...It was a page turner, to be sure. As we all wait for that darned train to get Sophie home, the story unfolding is fascinating and intriguing. The characters all have levels and I liked the exploration of friendship, real and otherwise, plus the family drama side was realistically described.Overall a really good read. Recommended. "}, {"Review": "Sophie has suddenly found herself trapped in every loving parents worst nightmare.She is on a train,hours from.home and has just received a chilling phone call.Her four year old son Ben and his young friend are in hospital after a serious accident.Sophie is at her wits end,she thought Ben would be safe with her best friend Emma.Someone Sophie had bared her soul to,despite the village rumours.But now Sophie is beginning to wonder if she has made a unforgivable mistake.Because how well does she know Emma? Should she have trusted her to take care of her precious son?Sophie is about to discover the truth.And her life will never be the same.It is absolutely terrifying when your child is gravely ill in hospital and you aren't with them,believe me I know from personal experience.So I could fully understand Sophie`s fear,guilt and desperate need to get to the hospital as quickly as possible.Trapped on a train with nothing else to do but panic and wait for updates on her son`s condition,Sophie takes us into the past and goes over the events leading up to her current situation.Through her eyes we meet the residents of the small village of Tedbury where she lives with her husband Mark and their young son Ben.Like most other small communities everyone knows everyone else's business and what they don't know,they make up.We get to see the inner workings of Sophie and Mark`s marriage,how and where she met Emma and the effect that seemingly innocent meeting had on her life and relashionships.There are parts that are voiced by other characters including Mark and Emma but the story is mainly voiced by our protagonist Sophie.I really enjoyed this well written,gripping thriller,it was intense,creepy and had a twist that I definitely didn't see coming.There where a few parts that where quite hard to read and I really felt a lot of sympathy for one character.This story really played with my emotions at times,a emotional roller coaster ride from the first page to the last.Many thanks to Thomas & Mercer for a arc of this book via Netgalley in exchange for a honest review."}, {"Review": "As in Teresa Driscoll’s first psychological thriller, ( I am Watching You) we begin this journey on a train...On this train we meet Sophie. She is miles away from home when she gets the call that her son Ben has been in a serious accident while under the care of her new friend Emma. A woman she bonded with immediately when Emma moved into her old friend Caroline’s house, with her young son Theo, in tow. A woman that nobody else seems to like or trust. Told in alternating chapters of “Today” and “Before”...The suspense builds steadily in the “Before” chapters, as you wonder who Emma really is, and why she moved to town. The tension builds a bit more slowly in the “Today” chapters, as Sophie struggles to get any information about Ben’s condition, and cannot get to the hospital fast enough. If you love psychological \"suspense \"novels with a few surprises that don’t require you to completely suspend disbelief, then give this author a try! 4.5 stars She is two for two in the psychological thriller genre for me!"}, {"Review": "This is a story which packs great pace, as good thrillers should. Sophie is on a train and distraught as her son Ben is one of two boys in hospital. Her husband Mark is on the train as well. The story alternates between the present and the past. The story in the past starts off when Emma moves into town with her son Theo. Sophie likes her immediately and they get along very well. A shocking murder follows unnerving the local residents. While it seems an open and shut case initially, there is a hint that there may be more to it than meets the eye.As the story progresses, it is clear that Emma has a past which Sophie and others do not entirely know about. But does any of it matter today to her friend Sophie?There are some twists in the story, as one would expect towards the end. The book is a very easy and engrossing read, especially due to the fast pace and good characterization. And yet, the story in the later part of the book could have been much better.My rating: 3.75 / 5"}, {"Review": "I really enjoyed reading I Am Watching You but I have to say that The Friend was even better! Emma moves into Sophie's little town and they become fast friends. Emma is charming and spontaneous. Their sons are about the same age and they become good friends as well. Not everyone is so smitten with Emma though which causes a lot of conflict. Despite wild rumors flying about town, Sophie easily dismisses them as small town gossip.The Friend is fast paced and kept me up well into the night because I just didn't want to put it down!"}, {"Review": "Sophie is on the train when she receives a chilling call informing her that her son Ben and his friend were in an accident. Sophie had left Ben in her friend Emma’s care and the on whole trip back reflects on the past which led to the current dreadful situation. Did she make a big mistake in trusting Emma because how well do you actually know somebody ? The Friend is a fast moving psychological thriller with an exciting twist that I didn't see coming. Narrated in flashback the book builds up the suspense slowly but surely. A book I would definitely recommend and will look forward to more by Teresa Driscoll I would like to thank Amazon Publishing/Thomas & Mercer & NetGalley for providing an ARC of this book in exchange for my honest and fair review.This and more reviews at https://chloesbooksblog.wordpress.com/"}, {"Review": "I received a free e-copy of The Friend by Teresa Driscoll from NetGalley for my review. The friend is a phychological thriller. Sophie, the main character, lives in a small village of Tedbury. She meets a new woman in Tedbury who has a son, just like she does. They become friends and the boys get along well with one another. A set of events leads Sophie's son to be injured while under the care of her new friend. Should she have trusted her friend to watch her son? A very fast read with lots of suspense. "}, {"Review": "Well, now. If, like me, you have trust issues sometimes and don't like meeting new people, let this story be a lesson!Sophie is traveling on a train with her husband when she gets a phone call to say her four year old son, Ben, is in hospital. Sophie had left Ben in the care of her friend, Emma. She thought Emma could be trusted. They were kindred spirits after all. But how well does Sophie know Emma anyway? Was what happened to Ben truly an accident? Or is there something more sinister going on?The story of The Friend is mostly told through flashbacks from before Ben's accident. Emma and her son Theo move to a tiny village and Sophie quite quickly strikes up a friendship with her, despite the other village residents being rather wary of Emma. On top of that, the quiet village is rocked by a murder and slowly but surely, things are revealed that will make you never trust another living soul again.After having enjoyed I Am Watching You, I was very much looking forward to this new offering by Teresa Driscoll and I was not disappointed. There were a few things I didn't see coming and while I don't normally mention the ending, I must just say that this one blew me away. I didn't particularly like any of the characters although I did sympathise with Sophie throughout the story for various reasons. Not least of all, obviously being miles away and stuck on a train when you don't have the faintest idea what's happening to your child.I thoroughly enjoyed The Friend. It held my attention from start to finish, even if it was maybe a tad slow in some places. A compelling tale that just goes to show you never really know someone and though sometimes the things you learn about other people can be mightily surprising, the one person who may just surprise you the most is yourself."}, {"Review": "I adore this author and have loved everything by her. And this book - wow! From the first electrifying, attention grabbing page I was hooked. I could not part with this story. I read it in one sitting, the characters taking root in my head and demanding my full attention. And even now, days later, they haven't let go. I am still thinking of their motivations, the events that led them to do what they did. The writing is exquisite, there are so many wow moments. This author goes from strength to strength in her writing and I absolutely cannot wait for more from her. Although only February this book I am sure will feature at the top of my favourite reads of 2018! "}, {"Review": "When Emma and her son Theo moved to Tedbury Cross, Sophie welcomed her as they quickly became friends. As Sophie and her husband Mark had a son Ben who wasn’t much older than Theo, Sophie and Emma became fast friends as did Ben and Theo. But as much as Sophie liked Emma, people in the town, including Mark didn’t like Emma, warned her about Emma and soon there were whispers and rumours about Emma. Why did Emma move here? How could Emma afford the beautiful house she had? Why did Emma avoid talk of her past and the recent death of her mother?Emma appeared at the right time. After a long time of depression after the birth of Ben, Sophie still hadn’t returned to work and was longing for a second child. Emma filled that gap she had in her life. But maybe the arrival of Emma wasn’t the gift she thought it was. This novel goes back and forth from past to present as little by little the story is revealed. Very cleverly written, I was drawn to the story in each chapter, given hints and cliffhangers that made me need to know more and need to find the answers. The reader gets just about there, and then we are flung back to the past or present making us intrigued to get the answers to the unknown. There are a few delicious twists that I fully appreciated. This novel kept me fully engaged and anxious to know it all and what it all meant. I highly recommend this psychological thriller."}, {"Review": "I really enjoyed Driscoll’s first novel I Am Watching You, but was disappointed by this one.  \"But at the time there was no clue to the future – the consequences.\" Emma and her young son Theo are new to a small UK village and Emma is super suspicious as a death rocks the village. She is the title “Friend” to Sophie, a dissatisfied housewife who lives in the village with her son Ben and husband. The whole novel focuses on who really is Emma? What happened in her past to make her so shady? Why did she come to this particular village? And how did it get to the point of both boys, Theo and Ben, ending up in the hospital (while Sophie desperately tries to get home on the train)?The story is told mostly in flashbacks, but the format felt too disjointed, and the same questions and information seemed to be repeated often. I just wanted to get to it already! The reader keeps reading, hoping to piece together what happened, but as the novel went on I just found myself not caring at all. The suspense wasn’t there for me. The ‘twist’ at the end was extremely predictable and pretty disappointing in its cliche. The epilogue was just an info dump and a good example of ‘telling not showing’. I did like seeing more of the reoccurring characters of DI Sparks and private detective Matthew, from Driscoll’s first novel, though they only play a background role and sometimes felt randomly placed.Overall, this book felt like 5 different stories trying to be wrapped up into one neat package. It didn’t work for me, but perhaps others will find an intriguing story here. I will still check out Driscoll’s next novel, but I hope I enjoy it more than The Friend."}, {"Review": "I purchased this book after reading I am watching you, some months earlier, i'm guessing this book followed as it had a few of the previous characters. I have to say that I was disappointed from the off. After 2 chapters it was evident what the plot line would be, mainly because the book jumped from present to past, present kind of giving the story away. Yes there were a few mediocre surprises along the way but nothing exciting and I found the characters very dull indeed. I kept reading as I thought the story might pick up the pace somewhere but no, and Although only a short book it took me a whole 4 weeks to read and I had to push myself to do that!"}, {"Review": "I was completely hooked from beginning to end in this fantastic psychological thriller. Full of suspense, I can honestly say I had no idea at all which way the plot would go until the twist was laid out before me. It was definitely one of those 'Noooooo' moments as I finally realised what was going on!Sophie is on a train back from London, desperate to get to the hospital where she has been informed her son and his friend are both in critical condition after an accident. She left Ben in the care of Emma, the woman she befriended after her arrival in their village with her young son. She thought Emma was her friend, but as Sophie starts to recount the story of their meeting and the subsequent events that have led her to this point, we learn that Emma really isn't all that she appeared to be.It's a very cleverly woven plot, and having the story revealed while Sophie was stuck on the frenzied train journey back, unable to reach her child, just added to the tension. The characters had depth, and I really enjoyed the conclusion to the story as there were no annoying loose ends. A highly recommended read!*I received a copy of the book from the publisher via NetGalley in exchange for an honest review."}, {"Review": "3.4/5Full review at https://smileaturself.wordpress.com/2...Things that worked out for me :> There is a learning from the book, not about friendship, but I now know there is something called Selective Mutism which can cover up child. I love it when I take away such things from a novel. (extra star just for this)> Friendship between Sophie and Helen. It was pure, and what I think everyone should have. It warmed my heart.> Stating past and present together can lead to a lot of confusion to some people. But for me, it was also a reason to get a thrill. Because I knew there is something bad to happen in the future(when reading past)Things that didn’t worked for me :> The story felt stretched a lot. There were twist that started from 70th page or so, and it got it’s ending in the last 20 pages. Well by then, we all have kinda guessed it. So it was a let down for me.> Due to past-present the dialogue got mixed. Like it was Emma who was talking, and due to pre-text I thought it’s still Sophie talking/thinking.> There were screens/characters which weren’t actually required, like Emma visits Sophie in Lizard, Melanie & Tom’s love angel.> The Epilogue, this is the first book whose epilogue has the content we are looking for in the whole book. It was the length of a whole chapter, more than what conclusions should read like"}, {"Review": "To read the full review click on the link belowhttps://storyofabooknerd.blogspot.com...'The Friend' by Teresa Driscoll is an intriguing psychological thriller with the amalgamation of thrill, suspense, drama and mystery which keeps you at the edge of your seat until you find out the climax.The story moves to and fro, from present day to past through a series of flashbacks. In the beginning of the story, the chapters were a little slow paced and boring as I was unable to understand what is actually happening. But the more the story progressed, the more it became captivating as, one by one all the secrets came out in open. The writing style of the author was brilliant and very engaging. She has been successful in creating and keeping the suspense till the end and has added all the right amount of twists and turns in between. Never did I for a single moment could predict that what is going to happen in the next chapter. The ending was a surprise and was not something I expected will happen. All in all, 'The Friend' was an intense, petrifying and a spine-chilling story which all the thriller lovers, especially all those who are fond of psychological thrillers will enjoy reading."}, {"Review": "This is my second by this author and both have been superb stories. Definitely a favourite of mine and I'm happy to see she has another coming out in February as well. You just knew the friend was going to turn out to be anything but in this one, it's just wondering how much damage she was going to wreak upon those she encountered along the way.....I did like young Theo, along with that tale of his little robin rescue. That was sweet. Helen was another lovely character. It was clever how most of the story was based around the train journey home to find out what had happened to the boys and which boy was hurt and how badly.....I did spot the odd mistake though nothing repetitive or the whole way through, thankfully. She wrote, \"I didn't use to be this bonkers\" as opposed to used, writing it just as people say it, Dr Marten's are spelt like this and Play-Doh like this and I'd have put a hyphen in split-loyalty. I saw just the one apostrophe mistake when gents' didn't have one and that was it, which is really good going, too."}, {"Review": "fast paced, psychological thriller. I enjoyed the book a lot.Thrillers are my favorite genres, I love to guess what happened, I love the ones which surprise me more. Though I did suspect that Emma was upto to something, couldn't guess what exactly it was. There are books which make you want to guess what happened and books which makes you live in the moment. This book belonged to the latter category. I did feel bad for Theo, he deserved more love. I loved the characters and how the suspense gets built slowly, and how everything you expect to happen doesn't happen. I'm definitely going to read \"I am watching you\" as I loved this book"}, {"Review": "I came across The Friend accidentally on Audible and it sounded too good to miss – a child in danger, a friend who is not who she seems, secrets, lies, a race against time. Just what the doctor ordered for my daily commute, I thought!Driscoll’s writing drew me in rapidly and I really enjoyed the dual time format of the novel. Here we have Sophie, a young mother on a train who gets a phone call that her four-year old son Ben has been hurt in an accident and is being rushed to hospital as they speak. Straight away the alarm bells ring: What has happened and why is her son not with her? He is with a friend, we learn, a friend who had been trusted to take care of him, but who Sophie now doesn’t want anywhere near her child. Why? WHY? Dricoll knows how to build tension, and she had me on tenterhooks as I was listening, eager to find out more. It’s the second timeline which slowly explores the past to give us all the answers and outline the events leading up to Sophie’s current predicament, and a chilling tale it is!For the first ¾ of the novel I was totally hooked, enjoying Driscoll’s portrayals of her characters and the underlying air of danger and menace that is ever present in the friendship between Sophie and newcomer Emma. I also liked the characters of Melanie and Matthew, who I found out had made an appearance in an earlier novel by the author (and which I must read). A few unexpected plot twists spiced up the story, and there is even a murder to enhance the sense of danger in the village. Up to almost the very end I loved the story and couldn’t get enough of it. However, I felt that the ending was a huge let-down for me. Not only did it all end rather abruptly, but a lot of the loose threads are explained in a lengthy epilogue that is telling rather than showing and appeared rather dry to me, even though I appreciated the efforts the author made to answer all outstanding questions. There were also some huge plot-holes for me in regards to the final twist, which from a nurse’s point of view seemed farfetched, spoiling the previously well-constructed and believable narrative at the 11th hour. I felt frustrated and cheated at this turn of events, which most likely won’t bother a vast majority of readers, so unless you are a health-professional you should be safe in reading it and enjoying the final big reveal. Whilst I felt like flinging the book (i.e. my phone, as I was listening to the audio version) out of the car window, uttering a guttural cry and rolling my eyes so far into my head that I was probably a traffic hazard!In summary, The Friend is a chilling story of a friendship gone wrong, with a few unexpected twists along the way. It can be safely read by most, except for health-professionals who find it difficult to suspend disbelief for the sake of entertainment (hold on to your phones, people!). Having really enjoyed Driscoll’s writing style and the characters of Melanie and Matthew, I will undoubtedly look up her previous novel to go back to their beginnings. *blog*  *facebook*  *instagram* "}], "Genre": "Crime", "ID": "35906836", "Desc": ""}