{"Name": "Baby Daddy Mystery", "Image": "https://images.gr-assets.com/books/1544131760l/41434350.jpg", "Reviews": [{"Review": "Baby Daddy Mystery: Shady Hoosier Detective Agency (Book 2)(Shady Hoosier Detective Agency #2) by Daisy Pettles is hilarious! (Come on, even her writer's name is clever!)This is book two in the series and is just as funny as book one. This one starts out chasing down who is the real baby daddy, then a murderer, a blackmailer, and then even more! It is non-stop craziness with the zany and colorful characters, plot, and hilarious situations the two aged women get into investigating crimes or getting clues. It has plenty of humor, wit, and action to keep me going through the book and before I know it I am finished!😢 Now I have to wait for the next book! Ugh!"}, {"Review": "I was lucky enough to read a pre-release copy of this 2nd Shady Hoosier book - Baby Daddy Mystery.Our favorite senior sleuths, RJ and Veenie, are drafted back into action by the local town bank owner, Avonelle Apple. Seems Avonelle’s late husband might have been fooling around and left a few offspring that fell a little further away from the Apple tree, and Avonelle has gotten a letter requesting child support payments! Right around the same time, RJ’s daughter Joyce is in emoji hysteria ‘cos she thinks her hubby is having an affair. Then, of course, there’s good old Harry Shades who is hankying just about everyone’s panky. If that’s not enough, one of Avonelle’s twin sons (both dentists, like their dad – that’s the tooth, the whole tooth and nothing but the tooth!) is found dressed up as a scarecrow and dead as a doornail. Veenie and RJ will unpuzzle these puzzles, and keep you laughing as they do it. These gal pals are the brightest sunshine in Pawpaw county, for sure."}, {"Review": "Down in the back hill country of Pawpaw County, Indiana, it's spring and apparently everyone has had enough of the cold weather and can't wait to get out and do some of that birds and bees thing. Ruby Jane Waskom, better known as RJ, and Lavinia Goens, (Veenie), are busy again chasing down low-down, cheating sidewinders and deadbeat daddies at the Shady Hoosier Detective Agency when Avonelle Apple asks the pair to find out if, indeed, she has progidy heretofore unannounced. The owner of the agency with whom they work has skedaddled out of town before the husband of the sweet thing he's been playing with can catch him, so the pair are temporarily on their own.If that's not enough, RJ's daughter suspicions her insurance hubby is getting in some jolly's on the side, and their broader is throwing some sassy twists to the well-plotted, multi-leveled mystery. I must admit I have never run across SOOO many euphemisms for male equipment, or ribald comments poked at so much sexual innuendo. Okay, better this, I guess, than some of the more common language these days--cleaner--but no less surprising, much less in a cozy aimed at senior women meant to evoke humor.There was a plot device you would probably recognize, the use of many landmark names you might also recognize. No problem with the book functioning as a standalone, these gals are more than well-fleshed. I loved the l960 Impala; those land yachts were definitely unique. The dialogue appears to have brought out a number of LOL's in previous readers and no doubt this would tickle a great many readers into appreciating an unusual cozy offering. But I was NOT prepared for the dialogue or the snarky sexual turn of phrase in this \"senior sleuth\" cozy mystery. This is Book 2 of the Shady Hoosier Detective Agency series and judging by the reviews published before me, very well received. I received the ebook download from the publisher and NetGalley and greatly appreciated the opportunity to read and review. 3.5/5 starsSee my full review at https://rosepointpublishing.com/2019/..."}, {"Review": "Loved it! This one was just as funny, if not more, than the first one! Don't read if you are afraid of folks looking at you for laughing out loud or snorting with some of the antics in the book. You have been warned!Spring has sprung in Pawpaw County and it seems most everyone has an itch that needs to be scratched. RJ and Veenie are once again on the case of finding out if someone is truly the baby daddy when their next case lands on the porch, literally! They have to find out what the heck is going on with all the craziness in the county and hope they don't end up below ground before summer.I was given an eARC by the publisher through NetGalley. "}, {"Review": "Another Laugh Your Sox Off cozy mystery from Pawpaw County, Indiana. It seems like almost every male in the area is a philandering fool, and we won't even get into a discussion about the women. But it seems that only the males are the ones getting dead which makes a lot of work and laughter for our favorite senior sleuthing team of Ruby Jane and Veenie. No spoilers needed, and the characters certainly are which you can tell from the publisher's blurb. If you need some howling good laughs in a mystery with a plot, this is the place!  I requested and received a free ebook copy from Hot Pants Press via NetGalley. Thank you! "}], "Genre": "Crime", "ID": "41434350", "Desc": ""}