{"Name": "The Silent Patient", "Image": "https://images.gr-assets.com/books/1530043978l/40097951.jpg", "Reviews": [{"Review": "My thanks to Ben Willis at Orion Publishing Group for sending me a paperback copy of ‘The Silent Patient’ I have given an honest unbiased review in exchange*Alicia Berenson was discovered standing over her husband - he’d been tied to a chair and shot in the face five times. Alicia gives no explanation and refuses to speak. She’s admitted to a psychiatric unit, ‘The Grove’ in North London, and six years later she still hasn’t spoken - not one single word!Theo Faber is a criminal psychotherapist who has always been obsessed with Alicia’s story, and when a position presents itself at The Grove for someone with his qualifications, he applies for the job and is successful. Theo is certain that he can get her to talk, even though others have tried and failed. Although Alicia is silent, the narrative speaks to us in a way that she can’t or won’t, throwing the spotlight on the minutiae of her life as a talented artist, and ultimately what led to the events of that fateful night. Theo’s own personal life is laid bare too, and he’s also a very complex character - indeed not unlike Alicia. If Theo’s attempts to encourage Alicia to speak are successful, will it be something he wants to hear? Because beneath Alicia’s silent exterior, she has plenty to say!Clever, and compelling, with a humdinger of a twist- I hope the ‘Silent’ Patient ‘speaks’ to you too!"}, {"Review": "\nWow, I'm still reeling from that ending! A mindblowing, to-die for twist!\nA fast read that kept me intrigued from beginning to end, although the shocker came at the end. Wait......wait......what just happened? This was how I felt as a read the last few chapters!Alicia Berenson is such a mysterious, intriguing character and I was trying to figure her out the entire novel.  I kept asking myself, \"What is up with Alicia?\"She is a famous, talented painter and happily married to her husband, Gabriel. They live in London and have a cozy life.Why would Alicia murder him and then never speak again? You want to know, right? Well, I did and couldn't stop reading until I found out. It is the feeling you have when you \njust have to know why!!\nThe novel is narrated by Alicia's psychotherapist Theo Faber,  He is determined to \"\nfix Alicia\n\".  I was so invested in learning what the circumstances of Alicia's silence was and had to find out if Theo could save her.  Would she ever speak again?  READ IT NOW to find out!I wasn't going to read this one, and then requested it on NG and I'm really glad I did.  As you can tell, I really enjoyed it! Sure to be a 2019 FAVORITE !Thanks to Celadon/ NG for my arc. Book is out in Feb 2019 Review posted to blog."}, {"Review": "I feel like I should preface my review by stating that I have read A LOT of psychological thrillers, and coupling that with the fact that this was my most anticipated read of 2019 gave The Silent Patient a great deal of pressure. This will still be an overall positive review, but I felt I had to include some honest thoughts here as well for those readers who may need their expectations in line like I clearly did. The premise here is simply incredible; we have a woman named Alicia Berenson who is accused of murdering her husband and proceeds to clam up and keep quiet for the following six years, living during this time in a mental care facility called The Grove for highly dangerous folks. Enter Theo Faber, psychotherapist extraordinaire and flawed individual. He already has a respectable job elsewhere, but decides to transfer over to The Grove, even though it is a sinking ship, because he is obsessed with Alicia and solving the mystery behind why she murdered her husband. Along the way, we get snippets into Alicia's diary leading up to the murder, alongside of Theo's POV. I can't really give you anything more than this, because this is a novel that depends on you being fooled by the twist. You know, the big twist, the one where every blurb on the cover and every early review gives you a heads up, and perhaps that was part of the issue here for me. It seems these types of books that pull the wool over your eyes and take you by surprise are best enjoyed before anyone else has had a chance to read them. Let's come back around to the fact that I've been reading mysteries, thrillers, and suspense novels for decades, way before Gone Girl was written and these domestic dramas with tricky slight-of-hand became all the rage. If you are new-ish to the psych thriller scene, and you whole heartedly enjoyed recent novels such as The Woman In The Window, you will adore this. It was a well written, compulsive, slow burning build up to an explosive ending. Structurally, it had everything you could ask for, as it was well researched, engaging, and the perfect length of \"includes what we need without being overly winded\". Unfortunately, I've seen this particular twist done numerous times, so I was clued in fairly early to what the big twist would be, and without spoiling or giving anything away, the lay out of the narrative in the second half of the novel is what fully clued me in, because it was too neat and tidy to end any other way. I will say that I was so satisfied and pleased with the way the author chose to close out the final chapter, and regardless of being surprised by the twist or not, it was a classic wrap up that will stand the test of time over the years. I think I'm going to wrap it up here, and please don't let my 3 star rating dissuade you from giving this one a try. Michaelides is talented, and his writing is gripping and keeps you turning the pages regardless of the big twist. I would be honored to read his next novel and will most certainly look for his name in the future. In the meantime I have found so much in this novel worth discussing, from the portrayal of mental health care to the inner workings of various marriages, and think this will make a great winter book club choice for readers around the globe. *Many thanks to the publisher for providing my review copy via NetGalley."}, {"Review": "Teetering between a 4 and a 4.5Alicia Berenson is a famous painter who has been admitted to the Grove, a forensic unit in North London. She has been charged with murdering her husband, Graham, who is a fashion photographer, after he returns home late one evening. After shooting Graham, Alicia has never spoken again.Theo Faber is a criminal psychotherapist who accepted a job at the Grove in the hopes of working with Alicia. He is obsessed with learning her motive. He knows he can get her to talk. Others have tried - others have failed. Will he be successful?Although Alicia does not speak, the reader gets a glimpse into her life through Theo's discussions with those in her life. Well, more to the point, we get their impressions of her, things they know about her and their own assumptions about her. They seem to have no problem sharing what they know about her but why hasn't anyone been to visit her? The reader gets to learn even more about Alicia through her diary entries. Finally, Alicia \"speaks\" via the written word. But what could have led her to shoot her husband? Will she ever speak? Why isn't she speaking now? Is it by choice? Is it due to trauma? hmmmm Theo is also an interesting character. Most of the novel is told through him. The reader also gets a glimpse into his life, his thoughts and the inner workings of his mind. I was curious as to why he was so obsessed with learning her motive. Why is he so driven to learn the truth? Is he a fan or her artwork? Will learning the truth advance his career? This is a very clever tale which grabbed my attention right away. I was intrigued to learn what was going on. I had several theories and assumptions. Some were close and some were way off base - as in a mile off base. Of course, there is that shocking reveal - I did not see that coming - AT ALL. It really was the perfect \"OMG, what did I just read?\" moment followed by an \"Aha!\" moment. This book was a page turner for me. I kept turning the pages to learn how the book was going to unfold. The ending felt a little bit rushed and I wanted to just a tad bit more. Overall, a very enjoyable read even thought one character really annoyed me. Thank you to Celadon Books and NetGalley who provided me with a copy of this book in exchange for an honest review. The thoughts and opinions expressed in this review are my own."}, {"Review": "Dear Alex Michaelides,Brav-the-fuck-o dude 👏👏👏\"Her silence was like a mirror - reflecting yourself back at you.And it was often an ugly sight.\"And that, my friends, sums up this book perfectly.Dark psychological suspense is my favorite genre and books like this one are exactly the reason why. This book is the very definition of a page-turner. From the very first page I was seduced by the magnetic writing style of Alex Michaelides.Nothing is as it seems in this novel. This story is complex and multi-layered with a labyrinth of characters, each playing their part in the development of the plot.The author never once tries to lead you astray with erroneous clues in an attempt to distract you from an obvious conclusion. I never once felt like I had a grasp on how this story was going to play out, which kept me rapt until the last page.The blurb on the back cover says that the book has already been optioned for a movie and I'd like to put forth my recommendations for casting:Haley Bennett as AliciaandOliver Jackson Cohen as Theo (I expect a casting credit)I received an ARC copy of this book from the publisher. All opinions are my own."}, {"Review": "Whoa! This was brilliant! This book right here is the reason that I love psychological thrillers. This has become an overly saturated genre with every one taking a stab at writing these twisty little mind fucks but more often than not they fall flat. It takes a talented mind and writer to pull off a really shocking twist successfully. Alex Michaelides has done just that because I did not see that coming at all and for that I thank you! *claps hands* Alicia Berenson appears to have it all. She's a successful painter and her husband, Gabriel, is a famous fashion photographer. What would drive this seemingly happy woman to shoot her husband five times in the face only to never speak again? Psychotherapist, Theo Faber, is desperate to work with Alicia to see if he can breakthrough her silence to finally find out the truth. That's it. That's all you get. I don't want anyone to be spoiled. I suggest not reading too many reviews as it is inevitable that some jerk will spill the beans. Don't be that jerk! If this is any inclination as to the type of reading year 2019 is going to be then HURRAH! Dare I say that this has made it to my \"favorites\" shelf. Highest recommendation! All the twisted stars! Thank you to Celadon Books and Alex Michaelides for kindly sending me an ARC in exchange for my honest review."}, {"Review": "Well looks like I’m the outlier on this book as I have been reading many glowing 5 star reviews. Maybe I’ve been reading too many thrillers lately. For me to love a thriller all of the characters have to be well developed and intricate to the story, the plot has to be a good one and have more to offer than just the “thrill”, or wow factor at the end of the book. I found the characters to be shallow and the plot seemed to run off in several directions throughout the course of the novel. I should add that a 3* from me means that the book was just an o.k. read for me, not bad but not great enough that I will be thinking of it long after I’ve finished or be recommending it to my friends. Still worth a read :)One thing proved true, this book did have me turning the pages quickly to find out what would happen at the end. However while I was turning these pages quickly, I wasn’t really getting very much out of the story. I felt as though the fact that she wouldn’t speak was the main focus of the book rather than looking into whether she was really guilty or not. I know that she had been tried and found guilty but I had hoped that perhaps the doctors would find other issues worth pursuing regarding her guilt or innocence.There are multiple characters introduced but none of them are really very well described. Dr. Diomedes is the head of the facility and he appoints a new doctor, Theo Faber, who has recently joined the staff to oversee Alicia’s care. She had previously been under the care of another physician but he hadn’t made any progress with her and so it is hoped that this new doctor will help to make her finally speak.The book is narrated by Theo and then later by Alicia as we begin to read her previously hidden diary. The book takes place in “The Grove” a private facility for psychiatric patients. Theo Faber transferred from another facility because he is obsessed with Alicia’s case. We do get to know him through his thoughts about his own marriage to Karen who seems increasingly “busy” and coming home late from rehearsals, she is an actress. This is a storyline that is introduced and somewhat developed and then just left hanging. What really is going on with Theo’s marriage? He seems to be spending all of his time at the facility with Alicia. Alicia had been a successful artist and Gabriel a photographer of some repute. There really is never any answer to the question of “why”, why would Alicia kill Gabriel. There doesn’t seem to be any evidence that they were unhappy or that Gabriel was unfaithful, there doesn’t seem to have been much research as to why she would kill her husband. She was convicted because she was found at the scene with the gun in her hand, covered in blood because she had slit her wrists in an attempt to kill herself. The twist is a good one but doesn’t come until the last 20 pages or so. I had pretty much figured it out by then but I’m sure it will come as a surprise to many. I would say read it without reading lots of reviews, decide for yourself if it is indeed “the debut novel of the year for 2019” as the publisher has written in the blurb for the book! After the last session that Theo had with Alicia he is writing everything down while it was still fresh in his mind and he states \"As you will see, it's an incredible story--of that there is no doubt. Whether you believe it or not is up to you.\"I received a copy of this book from the publisher through NetGalley."}, {"Review": "Promising to be the debut novel of the season, I decided to make this my first read of 2019! I am glad I did not wait any longer...Alicia Berenson was a famous painter, married to an in-demand fashion photographer, living what appears to be a life that others would envy...till she kills her husband by shooting him in the face, five times, and never speaks another word. Her only assertion about what happened is her self portrait, Alcestis, named after the tragic heroine of the Greek tragedy by Euripides. Her painting is of her naked body, fresh scars on her wrist, a blank expression on her face and a paintbrush in her hands, dripping red paint...or is it blood? Determined to get her to talk is Theo Fabre, a criminal psychotherapist. He begins a quest for the truth, not unlike what a detective might do, but is he the right Doctor for this patient?Excerpt: Alicia was standing by the wall, being restrained by Yuri and another nurse. But no physical restraint was necessary. She was totally calm, perfectly still, like a statue. her expression reminded me sharply of the painting-the Alcestis. Blank. Expressionless. Empty. She stared straight at me. For the first time, I felt afraid.Told from Theo’s perspective and through Alicia’s diary entries, I still did not know where this book was going with only 10% left to read. It was probably just a 4 star read for me at this point.And, then the ENDING.I did NOT see it coming. And, I was NOT disappointed. I have no hesitation in recommending this to readers who love a good psychological thriller. Pre-Order NOW! This book will be released on Feb. 5, 2019. I would like to thank Netgalley, Celadon books, and Alex Michaelides for the ARC I received in exchange for a candid review! Posted to Goodreads now, and Amazon on publication date."}, {"Review": "Having seen a lot of good reviews about this book I was in 2 minds whether to read it. sometimes the books that have the most hype are not always the best books and can be quite a disappointment.I was held captive and read it in 1 sitting. Alicia is standing covered in blood next to her dead husband Gabriel, who has been shot in the face several times. The obvious scenario is that she shot him?Alicia was taken to a psychiatric facility called The Grove, where she has not spoken for 6 years. Will the truth ever be revealed and will She ever speak again!!A new Psychiatrist Theo arrives at The Grove determined that he can help Alicia and win her trust, so that she will speak again. He investigates her past and becomes obsessed with finding out the truth. This story takes us on a journey with an abundance of twists and turns that left me speechless at the end. I really did not expect that outcome and had to re-read it as I still can’t believe what just happened. I needed a lie down in a dark room to recover!!! A must read book that deserves more than 5 stars. Please believe the hype as this is going to be a massive hit. Clear you’re diary first as you won’t want to put this down!!Thank you to Netgalley for my copy in exchange for a review."}, {"Review": "Do you play chess? I don’t, more of a tic-tac-toe aficionado TBH. But I’ve always admired the ability to think 10 moves ahead when faced with a worthy opponent. Here we have 2 well matched MC’s, each with a plan & motive that may end up being their downfall.Alicia Berenson used to be one half of a glamorous couple. She was a beautiful, successful artist deeply in love with her husband Gabriel. Which of course begs the question…why did she shoot him in the face 5X? You’ll have to come to your own conclusions because Alicia’s not talking. At all.Not to the police & not to her lawyer during a well publicized trial. Her cool, silent demeanor earned her a verdict of diminished capacity plus a spot at The Grove, a secure psychiatric facility in London. Several years on nothing much has changed. Despite the best efforts of medical staff, Alicia remains mute. But one man believes he can get her to tell her story & he’s about to get his chance.Dr. Theo Faber followed the trial with interest. As a criminal psychotherapist, he became fascinated with the beautiful woman who wouldn’t speak. So when a job comes up at the Grove, Theo jumps at the opportunity to treat its most famous resident. Pull up a chair, dust off the chess board & let the games begin.There are many secondary characters that add depth to the story. Some pop up briefly, several have recurring roles & others lurk in the background. Each brings something to the table, even in their absence. But make no mistake…this is the Alicia & Theo Show.Alicia is an enigma from the start. In the present, she is a shadow of her previous self. But through her thoughts & memories, we begin to put flesh on her bones as we learn about her childhood & subsequent relationship with Gabriel. Friends & colleagues chime in with their observations & put a slightly different slant on her perfect life. Whatever your impression of her, one thing is clear…her voice may be lost but there is absolutely nothing wrong with her mind. It’s up to Theo to carry the conversation during their regular sessions. And initially he’s more than up for the task. It’s not just about the satisfaction of helping a damaged soul. He’s well aware his colleagues have tried & failed to reach Alicia. If he can get her to speak, it would mean validation of his abilities & a huge feather in his cap. As time goes by, we watch as he becomes obsessed with cracking his famous patient & desperation leads to questionable judgement on his part. You begin to wonder if its a quest for professional glory or a classic case of hubris. From the opening pages I knew that even if this was a poorly written hot mess (it’s not), I would read to the final page because I had to understand why Gabriel was snuffed in such convincing fashion. It’s one of those books where it’s best to go in blind. Although this is a first novel, the author has written screen plays & it definitely shows in the expert pacing & story telling. I can easily imagine this as a film. I had my suspicions about Gabriel’s death but the motive is only revealed near the end. And what an end it is. There’s something really satisfying about a character getting what they so karmically deserve. If you’re a fan of psychological suspense, don’t hesitate to add this to your groaning TBR pile."}, {"Review": "Astonishing, unputdownable and spellbinding stuff here!Loved....loved....loved! This book is exactly what I needed…...a fast-paced and fully absorbing thriller that I literally could not put down or stop thinking about. This was some fantastic storytelling!THE SILENT PATIENT by ALEX MICHAELIDES is a dazzling, fascinating, compelling, and an absolutely fabulous psychological thriller novel that was quite the immersive and thrilling book to read. Right from the very beginning I knew that this book was going to be a gripping page-turner for me and I’m happy to say that it totally held my attention right to the very end, making this quite the compulsive and all-consuming read. ALEX MICHAELIDES delivers an impressive, clever, suspenseful, entertaining and well-written read here with an intriguing and refreshing premise, an intoxicating mystery and irresistible compelling characters. I thought this was an extremely well-crafted thriller where the author seductively guides you to the shocking and twisty conclusion. This book definitely appealed to this psychological thriller lover even though I wouldn’t necessarily say there is anything new here and you might have your suspicions early on like I did but it was all in the execution here that made this quite the fantastic and exhilarating read. I thought it was so cleverly and originally done. If an author can still make that ending shocking and thrilling to read even if you think you’ve figured out the outcome well then I’d say that is one heck of an accomplishment and perfect read! This was an absolutely fabulous psychological thriller that quickly made it into my favourite reads shelf making this my very first favourite of 2019!Expected Publication Date: February 5, 2019Norma’s Stats:Cover: Intriguing, unsettling, creepy, eye-catching and an extremely fitting representation to storyline that kind of gives me the heebie-jeebies to look at. Title: The title of this book is an extremely fitting representation to storyline that definitely piqued my interest, totally intrigued and fascinated me. Writing/Prose: Well-written, entertaining, compelling, engaging and convincing. I thoroughly enjoyed the writing style and it definitely spoke to me. Plot: Engrossing, refreshing, suspenseful, interesting, complex, fast-paced, and highly entertaining. Ending: A surprising and twist ending that definitely should shock and wow the reader regardless if you’ve figured it out or not. The ending was totally satisfying and did not disappoint!! Overall: A fantastic and riveting read that had me totally absorbed within this story right from the very start, thoroughly enjoying every minute of this debut thriller! Would recommend!Thank you so much to NetGalley, Celadon Books and Alex Michaelides for the opportunity to read an advanced copy of this book in exchange for a review!"}, {"Review": "Greatest thanks to Celadon Books and author Alix Michaelides for the incredible chance to read and review this book.If you are skeptical about my review, because I love so many books as well as authors, let me clarify. This is without doubt the best book I have read this far. I cannot say more than it is without doubt the most fascinating reads. It will be released in February 2019 and is a MUST READ.Let me begin. The author has not only presented a work so intricate and absorbing, it fits a genre all its own. It is part psychological thriller, part crime and so real as to captivate the reader. Theo Faber is a psychoanalyst who has had a troubled past. His father was a cruel and butter man. Perhaps after years of therapy with his own therapist, he has become a well adjusted, caring health professional. His interest lies in a particular patient whom he is convinced he can treat. He is happily married, gentle and knows he can perform treatment on a woman, who refuses to speak after murdering her husband.He changes jobs from Broadmoor Hospital to Grove. An aside, psychology is a mine of transference, countertransference, borderline personality and many other illnesses which you may investigate in the DSM, or Diagnostic Statistical Manuel for psychiatric disorders. I recommend this, in light of the story. The Greek tragedy Alcestis is also predominantly used. It involves a man condemned to death with a reprieve only in the event he can find a willing person to die for him. Of course his wife will die for him. He agreed and she is executed in his stead. She descends into Hades, but is brought back to the living, yet never speaks again.Theo intends to aide his patient and allow her to speak thus helping her to confront her demons. Although he is discouraged by other staff and the fact that his position is tenuous at best, he perseveres.The twists that follow are unimaginable. The story is consistent throughout. It leaves the reader entranced. This book will not go the way of some books but will remain a major accomplishment. I felt cold and hot in turn as I attempted to determine what would happen next. Sick and sorry In turns, the characters are wonderful in their fashion. Some likeable, some detestable. Don't judge too soon. We will see much more of this author, as he hasn't finished with us! A thorough and unforgettable masterpiece!"}, {"Review": "You can check out all of my reviews.https://readalongwithsue.blogspot.com/Although I’ve read and experienced these type of twists before in other books I have to say that this authors premise was excellent.I loved that it was based in an Asylum. Around disturbed mental health patients.Alicia is an artist, a painter. Gabriel her husband. When Alicia is found by her husbands body all clues point towards her as the killer. But Alicia is silent.She neither speaks, or defends herself.Did the shock or terror make her loose her speech, has she frozen? Or doesn’t she want to speak?What lays behind the mystery of Alicia?The Grove where she remains in care has not been able to break through. Can Theo the new Carer break through and get her to talk?There are twists within twists in this subject matter that I did tie in and guess, but I couldn’t think why until it was revealed then a light bulb went on in my head OF COURSE! Reading this carefully, slowly and devouring it without haste to pass onto my next book I found that I chewed over the workings of the authors mind in this. I wondered why the person who was caring for Alicia was acting like a detective! Of course it all makes sense in the end. As with books like this so carefully woven must be carefully read and never rushed. You need to sit, chew and enjoy the tasty bits.For those that read psychological thrillers it will appeal to you. It may not be new in its stinging tail of twists but it’s cleverly done and for that I appreciate my enjoyment of it."}, {"Review": "This book is absolutely captivating, suspenseful, and intriguing. I devoured it quickly!The novel follows Theo Faber, a psychotherapist who started working at a medical facility where an artist named Alice Berenson is confined. Alice became a notorious figure after murdering her husband. Her fame is surrounded by increased public interest due to her silence. Alice, is not any murderer, she simply stopped talking after the crime.Theo is eager to work with her and get her talking. He wants to understand what happened that night, what made Alicia murder her husband. We also follow his personal life with his wife, which is the part I found even more interesting.I loved the voice of the narrator, the novel takes place in London and the story is compelling and absolutely engaging. I loved it and highly recommend it.Received ARC from the publisher via Netgalley"}, {"Review": "Blog | Facebook | Twitter | Instagram | Pinterest \nA book that speaks about feelings, and lack of them. Love and emotions. Art and passion. Psychology and memories. And how our childhood might define who we will become.\nI have never felt such urgency to read another chapter as I have felt it with The Silent Patient. Such impatience, such excitement. It’s a feeling I wish I can get with all the books in my life.ALICIAAlicia Berenson writes a diary as a release, an outlet – and to prove to her beloved husband that everything is fine. She can’t bear the thought of worrying Gabriel, or causing him pain.Until, late one evening, Alicia shoots Gabriel five times and then never speaks another word.THEOForensic psychotherapist Theo Faber is convinced he can successfully treat Alicia, where all others have failed. Obsessed with investigating her crime, his discoveries suggest Alicia’s silence goes far deeper than he first thought.And if she speaks, would he want to hear the truth?I love these types of books. Besides the mystery and thriller, the psychological part was an incredibly well-put together piece of art.The beginning of the story is nice and slow, but with a temptation in it, that makes you flip the pages so fast. A great world and character building, and great character hopping from Theo to Alicia, from chapter to chapter.Even though we don’t get to have Alicia talking in the book, she says so much. All her movements, all her reactions, or lack of reaction is so well written. Her lack of speaking doesn’t stop her from moving the story forward, and being the main protagonist here.On the other hand, we have Theo, who we see and get to know more and more with each chapter. A complicated character, with a cute oddness to himself, a characteristic I find with many psychotherapists. He is the person we see at the front of the screen, presenting himself in the spotlight, together with Alicia.\nA well-written plot, with an amazing cliff-hanger and a wonderful plot-twist in the end. I didn’t expect it, and I am awfully satisfied of how the authors decides to conclude the book.\nI enjoyed this book so much, and I recommend it to all the psychological thriller book readers here. Don’t miss this one, and get your copy today. It’s so worth it!Thank you to NetGalley and Orion Publishing Group, for providing me with an e-copy, in exchange for an honest review. All opinions are my own and completely unbiased.Blog | Facebook | Twitter | Instagram | Pinterest"}, {"Review": "Holy MotherF*cker.This book has literally just blown my mind.Those of you who follow my blog or are a member of THE Book Club on Facebook will know that I suffer from chronic FOMO and despite having over 400 books on my kindle, when a new book is being discussed over on Twitter and all the bloggers are literally salivating over it and the publishers have allowed some of them to read the sampler and it appears the entire blogging community are involved EXCEPT ME, I immediately contacted the delicious Ben Willis of Orion and said those 6 little words “DO YOU KNOW WHO I AM?”. Obviously he does and immediately sent me a copy of this book which I started reading and devoured in a day.It’s taken me almost a week to write this review because I genuinely don’t know how to put my thoughts down and give this book the justice it deserves so I shall start with the basics. It’s a psychological thriller, so you know to expect a twist or two along the way and therefore I’m not even going to mention twists.The story is about a famous painter, Alicia Berenson who kills her husband Gabriel, a famous photographer by shooting him point blank 5 times in the face when he comes home late from work (yes I know, we’ve all been there) and then she basically stops talking. Staying absolutely shtum, not uttering a word Alicia is sent to a secure unit in my childhood home town Edgware where she remains THE SILENT PATIENT for years.Then we meet Theo Faber, a young criminal psychotherapist who is obsessed with this case and feels he can help Alicia talk about her crime and why she did it. So, when an opening at the secure unit comes up he grabs it with both hands and starts his journey to uncover the truth and be the “hero” who can get through to Alicia and get her talking.The story unfolds through Theo’s point of view and then through Alicia’s journal which she was keeping up until her husband’s murder. A fascinating and totally addictive story which kept me turning those pages (actually I was swiping my kindle but it sounds better the other way) faster than a contestant on Who Wants to be A Millionaire Fastest Finger First.I’m not going to divulge anything more, except there comes a point in this story when I had to STOP reading, take a huge breath and tip my hat to the author and think “Holy Motherf*cker, I did NOT see that coming”, and from that point onwards I read the book with a wry smile on my face, shaking my head in admiration and respect to Alex Michaelides for creating a story which I believe will be HUGE when it is published next February 2019.Just in case you weren’t sure – YES I LOVED IT. 5 HUGE STARS from me and totally recommend it to everyone who loves dark, psychological thrillers."}, {"Review": "I know you have all heard the hype about this book. Well believe the hype, it is really that good. The very first chapter opens with Alicia Berenson standing in her living room covered in blood. There is blood on the walls and the floors and all over her. She is standing in front of a chair that her husband is sitting in, with his face blown off. He has been shot 5 times in the face at close range. His wrists and ankles bound with wire. Alicia is bleeding from both wrists that have been slashed. How is that for an opening? I bet that would get your attention. Well it sure got mine. Alicia was 33 yrs old at the time and a rising star as a painter. Her husband Gabriel was a 44 year old photographer who was well sought out. He had just returned home late from a photo shoot. Why did Alicia do it? Nobody knows, but there is no other suspect, her prints were all over everything. The thing is...she never spoke a word. For 6 long years after her husband was murdered, she kept silent. Is Alicia capable of this violence? Why is she silent? Everyone has long given up on her. Until the new psychotherapist rolls onto the scene. Theo Faber is the new psychotherapist hired by The Grove, the facility Alicia is in. Can he break her silence? Can he win her over? Everyone tells him to forget it, that she is a lost cause. Is she silent out of guilt or is she covering for someone else? Or has she simply lost her mind?This book blew my mind. Watch out 2019 The Silent Patient is coming. It literally left me speechless, no pun intended. I really can't say much more because I don't want to spoil it for anyone. Just know I gasped and said \"WHAT?!!!\" I never saw it coming. I am going to bet you won't either. Will we ever hear Alicia speak again? If so, what could she possibly have to say?This is a MUST read in my opinion. It was absolutely a phenomenal unique read! If I could give it more than 5 stars I would!Thank you so much Alex Michaelides, Orion Books and Poppy Stimpson for giving me the opportunity to read this ARC."}, {"Review": "Jaw. On. Floor.There's that moment in The Silent Patient. The \"Wait, what? What??\" moment that you're so often promised on the jacket copy, or in blurbs stamped on the front, or--well, you know.You get promised it, but you don't really expect it. And as I was reading The Silent Patient, which takes a while to really start firing on all cylinders (which is not a plus for a shorter novel like this), I thought, \"Ok. It's a little sluggish, and if X happens, then Y will and then will get Z and--\"And then R happened and I was stunned. No Z! And out of the blue, although, thinking back....damnnnnnnn! R works, and that's the beauty of it.So yes, jaw. on. floor. The twist is that good, seriously.The Silent Patient does take a while to get going, and every female character is either maternal and older or crazy, kinda crazy, narcissistic, shrewish, etc. I would have liked to see at least one female character be a little more nuanced. This is especially true in the case of the female mc, Allison. But overall (and especially because of that twist!) The Silent Patient is definitely interesting, especially for fans of psychological thrillers."}, {"Review": "I just finished The Silent Patient and now I understand all the hype. Yes, the hype is deserved!When psychotherapist Theo Faber is offered a job at a psychiatric clinic where Alicia Berenson is treated, he doesn't hesitate one second to accept it. Theo has been following Alicia's case for years, since she had been charged with a murder of her husband. Alicia has not spoken since the murder, she keeps silent, surviving day by day in the clinic under high sedation. The Silent Patient was such a smooth, enjoyable read. The story flows nicely while the suspense is building up. The story is told in two timelines, the first narrator is Theo as he is trying to get through to Alicia and make her talk. His POV is intertwined with notes from Alicia's diary just before the murder.There is something fascinating about books told from the perspective of psychiatrists. They give me chills everytime, as the psyche of a patient is being analysed and understood. I also enjoyed the analogy with the Greek tragedy Alcestis by Euripides who kept silent after she returned from the dead to her husband.It was incredible how the ending totally sneaked up on me. I had to blink twice, swipe back to the previous page to make sure I didn't miss anything, re-read the sentence and just gasp for air. Very clever ending, indeed.Many thanks to Orion Publishing Group for an ARC in exchange for an honest review."}, {"Review": "\nhmmph\n3 SOLID STARS.My boy, AJ FINN, author of The Woman in the Window, blurbed this book. And I was hyped. Ultimately, not even a well furnished quote from one of my favorite go-to-thriller authors wasn't able to save this mess. Even when sis snapped with a shocking and explosive twist I NEVER coming, I still was exasperated about the whole book overall. The writing.....wasn't really my cup of tea. I'll give you the tea: I couldn't connect with any of the characters and another tantalizing thought occurred to me while reading this, mostly concerning the male characters: almost every single one them.....not all but close enough... all the male characters were all sooo—'handsome' or 'good-looking' by the author. It was kinda funny actually. But describing the women's features and descriptions, they were either unattractive or ditzy, or a hardass, or a crazy, and in another aspect, 'heavily overweight'. It was just a distinctive line between male and female characters that felt unrealistic, untrue, and unimaginative. Opposite. But pretty much every single male character in this book was really just— an asshole. Not a single redeemable quality about any of them so maybe that was the whole point all along. The story itself is very, very slow burn. Like watching a candle burn and all the wax melting....but with a dying fire. It was almost infuriating to read and watch everything unfold until—That. Fucking. Twist.Holy fuck was it a game changer. Honestly, if my expectations weren't so barren and low by the time I got to that point in the book, I think I probably wouldn't be as shocked. But my guard was down—probably intentional on the author's part— and it was.......holy shit I was so, so shocked. The whole book overall isn't bad. But it wasn't that great either. But to say in the least, I'm giving it a solid three. It wasn't for me per say even though I understand that high rating and its reviews of five stars. I think if you like slow burns and explosive endings, then this might be for you. I was going to bump it up to a four after that, but I'm staying steadfast and sticking it a solid 3. No more. No less. Twitter | Bookstagram | Youtube |"}, {"Review": "Have you ever seen a game of cards which is nothing but a battle of wills where the two players seem nonchalant, but there is this edge in their attitude, just a sliver, which tells you that something is just about to happen?!! And something does happen, one of the players folds, just surrenders!! What does one do then? Believe it to be true and end the game or look underneath this sleight of hand and get to the real truth??Alex Michaelides, in his debut, has played this chilling hand of surrender making me read and scrutinize every line of the story to try to detect and unveil the hidden truth. And boy!! Was I wrong!!The concept is pretty brilliant; Alicia a famous painter, ties her husband to the chair and shoots him 5 times, then paints an enigmatic picture and becomes a silent patient forever. Enter this earnest psychologist, Theo, who is kind of obsessed with unlocking her past and getting to the motive, wanting to make Alicia to talk again.Then comes the game play between these two players and suddenly Alicia talks... What is the truth or is she pretending? Why did she kill her husband or did someone else? Who is the mysterious stranger or is it her paranoia? Hint - Read the book to get to the answers.The whole book is a series of layers, some intermingling and others hidden. There are clues and red herrings present to sway the suspicions and to speak the truth. There are so many unfathomable characters, each worse than the other. There are a few niggles, the prose can be slightly tightened and some scenes seem implausible in mid story. But the author then plays his last game, a full flush, which just slid the rug from underneath my feet, sideswiping me till I could do nothing but give in to the exhilaration of the freefall, the sheer pleasure and shock of reaching the truth, the careful way the ends are tied made me go back in my mind, right to the very beginning where it all began. Twisted is all I can say!!! "}, {"Review": "This was an excellent debut by Alex Michaelides. Though it got off to a slow start, the consistent build of intrigue kept me raptly listening. I generally don't \"do\" audiobooks but I was fortunate to win this in a giveaway. I have to say that this is the best audio book I have ever tried. Kudos to the narrators for not putting me to sleep! Overall, The Silent Patient was a clever psychological thriller with plot twists I never saw coming and really, that is the thrill of the thriller, isn't it? I look forward to more from this author in the future."}, {"Review": "This is an outstanding debut psychological thriller! I really enjoyed it and it kept me fascinated. Alicia Berenson is a happily married artist who loves her husband. Until she kills him. Or did she? Alicia never speaks a word after the murder so she was sent to a mental institution called The Grove. Alicia is The Silent Patient - she doesn't speak to anyone at all. Theo is a criminal psychotherapist who thinks he can save Alicia so he maneuvers to obtain a position at The Grove in order to work with her. There's an awesome twist at the end that will stun you!The plot was engrossing and the characters were totally believable. I really liked both Alicia and Theo.Thanks to Alex Michaelides and Celadon Books through Netgalley for an advance copy."}, {"Review": "As soon as I heard about this book, I knew I had to read it. The Silent Patient was a very enjoyable book and a solid 4.5 stars. Alicia is a famous painter and seems to have it all-a beautiful house, wealth and a loving husband named Gabriel. That’s why everyone was utterly shocked when Alicia is accused of shooting and killing Gabriel. Why would she kill her loving husband? To make matters worse, Alicia refuses to speak in her defense and is ultimately sent to The Grove-a secure forensic unit. At The Grove, psychotherapist Theo Faber takes Alicia on as a patient, where his interest in her seems to border on obsession. Theo has a lot going on with his new position at The Grove but in his personal life as well. There are many twists and turns in this book and I certainly didn’t see that ending (and what an ending is was!). I would highly recommend it to fans of mystery/thriller books-you won’t be disappointed. Thank you to the publisher/Celadon Books for providing me a copy for review. "}, {"Review": "I must confess; I have sinned. The Silent Patient is the reason I have sinned; the reason I was gluttonous. My sinning began at page one, yes - it was there that I found myself gorging, gulping, slurping down every sentence, devouring page after page until I reached the end. I know I should feel remorseful but the only feeling I’m left with upon completion of The Silent Patient is that of pure satisfaction. The Silent Patient is a staggering, twisted, satisfying and savory read. It’s yet another read that I’m dubbing a must read. It will hit shelves on 2/5/19. The ending is one that you’ll never see coming! 5+stars for The Silent Patient!!⭐️⭐️⭐️⭐️⭐️+"}, {"Review": "Why I love itby AJ FinnSince Gone Girl conquered the globe in 2012, bookstore shelves have creaked beneath the weight of countless psychological thrillers. Another 44 were published in the past eight seconds alone—and precious few of these novels actually qualify as psychological suspense. More often than not, they focus on an imperiled protagonist—usually a young woman—whose psychology is neither nuanced nor particularly … well, particular. We might rattle around in the heroine’s head, but absent idiosyncrasies, dimension, or even personality, it’s like touring an empty museum.Readers, we face a literary epidemic. But Alex Michaelides is here to deliver the cure. The Silent Patient is an eerie, bona fide psychological thriller starring Theo Faber, a psychotherapist who by trade dwells within the inner lives of his charges—one of whom refuses to speak. As Theo attempts to break through to his silent patient—a woman convicted of murdering her husband—a dark story unfolds that is as shocking as it is expertly crafted.The characters in this novel crackle with complexity—with genuine psychology—and a walk through their minds feels as risky and exhilarating as crossing a minefield. (I would here like to coin the term \"mind-field.\") This phenomenal interior novel defibrillates the ailing body of the psychological thriller genre. I’m delighted to invite readers into the world of The Silent Patient. Just don’t get too comfortable.Read more at: https://bookofthemonth.com/the-silent..."}], "Genre": "Crime", "ID": "40097951", "Desc": ""}