{"Genre": "Crime", "Reviews": [{"Review": "Outstanding follow up to A High Mortality Of Doves. Full review at classicmystery.blog"}, {"Review": "This is the second Albert Lincoln in what is supposed to be a trilogy, the first being A High Mortality of Doves. Once more, DI Albert Lincoln has to venture into a rural village to investigate the murder of a young woman and the disappearance of her baby. One of the key witnesses is Peter, a young boy who seems confused between fantasy and reality and whose tales are not believed by others. He talks of a \"Shadow Man\" he has seen in the cemetery near his home. Peter is also the brother of a youn"}, {"Review": "I really enjoyed this book set post WW1, great characters and I feel another one will come along with Inspector Albert Lincoln being the lead."}, {"Review": "Sequel to \"High Mortality of Doves\".Did not enjoy at all. Felt more like a filler piece than a novel in it's own right."}, {"Review": "In a certain way this book is a continuation of “A high mortality of Doves”. I suggest that you read that book before this one so that certain things are not spoiled for you. But in other respects the story of this book stands on its own. Once again we are confronted by the horrors of the First World War. And then there is the baby who disappears, the boy who “fabricates” stories, the man without a face and the murder of a young women and an old women. The reader becomes emotionally involved wit"}, {"Review": "Atmospheric sequel, mainly set in Cheshire. Very good on the aftermath of the First World War - the impact on communities and families, the flu epidemic, the former soldiers begging in the streets, the bereaved turning for comfort to suspect spiritualists. This is still quite melodramatic but not so much as the previous book in the series. The cemetery provides some very Gothic moments - a woman murdered by being pushed unconscious into an open grave and buried alive, for instance. A mystery fro"}, {"Review": "I didn't realise, when I found this book in the library, that it featured DI Albert Lincoln who had first appeared in A Mortality of Doves. This was equally as good a read. It is set just a year later. For those who have yet to read the first book there's an unobtrusive 'catch up' included within the story which means that each book can be read as a stand alone. There are plenty of twists and turns in the plotting to satisfy 'whodunnit' fans. I certainly didn't guess the outcome until very near"}, {"Review": "I’m so glad that she did a second book, set in the time period just after the war, a woman is buried alive and her baby is missing Inspector Lincoln investigates when things don’t seem right, you also get the perspective of a young boy Peter he has a great imagination but every one says he’s a liar but is there truth in what he says.Such a good book really enjoyed it, very atmospheric"}, {"Review": "Another great book from Kate Ellis and left me wanting to read the next in the series. I know its meant to be a trilogy but the series must go on.Highly recommended but read mortality of doves first"}, {"Review": " A good whodunnit set in 1920s Britain. Really enjoyable read"}, {"Review": "There was some repetition of Albert’s life with his wife and former “love” but the book was still an interesting read. Albert may be a good detective but he’s weak around women."}, {"Review": "Superb! The second book in a new series featuring Inspector Lincoln. Grittier than the Wesley books. Five stars"}, {"Review": "I got a bit confused with all the name changes but a really good read "}], "ID": "35172168", "Name": "The Boy Who Lived with the Dead"}