{"Genre": "Crime", "Reviews": [{"Review": " We are all drowning slowly in the tide of our opinions, oblivious that we are taking on water every time we open our mouths. Isn’t that the truth? Regardless of topic, circumstance or person—and whether you have the guts or gumption to share it—deep down, we all have an opinion about everything. Each of us find ourselves walking through life, in our own versions of reality, shaped by past experiences, mistakes, upbringing, religion and oftentimes age. There are those who hold steadfast in their"}, {"Review": " She wondered if the only way any of us can find what we stand for is by first locating what we stand against. I got a really pleasant surprise a couple of years ago when I picked up Small Great Things on a whim and discovered that Picoult is actually much more vicious and hard-hitting than I'd expected. Her covers look like chick-lit, but it seems she takes very current, often controversial, topics and examines them through the eyes of complex and relatable characters.However, I think this book"}, {"Review": "***NOW AVAILABLE***I am either hit or miss with this author and for me this was a miss. I knew from the blurb, which is incredibly extensive, that there will be a shooting at a women’s health clinic where abortions were being performed. I did not know however that this book was going to be entirely about abortions. This was not particularly a problem for me but here is why I didn’t really enjoy the book.First of all the book is told in reverse order so we already know the ending after the first"}, {"Review": "My reviews can also be seen at: https://deesradreadsandreviews.wordpr...As soon as I see that a new Jodi Picoult book is going to be released, I can't wait to read it. But as much as I wanted to drag out this novel and make it last, I couldn’t stop reading. I had to find out how it all began…and how it all came together in the end. This novel is written in a way I wasn’t sure I would like. But I actually really enjoyed how the story was told. The book begins at five pm and moves backward in time"}, {"Review": "Author Jodi Picoult is no stranger to controversy, and it seems somehow fitting that she should tackle the contentious issue of a woman's right to abortion in this, her latest offering. Set in a women's reproductive health services clinic, now becoming a rare commodity, the story kick starts with a bang with a desperate gunman shooting at those within the clinic and holding them hostage. The narrative then proceeds to go back in time to the start of the day for the wide cast of characters presen"}, {"Review": "Audiobook...Narrated by Bahni Turpin, and Jodi Picoult Favorite line: from Jodi Picoult...( reading this part herself), in the author’s notes:“Laws are black and white;lives of women are shades of gray”. I also agree with this statement: “I don’t think we, as a society will ever see eye to eye on each other’s point of views....but it’s important to have conversations and talk with each other”. My reasons for only 2 stars:.... I didn’t think much of the storytelling ofthis topic. It felt cold and"}, {"Review": "\"Today, Wren McElroy thought, was not a good day to die.\"This book begins with a hostage situation at the local Center. The Center is a place for women (and teens) to go and get birth control, have gynecological examinations, and obtain abortions. It is known as a woman's reproductive health services clinic. Naturally there are those who do not want such a clinic in their community and there are those who are thankful that it is there.One day a man bursts into the clinic and begins firing. Anoth"}, {"Review": "I tried to like this book, I really did, but I found it to be preachy and boring as batshit. I kept finding excuses to put it down and not get back to it, which is unlike me. The reverse chronology of the chapters I found to be disjointed and annoying, and because of this I couldn't connect with any of the characters. And a graphic abortion scene? I mean really? Does anybody need to read that? I know this is Jodi Picoult and it will probably be a mega seller, but it just didn't do it for me.My t"}, {"Review": "3.5 rounded up.Jodie Picoult is a prolific writer, and if you’ve read any of her books, you know she confronts head on some tough, controversial and always relevant issues. This one couldn’t be more timely with this predominantly conservative Supreme Court we will more than likely have, who could possibly reverse Roe v Wade. We see mass shootings and hostage situations too frequently on the news. This book takes us inside a hostage situation, where people are shot inside an women’s clinic that p"}, {"Review": "4.5 Brilliant and Harrowing Stars* (rounded up)With “A Spark of Light” Jodi Picoult does it again! This time however, the path she takes to get to the finish line is a little different.As we all know, Jodi Picoult is no stranger to controversy. Nor does she shy away from topics that others would never conceive of. One of her many talents lies in her ability to remain neutral while weaving stories about the most contentious of subjects. This is one of those times. In “A Spark of Light,” several w"}, {"Review": "4 fiery stars to A Spark of Light! ⭐ ⭐ ⭐ ⭐ As a fan of her writing, I have noticed Jodi Picoult’s topics have gotten more fiery as the years have passed, and they continue to be thought-provoking. The Center is a women’s clinic serving all their health needs. Everything changes when a man with a gun enters the building, begins shooting, and takes everyone hostage. My first questions are who is this man and why is he so distraught? I knew there would be more to his story. Hugh McElroy is a hostag"}, {"Review": "I am so happy I can't even speak. I received this ARC in the mail!"}, {"Review": "Didn’t care for this book, but there’s an asterisk on that. First, I love Jodi Picoult. Her ability to see something from every point of view is the kind of extreme empathy we need more of in this county. I also love the vision of this novel. She examines abortion from the top of the iceberg and slowly works down to the broader scope of the issue, both from the perspective of pro-choice and pro-life characters.It was a risky move to write this in reverse chronological order, where every chapter"}, {"Review": "It’s been years since I’ve read Picoult. It’s been so long that I can’t recall which of her books I did read. This one begins at an abortion/women’s health clinic during a hostage crisis. Told in reverse chronological order, the story examines the abortion issue from both sides by presenting characters who wind up in a hostage situation for a multitude of reasons. Some are there to terminate or to prevent a pregnancy. Some are there to perform the procedure or to assist in other ways. Others are"}, {"Review": " It stood to reason that both life and death began with a spark of light 5 Powerful & Thought Provoking StarsIt's a fall day and women are driving from all over the state to The Center for Women in Jackson Mississippi because it is one of the few places that women in the state can go to receive care. This includes birth control, cancer checks, ultrasounds and yes, abortions. Mississippi has the strictest law (15 weeks) that you can have one. Outside the doors, there are protesters everyday t"}, {"Review": "Oh my god you guys, I actually read this book months ago and I’m still thinking about it today. As soon as I received a copy I dropped everything and started it and it totally blew me away. It has her trademark hard hitting subject matter and deeply moving storyline and she rips her storylines straight from the headlines like no ones else does. If you read one book I recommended this year I urge you to make it this one, I feel like we can all learn something profound from this book.The structure"}, {"Review": "A Spark of Light by Jodi Picoult is a fictional title that tackles the very tough subject of abortion so it may not be for everyone. The story is one that doesn’t take sides but instead tries to shed light all around in a suspenseful setting. The format is also a bit different and unusual in the fact that the author chose to start at the end and go backward from there counting back the hours and one horrific day in the small community clinic.Now, for me I very much appreciate what the author tri"}, {"Review": "This review and other non-spoilery reviews can be found @The Book PrescriptionBR this with Dr.TalaActual Rating: 3.5 stars “If we are meant to only have children who never encounter difficulty in life, then no one should be born” 🌟 This is my first book by Jodi Picoult who I have heard lot of good things about. I always avoided her books for no good reason, I just thought that they may be hyped and I wanted to give her a chance. Once I saw she was releasing this book and I read the synopsis I th"}, {"Review": "Jodi Picoult is one of those reliable authors that manage to keep you turning the pages with every one of their books that you read. I was really excited to read her new one A Spark of Light because I know she always delivers the goods! A book that grabs at both sides of the story, sucks you in and brings in all the feels! This time it is about abortion.Hugh is a police negotiator called in to talk to a gunman after he opens fire at an abortion clinic. Things get very complicated for Hugh when h"}, {"Review": "🌠🌠🌠🌠🌠 5 Sparks of Light! No one tackles tough, controversial, timely issues, as expertly as Jodi Picoult.I have been anticipating this release for months – waiting, waiting, waiting – and I’m thrilled to report that it was every bit as wondrous and amazing as I’ve come to expect from this incredibly talented author. Her books always see me debating my own beliefs and opinions, and this one was no exception. There were questions raised throughout that I’d never ever considered. A Spark of Light w"}, {"Review": "Ahhh can't wait for this!! THE cover is to DIE for!! <3. "}, {"Review": "Once again, Jodi Picoult has given us a novel that is thought-provoking and poignant and powerful -- with a litany of compelling, deeply affecting characters. What makes this novel especially interesting is the narrative structure: Think \"Time's Arrow\" by Martin Amis. The story moves backwards, and then flashes forward to a stunning epilogue. And what a story it is: a hostage situation at the last clinic in Mississippi that performs abortions. So timely -- and so moving."}, {"Review": "I should have paid attention more fully, I didn’t realise on Net Galley the publishers were only offering an exclusive first chapter, all this has done is frustrate me until I can get my hands on the entire book.This starts with a hostage situation.It’s told in only the professional way a talented author can tell for her readers to actually feel scared in amongst all the mayhem.I can’t wait to read more. Thank you Hodder & Stoughton but I need more!"}, {"Review": "Where to start with this review? To start, A Spark of Light wasn't what I was expecting. I've read several other books by Jodi Picoult and they've all been full of tension and suspence that kept me glued to the pages. The beginning of this one was just that, an explosive, heart-stopping moment that immediately grabbed my attention. Unfortunately, for me, the main body of the book slowed considerably and was more about abortion than the hostage situation. Hugh McElroy, the hostage negotiator, dis"}, {"Review": "  “Joy wondered how you get someone you think is blind to see what you see. It certainly can't happen when you're standing on opposite sides of a wall.”   A very true statement. As such, Jodi Picoult brings opposing perspectives on abortion inside the very walls they fight, all inside one abortion clinic where they not only share differing opinions but now share the experience of being victims in a violent hostage situation. They are able to put their differences aside and work together towards"}, {"Review": "Jodi Picoult shines a light on a controversial issue hoping to spark conversation and understanding.SUMMARYThe day starts like any other at the Center in Jackson, Mississippi. The women’s reproductive health service clinic offers care to anyone who passes through its door. Later in the morning, a desperate and distraught gunman, George Goddard bursts in, opens fire, and takes everyone inside hostage. His daughter had recently had an abortion. After rushing to the scene Hugh McEIroy, a police hos"}, {"Review": "A Spark of Light by Jodi Picolt is a story of people caught up in a hostage situation in a medical centre. I did not realise that I had only been given an ARC of the first chapter of this book.and I would really like to read more to see how the story progresses."}, {"Review": "Jodi Piccoult really likes to take an issue and hash it out from both sides. I think the subject matter here was going to be hard to read no matter what because abortion is such a hot-button topic with little to no gray area in the middle, and like so much in the current political climate, is very divisive. I found myself very drawn into the story, which centers on a group of people trapped in a clinic during a mass shooting. The characters were engaging. The layout of the story bounced around q"}, {"Review": "3 I was disappointed starsMy reviews can be found here: https://yayareadslotsofbooks.wordpres...Abortion has divided us as a nation into what seems to be two camps, either it seems you are pro abortion or you are against it. It is an issue that has been fought over ever since the controversial Roe vs Wade decision in 1973. Never one to shy away from a contentious subject, Jodi Picoult tackles the question of abortion on in her new book, A Spark of Light.It is hard to keep your head clear and rea"}, {"Review": "It’s really hard to write a review with so many different POVs. Especially when the subject matter is a tough topic such as abortion.In A Spark of Light, you hear every side. You understand and/or you don’t. The story is told in reverse which I loved. Anytime a story is told differently like that is a win for me. There are a ton of characters in this story, each come with different beliefs and upbringings. The novel starts at 5pm with an active shooter holding his hostages in the only abortion c"}], "ID": "39072210", "Name": "A Spark of Light"}