{"Genre": "Crime", "Reviews": [{"Review": "As a long time fan of Tony Hillerman, I decided to take a chance on new author Carol Potenza, who won the 2017 Tony Hillerman prize. Nicky Matthews is a Sergeant in the Pueblo police. For some reason, I never thought there would be non-Indians on a reservation police force. But there she is. And despite being an outsider, she is the one that the Wind Mother chooses to visit. I enjoyed this immensely. Nicky has a lot of baggage, including an ex-lover trying for a comeback and a boss that hates he"}, {"Review": "\"I believe that there is more to this world than our minds recognize.\" There was an odd catch to his voice, a hint of uncertainty.Sergeant Nicky Matthews feels a certain presence as she wraps up her investigation in a convenience store robbery. The lateness of the hour seems to have played tricks on her vision. From the corner of her eye she sees the reflection of an ancient woman in the glass staring back at her. She draws in a quick breath and leaps to the doorway. No one there, not even a bre"}, {"Review": "I love it when I have the opportunity to visit or revisit an area through a book, and that is what  Hearts of the Missing by Carol Potenza offered. The story takes place on the Pueblo of the Fire-Sky Native Americans  and is a rich combination of themes woven together in a way that leaves you hoping there will be more books featuring these people and this beautiful setting. The novel combines multiple elements, weaving them in and out to create a beautiful tapestry.There is Nicky, the federal la"}, {"Review": "This is an excellent debut novel for Carol Potenza and well worthy of the Tony Hillerman Prize. I was drawn in by the deep characters, mesmerized by the local and cultural feel, and pulled along by a fast-moving albeit complicated plot. Kudos, Carol, for an excellent read!"}, {"Review": "Thank you NetGalley and St. Martin's Press for this arc.A complex and very convoluted plot. The pacing wasn't very smoothly done, but in my mind forgivable as this is the author's debut book. Further confusion was the addition of a number of characters with inadequate \"introduction\".... details of their backstories were not provided until 50 plus pages later, making them feel more like plot contrivances than real characters. I found the main character Nicky a little unrealistic (too much emotion"}, {"Review": "This was a phenomenal debut!! Wow, just wow... I loved it. The author had me hooked from start to finish. It was so well written, and the twists and turns, along with the red herrings, left me guessing to the end - just what I love in a good mystery. I adored the heroine Nicky - she was so relatable and I was cheering her on the whole time. I can't recommend this book enough. Do yourself a favour and grab a copy - you'll love it. I am now eagerly awaiting book 2 - and Potenza is an auto buy for"}, {"Review": "Review can be found on my blog here: https://booksonthebookshelf.wordpress...Thank you to Minotaur Books for sending me a free physical ARC copy of this book. This book is a winner of the Tony Hillerman Prize.I loved all the suspense, mystery and surprises in this book. There was so much suspense that it had me hooked to the storyline and I was so into uncovering the mystery of what was going on that I flew through this book and felt myself on the edge of my seat as I was reading through the cha"}, {"Review": "I have read everyTony Hillerman book and, being raised in the Southwest, loved how he (and later his daughter Anne Hillerman) captured so beautifully the aura of the land and its people. When I heard Hearts of the Missing had won the Tony Hillerman Prize for Best First Mystery Set in the Southwest, I was intrigued enough to read it.Let me say, I was not disappointed. Potenza’s book is every bit as enthralling as a Hillerman Leaphorn or Chee mystery novel. Potenza’s love for the New Mexico landsc"}, {"Review": "I enjoyed the story on Audible. Hearts of the Missing is a captivating mystery with a romantic edge and a deep Indian cultural dimension. Fire-Sky people are vanishing. Micki Matthews, a feisty, dogged, intelligent tribal police woman is on a mission. She is endeared by the locals and two special Pueblo friends, Ryan and Samantha. They serve as her Indian translator, connector, and interpreter of signs. The plot will zig you here and there so hold on. Potenza’s writing style moves quickly with m"}, {"Review": "This was a wonderful new book by the debut author who recently won the Tony Hillerman prize.Like the Hillerman books, it is set in the American southwest on a tribal reservation. The author shows an understanding and reverence for the native american way of life as portrayed in the book.Nicky Matthews, the detective charged with working a string of murders and missing persons among the tribe, relies on help from sympathetic members of the tribe and good deductions to solve the case. She does thi"}, {"Review": "I was a little disappointed when I found out the tribe was fictional. It then made me wonder if the customs and rituals I had just enjoyed learning so much about were also fictional, but from online interviews with Potenza I gather that those are based on research (Potenza's sister in law is a police officer in a New Mexico Pueblo).The mystery revolves around scientific research, organ donors (the Fire Sky People have to be buried intact, so they aren't donors), and DNA. Potenza is a practicing"}, {"Review": "After being forced to move and give up law school Nicky Matthews is finally doing something she really loves. She is a police sergeant with the Pueblo NM police force and she is the liaison with the Fire-Skye Indian reservation. Nicky has made many friends on the res and she is respected by the natives, but she is not liked at all by her boss who can’t wait to catch her doing something wrong. When a suicide seems to be linked to other missing Fire-Skye people Nicky defies her boss and investigat"}, {"Review": "This book is a true mystery at every turn. I fell in love with the main character, Nicky Matthews, as she navigated being an outsider in a world she feels deeply connected to. The artistry and cultural competency Dr. Potenza used when capturing the spirit of the tribal lands of New Mexico is astounding. I respect any artist that is able to research and present this culture so respectfully, and this book certainly hits the mark. It is no surprise that this book is the winner of the Tony Hillerman"}, {"Review": "This book is the winner of the Tony Hillerman prize and thus has some serious shoes to fill, and it fills them fairly well. Set on the Pueblo, Potenza has created a fictional but believable tribe, the Fire-Sky tribe. She then gives each of her four major characters varying degrees of connection to the tribe. At the center of the story is Sgt. Nicky Matthews, a Pueblo police officer, not native herself.Her best friend, Savannah Analia, the public safety director’s assistant, is full blood. Then t"}, {"Review": "Winner of the 2017 Tony Hillerman Award, Heart of the Missing introduces readers to Pueblo Police Sergeant Nicky Matthews. In my opinion, it is a fitting win for this author. I found in Potenza's book the \"Hillerman\" magic of the Southwest and the native tribes that is missing in many well written books. Where Hillerman focused on the Navajo culture, Potenza takes readers inside the Pueblo tribes.A young woman, member of the Fire-Sky Pueblo, is dead. When the autopsy reveals high levels of vario"}, {"Review": "My library sends out monthly “new reads” in various genres and Carol Potenza’s debut, HEARTS OF THE MISSING was on a recent list. I’m a fan of Tony Hillerman, Margaret Coel and James Doss so I thought I’d give her a try. Boy am I glad I did!While I figured out early on what was the core mystery—what was driving the killer, Potenza adds some twists and turns I did not see coming. While at times I had to go back and read parts to make sense of the flow, the writing was clear and kept you involved"}, {"Review": "This is an award winning debut novel by a biochemistry professor featuring a mystery set on an Indian reservation. The main character, Nicky Matthews, had intended to be an attorney but her life and career plans got sidelined when she had a disastrous affair with the head of the state police. So, she ended up as a cop on the reservation, a job which she loved.Nicky is asked to further investigate some unexplained deaths and disappearances which have been officially written off as suicides. Nicky"}, {"Review": "I found this to be an enjoyable mystery novel set in the area in and around Santa Fe and Albuquerque, New Mexico. It involves elements of Pueblo Indian religion and culture, the issue of racial or tribal purity among native populations, and the illegal trade of human organs. Nicky Matthews is an officer of a tribal police force with a backstory that somewhat complicates her efforts to solve some mysterious disappearances and a suicide. Being a non-native also hinders her job as she operates with"}, {"Review": "3 1/2 stars out of 5Hearts of the Missing is a police procedural story that isn't able to find the right flow making the story feel jerky and a little too messy. The story throws readers right in with very little back story that could cause readers to becomes lost at times with who does what and why. The characters at times lack focus for being police which makes the story once again a little too stop and go feeling.While the story its selves is interesting giving readers a in-depth look at fire"}, {"Review": "I truly enjoyed this book and was much more impressed by it than I expected to be. The portrayal of Native American cultural and ritual was well done. As another reviewer said, I agree that the storyline pacing was a little off at times, but overall it worked well. I read it in two days because I was intrigued immensely by both plot and characters.My only complaint would be in regards to some of the law enforcement portrayal. Not all of the lingo used was entirely accurate, but I doubt anyone wh"}, {"Review": "I've decided to do a display: Old School, New School. It will feature mysteries that take place before technology took over, and those after. This book is definitely after. DNA analysis is a major part of the mystery, both solving it and causing it. And cell phones are a key component. This however also contains elements from so far back in history we are dealing with mythology. I loved learning about a new group of New Mexico natives and how they are trying to maintain their culture. Good chara"}, {"Review": "Taut amalgam of Native American culture, current landscape of their society now and a crackling good mystery. Winner of the Tony Hillerman Prize 2017 for best debut mystery set in the Southwest, this book will educate you on Fire-Sky Native Americans while keeping you up late with your heart in your throat. Meet Nicky Matthews Pueblo Police Sergeant who has earned the respect of the community, but runs afoul of her police captain. Let's just hope she will be back to thrill is again soon.Highly r"}, {"Review": "This was a decent police procedural; if you temper your expectations you won't be terribly disappointed. The pacing is jerky, there are many relationships that are introduced poorly, and the minor characters, especially cops, are cardboard cutouts. While it's easy to see why this won the Hillerman prize as its descriptions of native culture and natural beauty of the West approach that author's lyrical prose, this doesn't hold a candle. Try this, and if you like it then try Hillerman."}, {"Review": "In this stellar mystery- hopefully the first in a new series- Pueblo police officer Nicky Matthews takes on a missing persons case that ends up exposing a wicked crime wave that might be more than she can handle. Mystical beliefs, personal heritage, crime investigating, cultural history, romantic entanglements, a richly created setting...this novel has so many layers, all perfectly balanced. I can't wait for Nicky's next case!This ARC was provided by Minotaur/Macmillan, in exchange for an honest"}, {"Review": "I wavered between 3 and 4 stars but decided on 4 based on the depiction of the Southwest setting, and the well-developed characters that I came to care about by the end, particularly the protagonist, Nicky Matthews. The Tony Hillerman award was well-deserved; for a first novel, this is a great effort. Very atmospheric and intense, with a lot of attention paid to detail regarding the Native American customs and religion that she explores through the plot."}, {"Review": "I was very impressed with this debut by Carol Potenza. The author doesn't stumble at all in her story about a police sergeant navigating the political and cultural minefield of a tribal police force in her efforts to solve the mystery of the \"perdito,\" or lost ones, while also trying to understand the visions that plague her and how they relate to the case. Well done!"}, {"Review": "Potenza takes us into the heart of the Fire-Sky people of New Mexico through the eyes of Pueblo Police Sgt. Nicky Matthews. When a suicide leads to suspicions of a larger horror, the story burrows into the history and culture of the pueblo. Rich characters and a mystery unique to the Fire-Sky people make this an exciting beginning to a new series."}, {"Review": "If you enjoy mysteries set in the Southwest and involving Native American culture and intricacies then you will certainly like this story. An interesting main character with a strong belief in right and wrong is determined to do whatever it takes to bring an organ harvesting killer to justice. Will she make it in time?Enjoy!"}, {"Review": "Intriguing characters, great setting and terrific story. I can't wait to read more books by this author.Pueblo police sergeant is drawn into investigating the death of a Fire-Sky tribal member that has been ruled a suicide. However, the spirits of the lost seem to be sending her messages and the investigation expands."}, {"Review": "I always looked forward to hillermans books, I was hoping the same with this new author, but the shoe just didn't fit... I love the four corners, steeped in rituals and history, I just didn't get that warm fuzzy feeling, didn't connect and wanted a deeper experience. "}], "ID": "37638309", "Name": "Hearts of the Missing"}