{"Name": "Bringing Down the Colonel: A Sex Scandal of the Gilded Age, and the \"Powerless\" Woman Who Took on Washington", "Image": "https://images.gr-assets.com/books/1523741128l/35259565.jpg", "Reviews": [{"Review": "Bringing Down the Colonel: A Sex Scandal of the Gilded Age, and the ‘Powerless’ Woman Who Took On WashingtonA look at things in Victorian America for women. A Kentucky lawyer and politician makes promises he won’t keep and plays fast and loose with young women while his wife is at home. When he’s finally brought up short and one files a lawsuit against him for breach of promise, he tries to brush her off, using his power and prominence to quiet her. Madeline Pollard files a lawsuit after Colonel Breckenridge marries another woman, leaving her in the lurch after nearly 10 years of promises to marry her. She’s left with a bad reputation and no future and takes up residence in a residence for wayward women.Another young woman, Jennie Tucker goes undercover for the defense using another name to try and befriend Pollard and gain intel. The case goes to court, and Pollard gives her side of things, showing all that the Colonel has truly put her through, and all that she has given up for him, including the children she bore him. The case is ascribed to changing the feeling of people against women being the only party responsible when there is a public outing of a couple doing wrong, never the male, prior to this case. Sentiments became harder toward men after this in terms of morality. My thanks for the advance electronic copy that was provided by NetGalley, author Patricia Miller, and the publisher for my fair review.Farrar, Straus and Giroux 384 pagesPub: Nov 13th, 2018My BookZone blog:https://wordpress.com/post/bookblog20..."}, {"Review": "There are more non-fiction narratives of bullying being published. Or so it seems to me. While reading this book, I also tore through an appalling account of present-day avarice-led bullying by lawyers and executives in Silicon Valley. This micro-history is a bullying story of the old-school, with Kentucky Congressman and revolting hypocrite William Breckinridge struggling mightily in 1894 to shut down the woman he first seduced when she was 16 (so she said, there is some disagreement). He then strung her along with promises that he would marry her when his sickly wife died. This he did through ten years and no less that three pregnancies, all the while publicly mouthing the clichés of the sanctity of marriage, which is of course a mix of behaviors all too familiar from politicians and self-appointed moral guardians in our own age. When Breckinridge's wife finally passed away, the Congressman quickly married a better-connected woman from the pathetic aristocracy of his backward native region, who might better enable him to pursue his twin hobbies of personal advancement and living beyond his means. The abandoned woman, Madeline Pollard, [insert “hell hath no... ”, etc., here], brought a breach of promise suit against Breckinridge and, to the astonishment of many and contrary to previous practice, won a settlement equivalent to three years' salary for a Congressman. (Today, a Congressman earns $422,000 in three years.) This, in spite of tactics of moral-midget lawyers, which are completely, and sadly, familiar today: spreading lies and misinformation in the news media, and hiring a spy to attempt to befriend and betray. However, it turned out that Pollard was not entirely bereft of resources, and neither a dummy or a shrinking violet, besides.In our sad times, it is easy to get cynical and snarky about all that “arc of history bending toward justice” stuff that seemed inspiring only a few short years ago. But moments like this can, perhaps, demonstrate that the slow accumulation of activist-driven changes in social norms, reasoning, and attitude, may not be perceptible when one day looks pretty much like the day before, but can still result in court-delivered justice becoming more like genuine justice than it was before. Cast-off women were mocked and humiliated in court before 1894 – what changed? Perhaps the small but noticeable details in the life of the average person – the female relative who had found happiness through the pursuit of education, the knowledge that belovéd sisters had been the recipients from unwanted attention from local boors, the armies of women contributing to family prosperity through jobs of long hours of insufferable tedium – made it more difficult to sit quietly by and ignore or condemn Madeline Pollard in the same way that similarly-wronged women had been in the past. I'm a sucker for this sort of book: that is, one about a historical event that created a lot of sound and fury in its time, receded, and was forgotten – and can now be looked at with fresh eyes. This particular book is also fairly cheerful in its own peculiar way, as it is evidence that villains sometimes get the excoriation they deserve – first, in their lifetimes, and then once again, in posterity. I received a free electronic advance review copy of this book via Netgalley and Sarah Crichton Books, an imprint of Farrar, Straus and Giroux."}, {"Review": "When Jennie Tucker heads to Washington D.C. with the promise of a lucrative position, she has no idea what her employer has in mind for her. A single woman nearing her thirties, Jennie comes from a good family that has a beautiful home, but no money to maintain it—or her. In Victorian America on the east coast, economic necessity forced more and more women to enter the work force when they failed to marry and their parents could no longer support them. But entering the work force carried a horrible stigma. Men viewed working girls as prey. A woman who left the traditional career path of wife and mother found herself subject to the unwanted advances of bosses, co-workers, and acquaintances. When Jennie arrives, she discovers that Mr. Stoll, her employer, wants her to befriend a certain infamous Madeline Pollard. Jennie, happy for a position that allows her to play spy and detective, sets out to discover incriminating evidence against the woman who had recently sued the famous Colonel William P. C. Breckinridge for ‘breach of promise.’ Breach of promise suits almost never went well for the woman. In the Victorian era, a breach of promise suite implied that a woman had given her virginity to a man in exchange for a promise of marriage and now had ‘neither her virginity nor a wedding band to show for it.’ What made Madeline Pollard’s case especially scandalous was her claim that her relationship with Breckinridge had spanned eight years and produced multiple children. The colonel, during this time, was married.A fascinating true story about how a brave woman helped change the Victorian double standard that posited that a woman must come to the alter pure, while a man could have multiple affairs—both before and after marriage.The author weaves in fascinating facts about social mores from the Puritans to the Victorians. She explains how the double-standard at the time of the court case hurt women who strove to gain an education and gain acceptance in a world ruled by men. Readers of Erik Larson will enjoy the way the author weaves history and narrative together in a well-researched book that keeps the reader engaged from start to finish."}, {"Review": "BRINGING DOWN THE COLONEL is a nonfiction account of Madeline Pollard’s lawsuit against Colonel W.C.P. Breckinridge for abandonment (he had a shotgun marriage with another woman while engaged to Pollard) in 1893. Sadly, DC didn’t have seduction laws, which many other states had at the time. Pollard’s aim is to make Breckinridge have his share of the blame, shame and consequences. This lively account explores a ten year affair that Pollard believed would end in marriage. Instead, it ends will this suit. Throughout, there are some great tidbits to help the reader truly understand the times. Such as, “Too much education would harm women because it would overtax their brains and draw vital energy from their reproductive organs” (p. 109-110). This is a story of one woman defying the time she lives in to take what she deserves. Pollard is standing up for her rights and refusing to be harmed by a man or let that man continue to pursue his career unpunished"}, {"Review": "Over a century before the onset of #metoo, a previously unknown woman brought a breach of marriage suit against a powerful Washington politician. This was no small thing since she would be required to reveal her status as a “fallen woman.” Nevertheless, she took him to court in 1893, won the trial in 1894, ended his career the same year, and was consigned to the footnotes of history. Long before the likes of Harvey Weinstein graced the tabloids with accounts of disgusting behavior, Patricia Miller had heard of Madeline Pollard and begun investigating her case against one William Campbell Preston “Willie” Breckinridge. A married man having a mistress is nothing new. In fact, the higher up in society you were the more it was almost expected of you. Both wife and mistress were kept handsomely and each had a role to play in the man’s life. But society also had unwritten rules regarding the situation: the wife should never acknowledge – or have to confront - her husband’s infidelities, and the mistress should never publicly reveal her position as Madeline Pollard did. Miller’s book doesn’t just look at the trial and surrounding media accounts. She includes a brief history of marriage and pre-marital sex in America, and why Pollard’s case was so groundbreaking. She also looks at the sad case of Maria Halpin, who found herself pregnant with Grover Cleveland’s child after, she alleged, he raped her. Cleveland went on to be President while Halpin’s reputation was smeared forever. Cleveland was elected in 1884 and 1892. He was Breckinridge’s contemporary, in more ways than one. The final third of the book looks at Breckinridge’s re-election campaign and how women’s attitudes were changing as a result of the trial. Breckinridge lost the election due to the voices of a populace who couldn’t even vote.Patricia Miller took ten years to research and write Bringing Down the Colonel. The result is an in-depth, yet easy to read, accounting of the scandal and how opinions on sexual relations outside of marriage and women’s rights have changed since colonial times. Are there difficulties? Yes, but they aren’t Miller’s fault. There were a large number of players involved – from legal advisors to society doyennes – and a Who’s Who might’ve been a nice addition. The involvement of Jane “Jennie” Tucker sounds almost made up – until I found independent proof that she did actually exist – but she provides an interesting counterpoint to the women who sided with Pollard. She was hired by Breckinridge’s supporters to spy for his legal team, but never received payment for her work. The actions of Breckinridge and his cronies show that when it comes to treatment of women, there is nothing new under the sun.Disclaimer: I received an electronic copy of this book from the publisher via NetGalley. I was not required to write a review, and the words above are my own."}, {"Review": "4.5I'm surprised how much I enjoyed this, to be honest - I was excited to try it but I'm not the biggest fan of nonfiction, so my expectations weren't high. I enjoyed the tone and language a lot - it wasn't bogged down by long academic sounding sentences that I could barely understand, and there were even a few times that I laughed out loud at the authors sarcastic and ironic tone. I thought she painted a well rounded picture of the time and culture, and provided some other previous examples of similar cases. And while it is a story in history primarily about white upper and middle class women and their struggle for equality within society, I appreciate that she mentioned other women and minority's and acknowledged that they faced their own, different struggles at the same time."}, {"Review": "Patricia Miller accomplishes here a very detailed, in-depth investigation of the nineteenth-century scandal that was brought to trial and changed how America looked at women’s sexuality. Madeline Pollard was considered “ruined” by an affair with a high-ranking government official, but she fought back, and won. The trial described within these pages brought to light events and women’s rights struggles that echo those of current times and proves that there is nothing new under the sun. Perfect for History buffs! "}, {"Review": "“The real combatants, though, were two worldview about women and sex. One was the hierarchical, predatory southern ethic, which held that any woman who wasn’t protected by her father and domestic isolation was fair game and became part of a debauched class necessary to protect the purity of respectable women… The other was the more egalitarian ethic of the western elite- the descendants of the pious but fair minded Puritans that increasingly saw men and women as equals and men as responsible as women for upholding high, nonpredatory, standards of sexual mortality. “Patricia Miller’s Bringing Down the Colonel is a great read for anyone interested in American History. It was eye opening to read that women in the 1890s were struggling with similar societal problems as women are today. There were multiple history lessons in this book that I am shocked I have never heard about previously. This book reads like fiction and I highly recommend! "}, {"Review": "the ' me too' movement in the 1800s- who`'d have thought of it?but it really happened, and she won! "}, {"Review": "In the era of the Me Too movement, women are looking towards history and politics and wondering: are we the first to stand up? We know women fought for the right to work, the right to vote, and we earnestly want to know not only what those women went through, but why. Why did society and politics need the push they needed, and why did it succeed sometimes but not others? What were all the unwritten currents for and against these pioneers?Patricia Miller does an excellent job answering these questions in Bringing Down the Colonel: A Sex Scandal of the Gilded Age, and the \"Powerless\" Woman who Took on Washington. Here she tells the story of Madeline Pollard and Colonel Breckinridge, and the unlikely lawsuit that helped turn of the century America question their double standard of men, women, and sexual morality. Pollard was in a relationship with Breckinridge for at least ten years while he was married to another woman- and always claiming that were it possible, he would marry her. But when his wife died, Breckinridge married another woman instead. Madeline Pollard did what few women of the time were brave enough to do: she publicly admitted the relationship and her \"ruin\" and sued Breckinridge for breach of promise. The resulting scandal not only forced society to ask questions it had never asked before, but brought down an elected official and brought thousands of Southern women into the political fray.As fascinating as the story is by itself, Miller fills modern readers in on the backstory- the social norms of the time and those that were changing- to flesh out a complete world for her readers to understand. Women were beginning to enter the workforce in increasingly large numbers. Fathers and brothers were beginning to have to face the idea that a woman unchaperoned in public wasn't announcing her sexual availability, because their own wives, sisters, and daughters were now in those public spheres. It was not 'just' the radical women who were asking for work equality and the right to vote, or to stand up to abuses happening around them. Miller explores the economic and educational environments that had begun to change, and does a solid job of helping the reader to understand why the mid-1890s was a time ripe for the changes Pollard and others pushed for.  Madeline Pollard forced the conversation of sex into public, into politics, and into the home. She forced society to look at foundling orphanages, homes for fallen women, and the manipulations and social conventions that powerful men used to keep an entire class of women vulnerable to them. She inspired the first movement of women who (thought they couldn't vote) used their opinions and influence to ensure that a sexual predator was not reelected to a government position. Pollard and the women who financed her battle took on Washington and inspired a generation of women to demand conversations and change in society and politics, morality and ethics. The Pollard trial certainly didn't end the sexual double standard, but it did begin the conversation we still carry on today.An inspiring, well-researched, and well-written book, and a must read for all!"}, {"Review": "Colonel Breckinridge was a powerful Congressman from Kentucky, the scion of a long legacy of Breckinridges. Madeline Pollard was a teen from a respectable family whose father had died, leaving the family to ruin. She bounced from relative to relative, learning how to claw her way to some funds, trying to get an education and further her place in life. Madeline had made an arrangement with a much older man wherein if he would pay for her college, at the end of it, she'd marry him. She wanted out of the arrangement but was baffled as to how. When the eminent and knowledgeable Rep Breckinridge introduced himself to her on a train, she saw an opportunity to both get some free advice and indebt herself to a powerful man. He saw a different opportunity, and he took it. She was seventeen at the time, and he was middle-aged. They had an affair for nearly 20 years. He always promised her that if his wife died, he'd marry her. She had at least two pregnancies by him that she had to give up, and probably additional miscarriages.Then one day, his wife dies! Madeline is excited--they can finally marry! (After a respectable waiting period.) He assures her this is true. and then, he marries someone else! And so, in 1893, Madeline sued him for breach of contract. He was really broke, and it's not like she could sue for enforcement of the promise as he was already remarried. She sued mostly on the principle of the matter. A couple of times in the recent past, other women had been \"ruined\" by powerful men (one of them later became president!!) and had tried to hold them accountable, to no avail. But the times they were a'changing and it was finally occurring to people that it was patently unfair to hold men and women to wildly different standards when it came to sex, when both were involved. And the first battle in the war against powerful men misusing sex in relationships with vulnerable women was waged.This would have been a fascinating history at any time, but is even more so now, in the midst of the #metoo movement and the massive pushback against powerful men misusing sex against vulnerable women, 130 years later. Here we can see when women first made a stand and first decided they were fed up with the shockingly hypocritical social morays that created these situations. And we can see how far we've come. And how much stays the same. And we can more clearly see the road ahead, when we learn about the road behind. Madeline may not have been a perfect woman, but she was willing to stand up for herself in the face of disgrace and public humiliation, and it turns out that's exactly what was needed."}, {"Review": "Where to begin? An astonishing book that immerses us in the late 1800’s in the United States. It’s a history lesson, a snapshot of the times (post Civil War) and a page turner. It goes all the way back to the Puritans to lay some surprising groundwork about the treatment of women and to explore societal beliefs about marriage, families, and sex. The story features a famous extramarital affair (him, not her) between a young woman and a prominent Kentucky politician. It went on for 10 years. After bearing children by him, and forced to give them up, after waiting for him to come through on his promise to marry her, Madeline finds herself bereft when “The Colonel “ marries someone else. So she sues him for $50,000 and a big sensational trial ensues. It’s a watershed moment because, as it turns out, many many people are fed up with the double standard that exists for men and women when it comes to sex. Basically men can do anything they want, but if a woman is caught having sex outside of marriage, she is literally ruined. In addition, as all wars do, the Civil War changed society drastically. For one thing, there was a lack of men, so many young woman were remaining single. Also the economy was booming and needed labor. As women began working in shops, factories, and offices, they became vulnerable to sexual predators whom society and the law did nothing to control or punish. Really, as a young woman, unless you were under the protection of a husband, father, or brother, other men considered you fair game. Madeline’s lawsuit and trial gave voice to all this and the newspapers covered every sordid detail. The public devoured the story and, as it turned out public opinion was on her side. This was the time of Susan B. Anthony and feminist groups were fired up. Places that were trying to help abandoned, illegitimate babies began speaking out about their work. Women from all walks of life were fired up- from the highest levels of society to the lowest, as well as decent men. This is the Me Too moment of the 1890’s.The book has 50 pages of notes and bibliography. I can only imagine the time and work that went into this project. I feel very grateful that Patricia Miller for preserving this story."}, {"Review": "You want to read a book like this and think wow, things have changed so much in the past 100+ years. But no. It's almost depressing how familiar even the details of this story are! Could have been ripped from multiple modern headlines.Good read though. Well-researched and I liked how the author dovetailed the trial and information into a larger picture of how Madeline's story and the trial effected women and the politics of the day. And how it wasn't so much a singular thing but how sick and tired women were of the huge double-standard."}, {"Review": "It is odd that Miller uses the spelling “Madeline” instead of “Madeleine,” the spelling Pollard used in documents signed by her own hand. It is a small point, but shouldn’t you spell the name of a historic person the way they themselves spelled their name?The book is well written and it is a very important tale with a fascinating cast of characters. I know a great deal about the story. I have stood at Pollard's grave, have been in the mansion where she spent the last months of her life and even have visited her hometown. I also feel I know Jane (as she signed her letters) Tucker. Miller's research is good but she missed parts of the story. She also neglected to give credit to a scholar who has authored several scholarly pieces on the case over the last 10 years and actually discovered Jane Tucker's identity as the girl spy. The Scholar wrote a piece on Tucker's spying that was published in 2012 in the Journal issued by the organization that administers the Tucker family home. These published sources should have at least been in the book's bibliography."}], "Genre": "Crime", "ID": "35259565", "Desc": ""}