{"Genre": "Crime", "Reviews": [{"Review": "4.5*Jack Reacher is back and tougher than ever! And as anticipated, big trouble seems to be hot on his trail…Once again, Jack Reacher is traveling along the back roads of America. His way of avoiding unwanted attention. Hitch-hiking is a roll of the dice at best, and now he’s found himself unexpectedly dropped–off in New Hampshire. He finds himself drifting back in time to his childhood, his father fondly telling him all about his hometown of Laconia. It wasn’t in Jacks’ game plan, but at the cr"}, {"Review": "***NOW AVAILABLE***This is the second book by Lee Child that I have read and I definitely enjoyed this one more than the other which was “The Midnight Line”. I liked the dual storyline which converges later on in the story. However I did feel that the one with Reacher in it, looking into his “family tree” to be quite slow moving and a bit dry. The second story line with the two young people stranded finally at a more than creepy motel was the most interesting in the book.I like my characters wel"}, {"Review": "I’ve been reading the Jack Reacher series since Lee Child wrote his first. How wonderful it is after finishing #23 in the series to say it’s definitely one of my favorites!Jack Reacher, our 6’5” ex-military hero is on a journey from Maine to California and decides to take a pit stop in Laconia, New Hampshire to check out his father’s birthplace. Scanning through records at town hall and researching census from long ago bring him in contact with a lot of different characters - some nice and some"}, {"Review": "Lee Child returns with another Reacher adventure that takes things down some untraversed pathways, particularly interesting for series fans. When Jack Reacher sets out for California, he has high hopes about this journey. However, early during the trek, he ends up having to get out along the road in New Hampshire, where a road sign rattles in the wind. The town of Laconia triggers a memory for Reacher, which he soon recollects is Stan Reacher’s place of birth, a father who taught him the steely"}, {"Review": "Past Tense is an okayish Jack Reacher. I never felt drawn into it unlike the earlier ones in the series. This could be due to Jack Reacher outstaying his welcome - there are only so many plots available given the context or it could be that with every story, Jack Reacher becomes more and more like a Superman-Ninja combination. And that is a nice segue into one of the indications that Lee Child is himself aware of it. There were two separate threads in the story which meet only towards the end. A"}, {"Review": "I really enjoyed Jack Reacher's latest foray into the world. So much so that I could not stop reading and knocked off most of it in one afternoon. One of the best in the series to date!There are a number of story lines going on in this one and a lot of characters, some good and some really bad - as usual! Also as usual Jack manages to get caught up in several different issues and has to fight his way out. He also discovers some amazing details about his own genealogy which he takes much more cal"}, {"Review": "Only for the already-devoted Reacher fans and then.... The challenge for Child on book #23 is that he's already written several books in which the bad guys do unspeakable things to children, are holding one or more entire towns or communities hostage by threats of violence to anyone who steps out of line. He's also written several books in which Reacher hooks up with the FBI agent investigating either related crimes or the targets of Reacher's interest. In order to avoid duplicating these plot p"}, {"Review": "My thanks to Random House/Ballantine and Netgalley for letting me read this arc for my honest opinion.It's actually been a few years since I've read Jack Reacher. I'll confess that when I heard that Tom Cruise was playing Reacher in a movie it kind of ruined the image. Of course, I first had to spit the vomit out of my mouth, and spend a few minutes cussing. It's not that I dislike Cruise, its just that I think he's human garbage. Oh, dear me! Well, look at my little rant. How embarrassing. Not"}, {"Review": "Oh, how I love this Jack Reacher series!I’ve always felt the thinking of timing, speed, movement, sequences, and assessments was Reacher’s. From previous books, I know Reacher has that internal clock and he just knows what time it is. And he pictures how things work out before taking action. In this book, I began to think that those types of thoughts were being applied to some of the other characters. I found myself wondering if it was because there were spoilery things (that I won’t mention) go"}, {"Review": "Jack Reacher has apparently been thrilling readers for twenty years. No one told me. Although this is only my second Reacher novel (and its number 23 with a bullet), count me in as a fan. Reacher is an ex-MP who has taken to wandering the country, heading here and there for the barest of reasons. Well, he likes a puzzle and is curiouser than any ten cats. Along the way, Reacher always seems to stumble into trouble. Here, he returns to his father's hometown and decides to see his dad's old haunts"}, {"Review": "Jack Reacher always let himself get side tracked – the journey across America ended quite quickly when he saw the sign to the town where his father had been born and he’d never been. The quick visit would only take a day – right? Wrong!Shorty and Patty’s car was on its last legs and they were running behind. They had expected to make New York in the one day – no stops, no costs. But with the day drawing to a close and the car struggling, the sign on a side road which said “Motel” had them turnin"}, {"Review": "I was so happy to receive this as an advance review copy from NetGalley and the publisher as I had never read a Jack Reacher book until now. Let me just say - it was awful! I was so disappointed. The story line I found very far-fetched on both sides. I honestly kept thinking and hoping it would get better, but so sorry to say it did not. I was not shocked to see many one star reviews when I went to Amazon. I am not giving up on Lee Child's writing though, and I have a couple of his previous book"}, {"Review": "Perennial traveller Jack Reacher is journeying down to San Diego for some warm weather, his thumb is his ticket. Early on he spots the name of a New England town he recognises as the place his father grew up. Well, he’s got to take a look at this hasn’t he.In a parallel plot line a young Canadian couple are planning to drive beyond the same town but their old clunker of a car looks like it’s not going to make it much further. They pull to a stop at a motel and decide to get the car fixed and the"}, {"Review": "This was about the 10th Reacher book that I’ve read, so I certainly know what to expect from him. The books are quite formulaic and you either buy into the formula or you don’t. He’s the loner who arrives at a new town and happens upon some trouble, resulting in his brutally beating a few people and crushing some bones. There was a pretty high body count in this book, which alternated between the Reacher story, as he researched his father’s background, and a second story about Shorty and Patty,"}, {"Review": "4.5 stars, actually.Honestly, I'm not at all sure how much I'd like Jack Reacher if I met him in person because he doesn't pull any punches, but I'm certain I'd want him on my side in a fight for the same reason. And in this, the 23rd book in the series, he gets plenty of opportunity to practice his considerable skill.The story begins as Reacher walks and hitchhikes near a remote and tiny town in New Hampshire on his way to wherever else the wind (or more accurately, any driver who gives him a l"}, {"Review": "They are all so good but this one is straight out spectacular. Telling you about the tension I felt reading this one!! I had to stop at some point after about page 100 to relax with some physical work exertions to get \"unwound\" and to distract myself enough to be able to swallow my own spit. It was creepy, evil terrifying- the premise AND the execution of it.The premise is one that I've read in maybe 10 novels in my life, mostly sci. fic. but in some YA reads too, like Hunger Games.That tells yo"}, {"Review": "A skillfully descriptive and masterfully intense story with Jack Reacher and a perfect cast of characters. SUMMARYJack Reacher is just starting an epic road trip, heading from Maine to San Diego. He only gets as far as New Hampshire, when he comes to a fork in the road. Left or right? He should go left to Portsmith, but the road to the right heads to a town he has never seen, Laconia, New Hampshire. It’s the town where his father grew up. He decides to take the detour to see the place his father"}, {"Review": "If you're into stuff like this, you can read the full review.Similar Story Archs: \"Past Tense\" by Lee ChildI have said elsewhere that crime fiction seems to flourish in times of stress, such as our era now. I fully expect more great detective fiction in the near future as it is one of the few genres that can show society from top to bottom: the detective, investigator or whatever, in many of the best novels, talks to both the monied and the moneyless at the same time against a puzzling foregroun"}, {"Review": "Audiobook - 12:29 hours - Narrator: Jeff Harding, after six chapters, replaced with new copy narrated by Scott Brick.NB: This review re-written Monday 12 November. See below.It is almost 1:00 am in Melbourne, 10 November, I have just finished \"Past Tense\" and my rating initial rating is 3.5 stars rounded to 4.0 Stars out of 5.0. I have some review comments to make about this Jack Reacher novel, but I will need to have some sleep before I commit them to paper. :-)Addendum - 9:30 am, Melbourne, 12"}, {"Review": "I admit I haven't read ALL of the Reacher books but I have read quite a few and I do believe this is one of the best.In this outing, ex-MP Reacher decides to travel from Maine to San Diego and starts hitching a ride. When he reaches New Hampshire, he sees a sign for Laconia which triggers a memory and an interest in digging up some family history.As only Reacher can, he makes friends and enemies quickly and is soon embroiled in some nasty business (which makes for some very exciting reading.)In"}, {"Review": "4 Jack Reacher is at it once again starsMy reviews can be seen here: http://yayareadslotsofbooks.wordpress...On the road againJust can't wait to get on the road againThe life I love is making music with my friendsAnd I can't wait to get on the road againOn the road againGoin' places that I've never beenSeein' things that I may never see again (Willie Nelson)Jack Reacher is once again a traveling man. His goal is to walk from Maine to California (yikes) and so when he travels onto a road in New E"}, {"Review": "I am a huge Jack Reacher fan and this book did not disappoint! This book was different from Lee Child's other books and I liked it! There were two seemingly unrelated storylines going on and I spent most of the book trying to figure out how they connected. Also, the plot was not at all predictable and kept me guessing the entire time! Thank you NetGalley for the ARC! This was a great read and I would definitely recommend it!"}, {"Review": "More edge-of-your seat action from Lee Child. Jack Reacher once again finds himself in the middle of a strange situation. True to form, Reacher once again manages to find trouble when he sets out to help others.A young couple, having car issues, finds themselves stranded at a rather strange motel in the middle of nowhere and there are some suspicious things happening. In the meantime Jack Reacher is walking/hitch-hiking his way across the country from Maine to California when he becomes side-tra"}, {"Review": "Our itinerate hero Jack Reacher is headed from Maine to San Diego and decides to make a visit to Laconia, New Hampshire, where he heard his father grew up. Before he died, he never did share with Jack much about his childhood beyond the fact that he ran away from home and joined the Marines in World War 2. All he remembers is him talking his father Stan having a position with a tin plant of some kind. While Jack explores family history in town, we are treated to the misadventures of a poor, youn"}, {"Review": "Unique and inventive!! Great story! ~~~~~~~~~~~~~~~~~~~~~~~~~~Being that I’m coming in fresh on a long running series, I had a little bit to learn about Jack Reacher. What I have gathered here is that he is one person you do not want on the wrong side of you.With a history of military and military police, Jack finds himself in a predicament as he begins his journey from Maine to San Diego. I love his theoretical mind and how he’s able to think his way out of problems and issues. Almost like fore"}, {"Review": "First and foremost, my thanks to the author, publisher and NetGalley for the ARC of PAST TENSE. Mr. Child has written another suspenseful Reacher installment!  Per his wrting style, the exposition is methodical. However, in PAST TENSE the build up is slower than usual due to the lengthy, picayune details. The reader can guess where this first storyline is headed early on and the (albeit slow) and steady build up piques the reader’s curiosity and tickles the spidey-sense, which builds up the susp"}, {"Review": "Two mostly unrelated stories, based in Laconia, NH, that converge about three quarters of the way through to me in a seemingly forced manner. One is slightly interesting, the other an overused and completely predictable trope. Jack Reacher is hitchhiking from Maine to San Diego, and decides to go through Laconia, his father’s birthplace to examine his roots. Very little can be found in the public records, except that it seems that Stan's predilection for justice was passed on to son, Jack. Jack'"}, {"Review": "I received this as an ARC from the publisher, who is well aware that I've read every Lee Child book as a proof since the first one, twenty years ago. Some are better than others in my view, and I think this is one of the best. It has the pleasing simplicity of the early Reacher books - the uncluttered landscapes, the quirky perspectives - and unlike some of the author's later books, which try to vary the formula by relocating Reacher to Europe, or going back too far in time, this one hits the ma"}, {"Review": "3.5 stars"}, {"Review": "Easily one of my favorite Reacher books to date. It had everything I love about one of my favorite characters in literature inside a taut, mystery-cloaked thriller.Excellent pacing, nail-biting tension, likable/despicable characters, and Jack Reacher being his usual unflappable self in the midst of it all.In Past Tense, Jack Reacher visits a small town in New Hampshire to hunt down information on the town where his father grew up. However, he ends up involved in a different kind of hunt altogeth"}], "ID": "34019122", "Name": "Past Tense"}