{"Name": "The Sentence is Death", "Image": "https://images.gr-assets.com/books/1535195084l/39913740.jpg", "Reviews": [{"Review": "Hawthorne is back with his rather abrasive personality and his undoubted skill at finding clues and solving cases. Horowitz features again as himself acting as Hawthorne's sidekick attempting to solve not one but possibly two murders.Having the author actively involved in his own book makes for some interesting reading. Occasionally I sat back and wondered which bits were fact and which fiction, but in the end it really does not matter. The book is totally enjoyable and very easy to read. There is a good story, well paced and interesting. The clues are all provided and although there is a surprise ending I managed to guess the culprit before Horowitz did.Altogether an interesting and entertaining read and I am looking forward to the return of Hawthorne in #3."}, {"Review": "Full review hereSentence is Death starts with the murder of a divorce lawyer and Horowitz sets to write a second book of this case alongside working with Hawthorne. The victim had been threatened by a well-known, award winning and fiercely literary writer and his husband seems to be hiding things… Of course, there are also issues from the past that bubbles up in surface of the case. Who visited the victim before he died, and why is there a number on the crime scene? This was such a fun read, and I genuinely can’t wait for the 3rd book. I really feel desperate to know more about Hawthorne, as much as poor Horowitz in this book."}, {"Review": "This is the 2nd novel in the Daniel Hawthorne, Private Investigator series by Anthony Horowitz.I have not read the 1st book 'The Word is Murder' nor in fact any other books by this author but quickly realised once I started this novel that times were going to change. I was so impressed and enjoyed reading this book that I had already purchased a couple of the authors other books before finishing it.For me the book had a feel of an older style of detective novel, maybe an Agatha Christie or more likely Arthur Conan Doyle. Witty, well plotted and some excellent characters. I found the book a light read but intriguing and very enjoyable.The setting of the novel is a little bit unusual with the author being one of the main characters. In the novel Anthony Horowitz is invited to write about the retired detective Daniel Hawthorne who still helps the Police solve difficult cases. Anthony tags along Hawthorne in much the same way that Hastings followed Poirot or Watson, Holmes, aiding and abetting along the way. The plot in this novel surrounds a divorce lawyer who has been murdered using an expensive bottle of wine and Hawthorne is invited in to assist.This is an intriguing read that is a refreshing change from some of the darker novels I also enjoy.I would like to thank Net Galley and Random House for supplying a copy of this novel in exchange for an honest review."}, {"Review": "Anthony Horowitz never disappoints!Richard Pryce, a high profile divorce attorney, is murdered in his home, bludgeoned to death with a two thousand quid bottle of wine, which is strange in itself as the victim didn’t drink alcohol. Even stranger, written on the wall near the body are the numerals 182. What does the message mean? Hawthorne and Horowitz are called to investigate. As per usual I was hooked from the onset, and couldn’t put the book down. Interesting and engaging characters, a suspect who threatened the victim with a wine bottle in the weeks before his death, two seemingly accidental deaths, past secrets, corrupt detectives, and a behind-the-scenes look at what goes into shooting Foyles’s War made this a compelling, addictive read, and a wonderful addition to an amazing series. There was a brief moment of uncertainty when I wondered if the mystery was going to be too predictable, but I should’ve known better, because not only did the plot go in a completely different, unexpected direction, but there was also a surprising revelation unveiled at the last second.I’m not sure how similar the real Anthony Horowitz is to the one portrayed in the books, but I just adore the way he pokes fun at himself. There are some hilarious moments as Horowitz not only attempts to outwit and solve the mystery ahead of Hawthorne, but also tries to discover more about the man as a person. Hawthorne is his usual un-charming and unhelpful self, annoying Horowitz to no end right from his first appearance. Just like The Word is Murder I love the chosen title The Sentence is Death, and how it was woven into the plot. Horowitz continues to be one of my favourite current writers. He could write about paint drying and I’d lap it up. The king of the modern Agatha Christie style murder mystery."}, {"Review": "4.5 stars Once again (again), Horowitz does not disappoint. I can honestly say that I will read whatever this man writes because he has a way of writing that is so hard not to love. It’s impossible. Both Horowitz and Hawthorne are in this novel, and I just want to say that their partnership is a very weird one. I wouldn’t call them friends, but they aren’t so much acquaintances? It’s so hard to describe what they are but that’s the fun think about their partnership. In this novel, we are introduced to a new character, Detective Cara, which you will easily despise. She is the protagonist of this novel and I can honestly say that I would’ve liked her to be killed off. The plot was once again extraordinarily twisty and it’s such a fun read! Horowitz’s murders are always fun to read because it’s a little funny how Horowitz tries to figure it out before Hawthorne every time. I do wanna say that it’s not a plot that you will figure out and I was very shocked when all was revealed. I could read Horowitz all day everyday, his books are just that amazing. The thing that I love most about every Horowitz books is how he writes himself as a writer. It’s just so interesting and it’s a very risky move but it works so well with the whole novel. It even makes it a little more enjoyable to read in a way. I would’ve liked to learn a little more about Hawthorne since we don’t really know who he is at all aside from this foul mouthed ex detective. I was almost sure that we would get a glimpse of what his childhood was like, but sadly we didn’t. Overall it’s a very good mystery with the best set of characters. One you will enjoy for sure! Thank you Penguin Random House and Century Books for providing me with an advanced copy in exchange for my honest opinion."}, {"Review": "The Sentence is Death, the second novel to feature ex-policeman and Private Investigator Daniel Hawthorne, has an old-school, authentic atmosphere to it much like the crime classics of Agatha Christie and Arthur Conan Doyle. Horowitz focusses on mystery, suspense, intrigue and keeping it clean, rather than gratuitous violence or profanity, so if you like your reads clean, then this is a fantastic choice!Here, the author pairs up with Hawthorne to investigate the suspicious death of divorce lawyer Richard Pryce, and with many interesting characteristics, Anthony and Daniel race against time and against the police to solve the crime. As always, there are plenty of suspenseful moments, red herrings and discreet clues to whet your appetite but stop short of revealing too much. Hawthorne is a superb character, irritating and more than a little odd, but he is a proficient investigator and that's all that really matters in his line of work. His views are certainly outdated and likely to rub people up the wrong way. He sometimes comes across as having accidentally stepped out of the 70s or 80s into the modern day! Horowitz's use of the novel as a device for getting out some of his annoyances regarding the publishing world is a work of genius and an excellent and non-confrontational method in which to do so - biography masked as fiction!With a masterfully executed plot, exceptional characterisation and lots of unexpected surprises, I hope the following additions to the series are just as engaging! The author using himself as a character is most refreshing and certainly a unique selling point!Many thanks to Century for an ARC. I was not required to post a review, and all thoughts and opinions expressed are my own."}, {"Review": "I adored, “The Word is Murder,” the first in the Daniel Hawthorne series, and was delighted to receive the second, “The Silence is Death,” for review. As before, Anthony Horowitz, or ‘Tony,’ as Hawthorne calls him, is very much telling the story as himself. Horowitz is working on a television series when the book begins, and Hawthorne’s reappearance is cleverly introduced – his arrival causing unintentional mayhem and annoyance. As before, Hawthorne is wonderfully irritating and yet has a bizarre fascination for Horowitz. A sort of Seventies throwback, with definitely non-politically correct views and language; Horowitz finds him exasperating and is yet admiring of his ability to solve the most bizarre of crimes. Indeed, when Hawthorne states they have another murder to investigate, you know it will be something special. A divorce lawyer, Richard Pryce, has been murdered with an extremely expensive bottle of wine. This bizarre murder sees the pair becoming immersed in the investigation, with Horowitz gleefully having a lot of fun with the world of publishing. Pryce had been involved in a celebrity divorce, involving the author, Akira Anno, a writer of literary fiction, who visibly sneers at Horowitz. However, the divorce is only one possible strand of the investigation. This is a brilliantly executed plot, full of twists and turns. One motive involves the case that the lawyer was working on, then there is an incident in the past which may be involved and, then again, there are the usual issues with personal relationships and money. Along the way, Horowitz also tries to find out more about Hawthorne’s past and longs to solve the mystery before anyone else, while falling foul of the aggressive D.I. Cara Grunshaw and trying to juggle all of his writing commitments.I really feel that this is growing into an excellent series. In the novel, Horowitz claims to have a three book deal, writing about Hawthorne. You can only hope that he will continue the series beyond that point. It is a joy and I love the way that the author manages to insert so much of his own experiences, albeit in a fictional way, to create such an enjoyable read. I loved every part of the novel set around the world of publishing in particular, but every page was wonderfully enjoyable. I do feel that Daniel Hawthorne has a lot more to offer. Highly recommended. I received a copy of this book from the publisher, via NetGalley, for review. "}, {"Review": "\nI've not read THE WORD IS MURDER, book one in this series, but I definitely want to after reading this one!\nTo be honest didn't I know a damn thing about the story before I started to read/listen to this book (yes I tend to mix it when I have the chance, listen at work, read and listen at home). And to find that Anthony Horowitz has written two books with himself as a character was a great joy (such a fun idea). He's like Private Investigator Daniel Hawthorne's own Watson. Although, their working relationship is a bit strained. Anthony isn't even sure he likes Hawthorne that much. I, however, find both of them enjoyable.Anyway, there has been a murder and Anthony and Hawthorne is out to find out the truth. Anthony also struggles with an episode of Foyle's War (love that series, this book made me wanna rewatch it). As a new reader to this series was this my first encounter with the characters, and I loved getting to know them. And just like Anthony do I want to know more about Hawthorne. I had a blast reading this book and I although I saw one of the big twists a mile away did I really love the ending of the book!\nTHE SENTENCE IS DEATH is definitely a book that I recommend and I can't wait to read the first book and the third book when it's published!\nThanks to the publisher for providing me with a free copy through NetGalley!"}, {"Review": "If you a) like a baffling mystery and b) you’re a fan of Hercule Poirot then c) it is dead certain this novel will please you.I didn’t know at first but The Sentence is Death is actually the second in a series following PI Daniel Hawthorne and the writer, Anthony. That’s exactly right, the author of this novel is also acting as a main character, following the PI around in order to write a book (this book) about him. This infusion of some veritable facts mixed with fiction made it quite an exceptional reading experience. What was told felt very realistic and authentic and Anthony’s first person POV made me feel as if I really came to know the author’s very thoughts, quite a contrast with the closed-off PI Daniel Hawthorne.Anthony Horowitz wrote several episodes of Poirot so it’s no wonder this novel was exactly my cup of tea. It does lean more towards the cosy mystery genre for me, a little lighter than the crime novels I usually read but I really liked the mystery, or should I say mysteries because there is not one but two cases to be solved.The story was complex enough to keep me highly entertained and much like Tony himself I was trawling behind Hawthorne and didn’t see the clues. Even though everything was written down word for word what was happening when they interviewed everyone involved, I couldn’t figure out the connection – if there even was one – between the puzzling murder of divorce lawyer Richard Price and another suspicious ‘incident’.There was a lot of guesswork because the novel could go forward in two very different directions with very different suspects. Did the past catch up with Price or was it indeed, as was their initial thought, one of Price’s clients? I had no idea which path it was going to follow, it was very cleverly written to keep the suspense to a maximum and it made me excited to find out the truth.I was also surprised, and very pleasantly so, the novel was set in a world of books and publicists and writers. Anthony’s character lends itself of course to dive into this world but there’s another character who’s a writer and so he finds himself in a bookshop, talking to a publicist and talking books. He refers to his first novel, The Word is Murder, a few times because that’s where he starts his cooperation with Daniel Hawthorne but I didn’t feel I missed anything and this novel is a good standalone.The Sentence is Death was a puzzling but entertaining murder mystery. Even though I haven’t warmed yet to Hawthorne, who is the only remaining mystery in this novel, I look forward to reading the third novel in the series already."}, {"Review": "Book reviews on www.snazzybooks.com The Sentence is Death is another brilliant novel from one of my favourite authors, Anthony Horowitz. I particularly enjoy this series as it's definitely different from most other 'crime' novels; I love the self-aware style of writing. Anthony Horowitz writes as himself, having been employed to write three books about ex-Detective Hawthorne. This is the second - the first one being The Word is Murder, another great novel [read my review here] - and throughout Anthonoy includes references to his life as a writer, his family and much more. It really feels like you're reading a story that's really happened, and I love the way Horowitz vents his frustration with people and the book industry in general through The Sentence is Death's pages (I loved the part where it's suggested he should \"write a Bond next\", to which Horowitz admits it's something \"I'd wanted to do all my life\" - and, of course, he has now written \nForever and a Day\n!)Both 'characters' of Hawthorne and Horowitz are brilliant, though Hawthorne is, at times, deeply flawed and an unlikable character - there are MANY things about him I dislike, and yet I can't help but want to read more about him because the story is told through Anthony Horowitz's humorous, entertaining voice.The plot is just as enjoyable as The Word is Murder, and though there are some (I feel) obvious parts that I did sort of see coming, there were also some really clever surprises as the story went on.This novel is satisfyingly self-aware, really clever and definitely entertaining - I loved every page. I'm already looking forward to book no.3!Many thanks to Cornerstone for providing a copy of this book on which I chose to write an honest and unbiased review."}, {"Review": "Private Investigator Daniel Hawthorne returns in the sequel to The Word Is Murder. Once again he teams up with sidekick Anthony Horowitz (the author himself) and once again they are on the trail of a murderer.As with their previous adventure there is plenty of humour, most of it at the author's expense! I love the eloquent plotting & the nice mixture of what I feel must be the \"real\" Anthony Horowitz & the \"fictional\" one. However, what I like most is that this novel is quite simply Fun with a capital F!!"}, {"Review": "I like Anthony Horowitz books and this one was pretty different to the others I've read. Basically it's more of a slow-burn mystery. More of an Agatha Christie or Sherlock, old-style detective story.The core mystery seems to be based on a true story, though it was difficult to understand whether the elements (letters, historical articles etc.) which were added in to the story, were actually 'real' or part of the fictional book (I found this lack of clarity annoying, though perhaps it was my lack of understanding??).The story follows a writer as he tracks the work of Detective Hawthorne. Hawthorne is aloof and a bit odd. He solves the case (of course) and the writer is trying to do the same and lagging behind horribly. The mystery was interesting enough and clear enough, and there are plenty of potential suspects. However, the story lacked tension for me and was not as riveting as I'd have liked. Well described characters are this author's strong point and this book does not disappoint. The other interesting point about this book is the fictional writer in the book seems to be styled on Horowitz himself (his name, where he lives, his experience of living in London and working as a famous writer etc.). This definitely added interest for me and might even have been a bit more interesting than the actual mystery. Summary - this is well written and a decent mystery. The curiosity element of having Horowitz making himself a character in it is probably the biggest attraction because the story is a bit slow. 3.5 stars for me, rounded up to 4."}, {"Review": "Horowitz has kept the promise he created in his first book in this series, alive and well in the second one. My only sadness is that I have no more Daniel Hawthorne to read at the moment and must wait for 'Tony' to write some more.The way he mixes up reality and fiction has me with my finger on my kindle and another on my search engine checking things out. Me, another Sherlock in the making.Now to the story. Horowitz gives the clues then he does his utmost to confuse you and make you forget them or disregard them, then 'ta da' we get the crescendo at the end."}, {"Review": "Visit the London locations in the novelI remember the feeling I had when I read the first of the novels where Anthony H appears as a character in his own novel. Wow I thought, did that just happen? Well it did and this is a second one just as good as the first with a twisty tale of intrigue.It's a fascinating angle for a book as Horowitz writes of his issues of waiting around on film sets, how writers might be on a film set . As the book opens he is - on the set of Foyle's war no less when Michael Kitchen walks by. This is surreal on many levels as he writes himself as a character in the book. It messes with your head but I love it!This is a very twisty tale and full of good old fashioned detective work - a series of strange numbers daubed on a wall, an expensive bottle of wine, a murder and some dark goings on in and around Hampstead Heath. The Old vic gets to play a challenging role if you excuse the theatrical pun.Surreal and insightful in equal measure. And a darn good twisty plot."}, {"Review": "If you’ve not read The Word is Murder yet then I highly recommend you do so before starting this book. The narrative is so unexpectedly crafted that I don’t think you could just jump into book 2 of this series without reading the first book to feature Hawthorne, a unique detective who could give Sherlock Holmes a good run for his money any day of the week!Once again a baffling murder case means the police call in Private Investigator Daniel Hawthorne and he takes along his partner in crime, the author Anthony Horowitz, with the express intention of getting him to then being able to write book 2 about his cases. Now this is where it gets a little confusing for the reader because Anthony is the author himself who then also writes himself into the narrative in an autobiographical style. This took me a while to get used to in the last book as I wasn’t sure if what was happening really had happened due to the author bringing in his own lifestyle as plot points within a fictional setting!I really enjoyed this classic Murder mystery with a twist. There are clues along the way but also red herrings galore and I had absolutely no idea who the murderer was until it was properly revealed near the end. When a man is murdered using a very expensive bottle of wine and a clue is written on the wall beside him, it falls to Hawthorne to work out who and why, ably assisted by the author Anthony Horowitz who will then use the investigation to write his next bestseller based on Hawthornes experience…if Horowitz can stand his company this time!I love these characters and really do hope that this series is adapted for television. I even have the perfect actor lined up in my head to play Hawthorne ( the sublime Rupert Graves who I had in my head for this character as soon as I met him in The Word is Murder!). These books are wonderfully written crime mysteries that definitely need to be read to be appreciated for their unique approach to modern day crime solving.Highly recommended by me!"}, {"Review": "This is the second book in Horowitz’s Hawthorne series. It’s not absolutely necessary to read the first book, The Word Is Murder, before this one, but I would strongly recommend it. That’s in part because this series has an unusual premise that’s explained in more detail in the first book. The premise is that Anthony Horowitz, the author, is writing a fictional series in which Hawthorne is a sort of a downmarket Sherlock Holmes-ish genius, with Horowitz himself acting as Hawthorne’s Watson. Not only does Horowitz insert himself in the novels, but he has his book character talk a lot about Horowitz’s real-life work as an author and the creator of television series, especially Foyle’s War. This is the kind of meta thing I usually roll my eyes at, but I enjoy it in this case.Hawthorne is a former police detective who now consults for the Metropolitan Police when they run into a particularly high-profile or difficult murder case. In the first book, The Word Is Murder, Hawthorne almost bullies Horowitz into agreeing to write a book about Hawthorne and his detection methods. Horowitz tags along when Hawthorne is called in on a case and, much to the frustration of both men, he tries to work the case too, rather than just take case notes for the book to come.That first case is solved, Horowitz has finished writing the book and just the arrival of the publication date awaits. This gives Horowitz time to get back to one of his many other projects, writing scripts for the Foyle’s War series. But Hawthorne, in his usual single-minded inconsiderate way, crashes onto a Foyle’s War scene being filmed in London. He wants to drag Horowitz away to join him as he sets off to the scene of a murder that he’s just been hired to work on. The murder victim is Richard Pryce, a divorce lawyer (insert lame jokes here). Pryce not only has made many enemies in his work, but also was part of a tragedy years ago that resulted in the death of a close friend. The investigation doesn’t suffer from a lack of suspects and, as with the first book in the series, Horowitz skillfully leads the reader down a path that twists—and several times turns back on itself when Horowitz spots inconsistencies, makes connections others haven’t seen or recasts the accepted meaning of some plot element.The mystery plot is fascinating and really makes the book, but the story was almost ruined for me because of one element. One of my pet peeves in crime fiction is the all-too-common depiction of police detectives behaving like total jerks to witnesses and especially to non-police investigators. Even though Horowitz the character notes that in his experience it’s unfair to portray police detectives as aggressive or corrupt, what does Horowitz the author do in this book? You guessed it: he features that very thing. Detective Inspector Kara Grundshaw the Metropolitan Police’s chief investigator assigned to the case, is physically and verbally abusive to the Horowitz character. It happens right from the get-go, continues throughout the book and is completely over the top. Worst of all, there doesn’t seem to be any reason for it than to create conflict. I just hate that ginned-up conflict stuff.I did have a few other smaller problems with the book, though they didn’t interfere with my overall enjoyment. First, in an early scene Hawthorne and Horowitz discuss Horowitz’s having misplaced his cell phone. Then, just a short time later the same day, Horowitz uses his iPhone. Hmmm. My next problem is that several times people mischaracterize a threat made to Pryce by the ex-wife of one of his clients. My final criticism is the fault of the publisher, not Anthony Horowitz. This isn’t a plot spoiler, but I don’t want anybody to worry that it might be, so I’ll put it in spoiler quotes. (view spoiler)[In the book description, it says that the last known words of Pryce, said to someone at the door just before his murder, were “You shouldn’t be here. It’s too late.” Well, no, this isn’t what he said. Instead, as is repeated several times in the book, he actually said “What are you doing here? It’s a bit late.” Is it so hard to get that right? I think most mystery readers would be annoyed at a misquotation of the victim’s last known words, whether or not it turns out to be important to the plot. (hide spoiler)]A note about the audiobook: If you do decide to read this book, and I hope you will, you’d be better off not choosing the audio version. The reader, Rory Kinnear, does a fine job with Horowitz and Hawthorne, but not so well with the other characters. Mostly they’re just less well done, and with some odd voices and tones that are inconsistent with the book’s description. But his reading of DI Kara Grundshaw is a travesty. She’s described as having a “heavy” voice, but Kinnear gives her a ludicrous screechy voice that’s completely distracting."}, {"Review": "A captivating whodunnitThis is the latest and second in the Daniel Hawthorne series. I haven’t read the first but this in no way detracted from my enjoyment of this novel. Hawthorne has been brought in to investigate the murder of Richard Pryce, a high profile (and expensive) divorce lawyer whose throat has been slashed by a broken bottle of very expensive wine. His capacity in investigating the crime is a little vague, but it is crystal clear that there is no love lost between him and the senior investigating officer, Cara Grunshaw (what a great name – almost Dickensian). The likely suspects are lined up for the reader and the investigation begins. Hawthorne has a sidekick who fancies himself as a bit of a sleuth. Anthony has agreed to write three books for his publishing house around the exploits of Hawthorne but, after the first case, has become increasingly unwilling to complete his contract. Will this be the case to change his mind? Theirs is a bit of a love/hate relationship, and I was wondering which way it would go.I thoroughly enjoyed the story, despite having worked out who the killer was by the time all the various threads were being drawn together. Hawthorne and Anthony are a present-day Holmes and Watson – the one being an observant professional and the other being a professional out of his depth. It’s a good set up and one that still works well.All the clues are presented to the reader who finds himself racing, along with Hawthorne, Anthony and Grunshaw, to be the one to solve the murder first. The dialogue is excellent and develops the somewhat turbulent relationship between the two main protagonists very well but it’s the mysterious background of Hawthorne which led me on and wanting more. The murder investigation for me was almost a sideshow at times. Clearly, something of Hawthorne’s background was revealed in the first novel, and we get to learn a little more in this one. It’s an excellent mechanism to maintain the reader’s interest and one which is used perfectly by Horowitz.The sidekick author has been contracted to write three books – I can only hope that the contract is extended. Great reading.mr zorgBreakaway Reviewers received a copy of the book to review"}, {"Review": "Once upon a time, there was a woman scrolling down her Twitter feed. Her heart missed a beat when she spotted a cover. You know all about cover love, don’t you? Well, The Sentence Is Death proudly wore her favourite colour, so the woman clicked on the link and discovered a very interesting blurb. Then, something wonderful happened.\nThe kind book fairy Sarah Harwood offered to send the woman a copy of this beautiful book in exchange for an honest review. This post is a thank you and a have a wonderful end of the year to Sarah and the team.\nThe Sentence Is Death. The title only reminded me of Agatha Christie books or Sherlock Holmes adventures. Intriguing, with a taste of good mystery and great writing. Before I opened the book, I knew I was in for a treat. And not just because I love the red on the cover. The combination of a short synopsis and a hardback had me wondering what was hiding in all those pages (yeah, all hardbacks are big to me, I have small hands, so my big eyes were angry for all the pages!)A book within a book. Been there? Yes. But Anthony Horowitz takes a cocktail and adds a special ingredient that makes his series entirely unique! I’ll come back to this later.First, I want to talk about the opening. I was totally thrown by it. It felt so disconnected from what I was expecting, what I had been led to find, that it took me the entire chapter to find my feet. The effect was good. I was intrigued, I was an extra walking in on a scene I wasn’t supposed to be in. I loved it. Best surprising first chapter! Also, I loved the fact that we don’t jump straight away into a case. It is nice to meet your new book friends first in a different setting!Now, back to the book within a book. I have seen lots of different narratives, I have let them take me to wild trips down scary, bloody, teary lanes. But I don’t remember reading a novel in which the real author is actually a character in his own book. Mind blown. I didn’t know about this detail when I started reading, so when I realized, I was marveling at the genius idea. The thing is, having a good idea is great, right? But if you don’t have the tools to exploit its potential to its best, then it can go sour very quickly. Don’t worry, we are in terribly good hands with Anthony Horowitz. So, what should you expect from The Sentence Is Death? A clever plot. You need it in mysteries, it’s a given. Hints. I love going on a hunt. I applaud myself when I find one, but usually, the authors are so good at wrapping them in the smallest details that I fail. It doesn’t matter. I go into this kind of books like a kid runs to the garden to find the eggs left by the Easter Bunny. I don’t really want to eat the eggs, I just want to follow the trail and have fun. Believe me, The Sentence Is Death is … deadly entertaining! And not just because of the skillfully weaved plot. No, what makes this novel a delight and one of my favourite reads of the month is the interactions between Tony and his detective, the oh-so-special Daniel Hawthorne. If I had to choose between having a Watson or a Tony, I’d go for the latter, for his humour, his take on life, and his general reaction to Daniel and the events occurring throughout the book had me feeling close to him. No distance, no ‘those are clever brains with a different look on life and the keys to every mystery’. Tony is trying to make a living, he has deadlines, he doesn’t want to put his life at risk. He doesn’t appreciate all of Daniel’s schemes of ways of doing things. Tony is refreshing. His voice is clear, enjoyable, totally relatable, and so, so brilliant. It takes resilience and some craziness to be able to work with Daniel. The guy likes to put on a show but there is a cloud of mystery around him. Not something that is seducing and makes you want to worship the guy with the answers. No, some sense of danger, of oppressive secrecy that could be the death of him one day! Both guys sounded so different yet so real, so good in the roles that have been given to them that my heart broke when the time to say goodbye came. The Sentence is Death is an utterly absorbing, completely captivating, and absolutely delightful read, perfect no matter your mood! "}, {"Review": "I read this book through The Pigeonhole, a free online book club and read it with other readers on the web. It was split into 10 parts, called staves, that I read through the nifty Pigeonhole App. I was able to leave comments throughout and interact with the other readers.Even though this is the second book in the Daniel Hawthorne series, this was my first outing with the author and his detective acquaintance, and I really enjoyed it.I’d recently heard the author on the Simon Mayo’s Books of The Year podcast, so I was able to read this with his voice in my head, making it an even better reading experience. I thought it was a fun way to write a murder mystery, putting himself in the story and trying to work out who the murderer was.I didn’t work it out, even coming up with some wild theories towards the end, nothing new there you might add!I’ll definitely be reading the next one in the series. I’d also like to read the book before this as I’d love to know how the author got mixed up with the enigmatic Daniel Hawthorne."}, {"Review": "I enjoyed The Sentence Is Death – probably rather more than its predecessor The Word Is Murder. It can be read as a stand-alone book, but it may help to set the background if you read The Word Is Murder first.Anthony Horowitz, narrating as though these events really did happen to him, is again roped in to “help” and write the story of the enigmatic ex-detective Hawthorne as the police call him in to assist with the investigation of the murder of a divorce lawyer in his Hampstead home. Needless to say, a complex plot ensues involving an old caving accident and another death, as Anthony tries to make sense of it all while Hawthorne makes Delphic remarks and asks apparently irrelevant questions. It’s a lot of fun. There is more than an echo of the Holmes/Watson partnership here – which Horowitz acknowledges with plenty of references to Holmes stories – and it works very well. He also has fun at the expense of literary pretension and some of the clichés of detective fiction, but at bottom it’s a well constructed mystery which is, as you’d expect from Horowitz, very well told. (And I’m pleased to say that, while the usual slight suspension of disbelief is necessary, the ending is much less far-fetched than in the first book.)This is a fun read which is also rather gripping and holds some entertaining puzzles, too. Recommended.(My thanks to Cornerstone for an ARC via NetGalley.)"}], "Genre": "Crime", "ID": "39913740", "Desc": ""}