{"Name": "The Godfather", "Image": "https://images.gr-assets.com/books/1394988109l/22034.jpg", "Reviews": [{"Review": "Mario Puzo wrote The Godfather, a book that was to become an instant classic, at a time when both his personal life and that of the United States were in transition. Puzo's first two novels had not sold well, and he was almost penniless. A young, up and coming author, Puzo sought to write his version of the great American novel that would also work well on the silver screen. Meanwhile, in a time of war, the nation was beginning to view the mafia rather than Cowboys as the great American hero. According to afterward author Peter Bart, America's perception of the mafia as positive citizens is what allowed Puzo to thrust The Godfather into the forefront of American society. As someone who has never experienced the award winning film starring Marlon Brando and Al Pacino, Don Corleone and the world he created were new to me. Vito Corleone had immigrated from Sicily to New York in the early 1900s, and, after a few lucky breaks, quickly established himself as one of the leaders of the crime underworld. Using his olive oil import business as a cover to make himself look like a law abiding citizen, Don Corleone's empire grew through his connections with politicians, police, and other officials. Along with his consigliere and caporegimes, Corleone instilled respect and fear into those who dared go against the most powerful mafia family in the nation. Being a mafiosa has its costs, however. Corleone's wife through forty years of marriage was never able to be his equal partner. The mafia and everything that went with it was kept secret and separate from family life. Crimes split apart families, forged both likely and unlikely alliances, and one never knew who he could trust. Despite the awe with which people viewed the Don, even he did not feel safe outside of his self-made mall fortress on Long Island. As a result even his wife, daughter-in-law, and especially son-in-law were kept out of the business that was to remain for all times in the family. The one protagonist who questioned the function of the mafia yet never wavered in his support of his family was the Don's youngest son Michael. A war hero and Dartmouth educated, Michael Corleone desired that his future children and grand children would be lawyers, bankers, maybe even the president, rather than have to go into the family business. Rather than marrying a Sicilian girl, he chose as his life partner a New England Yankee named Kay Adams. The two experience unconditional love yet even Kay, an Ivy League educated woman of the baby boom generation, is not told everything that occurs within the business. Like his father before him, Michael Corleone differentiates his marriage from his place in the family business. As a Chicagoan, I always associated the mafia with Al Capone, the top Italian crime lord of the city. Viewed in a negative light, Capone alone was responsible for outsiders negative perception of Chicago for many years. Even Puzo and Don Corleone view Capone as an outlier, a crazy who is not invited to be part of the national network of Dons. In Don Corleone, Mario Puzo has created a persona who shifts people's views of the role of the mafia. While there might be killings in revenge on occasion, the Don assists his people in a time of need in the role of an inner city Italian Robin Hood. Some of the activities may be illegal, yet they are overlooked as even rival crime families view Don Vito Corleone with nothing but the utmost respect and reverence. Following The Godfather's debut on screen, Mario Puzo never again rose to a high level of prominence. He was known as an extension of the character he created and often asked to impart words of wisdom on the Don's behalf. After three sequels, including the second part which also garnered awards, Puzo's ground breaking work lead to generations of mafia and crime family movies, most recently the Sopranos. Yet, there would be no Tony Soprano if Mario Puzo had not created Vito Corleone and his world, changing people's views of the mafia. I rate this captivating, game changing novel 4.5 stars. Afterward:After viewing the movie for the first time, I am impressed how closely it stuck to the book down to the minutest detail. For a three hour movie, the scenes moved quickly leaving me captivated and on edge. I found the acting to be stellar, especially Don Corleone himself Marlon Brando. Even if Puzo's other novels did not receive as high ratings, I am looking forward to The Godfather Part II. Puzo and director Francis Ford Coppola indeed made a perfect team and left Americans with a true classic. "}, {"Review": "English (The Godfather) / ItalianoNew York, 1945. The Italian-American boss Vito Corleone, during the celebrations for his daughter's wedding, agrees to meet some Italian emigrants that ask for his help. Thus begins Mario Puzo's masterpiece, whose movie adaptation made Marlon Brando's interpretation of Don Vito famous. With a simple and straightforward style, Puzo manages to masterfully describe a series of intricate and temporally shifted events, involving the reader and maintaining high levels of suspense. It comes out the best cross-section of the Italian-American subculture never done before, and probably never equaled.The wisdom of Don Vito Corleone is disarming, it arouses feelings of respect also in the readers, making the godfather one of the most charismatic characters ever.Vote: 9New York, 1945. Il boss italo-americano Vito Corleone, durante i festeggiamenti per il matrimonio della figlia, acconsente a dare udienza ad alcuni emigrati italiani che invocano il suo aiuto. Inizia così il capolavoro di Mario Puzo, la cui trasposizione cinematografica ha reso celebre l'interpretazione di Marlon Brando nei panni di Don Vito. Con uno stile semplice ed asciutto, Puzo riesce a descrivere in maniera magistrale una serie di eventi intricati e temporalmente sfasati, coinvolgendo il lettore e mantenendo altissimi i livelli di suspense. Ne viene fuori il miglior spaccato della società italo-americana mai fatto prima, e probabilmente mai eguagliato in seguito.La saggezza di Don Vito Corleone è disarmante, suscita rispetto anche nei lettori, rendendo il padrino uno dei personaggi di finzione più carismatici di sempre.Voto: 9"}, {"Review": "لقد اقتبست شخصية العراب من والدتي التى احببتها كثيرا و خفت منها أكثر...مقولة لماريو بوزو  ~~~~~~~~~~~~~~~~~~~~~فيتو كورليوني ..البادرينو الرجل في صورته الاولية..الاب الذي لا يهزمه شيءقاتل .. ودود سارق..عادل دكتاتور ..جذاب قاسي..لطيف عنيف..فاتن ♡♡العروض هنا لا يمكن رفضها♡♡ كل هذه المتناقضات جمعها ماريو في شخصية صموتة حازمة ..تفعل و لا تقول.. تتواضع بلا تظاهر..تساعد بلا جدال.. تقتل بلا نقاش ..تؤلمك للابدانه اهم و انجح و اكبر \"كبير\"حظى به الادب العالمي ..الكبير المؤهل للبقاء حتى اخر نفس..تحول من عامل بسيط و رب اسرة من 3اطفال الى رئيس كوزانوسترا لم يختر الشر بقدر ما الشر اختاره ..صار نفوذه يشمل الكل ..من اصغر شرطي الى اهم وزير فسلطته مطلقة..زعامته مؤكدة ..قوته جعلت منه العدو الأسوأ.. و ارى أنه استمد سلطته من عدم انتماؤه ..فطوال الوقت يعتبر نفسه يحيا وسط أجانب. .لا يستحق تعاطفه سوى المطحونين من ابناء جلدته ا{ندمت كثيرا ..على كتابة العراب بهذا الشكل الضعيف الذي لم اجند له كل مواهبي الابداعية فقد تسرعت في كتابتها لاسدد ديون القمار التي تراكمت على}!!!؟؟ 😨..ماريو بوزو  ~~~~~~~~~~~~~~~~~~~~~~~مافيا كلمة ايطالية تعني {الشجاعة و الاقدام و نحن سعداء حقا ان ماريو اقدم وتشجع على كتابة ملحمته \"الضعيفة\" التي عقد بها مؤلفي النصف الثاني من القرن العشرين ♡♡الخيانة هنا لا يمكن غفرانها♡♡☆بقدر ما وجد العامل البسيط نفسه مصهورا في العالم السفلي القذر بفضل اقدامه المذهل ..فان اولاده الثلاثة ظلوا يمنحونه حيرة و قهرا مكتوما ربما لو كنا في عالم اخر لكان ربيبه هو خليفته و لكن في النهاية من يرث العقل و الحكمة فهو الجدير بالزعامة ..ا{لو لم تؤد الدور بعظمة و احترام لكنا غضبنا عليك }ارسالة المافيا لمارلون براندو ثلاثة ممثلين ادوا دور العراب الملحمى  مارلون براندو ..اصول ايرلنديةروبرت دينيرو..اصول ايطالية ال باتشينو ..مهاجر ايطالي  الاخراج هو الاكسجين للفيلم و اخراج فرانسيس فورد كوبولا كان اسطوريا و هذا الاهم ..وو بدون تفكير رايي الشخصي ان : روبرت دينيرو هو من قبض على روح الشخصية الروائية للدون .. باداؤه البهيمي الصامت ..بكلماته الايطالية المقتضبة و وجهه الخالي من الرتوش ..و الاهم نظراته السادية /الدمثة التي قفشت متناقضات الشخصية في مرحلة التكوين ..لذا تكسب الطريقة المنهجية معى دائما Method Acting 👍الاحترام هنا لغضب لم تبديه ابدا ♡♡ ة♡♡رواية العراب مثل عروض دون كورليوني ..لا يمكن رفضهااللغة عنيفة صادمة كما يجب ان تكون البناء مشوق يجبرك على انهاءهاالضعف الانساني و الهواجس لدى اقوى المجرمين ادب شعبي لكن ينير كشافا على عالم مجهولحفلة من الشخصيات المدهشة لكنها مالوفة لنا كابناء البحر المتوسط بشكل سيذهلك الترجمة اللبنانية القديمة هى الافضل ♡♡العائلة هنا لا يمكن رفضها♡♡و بالطبع مثل كل كتاب ممتاز لابد ان يوجد من يرفضه. .و اشهر الحاقدين على الرواية \"فرانك سيناترا\" !! الذي ثار على تحليل و تقديم شخصية المطرب جوان فونتاين فقد افترض الجميع انه هو ..لذا اراد دحص هذا الافتراض بان يؤدي دور مارلون براندو. .لكن بوزو و كوبولا عرضوا عليه دور فونتاين 😂😂!ا♡♡التقدير هنا لوعودك المحققة♡♡ و هكذا ستترك العراب و انت عاجزا عن ان تحبه او تكرهه ..و لكن المؤكد انك لا تتمنى عداوته و لا انتهاء حكايته"}, {"Review": "I'm one of the people who watched the whole movie trilogy and then after that found out that The Godfatherexists as a novel. Naturally, I had to purchase it. It is a matter of taste, I suppose, but next to the movies - so elegant and grandiose - it feels a bit like reading pulp fiction. Maybe it's that the book is lacking the presence of charismatic Hollywood giants Marlon Brando and Al Pacino, whose legendary performances rival those of Clark Gable and Vivien Leigh in Gone With The Wind. It's hard to tell. I did feel like the story tended to lose focus once in a while in the middle of the excessive subplots concerning the graphicly described sex lives of Johnny Fontane and Lucy Mancini. But I understand that, at the time, the subjects of pornography and death (especially together) were very controversial and obviously helped a lot with the sales, as the author Mario Puzo himself admitted.Anyway... the great thing about the book is that the Corleones are all in there of course; the whole main gang. And they get you hooked on everything they do. Classic storytelling at its best.The Godfather is basically an age-old tale about power passing between generations, more precisely from father to (reluctant) son. We have the \"kingdom\" of Don Vito Corleone and his \"three princes\". There's the rash and impulsive Santino (Sonny), the dim-witted but soft-hearted Fredo and the handsome and idealistic Michael. Vito also has a neurotic daughter called Connie and an adopted son named Tom Hagen. Who's German-Irish, btw, and works as a lawyer in the \"family business\".Don Vito is a very powerful and respected \"wise old man\". He is known for his hospitality and seemigly benign, \"reasonable\" nature. He grants people \"favors\" and he is such a master of his game that even brutal monsters like Luca Brasi have sworn loyalty to him. In short - he \"makes you an offer you can't refuse\". Because, in case you do, be prepared to find a dead horse's head in your bed.The magic of The Godfather story lies in the fact that it is told entirely from \"the inside\". Which enables us to care about and relate to characters who, in real life, would be considered despicable as people. It's like an exclusive peek into the closed world of a genuine Italian Mafia family. And we look into this world from a viewpoint similar to the one of Kay Adams - the only outsider in there.Vito Corleone makes his living mostly through gambling and prostitution and, staying true to his old-school methods,says \"no\" to drugs. Which is why the other Dons in the New York area decide that he is slipping and it is time to eliminate him. The night Vito is shot, it is his youngest son Michael who shows up in the hospital. Michael is an interesting isolated character. He announces proudly that he doesn't want to have anything to do with the family business and backs this up with his actions. Everything he does is different from his family - he goes to college, joins an army to fight for America and plans to marry a girl who doesn't carry a drop of Italian blood in her, Kay. He starts out as a hero that night, saving his father's life by moving his bed to another room and standing guard on the hospital stairs, displaying qualities (bravery, calculative and cool head under pressure, etc.) that make him an apparent \"heir to the throne\". When the Corleones work out their revenge strategies, Michael suggests that he should be the one to kill their enemies Virgil \"The Turk\" Sollozzo and the corrupt police captain McCluskey (who has assaulted him with a heavy punch in the face). Against all odds, he ends up executing the two men in an Italian restaurant, during one of the most thrilling and suspenseful scenes ever created. Having done away with the immediate threat to his family, he is then in danger and needs to go into exile.With Michael's trip to Sicily, the narrative perspective shifts and the story becomes his. He travels through the land of his forefathers and discovers the terrifying and bloody history of this beautiful place - the birthplace of the Mafia. He seeks to \"connect with his roots\" by marrying a beautiful local girl called Apollonia. But blow after blow is delivered to him in there; first with the news of his brother Sonny's murder at home and then with the tragic death of his innocent wife and unborn child through the explosives planted in his car. Everywhere Michael goes, death follows him. Once he returns to America, he is no longer the man he used to be.Michael's transformation from a young war-hero to a ruthless Mafia boss is both fascinating and devastating. And in the end we feel a deep sense of loss, because we've witnessed a man with so much potential for good and a bright, promising future simply sell his soul and go to hell. Was it the result of his decisions or just unfortunate circumstances doesn't even seem to bear real relevance in here - the story plays it out as an inevitability, as if it was always his fate.Michael is not the only one left to pay for his father's mistakes in a rather biblical manner, either... all of Vito's children do, in their own ways (poor, poor Fredo).The late Mario Puzo has said that The Godfather is first and foremost about family than anything else. But how much a person would do for their family or how much it would cost them to betray their family are not the only issues it brings up. Layers upon layers upon layers of meaning emerges as the story unfolds. Questions that never find answers (unless you're the actor Tom Hanks who's convinced that all of life's questions can be answered by The Godfather).It somehow manages to authentically reflect the everyday operations of a criminal empire, be a character-driven psychological drama, a tale of immigrant experience (the backstory of Vito's arrival to America) and a study of Italian-American lifestyle all at the same time. While being structured as a modern myth. No wonder it's so popular."}, {"Review": "The Godfather (Mario Puzo's Mafia), Mario PuzoThe Godfather is a crime novel written by American author Mario Puzo. Originally published in 1969 by G. P. Putnam's Sons, the novel details the story of a fictional Mafia family based in New York City (and Long Beach, New York), headed by Vito Corleone. The novel covers the years 1945 to 1955, and also provides the back story of Vito Corleone from early childhood to adulthood.تاریخ نخستین خوانش: دوازدهم ماه جولای سال 1992 میلادیعنوان: پدر خوانده؛ نوشته: ماریو پوزو؛ ترجمه: آذرمیدخت بهزادی؛ تهران، نشر علم، 1370عنوان: پدر خوانده - ویتوکورلیونه - دن ویتونه؛ نوشته: ماریو پوزو - فرانسیس فورد کاپولا؛ ترجمه: علیرضا شمیرانی؛ تهران، پارینه، 1376عنوان: پدر خوانده؛ نوشته: ماریو پوزو؛ ترجمه: حجت الله سلیمانی؛ تهران، جاده ابریشم، 1377، در 40 ص؛ شابک: 9646225322؛ عنوان: پدر خوانده؛ نوشته: ماریو پوزو؛ ترجمه: محمد پورفر؛ تهران، نشرگستر، 1388، در 465 ص؛ شابک: 9789645544896؛ عنوان: پدر خوانده؛ نوشته: ماریو پوزو؛ ترجمه: جبیب الله شهبازی؛ تهران، نشر افق، 1388، در 748 ص؛ شابک: 9789643695729؛ چاپ دیگر: 1395، در 600 ص؛عنوان: پدر خوانده؛ نوشته: ماریو پوزو؛ ترجمه: منیژه اذکایی؛ تهران، نیلوفر، 1395، در 580 ص؛ شابک: 9789644486975؛ پدر ویتو کورلئونه با شخصی در دهکده درگیر میشود و آن شخص به مافیا شکایت میبرد. پدر حاضر به زانو زدن در مقابل کدخدای محلی مافیا نمیشود و او را در حضور مردم به قتل میرساند. یک هفته بعد نیز جسد خودش را پیدا میکنند. تفنگچیان مافیا به دنبال ویتوی جوان به پرس و جو میافتند، چرا که احتمال میدهند که ویتو بعدها به خونخواهی پدر برخیزد. اقوام ویتوی دوارده ساله نیز او را مخفیانه به آمریکا میفرستند.....؛ ا. شربیانی"}, {"Review": "I'm gonna make him an offer he can't refuse.قد تكون هي الجملة الأشهر فى تاريخ صناعة السينما , ولكن قبل أن ينطق بها العظيم مارلون براندو , كان قد خطها قلم روائي مبدع فى أحد الروايات الخالدة .الفيلم الذى نادرا ما تجد أحد يكرهه (خاصة لو رجل ) فهو سحر السينما مجسدًا , فله تأثير السحر ومفعوله وبريقه الذى لا يُقاوَم.\nقرأت نسخة إنجليزية لهذا العمل من حوالي سنتين , وللحق فهي أكثر القراءات الأجنبية التى استمتعت بها رغم أنها كانت تجربة مرهقة جدا بالنسبة لي , المهم أننا هنا لا نتحدث عن مجرد عمل روائي بل نتحدث عن نص عبّر عن فئة كا وتم تحويله لأعظم عمل سينمائي على الإطلاق .فنحن هنا أمام نص أدبي مذهل لماريو بوزو , واضطلع بمهمة اخراجه على شاشة السينا المخرج العظيم فرانسيس فورد كوبولا وقام بتأدية الدور الرئيس فيه الممثل الأعظم على الإطلاق وهو مارلون براندو فى الجزء الأول , وروبرت دي نيرو فى الثاني مع ثبات دور المبدع آل باتشينو. وموسيقى هى الأعظم على الإطلاق لنينو روتا.فنحن إذن أمام حالة أدبية فريدة وحالة سينمائية أكثر تفردًا وهذا ما عبّر عنه دو كوبولا بوضوح حينما سُأل عن رائعته فقال : كان لدينا نص أدبي هو الأعظم وأداء مثيلى هو الأروع وموسيقى هى الأفضل , فسأله صحفي : وماذا قمت به أنت ؟فقال له : لقد قمت باختيارهم وجمعهم .أما عن الرواية : فهي عمل أدبي معجز , قدّم فيه الكاتب تصوير شامل كامل لعالم المافيا وخفاياه ممثلة فى عائلة فيتو كوريليوني وشخصيته الأسطورية نادرًا أن تقابله فى عمل أدبي , شخصية العرّاب , فمن خلال هذه الشخصية استطاع المؤلف أن يقدم لك الإنسان من مختلف الاتجاهات والأهواء , استطاع أن يقدم لك شر الإنسان وخيره وكيف من الممكن أن يتحول الإنسان ويمر بتطورات عديدة عبر مختلف مراحل حياته, مع توسيع تلك الدائرة بالقاء الضوء على باقي العائلة والتي تشعر من جودة تصويرهم أن كل واحد فيهم هو بطل للعمل مستقل بذاته.أما عن رسم الشخصيات فمن المستحيل أن يُذكر اسم فيتو كوريليوني دون أن يُذكر اسم مارلون براندو : الذي قام فى هذا الفيلم بأعظم الأدوار في تاريخ السينما على الإطلاق , فإذا أردت أن ترسم صورة للبطل فتذكر براندو وإذا رغبت فى عمق ما لشخصية براندو فى الفيلم تذ1كر رسم الرواية المذهل. العمل قُدم فى 3 أجزاء للسينما وقد شارك المؤلف فى كتابة السيناريو لل3 أجزاء وحاز على جائزة الأوسكار فى أول جزئين , وقد ساهمت مشاركة المؤلف في كتابة السيناريو للسينا في أن يخرج الفيلم قريب جدا للرواية وليس بغريب أن تُعتبر الثلاثية هي أعظم ثلاثية في تاريخ السينما على الإطلاق من وجهة نظر الكثيرين , ويعتبر الجزء الأول هو أعظم فيلم فى تاريخ السينما على الإطلاق (من وجهة نظري) كل ذلك ساهم فى أن يكون النص الروائي والفيلم السينمائي متكاملين لبعضهما البعض قريبين جدا , وان كان النص الروائي يتفوق فى اظهار بعض التفاصيل الممتعة فإن للفيلم بريق التركيز واظهار الأحداث الجلية وتقديمها ببريق هولييود المعهود ولا يستطيع أحد أن ينسى مشهد رأس الحصان والذي كان حقيقيا بالمناسبة :وباقي شخصيات العمل المرسومة من قِبل المؤلف بتمكن مذهل ومعرفة دقيقة بتفاصيل المافيا من مايكل (آل باتشينو) وسانتينو وفريدو وغيرهم من الشخصيات , تصوير المؤلف للأحداث كان مثير جدا ويدل على تعمق فى الدراسة منقطع لها .أما عن لغة العمل : فكانت مرهقة بالنسبة لعدم تمكني بالشكل الكامل من اللغة الانجليزية , وفي بعض الأحيان تبدو لى بسيطة وفى الحين الآخر تبدو لي معقدة صعبة ولكن فى المجمل كانت واضحة القوةفي المجمل : أنت أمام عمل لن يتكرر ولن تقابل مثله فقد كاد أن يبلغ الكمال من لغة قوية وأشخاص مرسومة بدقة وتوصيف مدهش للأحداث , والاهم من كل ذلك هو أن العمل قد نقلك لقلب الأحداث وجعلك تتفاعل معها وقدم لك لوحة كاملة للمعيشة التى وصفها .عمل خالد وتم تحويله لفيلم خالد شارك فى صناعته الأشخاص الأعظم فى تاريخ صناعة السينما على الإطلاق . "}, {"Review": "Puzo creates his awesome world & then plays with his own elements (those of detective noir and mob drama) like a world-class chess champion. Less than a fourth into the narrative, POW! the Don has been shot. And, hold on a sec, who is the protagonist here? I thought Michael. Or the Consigliari Hagen. Or Hollywood heart-throb Johnny Fontaine? The full display of individual destinies is what makes this better than its cinematic equivalent. Here we see flesh-and-blood people living at a Hadean level-- system of business ethics and family morality included. Anyway, the novel's true nature is \"the nature of the universe, the interlinking of good & evil, natural of itself.\" (392) Masterful!-- As close as there is to a SOAP OPERA for MEN. The need for reinvention, as well as the necessity to keep things in line with tradition are explored fully. Interesting to note are: the general absence of Fredo, the omnipresence of Johnny Fontaine... the Hollywood sex parties in detail (and how's this for risqué [and appropriate to the season]: Best Actor & Best Actress in public sex), plus invaluable insights (like the entire Book V, largely absent from the beloved film) as bizarre as sexual readjustment surgeries and as natural as mob allegiances in Vegas. This is pure entertainment-- decadence for the reader at full throttle!!!! This is a classic train of portraits of a kingdom in steep decline, of its vindication and revolution, rife with those beloved Shakespearean precepts like corruption, revenge & fate."}, {"Review": "Indeed, dear reader, I did not hate The Godfather. I h-aa-ted it.How much did I hate it? Well I could start with a long dissemination of Mario Puzo's simplistic and repetitive prose. Puzo seems to think the reader needs a reminder of plot points that occured ten pages ago, and that unnecessarily drawing out an obvious reveal by splitting it up into three points of view counts as suspense.Or I could give you a thorough cataloguing of how very poser-y The Godfather, with its bombastic ideas of masculinity and supposed gritty crime plotlines. And yet for moral convenience, the only people we see the Corleone Family harm are fellow mobsters they are at \"war\" with (and somehow the Corleones are never the instigators) or else, terrible human beings who are child molesters (I'm not kidding).I have an essay on my hard drive about how the worship of this book and the character of Vito Corleone is misguided, as he better represents the utter failure of the American Dream and its corruption of true values... that is if one takes Puzo's vision seriously at all, which one really shouldn't, as it is just another weak attempt at the myth of the Single Man, as well as obviously only prodding history for hopefully salacious material, rather than having an insight into the times.And I could talk on forever about the greatest myth of Puzo's \"history\" is his adherance to the Madonna-Whore view of his female characters, only slightly amended more specifically in Puzo's case to the Long-Suffering-Wife (Whose-Willingfully-Ignorant-Devotion-To-Her-Husband-Is-Only-Matched-By-Her-Spiritual-Devotion-To-Praying-For-His-Soul) and the Body, of which there are two subtypes, the Vagina (Woman-Who-Only-Exists-As-A-Sexual-Object) and the Victim (Woman-Who-Exists-As-A-Punching-Bag-Usually-For-Plot-Device-Purposes).But really that would involve spending more time about thinking about this truly wretched book, and really just this*:There's a whole character in this book-- a secondary character who gets several chapters devoted to PoV-- who is defined by her gaping vagina. Yes, literally. Her whole character is about her large vagina. We get a whole decades-spanning arc about her large vagina, because really, what else could possibly be more riveting about any woman? What other possible characteristics could any woman have that would be more important than that?Do I really need to say more?*It was this or an haiku about watching the pages burn, but I don't believe in book burning and I could never top Bradbury anyway, so this is what you get instead."}, {"Review": "You gotta stop them at the beginning. Like they shoulda stopped Hitler at Munich, they should never let him get away with that, they were just asking for big trouble when they let him get away with that.You know that you are a Czech person when this is your favourite quote/sentence(s) from the whole book. I expected many things from this book because let's face it this book is a phenomenon! But, I didn't know what I will get because I never saw the movies and never read anything about the book. Also, this book has impressive power; it took me so long to read it because every time I opened in public someone started to talk to me about it. A policeman at the Prague castle that was searching my bag and watched as I went through the metal detector, at least three workers at the Prague airport, an English gentleman that sat next to on the flight to Istanbul, numerous people in metro...So, I started. I was flooded with so many characters that I had no idea where my head was. I loved some; I hated some, I wanted to know about many. I thought that some of them deserved their fate or even worse than they were getting.I could not stand Johnny Fontana, he got everything, and he appreciated nothing. I was surprised to actually like Jules Segal; he was surprisingly refreshing. I looked at some reviews and was actually surprised at how many people complain about the women and their role in the story. And I want to ask, what did they expect? A strong heroine that would put battle with the men? Italians, mafia, taking place after World War Two, being published at the time... That is not a set up for a strong heroine. No, it is a recipe for a housewife, mother, wife or daughter. Anything else and you can bet that the character won't be portrait positively or as a strong character. I don't think this should be judged by today's standards. (view spoiler)[Yeah, Lucy's operation scene was pretty creepy. Even I have to say that. (hide spoiler)]I won't go into detail much because there is so much a could talk about. This is a masterpiece!But I need to say that I don't like Kay. I don't think she and Michael could function together. She is too progressive for a role of a wife that asks nothing, sees nothing and does as she is told. I actually liked Apollonia. Yes, she liked the little powers that Michael gave her, as teaching her how to drive. I actually think that they were more suited for each other. This brings me to the question, did Kay ever learn about Apollonia? And, in the beginning, I believe Michael liked Kay's progressiveness, but I wonder how he saw it after the time with Apollonia.And, there is only one man named Clemenza for me. And that is Clemenza Caserta from Hell's Kitchen! I saw him playing Clemenza, and I could not unsee that. "}, {"Review": "I’m sure you’ve had the timeless book-verses-movie argument before. Everyone has. You’re standing at the water cooler at work, and a coworker comes up to you and says “Boy, The English Patient is an excellent movie!” And maybe you say something back like “Michael Ondaatje’s Booker-Prize winning novel is far superior.” At that point, your coworker calls you a “pretentious snob” and you respond with “sewer-dwelling ignorance peddler.” There is some cursing. Maybe someone throws water on the other. That’s the argument. It is great fun, and an eminently worthwhile way to spend the moments God gives us. The Godfather is a great example of this type of debate. Which is better? Mario Puzo’s bestselling novel, or Francis Ford Coppola’s Academy Award-winning film? The answer is both. Or neither. They are the same. Not just the same extremely high quality, but almost literally the same. If I were an alien visiting earth, I would believe it if someone told me that Puzo’s The Godfather was actually a novelization of Coppola’s movie. (I assume, if I were an alien visiting Earth, the topic of movie novelizations would eventually arise). That is not the case, of course. Puzo’s novel was published in 1969. Coppola’s film came out in 1972, and spawned two sequels, one of which is worth mentioning. At this point, The Godfather legacy is so pervasive that I feel like my job is done. Even if you haven’t read the book or seen the movie, you probably know all the plot points, character beats, and one liners. There’s nothing more to say. However, since I get paid by the word, I’ll keep going. The Godfather tells the story of the Corleone family. They are typical American strivers who immigrated from Italy, started a business selling olive oil, and are part of the Mafia. The patriarch of the family – the Godfather – is Vito Andolini Corleone, a distant and reticent man of near-omnipotent powers. He is surrounded by three sons: hotheaded Santino (Sonny); weak and obedient Frederico (Fredo); and young World War II hero Michael, who when the novel opens has never been part of “the family business.” The family’s consigliere, or advisor, is the Irish-American orphan Tom Hagan.The novel – like the film – opens with the wedding of Don Corleone’s daughter Connie. This is an excellent device for introducing on the main characters, their roles within the hierarchy, and the Don’s far-reaching power. (I could spend all day comparing the book to the film. I promise I won’t. But I’d feel remiss if I failed to mention how much time is spent on a character named Lucy Mancini. This is one of the big differences between book and movie. In the film, we see her for a second – she is the bridesmaid with whom Sonny has sexual congress. In the novel, she is treated like a major character, even though her plot arc has nothing to do with the central narrative. And do you want to know what her plot arc is? I don’t think I’m spoiling anything by saying that it is a pelvic floor problem. Sonny, you see, was the only man with enough manhood – so to speak – to satisfy Lucy. Puzo, for reasons lost to history, decides to devote an entire section of the novel to Lucy’s pelvic floor surgery. I’m not making this up. I’m not clever enough to make this up). The precipitating event of The Godfather is the attempted assassination of Don Corleone by an up-and-comer named Virgil “the Turk” Sollozzo, who was mad at the Don because the Don didn't join him in the heroin business. Don Corleone’s wounding puts Sonny in charge and draws Michael into the family business. I don’t need to continue with a plot summary. If you’ve seen the movie, you know what happens next. If you just came out of a long hibernation, I don’t want to spoil anything. It is worth noting, despite the comparisons I can’t help making to the movie, that this is a standalone piece of quality fiction. The characters are unforgettable, from the central figure of Don Corleone himself, who is given a lengthy flashback section (familiar to fans of The Godfather, Part II), to secondary characters such as Luca Brasi (a sort of Sicilian Keyser Soze, whose very name terrifies people) and Johnny Fontane (a Frank Sinatra stand-in, given his shot at stardom by the Don). The plotting is excellent. The story is propulsive. This is the kind of book that needs to be taken on a long plane trip, because it really passes the time. (I had to stop reading it at bedtime, because it burned away my Z-Quill haze). The writing, especially the dialogue – which has become part of American pop culture – is excellent. And worth sharing. For instance, the Godfather has some Godfatherly advice on the value of friends:“Friendship is everything. Friendship is more than talent. It is more than government. It is almost the equal of family. Never forget that. If you had built up a wall of friendships you wouldn’t have to ask me to help.”There is also some excellent guidance on the importance of a personal touch:  “You shouldn’t let that broken jaw influence you,” Hagen said. “McCluskey is a stupid man, and it was business, not personal.”For the second time he saw Michael Corleone’s face freeze into a mask that resembled uncannily the Don’s. “Tom, don’t let anybody kid you. It’s all personal, every bit of business. Every piece of shit every man has to eat every day of his life is personal. They call it business. OK. But it’s personal as hell. You know where I learned that from? The Don. My old man. The Godfather. If a bolt of lightning hit a friend of his the old man would take it personal…That’s what makes him great…He takes everything personal. Like God. He knows every feather that falls from the tail of a sparrow or however the hell it goes. Right? And you know something? Accidents don’t happen to people who take accidents as a personal insult. So I came late, OK, but I’m coming all the way…”Coppola’s films resonate because they play on the hoary old tropes of the American Dream. The Corleone family is the archetypical immigrant clan that comes to the United States and makes good. The sly subversion, of course, is that they make good by controlling the unions and bookmaking. In the film, it’s easy to get behind the Corleone family as the “good guys” while the other Mafia families are the “bad guys.” You cheer for Al Pacino because he’s Al Pacino (“Hoo-ah!”). At the same time, the film’s moral compass – Diane Keaton’s Kay Adams – is given the role of wet blanket, nagging and prying and generally taking time away from the kinetic scenes of gangland mayhem. There are elements of that theme in Puzo’s novel, but I found the main thread here to be much darker, more brooding, and far less certain that all these people we’ve followed are worthy of the attention. Puzo opens The Godfather with a quote from Balzac: “Behind every great fortune there is a crime.\" Then he sets out to give you Exhibit A. He certainly baits you into siding with his protagonists early in the novel. By the end, however, he makes clear that the Corleones are not heroes, but criminals, and that there is a price they’ll have to pay for everything that they’ve done."}, {"Review": "\n*****5 PORQUE NO LE PUEDO DAR MÁS PUNTUACIÓN stars.*****\n\n\n\nReview in my account bookstagram\n\n\n\n\n\nHilo en twitter de El Padrino\n\n\n\n“Cada hombre tiene un solo destino.”\n¿Qué se puede decir además que es una obra maestra? ¿Por qué no hay más estrellas para calificar éste libro?El Padrino es un libro que nunca se me habría ocurrido leer, no es que pensara que fuera aburrido, simplemente que lo compré más por su fama, lo archive en mi librero y nunca le di tanta importancia o pensé que llenaría mis expectativas. Me equivoqué. Se siente bien cuando te descubres una lectura tan sencilla y tan magnífica sin rayar en lo pesado que terminas enganchado a ella y no puedes parar hasta llegar a la última página. Lo que más me ha gustado de este libro es que no es difícil de leer, abarca muchas cuestiones, temas y personajes sin saturar al lector. Long beach, 1946.Vito Corleone, llamado El Don o El padrino es un hombre poderoso, amado y odiado, pero sobre todo, muy temido, siendo el capo más respetado de la mafia de Nueva York. Siciliano de nacimiento e inmigrante a Estados Unidos, es la cabeza de la gran organización de la familia Corleone, que controla el negocio de los juegos de azar, los sindicatos y el fraude. Dueño de un temple de acero y una benevolencia increíble con las personas que recurren a su ayuda, que siempre deberán pagar en algún momento. El padrino es la cabeza de un grupo jerarquizado de hombres fieles hasta a la muerte (que respetan la ley de la omertà) y encabezados por su consigliere (mano derecha) Tom Hagen y sus hombres de confianza (caporegimi) Tessio y Clemenza.“No existía atmosfera mejor que la del dinero para entrar en razones.”\nLo que sorprende es el lugar en el que Puzo decide empezar la historia. La novela inicia en la boda de la hija del mismo padrino. A pesar de que la familia está festejando, Vito Corleone aprovecha algunos momentos para hablar de negocios con sus amigos. En estos primeros capítulos empezamos a ver la forma de ser y los códigos que se manejan en la mafia. Aquí la gente va a pedirle favores, dichos favores deberán ser cobrados en un futuro pero también respaldados por la amistad y la confianza. Esto hace que la mafia italiana tenga una escala de valores interesante para ser un grupo criminal y que desde las primeras páginas El Padrino sea un personaje interesante con una genialidad increíble.“El mundo era un oasis de paz para todos aquellos que habían jurado lealtad a su persona, mientras que para otros muchos que creían en la ley y el orden era un infierno donde se moría como una rata.”\nContrario a lo que yo pensaba antes de iniciar este libro, en estas páginas se les da más protagonismo a tres personajes a lo largo de toda esta historia y Vito queda en segundo plano. Los protagonistas son: Johnny Fontane, un actor y cantante que acude al padrino para que lo ayude resurgir su carrera artística. Sonny Corleone, el hijo mayor del Don y el segundo al mando y por último, Michael Corleone, el hijo que nunca se interesó por los negocios de su padre.“La venganza es un plato que sabe mejor cuando se sirve frío.”\nLa verdadera acción inicia cuando Vito es atacado por una banda rival y queda fuera de combate. Si bien no está muerto, no tiene fuerzas para dirigir su organización en la “guerra de familias” y son sus dos hijos quienes deben encargarse de esto. Sonny es un hombre impulsivo y un tanto violento que decide atacar con la misma fuerza. Por el otro lado tenemos a Michael, el hijo bueno, sereno, estudioso e incluso veterano de la Segunda Guerra Mundial. A pesar de sus diferencias, los dos hermanos deciden trabajar en equipo e intentar vengar el ataque a su padre.“Si la sociedad fuera más realista, más personas como tú y yo podríamos hacer maravillas.”\nEn este libro se va a hablar mucho de la mafia. Con una combinación perfecta de crimen, el hampa, la religiosidad y las costumbres culturales más arraigadas del mundo, la historia va mutando, contando el hilo principal de la acción, volviendo atrás, divagando, reencontrando personajes perdidos, dando explicaciones, huyendo del problema y viéndose atrapado por el mismo. Es la sensación que causa las mil vueltas que Puzo emplea para darle al texto cierta intriga sin perder el atractivo y el estilo. La narración es en tercera persona tomando por inicio a un personaje y dando a conocer la cantidad de detalles suficientes como para mantenerte al lector inquieto y omitiendo algunos detalles para que las sorpresas lleguen sin ser esperadas. Más allá del tema central que es la organización mafiosa, también relata problemas morales y éticos, acción, romance y manipulaciones políticas. Es una novela muy completa que atrapa al lector y que impide la indiferencia.“En nuestro mundo no hay lugar para el perdón.”\nLos personajes son tan crudos y tan reales que es inevitable familiarizarse con ellos. Esta narración a pesar de ser simple pero exacta, aborda el tema tan complejo que representa la mafia. Se ha convertido en uno de mis libros favoritos de este año. A pesar de que tiene varios capítulos que no aportan nada a la historia y un personaje en cuestión que odié, diré que hay nada más placentero y cruel para mí que ver a un chico bueno que termina convirtiéndose en villano.Actualización 04/10/2018.\nEsto será una reseña muy larga y necesito pensar ideas primero."}, {"Review": "The epic masterpiece of mafia fiction. Puzo is good and entertaining elsewhere, here is great and masterful. It is to mobster books what Godfather parts 1 & 2 are to mobster movies...a standard that can never be equalled. What really intrigues me about Puzo's presentation of the Corleone family, and something that does not translate as explicitly to the screen, is the incredible sense of moral and religious conviction that what they do is right and good. At times I found myself believing that the Corleone's were right to be who they were, or at the very least, that such a way of life in de-centralized Sicily, if not in 20th century America, was appropriate. Puzo does everything in this book; action, drama, romance, epic, humanity, pulp, and he does it all effortlessly. One minute you're reading about a fictional mafioso and the next minute you realize you've stumbled on one of the great literary accomplishments of the century. I love books that make it hard to know how to feel about the characters. No single literary character is as conflicting for me as Michael Corleone. And so, few books intrigue me more. It is a book to be cherished. "}, {"Review": "I absolutely loved this book! This book started my long running obsession with Mafia. The Godfather is one of the best pieces of literature ever written. Mario Puzo paints this elaborate picture of the Sicilian mafia through the eyes of Michael Corleone, a returning Marine Corps hero who at first wants nothing to do with the elaborate crime family that his father has built.Don Vito Corleone, an Italian immigrant who goes from poverty in Little Italy to create one of the Five Families of New York with the help of his friends Peter Clamenza and Salvatore Tessio.His inferiors include his sons, the short tempered Santino \"Sonny\", the clumsy Fredo, and of course Michael. Wounded war Vet Rocco Lampone, and the tough Luca Bracsi.The Godfather starts in a 1945 New York. A mob war is brewing between the Corleone's and a rival family. The dilema of getting into drug trade and betrayal are at the heart of this literature classic.The reason that the Godfather is so good is the depth of Mario Puzo's characters. They aren't just evil criminals. They are real people. Puzo romanticises the mafia life and that time period altogether.He also does something perfectly what other books have tried to do and miserably failed at. He parodies real life characters into his novel. Johny Fontane the saloon singer is his fictional Sinatra and it is perfectly done.This is easily ther best book you will ever read. "}, {"Review": "خنده دار است كه تا بيست سال پيش شبه روشنفكران ما، با چه چيزهايى پز مى دادند! با ديدن فيلم بن هور، ئى تى، جنگ ستارگان، فيلم هاى عامه پسند هاليوودى كه مخاطبشان نوجوان هاى پانزده ساله بودند! يعنى به عبارت ديگر، به دليل عقب ماندگى فرهنگى عمومى، هر چيزى كه از زيردست \"از ما بهتران\" در مى آمده را روى هوا مى قاپيدند به خيال اين كه گوهرى يگانه است.بايد دسترسى به محصولات فرهنگى غرب گسترش مى يافت تا تحصيلكرده ها كم كم دريابند تفاوتى هست بين جنايت و مكافات با اينديانا جونز، بين داستايوسكى و استيون اسپيلبرگ، بين آثار فاخر با آثار عامه پسند.الآن كمتر روشنفكرى به ديدن فيلم هاى عامه پسند و تينيجرى همچون سوپرمن و اسپايدرمن مى نازد، و اين پيشرفت بسيار بسيار بزرگى است براى حفظ آبروى طبقه ى روشنفكرى ايران."}, {"Review": "\"..for Justice, we must go to Don Corleone.\" In a world where laws are broken, where the government is only a puppet, where murder is routine and safety a rare thing, Don Corleone holds all the strings. He is the avenging angel, the thief in the night, the protector of the poor, the warrior of the wops, the ultimate puppeteer. He is the loving father, the faithful husband. He is the Godfather. Don Vito, Sonny, Fredo, Michael, Tom, Clemenza, Tessio, Luca Brasi, the entire family, they're like the Cosbys. Only they're much more serious, they're Italian, and they're mafia. Okay, maybe they're not like the Cosbys. But they do have one thing in common. They're both iconic families. The Corleones, The Cosbys, everybody knows who they are. The family name speaks for itself. It's pretty common knowledge that one of the vital points in writing a successful novel is creating unforgettable characters. And the Corleone Family, they're real hard to forget. (Well, Fredo, not so much.) I do think that this is the book's strongest point. The story is another strength too, full of intrigue and excitement. These two redeem the book from the sometimes cliche lines and a little sloppy writing. The writing's not so bad, but it's not so good either. But com'on, one can overlook that when the plot is this good and the characters this unforgettable.I'm not gonna make this long. I actually had this idea just to place the word \"Omerta\" as my review. But, I'm not Sicilian anyway. So who am I kidding? Here's the deal. This is one glorious piece of literature. The writing's a little sloppy, maybe. But the book is glorious nonetheless. I may or may not have cried out of happiness because of all the gloriousness. It's a real .90 caliber pezzonovante, not a Moustache Pete though it was written way back in '69. Real pezzonovante, .90 caliber. To end this review, I have to reflect on the feeling I had all throughout reading this book.I felt the endless craving for spaghetti.So here's what I'm gonna do:I'm gonna go home. I'm gonna talk to my mom.I'm gonna make her an offer she can't refuse.No, I'm not gonna put a gun on her face just to ask her to cook spaghetti for me.Maybe I'll bring a gift, or give her a kiss, or take her to a massage place. I'll think of something. "}, {"Review": "The Godfather by Mario Puzo...Gimme one reason why there was NO CAT IN THE BOOK???But they added one in the movie, huh. So, the Godfather is this guy:Most loved him, I didn't so I'm not going to talk about him. But his ideals are kinda cool. “Friendship is everything. Friendship is more than talent. It is more than the government. It is almost the equal of family.\"“Revenge is a dish that tastes best when served cold.” “A man who doesn't spend time with his family can never be a real man.” \"Every man has but one destiny\"He had three little sons and one daughter. But only the sons were needed so they were like this; his dear little successors: Yups, two were in the heavens, only one had eyes open, and he became something. Well, this last son of his was Michael Corleone. His daughter was the youngest, so she had no major role to play, heck, none of the women had a \"different\" role to play but of a SICILIAN wife; take care of kids, take care of husband, make food, pray for their loved ones souls. I'll get back to the last part in later... Plus, they were NEVER to ask about \"work\".All this Sicilian stuff is so discriminatory, even their  Consigliere  Tom Hagen had spotlights on himself for being 'Irish'.He seemed to be a pretty interesting character, I must say.Unrelated, but I must put this here:Like his Godfather said, “The lawyer with the briefcase can steal more money than the man with the gun.”So there was a character like this cat:Looking down at all others, so vicious that the-whole-world feared him, his name was the animal Luca Brasi ((Honestly, these cats are animals, and they are so cute, I doubt if Luca was a cute. And moreover, it's an overstatement. Animals are NOT as cruel...)) He was more like a baker... cutting at bread pieces, heating the foods, and stuff... umm... the bread were humans. This guy was feared by all, yet he was the puppet of the Don Corleone, his Godfather. So, a man so feared, how would he die? He'd have a legendary death, right? No. He had a very undeserving way to die, I was so disappointed by it. *shakes head*, and so he now sleeps with the fishes. (view spoiler)[No pun intended...fish is fish, as in the aquatic little cuties that colorful and quite fun to watch (hide spoiler)] There is a LOT of history in it, but I don't wanna fall asleep explaining all so let's move. Question: The book titled \"The Godfather\", why is it about other random stuff? Like about the Fontane and Valenta guy, they were always high..Meh, one had to die. Lastly, the old man dies, and in Michael's arms, he regrets nothing of life... can I quote it? Because I have to agree, \"Life is so beautiful\" And after that, there was only one thing I found epic. How Michael restored the Corleone Family's power back. It was... thrilling. Yeah, I liked how stuff was done so quickly. So craftily. He finally was addressed as The Don.And lastly, the topic that amuses me the most. The wives of the Dons. They go to the Communion everyday. Early morning, to pray. For their husbands, for their CRIMINAL DONS OF HUSBANDS. For their souls, to what? Go to heaven? A BIG no-no there. Now, lets see, these people, they channel all the good towards themselves, agreed that they play 'gods', yeah... KILL people and stuff... and expect to be forgiven? Expect to be accepted in heaven? It's like... it's like the Taliban today. I'm sorry, just that The Kite Runner is just one of my obsessions. So if the Taliban kill people, then pray, it's fine? Accepted? Same with Al Qaida. And all other \"Mafiosa\" around the globe. Though there is a difference between the \"terror groups\" I didn't love the book...can't say I hated it either. So a 2.5 stars, which isn't possible, so three =) [finally, a smiley XD]That's it XD"}, {"Review": "  “There are things that have to be done and you do them and you never talk about them. You don't try to justify them. They can't be justified. You just do them. Then you forget it.”\"Behind every successful fortune;There is Crime.”\"The lawyer with the briefcase can steal more money than the man with the gun.”“We are all honorable men here, we do not have to give each other assurances as if we were lawyers.” \"Time erodes gratitude more quickly than it does beauty!”  The novel 'The Godfather' leaves a long lasting impact on one's imagination. One may start using its characters as personality types - Vito Corleone, Micheal Corleone, Sonny Corleone, Freddy and Tom Hagen; they all came with their unique character. The book is godfather to all criminal books that shall ever be written.The Godfather was the book that brought to public imagination the philosophy, codes of conduct, methods and operating styles of Italian Mafia. It is probably still the environment that politicians, businessmen or anybody who regularly deals with lawyers still face.I personally find the beauty of its story and characterization only next to those of great Indian epics like Ramayana and Mahabharta.In all ways it is a master piece. There are few loose ends which you may be called redundant in comparison to parts that was loved more.I really can go and on - specially about its characters and I might still end up underselling it. So just go on and read it."}, {"Review": "Cuốn tiểu thuyết này của Mario Puzo thực sự là một tuyệt tác, một tuyệt tác kỳ vĩ và hào hùng về một trong những đại gia đình mafia nổi tiếng nhất tại Mỹ thời hậu chiến tranh thế giới thứ 2. Tất cả mọi thứ được viết trong “Bố Già” (tựa gốc tiếng Anh: “Godfather”), tất cả mọi nhân vật được tạo ra, mọi chi tiết, câu thoại, diễn biến, câu chuyện đời, chuyện nghề của riêng từng nhân vật, đều được khắc họa một cách hấp dẫn, lôi cuốn đến mức gây nghiện, khiến tôi không mong gì hơn là sở hữu một thứ thần dược giúp mình tỉnh táo suốt cả ngày để có thể ngấu nghiến cuốn sách trọn vẹn cho đến trang cuối cùng. Và trên cái nền của những cảm xúc dữ dội, đắm say, đam mê mãnh liệt đó, là những thông điệp về nhân sinh hòa quyện một cách hoàn hảo với chất tàn bạo của thế giới ngầm và hiện thực về một nước Mỹ rối ren, vàng thau lẫn lộn, như thể dòng sữa trắng ngọt ngào đang hòa cùng chất cà phê đắng đen sóng sánh, để rồi hợp lại và tạo thành thứ cà phê capucchino thơm ngon trứ danh – trứ danh như chính cái cách những gia đình mafia xuất thân từ đảo Sicile của Ý đã trở thành hình tượng kinh điển trong cuốn tiểu thuyết này.Nhân vật trung tâm của “Bố Già”, dĩ nhiên không ai khác hơn, chính là bố già, ông trùm quyền lực của đại gia đình mafia Corleone – Vito Corleone. Khá khen cho tác giả Mario Puzo khi ông, bằng ngòi bút khéo léo và suy nghĩ vượt ra ngoài mọi khuôn khổ trước đây về thế giới ngầm, đã tạo ra được một nhân vật trung tâm có sức ảnh hưởng và mang tầm vóc vĩ đại đến như thế, đạp đổ mọi quan niệm trước đây của tôi về người đứng đầu một tổ chức mafia. Sống trong thế giới ngầm là phải sống như Vito, làm việc trong thế giới ngầm là phải làm việc như Vito, và chiến đấu trong thế giới ngầm là phải chiến đấu như Vito. Đó là kiểu sống, làm việc, chiến đấu thấm đẫm cái nền văn hóa của những con người gốc Ý mà cụ thể là gốc Sicile, những người coi trọng truyền thống gia đình, tình bằng hữu, tình nghĩa giữa người với người; những người coi việc hành xử trong thế giới ngầm cũng như việc hành xử trong giới kinh doanh, luôn phải suy tính thiệt hơn thật kỹ trước khi ra quyết định, không phải ghét ai, thù ai cũng đè ra mà bắn bỏ, mà nổ súng, mà “trải nệm” (thuật ngữ của Corleone, nghĩa là giết chết một ai đó) thì mới xứng mặt anh hào. Chính cách nhìn, cách nghĩ, cách làm việc coi trọng tình người và sức mạnh của quần chúng nhân dân, luôn cố gắng và cam đoan giúp đỡ càng nhiều người càng tốt để tạo nên những mối thâm tình, hay ít ra là mối nợ ân nghĩa giữa Vito và các bằng hữu khác, để sau này có cần họ giúp đỡ điều gì thì họ cũng sẵn sàng thực hiện; suy tính kỹ lưỡng thiệt hơn của từng bước đi, đề ra những chiến lược cụ thể, khôn ngoan và khó đoán của Vito Corleone đã giúp cho ông trở thành một hình mẫu bố già ghê gớm, một con rắn thâm trầm và nguy hiểm, khiến kẻ thù phải kiêng nể, e dè, cùng lúc đó lại là một đấng toàn năng đầy nghĩa khí, hảo tâm đối với bạn bè, thân bằng quyến thuộc xung quanh.Thế nhưng, nếu chỉ có nhân vật bố già làm trung tâm và giành hết mọi ánh hào quang quyền lực về mình, thì có lẽ 642 trang tiểu thuyết này đã không thực sự lôi cuốn đến mức gây nghiện như thế. Bao quanh bố già Vito là cả một mạng lưới các nhân vật phụ và nửa chính nửa phụ khác nhau, mỗi người đều có những tính cách riêng, những câu chuyện cuộc đời riêng, những số phận riêng mà thông qua bản dịch tiếng Việt của Ngọc Thứ Lang – bản dịch được xem là hay nhất từ trước đến giờ của cuốn tiểu thuyết này – với văn phong và từ ngữ được sử dụng đậm chất thổ ngữ địa phương hào sảng và gần gũi, lại càng được tôn lên gấp bội. Những nhân vật ấy nổi bật một cách đầy lôi cuốn, hấp dẫn, thú vị giữa vầng ánh sáng của sự thông tuệ và uy nghiêm đến từ bố già Vito vốn chi phối toàn bộ cuốn tiểu thuyết này kể cả khi ông đã chết đi. Đó là anh chàng luật sư trẻ tuổi Thomas Hagen – người gốc Ireland, con nuôi của bố già, lớn lên thay vì đi theo nghiệp luật mình đã học thì lại quyết định theo hầu việc cho ông trùm và được bổ nhiệm làm consigliori (cố vấn kiêm phụ tá, nếu coi bố già là vua của “đế chế” Corleone thì consigliori được xem như tể tướng, “dưới một người mà trên vạn người”, nhân vật tối quan trọng của cả một nghiệp đoàn mafia) trước sự dè bỉu, coi thường của các nghiệp đoàn mafia khác vốn chỉ coi trọng người gốc Sicile. Đó là con trai cả của Vito – Santino Corleone, được gọi thân thương bằng cái tên Sonny – một người luôn nóng nảy, quyết định hấp tấp, vội vàng, nhưng giữa cảnh nghiệp đoàn nhà mình đang gặp khốn đốn, anh vẫn thể hiện được bản lĩnh người con cả của mình, đã đứng ra cùng với các chiến hữu khác giải quyết khủng hoảng một cách trót lọt, để rồi cuối cùng cũng chính cái tính nóng nảy, quyết định hấp tấp, vội vàng, thiếu tầm nhìn và một chiến lược sâu sát, khôn ngoan ấy của anh đã dẫn anh đến kết cục đau thương. Đó còn là cậu con trai út của Vito – Michael Corleone – người thể hiện được bản lĩnh và khả năng lãnh đạo, tư duy của một ông trùm nhiều nhất trong ba anh em, là ứng cử viên sáng giá cho “ngôi vị” kế nghiệp người cha già nổi tiếng, thế nhưng vì đại cuộc mà anh phải hy sinh cuộc sống của mình bên gia đình, khăn gói chạy trốn đến quê cha, để rồi sự trở về của anh đã thổi luồng gió mới hồi sinh cho nghiệp đoàn mafia khét tiếng – một sự kế tục hoàn hảo cho truyền thống mafia thế giới ngầm đã trở thành thương hiệu của gia đình Corleone. Bên cạnh những nhân vật quan trọng thứ hai sau bố già kể trên, thì mạng lưới nhân vật dày đặc mà rất dễ nắm bắt của cuốn tiểu thuyết này còn bao gồm những tay sai cấp cao, những tên đứng đầu của mỗi “vòi bạch tuộc” nhỏ trong nghiệp đoàn, cai quản những vùng khác nhau trong lãnh thổ New York – mỗi tên một tính cách, lề lối làm việc và số phận khác nhau, trung thành cũng có mà phản bội cũng nhiều. Bên rìa cuộc chiến mafia của những tên đàn ông còn là những người yêu, người vợ, những đứa con mà vì tính chất công việc “vào sinh ra tử” không biết lúc nào của chồng, của cha mình, đã phải chấp nhận một cuộc sống ẩn dật, đoạn tuyệt hoàn toàn với công việc mình từng mơ ước, cũng như công việc riêng của chồng, để toàn tâm toàn ý là người vợ hiền, người mẹ đảm đúng theo hình mẫu phụ nữ truyền thống Sicile, ngày đêm chỉ còn biết cầu nguyện cho linh hồn chồng mình tìm thấy sự tha thứ và thanh thản sau bao nhiêu cái chết và đổ máu mà họ đã thực hiện. Với mạng lưới nhân vật dày đặc như thế, tác giả đã quá thông minh và điêu luyện trong cách xây dựng và truyền tải hình ảnh những nhân vật ấy đến trái tim người đọc, từ cách tạo dựng cho họ những đặc điểm riêng, quan niệm sống, hành vi và cách ứng xử đặc trưng, được làm nổi bật và đẩy đến mức cao trào bằng những lời thoại, câu từ đậm bản chất mafia giữa thời kỳ nhiễu nhương lẫn lộn, cho đến cách phân chương, phân cuốn cho câu chuyện. Mỗi cuốn, mỗi chương là mỗi cơ hội cho từng nhân vật được nói về cuộc đời của mình, được tự do vẫy vùng giữa từng trang giấy thấm đẫm tinh hoa văn chương Mỹ, từ đó mang đến cho người đọc cơ hội tương tự để tìm hiểu sâu hơn, kỹ hơn về các nhân vật và các sự kiện diễn ra trong cuộc sống của họ, để nếu cho dù không yêu đi nữa thì độc giả vẫn cảm thấy ấn tượng với từng mảnh đời, từng con người, từng số phận mà họ đã đọc qua.Đọc “Bố Già” chính là chúng ta đang đọc một cuốn biên niên sử gia đình trên cái nền xã hội Mỹ đương thời, thật vậy. Đó là một gia đình với tất cả những hạnh phúc và khổ đau của nó. Một gia đình chào đón niềm vui thấy con mình kết hôn, chào đón những đứa cháu mới ra đời, cùng lúc đó là bầu không khí nghiêm túc, những tính toán sâu sắc, lạnh lùng, thâm trầm, nguy hiểm của công việc. Đó là một gia đình lúc nào cũng bị bao phủ trong cảm giác cái chết treo lơ lửng và thường trực, để rồi khi cái chết ấy bất ngờ giáng xuống đứa con của gia đình, một cách bạo tàn và đớn đau không kể xiết, thì Corleone trở thành một gia đình của những mất mát không thể tránh khỏi, của niềm tang thương chôn giấu bên trong trái tim uất nghẹn những người cha, người mẹ mất con – của bố già Vito khi hay tin con mình chết thảm dưới họng súng thanh toán của kẻ thù, nhưng vẫn bản lĩnh và lý trí đủ để không khuỵu ngã, để vẫn tiếp tục công việc với đôi mắt ráo hoảnh và sự đớn đau giấu chặt bên trong. Và gia đình ấy được đặt trong bối cảnh nước Mỹ những năm hậu chiến vàng thau lẫn lộn, một nước Mỹ nhiễu nhương đổi trắng thay đen, cá lớn ăn hiếp cá bé, công lý thuộc về những kẻ nào nhiều tiền nhất, nhiều quyền lực nhất; cảnh sát cấu kết với giang hồ để buôn ma túy, để làm tay sai cho các nghiệp đoàn mafia khác nhau, ăn thêm “đầu lương” bất chính với cái nghề mà họ đã cam kết cống hiến. Bức tranh về một nước Mỹ như thế được khắc họa một cách sống động mà đau thương, hùng hồn mà đầy căm phẫn thông qua không chỉ hình ảnh gia đình mafia Corleone giữa lúc phải lèo lái con thuyền nghiệp đoàn vượt qua sóng to gió lớn, vượt qua cuộc chiến đẫm máu và sự bao vây đối đầu của “Ngũ gia đại chiến” mafia, mà còn thông qua những số phận ngặt nghèo, những mảnh đời thấp cổ bé họng, bị chính quyền và luật pháp mà họ hằng tin tưởng từ chối công lý, từ chối sự bồi thường thỏa đáng cho người bị hại và sự trừng phạt thích đáng cho kẻ gây ra nỗi đau, đã phải hạ mình lạy lục bố già Vito mang lại công lý cho họ theo một cách khác. Mặt tối của xã hội Mỹ, của cái thế giới mà Vito từ chối chơi theo luật của nó, với ý chí cương cường và nền tảng gia tộc mạnh mẽ, tự mình đề ra luật riêng của mình, “giang sơn xã tắc” riêng của mình để cai trị, để hiện thực hóa giấc mơ Mỹ của riêng ông, đã tạo thành bức tranh nền hoàn hảo cho chất tăm tối và hồi hộp thẳm sâu trong từng diễn biến công việc của gia đình Corleone, đã biến “Bố Già” trở thành không chỉ một bức thánh thư toàn mỹ về thế giới ngầm với những cơ hội làm ăn bất chính, mà còn là - ở hình thái đơn giản nhất của mặt giải trí điển hình – một cuốn phim hành động kinh điển với những pha “trải nệm” nghẹt thở, những tính toán đầy mưu chước lạnh lùng không chỉ đến từ bố già mà còn từ người truyền nhân xứng đáng của ông.Giữa bầu không khí tàn bạo, sặc mùi giang hồ và những tính toán thâm trầm nguy hiểm của gia đình Corleone, “Bố Già” vẫn còn đó cái khía cạnh nhân sinh cảm động, vốn luôn song hành cùng những dữ dội, bạo lực và mưu chước rùng mình. Cái khía cạnh nhân sinh ấy được thể hiện thông qua mong ước giản dị và chính đáng của Michael – ông trùm mới của nhà Corleone – ước mong của một người cha dành cho những đứa con của mình, những đứa con mà anh hy vọng sẽ được lớn lên trong an bình và êm ấm, sẽ trở thành nhà khoa học, bác sĩ, nhạc sĩ, luật sư, hay bất kỳ nghề gì lương thiện mà không phải dính dáng đến thế giới mafia đầy rẫy những hiểm nguy và mong manh lằn ranh sống-chết. Khía cạnh nhân sinh ấy còn được thể hiện ở niềm tin phút chốc bị rạn vỡ của Kay Adams dành cho người chồng Michael của mình, niềm tin về một hình mẫu ông trùm lý tưởng “làm gì thì làm chứ không được giết người, đặc biệt là người nhà” mà cô con gái cưng của một mục sư đoan chính đã thơ ngây dựng nên suốt bao năm qua. Thế nhưng, đáng tiếc thay, đây là thế giới ngầm, là thế giới có những luật lệ riêng của nó, những luật lệ khắc nghiệt và đối xử tàn bạo với những kẻ phản bội, thậm chí có là người nhà của ông trùm cũng không thể thoát ra ngoài cái vòng xoay luật lệ khắc nghiệt ấy. Người trung thành thì được hoan nghênh, kẻ phản bội thì phải bị trừ khử; đôi khi để duy trì an toàn cho thân bằng quyến thuộc và giữ vững nền tảng mafia truyền thống biết bao năm qua của gia đình, máu của ai đó sẽ phải đổ, mạng của ai đó sẽ phải bị lấy đi. Kay Adams không còn cách nào khác là phải chấp nhận sự thật này, chấp nhận bản chất công việc của chồng mình như vốn dĩ nó phải thế, và lấy sự ngoan đạo của mình ra, cùng với những lời cầu kinh thành tâm khổ hạnh, cầu siêu cho linh hồn chồng mình nhiều năm sau có thể an nghỉ tịnh tâm, thoát khỏi sự trừng phạt khắt khe của Chúa Trời…Nam diễn viên nổi tiếng Hollywood Tom Hanks đã từng phát biểu: “’Bố Già’ là sự tổng hòa của mọi hiểu biết. ‘Bố Già’ là đáp án cho mọi câu hỏi.”. Thực vậy, bởi hiếm có cuốn tiểu thuyết kinh điển nào tôi từng đọc lại có thể gói gọn bức tranh của cả một thời đại, một nền văn hóa và truyền thống mafia Ý sống động, đầy tính người mà cũng thật đau thương, bạo tàn đến như thế. Hãy đọc, và hãy để bố già Vito Corleone, hay chính tác giả Mario Puzo của chúng ta, nói cho bạn nghe mọi điều bạn muốn biết về thế giới ngầm, về những con người theo nghiệp giang hồ nhưng lại vô cùng chính trực, về một xã hội Mỹ hậu chiến nhiễu nhương trắng đen lẫn lộn, về sự thông tuệ và những phẩm chất khác cần có của một thủ lĩnh đại gia đình, về những mảnh đời mà số phận của họ đã gắn chặt với niềm đau và ánh huy hoàng của “triều đại” Corleone hùng mạnh. "}, {"Review": "I saw the movie few years ago and loved it. I was unaware at that time that its an adaptation of a book of same name. Courtesy Goodreads I finally came to know of this fact. But still I was in no mood to read the book until my friend Srividya recommended it to me.There are so many aspects of the book that I loved but characterization simply blew me away. Puzo has given his characters so much depth. Don Corleone, Michael, Tom Hagen, hot-headed Sonny and every other character was brilliant. Corleone family literally ruled the American mafia but they have their own rules that they strictly follow. Corleones are always ready to help their friends.Story was not very simple, there was a mystery that unravels slowly but worth the wait. There were many subplots in the story which I enjoyed immensely except Lucy Mancini. I don't know why so much focus was given to her when her story didn't add anything to the origins story. But I like almost everything else that I am overlooking that part.It's a well written and highly enjoyable book!"}, {"Review": "2017 PopSugar reading challenge #31 A book where the main character is a different ethnicity than youTenía cierto temor de que el haber visto la película me arruinara un poco la experiencia de leer el libro. Bien, en un principio lo hizo un poco, y por eso lo dejé en pausa, para dejar correr un poco más de tiempo, y finalmente logré disfrutarlo como era debido. Este tema a mí me emociona un poco demasiado y no sé por qué, pero la cosa es que el que esté tan bien trazado me hace pensar que no existe libro que iguale o supere a Puzo en este aspecto. Los personajes son tan crudos a la vez tan reales que como sea es inevitable la familiaridad del lector para con ellos. Es una narración bastante simple, pero exacta para abordar este tema tan complejo que representa la mafia.Se convirtió en uno de mis libros favoritos desde que lo empecé a leer, no hay duda. Y la película es de las mejores que he visto en mi vida."}], "Genre": "Crime", "ID": "22034", "Desc": ""}