{"Genre": "Crime", "Reviews": [{"Review": "Cards of Love: Five of Cups is more thriller, suspense and mystery than romance. I’m not kidding—Ian and Porter are together once. That’s right. Once. If you’re searching for passionate romance with this novella, you won’t find it here. However, in saying that, this quick novella is actually good for what it is. Pacing is even. Characters are multi-dimensional. Story is jaw-dropping. Writing very poetic that will draw you into its story-telling. Ending was totally unexpected and mind-boggling. F"}, {"Review": "What can I say except that Trisha Wolfe never fails to amaze me. There is no putting this woman or her work in a box. She surprised me at every turn, from the all male POV, to the sarcastic humor, to the more personal feel and the blasting of the fourth wall! She changed it up, worked her magic and had me under her spell. With all that is different, somethings remain the same. In Five of Cups, the darkness is a bit more subtle than in her recent work but it's there and delivered in that uniquely"}, {"Review": "LIVE on AMAZON for Only .99 cents Limited Time!!!!"}, {"Review": "My Thoughts on Five of Cups Trisha Wolfe once again brings readers a great book, this one centered around tarot cards. I loved it. I absolutely loved it.Dr. Ian West was the kind of smart that's sexy. He makes me wonder if other trial consultant books could be this good. I liked him and Porter as a couple. I loved their connection and shared history and the way things developed between them. But Ian himself is what really did it for me with this story. I don't even really feel like I can properl"}, {"Review": "Received ARC from AuthorI Give this Book a 3 Star RatingHeat Level: 3ishAs soon as I started reading I was instantly drawn in, especially to the eerily dark poetic beginning of the Prologue.The deeper I got into this story I gotta say I had no idea what was going to happen, couldn’t even predict and I mean that in a great way, the story just kept my attention .West is a very likable guy and enjoyed his POV, and very reasonable.I’m not really a fan of Porter, I personally just didn’t find her ver"}, {"Review": "Is your cup half full? Or half empty?I absolutely loved this book and fell in love with Ian and Porter. Both characters are very realistic and relatable. Poter with her sacrifices. Ian with his sarcasm. Both broken in their own way and finding their own ways to deal with everything that has happened. One thing I have come to love about Trisha's writing is the realism and the twists. She takes us to a place that feels tangible. A courtroom, in this case, that feels like we are a part of the whole"}, {"Review": "So far I’ve read a handful of the Cards of Love series, and I won’t lie to you, Five of Cups is THE BEST!!The way Trisha writes is mesmerising. She somehow manages to throw so much information, filled with witty one liners and too many twists and turns to count, all into one book! I’m a huge fan of law and order type books and Trisha manages to go into great detail regarding West’ job, his team, even into his mind. He is a professional and my goodness, was she able to keep my eyes and my mind gl"}, {"Review": "3.5 stars Ian West è uno psicologo, non particolarmente attratto dalla professione stessa è un consulente e lavora con un team di avvocati e poliziotti per condannare i cattivi.Dopo aver perso la propria fidanzata tre anni prima, per lui sembra essere arrivato il momento di guardare avanti, di uscire da quella bolla di isolamento in cui si era rinchiuso. Dopo tre anni, si concede di vedere Porter con occhi diversi.Porter era la su migliore amica, quella che c’era prima di Mel, quella che gli ha"}, {"Review": "First book I’ve read by this author! If I’m honest I struggled a bit with this book but only due to that this book took more thinking on my part. I generally read books which are light and easy. I found myself having to take more breaks during reading...which I never do. However the storyline was amazing! The characters were interesting, often blunt, sometimes witty and I was intrigued! A courtroom consultant using his psychological knowledge to help the prosecution nail a murderer! With some tw"}, {"Review": "It's so good!!!!!This wasn't the normal dark we've been getting from Wolfe lately. But it was still dark and edgy. And will have you flipping the pages. Dr. West is cocky and arrogant. And after losing is fiancé he has become a little closed off and bitter. But now that has finally opened is heart again will all that arrogance make him lose it all again? Or will the vulnerability help him realize Porter is worth laying is all on the line? How far will he go to save his best friend and the woman"}, {"Review": "Five of Cups by Trisha Wolfe is an emotional, psychological and intense thrill ride. I LOVED Dr Ian West. I was hooked from the start and couldn't put this book down. Once again Ms Wolfe gives us a storyline, and characters that will WOW you! "}, {"Review": "Trisha Wolfe never fails to deliver yet another mind blowing psychological thriller. It’s intense, gripping, brilliant and as always; unexpected. I need this to be a series! I’ll devour it without any hesitation. "}, {"Review": "Really interesting story. This was my first read by Trisha Wolfe and it won’t be my last. There was twists that you won’t see coming and definitely the story will keep you intrigued. "}, {"Review": " \"Everybody has a card. It’s their judgment. Their imminent fate. The cards don’t lie. They offer insight, a choice.\" Cards of Love: Five of Cups is definitely going down as on of my favorites by Trisha Wolfe. The authors hauntingly beautiful mind did not fail to deliever another fantastic, suspenseful read. I loved how every page of this book only got more thrilling then the last. Five of Cups was a perfectly woven web of suspense, mystery, and thrill. I could not devour the pages quick enough."}, {"Review": "Different This book was a bit different than the usual because almost the entire story was told from a male MCs POV. The man is psychologist and expert jury/trial consultant Dr. Ian West. This story in the Cards of Love series of unconnected stories, concentrates on a trial of a alleged killer who is drug lord, cocky and confident that he will be aquitted. He is manipulative and controlling, he thinks he will win. Dr. West is also very intelligent and confident, but he believes the jury will be"}, {"Review": "Couldn't put it down! Trisha Wolfe delivers another sexy psychological thriller that you won't be able to put down. With the Arcana Killer (a man who uses a tarot deck to choose his victims) supposedly in police custody, trial consultant/psychologist Dr. Ian West is helping the prosecution put him away for good, but best-laid plans, right? With his ex-bestie Porter working for the defence Dr. West attempts to protect her from her client's subtle threats by agreeing to take the stand regarding te"}, {"Review": "Trisha Wolfe writes dark, psychological suspense so well. Team that with murder and romance and I’m all in! Once I started reading The Five of Cups I couldn’t put it down. A clever storyline, with so many twists and turns, had me hanging off the edge of my seat. Characters who conspire, together with the fast pace of the storytelling, means that you need to keep your wits about you in order to fully appreciate the complexities of the plot.I love that the story comes from the male point of view,"}, {"Review": "I Love This Book 📚 If you like The Mentalist, Bull or even Criminal Minds, this book is for you ❤I have to admit that this is the first book that I’ve read by Trisha and I didn’t know what to expect, I’ve read the blurb of this book and others of her and said WOW this is going to be a hard limit for me but to my surprise I couldn’t put it down. I liked that we have the male character point of view for this book because I love to read about troubled characters that are dealing with grief and lost"}, {"Review": "I’m really confused as to why this author hasn’t been picked up by a major television network to write shows-I’m that mind boggled. This has been my favorite book in this cards of love anthology-it’s so intricate, and really grabbed me by every cell I had and immersed me into a world I wanted to quickly crawl out of-simply because I was scared. It’s hard to pinpoint where this author was going to throw a twist in-they’re so prevalent and creative that I simply could never do her justice by think"}, {"Review": "Wow. These Cards of Love stories just keep getting better! This one follows a man wracked by grief, struggling every day with his loss. Throwing himself into his work where he helps punish the guilty he finds himself up against an insane killer with a walk particular interest in Tarot cards. Opposite him is said killers defense attorney, his old friend, someone he pushed away in his grief, only to realise that she might have meant more all along. The killer, a puppet master, uses his cards to th"}, {"Review": "\"How do you see your cup, Dr. West? Half full, or half empty? Her life depends on your answer.\"Dr. Ian West is struggling with grief after the loss of someone very important in his life, while tasked with helping to put a serial killer away for good. The Arcana Killer isn't interested in going down without a fight and suddenly the game becomes personal. Ian West can't handle any more loss and grief, so his mission...whatever he needs to do to make sure he doesn't have to.Brilliant, this story is"}, {"Review": "Awesome Dr. Ian West is struggling with grief after the loss of someone very important in his life, while tasked with helping to put a serial killer away for good. The Arcana Killer isn't interested in going down without a fight and suddenly the game becomes personal. Ian West can't handle any more loss and grief, so his mission...whatever he needs to do to make sure he doesn't have to.Brilliant, this story is nothing short of brilliant. I am a huge fan of the current TV show that explores the u"}, {"Review": "I did struggle with this book. This one is different from the other Cards of Love books. This book is more a who done it type mystery / thriller twist type of a book. West is a very likable guy and enjoyed his POV, and very reasonable. In this book, it is a courtroom setting, which feels like we are a part of the whole process. A behind the scenes peek into the happenings. The fact that this is all West's POV is also something that I find adventurous, we get all the feels from him, the who's and"}, {"Review": "Intense!Dr. West, at first look, may seem a bit arrogant even a little cocky - as one of the top trial consultants he has earned that right. He analyzes every tick, blink, and change in pulse - he can see that you are hiding something- he knows you have a secret. What happens when evil decides to turn the tables on, Dr. West? Can he face his own secrets? Will the truth be more than he is capable of accepting?A psychological thriller that will take you to the edge of the abyss - pause - only to l"}, {"Review": "When I read this author’s work, I feel like in the midst of watching True Crime. Maybe a little Criminal Minds as well. She doesn’t weave this big elaborate love story and let that be it. The author provides you with a story that flows. She provides you with a story that makes you engrossed with the characters and the who done it. With that said, I had a love/hate relationship with Porter. Her character was funny and smart but I felt like her character wasn’t fully needed. I feel like most of th"}, {"Review": "What fate does the cards hold for you? Psychologist Dr. Ian West who is a trial consultant in the city finds that out when he tries to take down a serial killer who uses Tarot cards to determine his victims fates. This author is nothing if not unique. This book is only done from the male POVs. The courtroom scenes (which are a plenty) kept you captivated and flipping the pages. And of course a twisted ending.. "}, {"Review": "Unpredictable and DarkCards of Love is uniquely dark and unpredictable. The great thing is the author always changes the intensity and idea of dark with every book she writes and there can be no expectations except that I know it will always be a great read! Characters working through their demons seems to be one of her specialities and she delivers in spades."}, {"Review": "Is your Cup Full or only Half Full?Call me blown away. I've read several of Trisha Wolfe's books and loved them all, but Cards of Love was absolute genius. It was incredibly fast-paced, had me on the edge of my seat, and just had so many twists and turns I needed to be strapped down in my seat to stay upright. "}, {"Review": "Absolutely fantastic! Couldn't put it down! From start to finish the twists kept coming,no one writes thrillers like Trisha Wolfe.My only fault is that this is a standalone,I would love to read more about dreamy Dr Ian West! The ending blew me away...had to read it a few times and pick my jaw up from the floor! Flawless 😍"}, {"Review": "This was a epic read. I love Dr West. It was like an episode of law and order. Loved it so much. Ga what a brilliant twist at the end. Very well written fast pace. Never a dull moment. Could't read fast enough. It a well known fact that Trisha is my favorite author but she always amazes me with a killer book. Great work."}], "ID": "41830687", "Name": "Cards of Love: Five of Cups"}