{"Genre": "Crime", "Reviews": [{"Review": "A baby is kidnapped while the parents are next door.Mayhem ensues. It’s a captivating story, I’ll admit. At first, at least. Then, it becomes too convoluted to keep its realism. So the story isn’t bad per se. If you don’t mind crazy, nefarious scenarios with outcomes that lead to more crazy, nefarious scenarios, you might just love this.I couldn’t.I couldn’t because it didn’t sound right to me. Especially not the ending. What a stupid one. The character would never have done such a thing. Not af"}, {"Review": "ZERO SPOILERS!!!! ZERO SPOILERS!!!! LESS THAN ZERO!!! SAFE TO READ!!!!It's 3am....I just finish reading this -'sleep-killer'-story....My final HONEST REACTION?.......**HYSTERICAL**!!!! SO MUCH FUN!!!!! I could roll on the floor laughing right now....SOOOOOO FUNNY .....GREAT WILD RIDE!!!!!!Really...I'm not sure if I'm laughing at myself - or the story - or both! A few random thoughts - as you know I'm not going to give anything away: ......This is a question for my women friends: When you are str"}, {"Review": "3.5 starsA swanky rich couple have a six month old baby. The babysitter cancels at the last minute, buuuutt the husband really wants to go to that dinner party next door with the hottie neighbor. He convinces the wife Anne that it will be just fine to leave the baby by herself and check on her every thirty minutes. They return home to find the baby is now missing.  Then all the secrets...gotta have secrets. Mom is struggling with post-partum depression. Could she have done something to the baby"}, {"Review": "THE COUPLE NEXT DOOR is an outstanding debut psychological thriller novel from author Shari Lapena, and one of the best reads I have read this year! This novel, a child-abduction case, races along at an amazing speed, full of twists and turns, totally gripping the reader for the suspense ride from beginning to end. I kept flipping the pages as I had to know what had happened. I loved it! “They left their six-month-old baby (Cora) home alone and went to a party next door.” But with the monitor on"}, {"Review": "Wow . . . what was that ending?! OK, let me back up.There's no denying that this is a compulsive page-turner. At the heart of the story is a frenzied pulse running rampant and it’s addicting. Ending chapters with shocking revelations, casting doubt and making me waver on my belief of who was behind it all, time and time again, was pure magic. I read this book over the course of one day, simply because I couldn’t bear to put it down. I had to know who took baby Cora and WHY.With that being said,"}, {"Review": "My reviews can also be seen at: https://deesradreadsandreviews.wordpr...I still haven't listened to very many audiobooks. While I prefer to read on my e-reader or read a book, I really do like having the option to listen to an audiobook now and then. It's a nice change and I can close my eyes (as long as I'm not driving). But I don't close my eyes often as usually it doesn't matter how exciting the audiobook is, I could very well fall asleep.However, I didn't have that problem with this one. I w"}, {"Review": "It all started with a “what were you thinking?” moment! Then rapidly morphs into a parent’s worst nightmare. Anne and Marco have a dinner party to attend next door when the babysitter cancels at the last moment. Of course, being responsible parents, they have no choice but to cancel dinner. Right? Well...no! They make the unbelievably foolish decision to still attend. Their genius solution? Simply leave their 6 month baby home alone and just take the baby monitor! What!!?😳As you may have guessed"}, {"Review": "3.5 starsThe first 75% of the book was terrific--lots of twists and turns, well-paced, interesting character development and relationships, I was eager to return to my audiobook every time I was away from it. I also loved that contrary to most thrillers that save the big reveal for the end, in this book, you find out who kidnapped the baby halfway through the book--so you get to watch everyone scramble and unravel from there on out. I liked it so much that I was mentally composing my 4-star revi"}, {"Review": "Cynthia and Graham invite next door neighbours Anne and Marco to a small dinner party but tell them not to bring their small baby. Cynthia and Graham, themselves childless, are not child-friendly. The pre-arranged babysitter cancels at last minute so Anne and Marco decide, reluctantly. to go anyway, leaving baby Cora alone, taking a baby monitor and agreeing to take turns checking on her every half hour. So far so good.....until....Anne and Graham return home at one in the morning and to their h"}, {"Review": "3.5 Stars. This book turned out just meh for me. I was completely sucked in from the start and then at about the 65 % mark the characters started annoying me and I wasn't thrilled with the ending. Some other people might like this more than I did. I read a lot of psychological thrillers so now very few are 5 Star reads for me.A special shout out to Kirsten Potter the narrator. She was awesome!!! This is very easy to follow on audio. "}, {"Review": "Wow! This is one of my favourite reads of 2016 and is long-listed for my Top Ten Books of 2016. This totally took my breath away and from start to finish I was totally lost in this book and the desire to know the truth. I HAD to know the truth. I guessed the ending so many times, should not have bothered, it was brilliant and had so many twists I was feeling motion sickness!Honestly, check out the blurb:You never know what's happening on the other side of the wall.Your neighbour told you that sh"}, {"Review": "HA! What a wild and \"crazy\" ride!Sometimes when I read a crime-thriller, I become bored with the pace or exasperated with the clues and detective types, but not so this time. Each character had their own complex personality, and/or presence here, and there is never a dull moment.Without giving anything away, I'll just say, be prepared for a shocking crime and horrendous secrets revealed, some of which, you will find terribly disturbing!I entered this mystery not knowing anything about the plot s"}, {"Review": "One star is for me because I finished it. One more star because the author came up with some good character names. Cora Conti, Cynthia Stillwell, Detective Rasbach I'm looking at you.Well, that's about all the nice nice I can make.I can't get past the clunky, amateurish writing! If I heard \"Marco said\" \"Anne replied\" \"Cynthia stated\" ONE MORE TIME....oh my gosh. If you, as an author, are going to write a book that is almost entirely dialogue, wouldn't you make sure you were a damn fine dialogue"}, {"Review": "*Thank you to Netgalley and Random House UK, Transworld Publishing, and also to Shari Lapena for my ARC in exchange for a fair and honest review*Goodness me, this book was so full of twists and turns, I don't know whether I'm on my head or my heels right now!Imagine the horror of discovering your 6 month old baby has been abducted from her crib in the early hours of the morning. Imagine also the myriad of emotions you'd experience. Well, that would be bad enough, but what multiplies that horror"}, {"Review": "First of all, I'm a skeptic by nature. By going into a thriller, I go in grudgingly knowing I'm going to be critical. Suspending belief shouldn't be required for a story done well. As I'm reading, this is the constant chatter going on in my head recalling Elaine in a Seinfeld episode - \"maybe the dingo ate your baby.\" I'm thinking anything is possible at this point - including the dang Dingo!This is warped. Let me preface it. A baby is missing. Stolen from her crib while her parents sat at a din"}, {"Review": "2.75I never read drama like this before Was almost to be worst book of 2017 "}, {"Review": "Most of my friends loved this, but I wasn't as wrapt. At all. Yes, very, very edge of your seat worthy reading, but the end result was a little flat for me. As a debut, this was brilliant work and I commend the author for writing a book that most of us just could not put down.I felt it was a train wreck of completely messy, unscrupulous and totally moral lacking characters! I know we are not meant to always love the characters we read about, but I was eye rolling many times. Marco. What a spinel"}, {"Review": " \"They held onto each other, weeping. Two shattered people, one of them a liar.\" I was really enjoying this book! Lots of twists and turns and untrustworthy characters, right up until the last 20 pages, which blew it for me.Anne and Marco have a beautiful baby girl named Cora. One evening their babysitter cancels when they are due to go to their next door neighbours' for a dinner party. Marco says it'll be fine, they'll take the baby monitor and check on her every half an hour. What could go wro"}, {"Review": "I highly enjoyed \"A Stranger in the House\" so I was very much looking forward to reading Shari Lapena's previous novel \"The Couple Next Door\". As expected I thoroughly enjoyed it, I raced through the intriguing pages and I have to say that it is neck and neck as to which I preferred the best, as both were hugely entertaining.It does takes a while to get used to the authors writing since she uses 'third person present tense' but once you adapt to it you soon fly through the story, it was very eas"}, {"Review": "Anne and Marco's babysitter cancels at the last minute when they have a dinner party next door. Marco talks Anne into leaving their six month Cora alone because they can bring along the baby monitor and check in on her at half hour intervals. When the two arrive home shortly after 1 am though Cora is no where to be found and the police are called in to investigate. As the investigation proceeds it becomes increasingly clear that the kidnapping was orchestrated by someone close to the couple or t"}, {"Review": "The Couple Next Door by Shari Lapena is a 2016 Pamela Dorman Books publication.  A hypnotic and atmospheric thriller.This story starts off with a familiar- ripped from the headlines- setup where a couple, Ann and Marco, decide to leave their young daughter home alone while they attend a dinner party next door. They bring the baby monitor and check on the baby every half hour. However, when they return home from the party they discover the child has been kidnapped. After reading the first chapter"}, {"Review": "Dense particles of deception are scattered in every nook and cranny. What you think that you see with your own eyes is not necessarily what you see. Anne and Marco Conti must really have an intense thing for dinner parties. Marco talks Anne into leaving their newborn infant next door with a faulty baby monitor. They will take turns checking on her every 30 minutes. Sounds like a great plan, huh?Our model parents have also taken to tipping back on the wine goblets, too. Not a sober soul in sight."}, {"Review": "Yes, yes yes yes yes!I love it when there is a up and coming author who just produces such an amazing book it looks like they have been a best seller for years. I am not kidding, this is truly a remarkable read.I know us reviewers, we say things like 'twists and turns' 'unputdownable', stayed up all night to read it, but I tell you, its so true.If you are a passionate reader, and I know that you are because you are on Goodreads writing reviews, then you will certainly understand my gushing on th"}, {"Review": "So there's a couple named Marco and Anne Conti who have a baby called Cora. They are deprived of outgoing social activities, and when the neighborly couple are inviting the Conti couple to a party, it's hard to resist.There are some twists involved in the plotting of this book one or two of which are ponderous. Like, the babysitter cancels at the last moment. That means the baby is going to be alone. The latter is still going to be monitored audibly. So the young couple go to the party.I gave th"}, {"Review": "Pues oye, lo he disfrutado un montón.No soy mucho de leer novelas de este género, pero he de decir que cada vez estoy leyendo más y estoy encontrando una vertiente más que interesante que de primeras no era mi favorita. He leído varios comentarios respecto a la voz narrativa, porque no es muy utilizada en este tipo de novela: es en tercera persona, sí, pero narra en presente. La verdad es que yo estoy acostumbrado a leer novelas en presente, aunque en esta ocasión había alguna cosa rara (como si"}, {"Review": "Shari Lapena has tapped into a universal fear among parents.  Just imagine,  your 6 month old baby is sleeping upstairs, the babysitter has cancelled at the last minute and the dinner party you have been invited to attend is literally just next door, one shared wall away.  You can take the baby monitor with you.  No problem.It is in keeping with human nature I think,  that once tragedy strikes we are all inclined  to sit back and say “How could they have possibly?”  Don’t misunderstand me, I am"}, {"Review": "I've read this book before.Well, ok, not this book, but I've read many of its fraternal twins, and the gene pool is starting to feel a bit shallow to me.The Couple Next Door has an interesting hook: a six month old baby disappears from her crib while her parents are next door at a dinner party. It reminded me of the Madeline McCann case, and I was interested to see how the plot would develop. However, reading this book was at times like playing thriller bingo. The couple that seems perfect from"}, {"Review": "A Sagrada FamíliaHá:Uma bébé desaparecidaUm casal que sabe tudo, mas nada pode dizer!Um marido gastador Um avô materno ricoUns vizinhos depravados E uma mãe perturbada capaz de sabe-se lá bem o quê?!...E é basicamente este, o berço da chama que ateia o rastilho deste magnífico thriller!...Além disso, há mais:\"O Casal do Lado\" é também um mergulho no poço Amor-Ódio que dá pelo nome de Família.Aquela amalgama de seres heterogéneos que se chocam, julgam, agridem, usam, abusam... e pouco ou nada se"}, {"Review": "\"He is very interested in seeing what he will find at the murder scene.\" How does this sentence make you feel?A. So riveted! Give me 300 more pages! B. I'd rather eat a loaf of white bread than read more.C. Someone made money with this caliber of writing, and yet my 630-page manuscript about holographic forest animals remains unpublished?!If you answered A, then The Couple Next Door is the book for you! With all the intricate detail of a cinder block and sophisticated syntax of a sedated toddler"}, {"Review": "Find all of my reviews at: http://52bookminimum.blogspot.com/I read this book because everyone was reading it. We’re talking EV.ER.Y.ONE. Think I’m kidding?  Yep. I’m still 30th in line at the non-porny library (and yes I just removed this request – I’m an old lady and forget these things sometimes). Since this is a mystery you’re going to get an even crappier review than I normally barf out. The basic premise of The Couple Next Door is that Marco and Anne’s babysitter cancelled at the last minu"}], "ID": "28815474", "Name": "The Couple Next Door"}