{"Name": "Lies Sleeping", "Image": "https://images.gr-assets.com/books/1517326409l/36534574.jpg", "Reviews": [{"Review": "The Post in Which I Muse on Audio Versions of BooksStop reading the paper copy and give listening a go. You will likely not believe me; you will tell me that you hate audio books, that you lose track, fall asleep, and are 100% unable to pay attention. I believe you; until this series, you could have counted my attempts at audio books on one hand, as I suffered many of the same complaints. When I listened to Harry Potter while driving, I found myself getting sleepy. If I listened while cooking, I lost track of either my numbers or the plot (and that's no good when it comes to spices, let me tell you). But then came Kobna Holdbrook-Smith, the reader for Aaronovitch's books. As much as I enjoy the written version of Peter Grant, the audio is superb. Kobna Holdbrook-Smith is a deity among readers. Trained as a theater actor, I suspect his versatility shows in his voices; from the Welsh pathologist, to Nightingale's upper-class 'posh,' to the saucy junior apprentice Abigail, to the breathy, Cockney accent of a new character, to the semi-insane voice of a returning one. Aaronovitch writes in a multicultural London and uses it all, and I'd say Kobna's only shortcomings are in the American (awkward) and Vietnamese accents (comes off similar to his Sierra Leone).I did something I've never done with Lies Sleeping: I alternated between paper and audio for the duration of the book. I mean, except for that tiny part where I jumped ahead to the last paper chapter to see how it ended, and except for that other tiny part when I skimmed just a tad to see how we got to that part, but other than that, I was totally faithful about alternating between the two and not getting too far ahead. Since I save audio books for the car, this was no doubt a surprise to any friends who witnessed a month-long reading adventure. Anyway, it was a pleasure having Kobna's voice echo in my head as I read. Aaronovitch's writing is clever, full of references, Britishisms, Latin words, and all sorts of things where looking at the format of the word is nice. But he loves architecture to the detriment of other aspects of writing, and if you pay attention to his dialogue, it mostly consists of 'said.' Witness:\"'Burnt...,' said Dr. Walid. 'We were just about to excise it...''You can watch if you like,' said Dr. Vaughn.I barely heard her because I'd just recognized the shape of the tattoo...'G for Gandalf,' I said....'And I suppose you're fluent in Elvish?' said Dr. Vaughn, by way of retaliation.'No,' I said, 'but G is what Gandalf stamps on his fireworks...'\"On the one hand, it is a relief to be spared the adverbs of the beginning writer, who 'laughingly, retorts, whispers, utters, and bemoans' their way through entire scenes. On the other, the opportunity for character enhancement is missed. Solution:Leave it to Kobna.\"Here's a comforting thought for you, Peter,' he said. 'However long you may live, the world will never lose its ability to surprise you with its beauty.'\"Technically, it's four-and-a-half stars for me. See, not a total fan-girl.Stop reading here if you don't want any spoilers. Silly goose; it's the seventh book in a series. (view spoiler)[Why not five stars? For the paper copy, the aforementioned architecture versus character issues. Less buildings, more people or setting please. I don't want to see all your research, Ben, about when things were built and with what; I want to see these people come alive, smell the London air, hear their voices, etc. I do remember Peter smelling the oubliette, so I know you think of it too. But there was too many buildings, not enough people. Things I loved: The end of chapter 29, when Molly and Foxglove are dancing. I could have cried, it was such a relief after all the badness. And I felt such a visceral reaction to everything Leslie did; that was truly some excellent writing. When she shot Chorley, I was as aghast as Peter. She went fully Dark Side. Was it because she still had a twisted notion of justice or things to hide? I'm cynical enough I went with things to hide. Love that Peter continues to get distracted when talking to absolutely everyone, even Chorley. Love that Beverley in 800 or whenever was a white dude... of course. And that he kisses Peter, and Peter rolls with it. It was freaking awesome. I laughed out loud in delight.Other thoughts: There is some humor in it, but not as much as earlier books. Peter feels more grown up, which was both nice, and a little sad. It happens to us all, but those earlier days of innocence are kind of fun.There are a lot of references to earlier books and the graphics, but the mentions feel kind of gratuitous and not integral, and Ben did another one of those things where I think he mentioned something he hadn't written yet. Freakin' authors. (hide spoiler)]"}, {"Review": "Londinium Calling!“and I – live by the river!”His best so far? Maybe, but I’m biased, I love these books, they are to me as cheeseburgers to a fat guy. Wait – I’m a fat guy and I LOVE cheeseburgers! * Note to self about getting lost in a metaphor. And cheeseburgers.Fans of Ben Aaronovitch’s wildly popular and fun as a barrel of monkeys urban fantasy series about DETECTIVE \tconstable Peter Grant who is also an apprentice wizard have been waiting since 2016 for this novel – and I hate waiting so it’s hard to say it was worth the wait, but it’s pretty damn good.** We did have some tasty graphic novels to tide us over.One of the attractions for me in this series is the minimalist fantasy, very rarely over the top with the magic, these are also good police procedurals. But the enchantment is real and original and fun to follow. Also delicious is Aaronovitch’s use of British and Celtic (and older?) history to fill in the backstory and he does it up in spades this time with travels back to Old Londinium and the Romans and the Celtic peoples who provided a warm welcome to the southern guests.Also, we get more of the action with Leslie and the Faceless Man and that storyline takes some definitive turns.Good fun and the only bad news is that except for the graphic novels, who knows when we’ll get the next one in this series????Hey! Aaronovitch? Please sir, may I have some more?"}, {"Review": "Coming back to Peter Grant is always a super-huge breath of fresh air. Every time I pick up one of these books, I know I'm going to be blown away by hugely interesting details, a very tongue-in-cheek Deputy-Constable's wry humor, and a richly imagined and described London.Oh, yeah, and Peter's a wizard. Working as a cop.Always under the bureaucratic nightmare, wishing things hadn't gone so bad with his previous partner, having sexytimes with a river... it's all GOOD. Even the takeout and stakeouts.Aaronovitch's writing is always a freaking delight. This is one of those cases where I say, \"Ignore the overt UF overtones and feel the magic in the telling.\" It's full of music, geeky humor, Latin, and enough British pluck to make you run to your mommy holding a teaspoon.Saying much more other than this is, by far and away, a police procedural with lots of great plot points and discoveries, might just give away the jig. Suffice to say, it's quality is just as good, and delightful, as the previous ones. :)What an end! WTF is going to happen next?"}, {"Review": "My greatest concern after finishing Lies Sleeping is that it may be the final book in the series. After all it does conclude the story of The Faceless Man which has continued over the last several books. It also leaves Lesley and Peter in ways that could be seen as conclusive, where the reader can be left to imagine how they will go on in the future. It is a fun book with all of the regulars turning up to play their parts. Molly finds a new friend, Mr Punch shows up and is taken in hand by his daughter (that bit is a surprise), Lady Ty seems to be warming up to Peter, Beverley has a nice surprise and Nightingale is.......Nightingale. You have to love him! The audio version as usual is superb. Kobna Holdbrook-Smith IS Peter and he does all the other voices equally well.There is plenty of scope left for more books.Please Mr Aaronovitch!"}, {"Review": "This is one of my all-time favourite series – and this installment was eagerly awaited and did not disappoint, as usual. There is just something charming and compulsive about this series that makes me very happy.I won’t write about the plot so much, because doing so invariably would spoil the books that came before (and what twists and turns there were) except to say that I found the way the story went and how some parts wrapped up highly satisfying. I know that there is a novella coming out in a few months (I am so glad!) but except for that I do not know where the story will go next – but wherever it is, I am sure I will be reading it.The best part, as always, is Peter’s wonderful narration, this time aided by the absolutely brilliant Kobna Holdbrook-Smith who narrates the audiobook to perfection. I felt a bit spoiled, having pre-ordered the paperback and then buying the audiobook but it was definitely worth it. Peter’s tone and his sense of humour are as brilliant as ever – but what I appreciate most is that he is a genuinely good person, always striving to be better. This is something I am always looking forward to in my reading, especially in a genre saturated by anti-heroes, and something I needed at the end of the long year that was 2018.There were some genuinely heartbreaking and heartwarming scenes in this book (the dancing! It made me teary eyed) and the ending was so very wonderful – I cannot wait for my partner to read this book so that I can squeal at him.If you like Urban Fantasy and haven’t checked this out, I highly recommend you do – I love Ben Aaronovitch’s mix of police procedural and highly inventive fantasy, his characters are wonderfully drawn and realistically diverse (it is set in present-day London after all), and his storylines (especially the overarching ones) are exciting and well-thought-out.You can find this review and other thoughts on books on my blog."}, {"Review": "4 of 5 stars at The BiblioSanctum https://bibliosanctum.com/2018/11/08/...I’ve made it no secret that I love Peter Grant/Rivers of London, and right now, it’s easily one of my favorite urban fantasy series. But for the last few books, our characters have been floundering in their hunt for the Faceless Man, the main baddie who has been a constant thorn in the Met’s side since the very beginning, and I was starting to worry that the lack of progress might soon be blowing up in all our faces. Luckily though, those wondering if we’ll ever get to see the end of this Faceless Man’s saga will be pleased to know, Lies Sleeping has the final showdown and answers you’re looking for. After seven books, this resolution was a long time coming, and it was awesome.Needless to say, if you’re not caught up with the series yet, be aware this review may contain references to events from the previous books, so only read on if you’ve read finished The Hanging Tree to avoid any potential spoilers. Since the last time we saw him, Peter has received a promotion on the police force and is now playing a key role in the operation to take down the Faceless Man, now identified as Martin Chorley, as well as his associate Lesley May, a one-time friend of our protagonist. Chorley’s grand plan for London has also been revealed, involving a dastardly plot to lure out one of the city’s oldest and most deranged gods—a supernatural killer with whom series fans should be very familiar.For this dangerous game of cat-and-mouse, Peter and his mentor Thomas Nightingale must shore up their resources and gather all the support they can get, calling in help from all corners including the regular police force, history and archeology experts, and even Arthurian scholars. But unfortunately for Peter, Lesley knows all his usual tricks, and worse, where to hit him where it hurts the most. Chorley is up to something big, and no matter how well the Folly plans, their target always seems to be a few steps ahead, constantly slipping through their fingers.Peter’s resolve has been tested before, but never like this. Lies Sleeping is the big shakeup this series needed, after all the breaks and build-up, and I think it succeeded in delivering both thrilling action and emotional impact. If the goal of the previous book was to bring us back into the thick of things and ramp up the momentum, then this one valiantly took up the baton and ran it to the finish line. I was also ecstatic that I got most of what I’d wished for, number one on that list being more Nightingale in action. While I’m not usually one for literary crushes, I’ve got it seriously bad for that guy. When all is said and done though, taking down the Faceless Man was very much a team effort, and I’m glad we also got the second item on my wishlist, which was seeing more involvement from the rest of the supporting cast. As I expected, Guleed has become a regular, and even more exciting is the fact she’s being brought onto the Falcon magical scene. Abigail becoming a fixture at the Folly was a nice surprise too, after getting know her well from The Furthest Station novella.Once more, I also found the humor in Lies Sleeping to be on the more muted side, but in this case, I think it’s okay, and even appropriate. Peter still makes me smile occasionally with his dry, sardonic wit, but this was probably one of the more serious sequels, because of all that it had to deal with. Over the course of this series, Peter has matured as a person, taking matters more seriously in both his professional and personal life, becoming a better police officer and a wizard while also settling into a stable relationship with Bev. Still, there are also certain things that never change, and Peter’s mega blind spot with regards to Lesley was the cause of much teeth grinding on my part. There was a moment too where I felt the plot might be falling into a repetitive pattern, but fortunately, Aaronovitch was able to pull things back on track following a lull around the halfway point and save the situation in time for the big finale. Personally, I found the climax to be a bit confusing, in the way things related to the genius loci usually are when it comes to these books, so I suppose that’s nothing new. Regardless, those who have always appreciated this series’ attention to the history and mythology associated with London will find lots of like about this book, I expect.And finally, Lies Sleeping has the unmistakable feel of a conclusion, though I do sincerely hope that this is just a wrap for the Faceless Man arc, and not for the series itself. It would be cruel to end things right as we’re seeing so much promise for our side characters, not to mention the big news dropped on us in the final few pages, but if this is going to be it, I’m also happy with how things played out. There are a few loose threads I wouldn’t mind seeing addressed, but overall I was impressed with how many conflicts were resolved by strongly tying them back to the series’ roots, i.e. where it all began in Rivers of London. I have no idea where Ben Aaronovitch will take this world and his characters next, but I’ll be crossing my fingers for more."}, {"Review": "Thanks to Netgalley and the publisher for providing me with an ARC in exchange for an honest review.Another strong installment in the Rivers of London series. The battles with the dark side are becoming more and more frequent, now that we know the Faceless Man and see more of his plans. But this one takes some even twistier twists and turnier turns and ends up in a place I didn't really expect.I had grown tired of this series after book 4, and took a VERY long break. In fact, I hadn't entirely planned on ever picking it back up again. Berkley offered me an ARC of this book in their newsletter, which I one-clicked before I thought... and I'm glad I made that impulsive decision. It made me pick up books five and six (both of which were great installments and fixed some of the issues I had with book four that made me set the series down) to get to this one and be caught up.It's not and never will be my favorite series, but I can now say again that I do very much enjoy it. I'll definitely pick up the next one to see what's happening in the world of Peter Grant and the Folly."}, {"Review": "Ah, that went by way too fast.If you're already a fan of the series, you won't be disappointed. And my, how our Peter's growing up, but without losing any of his self-deprecating irony. If you're not a fan yet, be apprised that Aaronovitch wrote for years for Doctor Who,  and it very gloriously shows. You'll want to start with book #1, \nRivers of London.\n Snag an audio copy if you can, because the audios are amazing.slideshow disclaimer: neither Banksy nor the helmet amulet figure in the book. I just really like them"}, {"Review": "A great follow up to The Hanging Tree, Lies Sleeping continues to follow Peter Grant and his search to hunt down and thwart the plans of The Faceless Man and his apprentice while getting himself mixed up in the demi-monde world, which this time involves bells, along the way. As I said when reviewing The Hanging Tree, I’ve found these novels to get better and better as they progress as the world is now so well established, and the characters are all charismatic and varied. In particular, this wouldn’t work if Peter himself wasn’t so damn likeable. He’s flawed - always trying to be the ‘do gooder’, likes the sound of his own voice, far too inquisitive to the point of verging on annoying...yet he’s down to earth, the every man of the Folly to counterbalance the extremes that are Nightingale and his associates. It helps that I’m also extremely fond of Beverley too. Goddess, girlfriend, and maybe more? I love all the Rivers, although we seem to see Tyburn and Bev the most, and the introduction of Walbrook here added another layer to their mythology. The world building and mythology is convoluted, and the writing style at times can get overly bogged down in descriptions and facts about London/buildings/literally anything. But I’ve come to expect this now of Aaronovitch, and there’s a certain charm in it that I find quite endearing. Yes, it can get complicated trying to decipher who or what various members of the demi-monde are, and what magic is, but we’re seven books in now and I feel like I have a good outline of this world and the creatures who inhabit it. We’re learning along with Peter, and it’s a fun ride. This expanded on the plot from The Hanging Tree well, delving deeper into the ultimate plan of The Faceless Man. I would have lik d to have seen a bit more of his world and his weird cat creatures and pale ladies and how/why they’re working for him - but this small mystery that remains only adds to his air of menace. (view spoiler)[We also see a lot more of Lesley May. One time friend turned enemy (or maybe just frenemy?) of Peter. Lesley is an interesting character. I’m not sure I like her, as she comes across as quite full of herself, but I think this is a front to hide a deeply insecure and troubled woman. And that ending just confirmed it. Sacrificing Chorley for Peter seems to me to be the machinations of a mad woman. But it has certainly got me excited for the next book, along with Beverley’s little reveal... (hide spoiler)]I really hope there isn’t a long wait before the next instalment, because the fast pace of this coupled with an exciting ending has just left me wanting more."}, {"Review": "Move over Newt Scamander, there's a new wizard in town! With better plots that actually make sense and not just load of over-egging codswallop!Sorry, I was still a bit carried away with the Crimes of Grindelwald movie. I thank thee, Ben Aaronovitch, for keeping my faith in urban fantasy and their wizards. Peter Grant is still my man, he is a solid character that's skillful, dedicated and dependable. Boring? Not a chance. Peter, as his colleagues and guvs always said, had a penchant for situations gone pear-shaped. Despite having the rest of the London police force, his enigmatic master, his river lover, and his diligent apprentice on his six, the threat from the elusive super villain Faceless Man and his minions was just too big. Aaaand it's getting more dire in this book, which is thrilling ride from start to finish. Definitely as good as Foxglove Summer, now spiced with Arthurian and Mithraic myths. Aaronovitch has seamlessly tailored a magical story based on these myths but made it fresh and entertaining with all the references of places and people in the urban environment - it is so immersive!Can't wait for the next one. This series is the bee's knees, I am just so chuffed whenever I am reading it"}, {"Review": "So, this was a rather fast one and no matter how hard I tried to read it slower, it didn't work (though not like recently I'm a very fast reader, to be honest....). Names, names, places, history, architecture, the pack is full and maybe even fuller than in last two books. L. is back and Mr Punch as well - I'm not spoiling, it's on the blurb! - and I had to confess I kind of... missed him? O.o I guess I'm going to reread the first book soon just because of that... O.oAnyways, fun fun, and I crave for more, but I guess more will be A TAD different from what we are used to already... ;) Tiny very tiny minus for too many deus ex machina moments (yes I have to bitch, duuh, otherwise my head will explode), but we want to keep our Peter in one piece, right?Also - Molly+Foxglove <3 I want the next book out already goddamit!!!!"}, {"Review": "(More like 3.5 stars, to be honest.)I had fun while reading this, but I can't say that I enjoyed it as much as I did previous instalments in the Rivers of London series. Peter's narrative voice is as fun as always, there's the potential for comedy and drama in the promised arrival of a baby Brook, and I'm glad that the Chorley storyline has been wrapped up (he couldn't go on doing Spectacularly Evil Stuff indefinitely without being omnipotent and/or making the Folly team seem incompetent.) I had a lot of feelings about Leslie May. I could have done without all the Dark Ages references, but at least Peter was very insistent on the fact that King Arthur is a mythical figure and the invention of Geoffrey of Monmouth. (I honestly would read at least a novella's worth of Peter Grant talking critical source analysis of medieval texts, especially if it works in as many Discworld references along the way as Lies Sleeping does.)However, there are significant plot holes, Chorley's masterplan never quite made sense to me even after the big reveal, and if you've spent several books building to a climactic confrontation with an incredibly powerful wizard, you need to make sure that it's got heft and consequences to it. I desperately wanted Aaronovitch to slow down in that scene, to give it a couple of additional beats to justify that build up. Instead I was, to quote late '90s cinematic masterpiece 10 Things I Hate About You, whelmed. This was also a book where, I felt, Peter spent much more time than before working independently. While it makes sense that as he climbs the police hierarchy and becomes a more skilled magical practitioner that he's capable of that kind of independent interaction, one of the joys of the first few books was the sense of the Folly as a small and scrappy group, us-against-the-world, with all the close quarter contact that inevitably resulted in between Peter, Nightingale, and Molly. Now, as Aaronovitch expands the cast of characters being trained at/involved with the Folly, there's inevitably less real interaction between those three, and I think the book suffers from that. I also get the sense that Aaronovitch no longer quite knows what to do with Molly or Nightingale. Perhaps he's reserving a book for each of them later on in the series, but I just don't think he's very interested in exploring how Molly came to be at the Folly, or in making explicit exactly what happened to Nightingale during World War Two. When Nightingale gets moments in Lies Sleeping, they're mostly big set pieces where he uses incredibly advanced magic and blows shit up to spectacular effect. Don't get me wrong, these are immense fun to read about and I love a fond description of all the ways in which a character is being skilled and competent. But you can't have a main character whose arc is simply \"working on refining his magical abilities to hitherto unknown levels, but off-screen\", and I'm worried that Nightingale is being set up as the powerful Jedi mentor who's killed off before his young padawan is quite qualified. "}, {"Review": "This book follows \nThe Hanging Tree (Peter Grant, #6)\n (my review) and ends (maybe?) The Faceless Man #2 story arc. In the process it advances the teeming multitude of long-term series plots, including the important Lesley May plot-line while creating more. I frankly found this book to be too much a tangled spaghetti of plots and characters to be truly enjoyable.I’ve been a long-term fan of Ben Aaronovitch's Rivers of London. I typically listen to them on audiobook, although I have read several in dead tree format. The series narrator Kobna Holdbrook-Smith has deservedly become the voice-in-my-head of DC Peter Grant. I listened to this particular book, which is 430-pages in dead tree form. Koban sounded hoarse at the beginning of the recording, but was in fine fettle after the first quarter.This series must be read in series order. It would be incomprehensible otherwise. Even with digressions to provide reminders of the backstory, the backstory is just too large and complex for a reader to ‘jump in’. Particularly annoying to me is that Aaronovitch has included events from his  Peter Grant/Rivers of London graphic novels Series   into the mainstream  Rivers of London Series  . For example events found in  Rivers of London: Body Work (my review)  are mentioned a couple of times. Events from \nRivers of London: Cry Fox #1\n, which I have not read, effect the events of this book to a greater extent. I don’t read many graphic novels. I frankly have a hard time keeping-up with the infrequently published print books of the series. The author’s co-mingling of plots from all the Rivers of London  stories makes following and enjoying the series harder for folks that are not all-in with the entire franchise.Prose, characters and plot are all very much as before although there is a lot more of them. As mentioned above, characters like Sahra Guleed and Abigail Kamara who play a large part in the graphic novels, now play a large part in the story. I frankly think that Abigail as a “Junior Apprentice” is just too cute. The Nightingale character, who I really like seems to have been relegated to a subordinate position in the series. While thankfully, The Faceless Man story arc finally ends the more interesting (to me) Lesley May plot line still has many books to go. In addition, Grant's romantic life, which I have found to be only mildly interesting, achieved cliffhanger status.An issue I’m having with series is the proliferation of magic practitioners and “Falcon Events”. Earlier in the series use and abuse of magic was a State Secret. The cover-up was extreme and effective. The Sub rosa existence of magic is a fave part of the series world building to me. With this book, it’s obvious that hundreds of folks in and outside of the Met are aware of it. How can this have escaped the notice of the media? Especially, with the bloodless carnage, fire and smoke that Aaronovitch wreaks inside the City? Even if the mobiles are fried by the magic, there are still witnesses.I like this series, but it’s wearing on me. It appears that Aaronovitch wants fans of the series to accept it as a way of life, like Star Wars or Harry Potter. The lengthening backstory is consuming too many pages. The series now has too many sub and long term plots, and too many characters (not all of them good). The author is also wont to spread these plots over more than one book, which dilutes their effect. The merging the graphic novel plot lines into the Rivers of London Universe exacerbates this. The graphic novels also look to be a higher priority with the author than the print books. It’s hard enough to remember all the events of the six print books, without having to figure-out if a story reference was in a comic book I didn’t read. I think the series is sagging beneath the weight of too many plots spread-out across too many types of media. Finally, this story ended a story arc. The author has not committed to an end to the series. I frankly can’t see myself reading twenty-plus Peter Grant books. In summary, this was an OK read for the series by Aaronovitch fanatics, but it was by no means an easy read for the rest of us. The Faceless Man story arc was drawn-out over too many books and too many other plot-lines were piggy backed onto it. It lost its definition. I thought this book was more a jumble of plots and characters that was aimed at setting-up for more books and graphic novels than bringing a number of the seven years of existing plot lines to a close."}, {"Review": "Halfway through the book I was still trying to find a cohesive plot. No red line in this one, more like the odd breadcrumb of something familiar... the breadcrumbs made up a story eventually and there were lots of entertaining bits and chuckles. I loved Foxglove. But the final battle was a bit WTF, the resolution was a teeny bit lame and the ending left me with a „Wait, what? That was it?“So, was that really it? The end of the series? Hm. Not sure how to rate this. 4 stars, because the overall series was great and lots of fun, I guess. Kobna-Smith did another great job of narrating this. Weird ending."}, {"Review": "A satisfying climax to the Folly's operations against the Faceless Man sees our man Peter at his earnest best.This is one of the best urban fantasy series currently being published, and a lot of that is down to the main character Peter Grant and his commitment to community and policing, and more critically, his fundamental belief in both. His point of view can be wry, but he has such a deep belief in the fundamental rightness of what he's doing that it makes him a protagonist that you can't help but like. That's in sharp contrast to his erstwhile partner Leslie May, who fails not because she isn't capable, but because she doesn't share Peter's unshakeable faith in his core values.Regardless, this brings the long-running Faceless Man story arc to a conclusion, satisfyingly bringing in elements from earlier in the series including Mr Punch, Leslie and the Rivers. The series could finish here, but it doesn't need to, and that's the hallmark of a good long-running series."}, {"Review": "I have been waiting with fluctuating levels of patience for \"Lies Sleeping\" to drop. It was worth the wait.In \"The Hanging Tree\" we learned the identity of the rogue wizard known as the Faceless Man whom former PC Lesley May had gone to work for. In \"Lies Sleeping\" we learn why Leslie defected to the Dark Side, so to speak, and it's not pretty.Since learning the identity of the Faceless Man, several things have happened. PC Peter Grant is now DC (Detective Constable), and DC Sahra Guleed is now DS (Detective Sergeant). All the police operations from the previous books have been amalgamated into one operation under the joint heads of Thomas Nightingale and Alexander Seawoll. The task is to find the (former) Faceless Man and stop him. Not an easy task once it becomes apparent that FM has something big, and nasty planned. Peter has to make an unlikely alliance...with the revenant that started it all way back in book 1 - Mr Punch.\"Lies Sleeping\" ties up a lot of loose ends from the earlier books, but not all of them, and it sets the scene for the series to go in new directions. Which, since Ben has said he will be writing Rivers of London until he dies, could be almost anywhere.We meet some new characters, several of which I hope stick around for further books. And we finally learn once and for all exactly what Molly is.The sly tips of the hat to popular culture continue. On one page alone is both an Asterix reference AND a Terry Pratchett reference.I am going to state that this is THE best book I have read all year."}, {"Review": " There are few series (serials?) that I last past book 3 or 4. Clearly this is one of them. After 7 books I think me liking the characters should be a given so what did I like or dislike compared to others in the series.My one ding on this one is that the novelty has worn off a bit. Everyone, for the most part, seem to be doing the same things which is comforting but might not keep my interest forever. I like Abigail's increased role and I am looking forward to more of Foxglove (hopefully) but I wish Peter would learn some new spells and Nightingale to reveal more of his past.These are small complaints, the scene with Nightingale, Peter and the rogue \"wizard\" was great. The mystery and chases were equally good, Guleed is a great character and overall it was an excellent book. I have never actually read one of these books, the audio done by Kobna is too good to think about anything else."}, {"Review": "I received a free ARC of this book via NetGalley. Thank you, Net Galley, I love this series. I can't wait until the audio book is out because all the characters are voiced by Kobna Holdbrook-Smith even when I'm reading the ARC. Action, magic, creepiness, and police procedural all wrapped up into one, and I'm only in the middle of the first chapter. I have still pre-ordered the audio book, though, because the writing really comes alive when Kobna Holdbrook-Smith reads it.Update: Lots more history in this one, and I love it. And that last page, Ben Aaronovitch!"}, {"Review": "I always think that pre-ordered Kindle books feel like surprise presents from Past Me to Present Me, and I was particularly pleased to have something I knew was going to be fun and entertaining, in the shape of Ben Aaronovitch's seventh Peter Grant novel, Lies Sleeping, to look forward to through the last few days of what felt like a Very Long Week last week.It didn't disappoint; there were lots of humorous reflections on policing, magic and the relationship between the two, enjoyable character moments, digressions into the history of London and geeky references and in-jokes, all narrated in Peter Grant's distinctive voice, and I enjoyed it a lot. I also continue to love Aaronovitch's multi-ethnic cast of characters and really noticed in this one the way Grant's narrative always identifies white characters as white, refusing to accept the unmarked status of privileged groups in British society. I did feel, though, that it was possibly a bit short on plot, and what there was suffered from some pacing issues, with an odd lull about three-quarters of the way through and then a rush to wrap things up (including one major ongoing plot being tied up in a somewhat anticlimactic way). I think this is largely because, like a lot of series, the longer this one goes on the more it becomes less a series of separate stories and more of a roman-fleuve, with much more of a focus on the interactions and development of the regular characters than on the plot, but I would have liked a bit more actual crime-solving. Also, I thought it could have done with better copy-editing as there seemed to be a lot of the kind of errors that creep in when a text is being rewritten and revised electronically (though this is not the only book I've had this problem with recently - are publishers cutting back on proof-readers?). Mostly, though, I just thought it was fun, and definitely over too soon."}], "Genre": "Crime", "ID": "36534574", "Desc": ""}