{"Name": "The Best Bad Things", "Image": "https://images.gr-assets.com/books/1522786743l/37941735.jpg", "Reviews": [{"Review": "*Trigger Warning, book contains very explicit content and violence.*Inspired by one of the busiest seaports on the West Coast in the US, Townsend was a well-documented hot spot for smuggling in the late 1880’s. This makes it a perfect setting for a historical fiction novel with such a daring plot. Amidst the dirt of the trade, the characters are edgy, the scenes are explicit and the atmosphere reeks of dark, pungent alleys, infused with betrayal, espionage and murder. From the Author’s Note:San Francisco Chronicle, 1893: “The opium ring of the Northwest is a fearful, shadowy, impalpable something; shadowy in form, but most substantial in fact. It makes its presence known, yet it’s itself unknown. The subordinate members obey a system… [Directed by] some prominent citizen whose reputation in the commercial and social world is untainted….[U.S. government agents] are baffled and, watch as they will, they cannot find evidence enough to bring this man to justice.“The first thing that stood out to me was the writing in this novel. It is razor sharp, undoubtedly descriptive to please the senses, and witty. “Outside, everything feels tight and shiny, crowded with energy. Frost gilds the thrumming boardwalk. Candy-colored lanterns light the crowded mouths of pleasure houses. A saloon rattles with shouts and melodeon’s groaning.” – Katrina Carrasco“Green reek of kelp. Ship rigging rattles fifty feet out in the bay. She weaves through Lower Town, its shingles and piers coating the peninsula’s shore like a barnacle cluster. The road is humped with piled wooden crates and construction gear. The foundry’s furnaces suffuse the air with char.” - Katrina CarrascoAlma Rosales, the main character in this novel, goes undercover as Jack Camp, a dockworker. And she likes it too. Working for Delphine Beaumond, her former lover, she digs deep into the dark on goings in Port Townsend leaving no alley upturned in her craft. This role fits her well as she is trained in knifing, backstabbing plotting and…killing. Her role as Jack Camp, becomes her second skin. A role that also infuses her with desires and appetite. “To lacquer on manhood, Alma starts with the hands. Gentlemen wear rings. A working man wears calluses. He leaves dirty fingerprints on newspapers, drops peanut shells in his path. His nails may or may not be bitten. In winter his knuckles crack with cold.”- Katrina Carrasco“Alma rakes her teeth over her lower lip. She is itching to see Nell, her body primed by the brawl. It’s a long-ingrained habit: fighting, then f…ing.”- Katrina CarrascoIt does not take her long to figure out who is moving product and making the big bucks. The questions is, how? When some of the key players fall out of the game, it requires her to change tactic and establish alibies. As Jack Camp gets into brawls with henchmen and other interest groups, he almost bites the dust. Fueled with anger, can he frame the right person for the gain of his employer? Will Alma’s liking for certain characters jeopardize her decisions? Or is Jack Camp ultimately the pawn that’s at stake in this race to sell more opiates?***Alma’s bisexual character hovers between two identities, a first for me in a historical fiction novel. “She is being two things at once. Grinning hard like Camp, chin up like Camp. She is in the gray space between identities and he sees her and she is lit up, spark filled, starving.”- Katrina CarrascoThe title The Best Bad Things may elude to the power or the struggle of the character’s identity or what may be perceived as flaws during the 1880’s, but I cannot say for sure. It seems to me that Alma is more comfortable with herself then it is deemed proper in society at the time. She is actually rather full of vigor and zest spurred by her youth and desires for men and woman. She is confident in the moment when these strike. What I cannot emulate is that the explicit scenes are often a reaction to violent acts.What I foremost enjoyed in this book is the striking, vivid writing. Although not consistently strong at all times, it is a whirlwind of a read. One is thrown right into the action and it almost never stops. This perhaps came at the expense of the character development as I would have liked to connect more with the main characters, but not much of tangible background was revealed; leaving all the big players somewhat two dimensional for my taste. The scheme of the plot was brilliant and ever changing. As a reader it requires full attention to keep up with the cast and subplots. I may have missed a few things here and there, as it seems that at every page turn a different back-stab was lurking. Rereading some parts I highlighted with notes for this review made me dive right back and gain appreciation for different scenes of the action as it all came together at the end. Reading the epilogue again after the book, makes all sense now and is superbly befitting. This book is definitely for the mature audience and those attracted to historical settings. The heroine was strong, clever and refreshing. Her indomitable spirit was unstoppable. I received an electronic copy of this book from NetGalley in exchange of an honest review. All opinions are my own. Thank you!More of my reviews can be found here: https://scarlettreadzandrunz.com/"}, {"Review": "So, I’m a fan of mysteries and historical fiction. The idea of a mystery taking place in the 1880s sounded right up my alley. Add in a female protagonist and I was all set to like it. Unfortunately, it didn’t engage me the way I hoped. The writing was as dense as pea soup. Alma Rosales goes undercover as a man to find who is stealing opium from her boss, Delphine, who is also her former lover. But I really didn’t take an interest in Alma. I had trouble buying into her ability to pose as a man. She came across as two dimensional. In fact, all of the characters came across that way. There’s lots of two timing here, everyone trying to get a leg up on everyone else. There’s not a good soul in the book, everyone can be bought or turned. Character development has been sacrificed for a racing plot, with action on every page.Carrasco does a good job in giving you a sense of the time and place. I did appreciate that the book is based on Port Townsend’s real problem as a smuggling hot spot. It was a violent time and place and Carrasco captures that violence in all its goriness. This is not a book for the faint of heart. My thanks to netgalley and Farrah, Strout and Giroux for an advance copy of this book."}, {"Review": "I was pleasantly surprised by Katrina Carrasco's The Best Bad Things which I picked up through NetGalley. I thought the premise behind this story was new and refreshing. Set in America's Gilded Age, The Best Bad Things illustrates how women were treated during that time, the juxtaposition of poverty with the onset of industrialization. Carrasco takes advantage of these happenings highlighting the building of the Railroad system and the opium epidemic within the context of the story. The main character Alma Rosales works as a detective. Her disguise is that of a man. She's taken on the persona of Jack Camp. As Camp , Alma is a spy, a detective and a tough as nails kick ass heroine. She has no problem using her sexual allure either as a male or as a female to get the job done. I hope that Carrasco's intention is to build a series around the character of Alma Rosales because I would certainly like to see more of her."}, {"Review": "Washington Territory, 1887: Alma Rosales has been dismissed from the Pinkerton's Detective Agency for her questionable behavior and after a brief stint in California as a P.I., she's working for her former lover Delphine, the head of an opium smuggling ring.Disguised as a man named Jack Camp, Rosales infiltrates the local organization on the docks of Port Townsend to discover who has been stealing product from Delphine.  She manages to earn the trust of the crew and their boss, Nathaniel Wheeler, who is discreetly moving Delphine's product along the West coast.Rosales has a bad habit of putting herself into dangerous situations:  dressing as a man and chasing after women are only two of the habits that could get her killed.  She's also sending coded messages to Pinkerton's agents with details on the smuggling operations.One wrong move and the many identities she has carefully created to suit her motives could topple the flimsy house of cards built on deception.The Best Bad Things seriously kept me on my toes!  It can get confusing as it jumps back and forth over a short period of time, only revealing particular details to the plot when the author is ready to show her hand.  There are also several subplots that run the course of the novel, only making sense toward the end.Overall, the plot was brilliantly constructed with several twists and motives that remain unclear for a while, causing you to wonder where exactly our main character's loyalty truly lies.  The many deceptions Rosales juggles makes for intense action and drama.Alma Rosales is a refreshing female protagonist in a genre traditionally centered entirely around male characters.  She's clever, confident, strong, and sexually charged in a time period when all of these traits were shocking and inappropriate for women.While the primary plot and its subplots eventually come together in a clever execution, the order in which its told can be confusing or frustrating at times.  There were several inessential scenes and descriptions that didn't really add to the development of the characters or their story.  I'll warn readers there are gratuitous sex scenes and some contain or are spurred by violence*, though I found them to be well written and actually adding insight into Rosales's behavior and gender fluidity.A Western-ish/noir-ish/historical fiction crime drama featuring a complex female protagonist who leaves us guessing at every turn, The Best Bad Things is an impressive debut with an original spin on a genre mash up.Thanks to Farrar, Straus and Giroux and NetGalley for providing me with a digital ARC in exchange for my honest review.  The Best Bad Things is scheduled for release on November 6, 2018.\n*Trigger warnings for explicit/violent content.\nFor more full reviews, visit www.rootsandreads.wordpress.com"}, {"Review": ". : ☾⋆ — 3 ★ READ THIS REVIEW ON MY BLOG!!!https://bit.ly/2C22f0rARC provided from the publisher via NetGalley in exchange for an honest review (thank you Farrar, Straus and Giroux!!)The Best Bad Things follows Alma Rosales, a gender-fluid, half Mexican, bisexual Pinkerton agent in the late 1880s in Port Townsend, Washington. Alma, working undercover for her former-lover-turned-boss, infiltrates the local drug outpost disguised as a male dockworker in the hunt for stolen opium from a West Coast smuggling ring. this book is not for everyone. i’m not even sure it was for me but i really can’t think of another word that fully encapsulates my feelings for this book other than BOLD. The Best Bad Things is an absolute masterpiece in terms of atmosphere and ambience. Katrina Carrasco’s sharp, beautifully detailed writing style pulls you into this setting that feels incredibly vivid, almost tangible. it evokes this extremely particular feeling, and does so perfectly. i’ll admit this book even made me open up a new playlist so i could put together some songs that would match the precise ambience this book conjures, it’s such an exclusive and rare thing nowadays to find writing that absolutely transcends and leaps off the pages like this one does. i don’t even know how to explain just exactly how amazing Katrina Carrasco’s writing is. Alma herself is one of the most refreshing main characters i’ve had the pleasure to read in a very long time. she’s tough and she’s bisexual and she’s latina and she’s just brilliant. Katrina Carrasco is BRILLIANT. my one and only issue with The Best Bad Things is that, unfortunately, i don’t think the plot itself was necessarily the most compelling thing about the book. i wasn’t particularly interested in it. this sucks, obviously, and i do love historical fiction so i really don’t know what went wrong here. the plot, in my opinion, was dense at best. hard to keep up with. dragged a little. this probably has to do more with me as a reader than with the book or the author, but this book is definitely not an easy ride. it dragged the book down for me but i think it’s absolutely a worthy read for the writing alone. it really is tough to find a book that completely envelops you to the very core in its essence and atmosphere. Katrina Carrasco really is dauntingly terrific. thanks again to NetGalley and Farrar, Straus and Giroux!!"}, {"Review": "This was not for me. Alma Rosales was a completely unbelievable character, and I couldn't suspend my disbelief. I wanted to love this book and the description attracted me mostly because of Alma. She isn't like anybody I've read about before and that appealed to me--I'd love to read more with gender fluid characters of color in a different book. But beyond the almost superhuman protagonist (she can fight anybody and miraculously heal!), I wasn't into the writing style or the violence, especially sexual violence. Like I said, this just isn't for me.I received a free ebook ARC from Farrar, Straus & Giroux via NetGalley. This is my honest review."}, {"Review": "The highest compliment I can pay this book is to say that it completely consumed my brain while I was reading it -- everything that happened in my day made me think of it, and I spent most of my waking moments at least 15% in its world. Everything in that world is distinctive and fully formed, from the environment to the relationships and the characters, and the comfort with which Carrasco addresses the complexities of gender is impressive and reassuring. So, basically: Better than Cats, would recommend."}, {"Review": "This book sounded like it was tailor-made for me. Female Pinkerton agent in pre-statehood Washington (Port Townsend, to be exact), AND she likes the ladies? I've never wanted Netgalley to approve me for a book than this one. It did not disappoint!While it has a strong mystery plot as the backbone, the real draw of this book is the main character (who is bisexual, as it turns out). Alma is one of the toughest protagonists I've read in a long time. Is Alma good or bad? Is she the law or a criminal? The answer is yes. Alma's loyalty is to herself and whatever can best serve her in the moment. Carrasco takes the time to really get into her head and show us the world from her perspective. She's always working the angles, never panicking or letting herself get found wrongfooted. I really appreciated the care which was given to Alma's transformation into Jack. It wasn't a simple matter of putting on new clothes and changing her voice, there was a true process that the author did a great job portraying. This is a book where the story is a backdrop for us to meet a truly original, fascinating character. That said, the writing is fantastic and instantly evocative of the time period. The world opens up almost immediately in all its ugliness and beauty and violence. The characters are well-drawn (if there was ever a spinoff or a prequel or anything with Delphine, sign me up). I look forward to recommending this - and really anything else Katrina Carrasco writes in the future - to everyone I know."}, {"Review": "3.5 Stars Alma Rosales is a new sort of heroine. She’s smart. She’s brash. She’s a snoop and a spy. She’s daring, sharp-tongued and maybe a little too full of herself. Her self-confidence is both a blessing and a curse as she sets off on high-adrenaline historical fiction suspenseful thrill ride. A former detective for the notorious Pinkerton agency, Alma, fired but unwilling to give up the hunt, begins her work for a jasmine-dripped woman named Delphine. Alma goes undercover as a man named Jack Camp to infiltrate a local man’s business. There’s opium. There’s murder. And there’s plenty of sexual tension as Alma/Jack employs scheme after scheme to aid Delphine and keep the Pinkertons at bay. What sets this novel apart is clear: the heroine. She’s Latina. She’s a woman. She’s overtly sexual on all sides. She’s tough. It’s refreshing to have a female character who smashes stereotypes and gets the job done in the process. My only snag was I felt the story didn’t build so much as leap, if that makes sense."}, {"Review": "This bloody, thrilling, mysterious book left me breathless and wanting more. It’s unlike anything else, a remarkable and revelatory debut tackling the intersections of gender, violence, lust, greed, and power against the historical backdrop of late 19th century Washington State in the age of mining, shipping, and opium smuggling. This novel’s protagonist resists gender categorization although many will likely attempt to put Alma Rosales and Jack Camp into neat boxes. Don’t fall for it. Stay in the tension of Carrasco’s world and acknowledge the brilliant ways Port Townsend’s characters disrupt your assumptions about what a Western Historical Fiction novel should be, it will surely be made into a film. Read it with a friend before Hollywood interprets it for you. It promises a “book hangover” like no other!"}, {"Review": "I came for a great read and I got a major motion picture in my head! Reading The Best Bad Things is like being plunged into a queer historical action-adventure movie, with the character-driven nuance of prestige TV—and literary fiction. To say that this novel pulses with life is as close to literal as can be; Katrina Carrasco takes us inside the physicality of her fearless, calculating, inimitable protagonist Alma Rosales to a degree I’ve rarely experienced before as a reader, and all without relying on a first person narrative. It’s a visceral story, sparing the reader nothing — yep, there’s sex and violence aplenty, and the narrator doesn’t pan away. It’s a complicated plot, deftly driven by Carrasco’s muscular prose — no word wasted, not a single throwaway sentence. It took me a couple of chapters to get used to the style because it is so chock-full: vivid verbs and loaded images; short on exposition, long on action and scene. It’s an “edge of your seat” type of read that makes you pay attention — because Alma is paying attention. In fact, just how much Alma notices is my favorite part of her psyche as a character and of the book as a whole. Queer readers will appreciate a view into what life was like for the genderbenders of yesterday, and those who lived, survived, and struggled to thrive outside the binary. If you’re looking for a nice historical detective novel with a “lady spy” at the center, The Best Bad Things probably isn’t quite what you’re hoping for. But if you’re looking for a brutal, swaggering, sexy romp of a story with a protagonist who breaks the mold, this one’s for you. This book is everything I hoped it would be. I hope we get to read more of Alma’s life and times in future reads. "}, {"Review": "This book started off with a bang and I remember thinking, \"Oh man...this is going to be an awesome book.\" Sadly though, for me personally, things started to go downhill shortly thereafter and I could barely sustain enough interest to finish it. To be clear, I don't think this is necessarily a BAD book. There is some very solid writing in here. I think it just wasn't a match for me.The book does have a damn fine opening though. Lots of action and Alma/Jack is an intriguing lead character. I loved reading about her approach to gender roles and I thought there was great, complex sexual tension between her and other characters because of it. The thing that was problematic for me personally was the plot was dense with characters and their various plans, backstabbing, and double crossing. At times it felt like a lot to wade though. I also felt like as a result, interpersonal relationships (and at times even compelling action scenes) got the short shift in favor of more exposition and plot maneuvers. Ultimately it dragged the book down for me.Thanks to the author and NetGalley for granting me the opportunity to read this book in exchange for an honest review."}, {"Review": "A novel set in 1887 in Port Townsend, Washington, starring Alma Rosales: ex-Pinkerton detective, current opium smuggler. Alma is newly arrived in Port Townsend, and is there on a mission. Part One: figure out who is the head of the opium game in town. Part Two: take his place. As you might imagine, this turns out to be far more complicated than she originally planned, and the plot turns on blackmail, murder, torture, bribes, backstabbing, moles, broken promises, fake interrogations, mistaken identities, and more. It's as twisty and surprising as the very best heist movies, and I can honestly say that I did not see the end coming at all. Alma is the best bad thing of all: brutal and ruthless, clever and tough, and moving forward so fast that we barely see the regrets in her past. She's bisexual (and we see her relationships with both men and women), Latina, and possibly genderqueer; she spends most of the book passing as Jack Camp, boxer and dockworker. But on the other hand, the narrative sticks firmly with the 'she' pronoun, and Alma shifts between races and classes as easily as between genders. We see her be a Scottish virgin and a Southern belle Madam at other points in the book. It's unclear if she is genderqueer, or if she simply loves the disguises:Alma can be many things. She has learned to value this mutability: how she can shift her compact body into many shapes, powder herself pale or let the sun darken her complexion. She loves to see her costumes through other people’s eyes. Delphine watching her as Camp, cutting a deal over fenced diamonds in San Francisco. Wheeler watching her as a governess, timid and wilting. Hannah watching her as a rancher’s daughter, flirting in rapid Spanish with the Yuma vaqueros. Alma loves performance. What began as a thrilling trick in a Chicago saloon has become a passion. And now she’s back onstage before her favorite audience—though it’s hard work to win Delphine’s applause.But the most distinctive thing about The Best Bad Things is its style. For all the Western action, heist twists, and gun battles, it's very much a literary novel. It might concern itself with tropes, but it takes them very, very seriously. I was reminded of Steve McQueen's Widows: another plot that outwardly seems like not much more than old cliches, but which is told with the highest craft and a dazzlingly brilliant investigation of these characters and their world. Unfortunately – in both Widows and The Best Bad Things – the sharp-eyed intelligence of the telling reduces some of the pleasure. Heist stories should be (or at least usually are) fun, and I can't quite call The Best Bad Things fun. It's too violent and cynical for that, and it's hard to have good time when the writing never looks away from the characters' struggle for survival. Is that a criticism? Probably not. The Best Bad Things wasn't what I expected from its blurb, but it's hard to complain that a book is too well-written. I read this as an ARC via NetGalley."}, {"Review": "This was one of final books I read in 2018, (well I listened to the audiobook, although I have also bought the book and will be reading it the traditional way very soon) but even before I finished it, The Best Bad Things shot rapidly to the joint top of my books of the year list. Everything about this book seriously excellent; the writing is raw and compelling, leaving me utterly spellbound from the outset. There's a broad cast of characters but it's not confusing, they're all so well created and forged in the reader's mind that even with all the dirty double dealing going on I had no trouble remembering and more importantly picturing who was who. As well as the people, the town of Port Townsend circa 1887 is lovingly recreated for us (Carrasco has shared some of her research in the form of non-fiction articles on historic Port Townsend on her website), again so vividly that you can almost picture walking the streets with Alma/Jack, Wheeler & Delphine. Aside from the quality of the writing this is also a bloody good story laced with sex, murder and intrigue. The plot whips along with just the right amount of twists and turns, none of which I saw coming! I fell in love with half the characters and wanted to punch quite a few of the others, serious on the edge of my seat stuff. I would recommend, nay insist, you all go out and read this as soon as possible! Since I finished it I have found and devoured some short fiction and non-fiction articles by Carrasco, she's just one of the most talented writers I've come across in a long time. "}, {"Review": "Hm. Some things are better than the sum of their parts, like the 2016 Super Bowl Champion NE Patriots. This book is the opposite. Everything is in place for a terrific historical suspense thriller – a compelling protagonist, a richly researched time and place, a dramatic plot with a lot of competing interests, beautifully written sentences and a fine ear for dialog, many good secondary characters. And yet, at least for me, this book was a bit of a slog. Honestly, if any of the above were NOT true, I would not have bothered to finish, and did take the book’s temperature at each 50 page interval. It was just a slow read, momentum never really built up, it was easy to lose site of which character had which affiliation to whom, etc. I think the author has talent (this is her first book), but the way it ended makes me worry that she will re-visit this protagonist and time period again and if she does, I’m not interested (Amy Stewart has a similar problem, IMO, with Constance Kopp – I read and enjoyed the first two novels about her, and I like the author, but I’m done with the character). Again, this is not a bad book, it’s actually pretty good, but by the time I got to the end, I was more relieved than invigorated, which is not what you hope for.Grade: B –PS. The blurbs that accompany the book are really very far off the mark. \"Brazen?\" \"Barnburner?\" I must've read a different book or something."}, {"Review": "Its easy to dismiss some of the violent, gritty periods in history as the product of excess testosterone and insufficient civilization. But the story of the women who chose to dress as men, and swagger their way through the early part of the century defies that explanation. Alma Rosales is a ruthless, ambitious ex-Pinkerton detective. She works as a man named Jack Camp. More than bisexual, Rosales/Camp seems to have no fixed sexual identity at all; she slips into either of her identities with ease. She has been brought into town to find a thief, and plans to leverage her work into a role in the thriving opium trade.Set in the warehouses, boardinghouses, saloons and opium dens of Port Townsend, Washington in January 1887, Carrasco’s debut novel is full of the blood, sweat and tears of turn of the century America.Carrasco clearly did all her research to gather her facts, but the details she uses to make her characters come to life are all literary talent.I voluntarily read and reviewed an advanced copy of this book. All thoughts and opinions are my own."}, {"Review": "Who knew that sleepy Port Townsend could ever have been so exciting? This was compelling reading and I never considered putting it down, but this is a brutal book. There is a lot of sex, a lot of violence, and a lot of mixing of the two. If any of that bothers you, consider this a warning. The ending left a bad taste in my mouth and I'm still struggling with my overall rating for this. Very interesting heroine, but not sure that I would read another. On the other hand, it looks like a next book would be set in Tacoma (my hometown), so maybe.I received an eARC from NetGalley."}, {"Review": "Queer bisexual mystery of my dreams, where have you been all my life?! I love queer, subversive characters. Gritty mysteries. Well-written sexual tension. Yet I've never gotten all three in one book -- until The Best Bad Things. I found myself constantly delighted by how Carrasco's characters transgress the social norms we (or at least I) usually assume were in place during the late 1800s. As a queer person, it was so incredibly refreshing to read.The book really picked up for me about halfway through, after which point I was hooked until the very last sentence (ughhh the ending is SO PERFECT). Can someone please make this into a movie? I can't wait for Carrasco's next novel."}, {"Review": "Rating: 4.5 starsThis book is bursting with personality. You know when an author merely tells a story with their writing? In The Best Bad Things, Carrasco's writing is the story. This book is fierce, loud, and unforgettable. The characters are not cardboard cutouts. Our main character (Alma) is a sexually driven, bisexual, hispanic, kick ass, heroine that defies ALL molds set for women in historical fictions. We have Delphine, a beautifully mysterious Head of All Operations, all around boss without losing any of the femininity. She's a very good balance beam for Alma, because I love authors who incorporate that you don't have to lose your femininity to be badass. We have Wheeler, a strong, stubborn, and quite frankly unpredictable man that always leaves you on your toes. The writing, as I've established, is stunning. It will literally time travel you to this new, dangerous, underground world engaging all five senses at all times. Why didn't I give this book a whole whooping 5 out of 5? Because the plot was a spider web; there were a lot of moments where I became lost. The author introduces a lot of names, and a lot of strings are getting pulled, and the McManuses and Clays and Kopps and all of them all started to get jumbled up in my head. I think by the 80% mark I was just reading it for the characters because I had no idea what the heck was going on. There are a lot of loosely based sub plots going on, and then one main plot, and every plot conspires of different people . It becomes kind of just a hot mess. The story line really isn't a walk in the park to follow, and I think to fully understand what was going on I would need to read it a second time. There are so many details in this story that it's so hard to keep track of all of them. I think I might go back and read it a second time and update this review for my second run through. Despite this, I would highly recommend this story. It really is quite different from anything I've ever read before. And if you're into spider web plots, you'll love it even more than I did."}], "Genre": "Crime", "ID": "37941735", "Desc": ""}