{"Name": "Hearts of the Missing", "Image": "https://images.gr-assets.com/books/1516729497l/37638309.jpg", "Reviews": [{"Review": "As a long time fan of Tony Hillerman, I decided to take a chance on new author Carol Potenza, who won the 2017 Tony Hillerman prize. Nicky Matthews is a Sergeant in the Pueblo police. For some reason, I never thought there would be non-Indians on a reservation police force. But there she is. And despite being an outsider, she is the one that the Wind Mother chooses to visit. I enjoyed this immensely. Nicky has a lot of baggage, including an ex-lover trying for a comeback and a boss that hates her. But she also has good friends that provide a strong support system and a good head on her shoulders. There’s a possible love interest. The plot kept me involved and made me want to keep turning the pages. There’s a serial killer on the loose not to mention a possible conspiracy. Loved the ending, even if it was unbelievable, and how it all came together. This is a well thought out book, with a strong dose each of science, myth and history. To be honest, I found it better than a lot of the Tony Hillerman books. I am hoping this is the start of a new series. My thanks to netgalley and St. Martin’s Press for an advance copy of this book. "}, {"Review": "\"I believe that there is more to this world than our minds recognize.\" There was an odd catch to his voice, a hint of uncertainty.Sergeant Nicky Matthews feels a certain presence as she wraps up her investigation in a convenience store robbery. The lateness of the hour seems to have played tricks on her vision. From the corner of her eye she sees the reflection of an ancient woman in the glass staring back at her. She draws in a quick breath and leaps to the doorway. No one there, not even a breeze. Life on the reservation in New Mexico is filled with customs and tales honoring those who came before. The Fire-Sky tribe, in particular, do all that they can to preserve their tribe and its members. Nicky takes her two fellow officers, Savannah Analla and Ryan Bernal, into her confidence. She, as a non-Indian, has been shown a sacred sign. What is being asked of her?It doesn't take long before Nicky becomes involved in what appears to be a suicide on the railroad tracks. Several Native Americans have suffered the same fate. And this is where Carol Potenza takes us down a well-lit trail involving DNA and the genetic makeup of the tribe. Potenza's background as a professor of chemistry and bio-chemistry at New Mexico State University eases her into a front row seat with fascinating background information. No worries.....Potenza leads with the snappy mystery and doesn't overwhelm the readers with Biology 101. Just enough to quicken the heartbeat.There's also the interesting insertion of a boss who leans on Nicky at every opportunity and a former love interest from the past who wields vengeance with a powerful title on his desk. Potenza lights a match at every opportunity which will certainly assure you that she deserves her win of the 2017 Tony Hillerman Prize. Just plain good stuff happening here....."}, {"Review": "I love it when I have the opportunity to visit or revisit an area through a book, and that is what  Hearts of the Missing by Carol Potenza offered. The story takes place on the Pueblo of the Fire-Sky Native Americans  and is a rich combination of themes woven together in a way that leaves you hoping there will be more books featuring these people and this beautiful setting. The novel combines multiple elements, weaving them in and out to create a beautiful tapestry.There is Nicky, the federal law enforcement officer who takes her oath to protect and serve to heart. For her, it’s as simple as that. The people on the fire-sky pueblo are her responsibility and she must protect them, even if it means going against orders, even if it means putting herself at great risk, even if it means revisiting elements of her own past that are better left in her past. This isn’t easy to accomplish when she is the only woman in a male dominated field, resented by some, hated by others. It’s hard to find and know for sure who exactly has her back.There is the spirituality of the Fire-Sky people. Their belief that unless a body can be buried in its entirety, the soul will wander, lost, for eternity. Combine that with the spirits who guide the people and make themselves visible to Nicky, add white rabbits to lead the way. The character who knows the most about how these spirits interact is Howard, an alcoholic whose efforts to contact Nicky and tell her what he knows are both courageous and confusing.Then there are the remaining characters of the novel. There are the men who make up Nicky’s police unit, including those who resent Nicky, especially her Captain, who would like to see her fired and removed from the pueblo. There are other law enforcement officers, some good, some not, and the reader has to figure out, along with Nicky, who is on the side of good and who is truly on the side of evil. Potenza does an excellent job of leading you one way, only to shift and cause you to wonder if you’ve been wrong all this time, then shift again.Then there is the beautiful setting of the state of New Mexico providing it’s breathtaking wide open spaces. If the reader has spent any time in the west, the writing will evoke memories of Native American territory; the beauty of it, the poverty of it, the evidence of a different culture and lifestyle than the Europeans who settled across the United States. If the reader hasn’t spent time in the area, the novel may spark a compelling desire to see it for themselves and experience a foreign land that exists within their own country.As for writing style and pacing, Potenza has done a superb job. The novel moves at a steady pace, one that calls the reader back if they have been forced to put it down for any reason. It is a book that most readers will want to read if not in one sitting at least in large parts at a time. At the same time, if circumstances require it, the reader can read a few pages here and there, in between accomplishing whatever has called them away from their reading.This was a thoroughly satisfying read, with Potenza crafting a novel that is successful on a number of levels. The mystery is altogether satisfying, with good clues and red herrings that allow the reader to work through to the solution along with Nicky. The characters morphing from good to bad and then back again in some cases, was well done. Descriptions of the spiritualism and beliefs of the Fire-Sky people allowed a view into a culture and belief system that, for some, will be totally different from anything they have ever known. In short, it is a complex novel that provides the reader with multiple paths to involvement in the story, and I highly recommend it.My thanks to NetGalley and St. Martin’s Press/Minotaur Books for providing me an advanced digital copy in exchange for an unbiased review. The opinions expressed here are entirely my own."}, {"Review": "Thank you NetGalley and St. Martin's Press for this arc.A complex and very convoluted plot. The pacing wasn't very smoothly done, but in my mind forgivable as this is the author's debut book. Further confusion was the addition of a number of characters with inadequate \"introduction\".... details of their backstories were not provided until 50 plus pages later, making them feel more like plot contrivances than real characters. I found the main character Nicky a little unrealistic (too much emotion and not enough good sense for her \"job\") and felt like she was also part of the problem. Overall though, this was a compelling read. The atmosphere and creepiness were just right for me."}, {"Review": "This was a phenomenal debut!! Wow, just wow... I loved it. The author had me hooked from start to finish. It was so well written, and the twists and turns, along with the red herrings, left me guessing to the end - just what I love in a good mystery. I adored the heroine Nicky - she was so relatable and I was cheering her on the whole time. I can't recommend this book enough. Do yourself a favour and grab a copy - you'll love it. I am now eagerly awaiting book 2 - and Potenza is an auto buy for me now!!"}, {"Review": "Review can be found on my blog here: https://booksonthebookshelf.wordpress...Thank you to Minotaur Books for sending me a free physical ARC copy of this book. This book is a winner of the Tony Hillerman Prize.I loved all the suspense, mystery and surprises in this book. There was so much suspense that it had me hooked to the storyline and I was so into uncovering the mystery of what was going on that I flew through this book and felt myself on the edge of my seat as I was reading through the chapters.We are introduced to the main character Nicky Matthews, a police sergeant. While at the scene of a crime she sees a white rabbit and an elderly woman’s face in a window. Was the woman really there or was it a spirit? Nicky comes to learn that both the face of the elderly woman and the white rabbit are omens of things to come… but what does it mean?One by one several local people go missing. Nicky is determined to find out what is going on in her town and find who is responsible. One day Nicky is contacted by a young boy and his grandmother. The young boy’s cousin has gone missing and they fear she has met the same fate as the other missing people of this town. Nicky has been assigned to the case and she is determined to find this young woman.The case takes Nicky on a whirlwind of a ride. What Nicky finds is shocking! There are several shocking twists and turns in the book that you definitely won’t see coming and I loved that! It kept me on the edge of my seat and reading late into the night to see what would happen next.I really enjoyed reading about Nicky’s characters. She was a badass and had determination to solve each of her cases, and this one would be no different. She had a fun personality and it was interesting and fun to read about her character and watch her evolve in this story. I also enjoyed reading about her close friends Savannah and Ryan.Without giving too much away this book was amazing! I really enjoyed this book and I highly recommend it!All the stars for this book!"}, {"Review": "I have read everyTony Hillerman book and, being raised in the Southwest, loved how he (and later his daughter Anne Hillerman) captured so beautifully the aura of the land and its people. When I heard Hearts of the Missing had won the Tony Hillerman Prize for Best First Mystery Set in the Southwest, I was intrigued enough to read it.Let me say, I was not disappointed. Potenza’s book is every bit as enthralling as a Hillerman Leaphorn or Chee mystery novel. Potenza’s love for the New Mexico landscape comes through clearly. Additionally, she has a strong female protagonist in Nicky Matthews who is an officer in the police department of the Fire-Sky people. Though not a native, she is trusted by the people she serves. Tribal members have been disappearing for several years, but Nicky is told to close the investigation. The book combines well-conceived plot twists as native mythology and history conflict with science. Nicky faces a boss who dislikes her, an old lover and his demon of a wife, plus a new love interest who may not be who he seems. People who enjoy a good conspiracy theory will enjoy Heart of the Missing as well. Cant’t wait to read the next one!"}, {"Review": "I enjoyed the story on Audible. Hearts of the Missing is a captivating mystery with a romantic edge and a deep Indian cultural dimension. Fire-Sky people are vanishing. Micki Matthews, a feisty, dogged, intelligent tribal police woman is on a mission. She is endeared by the locals and two special Pueblo friends, Ryan and Samantha. They serve as her Indian translator, connector, and interpreter of signs. The plot will zig you here and there so hold on. Potenza’s writing style moves quickly with many sparkling surprises. I found myself anxious to get to the next chapter, then disappointed when there were no chapters left. Tony Hillerman, I believe, would be proud, Potenza, has carried on with what he started."}, {"Review": "This was a wonderful new book by the debut author who recently won the Tony Hillerman prize.Like the Hillerman books, it is set in the American southwest on a tribal reservation. The author shows an understanding and reverence for the native american way of life as portrayed in the book.Nicky Matthews, the detective charged with working a string of murders and missing persons among the tribe, relies on help from sympathetic members of the tribe and good deductions to solve the case. She does this in spite of the problems posed by certain members of the police force. She is an engaging character, as are her little band of helpers that she calls on. I hope that this series continues to provide good solid mysteries set in the Native American west. We can use some more to replace the stories we were getting from Margaret Coel and the Thurlos. "}, {"Review": "I was a little disappointed when I found out the tribe was fictional. It then made me wonder if the customs and rituals I had just enjoyed learning so much about were also fictional, but from online interviews with Potenza I gather that those are based on research (Potenza's sister in law is a police officer in a New Mexico Pueblo).The mystery revolves around scientific research, organ donors (the Fire Sky People have to be buried intact, so they aren't donors), and DNA. Potenza is a practicing biochemist and it is in this part of the mystery where her writing really shines.There is a fascinating subplot with an evil ex-boyfriend who is also a powerful social influencer. Although it is only a small part of the story, I was actually more engrossed in that relationship than I was in Nicky's love story with a fellow officer who may or may not be what he seems. This is the first book in a planned series. The real hero of the story in many ways is the landscape and how the people who live on it interact with it."}, {"Review": "After being forced to move and give up law school Nicky Matthews is finally doing something she really loves. She is a police sergeant with the Pueblo NM police force and she is the liaison with the Fire-Skye Indian reservation. Nicky has made many friends on the res and she is respected by the natives, but she is not liked at all by her boss who can’t wait to catch her doing something wrong. When a suicide seems to be linked to other missing Fire-Skye people Nicky defies her boss and investigates. Ancient beliefs and culture, greed, revenge, and modern day genetics all mix together in this beautifully written police procedural. "}, {"Review": "This book is a true mystery at every turn. I fell in love with the main character, Nicky Matthews, as she navigated being an outsider in a world she feels deeply connected to. The artistry and cultural competency Dr. Potenza used when capturing the spirit of the tribal lands of New Mexico is astounding. I respect any artist that is able to research and present this culture so respectfully, and this book certainly hits the mark. It is no surprise that this book is the winner of the Tony Hillerman Prize. A MUST read for any lover of the Land of Enchantment, or for anyone looking for an addicting read. "}, {"Review": "This book is the winner of the Tony Hillerman prize and thus has some serious shoes to fill, and it fills them fairly well. Set on the Pueblo, Potenza has created a fictional but believable tribe, the Fire-Sky tribe. She then gives each of her four major characters varying degrees of connection to the tribe. At the center of the story is Sgt. Nicky Matthews, a Pueblo police officer, not native herself.Her best friend, Savannah Analia, the public safety director’s assistant, is full blood. Then there’s Ryan, who makes jewelery and who grew up with Savannah, but isn’t native. He does however have extensive knowledge and respect for native traditions. And then there’s conservation agent, outsider Frank, who is the uneven piece of this four person puzzle.While Savannah is full blood, she’s also the one who is skeptical of some native beliefs and it’s actually Nicky who seems to have visions and be connected by some kind of “sight” to the Fire Sky culture. When the book opens, she’s investigating a mini mart break in, and is totally freaked when she sees an old woman in the glass – who then vanishes. She also sees a white rabbit, a sign of death, and that’s what garners the interest of Juanita Benami and her grandson. Juanita is concerned that her granddaughter, who said she was coming home for the weekend, and whose car is in the driveway, is missing. When the young woman is later discovered as the victim of a “train-pedestrian suicide,” Nicky’s antenna are up. The grieving grandmother is sure she’s a lost soul. Nicky is all for discovering what really happened to the young woman, who was about to graduate from college with a journalism degree, and didn’t appear to be the typical lost addict who ends up in front of a train.This book is packed. It’s packed full of plot, full of characters, full of setting, and full of the Native culture that the author so clearly loves. The details of that culture are fascinating and by far the strongest part of the novel, seconded by the vibrant characters.The plot is sometimes a bit over the top - it appears there’s a serial killer at work - but that said, this is a fun read that’s hard to put down. The final action scene is slightly clunky (a first time author problem, and as I read I couldn’t help compare it to the sublime action sequences written by authors like Lee Child and Robert Crais), but those comparisons are perhaps unfair. I actually thought this was a solid first in series set up and the elements of native culture that are included are both haunting and meaningful, a nice balance. I look toward to book two."}, {"Review": "Winner of the 2017 Tony Hillerman Award, Heart of the Missing introduces readers to Pueblo Police Sergeant Nicky Matthews. In my opinion, it is a fitting win for this author. I found in Potenza's book the \"Hillerman\" magic of the Southwest and the native tribes that is missing in many well written books. Where Hillerman focused on the Navajo culture, Potenza takes readers inside the Pueblo tribes.A young woman, member of the Fire-Sky Pueblo, is dead. When the autopsy reveals high levels of various drugs, she is presumed to be a victim of suicide by train. Her body has been buried but her grandmother is convinced all is not as reported. Her granddaughter, she claims, had been clean-drug free at the time of her death. Also the grandmother is convinced her granddaughter's spirit is not at rest because her body was not whole when she was buried. She senses in Nicky the ability believe in the mystical side and to press for answers. Nicky was indeed the right person to approach. She has been experiencing visions of white rabbits and soon realizes these visions may be tied to the grandmother or her granddaughter in some way. As the plot unfolds, readers are treated to an intricately planned crime spree and quite a dose of spiritualism.The author weaves the mystical beliefs of the people into the plot of a crime novel creating another layer to her plot-a layer deep in Native culture foreign to those outside the tribe. While I didn't see any indication that this was the start of a new series, it seems probable. I eagerly await the next book.A special thank you to St.Martin's Minotaur for an ARC of this book."}, {"Review": "My library sends out monthly “new reads” in various genres and Carol Potenza’s debut, HEARTS OF THE MISSING was on a recent list. I’m a fan of Tony Hillerman, Margaret Coel and James Doss so I thought I’d give her a try. Boy am I glad I did!While I figured out early on what was the core mystery—what was driving the killer, Potenza adds some twists and turns I did not see coming. While at times I had to go back and read parts to make sense of the flow, the writing was clear and kept you involved in the story. I had a hard time putting the book down once I started it and that became even more pronounced when I got to the last 40 or so pages—at that point it was hard not to skip ahead to find out what happened. (I didn’t.) Potenza’s characters are fully formed and their individuality comes through. There were a few times I wanted to sock Frank Martin a good one but ultimately kinda fell in love with the character. Nicky is now one of my most favorite female detective/sleuths. She’s intelligent and determined but has a very human side. If she were real I’d truly want to know her and have her as my friend. I loved the historical aspects to the Fire-Sky culture and the rituals and beliefs as described by Potenza. In looking at the usual book sites, i.e., Fantastic Fiction, FictFact and Goodreads, so far this is a stand alone read. Nicky, Savannah, Ryan and Frank are really great characters so hopefully this is the start of a new series."}, {"Review": "This is an award winning debut novel by a biochemistry professor featuring a mystery set on an Indian reservation. The main character, Nicky Matthews, had intended to be an attorney but her life and career plans got sidelined when she had a disastrous affair with the head of the state police. So, she ended up as a cop on the reservation, a job which she loved.Nicky is asked to further investigate some unexplained deaths and disappearances which have been officially written off as suicides. Nicky is an interesting character and the author's narrative voice and respect for the Native American culture are strong.Unfortunately, I found the plotting to be elaborate and confusing. Lots of characters, several different threads, and of course, multiple law enforcement agencies are involved. The climactic last scene was completely over the top. Throw in some occasional supernatural activity and an overabundance of scientific detail and things get pretty messy.Thanks to the publisher and to Net Galley for providing me with an ARC in exchange for my honest opinion."}, {"Review": "I found this to be an enjoyable mystery novel set in the area in and around Santa Fe and Albuquerque, New Mexico. It involves elements of Pueblo Indian religion and culture, the issue of racial or tribal purity among native populations, and the illegal trade of human organs. Nicky Matthews is an officer of a tribal police force with a backstory that somewhat complicates her efforts to solve some mysterious disappearances and a suicide. Being a non-native also hinders her job as she operates within the constraints placed upon her by tribal and police department politics. This is an excellent first novel by the author. Seeing that it had won the Hillerman Award was enough to convince me to purchase it."}, {"Review": "3 1/2 stars out of 5Hearts of the Missing is a police procedural story that isn't able to find the right flow making the story feel jerky and a little too messy. The story throws readers right in with very little back story that could cause readers to becomes lost at times with who does what and why. The characters at times lack focus for being police which makes the story once again a little too stop and go feeling.While the story its selves is interesting giving readers a in-depth look at fire-Sky customs as was as Native Americans traditions it gets lost in the stories inability to flow.Thank you to Netgalley and the publisher Minotaur Books for the advance copy of Carol Potenza Hearts of the Missing."}, {"Review": "I truly enjoyed this book and was much more impressed by it than I expected to be. The portrayal of Native American cultural and ritual was well done. As another reviewer said, I agree that the storyline pacing was a little off at times, but overall it worked well. I read it in two days because I was intrigued immensely by both plot and characters.My only complaint would be in regards to some of the law enforcement portrayal. Not all of the lingo used was entirely accurate, but I doubt anyone who's not in the field would recognize that. I felt at times that the main character, Nicky, was too soft and emotional in situations. Cops become calloused very quickly and not much fazes us. Overall, I really enjoyed this book and hope to see more from this author!"}, {"Review": "I've decided to do a display: Old School, New School. It will feature mysteries that take place before technology took over, and those after. This book is definitely after. DNA analysis is a major part of the mystery, both solving it and causing it. And cell phones are a key component. This however also contains elements from so far back in history we are dealing with mythology. I loved learning about a new group of New Mexico natives and how they are trying to maintain their culture. Good characters, interesting plot, played fair with the clues, great descriptions (ala Tony Hillerman you want to be there) and I hope this will be a continuing series."}, {"Review": "Taut amalgam of Native American culture, current landscape of their society now and a crackling good mystery. Winner of the Tony Hillerman Prize 2017 for best debut mystery set in the Southwest, this book will educate you on Fire-Sky Native Americans while keeping you up late with your heart in your throat. Meet Nicky Matthews Pueblo Police Sergeant who has earned the respect of the community, but runs afoul of her police captain. Let's just hope she will be back to thrill is again soon.Highly recommended! Thanks to netgalley and the publisher for the opportunity to read this book in exchange for an honest review."}, {"Review": "In this stellar mystery- hopefully the first in a new series- Pueblo police officer Nicky Matthews takes on a missing persons case that ends up exposing a wicked crime wave that might be more than she can handle. Mystical beliefs, personal heritage, crime investigating, cultural history, romantic entanglements, a richly created setting...this novel has so many layers, all perfectly balanced. I can't wait for Nicky's next case!This ARC was provided by Minotaur/Macmillan, in exchange for an honest review."}], "Genre": "Crime", "ID": "37638309", "Desc": ""}