{"Genre": "Crime", "Reviews": [{"Review": "5 Spectacular Stars.Have you ever been scared to crack open a book? Nerves jangled? Stomach in knots? Desperate to find out what happens to your favorite character, yet frightened of what’s inside? Yep… that’s me. I had an ARC of “Dark Sacred Night” by Michael Connelly in my hands, a copy of which I was lucky enough to score and I was scared straight. Dying to open it and start reading, yet terrified. What if it doesn’t measure up? With each passing year, my anxiety has reached greater heights w"}, {"Review": "**4.5 STARS**Night shift detective Renée Ballard is writing a report in the wee small hours of the morning concerning a woman found dead in the bathtub, when she notices a stranger going through the filing cabinets across the other side of the office. The man appears intent on finding something, and in his eagerness to discover whatever it is he’s looking for, he clearly hasn’t seen Renée watching him! After throwing him out, she discovers that it’s detective Harry Bosch who you used to work out"}, {"Review": "Michael Connelly brings us the second in the LAPD detective Renee Ballard series and he brings in Harry Bosch, a man Renee knows nothing about. Renee has been shunted onto The Late Show, the Hollywood nightshift, after an injustice earlier, but oddly enough she has settled in there and somehow it suits her. Her partner is on bereavement leave and she is on her own when she is called to a home where a woman's body, heavily decomposing, is discovered. It is assumed to be murder but it does not tak"}, {"Review": "Sometimes when an author who has written many books in a series introduces a new character, I worry that the effect may be kind of like when sitcoms of the past introduced a new, young character (e.g., Cousin Oliver in \"The Brady Bunch\"), and it essentially ruins the series.When Michael Connelly introduced LAPD Detective Renée Ballard in last year's  The Late Show  (see my review), my fears were proven unfounded, because Ballard was such a complex, flawed, fascinating character (much like Harry"}, {"Review": "I love the Harry Bosch series and enjoyed the first Renee Ballard novel. So, I was excited to see the two detectives join forces. And I was not disappointed. One thing I love about Connelly’s mysteries is that he doesn’t sugarcoat the workload of a Detective. No one has the luxury of working a single case, especially a cold one. Both Renee and Harry have their hands full. There’s lots of action here. This is one of those books that called to me and kept me reading well passed when I should have"}, {"Review": "It's a good read. ✓ Readable police procedure and politics✓ Complicated and conflicted characters✓ Every character has there own agenda✓ An Avenger seeking justice for all—every life mattersI didn't love it, but I wouldn't mind reading more."}, {"Review": "Many, many years ago I was drawn into a series featuring a young detective named Harry Bosch. I subsequently went on to read him again and again. Enticing cases he fdefinitel worked, but it was the detective, his life, both rather dark and gloomy, that kept me coming back again and again. There was just something g that drew me to this flawed but very noble character. Eventually as he aged, he found himself forced into retirement by the very department he had so long served. Yet, he could not le"}, {"Review": "Most of the books I pick up are fiction. I have one of those jobs that introduces me to life’s less glamorous realities on a daily basis so I read for escape. But as with non-fiction, I learn something from every story. Of all the lessons I will take away from this book, the most important may be this. Feed your cat. Faithfully, continuously & in large quantities. In fact, just cut a hole in the bottom of a 50 kg bag & leave it out on the kitchen floor, ok? You might thank me later.Renée"}, {"Review": "Always finding ways to be unique with his writing, Michael Connelly offers up something different for his fans in this latest novel, which mixes two of his most talked-about protagonists. Two detectives from two jurisdictions, sharing their life stories and bound together by a single cold case that has them fully committed. While working the ‘late show’, LAPD Detective Renée Ballard comes across former LAPD legend Harry Bosch flipping through old files. Ballard soon learns that Bosch is working"}, {"Review": "I really enjoyed the first Ballard book, The Late Show, in which the young female cop showed some of the vim and vigor we’d seen from Harry Bosch back when he too was an LAPD detective. Banished to the night shift after calling out her boss for sexual harassment, Ballard consequently nursed a chip on her shoulder as she remorselessly chased down her quarry. I thought it was a great book and seemed to promise a even money chance that at some point in the future she’d share some page space with Bo"}, {"Review": "Detective Renee Ballard was working on her report for the night’s killing back at Hollywood Station when she heard someone at the files on the other side of the office. That was Ballard’s first meeting with retired LAPD Detective Harry Bosch. Bosch was working a nine year old cold case – the murder of a young fifteen year old which he was determined to solve. The nine year gap made it much harder. When Ballard learned of the case, she was keen to help Bosch – and so it came about that the late s"}, {"Review": "A request for a simple wellness check starts the ball rolling.  The woman on whom Detective Renee Ballard is calling is long past answering her doorbell.  The revolting stench greeting Ballard as she enters the home proves it.  Meanwhile, our old friend Harry Bosch is investigating a cold case.  He's semi-retired now, but his no bullshit attitude and tenaciousness are intact.  He's getting older, has a trick knee, and makes the occasional error in judgment.  It is inevitable that Bosch and Balla"}, {"Review": "This book is a combo Harry Bosch-Renée Ballard story. In my opinion, Bosch is a given; there’s no doubt he can easily carry the plot. Ballard, though, is almost an unknown in spite of reading the first book, The Late Show, where she is introduced. With that book, I had reservations about her being a stereotyped female Bosch. This book proves that may be the case, but it absolutely works and I’m thrilled! Bosch has always done things his way and mostly gets the job done. Ballard is very similar;"}, {"Review": "If you're into stuff like this, you can read the full review.Rump and Rexit: \"Dark Sacred Night\" by Michael ConnellyConnelly even tries to paper over it later, having one of his character vaguely muse about how stupid it was. This is just lazy writing. “Literary” novels can get away with a lot if the language is impressive enough. Crime novels are hard. If I was a crime fiction writer I'd want the fact that I could write Literary Crime Fiction hushed up. I wouldn’t want anyone to know I could tu"}, {"Review": "\" I think this is the beginning of a beautiful friendship \". If you have seen the movie Casablanca, then you know this classic line. And, it's such a perfect way to describe the paring of Renée Ballard and Harry Bosch.DARK SACRED NIGHT is the second Ballard book and the 29th Bosch. And, I was thrilled to get a copy of the book. Bosch was mentioned in The Late Show, the first Ballard book, but I never thought that we would get a crossover so early. I thought perhaps a cameo or something in the tw"}, {"Review": "Another stellar book from Michael Connelly. In this one he alternates established everyman protagonist Harry Bosch with newer main character Renee Ballard.Harry is always an empathetic character--strong, virtuous, sensitive--but Connelly and his editor have done a good job of providing an experienced, alternate, woman's voice in Renee Ballard.Highly recommended. Put Dark Sacred Night next in your TBR stack."}, {"Review": "The team up between Ballard and Bosch does a disservice to both: Dark Sacred Night is an unusual bland and sometimes even boring book which is more like a series of events than a story with a interesting plot. The ending is better then what came before, but the solution to the mystery came out of nowhere. Hopefully Connelly will get his groove back with his next novel."}, {"Review": "Michael Connelly is an great crime thriller writer with the excellent character Harry Bosch, but he doesn't stop there. He has created other enjoyable lead characters like Mickey Haller (The Lincoln Lawyer) and now Renee Ballard who comes into her own in this 2nd book where she teams up with  retired detective Harry Bosch.Detective Renee Ballard works the late shift and teams up with Bosch who is investigating the death of fifteen-year-old Daisy Clayton, a drug addicted runaway who was brutally"}, {"Review": "More Bosch than Ballard, Dark Sacred Night teams up Michael Connelly's longtime protagonist with his latest to create a well balanced and entertaining police procedural bathed in the darkness of LA's nighttime underworld.Bosch has a case which haunts him; the murder of an underage prostitute he's never been able to solve. The case eats away at him. Every day he's reminded of his failure, in part due to the dead prostitutes mother who shares his personal residence - their relationship purely plat"}, {"Review": "Renee Ballard is working her usual late night shift when she finds a man going through files at the station. It turns out this stranger is Harry Bosch, a retired detective, who is working on a cold case that has turned personal. Ballard sends him on his way, but begins looking into the files Bosch was flipping through. Once she does, she becomes interested in the case too: fifteen-year-old Daisy, a runaway who was horrifically murdered, her body left on the streets. Ballard begins investigating"}, {"Review": "The Late Show introduced Renée Ballard and in Dark Sacred Night Ballard we meet Bosch. This is really the book that establishes the premise for the rest of the series. I think I am going to enjoy this partnership. Both Ballard and Bosch are lone characters, both are very experienced and very good detectives, very dedicated and willing to bend the rules. I have always been ambivalent about whether to start the Bosch series and I thought this new series would be a good way to dip my toe in the Bos"}, {"Review": "All the stars and more for my favourite detective Harry Bosch and Renee Ballard teaming up in Dark Sacred Night. Michael Connelly was one of the first \"grown up \" authors that my Dad got me hooked on when I was a teenager and all these years later he is still going strong. I was so very excited to be approved for an early copy of this book and writing a review for it terrifies me! I hope that I can do this book and the author justice. When you have a character like Harry Bosch who bends the rule"}, {"Review": "Bosch and Ballard together solving crimes in downtown LA, sounds a recipe for success, unfortunately my original enthusiasm was not realized. Ballard is the new kid on the block, first introduced last year in the excellent \"The Late Show\". She has a lot to prove, riding the night shift, surfing in the morning accompanied by her faithful dog Lola. It's tough working as a female detective always open to criticism and ridicule and constantly under the watchful eye of her male colleagues just waitin"}, {"Review": "9/10*slow claps*Surprise surprise, another quality book by Michael Connelly. Doesn’t he get bored of knocking them out of the park every time? This one is up there with some of his best work and to say it’s the 21st book in the Bosch series, that’s no mean feat. This outing has a combination of the perennially awesome Bosch and the newcomer Ballard from his previous book, The Late Show (unsurprisingly, really good). I’ve been a bit on the fence with these combo novels before due to the forced na"}, {"Review": "So this was the match-up that I never knew I needed. I am now wishing that Connelly had decided to match-up Harry with a strong female non-romantic lead before. I am not counting the books with him and Rachel Walling (see the Narrows, Echo Park, The Black Box, and The Burning Room). Fingers crossed that Connelly resists the urge to put them together. It is mentioned many times that Bosch is as old as her father (Renee) but Connelly also heavily implies that Renee has issues over the death of her"}, {"Review": "After I finished the first book in this series that brings together retired LAPD detective Harry Bosch and current detective Renee Ballard, I knew I wanted to read more. Admittedly, I wasn't all that taken with Ballard in The Late Show, but the aging Harry has never failed to reel me in. It's much the same here; I'm still not an all-out Ballard fan, but by golly, the story is so good that it didn't matter. And, the more I learn about Ballard the more appealing she's becoming (I very much like th"}, {"Review": "I love these Michael Connelly books because they always have great plots and intense characters. I wish Renee would get a house though. She is like a beach bum detective right now but it does make her more interesting. The crime plot was a very fascinating one with some good roller coaster moments. I love The team of Renee and Harry working together and I hope it continues into the next novels of the series. My quick and simple overall: entertaining and fast-paced. A great crime read."}, {"Review": "Here's a double helping of Michael Connelly's creations as Renee Ballard teams up with Harry Bosch in another well written police procedural.Connelly juggles multiple plot lines as effortlessly as usual, & continues to develop one of his latest characters along with one of his oldest. On the down side Connelly once again uses a tired crime cliche, which lets the book down a little. Without giving this irritating piece of lazy writing away I'll just says that the author used it in the previou"}, {"Review": "Dark Sacred Night by Michael Connelly throws together his longtime character Harry Bosch and LAPD Detective Renee Ballard in another grand police procedural. Ballard crosses the path of Bosch while he has been investigating a cold murder case of an underaged prostitute-drug addict. The two decide to investigate this murder and the novel moves on from there. The novel also includes other current investigative cases being worked on by the two detectives. One being where Bosch is actively being hun"}, {"Review": "I would like to thank Netgalley and Orion for an advance copy of Dark Sacred Night, the first novel to feature an investigative collaboration between Detective Renée Ballard of LAPD and Detective Harry Bosch, currently a part timer with the San Fernando PD.Ballard works night shift or the late show as it's known in LAPD, a solitary job with its slow times so she's immediately curious when she finds Bosch rummaging in the department's filing cabinets. He explains about his \"hobby case\", looking f"}], "ID": "38204691", "Name": "Dark Sacred Night"}