{"Genre": "Crime", "Reviews": [{"Review": "When all the other little girls wanted to be princesses - do you know what I wanted to be? And no, it wasn't a vampire, either... it was...HERCULE POIROT'S SIDEKICK!!!The fact that I actually took the time to edit my face into that picture should tell you something about a) my Poirot love, and b) the kind of hopelessly boring day I have suffered through :D"}, {"Review": "This was my first Agatha Christie novel and it definitely did not disappoint! I was not expecting that ending, which is obviously a good thing in a murder mystery story, but I am proud of myself for picking up on some other clues. I am so impressed by how she was able to weave this intricate of a story in only 200 pages and I can't wait to pick up another one of her novels in the future!"}, {"Review": "5 stars to Agatha Christie's Murder on the Orient Express. I chose to read this Christie spectacular after finishing \"And There Were None.\" She's such a treasure - never disappoints.A train. A murder. Multiple suspects. Nearly an alibi for everyone. But wait, there's a motive for everyone. How did this seemingly impossible murder occur? Hercule Poirot knows.Well, I'm glad he did because I was stumped! But with good reason as this plot twist will have your knickers locked down (and not just in a"}, {"Review": "*للقطارات سحر غامض تحدي الزمن*دائما يلهب خيال المبدعين. والت ديزني رسم ميكي ماوس لأول مرة في القطار، جي كي رولينج فكرت في ملحمتها هاري بوتر اثناء ركوبها القطاراجاثا كريستي استلهمت رائعتها جريمة قطار الشرق السريع في رحلة لها علي متن ذلك القطار المهيب العابر للدول والقارات*وللرواية البوليسية سحر غامض تحدي الزمن*واجاثا كريستي لها روائع في هذا المجال، وجريمة قطار الشرق السريع احدهابعربة قطار ملئ بالشخصيات المختلفة المتباينة..وامرأة غامضة ترتدي كيمونو احمر تجوب العربة ليلالدرجة انه بعد 75 عاما من كتا"}, {"Review": "I’m pretty astounded by how much fun this was. I mean, this may be just me, but “early-to-mid-twentieth century mystery about train crime” doesn’t exactly scream nonstop thrill ride. But here we are!I’m also not sure why it took me so long to write this review (two months, to be exact, so actually not that long for me but still) but again, here we are.I don’t actually really want to say much on this book, which is astounding in its own right because my number one hobby is making up various excus"}, {"Review": "”The train, it is as dangerous as a sea voyage!”So, this was my first Agatha Christie book and considering how much fun I had while I read it, it definitely won’t be my last. ;-) Yes, you read correctly and your mind didn’t play tricks on you:I had  F.U.N!!! I actually enjoyed reading this so much I constantly found myself giggling with delight! *lol* I swear there’s nothing better than a mystery or a puzzle you need to solve and I guess in this particular case it might have even been both! ;-PT"}, {"Review": "If you're on a train (or boat, or island), planning to commit a nice, unsolvable murder, and you find out Hercule Poirot is one of the guests . . . Just change your plans. That is all.I'd like to know if anyone has ever solved this particular murder mystery. It's mind-boggling, and deservedly one of Agatha Christie's better-known books."}, {"Review": "Wahoo! I'm finally going to read a Poirot book! I have the complete blu-ray box set and love this series so much! And now I get start on one of the books! =) ♥The wonderful Hercule Poirot can not ever go on any holidays without someone being murdered. But, never-the-less he will figure it out. And a murder has taken place upon the Orient Express. The man murdered in named Ratchett, but we find out later on in the story this is an alias. Poirot has simply uncovered that the murderer is on the tra"}, {"Review": "Sacrée Agatha Christie!She was pretty darn amazing.I must say I never read and so much liked a book with such a boring constant setting. I mean a train? Come on, how exciting can that get? … Apparently, though, it is a great setting for mystery cases! I just now remember watching ‘‘The Tourist’’ with Angelina Jolie, and wasn’t the scene in the train the one that was going to have in impact on everything to come? Yes, it was! Trains are fast, they create blurred lines, and they are filled with st"}, {"Review": " ‘’Some crimes God does not forgive!’’ Last week, I watched (for the gazillionth time…) ITV’s 2010 production of ‘’Murder on the Orient Express’’ with the inimitable David Suchet in the role of our beloved Hercule Poirot and it prompted certain thoughts in my mind. Why is this considered one of Christie’s finest creations? Many say that, arguably, it is her best work and this view I do share.I don’t think any of us need a synopsis. To say the story is well-known would be an understatement. Even"}, {"Review": "Well, ladies and gentlemen. That was fantastic! I mean, what can I say? Agatha Christie was a genius. So is David Suchet who narrated the audiobook (and played Poirot in the TV show).This story is set on a filled to capacity train, heading from Stamboul (Istanbul) to London. It's the middle of winter and the snow has built up on the tracks and forced the train to a standstill on it's way through Yugoslavia (an area that is now in Croatia). This is when the murder is discovered, which luckily for"}, {"Review": "I fear it is impossible to say too much about this book without spoilers. Because of this I will be brief so you can never go back and say, \"I would have loved this book, but that Matthew guy from Goodreads ruined it for me!\" So, here is my quick but hopefully useful review.This is a classic mystery. You like mysteries? You have to have to read this! Characters are great! So much fun meeting and learning about them all.Current mysteries have nothing on Christie. This is very intricate and very f"}, {"Review": "I read this book mostly in preparation for the 2017 film adaption, but I've always been curious about Agatha Christie. She's been recommended to me multiple different times over the course of my life, but I never felt the time was quite right to pick up one of her novels until now. The premise is very straightforward; master detective Hercule Poirot happens to be aboard the Orient Express rail car when one of the passengers is killed in the night. He is then set to the task of solving the crime"}, {"Review": "A train stopped at midnight in the snow. A dead body found in a compartment. Twelve stab wounds leave no doubt it was murder. And Hercule Poirot, tasked with solving the crime, is certain the culprit is a passenger on the Orient Express. The first clue that Murder on the Orient express will be a laborious read arrives shortly after the murder victim is discovered. Among the clues is a scrap of paper which reads (view spoiler)[ “– member little Daisy Armstrong.” (hide spoiler)] From this clue, Po"}, {"Review": "If you've never read one of her books, this one sums up the Agatha Christie experience quite nicely.As in: You will never solve her mysteries.Don't bother trying, because it will only infuriate you when you find out that the answer to the whodunnit is something far-fetched & entirely unbelievable.Roll with it, I say! Just trust that the little Belgian detective will eventually make everything all right, and settle in for a cute (albeit old-timey) mystery.I'm not gonna bore you with a plot sy"}, {"Review": "Actual rating: 4.5 🌟This was my first, but definitely not my last, Agatha Christie book, and I truly loved it!It was a wonderful mystery that kept me guessing the whole way through.I really liked the structure of the novel. Each character getting their own chapter was a genius idea, it really helped me to get to know them. All of them seemed realistic and well developed, which was surprising, considering the amount of people and the rather short length of the book.The writing style was very atmo"}, {"Review": "I have a confession to make. I’ve never read an Agatha Christie novel. Why is this a big deal, you might be asking yourself if you have also never jumped on the Christie train. (Train? Get it? Because this entire book takes place on a train! *laughs forever at own joke*) Well, I’m a life-long bookworm, with a degree in English literature to prove it. And Agatha Christie is the unarguable queen of an entire genre. Did you know that Agatha Christie is the best selling novelist of all time, second"}, {"Review": " All aboard to the mystery!  WILL THE REAL POIROT PLEASE STAND UP? My visual memory of the famous fictional detective Hercule Poirot is the actor Sir Peter Ustinov, yes, I know, he doesn’t look like he’s described on books (and even according Agatha Christie’s daughter, he doesn’t behave on screen like the book detective) but when I was a kid, I’ve never read any Agatha Christie’s novels, meanwhile I have watched several of the theatrical films and TV movies made by Peter Ustinov and along with"}, {"Review": "Okay, how do i start this? Is it possible to be shocked and not shocked at the same time? I mean, that should be a normal reaction for reading this book. Honestly, i don’t know how i’ll make a good review for this but i’ll give it a try.First of all, i’d like to say that this is one of the best books i’ve ever read in my 23 years of living. I don’t think i’m exaggerating though.Second, the way the story was written, the details, the clues — it’s like you, as the reader, are the one solving the c"}, {"Review": " قاعدة ما قبل قراءة الروايات البوليسية رقم ١ :لا تقرأ الريفيوهات لا تقرأ الريفيوهاتلا تقرأ الريفيوهات و إلا ستندم -_- "}, {"Review": "من الصعب حقا ان تقرأ رواية بوليسية ممتازة لمرتين"}, {"Review": "The lone train chugs down the tract westward, in the cold, dark, winter's night, over a country that no longer exists, from Istanbul,Turkey, to Calais, France, then across the English Channel by boat, for home, a long, tedious, three day trip. For Hercule Poirot, just having successfully wrapped up a case, in Syria, yet he's summoned again to another. No vacation, for the tired man, London calls and he goes...The little Belgian detective (please stop calling him French), is much in demand. Becom"}, {"Review": "All aboard the murder train!A long time ago when I was in high school and dinosaurs still roamed the earth I read a whole bunch of Agatha Christie novels. The weird thing is that I was never that big of a fan of hers. I was getting into mystery novels, she’s one of the best known writer in the genre, and the local library had a whole bunch of her stuff. At some point I realized that I prefer my murders to be a bit less civilized, and I moved onto other styles of the genre without giving much tho"}, {"Review": "I do not like to write reviews of whodunits: you can't do justice to the analysis without explaining what happened in detail, but then it spoils the story for whoever has not read it. So, for those mystery lovers who have not read The Murder on the Orient Express so far, I will post a single line review: Go and read it! This one rocks! What are you waiting for?Now, the review for fellow mystery and Christie lovers who have read the book(or like me, re-read umpteen number of times till the pages"}, {"Review": "Murder on the Orient Express is my second Agatha Christie novel. The first was The Murder of Roger Ackroyd which I loved and like Murder on the Orient Express I didn't guess the killer. Agatha Christie is The Best-Selling novelist of all time and pretty much invented and perfected the whodunit. Orient is neatly crafted, elegant and fun. All of Christie's novels(I'm basing this on all 2 of her books, I've read) have a simple layout, A murder is committed, an array of suspects and just enough info"}, {"Review": "Murder on the Orient Express is one of Agatha Christie's most loved works. Adapted for radio, film and television, most people have some idea to what you are referring when you mention it. A classic whodunit with Christie's signature styling on characters and investigation. I adore Hercule Poirot and grew up binging on Christie's works. I read this book as a child, and of course have seen a couple of movie adaptations, but in spite of that, I still had a rollicking good time reading this again."}, {"Review": "Finally, I’ve read this book! And now I can see the new movie. Agatha and Poirot are geniuses. "}, {"Review": "Murder on the Orient Express, Agatha Christie, c1934Characters: Hercule Poirot, Samuel Edward Ratchett, Hector MacQueen, Masterman, Colonel Arbuthnot, Harriet Hubbard, Count Rudolf Andrenyi, Countess Elena Andrenyi, Princess Natalia Dragomiroff, Mary Debenham, Hildegarde Schmidt, Antonio Foscarel, Greta Ohlsson, Pierre Michel, Cyrus Hardman, Dr. Constantine, M. Bouc.عنوانها: قتل در قطار، قتل در قطار سریع السیر شرق، تاریخ نخستین خوانش: روز پنجم ماه آوریل سال 1977 میلادینخستین بار در سال 1934 میلا"}, {"Review": "I decided to read this classic Agatha Christie story in anticipation of the new movie starring Kenneth Branagh as Hercule Poirot. I listened to the audiobook, performed by Dan Stevens, and it was a delight. A quick summary: The international detective Poirot is in Istanbul and is eager to get back to London. Thanks to help from a friend, he gets the last berth on the Orient Express, which was full of passengers. On the second night of the trip, a man is murdered, and tensions rise when the train"}, {"Review": "“The impossible could not have happened, therefore the impossible must be possible in spite of appearances.”I just realized that I've never written a review for this. Must have slipped my mind. Maybe because I'm so excited to see the movie adaption with Judi Dench, Rooney Mara and Daisy Ridley.Anyway, this wasn't what I had expected, and then again it was. Now, whenever I saw this book on here or in a bookshop I pictured a very diverse and interesting cast of characters and a classic murder myst"}], "ID": "853510", "Name": "Murder on the Orient Express"}