{"Name": "Lethal White", "Image": "https://images.gr-assets.com/books/1531231509l/28170940.jpg", "Reviews": [{"Review": "K, I'm going to put this down. I read 25%, so I'm going to refrain from giving it a rating, as it's not fair. I didn't read enough. And maybe I'll pick it up again some day, but as of right now, I'm having a hard time stomaching it for its... politics.It's a true reflection of Rowling's staunchly center-left politics, as she takes sharp digs at far leftists as well as the conservatives. That's fine. What bothered me was the incredible lack of nuance in the Israel-Palestine conversation Rowling seemed to be wanting to have. For a topic so sensitive and so relevant, Rowling took a clear side and seemed to be taking digs at anyone who is critical of Israel's position. And for someone like me who has an opinion on the issue, who does take this conflict rather seriously and personally, I simply don't feel like continuing.The writing was as good as ever. The characters were still the same characters I grew so attached to, and I would love to read this book another time just to find out what happens with Robin and Cormoran, but... maybe another time.I'd just like to say that for whatever reason, my review does show up near the top of the page, and I know it's visible and people will disagree with me. But please refrain from attacks in the comments. :)"}, {"Review": "Lethal White, the 4th volume in Cormoran Strike series, kept me at the edge of the seat/bed during the past 4 days. I think it is the best so far although some parts could have been trimmed by the editor. It starts to resemble the Harry Potter series, with each book longer and longer. If this one has 650 pages I hope the next will not have 800 or more. Rowling talent as a storyteller in so I was never bored but still, the plot could have been a bit more intense with a bit less filler. The novel starts with the ending of A Career of Evil, namely the wedding between the Asshole and Robin. J.K. Rawling managed to create one of the most irritating characters I’ve ever read that it is hard for me to believe it can be found in real life. Anyways, after the drama at the wedding the plot moves one year forward when Cormoran’s services are sought by a young, psychotic boy who wants to hire the detective to uncover a hanging he thought he witnessed when he was very young. Although the boy was mentally ill, Cormoran’s instinct tells him that the story is not wholly invented and from the little he got from the youngster’s chaotic mind he manages to identify his brother, a dedicated socialist and activist. From here the plot gets more an more complicated, involving politics, blackmail, upper class dynamics and murder. The plot is very complex, there are many threads in the plot that do not seem to be connected until the end, as it is written in the blurb it is very ambitious in scope. Off course, JKR added to this mix the personal lives of Cormoran and Robin who are even more tumultuous then in the previous books. I love this series and the author so I can’t wait to read the next one. However, I hope it will be a bit shorter and more intense."}, {"Review": "Roses r Red, Violets r Blue, the Cover's Green just to suite you.💚💚Strike & Robin are back for their biggest case so far....case full of Red Herrings & White Horses.LETHAL WHITEA blackmailed Minister, Riot in the Olympics, Mysterious Murder..Goblet of Fire, 's that you?!Plus, more unexpected twists into the personal life of Strike & Robin..Certainly I'll miss picturing Hugh & Emma as I used to since my first read, Oct.2013.Lethal White is 2 Parts book, 2 Cases.. not totally separate but essentially different kind of investigations needed for each..The story truly sprawling this time... the cases are very complicated with many things need to accomplished.. Thrilling, compelling , and with touch of romantic.The Characters facing much harder times, both in their personal lives...and the professional ones due to the high political rank of the client this time.The Places are even more important and unexpected to be in...------------- The Story -------------☆☆☆ How did it Start ☆☆☆Starting right at the 'cliffhanger' the previous book left us at, with Robin wedding 'n all.About 30 pages at the wedding that made my smile wide, heart warming, thrilled and tensed and happy all in the same time.It was the conclusion that needed badly right after you finish book three, like..3 years ago!\n\n    \n      But then,☆☆☆ One Year Later ☆☆☆First Case\n    \n  \nWelcome back to 12 Bar Street(More on that later…)The Agency is getting much bigger now, more employees, new temp (unfortunately disappeared later), and more cases..A mentally troubled young man, Billy ,arrive, reporting infanticide he witnessed years ago...and fleet paranoid they may arrest him.Only curiosity, and few free hours, made Strike check the boy's older brother. Jimmy  The revolutionary lefty, who make meetings to prepare marches against the imperialists Olympics that set in London at the time, June 2012..And somehow that lead to a call from a new client...the most important one so far to Strike… A Minister..Chiswell, The Minister for Culture…His case is ; just digging dirt on 2 blackmailers threatening the Minister..one of them, the Minister for Sports’ husband...the other is Jimmy Knight...the mentally troubled kid’s brother.What are they blackmailing him for is not Strike businesses, his client insists on just digging dirt on them..What's more, Billy’s story concluded with the murdered child is buried in Chiswell’s horses farm borders.And half way through, with risky undercover detective work, stressful personal life, and not much dirt to satisfy the client, or even us, the readers…Then a huge turn of events happens, AND a gruesome murder...and we move to ;\n\n    \n      ☆☆☆ Three Days Later ☆☆☆Second Case\n    \n  \nNot much a change to the characters, just different client of the same family… for a harder more serious case.. A Murder Case.And it's faster now, still dense and tangled, but more thrilling and as classic crime novels as it gets …Yeah, it's the biggest story for Strike & Robin so far, yet it's the most challenging one, I fast re-checked some parts after the twists, and oh man how it all fit...how every minor insignificant question served as a Red Herring has been answered..Enough with the story, I won't try to spoil it for you. And let's catalogue the review this time as Mr. Strike does for his cases reviews\n\n    \n      ☆☆☆ The Places ☆☆☆\n    \n  \n\n12 Bar St.\nThis vivid way of Rowling's Galbraith's writings makes Denmark Street as a place I've been living every single time I read this series since 2013...the background sounds, the music shops, the customers trying their potential buyings... God, I've missed this place since last book..In this 4th book, there's a dreadful threatening that it may NOT be the place for Strike agency for long (which is really sad news).It reminded me with the dreadful anticipation 5 years ago about will Robin stay for another book or not…But the sad thing is, It's a real life actual address and building , and as today, 2018 it's already vacant building... But this book is set in 2012 , London…. Rings a bill?\nLondon 2012\nIt's the Olympiad year, held in London..Lucky people those who have Rowling as their national author… she capture and preserve the atmosphere back then perfectly between the pages of the novel..The English society complaining the difficulty of getting desired tickets… dreading unfortunate thing turning the coming opening ceremony lame.But what's more relevant to the plot, is the protesters, against the Olympics as a face of Imperialism..that's because one of the Blackmailers are revolutionary lefty attacking The conservative party, the tory...like Strike’s client, The Minister Too much politics? Well, there's more\nThe Palace of Westminster\nThe second blackmailer is working at the parliament, he's the Minister for Sport's husband..Well, it required a risky job of going undercover in this extremely important place...which you will feel really getting inside every place there by the author ability of transporting you by her words as if you see the whole place from through professor Dumbledor office's Pensive…It's really inside look there... also,\nThe Lancaster House \nThe big Paralympic reception ceremony at the Lancaster House witnessed a huge unexpected meeting for Strike..a personal life turn of event , as elegant as this house was really long waited since early book one..It had also a significant impact at the plot, cause the day after the ceremony is where part one ends...and the second started..\nThe Horse of Uffington\nWhen Billy came to pull the trigger of Strike’s curiosity, that led to 2 different cases, though both almost unrelated, it kept returning to this horse, the white horse of Uffington , it appears that's where the murder Billy claimed happened , which is also near Chiswell’s Horse farm..Like many strange ancient sites, It had a myth related to dark magic...alas, mentioned but not used here though.But still it's one of the many Horses that surround the characters..\n\n    \n      ☆☆☆ The Characters ☆☆☆\n    \n  \n\nCormoran Srike\nDespite his cute unacknowledged of various different names the high class distinguishing the horses according to the colours, I almost hated him here..His relationship with a new girlfriend was so bad, so typical bastard ... I really hate what he did, all that cause of a harmless word of Love. He didn't even give her a better closure...Well, we can relate that to his complicated feelings toward his newly wedded partner, Robin..Mohammed Arabey19 September 2018For more on the amazing chemistry duos... the pre-reviews 2 years ago in the spoiler below..(view spoiler)[As a teenager in the 90s, most of my peers' favourite love couples stories were Romeo & Julie, Rose & Jack -Dawson,dahh-,Ross & Rachel, Tom & Nicole -Brangelina wasn't there yet-, etc...but not for me..It was just Mulder & Scully,I was obsessed by their bond,can't describe it & that's not the place, but for years I never loved a couple as much as that kind..And Then there was Cormoran Strike & Robin Ellacott..Also I never waited for sequels as eager as for this amazing series Since the Harry Potter..So Happy Valentine's Day Cormoran & Robin... we can't wait to know what will happen after the cliffhanger of Book Three. Mohammed Arabey14 February 2016The drawings of Robin and Stike's source  (hide spoiler)]"}, {"Review": "\nA little too long and overly complicated mystery BUT still well worth the read!\n Lethal White picks up shortly after where Career of Evil ends at Robin and Matthew's wedding. Then the plot fast-forwards to a year later when London is preparing to host the Olympics. Strike is now famous and business is flourishing. Robin, on the other hand, is suffering from PTSD and is living in a state of misery. Two cases are at the forefront, while some side cases also get some attention. There is a lot going on, with many characters to keep track of. While the mysteries eventually come together, at times I was lost when trying to keep up. Characters from previous installments also pop up, including revolting Charlotte and idiotic Matthew. I also found the plot to be drawn out and the pacing, at times, to be rather slow. However, things do pick up in the second half.I read this series because I love Strike and Robin’s characters, as well as their chemistry. They are both multidimensional and believable. It feels like there was finally some forward movement with their relationship, but it remains to be seen how things will progress. While there are some flaws, all in all, I was so happy to read this and I CANNOT wait for the next book in the series!"}, {"Review": "650 PAGES IS TOO MANY PAGES FOR A MYSTERY NOVEL. That being said, JKR puts together a damn good mystery and I loved all of the actual mystery parts of this story. She is the *best* at creating great and interesting and fun characters. (More Barclay in the next book, kthnx)However, I think that JKR is pretty terrible at writing romance (don't @ me) and I very, very, very much do not love the whole Robin/Strike pairing and everything surrounding those parts of the story or anything dealing with Robin and Strike's separate relationships. They are a great partnership and the scenes with them solving crimes together are always fantastic, but I do not enjoy the romantic aspect that is super amped up in this one. (Although I know plenty of other people love them as a pairing so you'll probably enjoy those parts of the story)TL;DR - Great mystery, but I will scream if the next book in this series is this long."}, {"Review": "JK Rowling gives us her trademark intricate, tightly plotted, and complex crime fiction in this, the fourth of her engrossing Cormoran Strike series, set amidst the heady and euphoric background of the surprisingly successful 2012 London Olympics. It begins where Career of Evil left off, at Robin Ellacott's disastrous wedding to the sullen and resentful Matthew, with Robin over the moon at being reinstated at Strike's detective agency as partner. Strike is finding his fame is reducing his opportunities to work out in the field, and is forced into a more administrative and organising role as the agency becomes inundated with work. He brings in other operators with mixed results when a young manic and mentally disturbed young man, Billy, seeks him out to tell of a child murder of long ago in Oxfordshire. Billy is vague about details, and though very young himself, he had been drugged, and uncertain as to the veracity of the memories that have eaten away at his sanity through the years. Strike's interest is aroused, specifically with the detail of the pink blanket that lends an authenticity to the tale, but Billy becomes alarmed and runs away.The narrative has a running motif of horses, Lethal White Syndrome is where a mare gives birth to a pure white foal that appears to be healthy, but is fatally afflicted with a defective bowel, impeding its ability to pass faeces, doomed to not survive. Strike gains a financially lucrative case that oddly enough has connections to Billy where a prominent politician is being blackmailed and needs to find dirt on the perpetrators. In a story set amidst the intrigue and political machinations within the Houses of Westminister, the close knit circles of the privileged classes and far left politics, Strike and Robin find themselves short on leads. They are on the scene of an apparent suicide, have emotionally fraught personal lives, and visit a dilapidated run down Manor House in Oxfordshire, home to the Chiswell family and their secrets. There are a host of suspects that the detectives have to sift through as they endeavour to connect means and motive in their search for the truth, unaware of just how much danger they are in.This is a long read and I know this will make many readers unhappy, but for me I liked the length as I was thoroughly absorbed by this novel. A particular highlight is the depth of the wide range of diverse characters, and the state of marriage and relationships. Through the years, I have seen at close hand amidst my circles of family and friends, various permutations of the relationships outlined in Lethal White. Della Wynn, the blind Sports Minister makes the insightful observation \"I think marriage is nearly always an unfathomable entity, even to the people inside\". We see the soul destroying misery of Robin's marriage, Lorelei faced with an emotionally unavailable Cormoran who sees her little more than a convenience, the dysfunctional and destructive Charlotte Ross's marriage to Jago Ross, Jasper's problematic marriages and affairs, Flick and Jimmy's turbulent relationship, and Della forced to confront the reality of Geraint's behaviour. In personal relationships, emotions and the desire to avoid conflict can make it difficult to draw the necessary red lines, Rowling does a sterling job in exploring the nature of relationships in this book. This is hugely entertaining and intelligent crime fiction, and I look forward to reading the next in the series with eager anticipation. Highly recommended!"}, {"Review": "confession: there are times when i feel like i am an unreliable rater/reviewer. j.k. rowling practically gave me my childhood, so i feel like the least i could do to thank her is by reading and giving all of her books 5 stars. to say im biased would be an understatement. but in the case of this book, i can say, with good conscience, it deserves all 5 of those stars.i was worried when JKR first began writing for adults, especially under the crime/mystery genre. but four books of this series have proven that she can write whatever she wants and it will be bloody brilliant. one thing i think she does really well, and with this book in particular, is how complex her stories are. no one could dare call her a lazy writer. the plot for this was so intricately crafted and it was absolutely remarkable how everything was woven together. the book blurb doesnt even scratch the surface of what this story entails - there was just so much, so many layers. and i think because of that, the book did get to be a little lengthy. 650 pages is massive for a mystery/thriller novel. some parts did seem to drag and there was a lot that i felt could have been omitted. but regardless of length, this book always captured my attention. the last paragraph definitely hinted at the beginning of a new case, so i am very excited to see what robin and strike get up to in the next book. fingers crossed it wont be another three year wait to find out!↠ 4.5 stars"}, {"Review": "As I decided to read this book and only this one during the past week, it dawned upon me that indeed, this book has been written by Robert Galbraith, and it's J.K. Rowling who is the ghostly figure here. I don't fear being ostracized for my rating. But most of my friends have given this book higher ratings than me.The denouement was not the balm that could assuage the page upon page of nothingness. The murderer's identity was moot. The damage was done. The bird has flown the coop. Though this was a thriller or a mystery rather, I felt fear while reading it. Fear for the time being wasted. Fear for my sanity...I don't know if I will read the next book in the series. I honestly don't. This is a special one star that I've rated. The rating means my freedom of choice. My review means my gravitational enticement towards this series. I hope you understand."}, {"Review": "This was an okay crime story, but as I was reading “Lethal White” I couldn’t help but be frustrated by the fact that this book was TOO LONG! 600+ pages to tell a crime story is too long when the plot is so dense and the different storylines so intricate. Interwoven with that we get the story of Robin’s and Strike’s continued partnership which was another thing that quite frustrated me: This book was a case of dumb decision-making based on misunderstandings that could have been solved if only the characters had communicated! On the plus-side, though, this book gives you another story set in London, following Strike as he goes through painful experiences with his prothesis and late nights (yet again!), and Robin whose passion for her job is admiring. But in the end, this was a book I was reading just to finish it, not a book I was reading because I absolutely needed to know how things would end. That’s a shame, but at least I finished it and enjoyed my reading experience for the most part. "}, {"Review": "Robert Galbraith’s Cormoran Strike is in no doubt my favorite private eye series. I love Strike’s relationship with his now parter, Robin Ellacott. The two work so well together. I started the series with an audiobook and have continued to do so. The narrator’s voice is striking and perfect for Cormoran’s tough guy persona. Strike likes intelligent women and treats them as his equal. Always a wonderful thing to come upon in a book. There is nothing like seeing a woman with a good mind given the chance to use it and being appreciated for it.If you have been thinking about trying this series, do give it a go. It’s well worth your time.5 out of 5 stars"}, {"Review": "This should have been a magnificent book, but in the end I am giving it four stars and saying it was very good indeed. The one star deduction is for the way the book began. At first it was just so slow - not a lot happened and Robin's endless monologues about whether she loved him or not ( and there are two possible hims there) went on and on. And on.Then we started to get into the meat of the story and crimes were committed, people went undercover, some characters acted really badly, some had their lives threatened and it all became very entertaining. Rowling's greatest talent is in writing very involved and intricate plot lines which always come together so neatly in the end. She did it perfectly in Harry Potter and she does it again here. In fact, as the book ended, it was so good that I forgot my slight displeasure with the opening chapters. But I keep notes and they reminded me so it is still four not five stars. It's a great book though and very much worth reading."}, {"Review": "4 stars right on the nose. It is another decent mystery very much in the same vein as the previous Strike novels. If you have read those you know exactly what to expect here.Lots of characters: Galbraith (Rowling) likes to fill her mysteries with characters. If you are a person that is easily confused if there are lots of characters, proceed with caution. I definitely have to stop and think about who is who from time to time.A convoluted mystery: Another thing that keeps me stopping to think is that the Strike mysteries are never straightforward. There are lots of details, many interviews, tons of red herrings. These are not mysteries for the easily confused. Personal conflict: If you are here for the tension between Robin and Cormoran, this will definitely be your jam. I think this book had the most story about their lives outside of the mystery of any of the previous novels. I would be willing to say that 1/3 to 1/2 is about their personal lives.An enjoyable audio experience: I have done every book in this series on audio and it has the same narrator every time - Robert Glenister. It is always nice to listen to a British accent (even if sometimes he gets into dialects that are hard to understand). I can definitely feel the streets of London in his voice.I recommend this book to any who have enjoyed the series so far. If you decide to read this out of order from the rest of the series be warned that some of the personal conflict I mention above will not make much sense to you, but shouldn’t detract from the main story."}, {"Review": "\nStrike & Robin are back!\nThis is the fourth novel in the \"Cormoran Strike\" book series.\nPOLITICS & FAMILY DON'T MIX\nCormoran Strike has become a famous detective in London, thanks to his success of catching the fearsome \"Shacklewell Ripper\"; and after re-hiring Robin Ellacott as her main partner, now he has even had to sub-contract other people to be able to cope with all the cases that have come to his office.But despite that apparent bonanza of work, nothing has prepared Cormoran Strike for his most bizarre case to date, starting with whom takes the case to him, it is certainly his strangest (and unreliable) \"client\" to date......and in this detective book series is saying a lot.When Billy Knight, a troubled and paranoid young man, comes to Cormoran’s office to ask for his help investigating a murder he believes he witnessed as a child......however his testimony is hard to follow, and even worse when Billy escapes from Cormoran's office.Cormoran finds out that Billy is part of the Chiswell family, powerful in the fields of money and political influence, so he suspects that something must be behind of the erratic comments of Billy about a murder.Robin Ellacot is still emotionally dealing with her shock, in the previous novel, for not saying that her newly marriage is a quite shaky house of cards; but she must assume her new detective mission of going undercover in the viper's nest-like Chiswell manor.Fresh blackmails about crimes that weren't illegal when done, in the middle of seeking political power, will turn upside down the Chiswell family......and never will be the same."}, {"Review": "This book really irritated me. The mysteries, involving blackmail and a possibly strangled child, are not very compelling until the last quarter of the book. There's an info dump in the last two chapters that sums everything up. However, my major problem is that the book is mostly filler, not mystery. That might be ok if I were really invested in the Strike/Robin relationship (or non-relationship), but I'm not. That whole will they or won't they thing is tiresome. Robin is just a complete idiot in a soap opera marriage. Strike is such a cad that's it amazing he keeps attracting women. I'm tired of these people, and their romantic drama is way too much of the book. I also no longer want to hear about the pain in Strike's stump. The Ibsen quotes that start each chapter are meaningless. I know that no one has the guts to edit Rowling, but 650 pages for a mystery is ridiculous. I skimmed heavily. Hopefully when this book is dramatized for the TV series it will be leaner and more interesting. "}, {"Review": "Oooh... I waited for this book to be out with such anticipation! Dropped my other reads to get through this.Overall, it turned out to be a let down. I expected a compete blowmybrainsout read, but this was just an OK read at best.It starts with Robin's wedding... The wedding part was tense enough and got me absorbed in the book right away. But once that fizzled out, the whole Strike-Robin story took a dip down and had me rather annoyed with the pair more than anything else. There was nothing in the development of their storyline that would have kept me excited. It was very, very predictable state of affairs. More so, I didn't feel it. It just wasn't exciting... So leaving the personal stories aside, let's move to the thriller side of it. That part was not bad. But that's as much as I am going to give it. Again, it didn't feel much of a \"thriller\". Some twists were good, some not so good. I think overall, the plot felt like the author tried too hard attempting to twist and turn it all, and at times the whole lot got tangled in knots.The writing felt a bit forceful too. So, after all that waiting... Yeah, it was ok, but just about."}, {"Review": "For added gifs, you can also check out my review here! =)Warning, spoilers ahead! But only for Cormoran/Robin stuff. I didn’t spoil the mystery. That defeats the purpose.Themes for Cormoran:- Getting the agency stable financially -->This leads him to take on a case that is lucrative instead of the usual ones guided by his morals.--->The case involves digging up dirt on a politician who is beloved by the people.-Distracting himself with a comfortable relationship with Lorelei (I call her his bedwarmer, since he won’t let her in emotionally)-->Cormoran has come to terms with his feelings for Robin, though he’s careful to keep those feelings in check given that Robin is now married to Matt. Hence why Lorelei is simply a distraction. It’s like he’s waiting, though that’s never outright admitted.Cormoran as always is stable and predictable (not in a bad way). I love his googly-eyed Robin moments, because that is definitely a change for him. It’s more obvious this time. Charlotte of course makes a couple appearances, and I have a feeling she’ll be a problem during the next novel.Themes for Robin:- PTSD from the last book (re: strangling episode)- Altered dynamic with Cormoran: She wears a cloak of professionalism and distance for most of the book, worried about whether she actually has feelings for Cormoran, and whether she’ll get sacked again due to her panic attacks- Matt - She realizes she doesn’t love him, but feels obligated to try and make it work.-->Partly because of the expensive wedding her parents paid for, partly because of the sense of failure, and partly out of pity for MattMatt as always is jealous and petulant, continually judging Robin for her job. Nothing new there, except Robin is finally awake to it.There’s a theme of self-discovery and independence throughout this round for Robin. I love it! Her work is the most important thing to her, and she spends so much time trying to protect her job from the things she feels will threaten it––Cormoran, who she thinks will sack her if he catches on to her panic attacks, and Matt, who will give her grief in a mountain of I-told-you-so. She’d trying to be a rock, and sees her issues as a weakness. It leads to a lot of frustration, but Robin remains one of my favorite protagonists ever. These minor frustrations don’t detract at all from the fact that she is so darn likable.The dynamicAs I mentioned earlier, there’s so much distance between them. There’s a huge lack of communication between Cormoran and Robin, and so many misunderstandings as a result. Robin is jealous of Lorelei, and it affects almost all of their interactions. She doesn’t know that Lorelei is just a distraction for Cormoran, who is trying to forget that he can’t have Robin. And Cormoran has no clue that she’s continually on the cusp of calling it quits with Matt. If she did––if they’d fricken’ communicate––both of their frustrations would be over so quickly. But their situation is complex. Robin needs time to sort out her failing marriage. Cormoran enjoys bedwarmers, which can send mixed signals. If it weren’t for mixed signals and zero communication, they’d have ended up together during this novel (and yes, that’s me admitting that they’re not a couple in the end).Even though much of the novel is spent in distance, there are glimpses that give gratification. I loved the fulfillment it gave in the beginning––the moments where it’s so clear that Cormoran and Robin are jonesing for each other. It took so long for them to realize it. It doesn’t play out like a romance novel and give you what you want quickly (yes, that’s a good thing). It’s quintessential slow-burn, friends-to-lovers route. If these two were too much like magnets, and there was any component of instant gratification, I’d be annoyed. It’s building, and there’s progress. There’s no feeling of will-they-won’t-they. It’ll happen, slowly but surely. The build is realistic, and you can see the pieces coming together. It’s fulfilling, really.Political themesThis book reminded how objective J.K. is. The case they’re on involves a lot of politics, and it’s clear which side she leans since out protags seem to lean that way too but not in a zealous way. Robin points out the inconsistency with choosing this case, since they’re working for the “bad guys” (bigger paycheck and all), but Cormoran maintains that their jobs are consistently one big gray area and it’s no different this time. While he’s not chosen a job based on payout before, it shouldn’t matter that he does so now.I wonder if J.K. preemptively added hard left characters to balance the hard right knowing that she’d be criticized without it being even on both sides. There’s corruption on the left and the right at the highest levels of government, and flaws within the grassroots movements too. With how vocal J.K. is on political matters, and how much these topics are prevalent right now, I’m not surprised that it’s a major theme in the latest round of this saga.Compared with the showThe thing I fault with the show is that the arcs are too abrupt. The mystery is solved without the proper build-up and the slow coming together of the plot. And logistically, I get that there’s probably just not enough time to convert the complexity of her stories into a T.V. show, but it still weakens the plot. However, the show does have an edge in lessening confusion because you can put a face to the many names involved in each story, and there’s a certain amount of happiness that comes from actually being able to see the story unfold. The novel is more work; seriously, there’s a lot of names to try and keep straight. But the ending feels so much more fulfilling. The plotThere are predictable moments that occur in the interpersonal scenes, but it’s not unlike must-see destinations on a trip. Kind of like how you wouldn’t miss going to see the Eiffel Tower if you went to Paris. Just like vacations have highlights, this book also had scenarios I wanted to watch play out, and I feel like the book would’ve been incomplete without them. It’s a series, and I think that expectation just goes along with it. For example, I wanted Robin to have a scene in her green dress. Check. Cormoran and Robin go on a road trip in the Land Rover. Check.That predictability doesn’t extend to the plot though; the actual murder mystery parts of it felt impossible for me to predict. I’m still baffled by how something so complex can come from one person’s brain. There’s a moment where Cormoran is trying to get Robin to see the trends; he points out all of the clues in succession, and he’s basically like, “See it yet?” and she’s like, “There’s no possible way these things connect.” I felt the same way. Until the ending was laid out for me bit by bit, I had no clue what had happened. Cormoran is basically Sherlock; humans with normal brains can’t connect the dots like he can. If there are any plot holes, only Cormoran would be able to find them. My puny brain wouldn’t have a clue where to start.Side noteLethal white refers to horsey stuff. Again, another element I couldn’t predict. I thought it would refer to drug stuff. Lethal white syndrome is in pure white foals that are born with defective bowels. They live long enough that the mare gets attached to them, but they can’t pass feces and inevitably die. I won’t spoil why the book is named that, and I definitely didn’t give you enough info to spoil the mystery.VerdictI’m in love with this series and doubt my ability to remain unbiased. And up against the genius that is J.K. Rowling, I don’t feel qualified to criticize. I mean, I hated The Casual Vacancy, but that’s different. It just wasn’t my thing. I wouldn’t criticize that either, because I’m sure it’s brilliant, though it left me depressed as hell. But this series is thrilling and fulfilling, and apparently will outnumber Harry Potter, so I’m in for the long haul."}, {"Review": "Lethal White is the fourth (4th) book in the “Cormoran Strike” series, written by Robert Galbraith (J. K. Rowling). The series primary characters are Cormoran Strike (Strike) a private detective in London and his clerk, turned investigator, turned partner Robin Ellacott. The books are mysteries centered around the crime of murder. Strike is a veteran of the Afghanistan war where he lost a leg. He manages to get around on a prosthesis often stressing his stump to great pain and irritation. However, the series highlights Strike’s ability rather than his disability. In Lethal White there was also a blind woman who serve the UK as Minister for Sports. These are positive portrayals of persons with disabilities. Strike and his organization start out investigating the attempted blackmailing of the Minister for Culture, Jasper Chiswell (Chiswell) who later was found dead in what was originally thought to be a suicide. The book centers around Chiswell’s dysfunctional family trying to find out what really happened their patriarch and and Strike trying to find out who was trying to blackmail him and why. The family knew about the reason behind the blackmail but failed to give this information to Strike. Strike and Robin both are good investigators. The plot is complex and the book is slow and too long, in my opinion.Also, Strike’s and Robin’s relationship is weird. They seem to want more than a business relationship but are unable to get beyond this. Strike plays the field and Robin is unhappily married. I think this relationship is a major part of the story and it seems to keep people wanting to read more. After waiting a long time for this book I was a little disappointed. I did not like this book as well as the others in the series. No doubt there will be a fifth (5th) book."}, {"Review": "I’m not a big Harry potter fan and though have seen all the films I’ve yet to turn a page of any of the books. I’m just not into magic spells and all that malarkey. But I do admire the cleverness J. K. Rowling shows in developing a set of stories – a whole world, in fact – that has gripped so many people. My son is one of them; he’s also the reason I’ve watched the films - and played the spin-off video games too. But all of that aside, I admire Rowling most for having the versatility, the imagination and the wit to write crime fiction of this standard. She does so, of course, under the pseudonym of Robert Galbraith.The first and third books in this series are outstanding (for some reason I’ve so far managed to skip book two) and this tale is as well told and as riveting as the others. London based private detective Cormoran Strike is visited by a very fidgety and distressed man who tells him that as a boy he witnessed a young girl being strangled and buried. Almost as soon as he’s blurted this out he runs out of strike’s office, but not before he provides a cryptic clue as the the child’s burial site. So begins this complex but highly engaging story.At first Strike seemed to me to be an unlikely front man - partially disabled and ex-army his demeanour seemingly set semi-permanently to gruff – but I quickly warmed to him. He is tough, as you’d expect, but has a soft side and he brings humour to the party too. The only slightly odd element here is that despite his physical setbacks he seems to attract a stream of beautiful woman. An ongoing sub-plot here is the mutual attraction between Strike and his female assistant, Robin. And this time around their non-relationship is a central part of the book, with the will they, won’t they debate raging on throughout. I won’t go into the detail of what happens but suffice to say there’s a left wing versus right wing political theme knocking around amidst a tangled web of intrigue Agatha Christie would have been proud of. It’s a long book, but I didn’t mind that. I’d have been happy to plough on for quite a few more chapters, such was my enjoyment. Strike really is up there, now, with Ian Rankin’s John Rebus as the top crime stopper Britain has to offer. Now I really must go and search out book two."}, {"Review": "I have been very stingy with 5 star rating recently. But this book absolutely deserves to be rated 5 stars. I love this series and it just keeps getting better and better. If you love great murder mysteries with very interesting and intriguing characters, look no further. You don’t have to have read any of the other books in the series to enjoy this book, although I would highly recommend it. This will be in the running as one of the best books I have read this year, and I have read over 100 books already. This book gets my highest recommendation. This is the best one in this series so far. "}, {"Review": "3.5 starsThis book gets 5 stars for the personal/professional relationship updates between Robin and Cormoran, but only gets 2 stars for the 'murder mystery' presented in this book. I *loved* seeing all the extra page time that Robin and Cormoran finally get in regards to their individual personal lives (warning: the slow burn still burns slowly). In fact, the book is practically at the half way mark before anyone even gets murdered. Loved it! But then the mystery does take over like I said. While I found all the new side characters revolving around this mystery to be generally fully-fleshed out and interesting, I just wasn't that drawn into it. Mostly because no one seemed all that nice/good so finding out which exact terrible person murdered the dead terrible person isn't a 'happy' resolution to root for. I still very much look forward to reading the next book whenever it comes out. Also, when will the tv adaption finally come to America?! Come on BBC, send it across the pond please!Spoiler prediction for the next book:(view spoiler)[ I think that the next book will in part, if not fully, revolve around some kind of mystery involving Matthew or any of Robin/Matthew's friends/family/acquaintances.  (hide spoiler)]"}, {"Review": "If you're into stuff like this, you can read the full review.Bloated: \"Lethal White\" by Robert GalbraithI couldn't finish Harry Potter. It read to me like an amateur college project: it wasn't story telling, it was paint-by-number narration. It goes to show that if you tap into the right market at the right time then you're going to make a buck or two regardless of any skill or talent. With Harry Potter the first book was tightly edited, but they got progressively worse; the last ones were subject to fame and the publishers let the pace drop massively."}], "Genre": "Crime", "ID": "28170940", "Desc": ""}