{"Genre": "Crime", "Reviews": [{"Review": "It is always a pleasure to return to this series, although the author made us wait quite a bit for this new instalment! Nevertheless, here we have another compelling murder mystery that seems rather straightforward but of course isn’t :0)I just love Detective Inspector Richard Poole with his grumpy, choleric, unsocial, attitude, utterly out of his comfort zone in the idyllic Caribbean island of Saint-Marie. To see him once more bumbling on, making all sorts of social faux-pas, and yet doggedly f"}, {"Review": "Murder in the Caribbean is the fourth original story from the creator and writer of the hit BBC One TV series, Death in Paradise, featuring on-screen favourite detective, DI Richard Poole.It's a contemporary crime mystery with fake jewels and murder. Set in the Caribbean(obviously) the scenic beauty of this book sucks you in. The plot is predictable yet quite engaging and refreshing. It's solid on the entertainment factor. Also, the humour is on point.It's a light read and nothing intense. I had"}, {"Review": "Murder In The Caribbean by Robert Thorogood is a marvellous, light hearted, gripping, contemporary murder mystery. It is the fourth book in the Death In Paradise series but can be read as a stand-alone.I have watched many episodes of the BBC’s Death In Paradise series with Ben Miller but had never read any of the books before. Oh how I have been missing out. The book had the same atmosphere as the series – a camaraderie between the lead characters which sees them bouncing dialogue backwards and"}, {"Review": "Outstanding - full review at classicmystery.blog"}, {"Review": "Quite entertaining. For fans of the TV show."}, {"Review": "Rating between 3.5 & 4A nice return to the original team of death in paradise. This was an good story, that had a murder mystery which has been seen before but still had some nice wrinkles to it.Richard Poole seemed even more obtuse in this story as regards other people’s feelings so would assume the story is set earlier in season 1 of the show. There also only a single appearance of the commissioner very near the end and considering the type of case under investigation that was a bit if a s"}, {"Review": "The fourth in the series of whodunnits based on the characters from the Death In Paradise television series, based on the fictional Island of Saint Marie. By the same author, these are completely fresh stories, and they have the same four police officers, led by Inspector Richard Poole, seconded unwillingly from London, but still wearing his suit and carrying his briefcase. The characters and their relationships, the plotting and the writing, and the surprise denouement, together make an amusing"}, {"Review": "I received a paperback copy of this novel as part of the blog tour for publication day 27th December 2018, in return for an honest review.I enjoy the TV series, and was looking forward to reading this novel. It didn't disappoint at all. As with the programme, the plot keeps the reader guessing, assuming they know the answer then something jumps out that makes you rethink. I enjoyed the writing and plot. I loved the interaction between the characters, especially the developing friendships as DI P"}, {"Review": "A perfect book if, like me, you're a big fan of the TV series, Death in Paradise. This is a story from the original series, and it's great fun meeting all our favourite characters again. Plus the crimes are as devious as ever. The only niggle I had with it is that Richard Poole certainly wouldn't do anything illegal - as he has to do here to make the plot work. However, that aside, I enjoyed it and I loved the ending. Looking forward to the next one already!"}, {"Review": "Andy's reviewDownloaded this as I have the other three Death In Paradise novels, read them & enjoyed them all, & I think that this is the best one yet, although (for once!) I actually guessed who the killer was. I just hope there's more in the series to come."}, {"Review": "After loving the tv series and the first three books I knew I had to read the fourth one. This book kept me guessing and I enjoyed every part of it. "}, {"Review": "Fun as ever. Lovely characters. Love the autism puns."}, {"Review": "His books get better each time -tense, complex and written with flair."}, {"Review": "哎还行还行2333，男主角天天热带海岛穿西装代表身份社交无能死心眼但是不坏，很难得了"}], "ID": "37531551", "Name": "Murder in the Caribbean"}