{"Genre": "Crime", "Reviews": [{"Review": "Feb 3rd 2014 - Extra things you should know: 1) This is a negative review. If you are looking for reviews that confirm what you are already certain of (that JKR can do no wrong) here are some examples of positive reviews for you - 1, 2, 3. 2) I used some Mary Poppins gifs to make my point in this review. It seemed funny at the time. If you find MP gifs stupid/annoying/beneath you, then please feel free to go to the reviews I linked before. 3) I will no longer reply to comments saying I am stupid"}, {"Review": "Dull & tedious. I was frustrated with the style of writing. There’s no action. It’s all conversation. I wanted it to be over.COURTROOM STYLE CONVERSATIONS - TELLING NOT SHOWING:Private eye Strike is investigating a death. Throughout the book Strike has long conversations with many different characters. It felt like a courtroom, asking witnesses 30 or more questions one right after the other. Many of these were discussions about what “might have happened. For example “I don’t think he would h"}, {"Review": "(B+) 79% | GoodNotes: A prototype yet to find its footing; its complex, interview-heavy plot poker-faces all clues until a bursting end reveal."}, {"Review": "UPDATE 2: This is my final review of the book. Most of what I included in my preemptive thoughts is here, so you don't have to read this whole... thing. Potential television series title #21: LONDON STRIKE Alright, let’s address the hippogriff in the room: finding out that J.K. Rowling published a book under a pseudonym is something that I had I expected might happen post-Potter (and, embarrassingly, searched for), but when the question was brought up as to whether or not she'd write under one,"}, {"Review": "رواية ستـأسـرك من مشهد البدايةبالنسبة لي فقد أعادت ذكري حادث مثلها احزنني جدا والكثير من محبي السينما المصرية..حادث مقتل السندريللاحيث تبدأ الاحداث في لندن بوفاة نجمة عروض ازياء\"موديل\" شهيرة إثر سقوطها من شرفة منزلها في الساعات الاولي من صباح شتاء لندن القارص بأحد الأحياء الراقيةيتزاحم المصورون علي جثتها لتصويرها لأخر مرة، كما تزاحموا عليها دوما بحياتها جارتها تؤكد إنها سمعت صوت احد ما يتشاجر معها ثم رأتها تسقط..-وتكافأ جارتها بصورة صغيرة لها علي استحياء مع صورة النجمة بكل الصحف والمجلات التي تت"}, {"Review": "This is a wonderfully entertaining new crime debut, which although it contains nothing amazingly original, works really well. Firstly, there is the main character, Cormoran Strike - a wounded war veteran, with a troubled past, damaged love life and financial woes, which see him sleeping in his office when we first meet him. Strike has left the army, which provided him with the structure and home life his mother never could, and set up as a Private Detective. The only problem is, a lack of paying"}, {"Review": "Meet Cormoran's First Strike..His first 'Mystery' which haunt me from the early beginning,even the epigraph. Why were you born when the snow was falling? You should have come to the cuckoo’s calling, It starts When snow was falling..and a 'Cuckoo' fell...A famous model star fall off the balcony to her tragic death..the paparazzi gather around her body just as they did when she was alive..Her neighbor assert that she heard her arguing and shouting with a man \"The Killer\" right before seeing her f"}, {"Review": "A first-time author who goes by the unassuming name of Robert Galbraith comes out with a mystery novel called  The Cuckoo’s Calling . The book receives favourable reviews and is wholeheartedly accepted by the fraction of the populace that reads it.And then (and this I borrow from reliable old Wikipedia), the Sunday Times scratches it’s stubbly chin and wonders how a first-time author with a background in the army and the civilian security industry, could write such an assured debut novel. So, af"}, {"Review": " “He had never been able to understand the assumption of intimacy fans felt with those they had never met.” I'll venture a guess that J.K.Rowling is not a stranger to this feeling. Propelled to household-name fame for her lovely gift of imagination, she gets to experience the uglier side of fans' adoration - the side that comes with suffocating hard-to-meet expectations and stifling atmosphere of demanding hype. Is it any wonder she'd look for a respite in releasing a book under a pseudonym?And"}, {"Review": "SOLID.It was a bit too long for my taste (I feel like it could have had a little less dialogue and such), but I really liked the characters! Strike and Robin all day."}, {"Review": "I like detective novels and I am a fan of J.K. Rowling, so when I found out that this \"Robert Galbraith\" was a pseudonym of Rowling, I thought that it was the perfect combination of elements that I have to read the book as soon as possible.I have to admit that in good amount of the book I wasn't enjoying it so much. I was feeling it too slow, and nothing exciting was happening, since Cormoran Strike, the detective, wasn't doing much just asking questions to each witness and the events was gettin"}, {"Review": "I'm a bit puzzled by the rave reviews. It's okay, but a fairly run-of-the-mill detective story. A private eye with a silly name solves a murder mystery, and there is a long exposition at the end of the how and why. The characters are quite well drawn, and the writing is competent, but I wouldn't seek out any further books with the same star.I didn't know, when I reviewed this, that it was written by J K Rowling! But it doesn't change my view."}, {"Review": "Did J.K Rowling out herself that she was the author of this book using a pen name or did someone else do it? I'm pretty sure she would have told the world if she WANTED people to know she wrote this, obviously she wanted the old feeling of people not knowing who the author is and now I feel bad for her. I'll read this eventually but I'm not shitting my undies looking for a copy.UPDATE:yup, she didn't want her secret out yet:\"I had hoped to keep this secret a little longer,\" JKR said, \"because be"}, {"Review": "Enjoyable read! good detective work,action pact,little mysterious and some interesting storyline..the only negative about this book-the plot was slow to get into but picked up eventually..nice ending which only leads to this story continuing..can't wait to see what happen in book#2 (paperback!)"}, {"Review": "A hard-boiled mystery about the suspicious suicide of a supermodel and a curmudgeon as the detective, who delves into the underground world of the rich and famous, daring to ask questions no one else will.This was the first book I've ever...wait for it... read by J.K. Rowling writing under a pseudonym as Robert Galbraith. Is this your reaction?Or perhaps, you look a little like this?I know, I know.. where have I been? How could I have never read the Harry Potter series? To be honest, the hell if"}, {"Review": "3.5ish stars.Far from perfect, but far from awful. Despite its many faults it's never less than highly readable and fluid. It's never particularly pulse-pounding but it somehow always held my attention.It honestly isn't twisty or suspenseful enough for me. It's super streamlined and reads more or less like a series of neat, orderly interviews with each of the various players in the mystery. Even at the 11 o'clock reveal, there's never a sense of danger or serious tension, it's just the natural p"}, {"Review": "The Cuckoo's Calling (Cormoran Strike #1), J.K. Rowling, Robert GalbraithThe Cuckoo's Calling is a 2013 crime fiction novel by J. K. Rowling, published under the pseudonym Robert Galbraith. It is the first novel in the Cormoran Strike series of detective novels and was followed by The Silkworm in 2014 and Career of Evil in 2015.تاریخ نخستین خوانش: دهم ژوئیه سال 2015 میلادیعنوان: آوای فاخته کتاب اول؛ جی.کی رولینگ؛ مترجم: ویدا اسلامیه؛ تهران، کتابسرای تندیس؛ 1393؛ در 656 ص؛ چاپ چهارم زمستان 1394؛"}, {"Review": "“How could the death of someone you had never met affect you so?”I remember being utterly and absolutely excited when I heard about a new J. K. Rowling. London, a detective and a dead topmodel. Yup, I was head over heels. So naturally I ordered it rightaway and started reading as soon as it arrived.I wasn't let down. While I remained a little skeptical about A Casual Vacancy (which in my eyes is unfairly rated - it's a great novel), I fell in love with The Cuckoo's Calling at first sight. The pl"}, {"Review": "I’m about to reveal my secret!!!!!!!! I have purchased lots and lots of Harry Potter’s books – you know the time that every small and big kid wanted one….well, I gave them out as birthday and Christmas presents….but me…. I haven’t read any of them….though my son devoured each book and I have the entire series in my bookcase…I just haven’t had that “read me, read me” pull….Yes, truly!!!. I started book #1 and gave up after a couple of chapters. I know….I should have persevered but I did not…….may"}, {"Review": " 16 Jul' 2013   Full confession:  Pfft yeah, I totally did grab this after I heard it was written by JK Rowling? Mostly because I hadn't even heard of this book prior to the news. But the blurb itself makes it sound like my type of novel on a cold, rainy day, regardless of the author.Look, I'd like to pretend as if I were one of those people who wouldn't give a limp banana that Rowling wrote this book. I'd love to have the same level of self-restraint to cringe my nose in disgust and walk away f"}, {"Review": "  Check out Scott Reads It! for reviews, giveaways, & more!  When it was revealed that J.K. Rowling had written a novel under the pseudonym, Robert Galbraith; I knew I had to read it. Rowling filled my childhood with magic, intrigue, and beauty with her Harry Potter series so I was eager to read her sophomore adult novel. It angers me how Rowling was betrayed by a friend who had revealed that she was the genius behind The Cuckoo's Calling. Every cloud does have it's silver lining and now, mi"}, {"Review": "nah"}, {"Review": "Oh, wow. I’m speechless. I am speechless at how bad this was. The only thing that kept me from quitting altogether was the characters. The only two, to be precise. I was more interested in Strike and Robin’s personal lives than that sorry excuse for a mystery plot. The entire mystery/thriller (?) element of the book and the investigation process were so painfully and mind numbingly boring that not only did I forget every single character the moment they were no longer in the scene, I also seriou"}, {"Review": "I admit that I am not a great fan of contemporary detective fiction. I find most books are too grim, even perverted with gratuitous violence, or unnecessarily long-winded with too much forced, fake-philosophical contemplation from detectives instead of actual action.So I am happy to say that I enjoyed JKR's debut detective novel a lot. The minus 1 star is for the writing, which had a superfluity of totally awkward metaphors & \"artistic\" descriptions & over-complicated sentences. This gra"}, {"Review": "Sale Alert: 09Jun18 Kindle Daily Deal $2.99After reading The Casual Vacancy I had decided that I probably wouldn’t read any of her adult fiction books. I didn’t expect it to be like Harry Potter but I really wasn’t expecting it to be more of a character study and it was really bleak. I was depressed after reading it. I mention this because I didn’t have very high hopes going into The Cuckoo’s Calling and therefore I am pleasantly surprised.This is a pretty straight up who-dun-it. There isn’t a l"}, {"Review": "SO GOOD. I literally had NO IDEA who the killer was until the very end. Jo is such a clever woman!"}, {"Review": "Two words for this: simply stunning.Cormoran Strike is my new hero. What an absolutely fantastic character Robert Galbraith has created. I just love everything about him, his size, his lovely caring attitude and his fearless quest to uncover the truth of the apparent suicide of Lula Landry, supermodel. Coromoran is hired by Lula's adoptive brother, John Bristow, to investigate her death as he doesn't believe she committed suicide, albeit the Police do and have ruled it so. There is also the very"}, {"Review": "For me, this book didn't stand out especially in this genre. The plot wasn't very interesting and I only really found it exciting towards the last hundred pages. The best bit for me was the characters as I loved how well they were developed and how they interacted with others, especially Cormoran Strike.The story follows Cormoran Strike, a private investigator and ex military man who has been left with a severe injury as a reminder and has to cope mentally and physically with his injury. John Br"}, {"Review": "For me 5 stars, I stumbled on this by accident and glad I did..Strike ia a Cornish ex-military policemen, based in London, at a very low point in his life, Strike is sinking fast. I loved his clever, sharp stubborn character, especially the prickly ebb and flow relationship with his quick witted sidekick secretary Robin.The other plus for me was the twisty, story line, I did not guess who did it at all! was rather shocked in the end but in a good way, having just read 2 out of 3 of the Larson Mi"}, {"Review": "Fantastic writing, wonderful characters, and a very clever & compelling mystery! Video review to come in the next few days! :)"}], "ID": "16160797", "Name": "The Cuckoo's Calling"}