{"Name": "Dark Sacred Night", "Image": "https://images.gr-assets.com/books/1541848974l/38204691.jpg", "Reviews": [{"Review": "5 Spectacular Stars.Have you ever been scared to crack open a book? Nerves jangled? Stomach in knots? Desperate to find out what happens to your favorite character, yet frightened of what’s inside? Yep… that’s me. I had an ARC of “Dark Sacred Night” by Michael Connelly in my hands, a copy of which I was lucky enough to score and I was scared straight. Dying to open it and start reading, yet terrified. What if it doesn’t measure up? With each passing year, my anxiety has reached greater heights when it comes to a new Harry Bosch novel. Can Michael Connelly deliver? The answer to that question, is yes. Time and again, a resounding YES. Some authors, fail and just kind of follow a formula, if you know what I mean. Not Michael Connelly. Whatever it is, he has it. That said, well, I couldn’t help but worry. About Harry Bosch. If you all know anything about me, you know I LOVE MY HARRY BOSCH. He has my heart. And so it goes. This time around, Harry Bosch partners with Renee Ballard on a case near and dear to his heart. Daisy Clayton. Renee Ballard works the Late Show – we met her for the first time last year. She is tenacious, smart and she loves her job. The cops in Hollywood Division don’t care for her very much because she has made lots of trouble for them, standing up for what she believes in, herself. In that way, she’s a lot like Bosch. Harry still works as a reserve cop in San Fernando Valley, however, one cold case still eats away at him and it is that of Daisy Clayton, who was brutally murdered years ago. He knows evidence still exists at Hollywood Station, so he goes looking for it and Ballard catches him. Once she looks into it, she too, is intrigued and she can’t help but want to work it. Bosch and Ballard, Partners? Yep. It happens and it happens here. Can two people who are alike in some ways and different in others figure out a way to work together? Bosch is a grumpy old man (at least compared to Ballard) yet he’s a darn good cop – but then so is Ballard. Though she’s young, she’s got great instincts. I admit that I had my doubts about these two partnering up (but perhaps that’s because I want Bosch all to myself?! Lol!). From that moment on, once their investigations kicked off, my breath caught in my throat and my heart was in my sleeve. These two detectives think like no others. This case, it gets to both of them for different reasons and their investigation never stops and the risks don’t matter. Not to them. Where it leads, I cannot say. Their path is not an easy one. But I’m sure you knew that. Are you holding your breath? I bet you are. Is your chest tight tight tight? Once you start reading “Dark Sacred Night” I have a feeling it will be, just like mine was. The ride is wild and terrifying. I can’t wait for you to give it a spin. Bosch and Ballard are characters that stay with you. Renee Ballard tries her best to follow the rules, yet the cases she works, they own her. The only thing she needs are her surf board, her dog Lola and her Grams. As for Bosch, well, you know him: his daughter Maddie and solving cases are the only things he cares about in this life. He is tried and true and in case it isn’t obvious, he is still my favorite detective. As for these two together? Well, I think they are kindred spirits. I hope you'll agree.  Kudos to Michael Connelly for a continuing to write such incredible mystery / suspense novels year after year. Thank you also for staying true to one of my favorite characters: Harry Bosch. Thank you also to Little Brown and Company for an ARC of this novel. I was thrilled to receive a complimentary copy. All thoughts are my own. Published on 8.9.18 on Goodreads, Twitter and Instagram.**Will be published on Amazon on 10.30.18."}, {"Review": "**4.5 STARS**Night shift detective Renée Ballard is writing a report in the wee small hours of the morning concerning a woman found dead in the bathtub, when she notices a stranger going through the filing cabinets across the other side of the office. The man appears intent on finding something, and in his eagerness to discover whatever it is he’s looking for, he clearly hasn’t seen Renée watching him! After throwing him out, she discovers that it’s detective Harry Bosch who you used to work out of that very station. Bosch lies about what he was searching for but Renée is onto him and soon finds out what he was really up to, and she wants in on it, so the two of them join forces to investigate the murder some years previously of teenager Daisy Clayton.In a brilliantly understated introduction, Michael Connelly brings together two seriously good detectives. Ballard still has her own cases to work though, and these run alongside another cold case of Bosch’s - the assassination of a Latino gang leader over a decade ago. There’s no question that there’s a master storyteller at work here, the cases under examination exhibit just how intense and knowledgeable the police procedural aspect of Connelly’s books are - the pace is relentless, breathtakingly so at times, and the characters are so well defined that it’s not difficult to imagine that you know them personally. I would love to see this partnership continue into the next book and hope that Mr Connelly is thinking along the same lines! Highly recommended.* Thank you to Netgalley and Orion Publishing for my ARC. I have given an honest unbiased review in exchange *"}, {"Review": "Michael Connelly brings us the second in the LAPD detective Renee Ballard series and he brings in Harry Bosch, a man Renee knows nothing about. Renee has been shunted onto The Late Show, the Hollywood nightshift, after an injustice earlier, but oddly enough she has settled in there and somehow it suits her. Her partner is on bereavement leave and she is on her own when she is called to a home where a woman's body, heavily decomposing, is discovered. It is assumed to be murder but it does not take Renee long to ascertain that it was an accident, with a starved cat feeding on the corpse. On returning to write up her report, she finds Harry rifling through a file cabinet of a colleague, and throws him out. However, her curiosity is aroused, she cannot help herself as she tries to find out who Harry is and what he was doing there. Harry has the traumatised Elizabeth Clayton, a recovering drug addict, temporarily living with him, someone he met on his last case. Nine years ago, Elizabeth's 15 year old daughter, Daisy, was brutally murdered, her body bleached and discarded like trash in an alley. This spurs Harry to look into the cold case, as he witnesses Elizabeth's unrelieved grief destroying her. Having Elizabeth staying with him is not ideal, as his daughter, Maddie, is refusing to visit him while Elizabeth is there. Once Renee learns of Harry's investigations into finding Daisy's killer, she wants in. It soon becomes transparent that there is much the pair have in common, a dogged determination to work cases that borders on obsession and a penchant to bend the rules. In the meantime, both have other demands on their time. Harry as a reserve at SFD is looking into a cold case murder of the 52 year old gang member of the Varrio San Fer 13, Cristobel Vega, gaining insight into what happened after locating a witness, only to find the case exploding out of his control. Renee finds herself with the horrifying task of searching for the dismembered body parts of a murder victim at a refuse dump. As Renee and Harry plough through the mountains of information looking for a lead on Daisy's killer, the truth proves to be elusive. Will they succeed in finding the killer?I did not expect Renee and Harry to be working together so soon, but after an initial awkwardness the two, unsurprisingly, mesh well, something they will sorely need as each finds themselves in life threatening and dangerous scenarios. Harry's future with SFD is uncertain, but what is clear is that this is not going to stop him doing what he does best, and it looks like we will see him pairing up with Renee again in the future. Connelly once again displays his attention to detail in police procedures, showing us that his research is demonstrably impressive. I loved this addition to the Renee and Harry series, but there is a strong part of me that wished I could have seen far more of Renee prior to her working with Harry. As usual, Connelly gives us a superb crime thriller with his trademark aplomb. Highly recommended! Many thanks to Orion for an ARC."}, {"Review": "Sometimes when an author who has written many books in a series introduces a new character, I worry that the effect may be kind of like when sitcoms of the past introduced a new, young character (e.g., Cousin Oliver in \"The Brady Bunch\"), and it essentially ruins the series.When Michael Connelly introduced LAPD Detective Renée Ballard in last year's \nThe Late Show\n (see my review), my fears were proven unfounded, because Ballard was such a complex, flawed, fascinating character (much like Harry Bosch), which made her the perfect addition to the world he had created. Still, I wondered whether Connelly would switch off between protagonists, ease back on the Bosch novels, or do something altogether different.In his latest novel, \nDark Sacred Night\n, Connelly pairs Bosch and Ballard together, although he lets them deal with their own challenges as well. The results are as electrifying as you'd imagine they'd be, and Connelly once again proves that, 31 books in, he is one of the most dynamic crime writers out there.Ballard is working the night shift, otherwise known as the \"late show,\" still struggling to be an outspoken female detective in a department that doesn't prize those who make ripples, particularly women. One night she finds a stranger rifling through old files—it turns out that stranger is retired detective Harry Bosch, who is looking for information that might finally help him crack a cold case he's working on in his spare time.The more Ballard hears about the case, in which then-15-year-old Daisy Clayton, a runaway who wandered the streets of Hollywood, was found dead, her body bleached so as to not give up any clues, the more Ballard wants to see if she can help Bosch uncover the truth after so many years. The two share leads and theories, and chase many possibilities in search of Daisy's killer, although it seems unlikely after all this time that they'll be able to find closure.Meanwhile, each has their own cases to deal with, and when the going gets tough (and dangerous), these outsiders discover that they can count on each other when they needed it most. But can Ballard look the other way when Bosch bends the rules so hard they break a bit?This book was really a rollercoaster ride. Connelly took a little time to set things up, and then the plot takes off. There's a little bit of downtime, and then the momentum kicks into high gear. You wonder whether each case that Ballard or Bosch works on is somehow going to be the one that causes trouble, and you wonder whether they'll be able to solve Daisy's murder. But most importantly, you wonder how well these two forces will work together, given their independent streaks as well as their overall badass nature.While it was great to have Ballard and Bosch together, and I hope that happens again, reading \nDark Sacred Night\n reminded me just how terrific these characters are on their own, and once again demonstrated Connelly's talent for suspense, action, and character development. I lost track of the Bosch series a few years ago, but I definitely have to get back into it as I wait for Connelly's next book.There are tons of crime writers out there, but Connelly is the real deal, and one of the best currently writing. You can read \nDark Sacred Night\n even if you've never read any of his books—and I bet you'll be hooked!! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"Review": "I love the Harry Bosch series and enjoyed the first Renee Ballard novel. So, I was excited to see the two detectives join forces. And I was not disappointed. One thing I love about Connelly’s mysteries is that he doesn’t sugarcoat the workload of a Detective. No one has the luxury of working a single case, especially a cold one. Both Renee and Harry have their hands full. There’s lots of action here. This is one of those books that called to me and kept me reading well passed when I should have put the book down. Both characters are well defined and fleshed out. Whether you’ve read every book in the series or are just starting out, you’ll feel like you know these two. The partnership grows slowly, with both learning to trust the other. But by the end, they’re a good team. I look forward to seeing more books with them together, although I also hope Connelly will continue to write stories for each individually. I was given a copy of this book through a GoodReads giveaway in exchange for an honest review. "}, {"Review": "Many, many years ago I was drawn into a series featuring a young detective named Harry Bosch. I subsequently went on to read him again and again. Enticing cases he fdefinitel worked, but it was the detective, his life, both rather dark and gloomy, that kept me coming back again and again. There was just something g that drew me to this flawed but very noble character. Eventually as he aged, he found himself forced into retirement by the very department he had so long served. Yet, he could not let go in his fight for justice for all, even those who lived on the margins of society. He now works in an unofficial capacity in a cash strapped to!ice department. It is while working on a cold case, that of s murdered young girl from years past that will bring him together with Renee Ballard, a young police detective.She is half Harry's age, but she too has a complicated past. After she reports a colleague, above her in rank, she is transferred to another department, where she works the late show, or the night shift. I loved how she and Harry complimented each other, both pursueing justice, both willing to take short cuts to solve a case. Connelly has the talent to give the reader some very interesting characters, characters that we can understand, relateable. In this pairing he has, despite the age gap, given us a new team, and it will be be interesting to see how they will evolve, work together. Since both can be willfull, stubborn, I expect some fireworks down the line. Hoping for good things to come."}, {"Review": "Most of the books I pick up are fiction. I have one of those jobs that introduces me to life’s less glamorous realities on a daily basis so I read for escape. But as with non-fiction, I learn something from every story. Of all the lessons I will take away from this book, the most important may be this. Feed your cat. Faithfully, continuously & in large quantities. In fact, just cut a hole in the bottom of a 50 kg bag & leave it out on the kitchen floor, ok? You might thank me later.Renée Ballard knows what I’m talking about. So after dealing with a particularly eewww-inducing crime scene one night, she looks forward to some solo down time back at the station. Except she’s not alone. There appears to be a strange man trying to break into the file cabinets. Ballard, meet Bosch. Harry Bosch.You could say it’s the start of a beautiful friendship but that would gloss over a few bumps in the road. Harry is working on his hobby case. In a previous instalment, he met a woman grieving the death of her teenage daughter. It’s been 9 yr. since Daisy Clayton was violently murdered & Harry has decided it’s gone unsolved long enough. Ballard has her own issues. She used to be part of an elite crime squad. Her fall from grace began after a superior officer got a little handsy & she dared to report him. Of course the department stepped up & dealt with it. Sort of. He kept his job & she found herself back on the street working the late show. Renée now works alone & it’s not bad. Some nights are quiet & she begins to look into Harry’s pet project. Before she knows it, they’ve formed a partnership of sorts. They’re an interesting pair & part of the fun is watching Renée try to rein Harry in as he sidesteps the rules in trademark fashion. It’s a slow, painstaking process, frequently interrupted by the demands of more pressing cases. To be honest, it took me a bit to get into the story. But I found Renée much more fleshed out here than she was in the previous book. As she & Harry settled into their relationship, I found it easy to sit back & enjoy the ride. I really enjoyed the story lines that emerged from current investigations. It maintained the pace & provided plenty of tension that balanced out the slower grind of the cold case, making its progress more realistic.By the end, it’s clear Harry’s days as a reserve officer with the San Fernando P.D. may be numbered. But it might be the start of a new chapter for the old cop which is great news for Bosch fans. So if he & Renée find another cold case to tackle, I’m in. As long as he doesn’t get a cat."}, {"Review": "Always finding ways to be unique with his writing, Michael Connelly offers up something different for his fans in this latest novel, which mixes two of his most talked-about protagonists. Two detectives from two jurisdictions, sharing their life stories and bound together by a single cold case that has them fully committed. While working the ‘late show’, LAPD Detective Renée Ballard comes across former LAPD legend Harry Bosch flipping through old files. Ballard soon learns that Bosch is working a cold case while things are slow down at San Fernando PD. After some digging of her own, Ballard approaches Bosch to see if he needs any help, particularly obtaining information within the LAPD. Thus begins a loose partnership between the two as they look into the murder of a teenage prostitute from almost a decade before. Bosch is doing this as a favour to someone he knows, but remains somewhat circumspect on why he’s being so nice. While Bosch and Ballard work their respective cases on different shifts, the Daisy Clayton investigation continues to heat up. With information tying her abduction and eventual murder to a non-descript van, Bosch and Ballard try to narrow down the list of suspects, while staying on top of the drama that shapes their own lives. The more they work together, the better they get to know one another, so different and yet so in sync. Could this be the ultimate pairing that no one saw coming? And does the murderer, hiding in the shadows, stand a chance with these two detectives on their heels? Connelly mixes some strong Bosch work with the still evolving Detective Ballard to create a great story that allows fans to get their fill of both characters. Recommended to fans of both series who always wondered, ‘what if...?’I quite enjoy Michael Connelly’s work, spanning an interesting career. I am also a fan of authors who blend their series protagonists together, just to see how the chemistry will play out. Connelly has done it before, but this new connection could be an even more interesting fit, given the newness of Renée Ballard on the scene. Those who enjoyed Ballard’s introduction as a protagonist are able to extract a little more about the woman and her policing style, as well as the grit that emerges when she works alongside LAPD legend, Harry Bosch. As with his involvement in the series that bears his name, Bosch has grown and changed, but always seems to have new and exciting angles yet to be revealed. His backstory and development seem set in neutral, but there are always crumbs on which the series fan can feast, even as Bosch teeters on the brink of giving it all up. However, many would ask what happens to Bosch when he can no longer shape policing and help those in need. Connelly pokes at this bear in this piece, leaving the reader to wonder if Bosch’s days are finally numbered. The story was a brilliant mix of a handful of cases, seen through the eyes of both protagonists. Mixing the narrative angles, the reader is able to see both Bosch and Ballard working through things from their perspectives, as well as a joint effort to find this killer who has slipped through the cracks for nine years. The story moves along at a wonderful pace, offering struggles for both detectives while also seeing them grow closer together. This connection is one that cannot be ignored and should not be shunned, as there is much to be seen when it comes to it. A mentor-mentee situation could be budding and who better than Harry Bosch to have as a guide?Kudos, Mr. Connelly, for a wonderful series that seems only to get better. Bring on more, when time permits. Your fan base grows with each new publication!Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"Review": "I really enjoyed the first Ballard book, The Late Show, in which the young female cop showed some of the vim and vigor we’d seen from Harry Bosch back when he too was an LAPD detective. Banished to the night shift after calling out her boss for sexual harassment, Ballard consequently nursed a chip on her shoulder as she remorselessly chased down her quarry. I thought it was a great book and seemed to promise a even money chance that at some point in the future she’d share some page space with Bosch. Harry Bosch was last spotted in Two Kinds of Truth where he teamed up with his half brother, lawyer Mickey Haller. He continued to tread a precarious line between playing it straight and bending the rules, working now as a detective for the San Fernando PD. It's well known that Connelly likes to link up his various players in his books and here he does it again in bringing Ballard and Bosch together. Surely this is a marriage that can't possibly fail, can it? It's a simple question and a there’s equally simple answer: no it can't!I won't spoil the fun for future readers by giving too much away, suffice to say there are a number of cases covered here: some investigated individually by the two cops and one taken on as a joint venture. The various elements of the cases paint a broad picture of the darker side of modern day Los Angeles and some of the lessons learned prove to be of wider value along the way. Bosch is on top form, showing his determined one-track mind approach to solving his cases with his forthright (OK, let's just call it what it is – rude) approach to all, constantly shaking the tree loose of just enough debris to give himself a chance of closure. Ballard shows that she can also bend a rule or two as she adopts a similarly dogged plan of attack.The chemistry between the two feels just right: some mutual respect but mixed in with a little nervousness, a smidgen of suspicion too. They're both feeling their way in this new professional relationship. We're in the hands of the master as Connelly seamlessly allows the action to flow whilst keeping a captain’s eye on the tiller. At no point does he allow the reader to lose track of the multiple plot lines or feel any tinge of disbelief that things should play out in such a way; it’s brilliantly done.At the end there’s a nice teaser suggesting that there's more to come from this pair. Thank goodness for that! I'm already in withdrawal - having finished this latest offering I seriously hope I don't have to wait too for the next instalment.My sincere thanks to Orion Publishing Group and NetGalley for providing a copy of this book in exchange for an honest review."}, {"Review": "Detective Renee Ballard was working on her report for the night’s killing back at Hollywood Station when she heard someone at the files on the other side of the office. That was Ballard’s first meeting with retired LAPD Detective Harry Bosch. Bosch was working a nine year old cold case – the murder of a young fifteen year old which he was determined to solve. The nine year gap made it much harder. When Ballard learned of the case, she was keen to help Bosch – and so it came about that the late show detective worked, in her spare time, with the retired detective…Ballard, along with her dog Lola, would spend as much “off time” as she could at the beach. Surfing was her peaceful time; Lola soothed her. While Bosch had his daughter Maddie who was a uni student away from home. But when danger in the form of the gangs that worked Hollywood, ventured too close, the risks were high for both Bosch and Ballard. Would the seasoned and the young solve the cold case? And would they stay in front of the ruthless and brutal gangs?Dark Sacred Night is the second in the Detective Renee Ballard series by Michael Connelly and it was just as tension-filled as the first. I loved that Ballard met up with Bosch – the combination of the two brilliant characters made it great reading. Meeting up with Bosch again (one of my favourite fiction characters) and Ballard for the second time – it was perfect! Told in Ballard and Bosch sections so we could appreciate the “behind the scenes” with both characters made it a quick, easy read which I thoroughly enjoyed. Highly recommended.With thanks to Allen & Unwin AU for my uncorrected ARC to read in exchange for an honest review."}, {"Review": "A request for a simple wellness check starts the ball rolling.  The woman on whom Detective Renee Ballard is calling is long past answering her doorbell.  The revolting stench greeting Ballard as she enters the home proves it.  Meanwhile, our old friend Harry Bosch is investigating a cold case.  He's semi-retired now, but his no bullshit attitude and tenaciousness are intact.  He's getting older, has a trick knee, and makes the occasional error in judgment.  It is inevitable that Bosch and Ballard will cross paths, and it makes for a terrific pairing.   The ways and means, and the ins and outs of police procedures are fascinating, as always.  Who is willing to bend the rules, and who is apt to break them into pieces.  The age old question begs whether or not the ends justify the means."}, {"Review": "This book is a combo Harry Bosch-Renée Ballard story. In my opinion, Bosch is a given; there’s no doubt he can easily carry the plot. Ballard, though, is almost an unknown in spite of reading the first book, The Late Show, where she is introduced. With that book, I had reservations about her being a stereotyped female Bosch. This book proves that may be the case, but it absolutely works and I’m thrilled! Bosch has always done things his way and mostly gets the job done. Ballard is very similar; she worked Robbery-Homicide and was forced out and onto the late show because she reported a sexual assault by a superior. They both bend rules and break them at times, too. So while the two are similar, I think Ballard has a tougher path than Bosch simply because she’s a female.The plot could be called “A Day in the Life of an LA Cop.” Multiple cases are investigated requiring a lot of research and generating a lot of paperwork. Cops have occasional days with no new cases, and on other days put their lives in danger. They don’t eat well nor do they get much sleep. They rely on each other, and sometimes they fail each other.Michael Connelly is a superb author and a consummate storyteller. His latest newsletter states his next book will be a Bosch-Ballard-Haller book, and that sounds great to me."}, {"Review": "If you're into stuff like this, you can read the full review.Rump and Rexit: \"Dark Sacred Night\" by Michael ConnellyConnelly even tries to paper over it later, having one of his character vaguely muse about how stupid it was. This is just lazy writing. “Literary” novels can get away with a lot if the language is impressive enough. Crime novels are hard. If I was a crime fiction writer I'd want the fact that I could write Literary Crime Fiction hushed up. I wouldn’t want anyone to know I could turn into another John Banville…"}, {"Review": "\"\nI think this is the beginning of a beautiful friendship\n\". If you have seen the movie Casablanca, then you know this classic line. And, it's such a perfect way to describe the paring of Renée Ballard and Harry Bosch.DARK SACRED NIGHT is the second Ballard book and the 29th Bosch. And, I was thrilled to get a copy of the book. Bosch was mentioned in The Late Show, the first Ballard book, but I never thought that we would get a crossover so early. I thought perhaps a cameo or something in the two series, or just mentions. However, to my surprise, a dream come true!Ballard first encounter with Bosch is hardly a friendly one. He's looking through files he has no right to go through and Ballard almost read him his rights, but then she gets curious. Well, after he's gone and she notices what he was looking for. She can't help herself, and soon she teams up with Bosch to work a cold case. And, as they work together, the more of a team they become.DARK SACRED NIGHT is a great book. I'm a big fan of cold cases and I love the teaming of Ballard of Bosch. The older cop and the younger one that both can learn from each other, not to mention saving each other's lives. The ending gave hope that there will be more crossovers and I can't wait to find out what B&B will do next!I want to thank Orion for providing me with a free copy through NetGalley for an honest review!"}, {"Review": "Michael Connelly is an great crime thriller writer with the excellent character Harry Bosch, but he doesn't stop there. He has created other enjoyable lead characters like Mickey Haller (The Lincoln Lawyer) and now Renee Ballard who comes into her own in this 2nd book where she teams up with  retired detective Harry Bosch.Detective Renee Ballard works the late shift and teams up with Bosch who is investigating the death of fifteen-year-old Daisy Clayton, a drug addicted runaway who was brutally murdered 9 years ago. The pair share similar attitudes and are both prepared to bend the rules to get justice where necessary and make enjoyable reading. The character of Renee is further developed throughout the novel following on from 'The Late Show' where she was introduced by the skilful Connelly who looks to have another winner with this one. His books are so well thought out and show an inner knowledge of police procedural's and an eye for detail, supplying the reader with realistic entertaining books that rarely fail. I finished the book wanting to read another one straight away. I would like to thank Net Galley and Orion Publishing for supplying a copy of this novel in exchange for an honest review."}, {"Review": "More Bosch than Ballard, Dark Sacred Night teams up Michael Connelly's longtime protagonist with his latest to create a well balanced and entertaining police procedural bathed in the darkness of LA's nighttime underworld.Bosch has a case which haunts him; the murder of an underage prostitute he's never been able to solve. The case eats away at him. Every day he's reminded of his failure, in part due to the dead prostitutes mother who shares his personal residence - their relationship purely platonic.Ballard, perennial member of the 'late show' aka the night shift in LA's police department, catches cases only to throw them to other detectives when the sun comes up. There's a decent smattering of small time cases for her wade through in Dark Sacred Night but it's when her world and Bosch's collide, do things get really interesting. I enjoyed Dark Sacred Night. Personally, I was hoping for some more Ballard-based books; the character does well to hold her own without the need for a heavy hitter to push the book into 'best-selling territory' but Connolly makes the duo work; their chemistry is natural and the multi-POV methodology fits seamless into the narrative (this made more apparent with the changing narrators in the audio version).My rating: 4/5 stars. Dark Sacred Night has a decent plot at its core complimented by enjoyable supplementary cases the two protagonists find themselves entangled. Bonus points for reading perfectly well as a standalone in its own right. "}, {"Review": "Renee Ballard is working her usual late night shift when she finds a man going through files at the station. It turns out this stranger is Harry Bosch, a retired detective, who is working on a cold case that has turned personal. Ballard sends him on his way, but begins looking into the files Bosch was flipping through. Once she does, she becomes interested in the case too: fifteen-year-old Daisy, a runaway who was horrifically murdered, her body left on the streets. Ballard begins investigating the case as well, forming an alliance with Bosch and attempting to find out what happened to Daisy nearly a decade ago. I was a little leery when I learned that Connelly was going to combine Renee's story with my beloved Harry Bosch's (let's just say I love Bosch too much to share him), but this book was really excellent, and I found myself enjoying the two of them together. The narrative switches between Ballard and Bosch, so we still get to hear from each character separately: it's just their stories and lives that start to overlap. This overlap happened pretty naturally, and honestly, their burgeoning partnership/friendship was fun to see. There's a moment in the book when someone asks the pair how they want some files, and Ballard responds \"digital\" and Bosch, \"print,\" and we get a sense of the fact that--no matter how clever and similar they are--Bosch is truly our old school guy and Ballard is the new blood. So combining forces might not be so bad after all. I love Harry Bosch. I've loved him for about seven years now, since I discovered this series, and I will always adore him, and I don't like that he's aging, and yeah. I'm attached. Reading his sections was like being back with an old friend. Connelly has Bosch's character and voice so perfected by now. I don't want to reveal too much, but this book ties back to the previous a bit (though it will work on its own), so we see Bosch struggling with some of the choices he made in the last book and figuring out exactly where he stands in his career. I won't lie: it's hard to see him age and even to be fallible. I really tried to read this one slowly and savor it, as Connelly books (especially with Bosch) just don't come along every day. I love how Connelly seems to know so much (e.g., police procedures, gang wars and rituals, even about surfing), but it never feels like he's over explaining anything. Even better, you always get such a good story. I enjoy how he ties so many of his disparate plot pieces together, or comes back to something you think is totally unrelated. And there's always some sort of recent pop culture worked in (a bit of the #MeToo movement pops up here). There's a lot going on this book--after all, we get cases from both Bosch and Ballard, plus their shared pursuit of justice for Daisy, but it all works in Connelly's deft hands. He is the master of interlocking stories. Overall, I really enjoyed this one. I was fascinated to see Bosch and Ballard interact, and I was so glad to have another episode featuring my beloved Bosch. If you're a Bosch fan, I think you'll like this one. And if you just enjoy a good, well-plotted mystery, I highly recommend this one as well. 4.5 stars. Blog ~ Twitter ~ Facebook ~ Google+ ~ Instagram "}, {"Review": "The Late Show introduced Renée Ballard and in Dark Sacred Night Ballard we meet Bosch. This is really the book that establishes the premise for the rest of the series. I think I am going to enjoy this partnership. Both Ballard and Bosch are lone characters, both are very experienced and very good detectives, very dedicated and willing to bend the rules. I have always been ambivalent about whether to start the Bosch series and I thought this new series would be a good way to dip my toe in the Bosch waters. I very much enjoyed this book but still don’t have the urge to ‘go back to the beginning’ as it were. It did however make me feel slightly paranoid that I might be missing references from previous books, which spoiled my enjoyment just a little. (I am one of those people who needs to start a series at the beginning and work through in strict order!) well, because I enjoyed both of the first two books in the series, I am planning to get to know Bosch at the same pace as Reneee Ballard.Thanks to Netgalley for an arc of this book."}, {"Review": "All the stars and more for my favourite detective Harry Bosch and Renee Ballard teaming up in Dark Sacred Night. Michael Connelly was one of the first \"grown up \" authors that my Dad got me hooked on when I was a teenager and all these years later he is still going strong. I was so very excited to be approved for an early copy of this book and writing a review for it terrifies me! I hope that I can do this book and the author justice. When you have a character like Harry Bosch who bends the rules, is stubborn and does things his way how do you team him up? With a female detective working the late show in Hollywood who livestream out of a van at the beach, does things her way and never gives up. Renee Ballard was introduced to readers in The Late Show and to have her working with a fan favourite in Harry Bosch was just brilliant. The banter between these 2 characters who have a very similar work ethic was fun. Michael Connelly is so good at the detail... I love jos he describes LA and Hollywood and makes you feel like you are there with them. At first Renee is wary of Harry, when she catches him trying to get into an old filing cabinet in the Hollywood Precinct. The pair start to get to know each other and between call out some on the late show she starts to work on her hobby case with Harry - a case that has gotten under his skin and he is determined to solve. The case is a 9 year old cold case of the murder of 15 year old Daisy Clayton. Working together the over long hidden secrets while they continue their everyday work. In short... I loved this book and feel honoured to be able to share my views on it. I can't wait til the audio releases at the end of October so that I can listen it all over again read by Titus Welliver. Highly recommend this book and anything else that Michael Connelly has written.A very big thank you to Orion Publishing and NetGalley for my advanced copy of this book to. All opinions are my own and are in no way biased "}, {"Review": "9/10*slow claps*Surprise surprise, another quality book by Michael Connelly. Doesn’t he get bored of knocking them out of the park every time? This one is up there with some of his best work and to say it’s the 21st book in the Bosch series, that’s no mean feat. This outing has a combination of the perennially awesome Bosch and the newcomer Ballard from his previous book, The Late Show (unsurprisingly, really good). I’ve been a bit on the fence with these combo novels before due to the forced nature of the narrative changes between characters. This didn’t happen here and things flowed smoother than silk between the two leads, both looking into their own missions and a joint effort combining their skills. I liked how both were wary about the other, neither have histories of working well with authority so naturally cautious, but once they have worn some rubber together they develop a firm bond. I liked all the plot lines here and I didn’t see how things were going to weave together and finish up which is always a bonus. The characters are great, Bosch is a firm favourite of mine and Ballard is like a female version of him so what’s not to like? The massive downside of finishing this novel, having to wait for the next one!Thanks to NetGalley for a copy for review, this was it!"}, {"Review": "Bosch and Ballard together solving crimes in downtown LA, sounds a recipe for success, unfortunately my original enthusiasm was not realized. Ballard is the new kid on the block, first introduced last year in the excellent \"The Late Show\". She has a lot to prove, riding the night shift, surfing in the morning accompanied by her faithful dog Lola. It's tough working as a female detective always open to criticism and ridicule and constantly under the watchful eye of her male colleagues just waiting for disaster to strike.Bosch of course is the grizzled vet, working out of the San Fernando police dept on \"cold cases\" that still remain unsolved after a number of years. Daisy Clayton was murdered nine years ago, her body found naked and bleached clean to hide all trace of DNA. Ballard discovers Bosch working on this unsolved murder and she decides to help him in her downtime. So up to a point this story is full of potential and hope. However this is not the only case the detectives are involved in and that's where the narrative comes undone. When I read a detective story I want the author to concentrate and build the storyline one theme or murder (or numerous murders as in the case of a serial killer) This gives the reader time to become acquainted with the various issues raised and characters introduced. By running a number of sub plots/storylines the main theme, which in this case is the killing of Daisy Clayton, becomes diluted and loses its impact and effectiveness. Harry at the same time is involved in a crime case with gangland connections that goes terribly wrong. Ballard has her own heavy work load including a potential rape case that becomes something different entirely.Having said that a Michael Connelly novel always contains some great moments with Harry Bosch at the centre. He is a maverick investigator refusing to admit that he could ever be a target, but on this occasion he is wrong. In addition he is harbouring an unexpected house guest and the fallout from this has a tragic outcome. So \"Dark Sacred Night\" is not a bad novel it is simply that I expect such high standards from the author. The partnership of Ballard and Bosch works to an extent but the Daisy Clayton killing seems to lose its impact as it becomes lost amongst the ever increasing workload that forms the agenda of our two hard working detectives. The conclusion of the story indicates the possibility of future adventures/assignments and I hope that will not happen. Bosch is a loner, a detective who shirks instructions, and this is the very quality that makes him so attractive to his many adoring readers. Yes lets develop the career of Renee Ballard.....but not on Harry's watch!"}, {"Review": "So this was the match-up that I never knew I needed. I am now wishing that Connelly had decided to match-up Harry with a strong female non-romantic lead before. I am not counting the books with him and Rachel Walling (see the Narrows, Echo Park, The Black Box, and The Burning Room). Fingers crossed that Connelly resists the urge to put them together. It is mentioned many times that Bosch is as old as her father (Renee) but Connelly also heavily implies that Renee has issues over the death of her father. That said, the only reason why I gave this four stars, is that I had a hard time with the ending.\"Dark Sacred Night\" takes place a year after the events in \"Two Kinds of Truth\" and a couple of months after the events in \"The Last Show.\" Just a quick recap, Harry is now working as a volunteer closing cold cases for the San Fernando Police Department. He has somewhat burnt all of his bridges with the LAPD due to some of his own actions and lawsuit against them which he won. Renee is still on The Late Show, however, she seems more content with her place in that group now. Renee is working late when Harry Bosch \"invites\" himself to go digging through a detective's drawer looking for some index cards on a cold case. Renee is initially mistrustful of Harry (not blaming her) but then becomes intrigued when she finds out he is looking for the murder of a young woman who is related to a friend of his. Harry is also dealing with a cold case in Sen Fernando that is taking up some of his time as well. We also get to see Renee working some routine and not routine calls while working solo on the Late Show. Harry seems more mellow in this one. I think he's a bit burnout because the woman he meets in the last book (Elizabeth) is now living with him. I maybe went \"Error, Error\" when Connelly reveals that. Though Harry and Elizabeth are not romantic partners (yet) she is cooking and keeping house for him while he is out chasing down leads on her daughter's cold case. I definitely believe in redemption, but I am still shaking my head at Harry taking on so much with Elizabeth because she resembles his ex-wife Eleanor. And of course he and Maddie are partially estranged over this nonsense. If Bosch realized that Elizabeth looked like his dead wife, I am sure Maddie realizes she resembles her dead mother. Harry seems separate from prior characters in this one except for Lucia Soto, his old partner and his partner so to speak at San Fernando, Bella Lourdes. We have no mention of him reaching out to his brother, Mickey Haller (I am guessing Bosch is still ticked about what went down in \"Two Kinds of Truth\") or to anyone else. He does call J. Edgar for some information and then just hangs up on him (still being treated like crap by Harry). I did laugh when Harry had the nerve to tell Renee to ask about him, that he was always a good partner. Ahem, I think that David Chu (who hasn't been mentioned since The Burning Room) and Iggy Ferras (last appearance was \"9 Dragons\") would argue with this comment. Renee is still feeling pretty great about solving the case in The Late Show. She has seemed to make more friends in the department, and once again Connelly shows us how smart she is when she walks into a scene and deduces how an older woman was killed. I felt very a ha my dear Watson when she walks the officers through what happened. The same thing occurs on another call of Rene's in a missing person case. I like the contrast between her and Harry. Harry would have went in guns blazing, but Renee is more methodical about things. We get some call-backs to earlier Bosch cases and of course long-time characters resurfacing. I did have to say that I was surprised at the who done it in this book on the cold case involving Elizabeth's daughter. The case Bosch was tied up in felt like a weird distraction after a while. Connelly switches from Renee and Harry's perspective throughout the book. We get a kindly reminder of who is \"speaking\" too just in case you get confused. I don't think readers will, but it's a nice call-out to those listening to on Audible. I liked all of the writing in this one and you can feel the difference between Renee and Harry's sections. Connelly knows both of their voices. The flow was good between chapters and I maybe had a panicky moment when it looked like our fair heroine and hero were looking to end things on a sour note. Connelly pulls things together though in a kind of Hail Mary I am not sure about. The setting of this book is LA after hours. We have Renee and Harry doing a lot of leg work at night and around dawn. And at one point, Harry is going on very little sleep doing day shifts, coming home to sleep (eh) and eat and then meeting up with Renee. I am glad the book didn't have this going on for that long since it was making even me antsy after a while. The ending shocked me (in a good way) and I wonder at the implications for future books. I don't know how Connelly is going to do this, but I have faith he will do it well."}, {"Review": "After I finished the first book in this series that brings together retired LAPD detective Harry Bosch and current detective Renee Ballard, I knew I wanted to read more. Admittedly, I wasn't all that taken with Ballard in The Late Show, but the aging Harry has never failed to reel me in. It's much the same here; I'm still not an all-out Ballard fan, but by golly, the story is so good that it didn't matter. And, the more I learn about Ballard the more appealing she's becoming (I very much like the way she interacts with Bosch). In fact, by the end of this one I felt more attuned to Ballard than to Bosch.After her complaint of sexual harassment at her old job fell flat, she was reassigned to the night shift, where she's been for three years now. With her partner on bereavement leave, she's been working solo. One night, Bosch wanders in, claiming to be looking for information on the murder of 15-year-old Daisy Clayton nine years earlier. Intrigued by both the case and Bosch himself, Ballard decides to help and gets permission to look into what's now a cold case - pretty much working in her spare time.Of course, both Bosch and Ballard are working on other cases, and those stories get interwoven via chapters that shift in perspective from one to the other. Readers also learn more of what has shaped each of their characters, from Ballard's childhood to Bosch's shaky standing with the LAPD.As the spare-time investigation of Daisy's murder gets under way, it's interesting to watch the evolution of their interactions as Ballard at first takes issue with Bosch's so-what attitude toward bending the rules (unlike her, he's got nothing much to lose). Concurrently, Bosch gains a bit of respect for her position - and in the end, they meet in the middle in a sort of tentative acceptance (and a partnership that, I presume, will continue in future books). There's nothing tentative about my opinion of that: Bring 'em on!"}, {"Review": "Here's a double helping of Michael Connelly's creations as Renee Ballard teams up with Harry Bosch in another well written police procedural.Connelly juggles multiple plot lines as effortlessly as usual, & continues to develop one of his latest characters along with one of his oldest. On the down side Connelly once again uses a tired crime cliche, which lets the book down a little. Without giving this irritating piece of lazy writing away I'll just says that the author used it in the previous Ballard novel The Late Show as well. That aside it's still a good book, & one with a most satisfying conclusion."}, {"Review": "Dark Sacred Night by Michael Connelly throws together his longtime character Harry Bosch and LAPD Detective Renee Ballard in another grand police procedural. Ballard crosses the path of Bosch while he has been investigating a cold murder case of an underaged prostitute-drug addict. The two decide to investigate this murder and the novel moves on from there. The novel also includes other current investigative cases being worked on by the two detectives. One being where Bosch is actively being hunted by violent gang members. Connelly does quite well pushing the investigations forward while allowing the cases to be solved by dogged police work and shoe leather. Connelly is widely renowned for police procedurals and deservedly so, however, his novels are best suited for those that enjoy novels bred along the lines of Joe Friday/Dragnet and \"just the facts\" type storytelling. Now, it may be seen as Connelly-heresy to point this out, but for novels based in policing, Connelly mostly avoids the gallows humor found in policing and tends to stick to a cold, hard fact-like type of storytelling. "}, {"Review": "I would like to thank Netgalley and Orion for an advance copy of Dark Sacred Night, the first novel to feature an investigative collaboration between Detective Renée Ballard of LAPD and Detective Harry Bosch, currently a part timer with the San Fernando PD.Ballard works night shift or the late show as it's known in LAPD, a solitary job with its slow times so she's immediately curious when she finds Bosch rummaging in the department's filing cabinets. He explains about his \"hobby case\", looking for the killer of teenage runaway Daisy Clayton back in 2009 and soon she's as involved as he is.I thoroughly enjoyed Dark Sacred Night with its mixture of procedure, or in Bosch's case non-procedure, mystery, thrills, tension and character. Mr Connelly is currently peerless in his ability to weave so many disparate elements together seamlessly into a very readable novel. While Daisy Clayton's killer is very much at the forefront of their minds the investigation has to take a backseat to their regular jobs so the reader is treated not just to that investigation but Bosch's efforts to solve the cold case murder of Uncle Murda, a San Fernando gangbanger killed 10 years previously, and a series of vignettes as Ballard responds as and when required. All of it has something to say about Los Angeles, its denizens and lifestyle with some of it amusing, some of it sad but all of it hugely enjoyable. It's like a massive tableau of life with the reader being offered glimpses.I said it about The Late Show and I'll say it again here. I love the tone of the narrative with its dry recounting of facts and the cops' acceptance of whatever is thrown at them. That's not to say they don't care, more that it's often just another obstacle they can't change to overcome in their dogged pursuit of justice. The arrival of Harry Bosch, however, brings a more emotionally charged atmosphere to the novel as he identifies with the victims and survivors. Dark Sacred Night is a great read which I have no hesitation in recommending."}], "Genre": "Crime", "ID": "38204691", "Desc": ""}