{"Name": "Tear It Down", "Image": "https://images.gr-assets.com/books/1524501361l/39927877.jpg", "Reviews": [{"Review": "This review can also be found at Carole's Random Life in Books.I had fun with this one. I have to say that I am very happy that I made the decision to read this series several years ago when the first book, The Drifter, was being published. I feel like I have really got the chance to know Peter and the gang over the years and it has been quite the adventure. This book is the fourth in the Peter Ash series and while I think it could be read as a stand-alone novel, I do think that the series works best when read in order. Peter is sent to help out a friend in Memphis. Once he reaches her home, he finds a dump truck parked in her living room. He immediately realizes that this is not going to be the simple job he thought it would be. Just as he is beginning repairs on her home, his truck is stolen by a fearful teenager and Peter is picked up by the head of the local gang. Nothing is ever boring in Peter's life. Just as I expected this was an exciting story. There are several different things going on throughout the book and there was never any a dull moment. This book had all of the action that I could have hoped for including gun fights, car chases, and even a fist fight or two. I like the fact that all of the action in the story really helped to advance the plot and there were quite a few times that Peter was very vulnerable. He does handle himself well in most situations but he knows that he is not invincible.I really liked the characters in this book. Peter is still dealing with PTSD from his time in the military. He is very much improved when compared to the start of the series but those experiences are always with him. Peter is very competent and able to stay calm in even the most extreme circumstances. Lewis is a lot of fun and probably my favorite character in the series. I love his relationship with Peter and think that the pair really compliments each other well. I really appreciate the complete trust that they have in each other. I thought that Wanda and Eli were also great characters with compelling backstories. I do have to say that this book started out a bit slow for me which is odd since it was a really fast-paced story. I did find the beginning of the book to be interesting but I was confused by the absence of the main character, Peter. For me, the book really picked up once Peter entered the scene. I do understand why the author made the choice to show us some events from a different perspective but I did think it took a little to long for Peter to finally show up in the story.I would recommend this book to fans of mystery thrillers. This was an action-packed story with a really compelling mystery. I couldn't wait to see how everything would pan out and must say that the story did come to a satisfying conclusion. I can't wait to read more from this author in the future.I received a digital review copy of this book from Penguin Group - Putnam G.P. Putnam's Sons via NetGalley.Initial ThoughtsI had fun with this one. It was a little slow to start for me, not because it wasn't exciting but because it took some time for Peter to make an appearance. There was a lot going on in this book and it was quite the ride waiting to see how everything would come together. This book had all of the action that I could have hoped for with gun fights, car chases, and even a fistfight or two. I was glad to see Lewis, June, and Peter all working together once again."}, {"Review": "Tear It Down, the fourth Peter Ash book, is a solid action-packed men's adventure novel featuring a tough-as-nails but kindhearted Iraq War veteran who, instead of chasing insurgents in Baghdad, is now laying waste to what's left of the proud city of Memphis. There's certainly an ode to the blues here and some flashes of the past, but today's Memphis is rotting, abandoned, filled with trap houses, sharpshooters, players, and desperate souls. Ash strolls into Memphis like he owns it, cutting into the established pecking order. Petrie knows how to tell a story and keeps the reader engaged with nary a letup or an intermission. Full-out action just never stops. "}, {"Review": "June Cassidy's compound in the Pacific Northwest is a good place for Peter Ash to recover after the bone-shattering events of Light it Up. He spends the time fixing up the cabins and working out, running through the forest carrying a 40# piece of pipe. But June knows her man and sees Peter getting restless, so she asks him to go the Memphis to help out her friend, Wanda, a former combat photographer who is trying to make a new life in the civilian world. Peter arrives in Memphis right after someone drives a dump truck into the front part of Wanda's house. Who could be so determined to make her leave her house, bought at a foreclosure auction? It dates from before the Civil War and there are rumors about its history. Meanwhile, four young men plan a jewelry store heist, except things go spectacularly wrong and then Peter gets involved when one of the young men hijacks Peter's beloved green pick-up. The two storylines run parallel until they begin to converge into another explosive denouement. If you like Lee Child and Harlan Coben, you must read this series. The characters are so three-dimensional and the plots are so well-developed, you will find them all hard to put down."}, {"Review": "Our hero, former Marine Peter Ash, is trying to settle down and overcome his PTSD. He can still just barely function indoors. His ever-resourceful girlfriend sends him to Memphis to help a friend and he arrives just in time to have his truck stolen, watch the friend’s house repeatedly receive military-like assaults and run amok with the local drug lord. He’s having one really great time in Memphis. This is a fast and fun fourth addition to a thriller series that doesn’t disappoint on any level. It functions as a standalone, but the other books are really good, so why not check them out? -Suzanne R."}, {"Review": "I had the extraordinary good fortune to acquire an ARC of TEAR IT DOWN and devoured it in a single sitting. Everything you love about Peter Ash (and his compatriots) is here and the action and pyrotechnics are at a series high, but my favorite bit: the writing sings. Petrie doesn't just give us real characters in a beautifully articulated world with his trademark dry humor, he goes deeper than ever in TEAR IT DOWN, investing the novel with incredible pathos, so when the heart-pounding action comes, the stakes are sky high. I love each Ash installment more than the last because Petrie delivers the heroics and the humanity in equal measure. "}, {"Review": "Peter Ash is the hero you're looking for if you'd like a good read about a man who wants to right wrongs. A damaged man in some ways- he's an Iraq war veteran- but in others more in tune than any of us, he's stumbled more than once into a nest of vipers. In this novel, he's gone to Memphis to help Wanda, who is being threatened as she tries to renovate an old home she bought at a foreclosure auction. The people who lost out at the auction want the house back- but why and how far will they go to get it? Eli, a young musician and, let's face it, street criminal, steals Peter's car. The two of them link up in a story that matches wits with some of the best in this genre. Memphis does not come off well in this tale- it's filled with thieves and gangsters- but that is true of the underbelly of virtually every city. I read the first book in this series but missed the next few, making this kind of a standalone for me. It was a fine read in any case so thanks to Edelweiss for the ArC. For fans of Reacher. "}, {"Review": "Iraq war veteran Peter Ash has been living with his girlfriend June in the mountains of Washington but she senses his restlessness. Her solution is to ask him to travel to Memphis and help her friend Wanda, a photographer and war correspondent who has been receiving threats. When Wanda purchased her house at an auction, she outbid two brothers with ties to the house. As they grew up their father told them stories of a family legacy that was hidden in the house during the Civil War. Their threats are now escalating to violence in an effort to scare her from the house.Shortly after arriving in Memphis, Peter’s truck is stolen by Eli, a young street musician who was involved in a recent jewelry store robbery that went horribly wrong. Now he is on the run with a bag of Rolex watches and the powerful head of the local gangs chasing him down. Peter sees something in Eli and it will take all of his training and skills to keep him safe while also trying to protect Wanda.This is the fourth book in the Peter Ash series but the first one that I have read. Nick Petrie’s characters are well-developed and he keeps his story moving at a quick pace. Ash shares a number of the same qualities found in Jack Reacher, making this an ideal series for fans of Lee Child. After reading Tear it Down I will definitely go back to the beginning of the series to learn more about Peter Ash.I would like to thank First to Read for providing a copy of this book in exchange for my honest review."}, {"Review": "4.5 stars.Tear It Down by Nick Petrie is a high-octane mystery that is full of suspense. This forth installment in the Peter Ash series can easily be read as a standalone.Noticing that he is feeling on edge, Peter Ash's girlfriend June Cassidy suggests he go to Memphis to help her friend, Wanda Wyatt.  Wanda, a combat photographer, has recently purchased a home in foreclosure and she is receiving threats to force her to move. Ash arrives just as the threats are turning more violent.  Just as he is starting his investigation, his truck is carjacked by Eli Bell, a young man who is being hunted by drug kingpin Robert Kingston. While trying to reclaim his beloved truck, Peter also ends up crossing paths with Kingston, his shooter Charlene Scoot and driver Dennis Brody.  As both of the situations continue to escalate, Ash's close friend Lewis joins him in Memphis. The formidable crime fighting duo soon find themselves in danger as they attempt to save Eli while working to identify who is gunning for Wanda.Peter's time with June has helped him manage his PTSD better but he still struggles with his intense claustrophobia.  He thrives on the adrenaline fueled adventures he finds himself in and he is not one to back down from a fight. With the help of overworked Detective James Gantry, Peter finally begins to unravel the mystery of who might behind the threats to Wanda. Ash is also very concerned about his reluctant client who is clearly struggling with the horrors she has witnessed over the course of her career.With plenty of action, Tear It Down is an thrilling mystery with an eclectic and colorful cast of characters. Peter might be becoming a bit domesticated, but he never loses his zest for fighting for the underdog.  Underlying themes of race, poverty and gang violence add depth and interest to the storyline.  Readers will have to suspend their disbelief as Nick Petrie brings the novel to an edge of the seat, adrenaline-laced conclusion. I highly recommend this exciting addition to the Peter Ash series to fans of the genre."}, {"Review": "I am just loving this series. Book 4 and Peter can stay indoors for a little while if he believes it is necessary. The white static still rules his life and he needs to be doing something. June sends him to Memphis to help a woman she knows. Somebody is trying to drive her out of a house she just purchased. This, the terrorizing of a person, is just the kind of problem that Peter likes to solve. Along the way, Peter meets a boy who plays blues guitar extremely well and is in trouble with a local crime lord. Peter and June and Peter's ex-crime lord friend Lewis all unite in Memphis to clean up the twin problems, after they have created a major mess. You have to read this book. It starts slowly, but then takes off like a house on fire, or at least one that has a dump truck in the front room. I'm almost hoping Peter never gets the white static completely under control.I received the copy of this book for this review from First To Read."}, {"Review": "I liked so much about this fourth book in Petrie’s series. The existing characters seem to gain depth and the new characters were fresh and interesting. The author used the setting well to put Ash in ‘fish out of water’ situations as he is usually the only white guy in predominantly African-American sections of the city. I feel like there weren’t as many narrative threads vying for the reader’s attention in this one. That’s not to say the plot was simple. It was complex in that it challenged each character and ramped up to a superb ending.If you’re looking for a new Jack-Reacher type series to start, Petrie’s Peter Ash is a great one, and the books don’t drop off in quality.For my full review: https://paulspicks.blog/2018/12/13/te...For all my reviews: https://paulspicks.blog"}, {"Review": "Two weeks ago, after a long day of pre-semester meetings at my college, I headed to a library in Gurnee (the town next to mine) with my sister to hear Nick Petrie talk with another author, Lori Rader-Day, about his newly released novel, Tear It Down. The book is the fourth in a series about Peter Ash, a military veteran with a persistent case of PTSD and an uncanny ability to attract trouble.The conversation wandered in many interesting directions, including a discussion of series books versus standalones, and I learned more about the origins of Peter Ash in general and the writing of Tear It Down in particular. Petrie (like the dish) lives in Milwaukee and Rader-Day lives in the Chicago suburbs so the evening felt like a nice way to get to know and support local/regional authors and I would have happily sat and listened to another two-hours-worth of stories.After all that, I was eager to get to my signed copy of Tear It Down and find out what trouble Peter Ash was going to get into in Memphis. I was not disappointed. One of the things that I appreciate about Petrie’s series, the first being The Drifter, is that Peter is evolving over the course of the books. Not changing completely but rather slowly getting a handle on the “white static” he feels in enclosed spaces and developing a closer relationship with the feisty June Cassidy but also realizing that there are some aspects to his new post-war personality that he won’t ever be able to leave behind. The fact that June recognizes this too is part of what sets the plot of Tear It Down in motion.Sensing Peter’s growing restlessness, June sends him to Memphis to help out her friend, Wanda Wyatt, a photojournalist who has worked in a number of war zones but is now taking pictures in inner-city Memphis and preparing for a big art show in New York. Wanda recently bought and moved into a historic but run-down building and has been getting death threats. Not long before Peter arrives, the threats turn into action when somebody drives a huge dump truck into the front of Wanda’s building. This situation calls for Peter to act as contractor and sleuth as he sets out to help repair the building (or figure out if it’s worth repairing) and figure out who has it in for Wanda and why.However, this isn’t just Peter’s story. It’s the story of Eli Bell, a fifteen-year-old African-American street kid and musician, living in Memphis without any family and whose friends coerce him into taking part in a robbery. At first, it seems the jewelry store in a suburban mall is easy pickings, but when the job goes horribly wrong, Eli finds himself on the run both from the police and a powerful drug lord. It’s also the story of Albert Burkitts, a middle-aged white man who in an attempt to hang onto the family farm, has turned to running a wild hog butchering business. His body is falling apart after years of labor and one bad farming accident, and he finds himself needing more and more pain pills to make it through the day. He also realizes he can no longer control his younger brother, Judah Lee, recently released from prison and in full-on white supremacist mode. Judah Lee is becoming dangerously fixated on recovering the family fortune, which lore has it was hidden in a house in Memphis before the Civil War.Seeing how all these characters come together is part of what makes this novel so powerful and addictive. Once again, Peter calls on his friend, Lewis, for back up. In the tradition of Spenser’s Hawk or Myron Bolitar’s Win, Lewis comes with a “particular set of skills.” However, as has been hinted at all along, Lewis’s backstory does not just involve the streets of Milwaukee, and that idea is developed a bit further here. The dynamics between Peter and Lewis are a joy to read—both witty banter and real understanding—and the racial issues that arise in this novel only deepen their relationship.Petrie creates a cast of characters that feel real—both ones you want to get to know better and others you would cross the street (or the country) to avoid. However, he also sets this novel in a Memphis that is not all Elvis and Sun Studio and I appreciate that. At this point, I will pretty much follow Peter Ash wherever he goes, but this novel is a trip I would recommend to anyone."}, {"Review": "Tear It Down is a rip-roaring adventure into the underbelly of Memphis with Peter Ash’s haunted military veteran taking down drug dealers with the help of his friends and girlfriend, June.Peter gets antsy when he stays at home too much so June sends him to her friend, Wanda, in Tennessee whose house has been vandalized. While there, he gets involved with drug gangs, bandits and hidden treasure.I can’t believe I have never heard of this series before and this is book four. Even though I received a copy from Edelweiss+, I couldn’t stop reading it to drive to work so I bought the audiobook! The audiobook narrator uses his skills with accents to great effect, which makes it easy to tell the characters apart (even in heavy traffic). It made my hour long commute fly by.Tear It Down is fantastic with both a great plot and great characters. This series is highly recommended for Jack Reacher fans as Peter is even more of a loose cannon. 5 stars!Thanks to G.P. Putnam’s Sons and Edelweiss+ for a copy in exchange for an honest review."}, {"Review": "Nick Petrie’s protagonist, Peter Ash, continues to grow as a fleshed out character. A veteran of the war in Iraq, he has PTSD which manifests as extreme claustrophobia which he is slowly learning to manage with meditation and exercise. His girlfriend, June, has started to feel that he needs a project besides fixing all the out buildings on their property and she sends him to Memphis to help her friend Wanda, a war photographer who has been receiving threats and by the time he arrives has had a dump truck driven into the front of her house. The situation is complicated by white supremacists, hidden treasure and a young gang who has robbed a jewelry store and is on the run from the local crime boss. Lots of fast paced action!"}, {"Review": "This story starts with four homeless teens planning to rob a jewelry store. The viewpoint character is Ellison Bell, called Eli, who has been on the streets since he was nine. His father disappeared, his mother died of a drug overdose, his older brother was shot in the face, his grandmother died of a stroke. Eli has only one possession - a guitar he received as a gift. He us a talented musician who plays the Blues and has a mathematical gift. He's the planner of the heist but only because his friends threatened his beloved guitar. Things go wrong. Eli manages to escape with a bag of Rolexes. He knows two of his friends are dead and his best friend is missing. Now, he's on the run from King Robbie who runs all the crime in Memphis. It was his friend who had the plan to get on King Robbie's right side. The next section of the book introduces Peter Ash who's an Iraq war veteran, a former Marine, who came home with claustrophobia and a need to right wrongs. His girlfriend recognizes that he's restless and sends him to Memphis to help out a friend. War photographer Wanda Wyatt has come home to Memphis to get some photos together for a show and bought an old house at auction. Now someone is either trying to kill her or force her out of her new house. The latest big of harassment involved driving a dump truck through the front of her house.Eli and Peter meet when Eli hijacks Peter's beloved 1968 Chevy pickup from a gas station. Peter could have stopped him but chose to recover the truck later when he sees the desperation in Eli's eyes. But there's Peter coming to help Wanda and now without his truck, his tools, his ID and cellphone - and the kevlar vest his girlfriend gave him to keep him safe. This was a gritty mystery with all sorts of violence. It deals with race and poverty, drugs and violence. It takes place mostly in the part of Memphis that is a War Zone controlled by drug lords and steeped in violence. The characters in this one are vivid. Peter reminds me of John D. MacDonald's Travis McGee in that he's also a knight errant in rusty armor going around trying to help people who need it and not afraid to use violence to make things right. Wanda is messed up from her time taking pictures in war zones. She using too much alcohol and too many pills to try to cover her pain. Eli is a kid without much hope and with no dreams of a future since he doesn't expect to live to have one. I really enjoyed this thriller. I loved the characters and the descriptive writing. This is the fourth book in the Peter Ash series and you can bet I'm going to read the first three as soon as possible. "}, {"Review": "This is a fun thriller, with a bad-ass hero looking to get the bad guys and nonstop action. It was a fast read and well-written. It includes a cute author's note at the end that basically says \"don't try this at home, boys and girls\". The characters are pretty well developed for a thriller, and the point of view switches from the main character (Peter) to the villains in the plot (but not to the other good guys: Wanda or June or Lewis) to fill them out to more 3D characters. Peter is fighting two evils: a black dope dealer with evil henchmen (and a woman) and a manifestly evil white supremacist. The two really bad guys are pure evil, but they have sidekicks that are more or less filled out and human. And Eli, the kid who Peter is trying to help, is a relatable character in a bad situation.The story is about Memphis, but more than anything else, about race. And I'm not 100% sure I'm comfortable, or maybe impressed, with this aspect of it. The black teenagers use the n-word that ends in a and the white supremacist uses the n-word that ends in er. There are two characters addicted to pain killers, one black one white. The main crime fighting team is one black one white, and they explicitly call themselves Ebony and Ivory at one particularly cringe-worthy juncture, and they're coming after two main criminals, one black one white. Peter tells Lewis not to kill the black dope dealers and Lewis tells Peter not to kill the white supremacists. All this happens without Peter and Lewis really having a conversation about race, other than Peter saying he feels guilty that he doesn't have a direct connection to slavery. It's a little too carefully constructed and also somehow dodges the main issue. I'm still turning over exactly how I feel about it. I'll be interested to see what others have to say about this earnest, well-meaning, but somehow a little off take on race.But at the same time, I know I'm way overthinking this. The main point of a thriller is the action and the bad-ass hero, right? And it certainly delivers on that front. I just feel like the author was trying to make it something more and didn't quite get there. But it was well written and fun.I got a copy to review from First to Read."}, {"Review": "I was excited to have an opportunity to rejoin the world of Peter Ash. One of the main quirks of this character that stands out for me is the dichotomy of his approach to the world. Where he finds innocents being treated improperly, he is quick to stand up for them and take on (or take out) those who need it; however, his moral compass frequently pegs out when he comes across the type of person he feels he can show compassion toward – even those who are portrayed as villains.A young “punk” personality hijacking him and taking away his beloved truck he has diligently worked to restore and is his main possession in life, tugs at Peter’s heart strings (for a reason that is somewhat subtly explained later in the novel) to the point, he wants to rescue him. Peter originally is sent to assist Wanda (an acquaintance type friend of June’s) whom he finds has some struggles of her own regarding seeing the horrible results of war and poverty along with trying to wipe them away with various substances. Again, Peter finds a situation where he wants to get this person back on her feet.As a resident of Arkansas who has traveled to the eastern part of the state and into Memphis, it was fun to read and know about several of the locations in various scenes. One of my knocks on this fourth novel is starting to slowly weave its way into an annoyance: the ongoing issue between Peter and June in how he needs to be “set free” due to his personality and need for testosterone-filled situations versus her want and desire for him to get it out of his system and come home to stay. June’s later appearance in this novel and travel to Memphis did not feel necessary for the story line. She could have easily stayed in Washington and been a slight thorn to Peter by phone.I enjoyed the introduction of the main villain’s body guard and “hit woman”. Their characters would be interesting to show up again given how the last interaction ended in this novel between them and Peter. Could they arrive in later novel(s) as reluctant help for Peter? Not a perfect novel by any means, but if you’re seeking: action; several problematic situations coming to head simultaneously; broken down city street life; and, a flawed main character, this novel hits these themes solidly and make for a 4 out of 5 star read."}, {"Review": "While this is a solid entry in the Peter Ash series, touching on the economic ruin left in many American cities when manufacturing jobs were shipped overseas, it wasn't the strongest outing for the characters.Peter is living with June Cassidy, but he's restless. So June sends him to Memphis, ostensibly to help a photojournalist colleague. But when Peter arrives to find that someone has driven a dump truck into the living room of the woman's house, he begins to wonder if this is more than what he'd bargained for--or if June even told her colleague he was coming.When Peter drives off to make arrangements for working on the ruined house, he's held up at gunpoint at a gas station by Eli Bell, a 15-year-old we meet in an earlier chapter during a jewelry store robbery that goes terribly wrong. Eli steals Peter's truck, leaving Peter to walk the streets hoping for a ride ... which lands him in the armored car of the local drug lord who's using more of his own product than is good for him and his two main enforcers, plus two brothers trying to recover their family's long-lost wealth, and it's no surprise that Peter is making calls to long-time friend and partner, Lewis. Lewis dutifully shows up with the guns and another vehicle, and June is only a few hours behind ...The hardest thing for an author with a highly successful series is knowing when to \"exit stage right\". There are certainly readers who will gleefully follow Peter, Lewis, and June on their next adventure, complete with narrow escapes, plot twists, high-voltage action scenes, and hard-edged romantic sparks.I'm not going to be among those readers, though. Nick Petrie should be applauded for tackling some very important subjects in his fiction--the desperation of young black men who have no alternative to better their lives in blighted neighborhoods other than crime, or the shameful lack of services available to veterans who struggle under the stigma of PTSD or other psychological aftereffects of service, or the Wild West business practices of any number of burgeoning businesses and industries where huge profits can be made with seemingly little actual work and even less regulation or legal oversight.Unfortunately, there are plenty of other authors addressing those same topics in stand-alone novels or works of nonfiction. Kudos to Peter Ash for surviving another grand escapade, and best of luck to Ash if Petrie decides to send him out in another installment. It was fun while it lasted, and I learned a lot. But like Peter, I've gotten restless, so it's time to hit the literary highway in search of my next engaging story."}, {"Review": "I've been a huge fan of Nick Petrie's Peter Ash series since I read The Drifter. Each succeeding book has seen the former soldier meet challenges not only from a variety of villains, but from his own inner struggles with severe claustrophobia and the \"white noise\" of his PTSD. Each book has also seen him defeat evil, but also win ground back from his own difficulties. Tear It Down finds Peter in a stable, if unusual relationship with June - a tough as nails reporter who recognizes that Peter needs to keep busy, physically and mentally, to hold on to his hard won gains emotionally. When she thinks Peter is getting too restless, she asks him to go to Memphis to help a photo-journalist friend, Wanda, with the \"fixer upper\" she purchased. Peter arrives at Wanda's house to find that somebody has driven a dump truck into her house. The next day, Peter's truck is stolen by a homeless teenager who was reluctantly involved in a jewelry store robbery gone wrong. Things go downhill rapidly when Wanda's house is shot up by a man who is described as the Devil. All Peter really wants is to find his truck, save the boy who is a talented musician, discover who wants Wanda out of her house, and do his job. What follows is a high octane plot involving drug kingpins, white supremacists, a treasure hunt and a car chase that makes Bullit look like a walk in the park. What sets Tear It Down apart from a lot of thrillers is the heart in this book. Peter and his partner, Lewis, are a classic duo hearkening back to Spenser and Hawk, and Joe Pike and Elvis Cole. Peter and June compliment each other, and she understands him better than he understands himself at times. The book throbs with the life of Memphis and Music, the smell of hot asphalt and rain, and the music of the Blues. This is the thriller of the year for me. I'm sure it will lead my top 10 at the end of 2019. Don't miss this book, but do read Nick Petrie's other books, too. "}, {"Review": "Thanks so much First to Read at Penguin Random House for access to this ARC! I’m rating this a 1 out of 5 stars. I really struggled to get into this book and even to finish it. I’m not one to take a long time to read something I’m into, but I just had a hard time reading this book. I didn’t like the chapter setup. I didn’t like the flip flopping in chapters and having to remember who was who and who was connected to who and how and where. Maybe I would have done better with chapter titles. I didn’t feel like it all came together soon enough. I felt constantly confused at what was happening, which made me uninterested and I found myself often stopping reading and do something when I’ve read other books in less than 24 hours because I had to know what happened next. I didn’t realize this was a fourth book in a series so I was thrown off when they referenced things in previous books that I was unaware of and thus didn’t understand the reference. I didn’t like the authors style. If you liked his previous books about Peter Ash, I’m sure you’ll love this one too. As someone who didn’t know anything about Peter Ash or the authors chapter style and writing rhetoric, I was not impressed and only finished the book because I was given access to the ARC and wanted to be able to write my review. I did enjoy the references to the struggles of veterans and appreciate the spotlight on that, as well showcasing the problem in many cities across our nation of children and families suffering and people dying for no reason. I’ve read other books showing race war scenarios and problems in our “ghetto” neighborhoods or areas overrun with gangs that were better than this one. "}, {"Review": "Book #3 of this year is this excellent book , Tear It DownFrom the introduction of my interview: \"I have a theory that if you give an awesome book full of adrenaline, excitement and plot twists to someone who usually needs a cup of coffee to get moving in the morning, the book will do the job. Nick Petrie’s new novel, Tear It Down, is one such book.As the book, the fourth in Petrie’s Peter Ash series, begins, Ash’s girlfriend sends the restless war veteran to Memphis to help a friend, Wanda, with a situation: she’s receiving strange threats. By the time he arrives her home is under attack, bulldozed by a garbage truck.Meanwhile, a young homeless musician in Memphis, on the run after a jewelry store heist goes sideways, steals, at gunpoint, Ash’s car and Ash finds himself immersed in a second case with Ash trying to help not just Wanda but also this musician, Eli.Petrie masterfully advances both stories while fleshing out all the characters.\"“Lots of characters get compared to my own Jack Reacher, but Petrie’s Peter Ash is the real deal…The writing is terse and tense, full of wisdom and insight, and the plot is irresistible.”I give it a 9and interviewed the author here https://mysterypeople.wordpress.com/2..."}, {"Review": "Peter Ash is at it again: righting wrongs, helping desperate people right their lives, and working on minimizing his issues with PTSD that threatened to mentally cripple him in earlier books in the series. In Tear It Down Peter is becoming restless helping his girlfriend and investigative reporter, June Cassidy, prepare her rural cabins in Washington state for the summer crowds. She suggests Peter go to Memphis to help a girlfriend of hers rebuild her home. Peter arrives just as a dump truck has been driven into the front of her home, following several previous written and phone threats. The attacks continue as Peter begins work on the house. Peter also gets his lovingly restored truck carjacked by a 15 year old kid, gets in trouble with Memphis' criminal kingpin, and seems to find additional trouble around every corner. Finally, it's time to call for reinforcements--his buddy Lewis--to help take on all the different elements after Peter. Action abounds as does great character development, a very interesting plot about a city I know little about, and winds up with a satisfactory conclusion. I look forward to the next Peter Ash adventure."}, {"Review": " I actually had just finished #3 Peter Ash book, and planned to take a Peter Ash hiatus. However, I got lucky and won a copy of Tear It Down from the publisher in the Goodreads drawing. So I jumped right into it. This was a typical Peter Ash novel, and I mean that in a good way. I really like the Peter Ash character. Feeling like I \"know\" him--and that he's a really good guy-- keeps me interested in what he does next. I also like the characters who reappear as his friends, especially Lewis, who is a bit unbelievable, but still fun to observe and reassuring when he appears. I'm not crazy about June, but I do like the banter between her and Lewis. The plot kept me interested and the usual violence was intense, but didn't go on and on. The only reason I gave the book a 4 rather than a 5 is the implausibility of what happens to the real bad guys in the book, the relationships Wanda, the woman Peter goes to help, has with other bad guys in her community, and the premise upon which the attack on Wanda's house is based. "}, {"Review": "Peter Ash drives to Memphis under the assumption he is helping a new friend rebuild her historic home. Upon arrival Peter begins to uncover the very dangerous and seedy underbelly of the south’s hate crimes and drug wars. From dump trucks to machine guns and face tattoos, this fast-paced addition to the Peter Ash series will keep readers guessing. The many characters and seemingly unrelated events culminate with an action-packed stand-off over the Mississippi River. Mendel’s narration truly excels as Lewis, Peter’s partner and friend, creating such a profound audio picture listeners can almost see the character; unfortunately the other characters are more weakly portrayed although supported by Mendel’s resonate third person voice. Mendel’s pacing throughout the thrilling story keeps listeners on the edge of their seats eagerly anticipating how this gritty adventure will end. Fans of Lee Child and Lisa Scottoline will enjoy this suspenseful story of the South. "}], "Genre": "Crime", "ID": "39927877", "Desc": ""}