{"Name": "The Girl Who Kicked the Hornet's Nest", "Image": "https://images.gr-assets.com/books/1327708260l/6892870.jpg", "Reviews": [{"Review": "These books really shouldn't work. Stieg Larsson is a very weird writer. He likes to tell us absolutely everything someone is doing. If Stieg wrote the story of my morning, it would go like this:\"Joel woke up around 7:45 a.m. and looked at the clock. He decided he didn't need to get up yet and hit the snooze button. When the alarm sounded again, he dragged himself out of bed and used the toilet. He brushed his teeth and then dressed in a blue striped shirt, black tie and flat front dress slacks he'd purchased on sale at Kohl's. He made himself a cup of coffee, fired up his 13-inch Macbook laptop and checked his email. He had 14 messages. 11 of them were advertisements from various mailing lists or spam emails encouraging him to enlarge his penis. One message was from his mother and two more were shipping notices for books he'd purchased from Amazon.com. He read the note from his mother but decided to reply later. He then deleted all the messages but the two from Amazon and closed his laptop. He sat on the couch and stared into space, drinking his coffee and thinking.\"Most writers would probably start the scene several paragraphs later, when I finally get to work (that's where the real excitement happens! I check even MORE email!). (Plus it turns out I'm not even a main character.) But for some reason, this style is, I don't know, endearing instead of annoying. I love the way he tells us every time Mikael has a cigarette or what he likes on his sandwiches. And hey, at least I know what brand of cell phone everyone is using.It's kind of weird how the series wound up being not at all what I was expecting. Book one was closest, a serial killer story that was nevertheless a weird mash-up of political potboiler and are-the-lambs-screaming-Clarice murder fun. But then book two was mostly about the internal politics of the Swedish police and media industries. And the big climax of the trilogy comes down to an incredibly extended legal thriller, Grisham-style. I assume. I've never read a John Grisham book.But really, everyone knows why the books work, and it's because of the characters. Stieg approached the whole trilogy as a sort of manifesto about the injustices heaped upon women in Swedish society, and illustrates them via a host of compelling, level-headed, fairly well-rounded women who are fun to read about even when they spend every other page having sex with the Stieg stand-in. Everyone loves Lisbeth, of course, and this installment does a good job of fleshing out her back story and explaining how exactly one winds up a tattooed, antisocial computer-hacking genius with an insatiable hunger for revenge and Billy's pan pizza.This is an excellent wrap-up to Lisbeth's story and the trilogy, leaving exactly one thread hanging, and a small one at that, which is remarkable considerng it's number three in a planned run of 10. It leaves Mikael and Lisbeth in a great place, and pays off pretty much everything that was established over the previous two books. That it does so with a histrionic courtroom scene, all the better. I don't read legal thrillers but I love courtroom scenes in movies, especially when judges say stuff like \"I'm going to allow it, but you'd better be going somewhere with this.\" No one says that here, but only because apparently you can do whatever the fuck you want in a Swedish courtroom without bothering to talk to the judge at all. On the bright side, a flustered prosecutor does break out another old chestnut --\"This is highly irregular!\" -- that almost makes up for it.So, yeah, I'm a little sad that Lisbeth has stalked off to that big Ikea-furnished apartment in the sky to join her creator. And I wish Stieg didn't eat quite so many of the fatty sandwiches and Billy's pan pizzas he loved detailing so much (hey, write what you know). If book 4 never emerges from that mythical laptop, though, this is a pretty good place to end things."}, {"Review": "What I learned from this book (in no particular order):1.\tYou can use duct tapes to close up serious wounds; they keep the blood in and the germs out.2.\tYou can be shot in the head and STILL have photographic memory, though annoyingly, you will forget the solution to that pesky Fermat's Theorem that you have just discovered.3.\tCongenital analgesia is a useful condition to have for mafia henchmen and Bond villains.4.\tMuscular, one meter eighty-four tall Latina policewomen who can out-wrestle a man are HOT.5.\tMiddle-aged, out of shape Swedish journalists are powerful chick magnets.6.\tThreesomes and other bedroom antics involving leather, especially if you are stupid enough to record them, WILL come back to haunt you.7.\t“Statistics showed that the absolute majority of people who harassed women were men.” Yes, we know it, that barring a few notable exceptions, most men are SADISTIC PIGS, PERVERTS AND RAPISTS!8.\t”The majority of poison pen artists were either teenagers or the middle-aged.” Only people between 26 and 54 years of age are crazy enough to become stalkers.9.\tAmazons are cool because they were willing to cut off their right breasts to be better archers. They also liked to copulate with random men to make babies.10.\tMeatballs with potatoes and Lingonberry sauce are good Swedish food.BUT SERIOUSLY,this final book in the Millennium Trilogy is a let down compared to its predecessors. The conspirators who protected Zalachenko and committed Salander into the asylum are revealed early on in the novel, thus removing any sense of mystery. The pair of elderly, terminally ill men who lead them are so out-gunned, out-maneuvered and out-hacked by the good guys from the beginning that there is hardly any suspense left. Salander herself spent the majority of her time on a hospital bed, convalescing from the shot in the head that she received from Zalachenko. The previous books were able to succeed largely because of the peculiar originality of her character and the outrageous stunts that she pulled. With those elements missing, what is left is a rather predictable police procedural filled with tedious bureaucratic wrangling and dull talking heads. The pace picks up a bit with the trial and the novel ends with a sorely needed action piece that provides a closure to Salander’s dark past, but it is nowhere near the level of the exciting episodes that preceded it. Still, if you have read them, you will want to read this one too, if only to get a satisfying ending for Salander, Blomkvist and other characters that we have came to know from the series. My review of \n http://www.goodreads.com/review/show/...and\n http://www.goodreads.com/review/show/..."}, {"Review": "Dear Steig Larsson,I absolutely hate you! But,I think I love you too. While every author has some characteristic quality, yours seem to be aggravate your readers. Ever since I picked up the 1st book of this Millennium saga, I have regretted my decision countless times. You have forced me to bang my head on the wall, pull my hair, throw your books at the end of the room, and then pick it up again and read it like a mad woman, totally forgetting the outside world. So many contradictory feelings have kept me ap at night, and if my predictions are correct I will be thinking about you, this series and your incorrigible characters for at least 2 weeks now. I must commend you for your qualities, though. No one has ever created such impressive and realistic female characters. Lizbeth is always an inspiration, but I think you did an excellent job with all the other characters introduced in this book too. I must also state that you achieved the impossible task of making me like Berger. Indeed, that is a miracle! When you started explaining stuff about her leaving Millennium, I was totally mad at you. I couldn’t wait to get back to Salander’s part. Yet, you went on to create such realistic incidences! Berger’s problems go nowhere near Lizbeth’s, but they seem to be problems right out of real life circumstances. Then you introduce characters like Linder and Giannini, who are in one word amazing. You stun me Larsson, with your spectacular portrayal of women! I am so impressed!now, hold on for minute!Do not get too pleased. You have made life hell for me for the past two months. Do you know how irritating it has been to see this book as a permanent fixture on my bookshelf and currently reading shelf? I mean, what is the point of all the unnecessary yakking? Why the lengthy details? Why introduce characters like Salander’s twin, and that Fegarula person? And why the hell do you add sex scenes that feel so completely out of place in the story. I must also comment on how Mikael's character has become too much of a Mary Sue. Desired by all women? Why is that so? I wonder how much of you is represented through him.:PAlso, I am so glad this saga is at an end. I am glad because I am certain that if there was another book, I would surely have gone ahead and bought it; in spite of my current experience. I am glad that I won’t have to go through all of the emotional drama again, experience all the turmoil, and feel kinship for Salander.I am happy and I am inexplicably sad.This book was clearly not how you planned to end the series. The ending left so much scope for other stories to come after it. I feel very very sorry that there is no more of your work to read and that you will never be able to read this review (not that any author of your standing would). I feel very sad that you died without seeing what a sensation your books became, how the memorable characters you created will forever be etched into the mind of us readers. I am happy that I am ending this year with this series but don’t disillusion yourself with the thought that I would ever reread this series. Happy New Year!Your reluctant fan,Tanu"}, {"Review": "”Salander was afraid of no-one and nothing. She realized that she lacked the necessary imagination--and that was evidence enough that there was something wrong with her brain.”\nNoomi Rapace plays Lisbeth Salander in the excellent Swedish trilogy. She takes the bad girl goth look farther than even Joan Jett.Even if Lisbeth Salander had been raised in a “normal” environment of a white picket fence, with a swing in the backyard, a dad flipping burgers in a haze of barbecue smoke, and a smiling, sundress wearing mother, she would have been abnormal. As it was she was the daughter of a psychotic, deranged Russian father who lived under a blanket of security because he defected with secrets that the government was interested in knowing. Zalachenko beat Lisbeth’s mother so severely that she sustained brain damage that left her nearly a vegetable. He wasn’t prosecuted. After all she was a whore, just a whore, or so they say, but then “trusted” government official can leak any information they want and have it lapped up by the media. Lisbeth tried to kill her father.Okay.She tried to kill him twice, but he is a tough old bastard. Let’s just say the environment that Lisbeth was raised in required her to embrace the more abnormal aspects of her personality to survive. So why did she try to kill her father?”That is under investigation, but there are strong indications that he did indeed attempt to kill her. As far as we can determine at the moment, it was a case of deep antagonism in a tragically dysfunctional family.”They are related, but they have never been anybody’s concept of a family. She also has a half brother named Niedermann who can’t feel any pain and is a genetic giant of freakish strength.I think everyone knows the story of Stieg Larsson, the author of this trilogy. He died from a heart attack shortly after dropping off the three manuscripts for the Millennium novels with his publisher. It is imperative that readers read these books in order. If you attempted to read this one first, for instance, you would be lacking a lot of critical back story that will definitely heighten your enjoyment of the book. So no short cuts, no cutting to the end, the journey must be taken. You must take the blows along with Lisbeth so her eventual triumph will be your triumph as well. \nShe turned her back and pulled the hospital gown off her shoulder. She sat so that the light from the window fell on her back. He looked at her dragon. It was beautiful and professionally down, a work of art.After a while she turned her head.“Satisfied?”“It’s beautiful. But it must have hurt like hell.”“Yes,” she said. “It hurt.”The first book The Girl With the Dragon Tattoo is a mystery. The second one The Girl Who Played with Fire is a thriller. This one is a courtroom drama. Larsson wrote this trilogy in the evenings for entertainment purposes as an escape from the real world. He was an investigative reporter and I’m sure most of the time real life was too real for him. It was as if he were playing with different writing formats, proving that he could write one as well as another. There are rumors that his girlfriend has a partial fourth book locked up on a laptop computer until the legal issues with Larsson’s estates can be settled. I think Larsson was brimming with stories and had created a heroine, uniquely compelling, with sustainable appeal that would have kept him on the bestseller list for years. I certainly would have been a zombie consumer of Larsson’s books, but I am content with what he gave us. It gives me shivers to think of another author conceiving their version of Salander or trying to mimic Larsson’s version. I do believe that characters should die with their creator. So Salander is in the hospital recovering from wounds sustained near the end of book two. Her father is recovering on the same hallway. They are a mere two doors away from each other. If a hospital could ever be quiet they might have been able to hear each other breathing. Despite the critical condition of their wounds each plots the demise of the other. Each secures a weapon of what is at hand, a pen, a crutch, anything to give them a chance if the other attacks. ”Only a woman who had killed a man in battle was allowed to give up her virginity.”Amazon women, men dream about them. They are not always pleasant dreams. Larsson did sprinkle a few facts about legends of Amazon women between chapters. How fitting, for though our heroine is a scrawny 5’1” she is without a doubt a warrior unhindered by compassion and driven to survive. Mikael Blomkvist, the ace reporter, one of the few friends that Salander has in the world whether she wants him or not, is leading the charge for Salander to be released. As he rattles the nerve of the Säpo (Swedish Intelligence Agency), in particular the part of the organization called The Section, he discovers a government that has sanctioned too much to protect too little. He has learned a lot about how far they are willing to go to protect themselves and deftly plays a cat and mouse game with them as he prepares his lawyer sister, Anika Giannini, to defend Salander at trial. I’ve noticed that some readers struggled with the investigative part of the novel as we see all the pieces being brought together by teams of people. Some working for Salander’s release and some working to make sure she never sees the light of day. I found it all very real, very interesting as if I were directly involved in the process. The trial is absolutely terrific. For whatever reason Larsson throws in a subplot involving Blomkvist’s long time lover and co-worker Grika Berger. She is being stalked by a someone who obviously has a deep loathing for her. Some of the aspects of this subplot were interesting, but it was totally unnecessary to the overall plot, unless we think of Larsson as a stage manager trying to give one of his favorite actresses a few more lines in the play. Salander has issues with authority, not surprising given how those in authority have routinely decided that she needed to be arrested, locked down in a psych ward, and disappeared altogether. Even without the bizarre circumstances that forced Salander to be an enemy of the state she would have struggled with anyone who wanted to tell her what to do. She could never be the demure little girl in pigtails sucking on a lollipop. She is a lesbian satanist. What? It is hard to tell which one of those words, concocted by her enemies was more alarming to them. She is certainly bi-sexual, uninhibited in sexaul matters. She is a hacker, a woman who can find out anything about anyone. She is nobody’s best friend, but it is better to be her friend than her enemy. As far as Satan is concerned, she would take his pitchfork away and impale him on his own hubris. \nHow to transform yourself into Lisbeth Salander. Black is your only color, your pale skin should never, ever be graced by sunlight, pierce yourself strategically all over your body, have one really cool tattoo, and keep the stone face of a Japanese samurai at all times. Your personality should always bristle with rolling tides of negative energy. Master these aspects and you are ready to intimidate the world. As I read this book I thought about why I, like so many others, find Salander such a compelling character. I’ve certainly never met anyone like her. She is unfriendly, like handling snarled barbed wire. She is instantly suspicious of anyone who offers to help her or any cause that would require commitment. She is a lone wolf, not opposed to giving pleasure, but unwilling to ever say the words that would take a moment of delight to a level of tenderness. She tortures you with silence. She bludgeons you with negative vibes. Her moods swing between tolerable and gloomy. Her smile is like a falling star, rare; and yet, beautiful. There is something wonderful in her ability to fight the odds, to survive, to defeat, to somehow make the right friends that are willing to fight for her when she can’t fight for herself. She does need help, as painful as that is for her, to push past the wall of silent contempt that she erects between her and authority. As it turns out her voice, her story had to be told.If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"Review": "“If love is liking someone an awful lot, then I suppose I'm in love with several people.”This book is utterly outstanding. The whole trilogy is. Just totally, absolutely wrecking and mindblowing.It's two years ago that I read The Girl Who Played with Fire, probably four since The Girl with the Dragon Tattoo. I wanted to read book 3 right after book 2, but I went abroad for a year and didn't find the time to read it. When I returned I shied away from the sheer size of this book: 850 pages. Whenever I encounter a book this huge, I think of all the other books I could read instead.After I finished All the Ugly and Wonderful Things (a book I can't recommend at all) I didn't know what to read next, but I was in the mood for a dark and twisted thriller or crime novel. And I finally decided to pick this one up.I never thought Millenium #3 would pull me in like this. I mean, I knew that book 1&2 were amazing, but as I said before, a few years had passed since I last read them.The characters alone are fantastic. While Blomkvist is a bit of a cliché, Salander is more than fascinating and the characters around these two have lots of depth. The size of the cast and the many POVs could easily be confusing, but Larsson gives them such shape and character that they are easily recognisable and very compelling. This whole book wouldn't work if it didn't have so many characters telling its story.The plot twists killed me (and not only me). The story is captivating enough, but Larsson manages to surprise and shock you again and again and you never ever see it coming. That's the point, I guess. But still, Stieg Larsson is fantastic.The writing has a few flaws. His dialogues, especially when there is lots of info-dumping, always go down the same way. At times, when his dialogues turn romantic, they turn cliché-like and slightly unrealistic. But I'm inclined to oversee that, especially when a book is as good as this one.It could have been a little darker and dramatic though. Most of the time I felt almost safe. Larsson could have had me more on edge. The main characters had too much power and too much evidence in their hands. I knew they would win, I never even doubted it, and a little doubt would have made this book even more exciting.Still, this book is perfect. I'm so excited to watch the movies now.Find more of my books on Instagram"}, {"Review": "After finishing The Girl Who Kicked the Hornet’s Nest, the last of the Millennium Trilogy by the late Stieg Larsson, I have a great desire to order a tray of sandwiches and coffee, fire up my 13 inch MacBook Pro, and order some Ikea furniture online. Larsson’s crisp, journalistic, almost report-like prose is endearing rather than tedious and just as after finishing the first two, I greatly lament his passing for the selfish reason of not being able to look forward to more of his work. This summed up the trilogy brilliantly, wrapped it all up. Larsson has created some characters that will live in world literature for some time. One aspect of this fiction that I can compare to our system in a positive light is that our statutory rules for involuntary committals require the testimony of two independent medical doctors. I was cringing throughout the final courtroom scenes as Swedish civil procedure is clearly very different from our rules, I kept waiting for an objection that never came. Still the cross examination of Teleborian by Jiannini was outstanding drama of the highest order. Some of the descriptions of the trial are stunning. This was so much more than a spy thriller, or a murder mystery or even a legal drama, this was a fascinating character study, psychological thriller and all the other genre specific labels rolled into one. Great book, great end to a very enjoyable series."}, {"Review": "Lisbeth Salander, we hardly knew ye.It seems like a particularly cruel joke that Steig Larsson died shortly after getting a deal to publish his Millennium Trilogy. Would he have continued on with these tales of Salander and journalist Mikeal Blomkvist if he would have lived? Unless the rumors are true about Larsson’s long-time girlfriend having a laptop with a fourth book saved on it stuck in a safety deposit box somewhere as she fights with his family over the cash cow this series has become, we gotta assume that this is the last we’ll see of Larsson’s dynamic duo. And it is a crying shame because Salander has quickly become one of my all-time favorite characters.This one picks up almost immediately after the events of The Girl Who Played With Fire, and I can’t say much about the plot without spoiling that one. (Anyone interested in this series should read them in order if at all possible.) As the title indicates, Salander started an almighty shit storm in the last book. The anti-social, brilliant, violent, revenge-driven hacker has managed to kick off a constitutional crisis that shocks the Swedish government to the very highest levels and threatens numerous deserving douche bags with exposure of past crimes. Atta girl, Lisbeth! Meanwhile, Blomkvist recruits a number of unlikely allies as he tries to save Lisbeth by publishing her true story as he plays a variety of dangerous cat-and-mouse games with the people trying to shut her up for good. Of course, his biggest headache will be convincing the pain-in-the-ass Salander to cooperate in trying to save herself.Oddly enough, each book in the trilogy reads like a different type of genre story. The Girl With The Dragon Tattoo is a traditional whodunit mystery with modern twists. The Girl Who Played With Fire was more of a fast-paced action thriller. And this one reads more like a legal suspense novel, including an incredible trial scene. There’s an overall arc to the three books with events from the first one not paying off until near the end of this one, but they have three distinct personalities.Despite being over 550 pages, it reads quickly, but it isn’t flawless. There’s a sub-plot with Blomkvist’s friend and sometime lover Erika Berger being the victim of a stalker as she struggles with a new job as a newspaper editor that seems out of place with the rest of the book. And there’s two other things holding this novel back. First is that the heart of the these books is the character of Salander. While Blomkvist and the supporting characters are all engaging enough, it’s Lisbeth that made these books a cut above the normal mystery/crime thrillers. But circumstances here keep Salander out of the main action for most of the story. It’s a shame that we didn’t get more of her in Larsson’s last book.Second, even though Salander and Blomkvist are the main characters, in the three books, they’ve only got to work together directly for about half of one novel. They get very few scenes together other than that, and that odd couple aspect was a great part of the first book and their unlikely friendship is a key driver to the plots of all three novels so it’s weird to realize that they spent more time apart than together.Despite these points, I still loved these books and their slightly off-beat structure. I only wish that Steig Larsson was alive and sitting in Sweden on a pile of money as he churned out more of these terrific thrillers"}, {"Review": "It seems to be unfair to rate the two first Millenium-novels by five stars and then give only three stars for the last one. On the other hand it is not fair to write two brilliant books and then publish a 600 pages long epilogue without much of a new story, either.600 pages look like a long story, but if you skip the 300 cups of coffees Micke and his friends make, stir and drink, if you skip the complete index of the Stockholm city-map and if you skip the subplot of Erika and her stalker (which yields nothing to the main story) it boils down to 250 pages at most.Some trivia questions you will answer completely wrong if you have not read this book:1. If you are in hospital and your father who wants to kill you lies in the room next to you, what would you do?a) Call the police/a friend/your lawyer for security.b) Keep quiet and arm yourself with a pencil.2. Imagine you are the most famous reporter in Sweden and you are after the biggest story of this otherwise story-free country. What would you do?a) Keep my mobile switched on in case something new happens or someone needs my help.b) Always switch it off so I have at least some rest when it’s dark outside.3. If you are a lawyer and you are in possession of a secret document which can destroy part of the secret service (and can save the freedom of your client), what would you do?a) I will put the only copy I have in my briefcase and take a walk.b) I copy it several times on my hard-drive, some CDs and my USB-stick and make some further printed copies before I take a walk.And: Where is Camilla?"}, {"Review": "Español - EnglishLisbeth no está muerta, pero esta gravemente herida con una bala en el cerebro. Esta interna en el mismo centro que otro paciente muy peligroso que la persigue, Zalachenko.Desde la cama y pese a su estado, usa sus habilidades informáticas para ayudar a Mikael en la investigación.Mikael sabe que no puede dejar la libertad y como se encuentra Lisbeth en manos del Estado, ya que sobre ella pesan graves acusaciones.Pero aun falta una persona mas detras de Lisbeth...----Lisbeth is not dead, but she is badly injured with a bullet in her brain. She is in the same center as another very dangerous patient who persecutes her, Zalachenko.From the bed and despite her condition, she uses her computer skills to help Mikael in the investigation.Mikael knows that he can't leave freedom and how Lisbeth is in the hands of the State, since serious accusations weigh heavily on her.But there is still one more person behind Lisbeth ..."}, {"Review": "Edited to include link to Nora Ephron's very funny piece (\"The Girl Who Fixed the Umlaut\") from The New Yorker:http://www.newyorker.com/humor/2010/0...\n  D E P R E S S I O N…\nYou’re probably depressed when, in the space of 3 or 4 weeks, you leave the house only when absolutely necessary, and read about 30 books – 90% of which are crap, including 15 books by Harlan Coben, a grade Z mystery writer. Even worse, you read Coben’s entire Myron Bolitar series, which is the equivalent of reading the same book nine times in a row. If you could survive it, shooting yourself in the head the same number of times might be more productive.Of course, this helps explain my initial hostility toward David Foster Wallace's title essay, “A Supposedly Fun Thing I’ll Never Do Again,” because—given the same assignment—I probably would have clocked just as many hours in cabin 1009, creeping out only to take far less brilliant potshots at the touristas. I get agoraphobia, and Wallace's coping strategies were just a little too familiar.Among this book wallow, I read The Girl Who Kicks the Hornet's Nest, having read Stieg Larsson’s first two books a couple months ago. Larsson’s third book is akin to re-watching a long movie, with a somewhat predictable and semi-satisfying ending. You know what’s going to happen, so it’s just a matter of letting it unfold. Unfold may be too kind a verb. I need a verb here that conveys time passing very slowly – a bit like Marvell’s description of time in the first third of “To His Coy Mistress” when the would-be lover muses on the possibility of according two hundred years apiece to properly adoring his mistress’s breasts.There’s really no way to spoil this book given that its outcome is pretty damn evident, but rather than provoke complaints I’ll provide some quiddity.\nThe Godfather I, II, and III\n: Forgive me for writing ill of the dead, but come on. I thought the Godfather was the male bible! You go to the mattress, you don’t sit with your back to a door, and you learn life’s lessons of violence, murder, and mayhem. For example, you figure out that if someone, like Lisbeth Salander, who can apparently do anything and makes Rambo look like an ineffective twinkie, is *theoretically* immobile you put a guard outside her hospital room, and YOU DON’T HAVE HER PATHOLOGICALLY WARPED & EQUALLY DANGEROUS FATHER TWO ROOMS AWAY. Did you learn nothing from these movies, Larsson?Sandwiches: To borrow from My Cousin Vinny, the bad news about cholesterol has not yet reached Sweden. They eat sandwiches – morning, noon, and night, and these aren’t ordinary sandwiches, but sandwiches that are serious contenders for KFC’s double down. Throughout the first two books, and for the first third of the last book, we get a steady array of sandwiches complete with descriptions of their ingredients. One sandwich – toast with orange marmalade, cheese, and avocado – sounded so interesting that it prompted one of my few ventures out of the house so that I could get the ingredients. As awful as it sounded, it’s good. ...The others, though. Gawd. Cheese is the primary ingredient. How about a nice sandwich of cheese, caviar, and a hard-boiled egg? Cheese and liver sausage? Cheese and pickles? Cheese and liver pate? However, the regularity with which the sandwiches surface seems to be a narrative crutch. Larsson hauls out the sandwiches whenever his characters need to ponder something ponderously. It also gives Kalle Blomkvist something to do when he’s not boinking the main characters.Despite the serious editing needs of the third book in particular, I enjoyed the trilogy. Lisbeth Salander is an interesting character, and her slim presence in the third book contributed to its sluggish pace.Larsson’s books are escapist literature to be sure, but a few steps up from Harlan Coben. 2.5 stars."}, {"Review": "This is the third (completed) novel of what Stieg had hoped would be a ten-volume opus. At the end of the last book, Lisbeth Salander had been shot by her evil and well-toasted natural father, a former Soviet spy who had been granted immunity in Sweden in return for handing over information. We pick up the story here as she arrives at an ER with several wounds, including a bullet wound to the head, with the bullets still inside. Don’t even try reading this if you have not read volumes 1 and 2. There are many references to characters from those tales, and one can easily get lost among the many, many named characters here. The first hundred pages or so of this book seemed to me a bit of catch-up exposition. But hey, the novel is 563 pps. A little expo won’t kill ya. Once the story gets rolling it is a locomotive, picking up steam with each chapter. There is a diversity of action and character focus. There are the usual bedroom shenanigans, although that seemed reduced this time around. Journalist Mikael Blomkvist joins with other investigators, public and private, to get to the bottom of why the dastardly Zalachenko was officially protected for so many years, and why Lisbeth Salander was forced to pay a harsh price for his existence. Will the baddies get their comeuppance? Will Lisbeth hack into your computer, maybe get herself a new tat? Although the underlying concerns are serious, secretive, autocratic tendencies in Swedish government, wide-ranging societal hostility towards women, this is a fast-paced and riveting legal and journalistic action yarn, a page turner, populated with a wide spectrum of interesting characters. Fasten your seat-belts. Enjoy the buzz."}, {"Review": "\n\nBook Review\n\n4+ of 5 stars to The Girl Who Kicked the Hornet's Nest, the third book in the trilogy written by Stieg Larsson shortly before he died. The series has been picked up by another author who's published book 4 and set to release number 5 later this year. This is my second favorite of the series, as nothing can compare to the first one, as it focused on family history and genealogy. Lisbeth is so tragic. And you want her to get revenge. And what happens to her over the course of a lifetime, let alone the last few years, is more than anyone one person should endure. No one ever should, but to inflict this on a single woman for no reason other than who her father is... awful, but it makes for intense and fantastic drama. This is a thriller of all thrillers. And when she's a victim and can't do anything to protect herself for a big piece of the time, it's a good thing she's made some friends along the way. These are not easy books to read... unparalleled violence, but an amazing pay off, assuming you are cool with getting exacting revenge in just the same violent, nasty ways. And I am, especially given what has previously happened to her. Larsson must plan his books for months... floating tons of ideas around his head, trying to decide the perfect moments to drag readers through every possible difficult moment, praying we can get satisfaction, and then... it finally happens, and you love it... but still want even more. Great series of books. Big fan of the work. Recommend to anyone who can take the brutality, sexual content and gore that comes with it.\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by. Note: All written content is my original creation and copyrighted to me, but the graphics and images were linked from other sites and belong to them. Many thanks to their original creators.[polldaddy poll=9729544][polldaddy poll=9719251]"}, {"Review": "I didn't like the second volume of the trilogy as much as the first, so I was initially wary about this book. But after the first few chapters, I was reassured. Despite some obviously implausible elements (even in Sweden, would you really keep two people who had tried to kill each other on the same corridor at a hospital?) it is extremely gripping and well-written.Having now finished the book, I can confirm that, although it's not quite as good as the first one, it is indeed a fine end to the series. It's a little difficult to give detailed comments without creating spoilers, since the plot has numerous excellent surprises which it would be a shame to reveal. So keeping to generalities, here are some of the things I particularly liked. First, his psychology is interesting and plausible. All the main characters come across as real people, and the emotions they feel for each other develop in a plausible way. Second, he is very good at describing everyday conflict in the early 21st century Western world, where it mostly depends on being able to navigate the bureaucratic jungle and the Web. Yes, there is hand-to-hand fighting, and this is OK too, but it's much more fun to see how someone takes care of a complicated legal problem, or a colleague at work that they don't get on with, or a series of offensive emails. Last and not least, he is really and truly not afraid of strong women. Lisbeth, Erika, Monica and Annika are all credible, tough chicks, who are in many ways stronger than the men, but without thereby becoming caricatures. If you like books about alpha females (Jordan, are you reading this? :) then get started on Stieg Larsson!_____________________________________I was having an offline conversation with Moira about Lisbeth Salander. She complained that no one loved Lisbeth, and I replied that I loved her even more after hearing all those dismissive comments - that was the point, wasn't it?Then, a few minutes ago, I was struck by one of those thoughts that really make you wonder why you haven't had them months earlier. Of course, Lisbeth is a Christ figure! That's why it's completely natural that hearing people revile her only strengthens my love and admiration. It couldn't be more obvious, in retrospect. She even rises from the dead.But why have so few other people made this connection? A quick search on Google turned up nothing. Was every one else fooled, just as I was, by superficialities like her being an autistic-spectrum bisexual female hacker who's seriously into violence and covered in tattoos and piercings? I can accept that I'm that shallow, but surely other people aren't? I'd like to think so, anyway. Probably I'm just sleepy, and my internet search skills have temporarily deserted me. I'm sure Lisbeth would already have found several dozen hits._____________________________________I was struck by the following passage from Flaubert's La Tentation de Saint Antoine, which I'm currently reading. Anthony is being tempted by the mysterious Ennoia:Innocent comme le Christ, qui est mort pour les hommes, elle s'est dévouée pour les femmes. Car l'impuissance de Jéhovah se démontre par la transgression d'Adam, et il faut secouer la vielle loi, antipathique à l'ordre des chose.(Innocent as Christ, who died for all men, she cares for women. Now the impotence of Jehovah has been revealed by Adam's sin, and we must shake the old law, hateful to the order of things).It does sum up my argument rather well. _____________________________________We've now watched the DVD. As with the first and second instalments, the atmosphere is perfect, and Noomi Rapace is fantastic as Lisbeth, but they have taken huge liberties with the story. Whole subplots have simply been removed. Mikael doesn't get involved with Monica, and Erika never moves to the other newspaper. In general, I was sad to see that Erika's role was so much reduced - she is one of my favourite characters in the books. I guess there just wasn't enough time to include everything. We'll never know what would have happened if they'd turned it into six films instead of three. Maybe it would have been too slow, and in fact they made the right decision...CORRECTION!My kind and wonderful friend Vivi alerted me to the existence of the long version (see comment #11). It finally arrived, and we watched the first half of Män Som Hatar Kvinnor last night. Well, I am already a total convert. Yes, a bit slow, but it's supposed to be slow - the theatrical version felt horribly rushed. Erika turns out to in be there after all. There is a really nice sexy scene with her and Mikael which perfectly reproduces the feel of the book. I'm afraid to say though that it's not yet clear you can get it with English subtitles. The DVD we watched only has them in Scandinavian languages. But I imagine it's just a matter of time before an English-subtitled edition is released._____________________________________Last night, we watched Lars von Trier's 2003 movie Dogville. I don't want to drop spoilers, but there are some interesting resonances with the Millennium trilogy; in particular, it's also possible to view Nicole Kidman's character as an unusual kind of female Christ figure, who, at least IMHO, has a certain amount in common with Salander. If you liked Millennium and haven't seen it, you may want to consider checking it out."}, {"Review": "Luftslottet som sprängdes = The girl who kicked the hornet's nest (millennium, #3), Stieg LarssonThe Girl Who Kicked the Hornets' Nest (original title in Swedish: Luftslottet som sprängdes, literally, the air castle that was blown up) is the third novel in the best-selling Millennium series by Swedish writer Stieg Larsson. It was published in Swedish in 2007; in English, in the UK, in October 2009; and in the US and Canada on 25 May 2010. The first three novels in the series, The Girl with the Dragon Tattoo (2005), The Girl Who Played with Fire (2006), and The Girl who Kicked the Hornets' Nest were written by Stieg Larsson before being shown to a publisher and were published posthumously after his fatal heart attack in 2004. Additionally, all three novels were adapted as films. The book begins as Lisbeth Salander is flown to Sahlgrenska Hospital. It picks up where The Girl Who Played with Fire left off.تاریخ نخستین خوانش: روز بیست و هفتم ماه جولای سال 2016 میلادیعنوان: دختری که با تبهکارها در‌افتاد - کتاب سوم؛ اثر: استیگ لارسون؛ برگردان: احمد نیازاده؛ نشر: تهران، نشر قطره، 1392؛ در ‏‫900 ص.‬، فروست: رمان داستان خارجی؛ شابک: 9786001197314؛ موضوع: داستانهای نویسندگان سوئدی سده 21 مدر رمان دختری که با تبهکارها درافتاد، دستگاه امنیتی سوئد و جریانی فاسد در آن مطرح است. دو شخصیت درگیر ماجرای پیچیده سازمانها و شرکتهایی میشوند، که به منافع ملی کشور خیانت میکنند. سازمانهایی مدیران نالایقی دارندآدمی باید خیلی بدشانس باشد که شهرت جهانی اش، و در پی آن ثروت کلانش، آنگاه به سراغش بیاید، که نه روی زمین، که زیر خاک خفته باشد. شهرتی که ربطی به مرگ طرف ندارد، و اگر زنده هم بود نصیب او میشد، و بدتر از همه اینکه، نوع زندگی و بی توجهی به سلامتی خویش، باعث مرگی زود هنگام شده، و فرصت یک زندگی متعارف را از او گرفته است. «استیگ لارسون»، یکی از همین بدشانسهای روزگار بودند. با زندگی نامرتبی که تنها در نوشتن خلاصه میشد. مثل یک خوره ی نوشتن، ساعتهای طولانی مشغول کار بوده، سه پاکت سیگار هم دود میکرده، و اغلب گرسنه که میشده با وجود اضافه وزن، پیتزای درست و درمانی نوش جان میکرده! دست آخر هم سر پنجاه سالگی، قلب او بی آنکه خبر دهد، دست صاحبش را توی پوست گردو گذاشت. هرچند هر آدم عاقلی، که «استیگ لارنس» را میدید، چنان آینده ای را به او گوشزد میکرد، اما کو گوش شنوا. چرا که او نه تنها در نوع ادبی، مرید «ریموند چندلر» بودند، در تخریب بدن خویش هم، به او اقتدا کرده بود، که به هرحال در این مورد هم حق استادش، به خوبی ادا شد. ایشان به داستانهای پلیسی، و به ویژه به آثار بزرگان این ژانر همانند: ریموند چندلر، دشیل هَمت و ... علاقه بسیار داشتند. روی جزئیات آنها تمرکز کرده، بارها آنها را خوانده، و مورد بررسی قرار داده بودند، و روی ساختار داستانهای گوناگون پلیسی جنایی، تسلط کامل داشتند. وقتی شروع به داستان نویسی کردند، شک نداشت، که رمانی پلیسی خواهند نوشت. هرچند برخلاف سنت مرسوم ادبیات پلیسی، با رویکردی فمینیستی، یکی از کلیدی ترین شخصیتهای رمانهایش را، که مایه های حادثه ای پررنگی هم داشت، به یک زن سپرد. ایشان طرح نوشتن ده جلد رمان را، در سر داشتند؛ اما تنها فرصت نوشتن سه رمان کامل: «دختری با خال کوبی اژدها»، «دختری که با آتش بازی کرد»، و «دختری که با تبهکارها درافتاد» (دختری که به لانه زنبورهای قرمز لگد زد)، و یک رمان ناتمام را پیدا کرد؛ رمانی که قرار شد توسط نویسنده ای دیگر، کامل شود. جالب اینکه در این زمینه نیز سرنوشتی همانند مرادش، «چندلر» کبیر داشتند. نوشتن سه رمان نخست که تمام شد، آنها را برای «پیرات فورلگت»، ناشری در سوئد، که به انتشار آثار پرفروش، شهره بوده فرستادند. ارزیابهای ناشر، بزرگترین خطای عمر خود را، با رد کردن رمانهایی مرتکب شدند، که انتشارشان رخدادی در ادبیات داستانی سوئد به شمار آمد. گویا این رخداد همزمان با مرگ ناگهانی «لارسون» بود، چون مدتی بعد این دوست او بود، که دستنوشته های «لارسن» را، که ظاهراً درست خوانده نشده بودند، پس گرفت، و به ناشری دیگر سپرد. با انتشار نخستین کتاب از این مجموعه، پیروزیهای «لارسون» آغاز، و لحظه به لحظه فراگیرتر شد. این رمانها، که به سه گانه ی: «هزاره»، نام آور شدند، با فروش سرسام آور، و رکوردشکن در سوئد، اروپا، و سراسر جهان، نام نویسنده اش را، سر زبانها انداختند. نویسنده ای مشهور، که دیگر نبودند! در سال 2008 میلادی، انجمن «داگر» برای گزینش برندگان بهترین اثر جنایی سال اروپا، برگزار شد، «استیگ لارسون» سوئدی، برای نوشتن رمان: «دختری با خال کوبی اژدها»، تنها نامزد دریافت جایزه بود، که در آن مراسم حضور نداشت. ‏ا. شربیانی"}, {"Review": "Sarah Null woke up at 8:00. She showered, dressed, and went into the kitchen. She made some coffee and sandwiches, then she went into the living room and sat in the armchair. She opened up her Sony Vaio laptop and checked her email. There were several emails from Meghan Fang and a few from the girls in her book club. The rest were mainly junk: email coupons and the like. It wasn't until after reading her email that she logged into Goodreads.com. She took a sip of her coffee and began to write her review.The preceding paragraph is exactly the kind of tedious detail which is written all throughout The Girl Who Kicked the Hornet's Nest. It may have been that way in the previous two books also; however, it did not bother me as much in those as it did in this one. I took to counting the number of times the characters had coffee and sandwiches -- an even dozen, in addition to all the other times when the author told us the other things his characters ate for dinner and the more than a dozen times they just drank coffee. I just don't care what a character has for dinner.The book picks up minutes after The Girl who Played with Fire leaves off, and while there are parts of it that are very fast-paced, there are many more parts that drag. Much of the plot is centered around a secret \"Section\" of the Swedish Secret Police. The reader is let in on the secret very early and the book is really more about watching the characters figure it out than about mystery or suspense. The lengthy chapter where the history of the Section is explained to the reader is very boring and dry. I wonder if the flaws of this book were the result of two things: first, that Larsson was a journalist and not a novelist and therefore wrote way too many \"facts\" and, as I have said before, pointless details; and second, that he died before the book was published and therefore the books did not go through the same editing process that they would have had the author still been alive to rewrite. Among some of the things that could have been edited: the aforementioned chapter on the Section, the subplot in which Erika Berger has a stalker which has absolutely nothing to do whatsoever with the rest of the story and seemed to exist solely to give Berger something to do, and the romance between Mikael and a cop named Monica Figuerola. I have no problem with romantic subplots and love interests as a rule, but I do get annoyed when they seem to come out of nowhere and feel forced (when Mikael says he is falling in love with her, I wrote \"Really?\" in the margin).On the positive side, when the book stuck to the main plot and the action, it was much more enjoyable. But I think it would have been better as a 300-page book.Also: people in Sweden have weird sex lives."}, {"Review": "Goodbye, Stieg Larsson. I have only gotten to know your books more than eleven years after your untimely death, but they will continue to have a thought-provoking impact on me and my reading experiences.The \"Millennium\" series is one of the most famous Scandinavian thriller books, but only attained its status after the author's early death. While dealing with the disentanglement of a complex mystery, it can also be described as three novels full of social criticism, full of character studies and references and explanations referring to the Swedish polity. It is no easy job to find a plotline so intricate and tricky, where you would usually have to make notes on every little detail (which I didn't - but I can only advise you not to take my laziness as an example, because following each of the interspersed details will help you with understanding the story), and Stieg Larsson's books are most certainly not created for entertainment only - they keep their readers thinking, guessing and reading on.Stieg Larsson is by far not the best writer I've encountered up to now. On the contrary, his writing style is quite lame and lacks any emotional connection to the characters; most of the time, he simply lists up their activities and does not waste too much time on following their thoughts. Larsson constantly switches between attempting to get into his protagonists' heads and returning to his comfortable viewpoint of the omniscient narrator (the latter for about 90% of the time). And yet, his characters are so complex and well-developed, and I can't help but feel for them. How does he do this? His style couldn't be more clinical, and yet there are so many characters I caught myself rooting for, so many characters I learned to know well during the course of these books. My guess is that it is the way he introduces us to every aspect of their life. Having to read about a character buying furniture for five pages can be annoying, but it also allows us to escort the characters through their entire lives. It's (at least partly) the daily routine implemented into the complex plot which makes these books so appealing to me, because all of the characters have jobs to do, work to handle, and are bothered by everyday problems, and that's what makes them so realistic.One of the biggest issues I have with the \"Millennium\" series is the number of cast members. Only referring to the third book, there were 37 characters who affected the plot more or less significantly, and it didn't help that Stieg Larsson named three of his characters 'Monica' or 'Monika', two of them 'Sonny' and two of them 'Anders'. Fortunately, he often falls into the habit of referring to a character by his surname, which is usually alienating, but here it helps with retaining an overview on the different players.There is no need to summarize this book's plot for you. If you are reading this review, then you probably have also read The Girl with the Dragon Tattoo and The Girl Who Played with Fire, and if you haven't, you are strongly advised to consider doing so. In the very beginning, the \"Millennium\" series might seem like an ordinary crime trilogy, but during the course of the story, it turns out that these books are so much more than that. I did not like every choice Stieg Larsson made, I did not even like all the books. Sometimes I dozed off because of reading it, sometimes I couldn't to go to sleep because of reading it. These books are definitely not for everyone, but they are worth giving them a try. If only because of Lisbeth Salander, who must be one of the most complex and extensively developed characters of contemporary literature. Lisbeth, an excellent hacker with a unique appearance, is stamped as being socially incompetent, unintelligent and a danger to herself and the entirety of Sweden. Only a few people know that Lisbeth is the exact opposite - she only wants to live in neutrality and peace, is highly intelligent, and if anyone had to endure what has been done to Lisbeth, he would be glad of being only 'socially incompetent'. One of the best examples of strong female human beings, Lisbeth has become one of my favorite characters of all time, and that's perhaps the strongest reason for why I enjoyed most of the \"Millennium\" series so much.\nThe other books in the \"Millennium\" series by Stieg Larsson:\nThe Girl with the Dragon Tattoo: my reviewThe Girl Who Played with Fire: my review"}, {"Review": "Τρίτο και τελευταίο βιβλίο που έγραψε ο αδικοχαμένος Στιγκ Λάρσον πριν από 10 και βάλε χρόνια (πότε πέρασαν καλέ, πφφφ γερνάμε!), το οποίο συνεχίζεται από εκεί ακριβώς που τελείωσε το δεύτερο μέρος. Παρόλο που το πρώτο βιβλίο είναι αυτόνομο, όπου εισαγόμαστε στο Millennium και τους βασικούς ήρωες, τα επόμενα δύο είναι αλληλένδετα. Ευτυχώς, η ιστορία κλείνει, γιατί ο συγγραφέας πέθανε ξαφνικά από ανακοπή χωρίς να έχει επίσημα παραδώσει κάποια συνέχεια. Για όσους δεν γνωρίζουν τα παρελκόμενα της σειράς (που είναι περισσότερα από την ίδια τη σειρά): Ο Λάρσον είχε σκοπό να γράψει πολλά βιβλία από τη σειρά Millennium και λίγες μέρες πριν το θάνατό του είχε παραδώσει τα 3 πρώτα βιβλία προς έγκριση στον εκδοτικό οίκο. Δεν είδε τίποτα τυπωμένο προτού πεθάνει, δεν ξέρω καν αν έμαθε πως η σειρά του εγκρίθηκε (παίζει να πέθανε λίγες μέρες μετά την υπογραφή των συμβολαίων, αλλά δεν παίρνω κι όρκο). Έτσι, όλο το έργο του εκδόθηκε μετά θάνατον. Το μείζον θέμα που προέκυψε είναι ότι τα δικαιώματα των βιβλίων εκμεταλλεύτηκαν οι απομακρυσμένοι από αυτόν πατέρας και αδελφός του και όχι η συμβία του, καθώς δεν ήταν παντρεμένοι για λόγους που είχαν σχέση με τη δράση του Λάρσον ενάντια σε νεοναζιστικές οργανώσεις και τις απειλές που δεχόταν από αυτούς, αλλά δεν ήθελε να μεταφέρει και στη σύντροφό του (αλήθεια, δεν υπήρχε το σύμφωνο συμβίωσης τότε στη Σουηδία;). Σε κάθε περίπτωση, οι συγγενείς με τους οποίους είχε να μιλήσει 20 χρόνια έγιναν εκατομμυριούχοι, ενώ η επί 30κονταετίας σύντροφος και σύμβουλός του κατά την έρευνα των βιβλίων (είχε δράση σε γυναικείες οργανώσεις, θέματα που διαχέονται διαρκώς στη σειρά) πήρε τα απαυτά της (όχι, δεν τις έδωσαν δεκάρα ούτε από τις πωλήσεις ούτε από τα δικαιώματα για ταινίες. Για το λόγο αυτό εγώ δεν πρόκειται ποτέ να αγοράσω τα βιβλία παρά τα δανείστηκα από τη βιβλιοθήκη, ίσως τα αγοράσω κάποτε second hand).Σε κάθε περίπτωση, το βιβλίο είναι ένα πολιτικό – κοινωνικό – οικονομικό – δικαστικό θρίλερ, που εμπλέκει την αντικατασκοπία, τη μυστική αστυνομία, την κανονική αστυνομία, δημοσιογράφους, χάκερ, σεκιουριτάδες, κρατικούς και κοινωνικούς λειτουργούς, προκειμένου να επιλύσουν το πρόβλημα που ενέκυψε με τον πατέρα της Λίσμπεθ Σαλάντερ στο δεύτερο βιβλίο, ενάντια σε μια καλά οργανωμένη σκευωρία. Εδώ δεν ασχολούνται με το οργανωμένο έγκλημα, αλλά με κρατικά μυστικά και κρυφές υπηρεσίες που δημιουργούν προβλήματα, καταπατούν δικαιώματα πολιτών και δεν διστάζουν ακόμα και μπροστά στο φόνο. Στα τρία του βιβλία, επομένως, ο Λάρσον βγάζει στο φως όλα τα ψεγάδια της Σουηδικής κοινωνίας – οικονομικά εγκλήματα στο πρώτο, τράφικιγκ στο δεύτερο, Ασφάλεια στο τρίτο. Εντύπωση μου προκάλεσε η ενδοοικογενειακή βία που ασκείται στη Σουηδία και ο μισογυνισμός πολλών – κατά τα άλλα προοδευτικών – Σουηδών. Εκτός από τις παλαιότερες γνωστές ιστορίες της σειράς, ακόμα και σε αυτό το βιβλίο η Έρικα Μπέργκερ βρίσκεται κάποια στιγμή σε ένα χώρο εργασίας όπου σε ανώτερες θέσεις δεν υπάρχουν γυναίκες, ενώ οι άνδρες – συνάδελφοι της κάνουν για κάποιο διάστημα το βίο αβίωτο με σεξιστικά σχόλια. Όμως, η μεγάλη διαφορά της Σουηδίας από πχ την Ελλάδα, είναι ότι οι «κακοί» πληρώνουν παραδειγματικά για όσα έκαναν και διασύρονται στις τηλεοράσεις και τα μέσα. Διεφθαρμένοι άνθρωποι υπάρχουν παντού, το κράτος όμως εκεί δεν είναι διεφθαρμένο και κάθε φορά που ξεσπάει ένα σκάνδαλο πληρώνουν όλοι οι εμπλεκόμενοι. Στην Ελλάδα, αντίθετα, αν τα πράγματα είναι «πολύ ζόρικα» θα πληρώσει ένας και αυτός συνήθως θα σφαγιαστεί με το … βαμβάκι (λες και μόνος του τα οργάνωνε όλα). Τελοσπάντων, ωραία θα ήταν να είχαμε έναν Έλληνα Λάρσον να γράφει για τα κακώς κείμενα, αλλά πολύ φοβάμαι ότι είτε θα τον είχαν σκοτώσει (πχ Γκιόλιας) είτε θα είχε κοματοποιηθεί και θα γινόταν πρόβατο κι αυτός (πχ άστο καλύτερα). Κρίμα πάντως που και ο ίδιος ο Λάρσον πέθανε, θα είχαμε δει πολλά περισσότερα από αυτόν. Μέσα στα γενικά κουτσομπολιά που είχα διαβάσει, κάπου αναφερόταν ότι η σύντροφός του στον κοινό τους υπολογιστή έχει σχεδόν έτοιμο το 4ο βιβλίο και πολλές σημειώσεις για το 5ο, αλλά δεν θέλει να τα εκδώσει από σεβασμό στη μνήμη του (διαφωνώ, αλλά δεν με ρώτησε!). Από την άλλη, ο πατέρας και ο αδελφός του προσέλαβαν έναν τύπο να γράψει τη συνέχεια, η οποία κυκλοφόρησε πέρυσι. Δεν ξέρω αν θα ήθελα να τη διαβάσω, εφόσον δεν είναι η συνέχεια του Λάρσον για τους ήρωες που αυτός δημιούργησε. Όποιος θέλει να σχολιάσουμε είτε για τα κουτσομπολιά της οικογένειας του Λάρσον και τη συνέχεια των βιβλίων είτε για οποιοδήποτε από τα μηνύματα που μας περνά ο συγγραφέας, καλοδεχούμενα τα σχόλια!"}, {"Review": "I find this entire series very unenjoyable, but I appreciated what I felt were academic analyses of consent and power in the first two books. Because this third installment failed to present any academic point, there was really nothing for me here. The attempt was clearly to say something about how, traditionally, women have actually fought in wars, not stayed on the sidelines fainting and tending to wounds like, I don't know, some people expect, but really the story was more about how cool women want to be BFFs with Blomkvist and have sex with him. I didn’t really get anything out of the interjections about the Amazons, which appeared at different intervals throughout this book. And I don’t happen to care about who wants to have sex with Blomkvist – I find Blomkvist abominable – so this was terrible. I know that all of the books have been about how the chicks dig Blomkvist, but they also offered something smart and academic that this one lacked.The other thing up in this ol’ book was that just about every five pages this conversation would happen:“Remember how awesome book 2 was?”“Yeah, that was so cool. We were so badass. Remember how you were all Aaaaaack, and I was like neeeeeeer, and then it was like whoooooaaaa, and bang bang?”“Yeah, then my favorite part was like hacking computers and taking down the system.”“Totally. And it was like, mystery guys and punching and guns and stuff.”“Do you think the prime minister knows how cool book 2 was?”“We should definitely tell him. And we should tell like chiefs of police and ambassadors and other important people.”And then everyone goes off to describe book 2 to important people, and they all have that conversation OVER AND OVER. Like, whoa, dudes. You are so cool. But mostly Blomkvist is cool because badass warrior chicks want to have sex with him and it doesn’t even bother him that they are stronger and smarter than him. Yeah, what a man. Big pat on the back from this corner that you’re not offended that women are cool. His fucking humility is really why he’s so fucking cool. What a douche.And Lisbeth Salander is hanging out in bed this entire book. And then, in the end, there’s a “trial,” where they re-tell book 2 for the eleventy millionth time, and there is ONE hearsay objection, which happens basically the ONLY time a statement isn’t hearsay throughout the entire “trial.” And after the objection, no one reacts, the judge doesn’t rule on it, and the questioning just continues like nothing happened. I object to that. Here’s the thing about the crappy trial: I know that Larsson has the capacity to do research and not be a total moron about technical matters, so there’s really no excuse for what goes down there. And it was so out of control that it was painful to read. Not that ALL OF THE REST OF THIS SERIES wasn’t, also, COMPLETELY PAINFUL to read, but at least most of it wasn’t stupid. This was stupid. My Cousin Vinny and Legally Blonde do a better job at adhering to trial practice rules, AND are more entertaining.Ugh, and then there’s this tacked on ending-ending where Lisbeth goes to Blomkvist’s house to make up and be BFFs again (or he goes to her house, I can’t even remember). And they make up, awwwwww. Whew, too, because that was what I was really worried about in this book about slavery, rape, and oppression. I was REALLY fucking worried that one of these women wouldn’t want to be Blomkvist’s friend. Because that’s what rape and slavery stories are mostly about: douchey guys getting the hugs they deserve.This sucked. I hate all of these idiot people. I’m so glad it’s over."}, {"Review": "E, pa svaka čast Larssonu! Toliko likova, toliko događaja, toliko zavrzlama koje su na kraju savršeno povezane i razvezane! Pisca nema već više od 12 godina, ali pali i žari i dalje! Sigurna sam da je ponosan! ;)Obavezno čitati redom, ali rekla bih i u kratkom razmaku kako bi se kvalitetno pratila radnja. Bila sam \"u strahu\" da mi se trilogija neće svidjeti jer je svima savršena, ali ispalo je da sam i ja u tom klubu! ;)Na kraju bih dodala da se isplati pogledati i švedska ekranizacija trilogije. Glumca više nema, no iza sebe je ostavio kvalitetan opus."}, {"Review": "This is the third book in the Millenium trilogy, and - thankfully - the last, because my hands were starting to feel a bit shaky after supporting these five centimeter thick book whenever I went around in a quest to find the most comfortable spot in the apartment without being bugged by my too enthusiastic budgies.Sadly, I couldn't say the same praise toward this one as I did to the previous two books. To begin with, I'd say this book is a must read, well if you want to know the ending of the whole thing of course because book number 2 ends with a hanging situation that usually appeared on TV series with the words \"to be continued\" displayed on the screen.Book 3 is full of conspiracy theory, intricated problems between the Swedish secret police and the government and it is fully loaded with history of Sweden - in which I have no clue whether it is accurate or it is just pure fiction. But then again, I have always hated history subject in school so perhaps this book can be particularly interesting for those who love history.The book also tells the story on how Lisbeth Salander (that's the girl with the dragon tattoo, folks - now I begin to see the sense why naming the first book according to her body painting - because the whole millenium trilogy is indeed about her) got entangled in a much complicated situation that she had ever imagined in her life (I could only say that she's pretty lucky that she's smart, strong and brave and could figure out things by herself, if I were her, I would just act dumb the whole time LOL) and how her family tree had brought terrible misfortunes over her situation ever since she was a child until now.I must admit that I practiced my \"fast reading\" method on several pages of this book (skimming the page through) because they were far too boring - and not worth to spend my time on reading them) and skipped onto the more intense story like how Blomkvist collected pieces by pieces of Salander's past in order to build a complete portrait on who Salander's mysterious father was and how it all started - and at the same time trying to avoid rogue criminals trying to shoot his ass off for his intention to publish the whole mystery in a book.The ending, however, is satisfying. It's like the ultimate \"bad-guys-go-to-jail\" stuff and although I am far from a fan of happy ending, I find that the ending is just relieving, to know that things will finally be normal from now on, and Blomkvist - the journalist, that is - has to work his ass off again for a scoop (scoop: a term in journalism on an interesting subject that nobody knows, yet).Let's say that your sleep won't be good unless you finish your reading with this last one. So why stop here if you have read the first two? Go grab the third book! "}, {"Review": "I also reviewed this book on my blog if you'd be so kind as to check it out! https://thatgirlbookworm.wordpress.co...You can also buy a copy of this book here!3 or 3.5. I still am undecided. My heart tells me 3.5 but my mind tells me 3 stars.So before I start my review I want to say that this trilogy is amazing! It's a 5 star trilogy and well worth reading. My rating for this book and my following review do not in any way denounce this trilogy, I will recommend it until I die and it is definitely a top book of 2016.My second before I start is that I enjoyed this book. I want to say that before I get into my review because I think my review will be largely negative but I do want to state to start I DID like this book. So here's the thing with this book, it was BORING. Like okay so it continues exactly to the minute where book 2 cut off and I loved that and I am glad the author decided to focus this book entirely on the topics he did. But there was so much in this I had to slog through. It took me nearly a month to read this because I read other books and had no interest in this at times. I did find this happened in book 2 as well but wow this was rough. The first 400 pages consisted primarily of Swedish government intel and that just was not for me. The last 300 pages the action started and I really got into it and there was a section near the end I just COULDNT stop reading. (view spoiler)[the absolute BEST part of this book was the court scene when Giannini was cross examining Teleborian. The best thing I've read in ages I was literally reading going SLAY GIRL because it was so fantastic. (hide spoiler)]Now, I was going to give this 4 stars. I liked the conclusion of the story and while it was boring it was still good. But I gave it 3/3.5 stars because of the characters. The characters were just as amazing as they were in the first 2 books but I feel like Larsson sacrificed them for plot. Now, granted, he had I think 6 books planned but sadly passed away after the third so MAYBE he was going to fix this, but I was extremely disappointed with what I had left of the characters at the end of the story.---A couple spoilers incoming now---We had 0 conclusions to any of the character's stories. Salander and Mikael were my two FAVOURITE characters of life and I secretly wished for them to have a happily ever after. Together. But instead I got a barely existing friendship. After the events of the last two books where they didn't see each other a SINGLE time (except like 2 minor interactions in the last 50 pages) I was so let down. I just don't see why Larsson sacrificed what they had like that and threw it away. Blomkvist had chemistry with TWO characters in this series, Berger and Salander. I do not like that he ended up with Figeurola and honestly that's pretty much the entire reason that I gave this 3 stars. I dislike the crappy way the characters story ARCs were done and Blomkvist ended up falling in INSTALOVE with some random character introduced to us on page 500/746. So I just didn't appreciate that. Honestly, I had no plans to read book 4, but I honestly hope this random author ends up salvaging some of the respect I had for Blomkvist and repairing the relationship between the two leads.Also not to mention that none of the characters got any sort of closure, but I will assume this has to do with the passing of the author before the series was complete. So I mean overall I DID enjoy this book but I had some very prominent problems. I am going to stand by my decision to call this a trilogy until I read book 4 and see how it fits into the series."}, {"Review": "I really enjoyed “The Girl with the Dragon Tattoo,” which not only succeeded as an exciting thriller but contained elements of interesting characterization and relationship intrigue. Unfortunately, the Millennium series does not appear to be one which improves upon further acquaintance. “The Girl who Played with Fire” was an adequate thriller but not great, and “The Girl who Kicked the Hornet’s Nest” was just plain disappointing, not to mention way too long. 743 pages?!? I wanted to put it down at several different points, but kept plodding forward just to see if it would improve. At some points I actually wondered whether Stieg Larsson really wrote this, or whether some anonymous editor ghostwrote it just to keep the Dragon Tattoo gravy train going.This final book in the series opens with both Salander and her evil father, Zalachenko, seriously wounded but not dead. Salander spends most of the book convalescing in the hospital and awaiting transfer to prison upon her recovery; she still manages to outsmart the bad guys here and there but her antics in this book are less frequent and a pale shadow of the prequels' action. Readers whose loyalty to the series centers around Salander will not find much to love here.Aside from Salander’s waiting game, we observe a long series of meetings among the bad guys (Zalachenko’s protectors and those who want Salander falsely declared mentally incompetent – again), the good guys (Blomkvist, of course, and a bevy of powerful babes), and the not-evil-per-se-but-out-for-themselves guys, a.k.a. the Swedish government. Blomkvist, ever the daring crusader, has the Swedish prime minister quaking in his boots as he threatens to expose past constitutional wrongs. This leads to some unlikely cooperation between Blomkvist and some pretty powerful people, which required much suspension of disbelief. Another subplot centers around Erika Berger’s new job and some mysterious harassment she receives there. Yawn. All of this eventually (read: after about 600 pages or so) leads up to Salander’s trial, where she stands to be punished for defending herself against the bad guys in the last book, and possibly declared mentally incompetent. The trial is the only part of the book that’s remotely interesting. Unfortunately, the denouement afterward proves nearly as boring as the rest of the book.I’m still giving it two stars, because I guess I’m doggedly loyal to the series for some reason. Honestly, though, I would only recommend it if you’re really dying to know the rest of the story, in which case I would suggest you just read the last 150 pages or so."}], "Genre": "Crime", "ID": "6892870", "Desc": ""}