{"Name": "The Stranger Diaries", "Image": "https://images.gr-assets.com/books/1532738769l/40796097.jpg", "Reviews": [{"Review": "Elly Griffiths writes the perfect October read with this contemporary take on the Victorian Gothic novel set on the Sussex coast. Attractive Clare Cassidy is a divorced English teacher with a 15 year old daughter, Georgia, teaching at local comprehensive school, Talgarth High, where there is a building that Roland Montgomery Holland, a reclusive Victorian writer lived, a man famous for a short story titled The Stranger. Clare is writing a biography of RM Holland and is interested in the death of his wife, Alice Avery, rumoured to have fallen to her death, and his mysterious daughter, Mariana, about whom virtually nothing is known. Alice's ghost is said to haunt the school, and if seen, is said to foreshadow a death. Clare's best friend and colleague, Ella Elphick, is found murdered with a note that is a quote from The Stranger 'Hell is empty'. In a narrative delivered by three female voices, Clare, Georgia and DS Harbinder Kaur, aspects of The Stranger are interspersed throughout the novel, as creepy and menacing echoes of the Victorian story are to be found in a series of murders in the present.Ella was a well liked member of the English department and the entire school is shocked by her death. The police investigation is led by DS Kaur who attended Talgarth High as a pupil and her experiences of the school pepper the story. Clare is less than forthcoming to Kaur about the intrigue in the department and Ella, but then events take a sinister turn and more murders take place. Clare has been a long term keeper of personal diaries documenting her inner thoughts and events in her life. She is left afraid and unsettled when she discovers someone else has written in her diary at which point she hands her journals to Kaur who finds them revealing of Clare, and the truth of Ella's character and personal life. Clare thinks she knows her daughter, Georgie, rather well, but there is much that Georgia keep secret, including her attendance of a creative writing course run by Bryony Hughes, known as a white witch. In the meantime, Clare finds a romantic interest in Cambridge academic, Henry Hamilton, who has unearthed further information on RM Holland.Elly Griffiths always writes compelling stories with gripping characters and this is no different. There is plenty of atmosphere of the ghostly and menacing kind along with that of the location with its dense sea mists and abandoned warehouses. Whilst Clare was of less interest to me as a person, I loved her daughter, Georgie, with her much older boyfriend, the dog, Herbert, and the gay DS Harbinder Kaur is a person I would definitely like to meet again with her wit, her family, her mum that waits up for her and cooks such fabulous food. This is a great read for this time of year with Halloween approaching. I found it an enthralling read which I recommend highly. Many thanks to Quercus for an ARC."}, {"Review": "The Stranger Diaries has the elements of a police procedural, gothic mystery, and possibly a haunting. Yes! Yes! & Yes! Clare Cassidy is a well respected English teacher. Divorced, she lives with her daughter, Georgie, and her adorable pup, Herbert. (I love Herbert!!!) Her best friend and fellow English teacher, Ella, has been discovered murdered and covered in stab wounds. A note lay beside her reading \"Hell is Empty\". A book within a book. Clare teaches a class on R.M. Holland's horror novella, The Stranger. She also works at a school in which he once lived many years previous. She is currently writing a book about the mysterious death of his wife, Alice, who apparently haunts the halls of the school. When another English teacher is found dead the detectives decide they need to take a closer look at everyone in the school, students and teachers alike, and it appears that everyone has secrets. When Clare discovers that someone else has written in her private and personal diary her fear is that she will be the next victim. \n\"HALLO, CLARE. YOU DON'T KNOW ME.\"\n Is there really a murderer or is something more ghostly happening here? I thought this was an incredibly well written mystery without being too dark or gruesome. I believe this will appeal to a much larger audience because of that. People that are easily triggered shouldn't have any problems. The books resolution may have been its one downfall as I didn't like how it all wrapped up. Still I enjoyed the heck out of reading this and wouldn't hesitate to pick up another book by this author because she can definitely spin a tale. 3.5 stars but I'm rounding up for Herbert because dogs are better than people - except for my fellow Goodreaders of course! ;) Thank you to Edelweiss and Houghton Mifflin Harcourt for providing me with a digital ARC in exchange for an honest review."}, {"Review": "\nAn absorbing and unsettling contemporary thriller that mirrors a gothic tale~\nSome elements I loved~\t1. There is a gothic Victorian book placed inside the main story. ooh...book inside a book.\t2. Several points of view.\t3. The mixture of modern and old school.\t4. Police procedural mixed with the creepiness of the setting.\t5. A quirky female detective with a sharp eye for inconsistencies. (She was my fave)\t6. The setting of a \"haunted\" school.If your craving something a little different from your standard thriller, this one has a lot to offer. I was absorbed in the story and it has \"just enough\" creepiness without being gruesome or overly graphic.I loved how the author brought in the gothic feeling by using a book inside of the story that would hold answers to the mystery.I found it atmospheric, entertaining, and unique.Thanks to NG for my copy to read/review."}, {"Review": "Heavy draperied rooms, long winding staircases, and imposing carved wooden doors lend themselves to a Victorian Gothic panoramic view. Elly Griffiths sets this treasure box of a story within the walls of Talgarth Academy in Sussex. There's an array of buildings that stretch across the campus including the Old Building that houses the original effects of the writer, R.M. Holland. Holland lived there with his wife, Alice, and an elusive daughter, Mariana. According to legend, no one knows what happened to Mariana. Alice, dear Alice, was to have taken a tumble down the lush staircase and never recovered. Students claim to have seen a white mist floating at times with a definite chill in the air. An immediate death was to occur after the sighting like clockwork.We're introduced to Clare Cassidy, a literature teacher, who is smitten with The Stranger by Holland and implements the story into her classes. She is presently writing her own book on Holland's peculiar life and career and wishes to find out what happened to Mariana. Georgie, her fifteen year old daughter, resides with Clare off campus and attends the Academy. Clare has been divorced from her husband, Simon, for the past two years. Clare has no idea of what murderous intent will be assigned on this semester's syllabus.A sudden pounding on Clare's front door marks the arrival of tragic news. Ella, best friend and co-worker, has been stabbed to death in her own cottage. DS Harbinder Kaur is lead investigator. Griffiths has created quite the multi-faceted character here. Kaur is bright, witty, and highly analytical by nature. Her backstory is layered with interesting detail and the reader is drawn in immediately. It's my hope that Elly Griffiths brings Kaur back front and center in another book.The story weaver lines up many threads throughout with inserts of The Stranger between chapters and references to The Woman in White. Pay attention to the Shakespearean quote from The Tempest: \"Hell is empty and all the devils are here.\" A luscious literature stew simmering on a burner of mystery told in revolving chapters by the main characters. Truly a classic who-done-it with all the trimmings.I received a copy of The Stranger Diaries through NetGalley for an honest review. My thanks to the talented Elly Griffiths and to Quercus Books for the opportunity."}, {"Review": "Clare Cassidy, divorcee with 15 year old daughter Georgia, had moved from London to West Sussex, having accepted a position teaching English at Talgarth High School. Clare and Georgia now reside in an isolated house near an abandoned factory. Clare maintains a diary reflecting her innermost thoughts. Additionally, she shares her feelings with rescue dog, Herbert. After all, a dog will not judge his owner! Clare is thrilled that author R.M. Holland, the writer of a gothic ghost story called \"The Stranger\", formerly resided at the Annex of Talgarth HS.Talgarth was comprised of a New Building where most student life took place and an Old Building (once called Holland House). The attic was R.M.Holland's study until 1902. Clare, as resident Holland expert, had a key allowing her access to the attic. She planned to write the first ever biography of the reclusive author of \"The Stranger\". Perhaps she could investigate the death of Holland's wife, Alice. Was Holland House haunted by \"a woman in a white nightdress floating down the stairs?... If you see her, is a death imminent?\" It started with the death of Ella Ephick, Clare Cassidy's friend and colleague. A troubling note beside the body contained a quote from \"The Stranger\"...\"Hell is empty\". DS Harbinder Kaur,a Talgarth graduate, and DS Neil Winston are brought in to investigate. Harbinder is convinced that the murder is not random. She visits Talgarth HS ... \"I just want to imagine Ella here\".The impact of Ella's murder and the events following are seen through the eyes and perspective of three distinct characters: Clare, daughter Georgie, and Harbinder. Clare and Georgie's lives are additionally compromised when Clare finds several strange handwritten entries in her personal diary. Could the killer have left his/her calling card?\"The Stranger Diaries\" by Elly Griffiths was a suspenseful literary novel like no other I have read. I enjoyed the literary references and the book within a book. Harbinder was my favorite protagonist. Perhaps she seemed crusty and distant but she had \"heart\". Dog lovers will be thoroughly entertained by the loving relationship between Herbert and his \"humans\". This stand-alone novel from Elly Griffiths is a gothic, police procedural I highly recommend.Thank you Houghton Mifflin Harcourt and Net Galley for the opportunity to read and review \"The Stranger Diaries\"."}, {"Review": "Although I was interested in the description of this novel, I was, initially, a little wary. I had tried Elly Griffiths popular Ruth Galloway series, and stalled with it. However, I am glad that I gave this a try, as I absolutely loved it and it has made me determined to go back and give Ruth Galloway another try.This is a clever, literary mystery, with an excellent cast of characters. Clare Cassidy is a divorced English teacher, living with teenage daughter, Georgie and working at Talgarth High. Although a modern secondary school, there is an Old Building, where Gothic author, R.M. Holland once worked. Indeed, his study remains, intact, at the top of the building and Clare is writing a book about him. However, when we meet her, her research has stalled and she is teaching a creative writing class in the holidays. When fellow English teacher, Elly Elphick, is murdered, it sends shock waves through the school. There is a quote left by the body and then messages are written in Clare’s private diary…I particularly enjoyed the characters in this novel. Spiky, assertive, D S Harbinder Kaur and her partner, Neil Winston, added an excellent dimension – so often in crime novels you have either interesting suspects, or interesting investigators, but this novel has both. There is also an engaging academic flavour, with Henry H. Hamilton, a Cambridge academic, contacting Clare about some possible information he has on R.M. Holland, and a rather creepy teacher, Bryony Hughes, who seems to see herself as a modern Miss Jean Brodie. Over-riding the story are snippets from R.M. Holland’s most famous story, which mirrors events in a very creepy way. A really good cast of possible suspects makes it hard for you to spot the killer and I enjoyed Clare’s diary snippets too – as well as those of Georgie. Diary writing might be a dying art, but hopefully Elly Griffiths will persuade some readers to take up their pen. Overall, I loved this and I particularly hope that D S Kaur will appear in future books. I am now, most definitely, an Elly Griffiths convert! I received a copy of this book from the publisher, via NetGalley, for review. "}, {"Review": "The perfect blend of gothic horror, psychological suspense, and police procedural! ‘\"If you’ll permit me,” said the Stranger, “I’d like to tell you a story.”’As much as I love spooky old houses with a dark history, and possible ghosts sightings, a thought-to-be haunted house turned into a secondary school had me even more excited. The Old Building of Talgarth High, was once home to Victorian Horror writer R.M. Holland, best remembered for his horror-themed, scary short story, The Stranger. The top floor still houses his study, out-of-bounds to students, and eerily preserved just as he left it. The ghost of Holland’s wife, Alice, rumoured to have died tragically from a fall down the stairs, is said to haunt the corridors and classrooms of the lower floor, the belief being that if you see her, someone will die shortly thereafter…Not only is the school creepy, but so was the location of the protagonist, Clare’s, house – one of a row of townhouses in the middle of nowhere, initially built to house workers of the nearby cement factory – which now sits abandoned and derelict. As scary as I’ve made it out to be, this is neither gory, nor a horror story, but is largely modern day crime, mystery, psychological suspense, with a side of gothic foreboding, meaning that even those who don’t do horror would enjoy this. We were given three first person narrations;Clare Cassidy – An English teacher at Talgarth, single mum to Georgie, friend and fellow co-worker of Ella, currently working on a biography of R.M. Holland.DS Harbinder Kaur – The detective investigating the murder of one of the school’s English teachers, Ella Elphick, who was stabbed to death in her own home. Harbinder attended Talgarth as a student. Georgie Cassidy – Clare’s teenage daughter, current student at Talgarth.The POV’s were split into parts, with Clare voicing Part 1, Harbinder Part 2, you get the picture. Excerpts from The Stranger were included throughout, as well as pages from Clare’s diary. I warmed to all three characters early on, even though right from their introduction all of them came across as secretive, and not entirely trustworthy. I enjoyed the contrasting perspectives – teacher, student, detective/former student – and how they all had a connection to Talgarth. I alternated between the book and the audio version, and have to mention that Andrew Wincott’s over-the-top, dramatic reading of the gothic tale, The Stranger, is a must listen.Side Note: I was thrilled to bits when Claire’s dog, Herbert, was described as a white Hairy Maclary from Donaldson’s Dairy, the first in a series of children’s picture books penned by New Zealand author, Lynley Dodd. Ta-Dah! This is what he looks like, except white. Elly Griffiths totally killed it – every element fitted together seamlessly. One of my favourite reads for this year, and will undoubtedly make my top ten. Perfect for next Halloween, but why wait that long, cosy up by the fire with it this winter, or if like me, you are heading into summer, prioritise it as your next beach read. Move it to the top, or add it to your tbr, today! You won’t be sorry!"}, {"Review": "Elly Griffiths has woven together a tale of gothic suspense, psychological terror and marvelous detective work and thrown in a full measure of classical literature, all of which create a beautiful tapestry called The Stranger Diaries. Whew.If you think that opening line was a lot to absorb, just wait until you read the book. I’m still trying to untangle my mind from the who’s and who’s nots and what’s real and what’s not! For someone who had an imaginary playmate until she was 10 years old and still has a crush on Harry Bosch, whom I’ve been told is not a real person, trying to decipher a book within a book within a book written by fictional character written by an author with a nom de plume was a lot to comprehend. But, hand on heart, this book – The Stranger Diaries – was worth every single moment spent reading it. It is fantastic!The book opens with a line from “The Stranger,” a gothic short story written by RM Hammond, whom our main character, Clare, is studying in hopes of writing a book about his life and works.“If you’ll permit me,” said the Stranger, “I’d like to tell you a story.”Clare is an English teacher at a school that is nestled in the old home where Hammond once lived. Her fellow teacher and best friend, Ella, is found stabbed to death with a note lying next to her body which reads, “Hell is Empty,” also a line from Hammond’s book. As The Stranger Diaries continues, the body count rises as does the spooky, creepy factor of the entire tale. Folded within the story itself is the re-telling of The Stranger and the more we as readers learn, the more similarity there is between current events and the haunting, gothic tale of the past. The Stranger Diaries reads, at once, both as a ghost story and a gothic suspense. The writing is marvelous, intelligent and might possibly have you scrambling to look up classical literature references along the way. (Note: Hammond is a fictional writer, much to my dismay.) I loved all of the characters, except the ex-husband and even he was the perfect ex. In all, this is a terrific mystery, ghost story, gothic tale that crosses multiple genres and can enjoyed by many. I highly recommend it.Thank you to #Edelweiss, #HoughtonMiflinHarcout and #EllyGriffiths for my copy of The Stranger Diaries. "}, {"Review": "The Stranger Diaries was a solid 4 stars for me. A mystery/thriller, this book centers around main characters Clare (a divorced English teacher who specializes in RM Holland), Georgie (her 15 year old daughter), and Harbinder Kaur (a detective). Most of this thriller centers around the school Talgarth High-this is where the famous Victorian writer RM Holland wrote and lived. An interesting character, Clare spends some of her free time researching aspects of his life for a book she is writing. The real mystery in Stranger Diaries begins when fellow English teacher Elle is murdered in her home with a quote written on her body-a quote from Holland’s story “The Stranger”. Someone is also leaving messages in Clare’s personal diary-could it be the killer!? Told from multiple POVs, readers get to know the main characters in better detail and their observations and thoughts on Elle’s murder. Overall, Stranger Diaries is a slower paced book but well-worth the read. Recommended to fans of mystery/thriller books. "}, {"Review": "4 Stars.I’m a fan of Elly Griffiths’ Ruth Galloway mysteries, and couldn’t wait to sink my teeth into this one. I was not disappointed. It’s a treat! The Stranger Diaries is a perfect concoction of interesting characters, suspense, and thrills with a bit of spookiness thrown in. When teacher Clare Cassidy’s friend and work colleague, Ella Elphick is found brutally murdered in her home, Clare is badly shaken and their school is plunged into mourning. Who would have wanted to harm Ella? She was popular with the staff and students alike, and seemed to have no enemies. Of course people always keep secrets, but did one of Ella’s get her killed?Clare’s school was once the home of author R.M. Holland, a Victorian writer who produced The Stranger, a famous Gothic mystery and who’s wife died in the house under mysterious circumstances. It is said that the school is haunted by Mrs Holland's ghost and that seeing her is a sign a death is imminent. Somewhat obsessed with The Stranger, Clare hopes to write a book about Holland and solve the mysteries of his wife’s death and the disappearance of his daughter Mariana.When Clare discovers a note referencing The Stranger, written in another hand, in her private diary, she becomes worried for the safety of her teenage daughter Georgie and herself. It doesn’t help her nerves any to know that the detective on Ella’s case, DS Harbinder Kaur seems to think she had something to do with the murder.Things quickly go from bad to worse because the killer isn’t finished yet, with Clare or her school.This mystery is pure enjoyment from beginning to end. I can’t wait for the next one.Thank you to NetGalley and the author for a copy of the book."}, {"Review": "Clare teaches English – key stage 3 in term time, adult creative writing courses over the holidays – and specialises in the work of R.M. Holland, a 19th-century writer of ghost stories whose personal life was as lurid as his fiction. At the beginning of the book, Clare receives a phone call with the awful news that her friend and colleague Ella has been murdered. She's later told a handwritten note was found next to Ella's body: a phrase from The Tempest, 'hell is empty'. The quote also happens to have links to Holland's best-known story, The Stranger, and soon it seems that Holland's work could be instrumental in identifying Ella's killer.Elly Griffiths is best known as the author of the Ruth Galloway crime novels, a series I've only dipped my toe into – I read the first book, The Crossing Places, about 7 years ago, and found it enjoyable, but not interesting enough for me to persist further. The Stranger Diaries, meanwhile, is a standalone, billed as 'a contemporary gothic thriller'.Before starting this I'd seen a couple of lukewarm reviews suggesting the gothic elements were just window dressing, which made me feel a bit wary. But what quickly becomes apparent – and it's not exactly surprising given her background – is that Griffiths really knows how to write a story that grips you from page to page. It's as hooky as a bush full of sticky buds. (Side note: was prompted to look up the proper name for these; it's Galium aparine or 'cleavers'. 'Sticky buds' was the name I grew up with but apparently some people call it 'sticky willy'?!) There are numerous narrative voices in the book, and they do actually sound and feel like different people, Clare and Harbinder especially. And I for one was pleased with how much a spooky, chilling atmosphere pervades the story.There are some slightly grating implausibilities – for example anachronistic language in Holland's story and his letters. I also knew immediately there was something off about one character, simply because there is a situation in the book I found completely unbelievable, and from there... well, let's just say it's quite easy to figure certain things out.What I look for in books like this is pure enjoyment. I want something I can curl up on the sofa with and devour. The Stranger Diaries suited those needs perfectly – plus it has a Halloween setting. And because I was interested in the characters, it didn't really bother me that 'whodunnit' is obvious. If this also turns into a series, I'd consider reading more, especially if they all have gothic tendencies.I received an advance review copy of The Stranger Diaries from the publisher through NetGalley.TinyLetter | Twitter | Instagram | Tumblr"}, {"Review": "Two books for the price of one.Elly Griffiths has a new crime mystery that has no direct link with her two established series. One of the things it does have in common is that it is very good. Full of her delightful humour and investable characters but for her as an author a bold venture as lacking the security of the familiar. It strays into uncharted territory moreover as there is a cap doffed to gothic horror and ghostly terror.Interspersed with the modern day fiction is the frightening tale of a Stranger on a train who recounts a horror story while the journey is delayed, fittingly he narrates his story on 31st October, as it concerned events that happened on previous Halloween nights.The mantra “Hell is empty” ties this story into the modern murder mystery as an English teacher is found dead. With the body is a note which is a quote from The Stranger which also relates to a quotation from The Tempest.Set in part within a school English department which in itself shares part of Holland House where the author of The Stranger lived and where his wife is a noted ghostly apparition. Elly blends the fiction of the narrated tale on the lonely train with her modern murder mystery. The detective team in the police investigation are as lost as we readers are. The book tells its story through the perspective of three characters which spins the narration around like a fairground ride and disorientate one’s own focus on who is perhaps less open and truthful.It is almost a play within a play full of drama and high pitched tension. It is a genuine stand-alone by a well respected author who does not need to enhance her reputation but this novel clearly does that by its originality and should seal her self-belief. The Stranger Diaries reflects well on her story telling ability and her writing prowess.I loved this homage to English Literature and thought it a fitting tale to demonstrate real skill for an accomplished author at ease in her work and in love with literature.I can imagine the plot has moved across the waters of Elly’s subconscious since her own student days, like some sea fret rolling ashore.It is always a pleasure to meet Elly at book events and signings. Behind bright, intelligent eyes you know that there is talent with so much more to give. I am delighted to say that twinkle in her eyes just got brighter as this new novel is a tour de force.Other authors look away now. She is also one of my favourite modern writers as a person and as a exponent of her art. And the reading audience shout. “More..........”"}, {"Review": "The Norfolk settings first drew me to Elly Griffiths’ Ruth Galloway series - Kings Lynn is one of my very favourite English towns. But after several outings I’d begun to find Ruth annoying. The Zig-Zag Girl featured a fascinating period - the 1950s - but stage magic and Brighton don’t appeal to me. Yet I had very high expectations for The Stranger Diaries and I expect that I’d been less disappointed had it not promised so much. Griffiths has created a ghost story, supposedly written by R. M. Holland (notice those initials), The Stranger, that we are to believe has achieved a place in the canon of classic English ghost stories as exemplified by M. R. James. One huge problem with making a writer a principal character in fiction is having to provide samples of the character’s actual writing. Antonia Byatt did it; Joyce Carol Oates solved it by having him drunk all the time; Dodie Smith gave him writer’s block. Elly Griffith deserves the highest praise by providing the entire story at the end of the book. (Unfortunately it’s not quite in the M. R. James class and I expect James may have been astonished to learn that Cambridge University had a postgraduate studies programme in the 1840s.)In the contemporary story, the setting is Talgard School, a comprehensive on the south coast near Chichester. Holland’s old house, which of course is believed to be haunted, is part of the school, though there is a modern block where most of the teaching takes place. The fortyish divorced Clare Cassidy teaches at the school, where her fifteen-year-old daughter Georgia is a pupil. Clare’s colleague and BF Elly is gruesomely murdered, which brings DS Harbinder Kaur into the story. Clare (along with Clare’s diary), Georgia, and Harbinder share the narrator’s voice.Which makes The Stranger Diaries what we Iowans would call a hybrid. It’s a cross of ghost story with police procedural. I expect most readers addicted to the latter find themselves creating their own private detective squad. Mine stars P. D. James’s Cordelia Gray (I will never forgive the BBC for making James drop her), Sharon Bolton’s Lacey Flint, and Tana French’s Cassie Maddox. But I’ve sent French’s ‘Scorcher’ Kennedy and Antoinette Conway off to the traffic squad for being unpleasant boors - along with the epidemic of Andy-Dalziel-impersonators in current detective fiction. Harbinder, like Jane Casey’s Maeve Kerrigan, seems to have a love-hate relationship with her own ethnicity, living at home with her parents but hiding her sexuality. (BTW, Harbinder or Harvinder seems usually a boy’s name.) If addressed as ‘Sergeant’ she’ll reprove the miscreant with ‘It’s Detective Sergeant!’ (I’d be tempted to apologise with, ‘Well, excuse me, your Detective-Sergeantship!’) Clare, fortunately, is appealing although slightly over-her-head with teaching and parental duties even before Elly gets murdered and daughter Georgia is a gem. Like so many novels these days, a teenager is the most attractive principal character.The murder of Elly is followed by that of the department head, also in a manner reminiscent of Holland’s story. Is the perpetrator a demonic revenant or an ordinary human criminal? There are a number of suspects. For most the book, I was carried along eager to find out. But then I was disappointed. When we finally discover the motivation for the murders, it seemed totally unprepared. I always find it cheating when the author has a character notice something but then doesn’t tell us what the character noticed. And if you interrupt the villain in the midst of perpetrating villainy, it’s awfully easy to get your solve. That’s how I felt about this one. Griffiths assembled excellent ingredients, but they were woefully undercooked, and the result was neither first-rate supernatural fiction, nor mystery story.As for Harbinder, I recall awful road congestion back in the days when I was travelling to Itchenor on weekends to sail in Chichester Harbour. I’m sure she’d be a great help ironing out the bottlenecks on the A27."}, {"Review": "“Hell is empty!”Clare Cassidy is writing a biography of the writer RM Holland, who was best known for his terrifying ghost story, The Stranger. So she’s happy to be teaching at Talgarth Academy, a school in Sussex which was once Holland’s home and where his study is still intact, giving Clare access to his papers. Clare uses The Stranger as part of her lessons, both for her school pupils and for the adults who attend her creative writing classes in school holidays. But when one of her colleagues is brutally murdered, Clare is shocked to learn that a piece of paper was found by her body containing a line from Holland’s story. And soon, as the plot thickens, it becomes clear that somehow the story holds the clue to the case...Elly Griffiths is brilliant, and so is this! I’m tempted to leave the review at that, since the real joy of the book is going into it completely cold and watching Griffiths gradually build up some great characterisations and a truly spooky atmosphere. So, if you’re going to read it soon, my advice would be to stop reading this and avoid other reviews just in case.* * * * *Still here? The book is told to us from three points of view – Clare, her daughter Georgie, and DS Harbinder Kaur, the detective in charge of the case. I found each of them a little off-putting at first for different reasons, but as Griffiths gradually developed them more fully, I grew to like them all – though not necessarily to trust them! In fact, as the saying goes, I trusted no-one – Griffiths left me happily in doubt all the way through as to everyone’s guilt, innocence, reliability as narrators, motives. The pleasure of this one is not so much the destination as the journey. The three voices are distinct, and each is fun in her own way. Through Clare we learn a lot about the background to RM Holland’s story and the rumours that the school is haunted by the ghost of his wife. We also learn about her friendship with Ella, the victim, often through extracts from Clare’s diary. Georgie is a bright, intelligent teenager and her narrative shows her manipulating the adults around her by playing on their expectations of what a teenager should be like. Harbinder gradually becomes the star, however. Indian, gay and still living at home with her parents in her thirties, her sections are increasingly full of humour as the reader realises that her abrasiveness and sarcasm are really a kind of defence mechanism. I loved the way Griffiths gradually fed us the story of The Stranger, which in itself is a pretty good pastiche of a real Victorian ghost story. But the spookiness doesn’t stop with it – the main story has some seriously goose-pimply moments, and at least two where I gasped out loud! Lovely Gothic stuff, with the old house and all the diary-writing and mysterious messages and other things I’ll leave you to discover for yourself. Even the investigation has a rather old-fashioned feel to it, with the emphasis on suspects, motives and clues rather than on forensics.A great read, especially for this time of year. Griffiths is undoubtedly one of the most talented (and prolific) writers out there at the moment, and she shows here that she can step beyond the usual police procedural. I’ve seen a few reviewers say they hope Harbinder will get a series of her own. Much though I enjoyed her character, I vote no! I’m hoping Griffiths will continue to break free from the predictability of series and give us more standalones, complete in themselves, instead. Highly recommended!NB This book was provided for review by the publisher, Quercus.www.fictionfanblog.wordpress.com"}, {"Review": "DNF @ 27%This book had an interesting setup- divorced mother with childhood trauma moves into a murderous author’s mansion. I really, really tried to like this; gothic fiction is my favorite genre, after all.I ended up hating the main character, Clare. She was insufferable with all her whining about her daughter not getting into the universities she wanted. She was the cliché evil gothic matriarch, only the author tried to force the reader to sympathize with her. I hated the protagonist so much I hoped the murderer would cut to the chase, hurry up and murder her so I wouldn’t have to suffer through any more.Thanks to NetGalley and the publisher for a free copy of this ebook in exchange for an unbiased review. "}, {"Review": "I’m a huge fan of any mystery or thriller that evolves around a book so The Stranger Diaries intrigued me from the start. I love the idea of a book holding clues to a mystery that’s happening in the present so this book was a big hit with me!I wasn’t sure about the main character Claire. On one hand she seemed very sassy and I found some of her observations very amusing. However she seemed like an unreliable narrator as she kept lying to the police which made me question her motives.This book is fairly fast paced as there is always something happening. That along with a creepy school, an old mystery and a murderer who starts to emulate the plot of a book and things start getting very thrilling very quickly. I soon found myself tearing through the pages and trying to hide from the kids to read a little more.I’ve read quite a few books by Elly and I really enjoy her original thrillers! I can’t wait to see what she comes up with next.Huge thanks to Quercus publishers for my copy of this book via Netgalley and to Olivia from Quercus for inviting me into the blog tour. If you like dark, thrilling mysteries then you’ll love this book!"}, {"Review": "Elly Griffiths first sensational standalone is a magnificent piece of storytelling that manages to combine a contemporary murder mystery between the pages of a chilling Gothic ghost story and proves as entertaining as it is atmospheric. The Stranger Diaries not only works as a homage to the work of R.M. Holland, a fictional Victorian writer known for his Gothic mysteries, but it also brings to life his crowning achievement in the form of his notable short story, The Stranger. Cleverly worked and full of literary flair, three contrasting and highly memorable female characters give voice to a fast-moving modern tale packed with unforeseen twists that will keep the reader guessing until the closing pages.Attractive single mother and respected forty-five-year-old English teacher at Talgarth High, a middling comprehensive school in West Sussex, Clare Cassidy is fascinated by the life of renowned Gothic mystery author, R.M. Holland. As she teaches creative writing in the rooms in which the reclusive author resided that are now part of Talgarth High, she uses his most famous short story to deliver a primer in ghost stories. Midway through writing a biography of Holland and hoping to shed light on the mysteries in his own life (the circumstances of the dying fall of his wife, Alice, the presence of her ghost within the school grounds and the existence of a daughter), Clare is also contemplating a return to a new term and her mixed bag of colleagues from a trendy super head with politically correct ideas to the old school socialist in her department. A popular figure within the school and mother to fifteen-year-old pupil, Georgia, the news that Clare’s colleague and friend in the shape of vivacious English teacher, Ella Elphick, has been brutally murdered sends shockwaves through the school community and unsettles Clare. With no forensic evidence to be found at the scene, the one clue is a note beside Ella’s corpse reading, “Hell is empty..”, a key line from both Shakespeare’s The Tempest and The Stranger, the more obscure M.R. Holland ghost story. And this is just the start of things as another murder soon follows..The arrival of DS Harbinder Kaur, a three-five-year-old punchy Indian detective still living at home who takes a instant dislike to Clare and her smug demeanour and seems to fancy her for the murder of Ella soon picks up on the literary quote. Her suspicions are further heightened by the appearance of mysterious writing in the journals of dedicated diarist, Clare, which not only sheds light on her unspoken feelings but the work of an insatiable killer Narrated by Clare, DS Kaur and Georgia, who unbeknownst to her mother is crafting her own storytelling with a select group of students attending the sessions of spiritual sixth-form tutor and reputed white witch, Miss Bryony Hughes, the story builds to a tense denouement.Griffiths pitches the voice of each of these flawed characters perfectly and all leave a lasting impression, perhaps because they feel so on point and ordinarily human,. At times I could empathise with each of them and I was impressed at how the story allows each of the protagonists to develop and fully emerge from the page throughout its course. The lively exchanges between DS Kaur and her sidekick, DS Neil Winston, himself happy to take a back seat, provide a witty commentary on the investigation as they test out theories, work through the list of suspects and expose many a secret along the way. Griffiths attitude to education and the tropes who flock to teaching is refreshing honest as is her take on modern comprehensive eduction and this thoroughly engaging story provides a cast of colourful teachers and self-involved students. Whilst the cast is not particularly large I was completely fooled by Griffiths sleight of hand and the dramatic unveiling of a killer, perhaps because I was so caught up in the interplay between M.R. Holland’s spooky short story and its modern re-enactment.As a reader who would normally steer clear of a Gothic ghost story I was unsure what to expect and was surprised to find the format so accessible, with the contemporary mystery very much at the fore and making the story and its characters so relatable. My only disappointment is that The Stranger Diaries is a standalone and therefore does not guarantee a repeat appearance by the effortlessly glamorous Clare Cassidy, prickly DS Harbinder Kaur or wise beyond her years teenager, Georgia... not to mention part-poodle, Herbert! Brilliantly done, cleverly understated and thoroughly compelling, The Stranger Diaries, is Elly Griffiths at her majestic best."}, {"Review": "If you enjoyed the way MAGPIE MURDERS combined a cozy country mystery with a modern one, THE STRANGER DIARIES does something similarly smart with gothic novels. It totally gets the gothic tradition to the point that I got actually creeped out a few times while reading it. While not quite a horror novel, it was really enjoyable. (The short story by the fictional Victorian writer in the book is A+, I loved all the bits of it scattered throughout the book.)This mystery walks a fine line between keeping it simple while still providing ghastly flourishes. There's a limited cast of characters (perhaps too limited, if I'd thought about it for five seconds I probably could have figured out the killer, but by the end of the book I was speeding through it so intensely I didn't stop to ponder) that leaves plenty of room for the gothic fun. Our central protagonist, Clare, is an English teacher working on a book about R. M. Holland, a gothic writer whose former home has now been converted into the school where she teaches. We get enough Holland to make him interesting but not so much that it feels academic or boring, just enough to add extra depth to the story, especially when his most famous story is tied into a murder.I'm also a fan of books where we switch points of view and here we get not just Clare's narration but also lesbian Sikh detective (yes!) Harbinder and Clare's teenage daughter Georgie, all of them providing very different points of view and the kind of snide commentary I particularly like in a switching-points-of-view book like this. It's always delightful to spend several chapters with Character A only to have Character B call them out within 5 seconds."}, {"Review": "I read this on the strength of Elly Griffiths' name as I love her Ruth Galloway series: this book is entertaining enough but doesn't show off Griffiths' strengths i.e. her ability to create quirky characters like Ruth, Harry, Cathbart etc., and there are only occasional gestures towards her trademark comedy/satire bon mots - in fact, the only time Clare raises interest is when she articulates something Ruth would say.The story itself is a modern Gothic-y serial killer with one of those dubious and unconvincing motives that fiction so loves. The whole thing could have been solved very quickly if only the police had used a bit of common sense over the diary ((view spoiler)[surely it's obvious that they just need to find who has access to Clare's diaries? With her daughter discounted, that only leaves one person - dun, dun, dun! (hide spoiler)]). That said, the female DS adds some energy to the book though I'm not sure I'd be up for more of her if Griffiths turns this into a series. Not everyone will be bothered by this but I was distracted by the implausibilities of the background: that Clare is a secondary school teacher but is somehow teaching an adult education class at half-term, and that she's teaching creative writing with no experience of creative writing herself, apart from a half-written biography of a Gothic writer for which she seems to do no research...The so called 'spookiness' is a red herring - and JK Rowling made a better plot out of the diary trope with Tom Riddle than is the case here. Even the invented short story of The Stranger just sort of fizzles out... This is enjoyable enough as a piece of throwaway Halloween entertainment, but Griffiths is a better writer than this.Thanks to Quercus for ARCs via NetGalley and Amazon Vine."}, {"Review": "I received a copy of this book from Netgalley in exchange for an honest review.An eerie, cleverly written whodunnit - very enjoyable!It's always a pleasure when I dive into a book with no preconceptions and am pleasantly enthralled by what lies within! I had no idea what sort of story would be, but right from the start, became swiftly engrossed in it. Clare Cassidy is an attractive middle-aged woman - working at a school as a teacher, with a teenage daughter called Georgia. The school happens to have an interesting history; it was the previous home of a writer - the author of The Stranger, a story that has a lot to do with the forthcoming events...People start being murdered, one by one. Clare is a suspect, as are several other people. The only peculiar thing is... who is leaving notes in Clare's diary, and are they responsible for the sinister goings-on? Right from the start, I felt that Elly Griffiths established herself as a very confident storyteller - the leap from 'Victorian gothic story' to modern day was very skilfully done; it threw me completely, but in a good way. I also liked the multiple perspectives; with the narrative continually shifting from Clare to Harbinder (the detective working the case), then on to Georgia, the daughter.It was quite slow-burning, but I felt that gave the author the golden opportunity to build on the atmosphere and growing sense of dread. The ending was perhaps a little less the glorious reveal-all that I'd hoped for; but it worked - it certainly didn't leave me throwing the book down and declaring that it didn't make sense (which is what usually happens when I read books like this!). Another thing that I think is worthy of note is the author's highly adept way of addressing people's preconceived notions about other people. For example, Clare believes her daughter to be a fairly typical teen; but when we experience Georgia's perspective, we realise she's anything but. We also see Clare through Harbinder's eyes - previously, she'd been quite a sympathetic character, but according to the detective, she was a stuck-up, manipulative, over-privileged woman. Clever!Overall, a beautifully written, skilful book, very good stuff indeed. "}, {"Review": "I have long been a fan of Elly Griffiths – in particular her fabulous Ruth Galloway mystery series. Therefore I was beyond excited to learn that she had written a new, stand-alone novel.“Stranger Diaries” has three distinct narrators and I was engaged with all three. I enjoyed how the three narrators sometimes spoke of the same event, so that you could learn their differing perspectives – both of the event and of each other. If I had to pick a favourite character it would definitely be DS Harbinder Kaur. A petite, though fierce, young policewoman, she is a force to be reckoned with. Her character was written with empathy and humour.The setting of the novel was atmospheric in the extreme. Clare’s house was isolated and in the shadow of an abandoned factory. Talgarth High had a new school, and an old school which housed R.M. Holland’s study which was accessed up a Victorian spiral staircase.The ending of the story which took place in Ullapool, Scotland, was exceedingly suspenseful, and tied up all loose ends. The sign of a well-written, joy-to-read, murder mystery.The book, though a ‘stand-alone’ was one which (in my humble opinion) could easily be morphed into a series. I really hope this happens. I want more of DS Kaur and Clare Cassidy. Elly Griffiths…. are you listening?Overall, I found this novel to be an intelligently written, literary murder mystery with an outstanding cast of well-developed characters.Highly recommended!"}, {"Review": "Elly Griffiths is well known for her Ruth Galloway and Mephisto and Stephens series’ but if you’re not familiar with those, fear not, for The Stranger Diaries is a standalone.It starts with a story from long ago, recounted by a stranger on a train at Halloween – this immediately sets the tone for a deliciously creepy and atmospheric tale.Back to the present, teacher Clare Cassidy is writing her own book about a former horror writer called RM Holland – this name, together with some of his work, will feature heavily in this story. The school was once his home and his study, now a museum, remains untouched in the attic. There is a mystery surrounding his family and a ghostly apparition that a few people have claimed to have seen.Clare’s life is turned upside down when her colleague and close friend Ella is found murdered. She finds herself in the middle of the investigation for various reasons, and wonders just who she can trust. None of the people surrounding her escape the fallout of Ella’s murder with suspicion falling on almost everyone.Written from the viewpoint of three main characters, Clare, her teenage daughter Georgie and DC Harbinder Kaur, their accounts sometimes overlap, so we the other’s perception of the same events.The Stranger Diaries is a murder mystery with a touch of the Gothic and paranormal. From the beginning, I had the feeling that the murderer was someone close by and if I’d had my wits about me, I might have realised before being told.There were some characters that I took to straight away whilst feeling a little repulsed by others. I felt empathy for Clare even if she was a bit annoying at times and her daughter Georgie was a typical teenager, trying to keep some secrets to herself without her mother knowing everything. And as for DC Kaur – that woman deserves a series of her own. I started off not really liking her – she was ambitious and wanted to prove herself but I felt that this made her come across as quite cold; she had own her prejudices, instantly distrusting and taking a dislike to people for the most odd reasons – like the fact that one person had a suntan in October, however she won me over with her caustic comments and her dedicated determination to find out the truth.I was in a bit of a reading slump when I started the Stranger Diaries however this was the perfect book to get me out of it. I was enthralled from the first page and this well paced and cleverly plotted story kept me turning the pages at all hours. The Halloween setting of the Holland story running alongside made for an atmospheric and chilling read. I loved it and wouldn’t hesitate to recommend it."}, {"Review": "'Just like in the books, when Poirot suddenly \"knows\" who the murderer is, but won't tell anyone because there are a hundred pages still to go.' So states a character less than half way through The Stranger Diaries. The irony being that the reader has already worked out who the murderer is, and there's over half the book to go. The blurb promises that Elly Griffiths' new novel will be a darkly gothic affair, but instead we're served up a reasonably chilling but fairly standard killer thriller with the occasional side order of creepy. The majority of the spookiness comes courtesy of RM Holland, the MR James-esque Gothic writer whom our heroine Claire is researching for a biography - the passages attributed to him are wonderfully spine-tingling. English teacher by day, the school Claire works at just happens to be the Holland's former home, replete with resident ghost. There's some teenage dabbling with dried herbs and incantations too, and a benevolent white witch. But at heart, the spookiness in The Stranger Diaries is just Hallowe'en party window dressing, albeit fun, and the tale itself is a pretty straightforward whodunnit.As for who did do it, simple logic means that even the least astute reader will have worked it out by a few pages in. It's a shame really, because the denouement lacks punch and the book sort of slouches to its end. That's not to say it isn't enjoyable, however. DS Harbinder Kaur and her wonderful family are a highlight and I'd love to meet her again in another tale. Clare, and all her associates, are verging on middle class caricature; there's a child called Ocean and everyone has lovely kitchens and cashmere sweaters and skiing holidays. It's unimaginable that anything bad could happen in their Jo Malone scented lives, and yet. The Stranger Diaries is entertaining enough and genuinely fraught in places, but the reader is left feeling a little deflated - particularly if what had piqued the interest in the first place was the promise of dark Gothic doings and mystery. A reasonably diverting read, it doesn't really offer anything new. A book by RM Holland featuring DS Kaur, however, would be a delicious prospect.My thanks to the publisher and NetGalley for the ARC in exchange for an honest review."}, {"Review": "Book reviews on www.snazzybooks.com I am a big Elly Griffiths fan, and love her Ruth Galloway series, so I was intrigued to try a book with different characters in it. The Stranger Diaries definitely feels like a different read, but it was just as entertaining and absorbing as her other novels, and the characters - which Elly Griffiths is always so great at shaping - read like real people I could, on the whole, imagine actually existing.The plot is interesting and kept me intrigued; at some points it required some suspension of disbelief (definitely less believable than her Ruth Galloway series - sorry to keep comparing but, hey, I love those books) but it is a fun and engaging story, and has some enjoyable twists and turns. I have to say that Harbinder, the DS, shone in this novel - she's very confident, knows her own mind and rubs people up the wrong way, but she's a unique and interesting character who added something fresh to the story. I did like Clare but felt at times she was a little annoying/ snobby - I really couldn't identify with some of her opinions - however Georgie, though a predictably stuck up/ whiny teenager some of the time, seemed likeable and overall a sweet girl. This is a well-written story and a good start to a new series, if that is what it will become (I'd read more of DS Kaur for sure) but it doesn't quite measure up to the brilliance of Elly Griffith's Ruth Galloway series. Well worth a read, though."}, {"Review": "Ellie Griffiths is known for her Ruth Galloway crime series, so The Stranger Diaries is a change of direction for her. This standalone gothic, murder crime novel manages to unnerve, unsettle and keep you reading until the final outcome of the plot. Clare Cassidy is an English teacher working in a school that once was the home of a famous ghost story author. She herself is writing a biography about him when a close friend is murdered. Clare finds herself at the heart of this dark tale. A great combination of crime and classic gothic ghost story."}, {"Review": "With thanks to Netgalley and Quercus for this ARC in exchange for an open and honest review.I have been a fan of Elly Griffiths for years and have read all her Ruth Galloway and Mephisto and Stephen mysteries. I was excited when I found this would be a new mystery.English teacher Clare Cassidy worked at Talgarth High, her 15 year old daughter Georgia was also a pupil at the school. In her spare time Clare was writing a novel about the Famous writer R M Holland who used to own Telgarth. Holland was well known for writing The Stranger, it was said his wife Alice Avery fell to her death and now haunted the school. It became a legend that the ghost of Alice foreshadowed a death.During the half term break Clare was told that her best friend and colleague Ella Elphick had been murdered. Bedside her body was a note with a quote from The Stranger `hell is empty`.DS Harbinder Kaur who was a ex pupil at Talgarth High and DS Neil Winston investigated the murder. Harbinder immediately distrusted Clare because she was glamorous and attractive. When Harbinder found that Ella had an affair with Rick Lewis who also worked at Telgarth he became their prime suspect.However days later Clare found Rick`s dead body in the room where RM Holland wrote The Stranger. Like Ella there was a note beside his body with the same quote `he'll is empty`.  Clare had written several entries in her diary criticising Ella and her affair with Rick`s. One night she was reading her diary about the days following Ella`s murder, she found someone had written in her diary I have already disposed of one of these creatures. I will fall on the others like a ravening beast. I really enjoyed the two storylines within the book. It was easy reading and I devoured more then half the book in one day. The book was told from the POV of Clare, Georgie and Harbinder. I liked Clare but I enjoyed reading the POV of Georgie and Harbinder. I liked Georgie who liked to pretend she was a typical teenager but like her mother had a love of creative writing and dabbled in white magic. My favourite character was Harbinder who lived at home with her parents, her mother sounded lovely and constantly had a twenty four hour buffet going in the house.There were plenty of twists and turns in the story. Elly provided many suspects for the murder to keep you on your toes. I suspected one person and then another. I was shocked when they killer was revealed because I had not suspected them.The Stranger Diaries was excellent and I hope DS Harbinder Kaur and Neil Winston get their own series."}], "Genre": "Crime", "ID": "40796097", "Desc": ""}