{"Genre": "Crime", "Reviews": [{"Review": "A must-read for any one who cares or is interested in women's history. "}, {"Review": "Bringing Down the Colonel: A Sex Scandal of the Gilded Age, and the ‘Powerless’ Woman Who Took On WashingtonA look at things in Victorian America for women. A Kentucky lawyer and politician makes promises he won’t keep and plays fast and loose with young women while his wife is at home. When he’s finally brought up short and one files a lawsuit against him for breach of promise, he tries to brush her off, using his power and prominence to quiet her. Madeline Pollard files a lawsuit after Colonel"}, {"Review": "There are more non-fiction narratives of bullying being published. Or so it seems to me. While reading this book, I also tore through an appalling account of present-day avarice-led bullying by lawyers and executives in Silicon Valley. This micro-history is a bullying story of the old-school, with Kentucky Congressman and revolting hypocrite William Breckinridge struggling mightily in 1894 to shut down the woman he first seduced when she was 16 (so she said, there is some disagreement). He then"}, {"Review": "When Jennie Tucker heads to Washington D.C. with the promise of a lucrative position, she has no idea what her employer has in mind for her. A single woman nearing her thirties, Jennie comes from a good family that has a beautiful home, but no money to maintain it—or her. In Victorian America on the east coast, economic necessity forced more and more women to enter the work force when they failed to marry and their parents could no longer support them. But entering the work force carried a horri"}, {"Review": "What a fascinating history, one involving feminism, politics, law, and the ever-present double-standard in American society. Miller does a great job introducing to readers a wide cast of characters in this complex story, providing the background for each individual and ensuring that the reader is clearly able to distinguish between everyone and their roles in the case. I loved this book!"}, {"Review": "BRINGING DOWN THE COLONEL is a nonfiction account of Madeline Pollard’s lawsuit against Colonel W.C.P. Breckinridge for abandonment (he had a shotgun marriage with another woman while engaged to Pollard) in 1893. Sadly, DC didn’t have seduction laws, which many other states had at the time. Pollard’s aim is to make Breckinridge have his share of the blame, shame and consequences. This lively account explores a ten year affair that Pollard believed would end in marriage. Instead, it ends will thi"}, {"Review": "Over a century before the onset of #metoo, a previously unknown woman brought a breach of marriage suit against a powerful Washington politician. This was no small thing since she would be required to reveal her status as a “fallen woman.” Nevertheless, she took him to court in 1893, won the trial in 1894, ended his career the same year, and was consigned to the footnotes of history. Long before the likes of Harvey Weinstein graced the tabloids with accounts of disgusting behavior, Patricia Mill"}, {"Review": "4.5I'm surprised how much I enjoyed this, to be honest - I was excited to try it but I'm not the biggest fan of nonfiction, so my expectations weren't high. I enjoyed the tone and language a lot - it wasn't bogged down by long academic sounding sentences that I could barely understand, and there were even a few times that I laughed out loud at the authors sarcastic and ironic tone. I thought she painted a well rounded picture of the time and culture, and provided some other previous examples of"}, {"Review": "Patricia Miller accomplishes here a very detailed, in-depth investigation of the nineteenth-century scandal that was brought to trial and changed how America looked at women’s sexuality. Madeline Pollard was considered “ruined” by an affair with a high-ranking government official, but she fought back, and won. The trial described within these pages brought to light events and women’s rights struggles that echo those of current times and proves that there is nothing new under the sun. Perfect for"}, {"Review": "A fascinating book about the trial that took down a colonel and also was the first chance for women in America to speak out about the double standards of a man \"sinning\" and a woman \"being ruined\". Much more intriguing is the epilogue where some women in the book come into their own and lead courageous lives as suffragettes. I could have read endlessly about the different women's clubs that were formed at the same time and what those women did."}, {"Review": "That I stumbled across this volume by Patricia Miller is a sign that 2019 may be unusually kind to me. It is a delightful blend of history, politics and sex, a tale from the end of the 19th Century told in amazing detail and a keen appreciation for what it all meant. Miller makes a good case that the fall of Colonel Breckinridge at the hands of his mistress, Madeline Pollard, proved a turning point in the shift for American women and American values. It's a good read and fine book."}, {"Review": "Deeply enjoyed this one. 1890s court case where a woman sues a Congressman for seducing her, promising to marry her, and then marrying another woman. Seems scandalous and fun? It is, but there is much more here. Sexual double-standards, women's rights, and even modern relevance with the me too movement. "}, {"Review": "Enjoyed this book so much. It angered me in so many ways and I learned so much. It started a bit slow and mundane with all the information being thrown at you but once you get into it, it just sucks you in. It's so well researched and wrote out. I would recommend this book to everyone, must read!"}, {"Review": "“The real combatants, though, were two worldview about women and sex. One was the hierarchical, predatory southern ethic, which held that any woman who wasn’t protected by her father and domestic isolation was fair game and became part of a debauched class necessary to protect the purity of respectable women… The other was the more egalitarian ethic of the western elite- the descendants of the pious but fair minded Puritans that increasingly saw men and women as equals and men as responsible as"}, {"Review": "\"In the end it wasn't one woman who brought him down, it was all of them.\"I cannot recommend this audiobook enough, a superbly-told feminist story that challenges the Victorian sexual double standard for women that echoes through society today. Read for the 2019 Reading Women Challenge #18: A romance or love story."}, {"Review": "An excellent book...an incredibly interesting story, and Miller ties it to so much scholarship on gender relationships and women's roles during the late 19th and early 20th centuries that I would strongly recommend this to teachers as an assigned reading for their classes. "}, {"Review": "Bringing Down the Colonel: A Sex Scandal of the Gilded Age, and the \"powerless\" Woman Who Took on Washington is just an okay read. I give it three stars. "}, {"Review": "the ' me too' movement in the 1800s- who`'d have thought of it?but it really happened, and she won! "}, {"Review": "This book is very well written and has extensive amounts of research in it. From the tragic tale of Maria Halpin to Madeline Pollard’s fight against a society filled with double standards, this book was captivating from start to finish. There are also lots of parallels to today’s society as well. I would definitely recommend this book to anyone who is interested in reading! "}, {"Review": "Loved it!!! A truly fascinating book. The author did an amazing job pulling together so many interesting pieces of history about women’s issues and public perception of sex outside of marriage. It was incredible how she tied it all together as backdrop and input to the story of Madeline Pollard and Colonel Breckinridge. I especially loved her insight for their motivations and what might have been truth vs. lie."}, {"Review": "In the era of the Me Too movement, women are looking towards history and politics and wondering: are we the first to stand up? We know women fought for the right to work, the right to vote, and we earnestly want to know not only what those women went through, but why. Why did society and politics need the push they needed, and why did it succeed sometimes but not others? What were all the unwritten currents for and against these pioneers?Patricia Miller does an excellent job answering these ques"}, {"Review": "Colonel Breckinridge was a powerful Congressman from Kentucky, the scion of a long legacy of Breckinridges. Madeline Pollard was a teen from a respectable family whose father had died, leaving the family to ruin. She bounced from relative to relative, learning how to claw her way to some funds, trying to get an education and further her place in life. Madeline had made an arrangement with a much older man wherein if he would pay for her college, at the end of it, she'd marry him. She wanted out"}, {"Review": "We have a long and tainted history of abusive corrupt male sexual predators holding elected government positions. Common traits of these men: liars, blame the victims and a network of male cronies participating in the coverups of these scandals.https://www.thedailybeast.com/grover-...https://www.smithsonianmag.com/arts-c...https://books.google.com/books?id=Pax..."}, {"Review": "I am near finished with this book, and have thoroughly enjoyed it. The author wrote it not as historical fiction and not a pure fact piece. It's terrific. There are times when I am confused with the characters. For instance, the author alludes how Breckinridge put Blackburn in a bad position but does not specifically explain the reason. I also was confused about exactly what Louise the typist was typing for Breckinridge and what the significance of the yellowed envelopes was to the case."}, {"Review": "You want to read a book like this and think wow, things have changed so much in the past 100+ years. But no. It's almost depressing how familiar even the details of this story are! Could have been ripped from multiple modern headlines.Good read though. Well-researched and I liked how the author dovetailed the trial and information into a larger picture of how Madeline's story and the trial effected women and the politics of the day. And how it wasn't so much a singular thing but how sick and tir"}, {"Review": "It is odd that Miller uses the spelling “Madeline” instead of “Madeleine,” the spelling Pollard used in documents signed by her own hand. It is a small point, but shouldn’t you spell the name of a historic person the way they themselves spelled their name?The book is well written and it is a very important tale with a fascinating cast of characters. I know a great deal about the story. I have stood at Pollard's grave, have been in the mansion where she spent the last months of her life and even"}, {"Review": "This is an outstanding book especially now with the rise of the MeToo movement. The author touches upon numerous struggles that have been hidden in much of today's history. It is well worth reading if you are interested in the 19th Century and want to know more about the struggle for equal standing by women."}, {"Review": "Mama always warned me to be careful of men; \"they can ruin you.\" Ruined. A pregnancy is a surefire way to ruin a young girl's life. Filled with wonderful research and detailed stories of women's lives, I got tired of always leaving the main story to read in depth yet another women's entire history and journey. This book reads as a bible for women's liberation."}, {"Review": "What a story. The author did her research and provided a solid history on what Pollard was up against when she sued. At times the story wandered. It takes bravery to stand up. I stand on the shoulders of women who came before who stood up and said this is not okay."}, {"Review": "Very readable and timely story of men’s privilege, with a happy ending for the women."}], "ID": "35259565", "Name": "Bringing Down the Colonel: A Sex Scandal of the Gilded Age, and the \"Powerless\" Woman Who Took on Washington"}