{"Genre": "Crime", "Reviews": [{"Review": "The prolific thriller writer David Baldacci begins a new series featuring female FBI Special Agent Atlee Pine, with quite a backstory. At the age of 5 years old, Atlee was left seriously assaulted after her twin sister, Mercy, was abducted from their bedroom. Plagued by survivor's guilt, and feeling the wrong sister was taken, Mercy was the good girl, not Atlee, Atlee's memories of what happened that long ago night have only recently returned. She is convinced that convicted serial killer, 57 ye"}, {"Review": "After reading the Long Road to Mercy, I felt in need of some myself. It started off well in the first chapter but became a big mess that was devoid of any tension but chockful of all possible action-thriller tropes possible. WTF? David Baldacci has been losing his touch in his recent books and LRtM doesn't change this pattern.Now, I hope Mr. Baldacci continues the thread in Chapter 1 in his next book, since that was the only original plot point that actually interested. The rest of it was BS."}, {"Review": "There is something to be said for an author who can juggle writing multiple book series at the same time, and even more for those who are able to see these collections continually hit the top of the charts. David Baldacci has been able to do this—without collaborators, I might add—and keeps the stories crisp, while never losing his reading base. I approached Baldacci’s latest work with some trepidation, as I am comfortable with the two strong series he actively writes and worry about diluting th"}, {"Review": "4 intriguing stars to Long Road to Mercy! ⭐ ⭐ ⭐ ⭐ It’s a shiny new series from David Baldacci with a fierce female main character! Meet Atlee Pine. She’s a tall, muscular, no nonsense FBI special agent, and she’s assigned to the most remote areas of the west. What inspired her to join the FBI? Her twin sister was abducted by a serial killer, but not before assaulting Atlee, and her life mission has become putting offenders behind bars. Atlee is a top profiler with the agency, and she keeps to he"}, {"Review": "*https://theburgeoningbookshelf.blogsp...Long Road to Mercy is the first in a new series by accomplished author David Baldacci. This book is the introduction of FBI Special Agent Atlee Pine. Atlee’s character is well developed in this first instalment and we learn what makes her tick, her motivations and her past.Atlee is strong mentally as well as physically although she does have her weak spots, one being her twin sister, Mercy, who was kidnapped and presumed murdered when they were 6 years ol"}, {"Review": "Was very excited to receive an Advance Reading Copy of Baldacci's new series starring FBI agent Atlee Pine. All action and attitude. Plus, I learned so much about the Grand Canyon. Great thriller!"}, {"Review": "A new series from a favorite author? I'm on it! And although I've just finished, I'm already eager to read the next installment.That is not to say, however, that FBI Special Agent Atlee Pine totally won me over. I like that she's strong (both mentally and physically) and thus able to handle just about anything that comes her way. That she's carrying around a traumatic childhood - her own almost death and the kidnapping of her twin sister, Mercy - is less intriguing; for me, it simply provides an"}, {"Review": "The first thing I should say is that 2 stars means I found this book to be okay. Not great. Not what I usually expect from David Baldacci but it was okay. It would probably make a good made for TV movie. Pass the popcorn.Another rogue FBI agent who is on a mission to save the world (literally) from conspirators that permeate all the various United States federal agencies. Homeland Security, the Army, her own FBI. They have helicopters, soldiers with body armor, M4 rifles, etc. Atlee Pine has her"}, {"Review": "Long Road To Mercy, the first thriller to feature FBI Special Agent Atlee Pine, begins by introducing us to our new protagonist, and we learn all about her formative years spent with her family and the troubles that have plagued her ever since, saying more would spoil it for potential readers. As her life is shaped by happenings of the past I have a feeling that this will be a recurring theme that Baldacci will continue to use throughout this brand spanking new series.I can very much relate to A"}, {"Review": "Intriguing Start that Goes Down the Absurd Conspiracy TrailReview of the Audible Audio edition narrated by Brittany Pressley and Kyf BrewerThe opening set-up, which was also well-telegraphed in the title, and then even the mysterious death of a mule in the Grand Canyon promised a lot here but it all got side-tracked into a totally absurd conspiracy plot where each plot twist was more unbelievable than what came before.Baldacci introduces a new series here with FBI agent Atlee Pine and the wester"}, {"Review": "Audiobook - 11:10 hours - Narrated by Brittany Pressley, Kyf Brewer4.0 stars out of 5.0I have been brooding on \"Long Road to Mercy\" since I finished it early yesterday. In my judgement, Atlee Pine is a true \"action hero\" moulded from the strengths and weaknesses of a multitude of such characters as John Puller, Kim Stone, John Rain, Jack Reacher, Will Robie, John Milton and the like. Because of her back story and the great set of characteristics attributed to her, including her FBI badge and \"cr"}, {"Review": "I like David Baldacci. I feel like he didn't write this book. That he got someone else to write it and he just edited, added or told the story and someone else ghost-wrote it.Atlee was very unlikable for me. She's a mess and it's not working in a way that I have empathy for. Add to that incredible details of.... restoring a mustang, bench pressing/weight lifting, Grand Canyon trails... too many pages of info that didn't add to this story except for page counts.I will read more of the Memory Man"}, {"Review": "I usually love listening to audiobooks, however, this book would I have rather read. Or waited for the Swedish audiobook. Brittany Pressley voice was kind of OK, a bit robotic, like narrators to express more emotions. However, Kyf Brewer, GAH, very robotic voice and he voiced EVERY male character in pretty much the same way. Also, I have no problem with different voiced when there are different POVs. In this case, did Kyf Brewer voice every line that a male character speaks. And it irritated me"}, {"Review": "Getting to read great books early is one of the best perks of being an author. This book is great fun, and a real blastoff for what promises to be a spectacular series. You're going to like Atlee Pine. "}, {"Review": "DAMMIT!!!!!!!!!!!!!!!!!! I am all set to love this book when I hit the first several pages...A dead mule, a missing person, smallest FBI office possible with a female agent and awesome secretary, National Park Service Rangers, a Navajo Nation, hunky Sam, mules, mystery with a cave and all this nestled in the Grand Canyon area!!!!!!!!!!!!!! Can it get any better? Of course not, was all downhill from there. The plot is absolutely absurd for this setting. It made me very ANGRY...All of these great"}, {"Review": "The first book I read by David Baldacci was \"The Innocent\" and it was excellent. A great plot and characters and the story kept me very entertained. I continued to read many of David books until the plots became repetitive and more unbelievable. I didn't read anything by him for awhile and I saw his new book \"Long Road to Mercy\" and it looked interesting so I thought I would try again. Big mistake. Total disappointment. The main character, a woman, chapter after chapter, taking on two or three m"}, {"Review": "Baldacci has created a fine new character in Atlee Pine. She's a bit too superhuman, but her emotional vulnerability balances it out a bit. Her sidekick, an older woman secretary who is more than she seems, creates an interesting dynamic. Pine is smart and funny, although both she and Carol Blum, the secretary, come off as more masculine than feminine. Speaking as a woman and a writer, I'd suggest he run his drafts past some female readers before the next book comes out. Still, what a gripping s"}, {"Review": "Fast action. Well written and good storyline. Main character reminded me of a female Jack Reacher"}, {"Review": "Great read, love David Baldacci's writing. Special Agent Atlee Pine is a troubled but steadfast officer of the law. Her past is her nightmare and it does disrupt her rationale at times. One thing is for sure, you want her on your side! She teams up with her office assistant - they refer to themselves as Thelma and Louise! One of the National Park Rangers becomes a personal friend of Atlee's, which is a good thing because he also carries baggage from his past. The one thing that seems to be the n"}, {"Review": "Started really good but then got a bit slow, then picked up again about 3/4 into the book. I like the characters and the back story of her looking for her twin’s killer. I think that will be a huge plot to come in this series. My quick and simple overall: a good start to a new series by Baldacci with really interesting characters. "}, {"Review": "I was hoping for better. I prefer Baldacci’s less political thrillers. This starts ok but devolves into an espionage thriller with a pretty ridiculous plot. I few decent moments and the characters are well written but overall I’ll pass on the next Atlee Pine novel if it’s remotely political or involving espionage. 2.5 rounded down."}, {"Review": "I saw an interview with David Baldacci who was talking about how Atlee Pine is his first female protagonist. And I said to myself,  'hey, that needs to be celebrated!' And I liked Atlee, but I'm obviously NOT the target audience for this kind of book. I just didn't care about the spy stuff, lol.Audio DNF @ 60%"}, {"Review": "Ive only read a few Baldacci novels because I know they're easy reads. And I also like to break things up with a crime action style book. The premise sounded cool. Pines twin was murdered or has disappeared when kids, she visits the notorious killer in prison and demands to know where she is and what happened. This arc really only consists of about 40 pages so less than 10%. The second arc consists of Pine working for the FBI in a murder/disappearance investigation amongst the Grand Canyon. I wa"}, {"Review": "Interesting enough to finish the book but not quite as good as some of Mr. Baldacci's earlier works! "}, {"Review": "I am a big fan of Baldacci but this was by far his worst book for me. So much telling and then absurd snippets of action. I did not care for Atlee......the storyline was ridiculous. Definitely will not read the next one about this character."}, {"Review": "LONG ROAD TO MERCY by David Baldacci is one heck of an addictive page-turner. The plot twists. Then it thickens. Atlee Pine is one of the best female protagonists I've read about in a long time. She's a kickass FBI agent who knows how to get the job Done—with a capital D. And I loved her sidekick, Carol Blum. If you're an adrenaline junkie, treat yourself to this excellent read. You'll be glad you did!"}, {"Review": "Thanks to NetGalley for the ARC copy. When it arrived in my in box I was so excited, and started reading it straight away. I love all David Baldacci books, they are so varied and different. OK so they may all have a little bit of Washington DC in them, but that is the only similarity between them. I really liked Atlee - she seems a great character, much in the way of Michelle King. I don't want to give the story away, but the email characters are well drawn and the sort of people you want to kno"}, {"Review": "4 1/2 Stars, rounded up to 5 I. Loved. This. Book. Seriously, I didn't want to put it down. I will admit that the plot was a bit of a reach but that was okay with me. I really, really loved Atlee and Sam (and their burgeoning relationship) but I have to say that Atlee's older assistant, Carol, was hands down my favorite character in the book. What a hoot she is! One of my favorite parts of the book was when Atlee and Carol were on their road trip (which involved one dangerous pitfall after anoth"}, {"Review": "David Baldacci has become so prolific, I sort of mentally discounted some of his books the last few years. I took a shot here and was happy I did due to the introduction of his new protagonist FBI Resident Agent Atlee Pine. She's kind of a bad ass weight lifter who takes her low key position in the FBI hierarchy very seriously while haunted by the kidnapping of her twin sister years earlier. Much of the setting takes place in and around the Grand Canyon which is always a welcome break from NYC a"}, {"Review": "Great new strong heroine in FBI Agent, Atlee Pine. Agent Pine joined the FBI because she believed in truth and justice, but when she stumbles into something huge she begins to wonder whom she can really trust. When we find out what is really going on it is so mind boggling and frightening. Could this really happen? For mankind’s sake, I hope not. But in the crazy world we live in now, with powers that be that want to control the world, anything is possible. I hope there are more people like Agen"}], "ID": "39088984", "Name": "Long Road to Mercy"}