{"Genre": "Crime", "Reviews": [{"Review": "If I could, I'd probably rate this at 1.5 stars-- it ultimately pissed me off, and annoyed me throughout, but it was good enough to keep me reading and I suppose that should count for something.Maybe my opinion has been influenced by reading THE GIRL WITH THE DRAGON TATTOO immediately prior to this one. That book wasn't perfect, but it had characters you rooted for, didn't wallow too much in pop culture references, and most importantly IT SOLVED THE FRIGGING MYSTERY. Let's go through a few of th"}, {"Review": "Some wounds will never heal, and there will forever be a Rob Ryan-shaped scar in my heart.Some books are written deliberately to provoke sadness. It's fucking easy to induce someone to tears when the book is about a dying cancer patient with a labrador retriever whose leg has been amputated, with one ear missing. The most effectively emotional books are the ones where you least expect it. The ones that sneak up on you.There are differing degrees of sadness, the type that makes one curl into a ba"}, {"Review": "Though the isbn is the same as the one pictured, my edition of this book has a much creepier cover and tagline:Needless to say, I was completely expecting something a bit dark and twisted, a creepy psychological murder mystery with an outcome I never would have seen coming. And I got that. But I never expected this book to leave me feeling so... sad. And you know why? Because I cared. Ms French carefully builds up a complex personality for each of her characters, complete with a past, a sense of"}, {"Review": "\"What I am telling you, before you begin my story, is this - two things: I crave truth. And I lie.\"This book is brilliantly cruel - a story of deep and painfully real psychological f*ckery masquerading as a murder mystery. There's nothing \"feel good\" about it. If you like a book to leave you feeling warm and fuzzy at the end, it's not for you. If you like neat resolutions - it's not for you (and if you already read this book, you know exactly what I'm talking about). If you hate being left with"}, {"Review": "This book is amazing... really truly excellent. I took a risk at the UTEP library just picking this out at random... & what true serendipity it was! This particular week was rife with parties & late nights (daytime reserved for sleep) and all throughout \"In the Woods\" was a faithful companion... it was a pleasure to get back into it, for it's a dense and meticulous, brilliant piece of literature. It kicks \"Girl with the Dragon Tattoo\"'s ass... people, read this instead!!You feel so much"}, {"Review": "Seriously, man, I wanted to rate this book higher than two stars. I almost went with three, but I just can't do it. This book felt like it ran this long, exhausting marathon only to collapse into a heap, huffing and puffing just before it crossed the three-star line. Right now it's laying there lifelessly. It might get up slowly and crawl across that line later, but I doubt it.The protagonist of this book really, really annoyed me. It felt like a parody of one of those old black-and-white movies"}, {"Review": "(A-) 81% | Very GoodNotes: Great characters and writing, but ends so bitter and depressing. (view spoiler)[We never do find out what happened 'In the Woods.' (hide spoiler)]"}, {"Review": "After much waiting and some significant 'biblio' peer pressure, I have finally decided to take the plunge into the world of Tana French and the Dublin Murder Squad. In the summer of 1984, three children went missing in the woods on the outskirts of Dublin. When authorities arrived, they found one boy, Adam 'Rob' Ryan, delirious and unsure what had happened to him. The other two were presumed dead, their bodies never found. Flashing forward two decades, Ryan has recreated himself, using his middl"}, {"Review": "it must be really hard to write convincing mystery novels. you can't have your killer be too obvious or no one will bother reading past the third chapter. but you can't have them be too unexpected, without textual support, or you will be accused of cheating. the super-saturation of police procedurals in all their manifestations: literary and film and teevee, sets the genre up for failure - it just adds up to a steaming bowl of repetition and a dessicated medium. there are about five ways a murde"}, {"Review": "This was an Edgar Award finalist, and that means a mystery, right? Well, we get a tease at the beginning--little boy survives some sort of mysterious mischief in the local woods, the two friends with him are never seen again, and when he's found his shoes are filled with blood and he's unable to speak or recall anything. Cool, huh? I would go along for a ride that works out that story (how'd the blood get IN his shoes, not just on them, etc.), even if I have to sit through another peripheral mur"}, {"Review": "I.... have no fucking clue how I felt about this book. Because, hey, beginning? Awesome.  Ending? Trash heap that ruined the book for me. Let’s talk. The first half of this book was - honestly - excellent. You can read a thousand reviews talking about it, so I’ll keep it short. The writing is honestly stunning, much better - in my opinion - than Gillian Flynn or Paula Hawkins’ styles. I had no clue where the mystery was going. And the lead characters, Rob Ryan and his partner / best friend Cassi"}, {"Review": "Very, very good.Tana French’s 2007 introduction to her Dublin Murder Squad series eschews “normal” detective prose for a more literary and artistic approach. Hers is not the terse and journalistic objectivism of hard-boiled literature, nor the overly technical and post-modernistic dialect of more recent crime writing. French’s language is rich and erudite, blending the best of many genre’s into a style that is fresh, unique and intoxicating.Told from a first person perspective of Dublin homicide"}, {"Review": "I will agree that this book is gorgeously written, and the characters are well crafted and sympathetic. That's what kept me reading through the various absurd plot points. An example: the narrator, as a child, is found in the woods, his shoes full of blood, with his two best friends mysteriously missing. He comes back years later as a detective to investigate another murder in the same small estate, and no one recognizes him including the mother of one of those best friends. Oh, PLEASE. And then"}, {"Review": "I didn't damn like it, but I owned it and it's on one of my badge challenges so I read it. Trying to get as much read before chemo in May. Trying to get rid of things or get them on the shelves. And no, I'm not writing a big review. I'm over that unless it's a re read. Or I will review later. You guys can read some of the popular book bumpers with the great reviews and a million likes. But take some time to read the non book bumpers that have a few likes with amazing reviews. Pisses me off so ma"}, {"Review": "  \"Not any more. In ways too dark and crucial to be called metaphorical, I never left that wood.\"  I know that I ought to gather my thoughts to organize them or whatever I usually do before writing a review, especially when the last page let me shell-shocked as In the Woods did. But I can't. I'm leaving tomorrow and I'm not one for writing reviews weeks after having read the damn book. I'm actually in awe of people who manage to do just that. I think that it says something about me : in the end,"}, {"Review": "This book is tricksy.Rob Ryan is a veteran homicide detective with the Dublin police along with his best friend and partner, Cassie Maddox, and the two start working a case involving a young girl found murdered at the site of an archaeological dig. Sounds like it could be the cold open of an episode of CSI: Ireland, right? Ah, but that’s only part of the story. Rob is actually from the area where the girl is found, and 22 years before he and two friends went to play in the nearby woods and somet"}, {"Review": "It's been a while since I have read a book that has left me so utterly devastated, a book entailing such a profound emotional investment that having finished it I feel a gaping emptiness within, a sense of loss. It feels like my heart has been simultaneously crushed into pulp under the weight of the tragedies that descend on the lives of a handful of characters and blown to smithereens. And I would never be able to pick up the pieces and glue them back together into a throbbing whole again.I rea"}, {"Review": "I started this series out of chronological order, which only increased my appreciation for French. By some odd chance, I happened upon a new copy of her second book, The Likeness, in the library just waiting to be checked out, while In the Woods had a wait list of at least 100 people. I followed with Faithful Place, immersed myself in Ireland of forty years ago and promptly forgot to get on the waiting list for Woods. Nataliya's lovely review reminded me what I was missing (here: http://www.good"}, {"Review": "3,5🌟A cover for Lithuanian edition. Creepy, IKR! 😱I must thank two of my GR friends, Ginger and Michael, for turning my attention to this peculiar book! Thanks, guys 😉💜Interesting plot with mysteries and stuff.The story started off very well, with funny bits, conversations and I was hooked in from the very beginning. The first person narrative really helped and I liked following Rob Ryan in his investigation, he made me a partner and I love it in my detective reads. The grim and real police work"}, {"Review": "*4.5/5*This took me ages to read, but I loved it! There was one small plot point that annoyed me a bit, but other than that it was perfect. I barely ever read murder mysteries, but after this I definitely want to read more! "}, {"Review": "When a twelve year old girl is found murdered at an archaeological dig, Detective Ryan and Maddox are on the case. But what does this case have to do with a similar case twenty years earlier, a case that saw an adolescent Ryan as the only survivor?As a veteran of detective fiction, riddles, and brain teasers, I'm a big fan of mysteries that keep me guessing. In the Woods was one of those sorts of mysteries.In the Woods is the story of two detectives looking for answers, both on the case they're"}, {"Review": "A very well-constructed and impressive debut novel. I had a bittersweet moment near the end when I realized that my theory from near the start of the book was correct; happy to be right, but also a bit bummed that I had figured it out. It wasn't much of a twist for me, but I honestly don't know how I solved it so early on. Don't let that keep you from reading this book. There were still quite a few surprising moments that didn't deal directly with the mystery, and those were incredibly satisfyin"}, {"Review": "I've heard about readers who become so absorbed in a good book that they stay up late to finish them, or talk to the characters, or turn the pages hoping that something bad doesn't happen to them. I rarely if ever have reading experiences that primal; I'm usually analyzing the character development, narrative, even the margins and the design of the book, all from a safe remove, sort of like a naturalist perched in a camouflaged blind, studying.In the Woods, Tana French's debut novel which launch"}, {"Review": "As seen on The ReadventurerIn the Woods reminded me a lot of Gillian Flynn's novels (Sharp Objects and Dark Places). All these books are very dark mysteries/psychological thrillers and they all are as much about particular crimes the narrators investigate as they are about the narrators themselves, a disturbed bunch.Rob Ryan, a detective on the Dublin Murder squad, and his partner Cassie Maddox are assigned to investigate a murder of a pre-teen girl. The thing is, the girl's body is found in the"}, {"Review": "4.5★“What I am telling you, before you begin my story, is this—two things: I crave truth. And I lie.”Adam Ryan was the surviving member of a trio of Irish children lost in the woods a generation ago. There’s been no sign of the other two all these years. He was found injured with someone else’s blood in his shoes, and to this day he can’t remember what happened, other than a feeling of terror. His family moved from Dublin to England, where he acquired a polished English accent and adopted his mi"}, {"Review": "This is going to sound silly (this book did win the Edgar Award after all), but don’t read this for the mystery. Although suitably disturbing, the murderer is fairly obvious. And, I won’t lie to you – the phrase “Munchausen by proxy” is thrown around a few times. Also, there’s the fact that the alternate title for this book could be: Complete and Utter Lack of Closure In The Woods. Don’t read this if you need everything explained.Read this if you like to be consumed by a character – so consumed"}, {"Review": "Now this is my kind of book. This is the best book I have read in a very long time! In the Woods has been languishing on my list forever, probably because it has mixed reviews. I am thankful I finally gave it a shot. Tana French writes beautifully, but in a way that does not hinder the flow of the story. The protagonist, young Irish cop Rob Ryan, tells the story in retrospect. This is done subtly with real-time Rob interjecting only sporadically until the end when he directly delivers the epilog"}, {"Review": "Adam Ryan is a pretty compact, if cool name. That's the name of our main protagonist. His trials are deep, both when he was a boy, and also when he is working in the police force.From the point of view of a reader who has read the books in disorder, there are many ah moments. I remember future events with clarity and purpose. This book must have demanded a lot from its author.I say that because it's not easy to pry open the genie in the bottle and ask for inspiration as a favor. Tana French is n"}, {"Review": " What I am telling you, before you begin my story, is this - two things: I crave truth. And I lie. 4.5 starsIf I ever hear anyone say that murder mysteries are never well-written or literary I will shove this book in their face. I devoured this rather large gem within a couple days and found myself thinking about it long after I had finished.I can see how this book will only be enjoyed by a certain type of reader. If you’re annoyed by metaphors, similes and other literary devices or don’t like w"}, {"Review": "Well, at the beginning I thought this book would be five stars. An intriguing premise: a great opening: beautiful evocative language that you usually don't see in a mystery. The story also had great characterisation and moved at just the right pace.Then, about 80% into the story at the time of the great revelation, everything went phut! for me.Adam \"Rob\" Ryan is part of the Dublin Murder Squad. He is partnered with Cassie Maddox, a resourceful female detective. Rob Ryan harbours a secret: he is"}], "ID": "2459785", "Name": "In the Woods"}