{"Name": "Out of Time", "Image": "https://images.gr-assets.com/books/1527712345l/39880881.jpg", "Reviews": [{"Review": "Love this story! Action, suspense and steam. 4.5 Stars~~~~~~~~~~~~~~~It seemed like it has been quite a while since the last installation of this series, so it took me several chapters to really get back into the story. I kept getting this feeling that I was missing something and sure enough there was a book in between that I did miss.I was getting fed bits and pieces of the story and was able to patch together the general plot of what it happened to the team after the first book. Moving forward it was good but it definitely would’ve been helpful to read book two first. AckBut with that said Out of Time was definitely high in emotion, in suspense and mystery, and definitely high in the lust factor. Scott and Natalie are created perfectly. The love/ hate relationship keeps the reader on their toes but you can feel their true emotion and love for each other simmering underneath. We go through what they feel… love, shock, anger, understanding, and so much more. It feels like a roller coaster at times.The book is fast-paced and full of suspense, black ops military jargon and action, and let’s not forget the hot military men… the real reason we read these. Amazing! YumHeat and all consuming love is flaring up all over the place and strangely enough, I am good with that. I love when a tough guy can feel and recognize the softer side. Scott is just perfect balance of tough, strong, sexy, and possessive. Love me an alpha male!McCarty brings it with a completely plausible plot that is twisted and raw in so many ways. You get the highs and the lows; the gutted feels and the sweet heat of romance. She brings a story that you will remember long after its over.* copy received for review purposesfull review - https://amidlifewife.com/out-of-time-..."}, {"Review": "4.5 StarsI’ve loved every book in this series, and I’m thrilled that we get not only one romance, but two! I’ve been waiting for Kate and Colt’s romance since they’ve been featured in bits and pieces with every installment and I was thrilled they got equal page time with Natalie and Scott. Both romances were amazing! Explosive chemistry and a bit of angst as they each must sort the past out, and find out who was responsible for the attack on SEAL Team Nine. I do think this series is best to read the series in order, but that’s no chore because all the stories are exciting, addictive, and filled with sexual tension and sizzle! I’m wondering if this is the last book in the series? If it is, Out of Time ends The Lost Platoon series perfectly, but I’ll be sad to say goodbye to the characters!A copy was kindly provided by Berkley in exchange for an honest review."}, {"Review": "I have been devouring this series as soon as each book comes out and after the way the last book ended, I was definitely excited to finally have Scott's story!After their unit was double crossed and only a few men survived, these Navy SEALs are forced to relocate across the globe and hide until the mole is uncovered. Scott feels responsible for his team's ambush, especially since his girlfriend in the Pentagon might have had something to do with it. Natalie was adopted from Russia when she was young and learns she was part of a program of Russian sleeper spies. And it's now her time to be awakened. Natalie tries to do as much as she can to hide and help Scott's men, but when Scott tracks her down, she has to convince him she's on his side and all of her feelings for him were always true. Going into this one, I was couldn't wait to follow Scott and his search for answers regarding Natalie. Was she really a spy and the reason so many of his men died? What would Scott do when he finally caught up with Natalie? I loved having both of their perspectives so we could see how broken up Natalie felt over the situation and how conflicted Scott felt over if he should believe her or not. Their romance was pretty angsty, which I loved!While this was Scott and Natalie's story, we also got a side plot of Scott's sister's romance with her ex-husband. I enjoyed following their story too as they tried to help Scott uncover what happened with Natalie and his team. I do wish there was a little more suspense in this one than what we got, but it was definitely more focused on the relationship than heart-pumping action. If you haven't picked up The Lost Platoon series, I definitely recommend that you do! They have great romance, great characters, and a serious mystery behind who betrayed the team and what will happen to the SEALs all across the globe. "}, {"Review": "I guess this was the last one then, I mean the story wrapped up so it has to be. Though we did not get all the lost guys, a shame. Who knew what fun things they were up to while hidden.The pieces are falling together in this one. Who was behind the missile strike that killed half the team? You will find out. But first, romance!Scott loved his girlfriend. The girlfriend who warned them so he could save half his team. The girlfriend who is a freaking spy!? Yes he was not happy to learn that. Who can blame the guy! He was honey trapped. Big tough Seal, who always does things by the book, fell for a spy.Nat, well she is not the spy you think she is. Poor woman! I want to wring some necks for what they put her through. Though to be fair, she could have tried trusting others to get her out. Like her boyfriend, who is a seal! But then she is a crappy unwilling spy so no wonder she can't find a way out. And I liked her, she truly loved her family.Now they meet again. They think the other one is dead. And one is really really angry.Sparks fly! There are secrets. And there are baddies after them. But between that they try to find each other again.There is also the side story of Kate and Colt, that has been going on through out the books and they will finally get a hea too.I enjoyed it.NarratorI like his big strong voices and the women voices too. He does those well. He does the book justice."}, {"Review": "I love this series, but, I don't like waiting so long between books. With an overarching plot it is difficult keeping track of all the characters and plot developments that are important to finding out who the ultimate baddie is. That said, \"Out of Time\" is a great story and Scott and Natalie are a couple caught up in situations they never thought could happen to them.A team of Navy SEALs goes on a top secret, black-op mission to Russia and disappears without a trace. Neither the Russians or the US will acknowledge what really happened to them. Lieutenant Commander Scott Taylor and five others survived and they did so because Scott's secret girlfriend, Natalie Andersson, warned him of the danger. Shortly thereafter, Natalie dies in a fiery auto accident. As luck, or fate, would have it, Natalie wasn't the one to die. But she knew that if she didn't stay dead, she would be for real the next time. Natalie was brought to the US from Russia as a child adoptee and had few memories of it. That didn't matter when she was contacted and forced to spy in order to keep her family safe. Falling in love with the \"honey\" in her trap was not exactly the plan. Despite her every effort to protect Scott, and thwart the Russians, the op failed and Natalie is on the run with Scott hot on her trail. Scott, a by-the-Book kind of guy, is livid at what Natalie has done. He finds out that life isn't always black and white, there are a lot of shades of gray too.The second chance romance of Scott's half sister, Kate, and his former Chief, Colt, has played out throughout the series. I have to say that this is a highlight for me. The tangled misunderstanding and lack of trust issues of these two have seemed to be insurmountable and just so very real. So does Colt's attempts to own up to his part and fix it."}, {"Review": "At the heart of it, ‘Out of Time’ is one of assumed betrayal, even more assumptions that the protagonists have of each other and the elasticity of truth, all of which revolve around a botched mission, a missing SEAL team and questionable loyalties. By and large, I did like Nat/Scott’s story though I found the secondary couple of Colt/Kate more compelling in the whole narrative arc of lies, deceit and vengeance as the characters pursued some kind of justice for themselves and for the dead men. Dealing with 2 couples isn’t an easy feat by any means, though the focus on 4 major characters did mean less focus on each couple, which left me a feeling little short-changed about it. ‘Out of Time’ is not a standalone and that much becomes obvious when the opening few chapters leaned hard on prior knowledge of previous books to get the story of Natalie and Scott going. Yet there was more telling than showing at times - the mesh of time periods within a scene - and that got me confused and mildly frustrated, having needed to pause multiple times to mentally untangle and piece together what had gone down, when and with whom. The use of flashbacks or at least, something more linear as a storytelling device would have worked better than the mental gymnastics it took at times. It isn’t to say however, that ‘Out of Time’ isn’t a decent read. I thought it was the best out of McCarty’s series in fact…only that it could have been longer and a bit more drawn-out—given the scope of the story and the pairings involved—for a less abrupt ending. *Full Review to come*ARC by the publisher via Netgalley"}, {"Review": "I didn't realize this was part of a series when I picked this one up. That said, it wasn't too difficult to get in to the story. I felt for a few chapters that I was missing something but once the action got going, I was sucked into the story. This one is about Natalie and Scott. They have lots of issues to overcome and some truths to be revealed. Not much more I can say here without revealing the plot. Needless to say, there have been some wrongs and finding out if it truly was Natalie who betrayed everyone takes some time and some team work. I liked Natalie and Scott as a couple. They have a history so it was easy for them to fall back into each other. I almost liked reading about their past as much as their movement to heal their hears. Good suspense story. **Complimentary copy provided for an honest review. "}, {"Review": "A short while ago I read the second book in The Last Platoon series and quickly grew obsessed with a certain couple. Imagine my surprise when I found out that my favorites were not the main characters in this final book. I went into it just a bit sad, but Monica McCarty did such a bang up job with this book that the sadness lasted for like 0.1 seconds. Bonus, I got TWO amazing romances in Out of Time. Second bonus, one of the couples was my favorite couple!What I have loved about these books are just how easy they are to devour. The characters and the plots are equally interesting and don't even get me started on how swoony the romances are. In Out of Time, the main couple featured are Scott and Natalie. Scott and Natalie used to be a couple before the devastating secret Russia op, but Scott is heartbroken and devastated when he finds out Natalie was killed for trying to help his team. His devastation increases by ten-fold when he learns that Natalie wasn't who she said she was - she was a Russian spy. And then he finds out that she's actually alive and living under a fake name - and boy, was he angry. Now, does that not sound absolutely tantalizing? This book had just the kind of angst and torture that I like in my second chance romances. Obviously, there was much much more to Natalie than being a Russian spy, but the trust between the two was on shaky ground. Despite that, their chemistry was stronger than ever and it was just a treat watching them slowly try to understand the other. Scott was such a complex character. He was a jerk to Natalie at times, but his arrogance and frustrations were understandable. I did easily soften up to him, and I thought he did a good job at redeeming himself towards the end. I liked Natalie a lot too. She let Scott be angry because she understood his thought process, but she also did not let him walk all over her. She had gone through a lot, and I really wanted her to find her HEA.Then, we were privy to Kate and Colt, my two stubborn children, who I shipped so so hard. These two really made my heart ache in this one and I was a complete mess over them by the end. Kate and Colt had a lot to work through to fix their broken relationship and trust in each other, but the journey was glorious. My gosh does Monica McCarty know how to write intense sexual tension between her characters. These two were HOT, HOT, HOT! Like in the previous book, I totally thought Kate and Colt stole the show again. The plot was also exciting in Out of Time and a lot of the threads from the previous two books finally came together. I enjoyed the book so much that I almost wish it had been longer because I was just not ready to let these characters go.The Lost Platoon books are so entertaining and swoony, so if you're a fan of romantic suspense, you should definitely try them out!"}, {"Review": "This was the best in the series! All the questions about what really happened that fateful day when all but 6 of a Seals platoon are killed while on a secret black ops mission in Russia forcing them to go dark and pretend they are dead until they can figure out who betrayed them.  Lt Commander Scott Taylor was the one that got the warning to call off the mission right before everything went FUBAR managing to save 6 of them. The warning came from his girlfriend who works at the Pentagon. While they are still Russia trying to figure out how to get out undetected he finds out that she had died and suspects it's because she warned them. Months later the remaining team find out that Natalie was a sleeper Russian spy and Scott grapples with betrayal about the woman he thought he knew and loved. From here things get interesting... I won't spoil anything, but things are not always what they seem. Throughout each of the books there has been more than just the ongoing look into who betrayed the team. Colt Wesson, who trained Seal Team 9 but was not part of the mission in Russia, and his ex-wife Kate who is a CIA analyst, ongoing messy relationship finally comes to a head and resolution in this book. The two of them, though at odds, where big parts of all 3 books. The main plot points of the series are wrapped up by the end of this book and though some were sad the majority were very satisfying. I read there may be a spin off of the series and hope that's true as I have truly enjoyed The Lost Platoon which Monica McCarty first contemporary romantic suspense series (in case you didn't know she is known for writing Scottish historical romances) "}, {"Review": "✦Review & Giveaway: OUT OF TIME (The Lost Platoon) by Monica McCarty https://wp.me/p3d0RZ-aZjPublication Date: December 31, 2018Genre: Romantic SuspenseReviewed by: Reading in Pajamas/ Donna Rated 4 StarsI enjoyed this installment in the Lost Platoon series, even though it started out a bit slow for me. There was a lot of talking about and searching for clues to what happened in Russia. It picked up for me about a third of the way in. I like Natalie and understand why she did the things she did, I also understand her attraction to Scott. Their relationship sure needed some work, but their physical relationship was spot-on. I am glad questions were answered, and that the series is moving in a slightly different direction. Maybe then the Unit will be together and hopefully show the camaraderie that I love with group series.*Review copy provided by Penguin in exchange for an honest review.~*~*~*~Kindle https://amzn.to/2FivSx1 ✦The Lost Platoon Series by Monica McCarty✦1. GOING DARK ➢ Review 5 Stars http://wp.me/p3d0RZ-9G1 | Kindle http://amzn.to/2qtdF552. OFF THE GRID ➢ Review 4.5 Stars https://wp.me/p3d0RZ-aO5 | Kindle http://amzn.to/2subV0J 3. OUT OF TIME ➢ Review 4 Stars https://wp.me/p3d0RZ-aZj | Kindle https://amzn.to/2FivSx1"}, {"Review": "\nA gripping and intense story\n5 starsBefore I start to wax lyrical about this fantastic book - let me first say that this is the third book in the Lost Platoon series. It does stand alone but had I read the other books before this one, I would have been a bit more up to speed with who the supporting characters were and what the general background of the whats and whys of the mission of SEAL team nine. I’m assuming these stories fit in nicely to the timeline of this one and characters from those books (Going Dark and Off the Grid) make very minor appearances in this one. Except Kate and Colt - but more on them later.This story features Scott and Natalie and I just couldn’t have loved them more. Despite the assassins, spies, and general death and destruction - their’s is the kind of relationship that I want!! Scott is a by the book, very alpha, very capable navy SEAL. And, obviously, he’s gorgeous to boot. His job is his life…until he meets and falls in love with Natalie. From there, he’s still all about the mission - but he can’t get Natalie out of his head or heart - even when she’s outed as a Russian spy. Natalie was a really relatable character (Russian spy business aside). She was fun, feisty and her emotions were always right there for us to see. She’s the kind of girl I would want as a friend. Her and Scott together - oooft - it was intense! Lots of tension, lots of smouldering and, when we finally get to it, lots of deliciously enthusiastic sex. The emotion fairly smoked off the pages as you read. Yum!The story was fairly simple and while there was some ‘wonderings’ of who was doing what to whom, the author didn’t use confusion or a smoke-screen in order to tell her story and make it suspenseful and gripping. The writing was fresh and clever with the romance, suspense and action all managing to take centre-stage yet not over shadow each other. For me, the most telling thing about this book was that I fair devoured it. I couldn’t stop the pages from turning and I even found myself thinking about it when I wasn’t reading. Who needs to think about anything else than reading anyway?As a bonus, we get another second chance love story included with this book. I’m assuming that Kate and Colt popped up in the earlier Lost Platoon books - we certainly hear that there’s been some more recent history between this ex-husband and ex-wife. And their story gets its resolution in this book. If I wasn’t already in love with the book because of Scott and Natalie - I certainly was after Kate and Colt. Their story was almost heartbreaking in its intensity. Everything that had gone on between the pair seemed almost insurmountable except that they truly did love each other and want it to work. This could have been a full-length novel in and of itself so I was delighted to have it included with the main story.Out of Time is a gripping and intense story with interesting and relatable characters - highly recommended. I’m now off to buy and read the first two books in the series and keeping my fingers crossed that there are will be more from the Lost Platoon. 5 stars."}, {"Review": "This isn't one of those series that you can jump into on book #3 and be able to enjoy the story with no background. It's actually a little hard to get into at first because the reader is expected to know things that happened in previous books and time keeps jumping forward to glimpses of events that take place in previous volumes. It helps long-time readers place where/when the story takes place, but it confused me and kept me from really forming any kind of attachment to the characters.The plot centers on two couples and the aftermath of a mission gone wrong due to spying and treason. There's quite a lot to work within that area and there are definitely interesting twists and turns to keep you turning pages. It does suffer a bit from being really predictable when it comes to who the real baddie is, but the journey there is full of woes, romance, action, and solid dialogue. I won't say I'm now a huge fan of McCarty and that I'm dying to read the rest of this series, but I can't say that I didn't enjoy it. "}, {"Review": "Out of Time is the third novel in Monica McCarty’s romantic suspense series, The Lost Platoon. The series revolves around a platoon of Navy Seals, Seal Team 9. This volume is centered around platoon leader, Scott Taylor, and his love interest, Natalie Andersson, also known as Russian spy, Natalya Petrova. Scott’s sister, Kate, and her ex-husband, Colt Wesson, are also featured in the story. Both relationships are complicated, but the primary and supporting characters are all fully developed, as is the plot. I haven’t read any of the previous books in this series, so some of the backstory and references were unclear, but McCarty weaves a web of intrigue, betrayal and romance that fully captured my attention. The sex scenes are smoking hot; no chaste romance in this one. All in all, I enjoyed this novel.I was chosen to read an advance copy of this book as part of Penguin's First to Read program. However, the opinions expressed in this review are 100% mine and mine alone."}, {"Review": "Another great story in what I’m guessing is the last in this series. Scott, the commander of the team, tracks down his late girlfriend’s friend only to discover that she is his girlfriend,Natalie, who was supposed to be dead. Natalie was the spy who caused the deaths of his team. Naturally it’s never as simple as it seems. Along the way we also get to see Scott’s sister,Kate, who is CIA, come to terms with her ex-husband,Colt, who was one of the survivors of that Team. Everything was wrapped up beautifully in two great HEA’s. I’ve really enjoyed this series. Sorry to see it end. "}, {"Review": "4 starsABOUT THE BOOK: Release Date December 31, 2018 A team of Navy SEALs goes on a mission and disappears without a trace--they are the Lost Platoon. With his men scattered to all corners of the globe after a disastrous secret op in Russia, Lieutenant Commander Scott Taylor is trying to find out who was responsible for leaking the information that killed half his platoon. Were it not for Natalie Andersson, the woman he had been secretly dating in the Pentagon who had warned him of the danger, he knows they would all be dead. Scott is devastated when he hears that the woman he loved and hoped to marry has been killed for helping him--until he learns that Natalie was the spy who betrayed them. But when his search to clear his name brings him face-to-face with a very-much-alive Natalie, Scott realizes that justice and vengeance might not be as clear-cut as he thought.Natalie Andersson, or, as she was born, Natalya Petrova, has put the memories of her early childhood in Russia behind her. She never dreamed that she would be at the center of an elaborate \"sleeper\" espionage program. Even when she learns the truth, she refuses to spy for the country of her birth, until the Russians threaten the lives of the only family she has ever known. But Natalie is the worst spy in the history of spying, falling for her target. When her attempt at misdirection leads to irreversible consequences, she is forced to run for her life, with her lover hot on her tail.•••••••••••REVIEW: OUT OF TIME is the third instalment in Monica McCarty’s contemporary, adult THE LOST PLATOON romantic, military suspense series focusing on SEAL Team Nine whose members are MIA or dead following an unsanctioned and undercover mission to Russia than went horribly wrong. This is thirty-three year old Lieutenant Commander Scott Taylor, and former executive assistant to the deputy secretary of defense, twenty-nine year old Natalie ‘Natalya Petrova’ Andersson’s story line. OUT OF TIME can be read as a stand alone but I recommend reading the series in order for back story and cohesion as there is an on-going theme and premise throughout including the rekindling relationship and romance between former husband and wife duo Colt Wesson, Team Nine’s former chief, and CIA agent Katherine ‘Kate’ Wesson.NOTE: If you have not read the previous instalments there may be some spoilers in my review.Told from several third person points of view including Natalie and Scott, and Colt and Kate, OUT OF TIME follows in the aftermath of SEAL Team Nine’s disastrous mission to Russia in which eight men didn’t make it out alive, and the survivors have found themselves in hiding around the world. Thirty-three year old Lieutenant Commander Scott Taylor struggles to get past the betrayal of his former love, a woman now deemed a Russian spy for her supposed role in the attack against Scott’s former Team but also a woman presumed dead in an accident meant to cover a trail of betrayal and spies. Determined to uncover the truth, Scott goes in search of a someone with connections to the past but discovers the woman he once loved is alive, with more secrets that are about to change the course of their lives. What ensues is the rebuilding relationship and romance between Natalie and Scott, and the potential fall-out as a suspected mole has sent their sights on the remaining members of Team Nine.The relationship between Scott and Natalie is one of second chances. Scott wants nothing more than to take down and crush the woman he once loved but once the truth is uncovered and revealed Scott must come to terms with what was, and what is about to be. The $ex scenes are intimate and passionate without the use of over the top, sexually graphic language and text.Meanwhile, former husband and wife duo Colt Wesson, Team Nine’s one-time chief, and CIA agent Katherine ‘Kate’ Wesson find themselves working together in an effort to bring home one of their own. Colt’s past treatment of his former wife is reprehensible and heart breaking in light of the revelation of secrets and truth, and as such Colt works tirelessly to win back the woman who’s heart he destroyed.The world building continues to focus on the search for the truth. Secrets and lies are exposed; betrayal and treason come at a cost.OUT OF TIME is a suspenseful and revealing story that follows several paths towards truth and retribution. The premise is heart breaking, engaging and real; the characters are animated and colorful as they struggle to make sense of it all; the romance is seductive. OUT OF TIME is a compelling and energetic read but I struggled with the quick resolution, and the lack of information regarding the guilty party’s demise.copy supplied by Netgalleywww.thereadingcafe.com"}, {"Review": "4.7This is the book I wanted to read the most. Scott was calling my name since I've read about the secret source who told him about them being set up in the first book. As book #2 developed I was having an idea of what was to come in this book, and I was not disappointed!So, there's A LOT going on in Out Of Time. Scott discovers Natalie's alive, and that she betrayed him. We also get to know about their relationship before Team Nine was brutally attacked by russian missiles. Natalie and her sister were adopted from Russia as childs by an american couple and were raised in América. What Natalie discovered later was that she was part of a group of children sent to US with the intention of turning them into spies when they became adults. She was shocked when it came the time for her to do what she was supposed to. She turned into somebody that wasn't her exactly. She was the confident assistant of a poltician in the Penthagon. Her persona turned her into a woman focused on her career, sexy and sure of herself. She needed to find out importante information about military ops and pass it on to other russian spies. She only did it in order to protect her Family. She never intended to have a relationship with Scott, but wha started out as chemistry turned into something far more powerful. As much as she loves Scott, she could never tell him the truth, and when someone tries to kill her, she knows she must run to save her life.When Scott reappears in Natalie's life, he notices that's a lot he didn't know about her. He only cares about bringing her in to try to discover what happened to his Team. He starts to hear what she has to say and believe, little by little, and that's how they try to make the relationship that was based on so many lies, turn into something true, while at the same time trying to clear both their names, keep her Family safe and finally get to know each other with no lies between them.I was happy and sad at the end of this book. I was really looking forward to get to know the rest of Team Nine, and was hoping for a book for Kate and Colt, but their story was beautifully toldin this book. It was angsty, but really beautiful. I just loved them since they first appeared on book #1, and am glad they got their HEA too.I'm keeping my fingers crossed that Monica McCarty will have a new series for a new secret group of Seals *hint hint*. I'm looking forward to read more from this author."}, {"Review": "The whole idea of the Lost Platoon Monica McCarty created is intriguing: A team of Navy SEALs on a secret mission in the Arctic Circle to find a secret Soviet military base, are attacked upon arrival in the remotest of remote locations, and the survivors scatter to the winds until they can regroup and find the saboteur. McCarty ratchets up the suspense even higher in this tense third installation, OUT OF TIME, with a Russian sleeper agent.The investigation of the saboteur and resulting destruction of SEAL Team Nine continues, but like the first two books in the series, McCarty peppers in details through memories and real-time investigation from the different survivors. The main focus in OUT OF TIME is on Lt. Commander Scott Taylor and the sorrow he faced in learning the woman he’d been having an affair with, Natalie Andersson, not only warned him of the danger, but was killed in retaliation for helping. And then the rage he felt in learning that she was a Russian sleeper spy — and still alive.Scott should’ve known there was more to Natalie’s motives than what’s on the surface. His life is, after all, steeped in secrecy and duty, too. Natalie, like her motives, is nothing like the cold-hearted monster he’s assumed her to be. The difference is that Scott chose his life and his calling, and Natalie did not. She is the very picture of someone who makes the choice to live or die because her back is against the wall. And then how do you choose? There is no right answer … just a response that will reduce as much damage and fallout as possible.There’s a lot happening in OUT OF TIME, but the forward momentum McCarty develops carries the story at a breathtaking pace. As usual, her characters are lush and richly developed, and their plight forces you through an emotional wringer. There’s some serious tension and anguish going on here, y’all. But this is the holiday season, and McCarty charts a path for her characters to follow the twists and turns, and leads them from betrayal to forgiveness, with all the good stuff in between. If you haven’t gotten lost with any of the Lost Platoon yet, you’ve still got time.*Originally published at USA Today's Happy Ever After: https://happyeverafter.usatoday.com/2..."}, {"Review": "First, let me preface this review by saying that I did not read the first two books in the series, and perhaps I should have. Right off the bat, I had trouble getting into the story because the first few chapters are spent on reintroducing characters and plot lines from what I'm assuming took place previously in the series. It was a lot to take in. That said, I honestly enjoyed the book as a whole.I loved the chemistry between Scott and Natalie, even if the \"failed Russian spy\" storyline didn't mesh at times and the ending was way to neatly wrapped up. Their passion and love for one another is more than enough to carry their story, though. I also fell in love with Kate and Colt, and I appreciate that McCarty didn't gloss over the serious issues they need to get past in order to get their happily ever after. (view spoiler)[People tend to have a lot of difficulties changing their ways in order to make a relationship work, so Colt's willingness to put his issues aside to be the husband Kate deserves is noble yet not necessarily very realistic. That said, I was pleasantly surprised that Kate agrees to give Colt another chance as long as he goes to counseling with her. There's no way a couple can move past the crap these two have been through without a lot of help and understanding, so this made their particular plot line much more believable to me. (hide spoiler)] Well worth the read!"}, {"Review": "Of the three books in the Lost Platoon series by Monica McCarty, Out of Time is probably the one I enjoyed the most. I found it more fast paced than book two (Off the Grid) and slightly more compelling than book one (Going Dark), though maybe that's because all pieces of the plot finally started fitting together and I got answers for a lot of things the previous books left unsaid.  Natalie's actions irked me a bit - though she sort of redeemed herself at the end, all that running away and not trusting Scott to help her got a bit old as the story unfolded. Scott, on the other hand, was much more consistent as a character, even if he had his own demons to fight. There were one or two holes in the plot - mostly things the author could have explained a bit better - such as why no one seemed to be looking for Jennifer, the woman that died in Natalie's place and whose identity she claims afterwards. Maybe Jennifer had no family and no other friends, but that still got me wondering. In any case, the details above did not prevent me from enjoying Out of Time immensely, so this is a book I would recommend to anyone who loves romantic suspense. It is, however, not the easiest book to read as a stand alone, so probably it's best to start with book one and go from there. "}, {"Review": "I loved the characters in this series, especially all the alpha men; Dean, John, Colt, Scott, swoon swoon swoon swoon. This third book (and I'm assuming last book in the series, since the big mystery was solved) wrapped everything up and I'm glad we got to see where people ended up. The plot was good and I'm a sucker for a good SEAL romance.BUT the writing was extremely repetitive. It started to grate on me. Not only was it repetitive in rehashing things we already knew, but descriptions were also repetitive. For example, Colt and Kate, we know they are still madly in love with each other but have problems with the past but do we need to go over past events EVERY time we encounter them in the story? Also, likewise with Nat and Scott, they are going to have a hard time trusting each other again, we know, but does it have to be reiterated in every scene that she ripped apart his trust for her?So what I'm saying is, I loved these characters so much, I powered through to the end because I needed to know how it all turned out."}, {"Review": "The third in the Lost Platoon series, Out of Time was a very good read. Having not read the previous two I was still able to follow along with was happening in this story. The author does make reference to previous events, but it was easy to follow. Out of Time never had a dull moment, it had a lot of action, suspense, government espionage and most importantly, romance.We actually get two romance story lines, but Scott and Natalie's is the main one. Circumstances drove them apart and it was the same ones that brought them together again. To see them reconnect was difficult to read. I felt for Natalie the most. She had had a difficult past and it wouldn't let her go. I was wondering how the author was going to bring them together, since Natalie was being blamed for a mission going wrong that caused for some of Scott's team members to lose their lives. The story had a very believable conclusion.Overall it was great story! Highly recommended!Thanks to the publisher for the ARC in exchange for an honest review."}, {"Review": "Scott Taylor was willing to break the rules of his SEAL team when he fell in love with Natalie. But then a mission went wrong that left half his team dead, and all signs point to Natalie as the culprit. As he tries to root out why someone wanted his team dead, he tracks down Natalie to get answers, but confronts the problem that maybe things aren’t as black and white as he wants them to be – and maybe he still has feelings for her. This is the third book in a series that follows the SEAL team members in hiding, and while telling the story of Scott and Natalie, continues the story of Colt, his former team member, and Kate, his sister. Since this is a romance and inevitably has happy endings in sight for all couples involved, it drives me a little crazy that there’s multiple stories being told, but all in all, McCarty does a good job of drawing you in to the emotions of the characters, and rooting for them to overcome their differences with the people they care about."}, {"Review": "This is the third book in what at first glance (especially the cover art on these books) appear to be mindless \"bodice-rippers\"more like the Harlequin Romance books. I almost missed out on some good reading if I hadn't been able to see past the beefcake type cover photo myself.The books are actually written with the worldview of the high level, elite special forces units, along with intrigue, deceit, betrayal plus LOTS of steamy, graphic sex scenes... Those are actually the least believeable parts of the story. While those of us who come from \"Leg\" (non-airborne qualified) specialties sometimes like to razz the SF guys, there's an underlying respect for the level of training & dedication it truly takes just to finish PART of their initial training. While the author DOES explain the reasoning behind things most of the time he doesn't talk down to the civillains while at the same time he uses reasonably realistic tactics & descriptions of equipment."}, {"Review": "More Reviews Here: Readers Live A Thousand LivesThis series has been a ride and I am so glad I finally have my answers. There were a lot of twists and turns along the way, but in the end this series delivered.This book did take me a bit to get into, which has kinda been consistent through this series, but once I get into the story I REALLY get into the story and devour the rest of the book. At about the 45% mark I just could not stop. I really adored Scott and even though it took a bit for me to warm up to Nat, I loved her in the end. I gotta admit though that Colt and Kate are who stole the show for me. I have been invested in those two since the first book and they both made my heart happy in this one. A certain scene towards the end had me both super happy and super nervous, but of course it takes something big to make those two finally start moving forward.I also loved that this book kept me on edge. The suspense angle was done so well and I was so nervous about it that sometimes I was like “okay okay enough kissing, I need to know what’s going on here.. kiss after we get answers”. But because I’m me, the romance was also great. Romantic suspense is such fun when done right and here it’s done right.Out Of Time was a really enjoyable read and I’m so glad I have my answers. I think this is the end of this series but I wouldn’t mind catching up with these characters again in the future."}, {"Review": "I haven’t read the previous books in this series. This isn’t a stand-alone book you can just read on its own. For the first 20-30% of the book I was mostly confused, trying to piece together what was actually going on. There was a back story that I had missed with not reading the first 2 books. I liked the storyline when I got to grip with what was happening. The story had a strong start but then kind of lost its flow in the middle. The last 20% was the best part for me. It was full of action and twists and turns. I didn’t connect with the characters though which was disappointing. I think that had a lot to do with the story being hard to get into at the start and the changing POVs. We had POVs from 4 people. I found parts of the story predictable and repetitive which in turn made the story a bit boring. I think if I had read the previous books my rating may have been slightly higher. Overall it was an ok book for me! "}, {"Review": "I read the first book in The Lost Platoon series when it came out and I missed the release of the second. I don't think it mattered. This one wrapped the series up and it seemed that it did it much sooner than I expected. Book One followed one member of the platoon and I expected Six books to follow each of the six members. Did not happen. While I liked the characters the action seem rushed and the solution also rushed. At the conclusion some things were still up in the air. I wondered if it just did not sell well and the series was cut short.I received a free copy of the book in return for an honest review."}, {"Review": "I hold Monica to higher standards - this is workmanlike, but not inspired - for her. I know she has potential to do just a bit better. I love the premise of the whole series. With romance, it's really good to balance the dark with the light, originality, and punch. I enjoyed this, but I'm hoping later installments raise the average for this series.This one had a rather high body count, which really bothered me. I hope some of it is set-up for later novels. However there are only so many \"he's actually alive\" tricks an author can play before it strains by admittedly liberal credulity."}], "Genre": "Crime", "ID": "39880881", "Desc": ""}