{"Genre": "Crime", "Reviews": [{"Review": "Mario Puzo wrote The Godfather, a book that was to become an instant classic, at a time when both his personal life and that of the United States were in transition. Puzo's first two novels had not sold well, and he was almost penniless. A young, up and coming author, Puzo sought to write his version of the great American novel that would also work well on the silver screen. Meanwhile, in a time of war, the nation was beginning to view the mafia rather than Cowboys as the great American hero. Ac"}, {"Review": "English (The Godfather) / ItalianoNew York, 1945. The Italian-American boss Vito Corleone, during the celebrations for his daughter's wedding, agrees to meet some Italian emigrants that ask for his help. Thus begins Mario Puzo's masterpiece, whose movie adaptation made Marlon Brando's interpretation of Don Vito famous. With a simple and straightforward style, Puzo manages to masterfully describe a series of intricate and temporally shifted events, involving the reader and maintaining high levels"}, {"Review": "The Best! a treasure of a story,plot and movie to keep forever...good storytelling and amazing writing (paperback!)"}, {"Review": "لقد اقتبست شخصية العراب من والدتي التى احببتها كثيرا و خفت منها أكثر...مقولة لماريو بوزو  ~~~~~~~~~~~~~~~~~~~~~فيتو كورليوني ..البادرينو الرجل في صورته الاولية..الاب الذي لا يهزمه شيءقاتل .. ودود سارق..عادل دكتاتور ..جذاب قاسي..لطيف عنيف..فاتن ♡♡العروض هنا لا يمكن رفضها♡♡ كل هذه المتناقضات جمعها ماريو في شخصية صموتة حازمة ..تفعل و لا تقول.. تتواضع بلا تظاهر..تساعد بلا جدال.. تقتل بلا نقاش ..تؤلمك للابدانه اهم و انجح و اكبر \"كبير\"حظى به الادب العالمي ..الكبير المؤهل للبقاء حتى اخر نفس..تحول من عا"}, {"Review": "I'm one of the people who watched the whole movie trilogy and then after that found out that The Godfatherexists as a novel. Naturally, I had to purchase it. It is a matter of taste, I suppose, but next to the movies - so elegant and grandiose - it feels a bit like reading pulp fiction. Maybe it's that the book is lacking the presence of charismatic Hollywood giants Marlon Brando and Al Pacino, whose legendary performances rival those of Clark Gable and Vivien Leigh in Gone With The Wind. It's h"}, {"Review": "The Godfather (Mario Puzo's Mafia), Mario PuzoThe Godfather is a crime novel written by American author Mario Puzo. Originally published in 1969 by G. P. Putnam's Sons, the novel details the story of a fictional Mafia family based in New York City (and Long Beach, New York), headed by Vito Corleone. The novel covers the years 1945 to 1955, and also provides the back story of Vito Corleone from early childhood to adulthood.تاریخ نخستین خوانش: دوازدهم ماه جولای سال 1992 میلادیعنوان: پدر خوانده؛ نو"}, {"Review": "\"Come in.\"\"Ah, Don Corleone, I'm sorry to trouble you -\"\"Sit down.\"\"Thank you, Don Corleone -\"\"Where is your mother from?\"\"I'm sorry?\"\"Your mother, she is from Italia. Which town?\"The rest of this review is available elsewhere (the location cannot be given for Goodreads policy reasons) "}, {"Review": "I'm gonna make him an offer he can't refuse.قد تكون هي الجملة الأشهر فى تاريخ صناعة السينما , ولكن قبل أن ينطق بها العظيم مارلون براندو , كان قد خطها قلم روائي مبدع فى أحد الروايات الخالدة .الفيلم الذى نادرا ما تجد أحد يكرهه (خاصة لو رجل ) فهو سحر السينما مجسدًا , فله تأثير السحر ومفعوله وبريقه الذى لا يُقاوَم. قرأت نسخة إنجليزية لهذا العمل من حوالي سنتين , وللحق فهي أكثر القراءات الأجنبية التى استمتعت بها رغم أنها كانت تجربة مرهقة جدا بالنسبة لي , المهم أننا هنا لا نتحدث عن مجرد عمل روائي بل نت"}, {"Review": "   “He smelled the garden, the yellow shield of light smote his eyes, and he whispered, \"Life is so beautiful.\"   "}, {"Review": "Puzo creates his awesome world & then plays with his own elements (those of detective noir and mob drama) like a world-class chess champion. Less than a fourth into the narrative, POW! the Don has been shot. And, hold on a sec, who is the protagonist here? I thought Michael. Or the Consigliari Hagen. Or Hollywood heart-throb Johnny Fontaine? The full display of individual destinies is what makes this better than its cinematic equivalent. Here we see flesh-and-blood people living at a Hadean"}, {"Review": "Indeed, dear reader, I did not hate The Godfather. I h-aa-ted it.How much did I hate it? Well I could start with a long dissemination of Mario Puzo's simplistic and repetitive prose. Puzo seems to think the reader needs a reminder of plot points that occured ten pages ago, and that unnecessarily drawing out an obvious reveal by splitting it up into three points of view counts as suspense.Or I could give you a thorough cataloguing of how very poser-y The Godfather, with its bombastic ideas of mas"}, {"Review": "Re-reading finished, review to come...perhaps?"}, {"Review": "You gotta stop them at the beginning. Like they shoulda stopped Hitler at Munich, they should never let him get away with that, they were just asking for big trouble when they let him get away with that.You know that you are a Czech person when this is your favourite quote/sentence(s) from the whole book. I expected many things from this book because let's face it this book is a phenomenon! But, I didn't know what I will get because I never saw the movies and never read anything about the book."}, {"Review": "I’m sure you’ve had the timeless book-verses-movie argument before. Everyone has. You’re standing at the water cooler at work, and a coworker comes up to you and says “Boy, The English Patient is an excellent movie!” And maybe you say something back like “Michael Ondaatje’s Booker-Prize winning novel is far superior.” At that point, your coworker calls you a “pretentious snob” and you respond with “sewer-dwelling ignorance peddler.” There is some cursing. Maybe someone throws water on the other."}, {"Review": "Actual Rating: 4.5 StarsI think this is just what I was in the mood for!"}, {"Review": " *****5 PORQUE NO LE PUEDO DAR MÁS PUNTUACIÓN stars.*****    Review in my account bookstagram      Hilo en twitter de El Padrino    “Cada hombre tiene un solo destino.” ¿Qué se puede decir además que es una obra maestra? ¿Por qué no hay más estrellas para calificar éste libro?El Padrino es un libro que nunca se me habría ocurrido leer, no es que pensara que fuera aburrido, simplemente que lo compré más por su fama, lo archive en mi librero y nunca le di tanta importancia o pensé que llenaría mis"}, {"Review": "It was a very good book. Alhamdulillah. I can't wait to get 'The Family Corleone' and 'The Sicilian' books.My favourite characters are Vito Corleone/Godfather and Michael Corleone.'The Godfather and The Godfather part 2' movies were awesome. 'The Godfather part 3' was pointless! The only part I actually enjoy watched 'The Godfather part 3' was 15 minutes before at the end of the film."}, {"Review": "New Brilliant Future Career Idea: mafia wife. Think about it - all you have to do is cook, have some babies, and go to Mass once a day. Sure, I might have a hard time learning to never ask questions about anything, but I could always get a hobby to occupy my time with. At the very least, being a mafia wife would give me tons of free time to finish The List. It's win-win, really. "}, {"Review": "The epic masterpiece of mafia fiction. Puzo is good and entertaining elsewhere, here is great and masterful. It is to mobster books what Godfather parts 1 & 2 are to mobster movies...a standard that can never be equalled. What really intrigues me about Puzo's presentation of the Corleone family, and something that does not translate as explicitly to the screen, is the incredible sense of moral and religious conviction that what they do is right and good. At times I found myself believing tha"}, {"Review": "I absolutely loved this book! This book started my long running obsession with Mafia. The Godfather is one of the best pieces of literature ever written. Mario Puzo paints this elaborate picture of the Sicilian mafia through the eyes of Michael Corleone, a returning Marine Corps hero who at first wants nothing to do with the elaborate crime family that his father has built.Don Vito Corleone, an Italian immigrant who goes from poverty in Little Italy to create one of the Five Families of New York"}, {"Review": "خنده دار است كه تا بيست سال پيش شبه روشنفكران ما، با چه چيزهايى پز مى دادند! با ديدن فيلم بن هور، ئى تى، جنگ ستارگان، فيلم هاى عامه پسند هاليوودى كه مخاطبشان نوجوان هاى پانزده ساله بودند! يعنى به عبارت ديگر، به دليل عقب ماندگى فرهنگى عمومى، هر چيزى كه از زيردست \"از ما بهتران\" در مى آمده را روى هوا مى قاپيدند به خيال اين كه گوهرى يگانه است.بايد دسترسى به محصولات فرهنگى غرب گسترش مى يافت تا تحصيلكرده ها كم كم دريابند تفاوتى هست بين جنايت و مكافات با اينديانا جونز، بين داستايوسكى و استيون اسپيلبرگ،"}, {"Review": "\"..for Justice, we must go to Don Corleone.\" In a world where laws are broken, where the government is only a puppet, where murder is routine and safety a rare thing, Don Corleone holds all the strings. He is the avenging angel, the thief in the night, the protector of the poor, the warrior of the wops, the ultimate puppeteer. He is the loving father, the faithful husband. He is the Godfather. Don Vito, Sonny, Fredo, Michael, Tom, Clemenza, Tessio, Luca Brasi, the entire family, they're like the"}, {"Review": "A good read that demands re-read has been long time ago for now..           "}, {"Review": "I’d never read The Godfather until this summer. But my lovely bride gave me an early hardcover edition for my birthday, and the whole experience was...Proustian. Almost every passage brought back a memory from my childhood, when the book and movies were omnipresent. I loved it. It’s a classic, and deservedly so."}, {"Review": "The Godfather by Mario Puzo...Gimme one reason why there was NO CAT IN THE BOOK???But they added one in the movie, huh. So, the Godfather is this guy:Most loved him, I didn't so I'm not going to talk about him. But his ideals are kinda cool. “Friendship is everything. Friendship is more than talent. It is more than the government. It is almost the equal of family.\"“Revenge is a dish that tastes best when served cold.” “A man who doesn't spend time with his family can never be a real man.” \"Every"}, {"Review": "Having seen the movie so many, many and did I say many times before actually reading the book, the actual reading of the book has left a lot to be desired."}, {"Review": "  “There are things that have to be done and you do them and you never talk about them. You don't try to justify them. They can't be justified. You just do them. Then you forget it.”\"Behind every successful fortune;There is Crime.”\"The lawyer with the briefcase can steal more money than the man with the gun.”“We are all honorable men here, we do not have to give each other assurances as if we were lawyers.” \"Time erodes gratitude more quickly than it does beauty!”  The novel 'The Godfather' leav"}, {"Review": "Cuốn tiểu thuyết này của Mario Puzo thực sự là một tuyệt tác, một tuyệt tác kỳ vĩ và hào hùng về một trong những đại gia đình mafia nổi tiếng nhất tại Mỹ thời hậu chiến tranh thế giới thứ 2. Tất cả mọi thứ được viết trong “Bố Già” (tựa gốc tiếng Anh: “Godfather”), tất cả mọi nhân vật được tạo ra, mọi chi tiết, câu thoại, diễn biến, câu chuyện đời, chuyện nghề của riêng từng nhân vật, đều được khắc họa một cách hấp dẫn, lôi cuốn đến mức gây nghiện, khiến tôi không mong gì hơn là sở hữu một thứ th"}, {"Review": "I saw the movie few years ago and loved it. I was unaware at that time that its an adaptation of a book of same name. Courtesy Goodreads I finally came to know of this fact. But still I was in no mood to read the book until my friend Srividya recommended it to me.There are so many aspects of the book that I loved but characterization simply blew me away. Puzo has given his characters so much depth. Don Corleone, Michael, Tom Hagen, hot-headed Sonny and every other character was brilliant. Corleo"}, {"Review": "2017 PopSugar reading challenge #31 A book where the main character is a different ethnicity than youTenía cierto temor de que el haber visto la película me arruinara un poco la experiencia de leer el libro. Bien, en un principio lo hizo un poco, y por eso lo dejé en pausa, para dejar correr un poco más de tiempo, y finalmente logré disfrutarlo como era debido. Este tema a mí me emociona un poco demasiado y no sé por qué, pero la cosa es que el que esté tan bien trazado me hace pensar que no exi"}], "ID": "22034", "Name": "The Godfather"}