{"Name": "Bad Blood: Secrets and Lies in a Silicon Valley Startup", "Image": "https://images.gr-assets.com/books/1525180824l/37976541.jpg", "Reviews": [{"Review": "I don’t read a lot of page turners. I often find myself unable to put a book down—but they’re not the kinds of books that would keep most people glued to their chairs. Still, I recently found myself reading a book so compelling that I couldn’t turn away.Bad Blood: Secrets and Lies in a Silicon Valley Startup by John Carreyrou details the rise and fall of Theranos. If you aren’t familiar with the Theranos story, here’s the short version: the company promised to quickly give you a complete picture of your health using only a small amount of blood. Elizabeth Holmes founded it when she was just 19 years old, and both she and Theranos quickly became the darlings of Silicon Valley. She gave massively popular TED talks and appeared on the covers of Forbes and Fortune.By 2013, Theranos was valued at nearly $10 billion and even partnered with Walgreens to put their blood tests in stores around the country. The problem? Their technology never worked. It never came close to working. But Holmes was so good at selling her vision that she wasn’t stopped until after real patients were using the company’s “tests” to make decisions about their health. She and her former business partner are now facing potential jail time on fraud charges, and Theranos officially shut down in August.The public didn’t know about Theranos’ deception until Carreyrou broke the story as a reporter at the Wall Street Journal. Because he was so integral to the company’s demise, Bad Blood offers a remarkable inside look.Some of the details he shares are—for lack of a better word—insane. Holmes would invite prospective investors to the lab, so they could get their blood tested on a Theranos machine. The device had been programmed to show a really slow progress bar instead of an error message. When results didn’t come back right away, Holmes sent the investors home and promised to follow up with results.As soon as they left, an employee would remove the blood sample from the device and transfer it to a commercial blood analyzer. Her investors got their blood tested by the same machines available in any lab in the country, and they had no idea.There’s a lot Silicon Valley can learn from the Theranos mess. To start, a company needs relevant experts on its board of directors. The Theranos board had some heavy hitters—including several former Cabinet secretaries and senators—but for most of the company’s existence, none of them had any expertise in diagnostics. If they had, they might have noticed the red flags a lot sooner.Health technology requires a different approach than other kinds of technology, because human lives are on the line. Carreyrou writes a lot about how Holmes idolized Steve Jobs and his unwillingness to compromise on his vision. That approach is okay for consumer electronics—if a new phone doesn’t work as promised, no one gets hurt—but it’s irresponsible for a health company. Holmes pushed a vision of what Theranos could be, not what it actually was, and people suffered as a result.Bad Blood is also a cautionary tale about the virtues of celebrity. On the surface, Holmes was everything Silicon Valley loves in a CEO: charismatic and convincing with a memorable personal story made for magazine profiles. There’s nothing wrong with that on its own. A rock star CEO can be a huge boon for a startup. But you can’t let fame become the most important thing.Theranos is the worst-case scenario of what happens when a CEO prioritizes personal legacy above all else—but I hope that people don’t use it as an excuse to write off the next young woman with a big idea. I also don’t want Bad Blood to scare people away from next-gen diagnostics. Theranos went to extraordinary lengths to get around quality standards. The industry is highly regulated, and new diagnostics undergo rigorous testing.Bad Blood tackles some serious ethical questions, but it is ultimately a thriller with a tragic ending. It’s a fun read full of bizarre details that will make you gasp out loud. The story almost feels too ridiculous to be real at points (no wonder Hollywood is already planning to turn it into a movie). I think it’s the perfect book to read by the fire this winter."}, {"Review": "Fascinating accounting of the Theranos scam and I do mean SCAM. Exhaustively reported. I do wish there had been more analysis of how a scam of this magnitude was made possible and enabled. This girl dropped out of college and convinced Henry Kissinger, George Schulz, Rupert Murdoch and a bunch of other famous and/or incredibly talented people to give her money or work with her even though there was no there, there. WHAT? There are so many incredible WTF moments. Just wow. Privilege is a hell of a drug, I guess. "}, {"Review": "\"The resignations infuriated Elizabeth and Sunny. The following day, they summoned the staff for an all-hands meeting in the cafeteria. Copies of The Alchemist by Paulo Coelho had been placed on every chair. Elizabeth told the gathered employees that she was building a religion. If there was anyone not prepared to show complete devotion and unmitigated loyalty to the company they should “get the fuck out.”The Steve Jobs SyndromeI have covered Silicon Valley as a journalist and author for three decades now. I’m not big on attending conferences, but made a point to go to an awards event at a favorite forum in September 2015. Among the recipients that year was Silicon Valley legend, Andy Grove, getting the lifetime achievement award.Also on the list, getting the “global benefactor” award, was someone I had never heard of, Elizabeth Holmes. I had also never heard of her company, Theranos. Though I once worked for a business magazine, I never read any others. And Theranos was in the medical device “space,” which is pretty different from software and social media.Her presentation was last. Joining her on stage was her Stanford professor and mentor, Channing Robertson. He spoke first. He told this story of Holmes as a kind of prodigy who camped out at the doors of his office and lab until he admitted her as a freshman into his upper division courses in chemical engineering. I would learn later that he considered Holmes a once-in-a-generation genius, comparing her to Newton, Einstein, Mozart, and Leonardo da Vinci. Heavy praise, indeed.Holmes was up next. She wore a black, mock turtleneck that reminded me of Steve Jobs. Her dyed blond hair was up, slightly skewed, that struck me as a bit calculated. She had large, unblinking blue eyes and spoke in a low baritone. By the end of her talk, it struck me that she had essentially said nothing of substance about her product or her company. Instead, it was high-falutin’ claims that reminded me of the rhetoric Steve Jobs used when rolling out a new product, except that he had a real product he was demonstrating each time. I was immediately suspicious of Holmes and Theranos. I had seen too much over the years to take something like this at face value.When I got home, I did a computer search and learned that Holmes had been on the cover of numerous business magazines as the first female tech billionaire. (My wife would always add: “on paper.”) In some photos she posed with a tiny vial of blood that was supposed to represent all that would be needed to do numerous tests with the company device.Almost a month later, the first in a series of Wall Street Journal articles about Theranos, by the author of this book, was published. It reported that their technology did not work. (I was to learn later that the author interviewed 60 former Theranos employees for his research). My suspicions were confirmed. I eagerly read every new installment of the WSJ series.But “Bad Blood” goes much deeper than those articles. It turns out that Channing Robertson was not the only older man over whom Holmes had a kind of hypnotic power, like the mythical Mata Hari. There was veteran venture capitalist, Donald L. Lucas, whose backing and connections enabled Holmes to keep raising money. Then Dr. J and Wade Miquelon at Walgreens and Safeway CEO Steve Burd, as well as General James Mattis (now Trump’s Secretary of Defense), George Shultz, and Henry Kissinger. All of these men served as enablers, when they were in positions where they could have put a stop to the fraud. Most of these operations had experts who knew the science and tried to warn their superiors, but were ignored. And there’s no doubt that the medical miracles Theranos promised were very appealing to these older men, as well as to so many others who heard her spiel. One of the most important older men was Sunny Balwani, her romantic partner 20 years her senior. He knew nothing about science, but was essentially her primary henchman for bullying dissenters in the company, heading up employee surveillance and doing the dirty work of firing people. He also subbed as CFO after the only one they had was fired for questioning company honesty. Balwani would pull numbers out of his butt and claim they were legitimate revenue projections.Those who weren’t fooled were veteran venture capitalists who had been investing in the medical device space for years. During one of her pitches to these firms, she was asked so many questions she couldn’t answer that she stormed out of the conference room. In a one-on-one encounter with another successful venture capitalist he asked to see her device. Instead, she slapped her notebook shut and said: “if you can’t trust me, I can’t work with you” and slammed the door behind her as she departed.In turns out that in spite of her time at Stanford, Holmes didn’t know much science. She described the process of her device as follows….“A chemistry is performed so that a chemical reaction occurs and generates a signal from the chemical interaction with the sample, which is translated into a result, which is then reviewed by certified laboratory personnel.”The selling point was no more needles, just a slight lance of a fingertip could provide enough blood to do countless tests. When the author queried Timothy Hamill, from the UCSF Department of Laboratory Science, he told him…\"….the pitfalls of using blood pricked from a finger. Unlike venous blood drawn from the arm, capillary blood was polluted by fluids from tissues and cells that interfered with tests and made measurements less accurate. “I’d be less surprised if they told us they were time travelers who came back from the twenty-seventh century than if they told us they cracked that nut,” he added.The whole concept was flawed from the beginning. Holmes used non-company technology to try to cover this up. In a PowerPoint presentation she made to investors one slide showed scatter plots purporting to favorably compare test data from Theranos’s proprietary analyzers to data from conventional lab machines. But all the data came from non-Theranos technology. They often used other tech than company technology that could not generate accurate results for patients. Theranos even resorted to using hypodermic needles, instead of the promised fingertip prick. Meanwhile, Holmes continued to expand her Steve Jobs persona. She drank green kale shakes (Jobs was vegan), leased cars with no license plates (as he had), had several bodyguards who referred to her as Eagle1 (Eagle2 was Bulwani) and flew in a Gulfstream Jet. She referred to her device as the i-Pod of Health. And even hired the ad and pr firm that Apple once used, Chiat-Day, even though Theranos could not afford them. And looking back, it appeared that her dropping out of college was part of a script, just the way Jobs and Gates dropped out to pursue their entrepreneurial dreams.When she went on the Jim Cramer’s “Mad Money” show to denounce the WSJ, she sounded very Jobs-like when she said: “First they think you’re crazy, then they fight you, and then, all of a sudden, you change the world.“Not surprisingly, Theranos kept missing their deadlines. Its contract with Safeway fell through, but Walgreen’s was more important to them. Several stores in Arizona went “live” with testing. Most tests done there were way off, resulting in unnecessary trips to the ER and potential over-treatment. Various doctors and patients published negative reviews on Yelp. This put the company in the realm of reckless endangerment: “a crime consisting of acts that create a substantial risk of serious physical injury to another person.”This reality upset many employees who wanted no part of a fraud that would harm people. At company meetings, Holmes would say: “If anyone here believes you are not working on the best thing humans have ever built, then you should leave.”Many took her up on that, but it was never without controversy. Meanwhile, bulldog Sunny was dispatched to Arizona to intimidate those who had posted negative Yelp reviews. And the company had hired super-lawyer David Boies to threaten suit against anyone who revealed insider info on the company. Just as one example, it cost the Schulz family $400k in legal fees to defend George’s nephew Tyler. Theranos knew Tyler had met with the author because they had a tail on both Tyler and the author.When I finished the book I thought back on that awards ceremony I had attended where I first saw Holmes. I recalled Andy Grove, whose lifetime achievement award represented the original Silicon Valley of sweat equity. Grove lived through the Nazi occupation of his native country of Hungary and escaped after it became Communist. In New York, he worked as a busboy while he learned English and obtained a bachelor’s degree in chemical engineering from City College of New York. Graduate work took him to the west coast, where he earned a Ph.D from U.C. Berkeley in chemical engineering. He would go on to help found chip maker, Intel, a company that truly changed the world.These days, what I see in Silicon Valley is an increasing obsession with wealth and an absence of ethics, and the spread of the Steve Jobs Syndrome, like some kind of disease. Theranos epitomized all of this. The result is a lack of the honest work that Grove epitomized, in which wealth and notoriety were by-products not goals. The real goal was to do good work, first and foremost. And always tell the truth.=============1/1/19Mother Jones just named \"Bad Blood\" the #1 book of 2018. I couldn't agree more. Congratulations, John Carreyrou!"}, {"Review": "While reading Bad Blood: Secrets and Lies in a Silicon Valley Startup, my blood was boiling. Partly because I have enormous dislike towards Elizabeth Holmes, but also because our house has been doing 35 to 40 degrees (celsius) a day as does my workplace, too.(Finland, as well as many other European countries, is not designed for a hot weather, but instead our buildings and ventilation is made to keep warmth in. This includes private housing but also public infrastructure such as hospitals, shops, buses etc.)I was familiar with Elizabeth Holmes from early on due to reading a lot of medical and science oriented publications. To my surprise, not many of the people I talked during this read knew much about her or her scam with her company named Theranos. This, even she was hauled by many media outlets to be a female version of Jobs for her invention of a device that could map everything through a one drop of blood. A device that would eventually be found in people's private homes. Holmes marketed her i-phone-look-a-like invention as something that would change the world by making blood testing easy and less painful. Goodbye to the endless blood tests and needle poking, welcome a device that would find everything by just using a tiny drop from your fingertip.That is all great, but there was a problem - the device did not work, nor was it ever in levels where it could. This did not stop Holmes, she kept marketing and painting this heavenly picture of a groundbreaking medical invention. She managed to scam investors, professionals and people who are generally considered smart enough to not to be fooled in business moves.There was a lot of people pointing out the flaws, faults and the lack of substance, but they were often dismissed by the companies higher management in fear of \"missing out\". A syndrome that plagues industries - where something is considered so good and profitable that it is a risk to decline it in a case it would actually end up working and be found in the hands of the rivals.Elizabeth Holmes, and her shady crew, exploited this syndrome to the fullest. I still can't believe how she got away with it for so long as her methods were surprisingly poor, but her abilities to exploit this syndrome were extremely profitable.Elizabeth Holmes is a pretty, young lady. She is a blonde, has big blue eyes, and a baritone voice, which according to ex-workers might not be her real voice but a fabricated one. I understand the latter - as someone who has worked in telemarketing sections of multiple firms, my young sounding voice with a feminine rasp has been my greatest and most valued asset. When you add the inspirational way of presenting herself and having luminous way of handling her physical appearance, you had a package that was able to convince even the ones that should have not been. Holmes seems to posses sociopathic tendencies, and I do not even a moment think she was manipulated by older men, or that she was just innocently doing what everyone else in Silicon Valley do. The need and want to always see a woman in a better light. She wanted to be rich, that was her initial goal but adding something world changing into it was her way of getting her immortality. As someone who is married to an inventor that holds many patents in his and his teams name, I find calling Holmes as such is almost disgraceful to the people who work with integrity and talent to make betterments that no one notices even when that something would be a thing they use every single day. In Holmes case, she simply wanted something and put other people to work and she herself had little business in it other than not accepting anything negative, productive or reasonable about her views of how a device should be.She and her crew was an hideous example of corporation way of handling their business and their workers. The constant lawsuits, the intimidating acts and assembly line hiring and firing, surveillance and lack of interest of the ability and professionalism of their workmanship was an angering read to experience.More so, as this device of theirs was pushed up so far as actually being used, which resulted in false results, health-scares, unnecessary ER visits and most likely to unnecessary treatments and medication, too. Elizabeth Holmes made all this happen while knowing her device was not functional in any levels by hiding, lying and intimidating. She even promoted it to be used inside U.S. army - specifically in war zones.There could have been endless deaths, false diagnoses - but luckily there was John Carreyrou that kept going and exposing one of the biggest scams of recent years. Kuddos to him.John Carreyrou did exhausting research, interviewed over 60 former employers and connections, but Elizabeth Holmes herself declined to talk with him. That is surely understandable. It is not a long time she could keep up her false Jobs-act intact as the longer time you spend with a person like Holmes, the faster you notice that under all that civility, good manners, inspirational way of speaking has very little of substance.Holmes would make a great politician, probably very loved at that."}, {"Review": "Early in my career I worked at a next-generation sequencing startup with Theranos-level ambitions. In fact, it went further. The founders’ mission was to cure aging. Literally, the goal was immortality.There were other similarities: The company was founded by wunderkinds, they won the attention and support of a prominent professor in the field, they dropped out and raised millions of dollars from non-hard tech investors off the back of a concept, then tens of millions of dollars off the back of a glued together prototype, all while pursuing a fantastical goal.The company was wild but not fraudulent. Quite the contrary: When the founders realized that the technology was not going to work (or would take many more years to validate) they decided to fold the company. All of the scientists - even the skeptics - were shocked and disappointed. We were on the verge of breaking through in key areas. But, it was over.And, the irony? Many of those scientists went on to work at Theranos. It was just down the street.By 2012 they had all left Theranos. ‘It's too crazy’. ‘It’s way worse’. Way worse than an immature company that blew up on a whim? I started following Theranos: the Glassdoor reviews, the funding announcements, the glowing press coverage. It was surreal to know that the company was a fraud and yet to see it rise.Carreyrou exposed it all. How Holmes and Balwani drove an employee to suicide, how they strong-armed employees, investors, even generals and statesmen, how they lied to win multi-million dollar deals from credulous partners. The pulp in Bad Blood is juicy. I read the book on one overseas flight.Theranos is extreme but not singular. Silicon Valley lionizes founders and ‘overnight’, 100X successes. Investors are pushed & pulled toward a hands-off approach. Founders retain board control and investors don’t meddle. This environment is prime for fraud. My management philosophy: In a vacuum, everyone cuts corners. Everyone gets lazy. And, unscrupulous people do worse.A couple years ago I tweeted: ‘At what point do high-profile unicorn frauds irreparably damage the philosophy and practice of founder-friendly investors?’ That was about Hampton Creek. It could have been about Zenefits, or Uber (in a sense), or, of course, Theranos. Who will be next? The odds-on favorite is WeWork. Does Tesla (a public company) count? The whisper-consensus has many candidates.There are many frauds left to be exposed. But, none as big as Theranos. Well, maybe one or two."}, {"Review": "The True Cost of IdealismI have been guilty of the grave fault of idealism in much of my professional life. Consequently I cringe when I read of the young Elizabeth Holmes and her idealistic trajectory from the thrilling emotionally-laden launch of Theranos, which promised a breakthrough in medical technology, to its ignominious destruction as a fraudulent scam. In her I see myself - not in her level of talent or her self-confidence but in her profound self-delusion. It is this self-delusion which seems the universal cost of idealism, a cost which is borne not just by the promoter of an ideal but by the rest of the world as well - in her case about a billion dollars in round figures.Idealism sells. What it primarily sells is itself - its promise, its enthusiasm, its own inherent goodness. Modern serial idealists in places like Silicon Valley are idealists about idealism. It is their idealistic energy and talent for putting together pieces in a technological/conceptual/commercial puzzle that gets them what they need: ideas, contacts, talented colleagues, reputation, and money. The code phrase of the idealist is ‘Making a Difference.’ So Holmes “wanted to truly leave her mark on the world, she would need to accomplish something that furthered the greater good, not just become rich.” But most of all their energy and enthusiasm gets them power, the power to promote their own idealistic self-image. Idealism is always couched in terms of abstract altruism, that is, improving the human condition. But no matter what the area in which a particular ideal is to be pursued - business, politics, medicine, academia - the idealist imperative, his or her sine qua non, is the acquisition and maintenance of power for themselves. Power is a logical and practical prerequisite for the realisation of any ideal. Idealists therefore want to enrol the rest of us in their ideal. This is their route to power. Their role model is not that of Albert Schweitzer or Mother Teresa and the selfless doing of good but that of Pericles and the talking of doing good, usually about what others are required to do to prove their goodness.The world of the idealist is constrained and defined by power regardless of the merits of the ideal put forth as its rationale. Power is the elephant in the room that no one talks about but that must be constantly fed. Eventually there is room for nothing else. The ideal one has started with becomes a nostalgic memory, restored to mind only at the behest of power to increase itself. This is the essential paradox 0f idealism: it will always end in tears.The more articulate and forceful idealists are in presenting their ideal, the more power they accumulate. The idealist is a visionary, a prophet who deserves power because of the strength of their vision and prophetic acumen. Holmes made it clear to her employees that she was “starting a religion.” It is faith which justifies, for the idealist as for any believer, those actions necessary to acquire power. Chief among such actions is lying. Chronic mendacity is not incidental or exceptional for the idealist. It is a necessary virtue of technique and substance. Lying is expected because all communication is negotiation, is it not? This is the common thread among idealists of diverse backgrounds, views, and personalities. Donald Trump is an entrepreneurial idealist; Benedict XVI is a religious idealist; Mark Zuckerberg and Elon Musk are high-tech idealists; as indeed is Elizabeth Holmes. However else they differ, they share this distinctive trait: they lie instinctively and routinely, and without remorse, indeed, I suspect, without consciousness of lying at all. Although idealists have to be enthusiastic salesmen, they are not mere evangelists who tout the advantages of their ideal, while staying silent about its possible defects or adverse consequences. Idealists are true believers. Unlike typical salesmen they do not present half truths, distortions, overstatement, and tendentious arguments knowing them to be such. They believe firmly in everything they say. They are compelling, even for hard-bitten venture capitalists. The guy Holmes recruited to do the engineering was mesmerised by her take of difference-making: “Edmond, who went by Ed, felt himself drawn in by the young woman sitting across from him who was staring at him intently without blinking. The mission she was describing was admirable, he thought.”The ideal consumes idealists, including their awareness of reality. In their own minds they do not lie, they convince - themselves as much as others - in order to further the ideal. Lies are aspirational statements not false claims. Their repetition is constructive truth, an embodiment of hope, and a demonstration of that very Christian virtue of faith. So from the start of Theranos, Holmes was faking the results of her diagnostic devices through high-tech trickery - believing, much like Bernie Madoff (another idealist), that the breakthrough was at hand. She was selling nanobot snake oil to West Coast money men at the same time as Goldman Sachs (an exceptionally idealistic firm, just ask them) was pushing its sub-prime portfolios into German pension funds. Same product - efficiency - just different labels, one procedural, the other financial.In short idealism is not merely a neurosis; it is a sociopathology. Idealists don’t simply have ideals; they seek to impose them on the rest of us - at a profit. Idealism is an infection spread from mouth to ear to mouth. As both a philosophy and a practical ethic it is the secular residue of the Christian idea of faith. It may not move mountains directly but it certainly can generate the cash to develop the machines which can. And idealism justifies anything for those who have it; it makes the idealist immune from self-criticism, and indifferent to the consequences of his actions. Idealism certainly gets things done in a world which expects and respects it. But what it gets done is rarely discussed.In business the consequence is constant low-level deceit punctuated by not infrequent criminal fraud; in politics the consequence is extremism and ultimately terrorism; in religion, fundamentalism and doctrinally-justified inhumanity. Idealism, like its progenitor of faith, is something we culturally value. The central question that Bad Blood raises is not legal, or organisational; nor is it essentially about the moral code of Silicon Valley. It is about whether this legacy of what we glibly call Christian civilisation is a salvific virtue or a destructive vice.Postscript: It is also clear that idealists have no shame: https://gizmodo.com/disgraced-therano..."}, {"Review": "4.5 Stars\nElizabeth told the gathered employees that she was building a religion. If there were any among them who didn’t believe, they should leave.\nWow! What a powerful story. I'm a fan of financial stories and I personally work in the tech industry so when I heard about this book I knew I had to read it. If you like shows like Shark Tank, I think you will find this story interesting.Elizabeth Holmes is 19 and an incredibly smart girl. She decides to dropout of Stanford because she has an idea for a medical device that could literally change the entire medical industry. The device is supposed to eliminate drawing blood through a large needle and instead simply prick your finger and get results faster. She becomes romantically involved with a guy 20 years her senior named Sunny who becomes a powerhouse at the company. They name the company Theranos. Elisabeth is called the next Steve Jobs. Her company goes and eventually is valued at 9 Billion dollars and she becomes the most valuable female CEO ever. Walgreens and Safeway buy into the idea and invest millions. Other famous names invest as well such as, Rupert Murdoch. This all sounds good and well right? Well what if you worked at a company and found out the entire product was a lie and didn't actually work? What if you realized that the company you are working for made a product that can potentially kill people because the company is faking results and putting innocent lives at risk? Would you quit or say something? If you quit you get harassed & sued (you have to sign an NDA) if you speak a word. If you speak up you immediately get fired and harassed. Let's just say the grass isn't always greener. One day the lies start to come out from a WSJ article when ex-Theranos employees start to speak anonymously...\nBut how could this woman continue to keep this lie going for over 10 years?\nThis story honestly blew me away. I have no idea how large companies such as Walgreens and Safeway were able to not see through the lies. Maybe Elizabeth was an amazing negotiator but if I invested hundreds of millions of dollars and the product wasn't hitting timelines I would end that ASAP. I think that the companies had FOMO (fear of missing out), at least Walgreens did. They were afraid of CVS getting the business instead, only to be duped. The author, who is also the WSJ journalist who broke this story, calls Elizabeth a sociopath. He says they are defined by: not having a conscience in regards to actions they've taken. I'm not sure I would have pegged her as that but when you think about it, she literally could have killed people if doctors actually believe this medical device worked. Luckily, the WSJ article broke before it became a real problem. But morally how can someone do that? Oh and if you look Elizabeth up online she's already starting to try to get people to invest in a new business idea she has. I guess she's moved on...This story was so interesting and I highly recommend for those who enjoy good business scandals/investment stories. It was a wild ride and I also learned a lot about blood science! This definitely lives up to the hype."}, {"Review": "A company that set out to save lives… only to put those same lives in danger with its malfunctioning technology.What a scary and fascinating story. It’s hard to believe that Theranos really happened because you think that nowadays it’s easy to spot liars and lying technologies… but it’s not that easy after all, especially if the person duping you is as charismatic as this Elizabeth Holmes is. But the main reason why it took a VERY long time for people to catch on that Theranos was doing more harm than good was that people WANTED to believe in the product. If someone is creating a new game and trying to fool you that the game works when it doesn’t, you have doubts pretty early on. But then again, a game is unlikely to change your life like this medical machine promised to do. I, myself, wanted Elizabeth Holmes’s idea to work because how amazing would it have been to have results pretty much instantly and get rid of big scary needles? Pretty darn mind-blowingly amazing. But alas, Ms. Holmes was in no way ready to compromise. She was a CEO alright… but not a good one. She lied. She hid. She shut down ideas that could have actually made Theranos’ technology work after all. It’s frustrating really. She just couldn’t let go of her idea of making those machines available in people’s houses and miniaturizing medical technology. It took me almost a week to get through this read because it’s a THICK story. It may only have 300 pages but these are PACKED with information and characters. It spans over ten years! But it was hard not to pick it up again every time I needed to put it down because it’s more than just about business and crime—there is so much drama and hope this story could easily be turned into a TV series! Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"Review": "I don’t read a lot of nonfiction books. I love the imagination of fiction. When I heard about this book from a television show, it sounded unbelievable. The fact that this was a true story that seemed stranger than fiction, I had to give it a read. I’m really glad I did because this was really good. This story is about the youngest woman, to become a self-made billionaire, and the giant fraud she committed on Silicon Valley. Elizabeth Holmes, was a Stanford drop-out that used her knowledge and family connections to build a billion dollar start-up name Theranos. Theranos invented a blood testing portable machine that could test all the different blood tests a major lab would with just a drop of blood. This was a major breakthrough as it could stop the need for needles and vials of blood sick patients have to constantly be subjected to. Not only that but these machines were to be rolled out in Safeway (a supermarket) and Walgreens (a drug store) all over the USA so everyone could afford to be tested. The problem with this great idea; the machines never actually worked! This truly is one of the biggest scams Silicon Valley had ever seen. The cheating and lies and manipulation are unbelievable. The amount of people Elizabeth managed to bewitch is staggering. These were smart people she swindled. If you live in the USA, you will be shocked by many of the big names that totally fell for the scam. Actually, the names are so big you will probably recognize them even living outside the USA. At one point Elizabeth was worth close to 5 billion dollars. This book is written by the Wall Street Journalist that fought to bring her lies to light. This book is also about the brave men and women who were ex and current employees that risked lawsuits and bullying to blow the whistle. If you have heard about this book and were considering reading it I absolutely recommend it. This is not my normal fiction I love to read, instead it’s the unbelievable truth. "}, {"Review": "Tips on how to make an unicorn:- Be a sociopath- Excel at sales&marketing- Get some cool people on your BoardTips to how to fake it till you make it?- Hire a lot of lawyers- Intimidate all your employees- Pretend that you are a vocal proponent of a cause that you are actually againstHow to make it as a woman in the tech world?- Baritone- Intese staringWhat can fuck up your amazing future as a tech billionaire?- Facts and data :( I love any story that shows how sales&marketing can change the world. This one is awesome. Scary, but awesome."}, {"Review": "How does a woman who was once lauded as the youngest self-made female billionaire find herself now broke and charged with fraud? Her face was on the cover of many financial magazines as the golden girl of Silicon Valley, the female Steve Jobs. In her black turtlenecks, she even dressed like Jobs. Elizabeth Holmes had an idea for a medical device that used breakthrough technology that could provide lab results from a simple finger prick and a minuscule drop of blood, and thereby revolutionize the health care industry. Founded in 2003, she raised millions of dollars from investors and named her company Theranos. The problem? The medical device didn’t work. It was all an elaborate scam. Still, the company managed to get Walgreens and Safeway onboard to build on-site clinics and she received multiple awards for her work. Elizabeth was a master manipulator and a dynamic force to be dealt with. She didn’t start out with a plan to scam but she would not accept the fact that her device simply didn’t work. Many people were fooled and she worked her way into rubbing elbows with people like Bill and Hillary Clinton, Joe Biden, Henry Kissinger, and Rupert Murdoch. The story is so unbelievable, it reads like fiction. How did she do it? Partly because the company had a culture of intimidation and obsessive secrecy to cover up the fact that it was all smoke and mirrors. And partly because Ms. Holmes had a massive ego. She was charismatic and brilliant but couldn't accept failure.After finishing the book, I spent some time online, still in disbelief that something like this could happen. Kudos to the author, the investigative journalist who blew the cover on this massive fraud. The bigger question? If someone like Elizabeth Holmes could pull off such an elaborate scheme, one that ultimately put patient’s lives at risk, how do we prevent it in the future?A riveting page-turner, and a must-read for everyone! Soon to be a movie starring Jennifer Lawrence."}, {"Review": "Mesmerising. Unbelievable. Compulsively readable. I cannot recommend this highly enough. I sped through this audiobook in a few days because I just could not stop listening to it. There were so many unbelievable things in this true account of the Theranos scam that my mouth dropped open in a way I wouldn't have thought happens in real life.John Carreyrou traces the story of Elizabeth Holmes and her medical start-up Theranos from the beginning with the help of countless interviews and other insights. The picture he paints is breathtaking: of a firm run like a cult, of incompetence that can only be explained by a complete lack of understanding of science by nearly everyone involved, of unethical hounding of those who did see the bad science for what it was. I can tell you, if I can see the science as flawed it is really flawed – my knowledge of biology and chemistry is lacklustre to say the least.While I overall enjoyed this book a whole lot, there were a few things that did not quite work for me. First and foremost the framing of the story – as Elizabeth Holmes did not give any interviews for this book, her story is told from the other end, which I am absolutely fine with and I do think Carreyrou did an exceptional job with this, but his clear distaste for Holmes shines through in a way that I did not always appreciate. For example, early on he uses an anecdote of her playing Monopoly with her brothers and being a super sore loser as an indication for how horrible and competitive a person she is – and I don’t buy that. Lots of kids are sore losers, most of them grow up not scamming patients. I do agree with his assessment that Holmes scammed her investors purposefully and did not care about the patients being misdiagnosed because of her flawed technology but I wish he had let me come to this assessment on my own a bit more.As a case study of how the lack of diverse knowledge can harm a company, this book is priceless. There were many instances where having somebody on the board of directors with just a little bit of knowledge of the science between the big idea would have led to a totally different ending. I would have liked to have seen an analysis of the social structures in place that enabled Holmes to build her company and run it for many years without any pertinent experience as a 19-year-old college dropout just based on knowing the right people and acting the part. But still, this book is amazing in achieving what it set out to do.You can find this review and other thoughts on books on my blog."}, {"Review": "Bad Blood is a straightforward read about the rise and fall of Theranos, done in chronological order in third-person up until Carreyrou becomes personally involved, at which point things accelerate to the SEC civil settlement. Carreyrou doesn't end too strongly but says that the criminal investigation may well end up charging Holmes & Sunny. This means that it lacks a really conclusive 'ending': Theranos was continuing to limp on, having received funding from a vulture on the strength of its patent portolio, ironically enough, which apparently was valued at $1b, and Carreyrou mentions in one interview that Holmes was reportedly scouting VCs for a new startup. (After reading BB, I had to think: maybe a second Holmes startup isn't a bad idea - after all, if she could get this far with no working product at all, what could she do with an actual product? It may look bad, but it'd probably work better than most startups.) Coincidentally, I began reading this just hours before Holmes & Sunny were criminally indicted (vindicating what I had been telling people - the SEC civil settlement didn't mean they were going to get off scot-free). Good timing on my part. This puts more of a period on reading BB, although the story is far from over. There's a quip that the most American character is the conman, because America is the land of second chances - Elizabeth Holmes is only 34 years old, after all, and even having aggravated the DoJ by persisting with Theranos, it's hard to imagine her being sentenced (as a woman and without a lot of bodies and without Shkreli's autistic genius for infuriating judges) to more than a few years at worst, so I wonder if we've seen the last of her?In any case, BB is good for resolving a lot of details about Theranos.For example, I was perplexed at the time by the large Walgreens deal: Walgreens is a large, competent, sophisticated provider of pharmacy services, well capable of thorough testing; if Theranos was not what it was hyped up to be, how could Walgreens fail to notice? My assumption was that Theranos had done something clever to produce fake results (if not perhaps as clever as the FSB at Sochi). BB provides the answer, which is dismayingly mundane: Theranos bluntly refused to provide any kind of real validation or access to its machines, and some Walgreens execs were furious about it and correctly convinced Theranos was a fraud, but others were seduced by the vision, and the doubters signed on because they were terrified of forcing Theranos into the arms of CVS, which is a rivalry I had no idea about. (\"Van den Hooff listened with a pained look on his face. 'We can't not pursue this,'' he said. 'We can't risk a scenario where CVS has a deal with them in six months and it ends up being real.' Walgreens's rivalry with CVS, which was based in Rhode Island and one-third bigger in terms of revenues, colored virtually everything the drugstore chain did. It was a myopic view of the world that was hard to understand for an outsider like Hunter who wasn't a Walgreens company man. Theranos had cleverly played on this insecurity. As a result, Walgreens suffered from a severe case of FOMO - the fear of missing out.\" Who knew?) A similar desperation appears to have animated Safeway's ill-fated Theranos commitment. And the general coverup appears to have owed much to the realities of lawfare in the USA: Theranos had enough cash to wield legal threats against the justly-terrified whistleblowers, costing Tyler Shultz a staggering $400,000+ and gaslighting suspects with constant PI surveillance, and possibly tactics that went beyond the legal (Theranos/Holmes appear suspiciously well-informed at times). It's no surprise it took a major newspaper like the WSJ to investigate it.It's also interesting for the unexpected details. For example, dressing like Steve Jobs wasn't Holmes's idea! She was told to do it by one of her ex-Applers. And her family connections were dangerous as much as they were helpful: the shiny board of directors, for everyone it impressed, put other people off and made them suspicious, and without her family connections, the family friend Richard Fuisz would never have tried to patent-troll her out of peevish spite which directly fed into the first Fortune article and eventually Carreyrou's own investigation. (With 'family friends' like these, who needs enemies?)And Carreyrou is good about considering to what extent Theranos really reflects on SV: as he points out, a lot of the actual investors were 'dumb money' (my phrase) who did minimal real due diligence and ignored red flags, like Rupert Murdoch who put in $125m on the basis of 2 meetings with Holmes and a phone call to someone else, while the usual life-sciences VCs were unimpressed with Holmes's bluster & ignorance and took a total pass on her. (Google Ventures took a hard pass when their guy walked into a Walgreens and Theranos couldn't do the test using just a nanotainer of his blood - a simple test that many others also did but then ignored the excuses and failures.) Culturally, Theranos was barely SV: yes, Apple may have fanatical internal secrecy, but they are the exception that proves the SV rule and have suffered for it (in machine learning especially), while everyone else adopts considerably more internal transparency for precisely the reasons that Theranos employees cite - how do you sanely do R&D if no one is allowed to talk to each other? (Again, Apple has suffered for this in trying to keep up in non-materials-science and non-manufacturing R&D, like machine learning: what's the last impressive new tech you can think of which was developed inside Apple?) It's not really that easy to draw a novel lesson here. Was Theranos initially too ambitious? Perhaps, but lots of startups scale back or pivot to new ideas based on their trial-and-error; reality cannot be planned out. Did it get too much money? It raised $6m initially, which is not that much for their purpose. Should new startups not be funded at all or not allowed a decade+ to work out ideas, or Walgreens blamed for seizing on a new opportunity as fast as possible? But people already complain about investors being too risk-averse and short-term (despite Theranos being 17 years old now!) and companies being bloated slow bureaucracies. Was the problem lack of 'peer review'? Except peer review doesn't work and isn't scientific, works the worst in cases of fraud (think of all the cases of people fabricating scores or hundreds of papers which slide through 'peer review' only to finally be exposed not by 'peer review' but when the results failed to replicate), and would've been inferior to simply seeing if the tests worked or not, and that's how all the smart money like Google Ventures took a pass on Theranos. Should we outlaw investing millions of dollars based on a phonecall? Hard to imagine that working out well. Should we criticize VCs for being gullible? But most of the VCs (not) involved weren't gullible! Should we criticize the board for letting her accumulate so much stock and then letting her talk them out of firing her in 2008? Probably, yes, but hindsight is 20/20 and the worst problems hadn't happened yet. Should blood testing in general be verboten to investors? But Holmes is very, very, far from the first person to try to improve on existing blood tests and fail, much like the perennially fruitless quest for a Alzheimer's disease cure - a good book on this topic is John Smith's \nThe Pursuit of Noninvasive Glucose Blood Tests: \"Hunting the Deceitful Turkey\"\n documenting the endless failure of people trying to improve on finger-stick blood glucose tests for diabetics - and people keep trying because anyone who succeeds will make so much money because the human costs of failing to succeed is measured in hundreds of millions or billions of lives over the coming centuries, and failure is simply not an acceptable option.Carreyrou suggests toward the end that Holmes might have psychopathic traits:A sociopath is often described as someone with little or no conscience. I'll leave it to the psychologists to decide whether Holmes fits the clinical profile, but there's no question that her moral compass was badly askew. I'm fairly certain she didn't initially set out to defraud investors and put patients in harm's way when she dropped out of Stanford fifteen years ago. By all accounts, she had a vision that she genuinely believed in and threw herself into realizing. But in her all-consuming quest to be the second coming of Steve Jobs amid the gold rush of the \"unicorn\" boom, there came a point when she stopped listening to sound advice and began to cut corners. Her ambition was voracious and it brooked no interference. If there was collateral damage on her way to riches and fame, so be it.I think this is wide of the mark and he gets closest in the final lines. What is the stereotypical profile of psychopathy? One might put it as: someone who is unable to make or commit to plans, who acts spontaneously on selfish and often self-destructive impulses, covering up for it with manipulation of others or with even more brazen deceptions often so ill-thought-out & easily falsified as to beggar belief, with a history of violence (often unreported) and especially sadistic cruelty (often emerging during childhood and focusing on animals), unable to maintain long-term relationships, sexually promiscuous and often impregnating or pregnant at an early age, often below average intelligence, greedy and covetous of money or rewards, apt to embezzle or steal from employers, typically racing from employer to employer to outrun immune systems etc.The portrait of Holmes in BB is very far from this. There is no hint of tendencies towards sadism or violence in her childhood, merely a mention of competitiveness. Holmes is, at least initially, quite bad at self-presentation: One quoted VC paraphrased describes her early pitches as unimpressive: \"she'd come off as a dowdy young scientist back then, wearing Coke-bottle glasses and no makeup, speaking nervously to an audience of men two to three times her age\" and Carreyrou points out (to my surprise) that her Jobsian wardrobe wasn't even her idea - but that of an Apple designer she hired:Ana felt that Elizabeth could use a makeover herself. The way she dressed was decidedly unfashionable. She wore wide gray pantsuits and Christmas sweaters that made her look like a frumpy accountant. People in her entourage like Channing Robertson and Don Lucas were beginning to compare her to Steve Jobs. If so, she should dress the part, she told her. Elizabeth took the suggestion to heart. From that point on, she came to work in a black turtleneck and black slacks most days.An additional interesting thread throughout BB (although Carreyrou puts no emphasis on this and I wonder if he missed the connection) is how Holmes continuously sought to amass more stocks or voting control of Theranos: one oddity in the end of the Theranos saga was that Holmes was never, and could not be, fired because she continued to own so much stock and voting power. Rather than selling out early and retiring to a life of leisure, she held on to the bitter end. This is particularly striking because, if I'm reading the timeline and indictment right, Theranos reached valuations of $50m+ long before Holmes/Sunny ever did anything that was truly fraud and irreversible; as far as I can tell, Holmes could have sold millions of dollars of stock and left at many points, entirely safely, and when Theranos ran out of runway, it would be regrettable but nothing she could go to prison for. Instead, she invested considerable efforts into clawing back the large, near co-founder-level stake of her first employee, to the point of threatening to sue an extremely wealthy director who wanted to buy some of it himself rather than giving it to her at a huge discount; she further proposed in 2007 allotting a block of stock to a nonprofit foundation in perpetuity (controlled by, of course, herself); and whenever an employee was fired, Theranos practice seems to have been to carefully hunt using coworkers & laptops & files for any reason, no matter how spurious, to clawback stock options.And in Theranos's mismanagement, we don't see much that could be described as sadistic beyond ordinary bounds - indeed, the 'disappearing' is about separating people from Theranos as quickly and totally as possible, rather than toying with their prey. The disappearing served a useful role in enforcing compartmentalization, risk-aversion, and covering up information, but might there not be another reason?Ian Gibbons puts his finger on it exactly when he said that \"It's a \nfolie à deux\n.\" Or perhaps it would be more precise to invoke narcissistic personality disorder and compare Elizabeth Holmes to Donald Trump.Holmes did not start off as a psychopath determined to rip off VC and SV by using her cunningly honed social skills and sexuality to manipulate horny old white men, as one narrative goes. She was a normal ambitious Stanford undergrad (having met a dozen or so Stanford undergrads recently, Holmes now seems much more understandable to me), perhaps a little too eager to launch a startup, with delusions of grandeur about a entrepreneurial destiny and a bit of a chip on her shoulder; for reasons which cannot be known (as counterfactuals are not observable), she got lucky or was female or had family connections or something and she got some VC and support from her professors for what was a more feasible sort of idea which might've been workable, dropped out for a startup, was mentored by the likes of Larry Ellison (surely a red flag if ever there was one), hooked up with an entrepreneur even luckier & more delusional in a remarkably long-term monogamous relationship, selected for employees who initially offered helpful advice in fitting into SV tropes & self-presentation but gradually were recycled into sycophants and slaves, and developed her reality-distortion field abilities through practice and self-persuasion and a cultivated paranoia/martyr complex, and mutual narcissistic feedback loops with true-believer employees and Sunny and eventually the media, 'vanishing' anyone who threatened to damage her narcissistic supply and punishing them for being wretched hateful human beings and endangering the mission, all of which lasted for many years (while Theranos was only truly in the public eye from 2014-2017, the first version was founded in 2003, fully 11 years before!). That's very different, even if the end game, where criminal fraud and blatant lies are necessary to keep the show going, looks similar."}, {"Review": "Fascinating! Bad Blood: Secrets and Lies in a Silicon Valley Startup is a detailed account of the (perceived) rise and demise of Theranos, a blood testing startup once valued at nearly $9B. I thoroughly enjoyed this book and barely wanted to put it down. It was baffling to read about the scams, stunts and lies this company pulled, led by founder Elizabeth Holmes and her former boyfriend, Ramesh “Sunny” Balwani. The red flags surrounding Theranos were rampant, and Carreyrou does an excellent job presenting the full scope of the situation and the company’s timeline.“Why had Holmes always been so secretive about her technology? Why had she never recruited a board member with even basic knowledge of blood science? And why hadn’t a single venture capital firm with expertise in health care put money into the company?”Holmes was a Stanford dropout who at the age of 19, started Theranos with the intent to revolutionize blood testing using just enough from a finger prick size sample. She exaggerated the company’s technological capabilities and grossly inflated its financial projections, as well as use of its device(s), regulatory approvals obtained, and partnership agreements. \n“Theranos operates under a culture of secrecy and fear.”\n The company was a revolving door for the majority of its existence - Employees were frequently fired for raising any concerns and forced to deal with Balwani, Holmes’ second in command, who, according to the book, was perceived as a tyrant by many. There are plenty of supporting examples for this description of Balwani too. Numerous employees also resigned, unwilling to engage in deceptive, unethical practices and/or impatient with Holmes’ lack of direction, lies, and sharp corner-cutting. In addition to establishing the secretive culture and work environment of Theranos, there is a fair amount of information in Bad Blood regarding the science and technology attempted by the company, as well as its involvement in legal proceedings. Both topics are easily digestible and not written with overly technical language. I am dumbfounded that so many investors just went along with the pitch and that more of them didn’t challenge the constantly ambiguous information being provided. Due diligence is real! It makes you wonder how some people got to where they are. Bad Blood mentions several times that Holmes has a deep voice, often taking many people by surprise. Finally, after reading about it for the 7th time, I Googled a video of her to hear it for myself and I too was taken by surprise - It was not a voice I was expecting! Some former employees noted they suspected it was a front Holmes put on, to be treated equally and gain the same level of respect as men in the male-dominate culture of SV. Maybe, though this seems exhausting - I know I’d be tired from changing my voice that drastically ever time I spoke at work. Holmes had an unabashed fascination with Steve Jobs. It is clear she liked the idea of being perceived as an innovative genius, though she is far from one herself. She wasn’t truly willing to do the hard work with a genuine “whatever it takes” attitude to get there. Hence the drastic cutting of corners, faulty devices, and unreliable work product of Theranos. She just wanted the fame and fortune, and inflated her sense of worth along the way, hiring excessive security detail and taking up most invitations to speak at industry events. After I finished the book, I found myself reading more about the company and Holmes online, still in disbelief that this BS actually went on for so many years. The following quote from an October 2018 MarketWatch article notes: “After Holmes burned through executives, cash, investor goodwill and regulatory patience, nothing of value was left but the company’s patents.”Though Holmes settled her “massive fraud” charges with the SEC in early 2018, I am extremely curious to see how the remaining various lawsuits will pan out. Part of me suspects wealth and privilege will play a role in saving the day for Holmes, but given the critical nature of Theranos’ deceit (human health), I am hopeful this will not be the case. At some point, we need to bring down the hammer and demand enough is enough - False test results impacting doctors’ treatment plans and patients’ medical decisions seem like a great opportunity to do so."}, {"Review": "Just when I thought all reporters ever did anymore was see what was trending on social media and write stories with titles like \"You'll cheer how this mom clapped-back at her body-shamers on Twitter,\" this book gives me hope that old-fashioned investigative journalism is alive and well and doing exactly what it's supposed to: shine an unflinching hot light on those who abuse their power and privilege. Here, it's aimed at the bizarre cult of Elizabeth Holmes and her \"disruptive\" \"game changing\" company, Theranos.Silicon Valley is the epitome of mediocrity dressed-up as brilliance. Having wasted several years of my career working for two different Valley-based \"start-ups\" (one now on its 18th year of \"staring up\"), I saw a lot of familiar patterns in this thorough, well-organized and well-told story of how a teenaged college drop-out with all the right connections managed to bamboozle people who we would otherwise assume should know better. There was the usual unprofessional office behavior, the disorganization, the endless cheerleading bordering on religious hysteria about how \"we're changing humanity!\" all wrapped with the constant disregard for convention and ethics and the truth. In this case, there were a few new wrinkles: complete contempt for the law, and a willingness to bully people to the bitter end to protect their lies.Although free of literary license and told straight-ahead as a journalistic piece, this book still reads a bit like a thriller. This could easily be adapted to a psychological horror movie, where young impressionable minds sold on the lie that Silicon Valley is full of the world's smartest people operating on a higher plane of existence go to work for a \"disruptive\" start-up, only to slowly have their perception of reality warped by the bullies running the place until they doubt themselves and everything they knew. At the top we have the calm, collected evil genius of Elizabeth Holmes, dressed the part all in black, speaking in hypnotic, reality-distorting tones, staring unblinking at you with massive blue eyes; to her right is her henchman and lover, a mysterious and wealthy older man named Ramesh “Sunny” Balwani, who dishes out abuse, punishments, diatribes, and hatchet jobs with complete impunity, to the point you can hear the evil music swell every time his name is mentioned. In the Hollywood version of this story, he would get his comeuppance by being tossed from a cliff, to an eruption of cheers in the theater. (In real life we have to settle for an ongoing criminal investigation.) Backing them up are the tentacles of a powerful law firm; the mere mention of their name sends shivers down people's spines and causes them to give up before they even start. They deploy a nationwide network of spies who know your every move, and who almost literally leap out of the shadows (or in one case, down the stairs) to serve you with papers and bully you into signing away your life.The duping of so many otherwise smart people is like a real-life retelling of \nBeing There\n, where everyone believes that Holmes is a genius for no other reason than everyone else believes she is a genius. There is a passage of a recalled conversation with brand-name people attributing high qualities to her that she herself probably didn’t even say. Once again “too good to be true” took a back seat to “wanting to believe,” reminding us of how Bernie Madoff managed to scam a different group of supposedly smart people. Apparently no one is immune to magical thinking.The author did an amazing job exposing this entire sham and documenting it in a way that gives a complete and chronological picture of what is likely just an extreme example of business-as-usual in Silicon Valley. The difference here is the scope and gravitas, since instead of a forgettable and unimportant software company, Theranos was a healthcare provider, operating in a heavily regulated industry, producing flawed results that directly affected patients' lives. (One person, for example, was out over $3,000 in unnecessary medical tests due to an erroneous blood diagnosis from Theranos. At least no one died, though another person is suing for a heart attack he said could have been prevented if their test had been accurate.) It was also an extreme example of paranoia and litigious bullying, using investor money to buy the finest in legal muscle to intimidate anyone and everyone: former employees, former board members, the journalist who broke the story (this book's author), the  Wall Street Journal itself—even the doctors and patients who complained about faulty test results received a personal visit from Sunny, where he threatened to ruin their careers if they didn’t sign away their right to complain. It was one step below a global drug cartel.So even if you never heard of Theranos before this scandal (like me), or are sick of seeing Elizabeth Holmes’ turtlenecked head all over the internet (also like me), this book is definitely worth reading, even if just for the schadenfreude it inspires. And hopefully it will burst people’s notion that the Silicon Valley’s “disruption” is somehow wonderful. Far from being a bastion of the future, the Valley is firmly stuck in the past of its gold-rush days, and this book shows just how far some of those opportunists will go to protect their gains, even if at the expense of employees, investors, patients, doctors, regulators, and any one else they perceive as a threat. Perhaps next time, people will actually do their due diligence.Most of all, I'm just thankful that real investigative journalism is alive and well and keeping us safe and free. Buy this book if for no other reason than that."}, {"Review": "A captivating, interesting, and (almost) unbelievable story. I had heard of Therano's downfall in the news, but the way this author investigated and narrated the events was absolutely remarkable.The book details the rise and fall of Theranos, a Silicon-Valley company that aimed to provide fast, blood test results with a single drop of blood. Elizabeth Holmes was the founder and CEO, her goal was to revolutionize the healthcare industry and, at some point, she was compared to the likes of Steve Jobs and Bill Gates.What very few knew is that the company devices did not work properly and her claims were, mostly, misleading and false. A gripping story.I loved this book, the author did an excellent job detailing the events. I highly recommend it."}, {"Review": "Oh, Silicon Valley, the place of realized dreams and sometimes of unexpected nightmares.Bad Blood immediately drew me into buying a copy right when I read \"a riveting story of the biggest corporate fraud since Enron\" (I like to read about Enron as well as the less sunny side of modern corporate history). With the infamous story of Theranos splashing across the news and through media anyway, I figured now was as good a time as ever to actually read this book and learn more about exactly what happened. Right away I found myself disliking Elizabeth Holmes, a woman who fancies herself a visionary of the biotech industry who makes big promises to revolutionize the way we do blood testing. Unlike Enron's J. Clifford Baxter, who warrants sympathy on many levels and is somewhat likeable for wanting to come forward and blow the whistle on the bankrupt Huston giant, Holmes seems from this book to be rather conceited, self-indulgent and much more focused on money than actually helping people. When she can't deliver on what she offered and investors have devoted huge amounts of money into her technology, what unfolds is a massive fraud, and along with a weaselly boyfriend who only adds fuel to the fire, Holmes sets up a scam that burns brilliantly, but still crashes and burns all the same.Reading Bad Blood was more like an engaging thriller than a non-fiction investigative true crime. With an easy-to-follow plot, language that the average layman can understand and a deep dive into the mentality behind somebody who deceives and impresses for profit, this book not only questions our undying innocence in regards to these great and charismatic dreamers and corporate tycoons, but also what led up to this chain of events. With the release of Lisa Jobs's Small Fry also in 2018, sharing a not-so-rosy side to the quirky Apple mogul Steve Jobs, Bad Blood is I think one of what will be more books to come telling the tales of people who aren't necessarily as altruistic as their image makes them out to be. There's something disturbing about Holmes's ruthlessness but at the same time there's also something we've seen before in one form or another - whether it's Martha Stewart or Jeffrey Skilling or Bernie Ebbers, these financial crimes have a habit of never being the last."}, {"Review": "What an audacious fraud! Elizabeth Holmes must be the Queen of self-hype to get so many powerful (and allegedly smart) men to support this scheme (Jim Mattis! Henry Kissinger!). I would enjoy seeing both her and Sunny Balwani in jail, for what they'd done not only to their customers, but their employees.Although I am not a fan of Wall Street Journal and the baloney they peddle in their opinion pieces, I was impressed by how their investigative department stood up against legal pressures from Theranos. Real journalism is great!"}, {"Review": "“Bad Blood” details the fascinating journey of a brilliant, soulless, young entrepreneur in pursuit of riches and fame. The story has heroes and villains, twisting and turning subplots, political intrigue and -even while we know the eventual outcome- plenty of surprises. It has all the elements of a good fictional thriller, but what makes this story most shocking and intriguing -- is the fact that it really happened. The details in this book will leave you shaking in your boots when you realize the scale of Elizabeth Holmes’ deception and the impact it might have had on public health. While aware of the Theranos story playing out at the time, “Bad Blood” provides a more detailed accounting of events. This book doesn't sugar coat the bitter pill and is a triumph of investigative journalism. John Carreyrou's research and reporting for this book were outstanding! By exposing the fraud that Holmes and Theranos were, we now know that intelligent people were duped, money and resources were wasted, and lives were saved. Non-fiction is not really my cup of tea, but I find this captivating , well documented, and it’s narrated like a novel. Don’t let the blood testing science specifics in the first half drive you away --the second half more than makes up for it in drama, and it ramps up at the end. I do carry some doubt that every word written in the book is true. Most of us will never know the whole story, and even every story has two sides. But Holmes certainly didn't make it easy to see her side of the story when all the facts were laid out. I felt Carreyrou tried to give an even hand as much as possible, but the evidence is too damning to be sympathetic on the very long term deception. Transparency and accountability should be paramount in corporate governance, government, and personal relationships --and this is certainly reinforced in this book. While I find it disgusting what Holmes and Balwani did, I’m even more disappointed our society would allow such a sham to be perpetuated. No one brave enough to say “the emperor has no clothes!” Everyone wanted to believe in the story so badly, that no one did the basic due diligence on many of Theranos’ claims. We should all be grateful that there are people like Tyler Shultz and John Carreyrou out there."}, {"Review": "Should be mandatory B-School readingI read this book in one day. I had read some articles and/or saw TV shows on Theranos and Elizabeth Holmes, but my knowledge was pretty general. Once I started the book, I could not put it down. I canceled lunch with a friend so I could continue reading. I ordered pizza for the family so I could continue reading. The story is interesting and shocking. It is a story that every Board should read because ultimately it failed in its oversight responsibilities - which seems to be a recurring theme with debacles that could've been prevented with real oversight. "}, {"Review": "Scandalous, riveting, and well reported. I tore through this in a weekend. This is an unbelievable story - I literally cannot believe how so many people were duped by this company. It's a story of a Stanford grad dropout who had a vision, and an uncanny ability to make others believe her, and as the pressure piled on, as she started to be compared to Steve Jobs, and get accolades like \"first female self-made billionaire\", she started to cheat. I'm sure it started small at first - the story of this company spans 10 years, so it's really the story of a boiled frog. But the lying and deception and how she got so many big name people on her board and advising her (Larry Ellison, Rupert Murdoch, Henry Kissinger, George Shultz, James Mattis) is simply amazing. Of course, none of those people know anything about biotech companies, so it's also a story about investor optimism (and lack of due diligence). I’m fairly certain she didn’t initially set out to defraud investors and put patients in harm’s way when she dropped out of Stanford fifteen years ago. By all accounts, she had a vision that she genuinely believed in and threw herself into realizing. But in her all-consuming quest to be the second coming of Steve Jobs amid the gold rush of the “unicorn” boom, there came a point when she stopped listening to sound advice and began to cut corners. Her ambition was voracious and it brooked no interference. If there was collateral damage on her way to riches and fame, so be it."}, {"Review": "In case you weren't already aware: Absolute power corrupts absolutely.I so want to discuss various elements of Bad Blood, but I want even more not to give anything away for those who haven't read it yet. I'll just say that this book is about power and money and megalomania and extreme cowardice and fear but also the kind of extraordinary bravery for which we should all be grateful. I was riveted and APPALLED and it was such a good story that I didn't want it to end, but at the same time I really wanted those bastards to get what they deserved. Highly recommended!"}, {"Review": "58th book for 2018.John Carreyrou the unicorn killer!Shortly before Carreyrou's expose appeared in the Wall Street Journal, Theranos, a Silicon Valley biotech startup, had a valuation of 10 billion dollars, within a few months it's net worth was close to zero. All hail the power of investigative journalism!It took me about a third of the book (100 pages) to really get into the Theranos story, but once hooked, I couldn't put the book down and read the final 200 pages in a single afternoon. In Bad Blood, Carreyrou plots the rise and inevitable fall of Theranos and it's charismatic leader Elizabeth Holmes, who went from Stanford dropout, to a net worth of 5 billion dollars back to zero in course of a few short years.When I was at Caltech in the early 2000s, one of the best talks I attended was by a professor who re-purposing silicon chip technology to etch microscopic channels, with switches etc, which would allow researchers to mix-and-match chemical reagents, literally on a silicon chip. It was this sort of microfluidic technology that Holmes must have been exposed to in the early 2000s as an ambitious undergrad at Stanford (perhaps she heard the same talk there?). Her original idea was simple: A wrist strap which could take minute samples of blood, which would then with a microfluidic system embedded in the strap be used to perform multiple blood tests in real time. So after two years as an undergraduate she quit Stanford and founded her own startup to make good on her idea. What then happened was remarkable. She was able to rope first one then another elder man (it was always older men) to sign on to her vision. First her undergrad mentor at Stanford, Channing Robertson, then a Larry Ellison the venture capitalist, later former Secretary of State George Shultz, Henry Kissinger, General James Mattis etc. All these elder statesmen, with little or no knowledge of biology, worked to raise status of Theranos, and made it increasingly hard to question it's worth. At it's point of collapse it had raised nearly one billion dollars in investment, which was mostly burnt within a couple of years on lawyers fees.Initial work on the wrist strap didn't workout, so a toaster-sized scanner was worked on, which when no where, then a much bigger, PC-desktop sized, was developed. Since the original microfluidic system didn't work, it housed (hid) a modified robot glue-gun that noisily moved a pipette about inside. Lots of problems with heat, calibration, breaking pipettes etc. made this system essentially useless for blood testing. However, this did not stop Holmes partnering with Walgreens and Safeway to bring blood testing to the masses (at the time of Carreyrou's first article Walgreens was about to deploy the system to over 8000 stores USA-wide). By both exploiting regulatory loopholes and blatantly lying to regulators Theranos was able to process blood tests in house. As their own system was useless they modified Siemens machines to run on a much diluted sample of blood (since they had sold themselves as only needing a pin-prick to perform 100s of tests). Naturally by diluting their blood all sorts of problems arose and their tests were essentially worthless, with real life consequences. One doctor reported to Carreyrou that on the basis of a false Theranos test a pregnant woman's medication nearly was changed which would have likely resulted in a miscarriage. Luckily the doctor was suspicious of the result and ordered a retest with a different company, which showed no abnormality. How many patients were not so lucky is unknown. After the scandal broke more than a million blood test results were voided in California alone, leaving an open question how many people was hurt or even killed by Theranos. Watching Holmes on Youtube now (check out her TedEx talk) is a surreal experience. Everything from her unbelievable deep voice, to her claims of being able to runs hundreds of tests on pin prick or blood, even her story about wanting to save an uncle from cancer, are all fake, fake, fake. And yet she is so charismatic. You want her to succeed. You want her to be the real deal. To be the first female tech billionaire. To go out and save the world. Carreyrou ends on the open question of whether Holmes is a sociopath. Having read this book I have little doubt. How many other Silicon Valley CEOs fit this profile is an interesting and disturbing question.4-stars."}, {"Review": "Wow. Usually when things sound too good to be true, it's because they are. The Theranos device never made sense to me from the news reports. But the college dropout with the fancy connections managed to fool all kinds of famous and important people for years and years, and get about $1 billion in investments, publicity, etc. It's hard to say what's more breathtaking --her evil or their stupidity. And what does that mean about the leaders of government and industry that they are so gullible? Henry Kissinger and George Shultz can get a pass because of advanced age, but one of these fools is U.S. Secretary of Defense right now! As the author of the book correctly points out, this isn't just about a stupid consumer product, this was a medical device with life-or-death implications. And this disastrous con almost wound up in every Walgreens across America as the way for people to get lab tests! The closest thing to heroes in the story are the ex-insiders who talked to the reporter. There should be a better system to stop this kind of insanity sooner. Theranos should never have been taking part in patient care. "}, {"Review": " “Grow fast, lose money, go public, get rich. That’s the model.” -- Dan LyonsUnicorns are rampant in the Boston area, and a slide my previous employer liked to show touted that any given time there were just under 1000 biotech or pharmaceutical based companies in the greater Boston/Cambridge area--a roughly 6 mile radius. While this book is set in Silicon Valley, it isn't the first account I've read about rampantly abusive corporate culture, and idolizing the unicorns that made it big. This particular narrative focuses on the Stanford dropout Elizabeth Holmes, founder of the now infamous Theranos blood testing company.  Aileen Lee wrote about the proliferation of startups valued at $1 billion or more. She called them “unicorns.” Despite their moniqure, these tech unicorns were no myth: by Lee’s count, there were thirty-nine of them—a number that would soon soar past one hundred. This book left me particularly baffeled because I don't understand how Holmes managed to get so many people to invest in a product they didn't understand based on an idea, regardless of how charismatic she could be, that she couldn't personally deliver. My specialty is analytical chemistry, or the development of methods for testing of things specifically in biological samples using microfluidics and separation science (UPLC or LC/MS) and I was left with several WTF moments while reading. There are a lot of things mentioned by Carreyou that ring true to the world of biotech/pharma: strict security, IP and nondisclosure agreements, odd perks, etc., but the author makes an interesting point on how life science based companies are different from purely tech based startups, something I would have to agree with. He also notes how Holmes tended to take these things to the extreme, particularly when it came to proprietary information. This brings us to an important distinction between this particular company and others who have dabbled in making it big through invention--Theranos dealt with human samples and marketed itself as an alternative to traditional DIAGNOSTIC testing. It then rolled out a product that was not validated to the public for that exact purpose. Even in the discovery/R&D space that I work in, properly validating methods is extremely important so you know you can trust the data and proper controls are required for that. Cherry picking the data that supports what you want to see, and the comical setup they had to try to make their readings more reliable should have been a huge red flag to \neveryone\n and I applaud those who spoke up, at great risk to themselves. This book, an expansion on the several articles written by Carreyou on the subject, is well researched, but also leaves you with no doubt as to what the author thinks of the company founder, who was often touted as the next coming of Steve Jobs. He uncovers the cloak and dagger daily life of the young woman convinced that her technology was so revolutionary that her life was in danger and claims the genius title and patents for her company's products, though she doesn't have the background to actually produce any of these things. Her treatment of employees and the tactics used to gain investors is simply horrid. Holmes is an example of a girl boss so swept up in the title and fame that she lost sight of her original vision, which was supposedly to bring low cost, easy access testing devices to the masses. I'm unsure how to rate this, as it's almost surreal that it actually happened, but it's once again a reminder that as a community, scientists have to do better. If you enjoyed this, also checkout Disrupted: My Misadventure in the Start-Up Bubble. While it's set outside of the life sciences field, and comes up short on a few different areas, it's a further expansion into the unicorn culture that's sweeping through the coasts."}, {"Review": "Author Carreyrou gave a book talk in Palo Alto that was (as you can imagine) well-attended. I read his articles at the WSJ as they developed, but it's always fun to see the author in person (as you know, dear Reader). The biggest stir in the audience was his reveal that Rupert Murdoch, owner of the WSJ and hence Carreyrou's ultimate boss, had made a $125 million late-stage investment in Theranos, now worth nothing. Theranos lawyers made multiple appeals to Murdoch personally, trying to get him to quash the stories. He declined, and good on him! What you might expect from a good Australian. Even to a multi-billionaire, $125 million is way past chicken-feed.Anyway, Carreyrou's take is that Elizabeth Holmes is a pathological liar, and never had anything that was even close to working. But a hell of a saleswoman. Or con-woman (take your pick): from Stanford dropout to paper billionaire in not many years. Ruined now, and likely to face jail time, he thinks.Now that I've actually read the book: it's compulsively readable, although he gave more details than I really wanted to know, or could keep track of. The most striking thing in the whole Elizabeth Holmes/Theranos story is how many warning signs there were, and how many people ignored them. She was a remarkable saleswoman, and ruthless in protecting her company from exposure. And she never had a usable machine, not even close. Walgreens wasted hundreds of millions on their deal with Theranos. Safeway spent $350 million on \"Wellness Centers\" for Theranos, ignoring medical consultants reports that their machines weren't working. No real due diligence by either company. Remarkable.What she had, and made full use of, was a growing reputation as America's first self made (paper) billionaire. And a very good Steve Jobs Reality Distortion field, except Jobs could deliver real products, and if his first models were a little clunky, well, he wasn't endangering anyone's health. I don't think the Theranos fake blood tests actually killed anyone, but they certainly scared hell out of some patients, and their doctors.What Theranos had was $900 million raised from investors, all pissed away at the end. Millions spent on high-priced lawyers to keep the serfs in line, and terrorize people who'd quit, and were willing to talk to the author. This is the scariest part of the book. Theranos was an absolutely terrible place to work. She drove one of her scientists to suicide. And threatened his widow with lawsuits, after she talked to the WSJ reporter. Theranos heavies were strong-arming doctors who were unhappy with the (fake) tests, and talking to Carreyrou.Definitely a must read, and \"soon to be a major motion picture.\" 4.5+ stars."}], "Genre": "Crime", "ID": "37976541", "Desc": ""}