{"Genre": "Crime", "Reviews": [{"Review": "Before I begin I would like to apologise for my use of the N word in this review. It is necessary, I promise.This book was originally published in UK under a charming title of \"Ten Little Niggers\". When it came to the US version in the 40's someone decided that 'Ten Little Niggers' is not the most marketable title for a book so they changed it to 'Ten Little Indians' (as it was still ok to call Native Americans Indians then).Only years after someone decided that neither 'Niggers', nor 'Indians'"}, {"Review": "يجب أن أعترف أن ضيق أفقي هو مامنعني من دخول عالم أجاثا كريستيفمنذ صغري لم تبهرني أغلفة قصصها المترجمة للعربيةكما أن معرفة والدي لافلامها وقراءة والدتي لروايتها منذ الصغر جعلني أشعر أن الغموض بهذه القصص \"موضة قديمة\" وألغازها ستكون مكشوفة ليناهيك عن مقولة \"لابد أن الخادم هو من فعلها كقصص أجاثا كريستي\" جعلتني متشككا أن الحل دائما نمطيافلماذا أقرأ لها؟..لم يعد هناك شئ   عشر عساكر صغار ذهبوا الي العشاءاختنق احدهم ..ثم تبقي تسعة  الي ان جائتني دعوة..دعوه لقراءة احد كتب اجاثا كريستي لانها في قائمة أعلي"}, {"Review": "This lovely mystery book is first and foremost about the administration of the long-overdue justice, right? At least that's what the mastermind behind it all believes.But the question is - who has the right to decide what justice is? And who is to decide what punishment serves the crime? And is perceived justice at all costs the ultimate goal, or is it the frequently pointless work of a maniac? As a matter of fact, what is justice after all?I think the story of this book (the one that may win th"}, {"Review": "I'm a big lover of Agatha Christie, she has written some fantastic murder mysteries and her stories never get tiring. But this is the one that just comes out on top every time.It partly, and quite amusingly, reminds me of that old American murder mystery in Sunset Beach. Basically, they're the only ones on this island and someone is killing them off one by one in accordance with the Ten Little Indians rhyme . And I swear I never saw it coming, and I'm usually very good at it. It's just a very cl"}, {"Review": "5 stars to Agatha Christie's And Then There Were None. This is the book that started my absolute love of the mystery genre. I was addicted and must have read it 3 or 4 times over the course of the year. Between the poem, the deserted island, the plot twist, the count-down, the pure clandestine suspense... it couldn't get any better. Story Ten people receive a mystery letter from someone they don't know that indicates they should come to a remote island. Why would they go????? After arriving, the"}, {"Review": "Reread: 2015Because some Non-Crunchy Cool Classic Pantaloonless friends thought I read it wrong...Turns out, I did. This was a really good mystery!{insert long-winded apology with much groveling}Happy, guys?The story goes a bit like this:10 strangers each get invitations from someone they think they know, to stay on an island resort. Hells yeah! Sunshine & sea air!Well, resort is a bit of a misnomer. It's really a big house on an island. Still, it's famous for being a party place, and nobody"}, {"Review": " “Watch and pray. The day of judgement is at hand.”  Now I understand why Agatha is the Queen of crime! This was addictive. A group of people are all individually invited to an island for a summer holiday in Devon. None of them 100% sure who their mysterious host is. Things become even more peculiar when their host isn’t there when they arrive, and doesn’t show themselves at all. One by one the guests are killed, picked off, leaving the others terrified and paranoid. It was a fantastic mystery t"}, {"Review": "This year I have decided to take part in a women's century challenge in the group catching up on classics where the participants read a book written in ten consecutive decades. I chose to focus on the 20th century and my 1930s selection is And Then There Were None by Agatha Christie. Although I had previously read some of her Hercule Poirot cases, this is my first stand alone mystery of Christie's that I have read. A suspenseful premise for a case, And Then There Were None left me on edge for th"}, {"Review": "“When the sea goes down, there will come from the mainland boats and men. And they will find ten dead bodies and an unsolved problem on Soldier Island.”My first Agatha Christie, and a good one indeed. And Then There Were None just recently came to my attention. Maybe it was the new mini-series or the many people suddenly reading this, but I was intrigued immediately. I can't wait to watch the series!Agatha Christie totally tricked me. I thought I had figured it out, but I was wrong. This novel t"}, {"Review": "Extraordinary and gripping novel!I knew that the best way to start reading the literary work by Agatha Christie was choosing her most known book. And There were none is the best-selling mystery novel of all time with 100 million of copies, and the fifth book in the list comprehending all genres. That is something to give to Agatha Christie the respect that she deserves.Initially this novel on UK was titled Ten Little Niggers, only because the original nursery rhyme was called that but it was obv"}, {"Review": "$2.99 Kindle sale, Dec. 26, 2018. Every once in a while on Goodreads I find myself feeling compelled to make a True Confession, and here's another one: I'm not all that much of a Hercule Poirot fan. For someone who's read probably 30 or 40 Agatha Christie books over her lifetime, that's probably an odd thing. I like him okay, I don't DISlike him, but yeah, he kind of irks me sometimes. So when I'm picking up an Agatha Christie mystery, I'm always a little bit tickled when it doesn't involve Poir"}, {"Review": " \"Ten literary Goodreads reviewers chatting online;One bot was discovered and then there were Nine.Nine literary Goodreads reviewers on a thread until late;One lost his Wi-Fi signal and then there were Eight.Eight literary Goodreads reviewers groupreading Austen;One only read males and then there were Seven.Seven literary Goodreads reviewers averse to using pics;One blasphemed with GIFs and then there were Six.Six literary Goodreads reviewers booktubing live;One revealed too much and then there"}, {"Review": "Kurgusu mükemmel. İnsan son ana kadar katili kestiremiyor. Olaylar çok çabuk gelişiyor ve kitap bir çırpıda okunuyor. Bence en güzel Agatha Christie romanı ..."}, {"Review": "And Then There Were None is one of Agatha Christie's most celebrated mystery novels, and purportedly one of the most difficult for her to write. I don't dislike this book. It seems to be a favorite among many, but it's very middle of the road for me as far as Mystery/Thriller books go.  The Good: I enjoy the setup & how this mystery is structured. It's fun & easy to engage with in a \"Gee, I sure am glad I'm not in their shoes\" kind of way. It's written well with an accurate insight on hu"}, {"Review": "Wow! This is a masterpiece! Dame Agatha Christie's achievement is remarkable. She creates ten characters, all suspected of murder, who are lured to an island. She has them meet their deaths one by one as nominated in the nursery rhyme \"Ten Little Indians\" which is displayed in their rooms. She has each murder occur in a situation where almost all the other island guests might have had opportunity to commit it. Set on an isolated island without contact of the outside civilization, a group of ten"}, {"Review": "SUCH a superb mystery. Wow. "}, {"Review": "Η αξία και η γοητεία του κλασικού αστυνομικού μυστηρίου. Εκπληκτική πλοκή,εξαιρετική περιγραφή και σκιαγράφηση ηρώων καθώς η συναισθηματική τους φόρτιση μεταλλάσσεται απο στιγμή σε στιγμή. Όλες οι ανθρώπινες αδυναμίες και αρετές σε ακραία σημεία. Απο το πάθος στο λάθος. Απο τη χαρά στον πόνο. Απο την αθώωση στην παντοτινή ταπείνωση μέσω συνείδησης. Όλοι κρίθηκαν αθώοι για κάποια εγκλήματα. Σχεδόν όλοι ειναι ένοχοι όμως.Ανάμεσα σε δέκα άτομα που δέχονται πρόσκληση για το νησί του Νέγρου με σκοπό"}, {"Review": "I admit I am a late, reluctant and suspicious convert to Christie. I avoided her studiously as an adolescent, because dozens and dozens of her paperbacks were always on sale with equally cheap indistinguishable romances and other 'women's books,' and I wanted no part of those. I read Chandler, not Christie; Hammett, not Sayers; James, not Marsh. I even read a few Spillane books, for Chrissakes, at a friend's urging (UGH), but still no Christie. Those endless TV adaptations, with the dotty Miss M"}, {"Review": "Ten little Indian boys went out to dine; One choked his little self and then there were nine.No wonder this is considered to be the best book of Agatha Christie's ever - it is truly a masterpiece. Nine little Indian boys sat up very late; One overslept himself and then there were eightAnd I am not just saying it- I truly mean it. I didn't just discovered it and am not speaking on a high rush of that fresh new read feeling - this was a re-read for me. And I don't re-read books very often - only t"}, {"Review": "I read this book ages ago; I believe it was my very first Agatha Christie book. I recall searching through the shelves of the local library in the mystery section trying to find something I hadn’t already read. This was during a phase when all I wanted to read were mysteries and nothing else – I suppose I was attempting to create some sort of balance with the high school required reading curriculum. I have to admit that I don’t think I had ever heard of Agatha Christie until that moment. (My par"}, {"Review": "My friend Amelie and I used this book as half of our corpus when we wrote our 1990 paper,  An Implementable Semantics for Comparative Constructions . We spent several days combing through the text, extracting and categorizing every single occurrence of a comparative construction. So you'll appreciate that I know what I'm talking about when I say it's better than most murder mysteries."}, {"Review": "You Chose Your Own Adventure!You are a man, you are a woman; you are judge, jury, and executioner. You are surrounded by murderers and assholes. Kill ‘em all! Then kill yourself. Your adventure is over.If you would like to start your life anew, choose http://www.goodreads.com/review/show/..."}, {"Review": "3.5"}, {"Review": "To talk about the plot of this book however briefly would give spoilers right away. For people who have not read them, spoilers kill Agatha Christie books. Basically there is a small isolated island bought by an American millionaire which was later sold to a mysterious party generating a lot of rumors about the latest buyer. A group of very different people ended up on the island.If you are familiar with the Dame of Mystery's writing you would guess there will be a murder. If you have read sever"}, {"Review": "Ten little soldier boys went out to dine; One choked his little self and then there were Nine.Nine little soldier boys sat up very late; One overslept himself and then there were Eight.Eight little soldier boys traveling in Devon; One said he’d stay there and then there were Seven.Seven little soldier boys chopping up sticks; One chopped himself in halves and then there were Six.Six little soldier boys playing with a hive; A bumble bee stung one and then there were Five.Five little soldier boys"}, {"Review": "4★“So far the murderer has had an easy task, since his victims have been unsuspicious. From now on, it is our task to suspect each and every one amongst us. Forewarned is forearmed. Take no risks and be alert to danger. That is all.\"I had never read this classic “locked-room” mystery, which is actually an isolated-island mystery. Written in 1939, nearly 80 years ago, it’s obvious there will be no helicopters doing either retrievals or midnight drops of surprise visitors. And there’s no telephone"}, {"Review": "I'm a confirmed puzzle lover. Crosswords, sudoko, Scrabble, Clue, card games. I love them all. Puzzle love extends to my go-to lit genre. The way an author crafts a mystery with a surprise yet plausible ending is the best in my book (pun, intended). There is so much fun to be had in gathering clues and solving the puzzle the author has created.That is all the more reason the confession I have to make is deeply shameful. This is the first Agatha Christie book I have ever read in my life.I know. I"}, {"Review": "A GREAT murder mystery. Even though I knew the story and saw the movie long ago, I Loved every minute of it! Reading the book was so much better. Note: Eating tinned tongue, Ewwwww!"}, {"Review": "¡Qué genialidad este libro! Cómo me encanta leer novelas que me impactan y que quedan en mi mente durante mucho tiempo...No soy un asiduo lector de novelas policiales. Es más, para ser sincero he leído muy poco. Apenas los tres cuentos de Edgar Allan Poe (“Los crímenes de la calle Morgue”, “El misterio de Marie Rogêt” y “La carta robada”) que comenzaron con el género, “Estudio en escarlata” de Sir Arthur Conan Doyle y un volumen de 800 páginas llamado “De Poe a Simenon: Antología de cuentos poli"}, {"Review": "Buddy read with my boo Aqsa Full Review  “Ten little Indian boys going out to dine; one went and choked himself and then there were nine” I was skeptical about reading this because it did not seem like a book I would enjoy: first of all, it’s really old, second, it was a mystery book (the only mystery book I have read was ‘one of us is lying’ but that had other elements I liked such as YA and Romance) and third, it seemed more serious than books I enjoy. But I am glad I gave this a chance.This b"}], "ID": "16299", "Name": "And Then There Were None"}