{"Name": "The Boy Who Lived with the Dead", "Image": "https://images.gr-assets.com/books/1519312339l/35172168.jpg", "Reviews": [{"Review": "This is the second Albert Lincoln in what is supposed to be a trilogy, the first being A High Mortality of Doves. Once more, DI Albert Lincoln has to venture into a rural village to investigate the murder of a young woman and the disappearance of her baby. One of the key witnesses is Peter, a young boy who seems confused between fantasy and reality and whose tales are not believed by others. He talks of a \"Shadow Man\" he has seen in the cemetery near his home. Peter is also the brother of a young boy whose murder was investigated unsuccessfully by DI Lincoln, causing the townsfolk to turn on him and become uncooperative in his current investigation.There are many characters in this novel and many sub-plots: I became quite confused part of the way through it! Everyone seems to be keeping a deep, dark secret and, as usual with this author, the path to the solution is littered with red herrings. A Gothic atmosphere hangs over the tale and there is much referencing of the aftermath of the Great War - the plight of returned soldiers, wounded in mind as well as body; the losses sustained by so many, including the Lincolns themselves, whose son was lost. Like so many at the time, Mrs Lincoln has turned to a spiritualist, believing he can help her communicate with her son; in a way this is a substitute for her marriage, which is now a loveless shell.Eventually all the secrets come to light and Lincoln even manages to finally solve the earlier crime. There is, however, a tantalising thread left hanging...perhaps for a future book. "}, {"Review": "In a certain way this book is a continuation of “A high mortality of Doves”. I suggest that you read that book before this one so that certain things are not spoiled for you. But in other respects the story of this book stands on its own. Once again we are confronted by the horrors of the First World War. And then there is the baby who disappears, the boy who “fabricates” stories, the man without a face and the murder of a young women and an old women. The reader becomes emotionally involved with certain characters of the story so that it is hard to put the book down. And Kate Ellis still manages to surprise the reader with revelation after revelation. She must be a genius to write a story like this."}, {"Review": "Atmospheric sequel, mainly set in Cheshire. Very good on the aftermath of the First World War - the impact on communities and families, the flu epidemic, the former soldiers begging in the streets, the bereaved turning for comfort to suspect spiritualists. This is still quite melodramatic but not so much as the previous book in the series. The cemetery provides some very Gothic moments - a woman murdered by being pushed unconscious into an open grave and buried alive, for instance. A mystery from the past is eventually solved as well as the current spate of crimes; there is lots of hidden identity and name changes (all revealed); as in the previous book, the murderer is someone who has been trusted by everyone. There are two, or maybe three threads hanging which might be picked up in a third book, if there is one ..."}, {"Review": "I didn't realise, when I found this book in the library, that it featured DI Albert Lincoln who had first appeared in A Mortality of Doves. This was equally as good a read. It is set just a year later. For those who have yet to read the first book there's an unobtrusive 'catch up' included within the story which means that each book can be read as a stand alone. There are plenty of twists and turns in the plotting to satisfy 'whodunnit' fans. I certainly didn't guess the outcome until very near to the end. The historical setting feels appropriate particularly within the dialogue used. And there's something of a cliff hanger at the end which hopefully signals more DI Lincoln stories to come."}], "Genre": "Crime", "ID": "35172168", "Desc": ""}