{"Genre": "Crime", "Reviews": [{"Review": "Swedish people are nuts! I realize that’s a bit of a broad generalization and it sounds a bit rude, but I don’t care. Because more often than not, I’m nuts too.I was born and raised in Minnesota, and if you know our state history, you’re already aware that we were predominantly settled and populated by Swedish (and Norwegian) immigrants. So not only are many Minnesota residents of Scandinavian descent, myself included, a lot of our quirky mannerisms and even our accents are commonly attributed t"}, {"Review": "I've heard and read many complaints about Stieg Larsson's The Girl with the Dragon Tattoo:1. It's misogynistic. 2. It's packed with cliché.3. It's too convoluted. 4. It's too disturbing.5. Lisbeth wasn't autistic enough or was foolishly autistic.6. There were too many red herrings, and the damn Nazi red herring didn't have the usual payoff.7. Too/Two many plots. 8. Too hard on Leviticus. I will answer these in a moment, but first I must declare that I am an unrepentant fan of this book. This is"}, {"Review": "I really don't understand the critical orgasms over this book. Amazon pushed it on me for weeks, and the minute I stepped into Borders an employee ran over and recommended it. Thinking, this really better be the best book I've ever read, I took it up to the checkstand, where the register guy asked: \"Did one of our employees recommend this?\" Um, yeah. And Amazon, too. So of course I asked him why. \"Oh,\" he replied, \"we've been told to recommend it this week.\" That should have tipped me off right"}, {"Review": "Women are raised to routinely fear rape.“If you go at night, take a friend.” “Check under the car and in your backseat before you get in.” “I’m just saying it’s a good idea to know where the exits are.” “I got you this whistle for your keychain, you know, just so you have it.” “You were an hour later than I thought you’d be! We called the police!” “Oh, that’s pepper spray; I keep it with me just in case.” “I just make sure I get my keys out and check for other weapons if I’m getting off work lat"}, {"Review": "(A) 85% | ExtraordinaryNotes: It’s a logical, captivating mystery where everything clicks into place. It gives backwoods Sweden a Transylvania feel."}, {"Review": "After having leaped onto the bandwagon with the rest of everyone, I feel a certain amount of pretentious indie pride saying that I wasn't as awed by this book as everyone else apparently was. Which is not to say that the book wasn't enjoyable and exciting; it just didn't knock my socks off whilst simultaneously blowing my mind and rocking my world. (that sounds like either some great song lyrics or a very complicated sexual maneuver. Let's go with the first option.)So, the good stuff: the main s"}, {"Review": "I re-read this book by audio and even though the narrator was good, he didn't do a good job on Lisbeth's voice. I wish that Noomi Rapace would have done her own voice. That would have been awesome. So, I have been a fan of this series for quite some time. I have the movie trilogy box set of the books that are fan freaking tastic! Although, now I have to switch from dvd to blu-ray! I also have a couple of different copies of the books! Lisbeth Salander is just freaking awesome. She's so bloody sm"}, {"Review": "Hey, kids, if you like books in which the only major descriptive moments happen during sexual torture scenes, where major characters lack motive, and where the red herrings...stink ... this book's for you!I may feel less strongly after a few days, but I am having a hard time believing this book has hit the best-seller lists in multiple countries.**Rant containing Mild Spoilers**Here are my complaints: 1. The entire book sets you up to think that the alleged killing/s were perpetrated by one or m"}, {"Review": "The original Swedish title of this book is \"Men Who Hate Women.\" If you ask me, it suits this story much better than catchier but less relevant \"The Girl with the Dragon Tattoo,\" because it is in fact about men doing all kinds of horrid things to women. So here is the first warning to you, if you don't handle violence against women and children well, skip this novel. It's hard to give a short synopsis of the book. \"The Girl with the Dragon Tattoo\" starts off as an investigation of a 40-year old"}, {"Review": "Disgraced journalist Mikael Blomkvist is hired to solve the decades-old murder of Harriet Vanger, member of one of the wealthiest families in Sweden. Aided by a tattooed, antisocial hacker named Lisabeth Salander, Blomkvist unearths horrible skeletons lurking in the Vanger family closet...For a few years now, I've been avoiding The Girl with the Dragon Tattoo. Since so many people told me I just had to read it, many of them non-readers, I assumed it was a lot of over-hyped, dumbed-down crap. Wel"}, {"Review": "I HATED this book. I don't understand all of the good reviews that are coming in on it. I hated the characters, the plot was thin - ugh. I can't believe I read the whole thing."}, {"Review": "He slapped her hard. Salander opened her eyes wide, but before she could react, he grabbed her by the shoulder and threw her on to the bed. The violence caught her by surprise. When she tried to turn over, he pressed her down on the bed and straddled her.That's just to give you a little taste of what one is dealing with by picking up this book. If you can handle that and the previous x amount of paragraphs and the following x amount of paragraphs, you're golden. If that sort of makes that thing"}, {"Review": "Larsson takes what seemed at the outset to be a juicy 'locked-island-mystery plot' and turns it first into an insightful family saga and then into a scathing political and social commentary that forces us to think about such a wide variety of themes and aspects that we normally refuse to accept as part of society. It takes an author like Larsson to shove it in our faces in all its stinking ugliness for us to stop turning the blind eye at these atrocities.Do not mistake this for a mere fictional"}, {"Review": "My very first time reading a mystery/detective novel. Loved it."}, {"Review": "This is really a 1.5 stars. Ok, there was a good mystery during the middle third of the book. THere were alot of characters. There was suspense. AND there was also those first 200+ painful pages of character introduction and back story. That equals 1/3 of the whole book. Who slogged through those first 200 to find out that the mystery picks up? How did this series get so huge?And there was also a plot that revolved around rape, violence, torture, murder and endless degredation of women. My quest"}, {"Review": "Loved! an interesting,mystery filled and a very thrill-seeking storyline..well written,nice movie also (paperback!)"}, {"Review": "Buckle up. It's gonna be...a slow ride until about halfway through. Then it's hairpin turn after hairpin turn at breakneck speed. Whiplash.This book was a bit difficult to get into. Mikael Blomkvist (a journalist) is sentenced to jail for liable. He knows he's right. His team knows he's right. But they don't have enough evidence to overturn it. His magazine is about to go under and with this jail scandal....let's just say life isn't a bouquet of roses.Henrik Vanger - ex-head of the Vanger corpor"}, {"Review": "Thanks to the slew of Swedish and Hollywood movies, everyone knows that  The Girl with the Dragon Tattoo is a story of a kickass hacker Lisbeth Salander who has the eponymous tattoo and a knack for solving decades-old murders. Well, not exactly. Lisbeth is awesome and badass, no doubt there, but this book is so much more than just her story, and focusing solely on that undermines the message Stieg Larsson was sending. The original Swedish title is  Men Who Hate Women and it is precisely what the"}, {"Review": "Not sure what all the hype was about. The first 1/3 of the book showed promise. Two seperate characters who will soon cross paths. Kind of classic mystery story telling. But then it has some moments of perversity that didn't really need to be in the story. Kind of creepy and weird. I guess there is not a lot to do in Sweden.  The second part they are together on an island trying to solve a mystery that was never really engaging. They had to find out what happened to a girl forty years ago. Wow!"}, {"Review": "Now that's what I'm talking about! I've never seen the genre political thriller get mentioned on Goodreads, but here is a prime candidate for this moniker.The translation seems elaborate, genuine, and faithful enough. The places or settings in the book are descriptive. The scenes are well lit.As for the plot, it's quite intricate. Read it and find out! The characterization is not world class, but the author gives the impression that he could write purple prose, if he wanted to. There is blackmai"}, {"Review": "One of the best thrillers I've ever read. Great story, great characters, very intelligent and thoughtful. Writing is nothing special but it doesn't need to be.___________________________________________I finally saw the movie a couple of days ago, and I'm a bit conflicted. On the plus side, it conveys the feel of the book very well, and several of the main characters are excellently realized. I particularly liked Lisbeth, who was just perfect. But they have taken some enormous liberties with the"}, {"Review": "we are in low-three land here. but at least i am learning things about sweden! for example: ladies in sweden just kind of shrug off sexual abuse! they are rape-teflon! this i am learning from the facts provided at the beginning of chapters, and from various characters' reactions to events. they just brush themselves off and go back to eating sandwiches. yes, that is another thing i learned: the swedes eat sandwiches. exclusively. if you excise every occurrence of the words \"coffee\" and \"sandwich"}, {"Review": "Nordic noir of the highest order and very entertaining. Larsson’s 2005 Swedish publication Män som hatar kvinnor “Men Who Hate Women” was later translated and published in English in 2008 by Steven T. Murray, by that time already an international best-seller.And for good reason.Complicated, intricate, and intelligent, Larsson’s journalistic prose is crisp and logical. Filled with interesting characters, exciting scenes and this just flows very well. Mikael Blomkvist and Lisbeth Salander are two"}, {"Review": "Man som hatar kvinnor = The Girl with the Dragon Tattoo (Millennium, #1), Stieg Larsson عنوانها: دختری با نشان اژدها؛ دختری با خالکوبی اژدها؛ دختری که رازی کهنه را آشکار کرد؛ عنوان سوئدی: مردانی که از زنان نفرت دارند؛ نویسنده: استیگ لارسن (لارسون)؛ تاریخ نخستین خوانش: روز بیست و هفتم ماه جولای سال 2012 میلادیعنوان: دختری با خالکوبی اژدها - کتاب اول؛ نویسنده: استیگ لارسن (لارسون)؛ مترجم: اصغر اندرودی؛ کرج، در دانش، 1389؛ در 620 ص؛ شابک: 9789641741299؛ موضوع: داستانهای نویسندگان سوئدی قرن 20 معنوا"}, {"Review": "5 stars to Stieg Larsson's The Girl with the Dragon Tattoo. You heard all the hype about the author who died and his books weren't published. You heard that they were translated into English. You heard they were great and both Sweden and Hollywood were making a movie of it. Well, it's all true. So is the fact that this is a must read for every mystery fan! Story So many plots, so little time. Basically, the primary plot is about a missing girl. A relative wants to find out what happened that mys"}, {"Review": "Editorial meeting of Bryant Reviews LtdTopic : book 1, Millennium series- Is everyone here?- We should start anyway.- Okay, well, we have to figure out how to review this damned Dragon Tattoo book. The problem is, everyone and his dog has already reviewed it, and seen the movie. Movies. What’s left to say?- Well, you could say the same thing about Dickens.- All due respect, Larsson is not no Dickens.- True dat.- True dat? Who are you, gangsta-reviewer?- What about the sandwiches and coffee?- ?-"}, {"Review": "In 1966 sixteen-year-old Harriet Vanger, daughter of the CEO of the large family-run Vanger Corporation, goes missing from her family's island community and is never seen again. Not even a body is found, and her great uncle, Henrik Vanger, has explored every possible lead to discover what happened to his one and only favourite family member.Over the last forty years her disappearance has become Henrik's obsession, and he's positive someone in the family murdered her - but they never found a moti"}, {"Review": "ode to a dragon-tattooed girlshall i compare thee to a cinematic adaptation of one of my favorite books?thou art more genuine and less mass marketable.rough cgi does shake my sense of disbelief,and the movie's adaptation hath all too short a running time.sometimes too overemphasized the plot and action sequences,and often the depth of character dimmed.and every sequel from prequel's quality declines,by chance, or budgets allowed to expand, untrimmed.but thy entertainment value shall not fadenor"}, {"Review": "Loved it! an interesting,mystery filled and very thrill-seeking storyline..was well written,nice movie also... (paperback!)"}, {"Review": "I have so many negative thoughts about this book. So here's a list of complaints:a.) Either this was very poorly translated or very poorly written. I've heard arguments for both. Tons of unnecessary details (all the coffee stops!), repetition of things we already know, paragraphs about nothing just petering out. Even at times when I was enjoying the plot, I felt as though I had to fight my way through dull writing.b.) For as dull as it is in most parts, this book is waaaay too over the top in ot"}], "ID": "2429135", "Name": "The Girl with the Dragon Tattoo"}