{"Name": "Stillhouse Lake", "Image": "https://images.gr-assets.com/books/1495714483l/33128934.jpg", "Reviews": [{"Review": "\nIn the morning, there's another girl floating dead in the lake.\nEasily one of the better mystery/thrillers I've read this year. After disappointments from old favourites with Since We Fell and newly-hyped thrillers like Final Girls, I managed to find a really creepy, suspenseful story from an author who has always been a bit hit and miss for me.The book starts with a very dramatic and gruesomely exciting opening chapter. I've grown to appreciate slow build novels, but thrillers that pull out a vicious hook in the very first chapter still have a special place in my heart. From the very beginning, I knew I had to find out what would happen. And it only got nastier.Gina Royal's perfect suburban life is turned upside down when her husband's dark, sadistic secrets are revealed. Now she is Gwen Proctor, on the run, doing anything she can to protect her two children from the online trolls who promise a sick revenge. Paranoia and lots of moving around have kept them all safe so far, but Gwen longs to find something more permanent; a place her children can have some stability and make real friends. She hopes that place will be Stillhouse Lake.If you aren't already creeped out by the name \"Stillhouse Lake\" and the promise of this isolated community, you soon will be. Just as things seem to be looking up, the body of a young woman is found floating in the lake. And worse - the details of her death bear a striking resemblance to the methods deployed by Gwen's ex-husband.It is a very compelling, easy-to-get-lost-in pageturner. It reminds us of the dangers present in a world with the Internet and the info-sharing it allows. For a brief moment, I wondered if a large group of people would really go to such disgusting lengths, exposing the addresses of children who are as much victims as those their father murdered - but then I realized, of course they would. Just recently, I was told about a subtweet in which someone I don't know and have never spoken to said they wanted to drown me in bleach. Drown me in bleach. And all I did was write book reviews they don't agree with.Of course people would behave like the trolls in this book. It's a no-brainer.So it reminds us of all this - of the threat posed by the Internet, of the lengths sick people will go to - but it also reminds us of something else: that nothing in this world can compete with a mother protecting her babies. And that touched me.It's a thrilling book, full of atmosphere, and the sense that no one can be trusted. It finished with a fantastically terrifying ending that sets us up for what looks to be a dark and exciting sequel. I will definitely be reading it.Blog | Facebook | Twitter | Instagram | Youtube"}, {"Review": "\nGina never asked about the garage. That thought would keep her awake every night for years after, pulsing hot against her eyelids. I should have asked. Should have known. But she'd never asked, she didn't know, and in the end, that was what destroyed her.\nThere were some things that I didn't totally like in the book, but for the most part it was really good! **Mild Spoilers**It's been a few years now and Gina is now Gwen and she is living in Stillhouse Lake, TN <-- I live in TN =) Gwen is living in a cabin on the lake with her two kids, Atlanta and Connor. They changed their names too. Actually, they have been different people a few times with a few different moves. But this time, Gwen is hoping they can actually have a home and stay there. Gwen has a mysterious hacker that she pays to keep out the evil people and he lets her know when they are on her trail so she can move again. It's pretty bad. Her husband was a serial killer that tortured and killed many women. RIGHT THERE IN THEIR GARAGE. I find it really odd that Gwen never asked to go into the remade garage. You could only get in through a door on the side of the house after her husband Mel had it redone. He just said it was his workshop. Seriously, you never go to check this out. But then again we wouldn't have a book. Unfortunately for Gwen and the kids the police don't believe her either. I can't say that I blame them but it gets really bad for them. Gwen goes to jail for a bit and her mom watches the kids and tries to keep them hidden. When Gwen gets out, she gets the kids and they are on the run. The reason they have to run is because all of the haters that believe she was in on it are threatening her and the kids. I mean these people are saying some horrific things they want to do to Gwen and the kids. I mean the kids too? It's just unreal and sadistic. Even if you think she had something to do with it you don't mess with the kids! Everything is finally going good at the lake house. The kids are making friends after a rocky start. Gwen does online work so they have money. They meet a friend neighbor, Sam, who helps them fix up the house. Gwen takes shooting practice at the local range and made a friend there. It's all looking up until . . . letters start to arrive from her husband in jail. A dead woman is found in the lake, killed the same way her husband killed his women. Gwen can't win for losing. She pays a visit to Mel in jail and threatens him. Of course that doesn't help and Gwen is taken in for questioning about the body. Everyone finds out who her and the kids are and they get people trying to kill them. Then the kids get kidnapped by a psycho fan of her husband. Lets just leave it at that. Gwen does get the kids back with the help of a friend and a cop. Then the wonderful news at the end and I'm not going to tell you what it is, but it isn't good. But I think Gwen will be able to handle it.MY BLOG: Melissa Martin's Reading List"}, {"Review": "My reviews can also be found at: https://deesradreadsandreviews.wordpr...I’ve been trying to stay away from reading any new series until I finish the ones I’ve already started. However, I’ve been seeing “Stillhouse Lake” pop up everywhere lately, and after reading the description and a few reviews, I had to admit, I was intrigued. I decided I had to read it... and I’m really glad I did.Normally, Gina Royal is home at three in the afternoon, but her husband, Mel, has called and asked her to pick up the children as he has a work emergency. He was sorry to have disturbed her routine. He was kind that way, the “best, most charming man”. A great father to seven-year-old, Brady and ten-year-old, Lily.\n“Normal life. Comfortable life. Not perfect, of course. Nobody had a perfect marriage, did they? But Gina was satisfied, at least most of the time.”\nShe’s looking forward to watching a movie with Mel and the kids that evening. Family time is one of Mel’s favorite things. His other favorite thing is spending time in his workshop, working on his projects. Gina never asks what he’s working on.When Gina gets back with the children, the street is filled with police cars, ambulances, and fire trucks. She sees that her bushes are flattened, as well as her mailbox. Then she sees the SUV embedded halfway into the garage—Mel’s workshop.Now Gina’s life is about to come crashing down around her.When she gives her name to the police their attitude towards her becomes aggressive. She thinks they must have her mixed up with someone else. She is read her rights and she feels like she’s in a nightmare….this can’t be happening. Then the police officer shows her the garage…and what Mel was really doing in his workshop….and she starts to scream.Four years later…..New Names, new state, new home, and a new life. They are definitely not in Kansas anymore. Gina Royal no longer exists…she’s now Gwen Proctor. And there are a LOT of differences between the two. Where Gina was weak and submissive, Gwen is strong and dominant.Gwen wants to set down some roots, give the kids a sense of stability and safety. She wants to leave Gina and everything else behind…The accident. The arrests. The trials. \nTHE EVENT. \nHowever, there are people who just won’t let that happen. People who believe that she really was “\nMelvin’s Little Helper\n”.“\nThe Sicko Patrol\n” is what they call Gwen’s daily internet searches. She needs to keep an eye on what’s being said about her and her children, in case the trolls aren’t just blowing off steam. She forces herself to read just how much people hate her and the vile things they say.\n “On and on and on. I leave Reddit, go to Twitter, find more threats, more hate, more vitriol—just in concise, 140-character bites.”\nBut some are more dangerous than others….\n“The ones who are more interested in us, in Melvin Royal’s missing family…those are the ones who are dangerous.”\nAll she wants to do is survive and keep her kids safe. She runs crisis drills. They have an escape plan. They have an alarm set at all times, and Gwen is armed to the teeth!Melvin is in jail but why does Gwen feel like things aren’t done?And then the police come knocking…“Something very bad has just begun”Well, this was quite a read! I’m surprised at how quickly I flew through this novel. I devoured it in just two days. There is some violence; I did have to skim a few parts, but not enough to spoil the book for me.“Stillhouse Lake” is an intense and action-packed thriller. A dark and twisted story of betrayal and murder. The ending had me rushing to find book two of the series as I was desperate to find out what was going to happen next.\nA killer read! \n"}, {"Review": "This was exciting from beginning to end! I love this spin on the typical serial killer thriller; here, we see the focus on the family the monster left behind. My nerves constantly ramped up as the tension grew; this was compulsive reading at its finest and I'm so glad I was able to snag this with my Kindle Unlimited membership. I was a bit surprised to see so many typos and formatting issues though; I don't read enough finished ebook copies to know if maybe this is normal? Anyway, it wasn't enough to deter me from devouring the book and I am eagerly anticipating book 2 in December! "}, {"Review": "4.5, PSA: if your partner has a “secret room” burn it TO THE GROUND stars!!! Full review featured on my blog Recipe and a Read!!!Gina Royal is a good wife. She is an exceptional mother. She takes care of house and home like a juggernaut – doing what society, and her husband has told her is her most important job, to the detriment of her own well-being. She loves her children with everything she has, and while her marriage has its hiccups and that proverbial “spark” may be gone, Mel is a good father, a good husband and a good man – right? And that’s when she had one single, awful realization. It’s not a doll. And against all her best intentions, she began to scream and couldn’t stop.When a drunk driver crashes his car into the Royal’s garage – no one, especially Gina Royal has any idea that in doing so Pandora’s box is about to be opened and all of her husbands monstrous acts of murder and torture are about to be set free for all the public to see, condemn and judge. After being tried and acquitted as an accomplice to her husband’s murders Gina (now Gwen Proctor) and her children have been on the run from internet trolls and her husbands long shadow in attempt to return to a life that resembles normal. But I’ve kept them safe from the wolves, at least: the most basic and important job of a parent, to keep her offspring from being eaten by predators. Even the ones I can’t see.Finally, after a trial and immense struggles Gwen and her family have found the lovely lakeside town of Stillhouse to settle. She’s purchased a house and she finally feels she may have found a home here. Then, a body turns up right outside their back door – the signature the same as her now incarcerated husband and Gwen’s carefully constructed secrecy comes crashing down.This read had me utterly gripped from start to finish. When I read the first line of the book “I should’ve checked the garage.” I was honestly, immediately turned off. I found myself incredulous as to how someone could let an entire section of their house be prohibited to them. However, this is where Caine’s incredible skill shines. She develops this story and it’s character with a level of detail that left me in awe. As I’ve mentioned before, a lot of thrillers rely on entertaining versus likable characters and I’m pleased to say Stillhouse Lake falls in the latter category. Ultimately this ends up being rounded down because I was left a bit disappointed by the development into the final twist(s) and the motives behind who ended up committing the final crimes. While Caine did a phenomenal job developing the base of the story and it’s characters the ending felt a bit haphazard to me. However, overall I thoroughly enjoyed this read and will be picking up the second installment ASAP!I read this as a Traveling Friends read and it’s an excellent one to discuss with others, there are lots of areas for speculation and red herrings flying every which way!"}, {"Review": "\nStillhouse Lake is a great book. I mean, stay-up-until-2:00-a.m.-to-finish-it great. I read the whole thing in just a few hours, and my heart was pounding pretty fast for a while afterward!\"I'm glad I've escaped a hell I had hardly even recognized when I was burning in it. Glad that I've pulled the kids out, too.\"Gina Royal had your typical, everyday life. Her marriage to her husband Mel had its ups and downs, but for the most part, they were happy, and she felt comfortable raising their two children, Lily and Brady, together. They were the family she had always wanted.One day, a seemingly innocent car accident totally derails Gina's life, as it reveals that her husband has been a serial killer for a number of years. He used his garage workshop to commit the murders and store the bodies, and Gina had no idea. Mel always said that he had some expensive tools in his workshop, so he kept it locked. How could she have missed the signs, spent all of this time thinking her life with her husband was normal?When Mel went on trial for the murders, Gina found herself in the public eye as well, and on trial. It didn't matter how many times she swore her innocence and her ignorance of Mel's crimes, there were many in the press, in the neighborhood, across the world, and even within her own family, who believed she had a hand in the murders. Mel's supporters on the internet criticized, bullied, shamed, and threatened her in droves, enough that she had to take the kids and run, creating new identities and starting all over again—several times.Now Gina is Gwen Proctor, and her kids are Atlanta (Lanny) and Connor. In a remote town called Stillhouse Lake, they finally feel comfortable after so many years of fleeing when people started asking too many questions or Mel's minions found them. The kids are weary of giving up their lives in the blink of an eye, of having no friends, having to set and reset the house alarm, and of watching their mother driven to the brink of violence and fear in an effort to keep them safe. All three of them start to think about fixing up their house, making friends, building a life again.And then the body of a young woman is found in the lake near their house, and the similarities to Mel's crimes are eerie. Gwen's first instinct is to flee, but how can she do that to her kids again? Should she finally let her guard down and let someone know the truth about who they are, or is there someone who already knows it? Who is behind this murder? Does she still need to fear Mel, even though she's left no trail?One thing is for certain: she is no longer a victim. If it comes to defending her children or herself, she will fight to save them. No matter what that takes.This was one hell of a thrill ride! Rachel Caine reels you in on the first page and doesn't let you go until you've read the last word. Gwen is one badass mom, although I, too, wondered if she really was as innocent as she claimed she was. But having read other books in which characters have to run away when their identity is exposed, I felt as if Stillhouse Lake was one of the strongest in depicting how that split-second decision affects the children involved, those who've never had a say in what happened to them.As I've remarked before, my general MO when reading thrillers is to trust no one. I really was wondering how Caine would resolve everything, and while I felt like I had to stretch my disbelief a bit, it didn't frustrate me that much. Caine is an amazing storyteller—there aren't a lot of books that would keep me reading late into the night, desperately needing to see how the book ended!If you're a thriller fan, you'll want to grab this one—I know I'm ready for Book #2!See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"Review": "5 Stars!Chilling, Thrilling and Wholly Satisfying.Imagine waking up one day to find out that you don’t know the man you are married to. Worse yet, that he is a monster. And what’s even more horrifying? That you will never be safe after what he has done. This is the story of “Stillhouse Lake” - and boy is it one helluva ride. On the day that Gina Royal comes home to find that a car has smashed into the garage, her life literally comes crashing down before her. Turns out her husband Melvin Royal, has been using the garage as a private workshop, to mutilate and murder women. He is a psychopath and a serial killer. And Gina had no idea. He claimed to use the garage as a woodshop and would produce a bench or a table every once in a while. He kept it dead bolted, but she never thought much of it. Silly Gina. Melvin Royal went to trial for his crimes and is now incarcerated - which he blames on his wife and he wants revenge. After years on the run, living under various aliases, Gina is a new woman. She is now Gwen Proctor and her children are now known as Lanny and Connor, living in “Stillhouse Lake”, where they keep to themselves. Gwen is now a fierce woman who has become a sharp-shooter and has had their home outfitted with a panic room and a security system. Every day Gina Royal gets death threats via the internet and has people trying to find her. It’s a game of Eney Meeny Miny Moe and “Gwen” tries to stay one step ahead. Then a murder happens in Stillhouse Lake and it is similar to the type of murders that Melvin Royal did. Though no one knows who they are, Gwen is worried. It’s only a matter of time. Slowly things begin to unravel for Gwen, Lanny and Connor as life takes a terrifying turn yet again. “Stillhouse Lake” scared the heck out of me and I have a feeling that it’ll have you on the edge of your seat as well.  Rachel Caine nailed it and I can’t wait to check out the sequel. Published on Goodreads, Amazon and Twitter on 1.15.17. "}, {"Review": "Update: 13/3/18. This is currently on offer: 0.99p in the UK, $0.99 in the US (I think) - and $2.99 in Canada. It's the same price for Killman Creek, too! Loved. This. Book.Damn. This ends with cliffhanger that I didn't see coming, though I probably should have. I feel like doing a reread, already. The story is told in the first and third person perspectives - though, the third person is for the prologue, then it switches to (Gina/Gwen's) first person perspective.Gina Royal, thinks she's got a pretty normal/average life; until one day, that image is shattered, after she goes to pick up her kids, Brady and Lily, from school. She would normally be home at three in the afternoon, but her husband, Mel, had an emergency at work, so she ended up doing the school run. On her way back home, though, she notices her street has been cordoned off: There are three patrol cars behind a barricade with their lights flashing and an ambulance and fire truck, further down the street - and to make matters worse, there's a maroon coloured SUV parked halfway into her garage, courtesy of a drunk driver, who crashed into it - whilst trying his hand at valet parking. Her husbands workshop. A Patrol Officer approaches her vehicle and she introduces herself and tells him its her house, which makes the Officer reach for his firearm. A Detective (Salazar) is called over and she's ordered to get out of the vehicle, is promptly cuffed, asked some questions, before being led into the garage; where she gets to see firsthand, her husbands extracurricular activities. His handiwork. She screams.Years later, she's using the assumed name, Gwen Procter, which is the fourth, false identity she's used - and her son and daughter are now named: Connor and Atlanta (Lanny for short). Her new home is at Stillhouse Lake, which was once an expensive gated community. Because of her husbands' crimes, and after being acquitted of having any involvement in his little hobby; she's had to move from place to place, change her name a few times, as not everyone believes she's innocent (how could she not know?) so she gets trolled, receives death threats and is in constant fear for her own and her children's lives. She gets help with new identities and places to stay that are safe, from one of the people who trolled/went after her - and his? name is Absalom. Anyway, they are not friends and she pays him for his services. She checks what's being said about her on different forums, on a daily basis, which she calls: Sick Patrol. Assessing the threat level, and making sure no one knows who or where they are - is her primary objective. She's proficient with firearms, too.Unfortunately, it's not long before a body is found floating on the lake, which has similarities to her husbands handiwork; making her the prime suspect.In summation: I liked the main character, Gwen (Gina), she has a strong personality. Because of her history, she doesn't know who she can trust; especially her own judgment. Come to think of it, I didn't know who she could trust, either.Her son keeps forgetting things (which can put them in danger) and her daughter has developed an attitude problem, so she has that to deal with, too. I'll definitely be reading the sequel, Killman Creek, sometime."}, {"Review": "3.5 starsImagine coming home with your kids one day and finding your garage smashed in by a drunk driver. Then even worse, finding out that your husband has been using that garage as a little chop 'em up shop.Complete with dead body.\nThat's what happens to Gina Royal. The bad thing is? She lived with this dude and had two children by him and never knew that he was one of the most prolific serial killers around. \nGina is also arrested and tried as his accomplice, because just how could she not know?Gina was big time naïve. Now she has taken her two children and changed their identity's and ran.Because their lives are threatened daily by internet trolls...both the kind that glorify what her crazy ass husband did and the ones who think that she should be punished.She ends up as Gwen Proctor in small town Tennessee. They have a little house by the lake and the neighbors don't bother them. (they don't know who they are)Then a body turns up. In the lake. Killed just like dear old hubby liked to do it.Okay, so I'm going to admit that when I first started reading this book I didn't like Gwen or the kids. I thought Gwen may have been riding the nutso fence herself and was about to fall off. Then after a bit I actually started cheering for her. She ends up being one of those women that you better not mess with. Heck yeah. The kids? They just are kids. They all get on my nerves.Also, the whole trolls chasing them for months and years. I'm sure that people are going to feel that really is not too believable. They obviously haven't had a true internet jackass come after them. I have. I've had my family picked apart and made fun of by a group of trolls on the interwebs. Then just the other day I get a message on here from a person with a cute cat avatar as their profile pic. They had a private profile but they actually messaged me and told me that they were \"intrigued\" by me and wanted to know where I work.\nSo I can see it.Now I'm going to push the other book I was going to read out of the way and start the next one of these. "}, {"Review": "What a fascinating premise! A story told from the perspective of a serial killer’s wife. Told after he is discovered, she and her family have had to go into hiding, changing their identities. Dealing with the trolls who want to punish them for her husband’s crimes. And she still struggles with how she never knew. This is so well done. There’s a great level of suspense and tension throughout the book. A real creepiness factor. It’s really rare for me to read a mystery that literally gives me chills. I really liked Gwen/Gina. She’s got just the right level of paranoia. But she’s also smart and has seen the damage that constant running has done to her kids. Her kids are typical teenagers, with mood swings and attitudes, but with that added layer of having been put through hell. So, I guessed the bad guy correctly early on. But I’ve learned that a book can still be a great read whether you have the villain figured out or not. And there were several twists and turns in this book that I didn’t see coming. I was happy to see there’s going to be a second book and will definitely read it. "}, {"Review": "A breakneck pace and lots of serial killer chills!I'm not a huge fan of serial killer reads, but with so many great reviews I purchased this one and read it straight through leaving all my other reads languishing until I finished!Gina Royal is a shy housewife with two children she dotes on. She was living a normal life( so she thought) until one day she was confronted with her husbands \"other\" life and is forced to change her name and power up in order to protect her kids and herself! I really liked how the book is told from Gina's point of view instead of some serial killer. She becomes strong and capable and leaves her shy/helpless self behind. Husband Mel is in prison, but he hasn't forgotten them...This is book one in the fast paced, page turning series. It is edge of your seat with a fair amount of ghastly images (I needed to skim over these entirely), but the book focuses more on the family escaping and not on the crimes of the husband. Highly recommend for serial killer/ intense thriller fans! Fairly predictable ending doesn't stop me from reading book two!"}, {"Review": "I am sorry guys but this did nothing for me I DNF at 40% the premise started out fast paced easily read but for me just nothing was going on the beginning was a good start but by the time Gwen had moved to Stillwater Lake it slowed somewhat which bored me there was too much explanation & not enough movement. The characters were likeable but flawed.It was a shame really as I had high hopes for this series again I am in the minority but so be it I always say how it is at least I am honest in my assessment of this book."}, {"Review": "Book Blog | BookstagramAfter reading this I am going to be on high alert-code orange, for any signs my darling husband is a deranged serial killer.I mean, he has a serious deep-rooted hate for bunnies, so that’s got to be red flag number one. All I need now is to find a locked room in our house that I’m never allowed to go in, and it’s all but basically confirmed. I’m going to have to kill him.But we’ll cross that bridge when we get to it.Stillhouse Lake by Rachel Caine is a different twist on the usual serial killer thriller. This time the killer is behind bars and the star is his ex-wife.For the duration of their marriage, Gina Royal had no idea her seemingly doting father of a husband, Melvin, was stringing women up in the garage and doing things with the skin (Hannibal Lecter shoutout!) until a drunk driver rams into their house and reveals his last victim.Usually, that kind of coincidental happenstance to bring about an event comes across as cheap to me, but the sheer drama of the reveal was so unexpected that it worked and was a perfect hook to open this thriller up. No one reads about a body hanging in a garage and thinks, nah this isn’t really exciting. Next!Years later, Melvin is on death row and Gina, along with her two children, have been on the run – new I.D.s, new cities, never settling – because of determined internet trolls who believe Gina knew exactly what her husband’s after work hobby was. To them, she’s guilty of his crimes as well and has escaped justice. She must be punished as well.\n“I’m not on the run from the law. Just from the lawless.”\nI will admit this part of the story – which was a pretty big element – was kind of ridiculous. Granted, I don’t have any experience with being the wife of a serial killer (that I know of), and I’ve never been affected by internet doxing or the dark web, but I feel like I’ve witnessed the internet’s wrath with some regularity – that dentist who shot a lion, that white woman who thinks she’s black. And I’ve witnessed the general public’s wrath towards women who escape the justice some feel is warranted. Casey Anthony, Karla Homolka.The internet has a mighty fury, but also a short attention span.Casey Anthony sure as shit isn’t running from state to state trying to escape her internet stalkers. Bitch is just laying low, getting away with murder – you know, living her best life.So, excuse me if I find it a little bit too far fetched that Gwen Proctor (aka Gina Royal) has been on the run for years and the internet’s fury had been consistently unrelenting in the most vicious possible way.\n“…female accomplices are hated so much more. It’s a toxic stew of misogyny and self-righteous fury, and the simple, delicious fact that it’s okay to destroy the woman, where it’s not okay to destroy others.”\nGwen thinks she’s finally found safe haven, at least for a little while, in a quiet Tennessee town. The kids are making friends, coming out of their shells, finally feeling relaxed enough to attempt some connections. Gwen herself has even made a friend, someone she might be able to confide in. But, of course, just when things are feeling alright for the first time in a long time, a body turns up in the lake right outside her house – a woman killed using the same signature of Dear Melvin. And suddenly the life Gwen had just only just dared to cultivate, begins to unravel at breakneck pace and she scrambles to keep her kids safe and her secrets buried.In letting go the ridiculous parts, this was a thumbs up book for me.Gwen’s dedication to the safety of her children – so much so that it often made her do crazy things – was turned up to the perfect temperature. Her struggle with fight or flight was too real. You want to protect your kids, but is it really protecting them if they never have the semblance of a normal life? Can you run forever? What happens if you stay and fight, but lose? Who can you trust when everyone hates you?I will say that if I had to hear MY CHILDREENNN!!!!! from Gwen one more time I might have barfed.The atmosphere, the setting and tension of Stillhouse Lake was A+. Though I did find it a little slow for the first 40% – which I chalk up to an over-explanation of how Gwen was running away and what her “routines” were. But once you get passed that point, there is no return. There is never a moment of calm again. As Smashmouth says, the shit starts coming, and it don’t stop coming.Okay, that might not be the exact lyric but how can you pass up a chance to include Smashmouth in a book review?Gwen’s character development went exactly the way you wanted it to. You know by the end that she’s definitely not a victim any longer.\n“…everyone runs from the monster. Everyone except the monster slayer…”\nBonus: it ends in my favourite way possible…a cliffhanger!!!!!It’s suspense right up to the very last sentence.Loved.book source: Thomas Mercer via Netgalley in exchange for a review"}, {"Review": "Psychological thriller.Started with accident, drunk driver destroyed the garage of serial killer Melvin Royal. Did gruesome killings there. Fooled his wife and kids for years, now they are on the run from people that didn't believe the fact they didn't know what he was doing in that garage. Changing names, schools. Wife Gina always prepared to move if they are discovered. This unstable emotional state taking a toll on all of them. Parts gets little boring, but keep reading. Has a very surprising ending, have to read the second book to find out how they are going to face the new challenge.3.5 stars."}, {"Review": "Two warnings before you begin this taut thriller: It ends on a cliffhanger (book two is available and there is a third book not yet out), and there is a degree of graphic detail about women who are tortured before they are killed.Gina Royal thinks she’s living a wonderful, suburban life with a loving husband and two great kids. Then she comes home one day to a street clogged with police cars and ambulances. A car accident has revealed that her husband’s hobby in the garage—one she never inquired about—was gruesome—he’s a serial killer.The public thinks she was his helper. So while he’s sentenced to actual prison, Gina is on the run from public opinion which is not always confined to horrific online messages. Gina transforms herself into Gwen and for the next four years she and her kids are in hiding with new identities, never knowing who they can trust. When more bodies start showing up, the police think this is proof that Gina/Gwen was in fact in on her husband’s grotesque and unimaginably cruel activities. For her safety and the safety of her children, Gwen needs to figure out who she can trust—and who has betrayed her in the remote area where she’s been hiding out, Stillhouse Lake. I enjoyed this fast-paced novel and am looking forward to the next two books in the series. For more of my reviews, please visit: http://www.theresaalan.net/blog"}, {"Review": " 4 Stars for Stillhouse Lake  Gina never asked about the garage. That thought would keep her awake every night for years after. I should have asked. Should have known. But she's never asked, she didn't know, and in the end, that was what destroyed her.  And so the story begins.....I was in the mood for an engrossing thriller and this turned out to be exactly that, making it one of the best thrillers I've read this year! Though she starts off weak Gina/Gwen quickly becomes a likable character. She takes her weaknesses and faces them head-on, becoming not only strong but pretty bad-ass.  I'm not afraid of Mel anymore. I'm going to kill him. One way or the other, it ends the way it began so long ago: with the two of us.The Royals. Yes, the story ends in a cliffhanger but for once it felt necessary. Gwen vs. Mel deserves to be a story all its own."}, {"Review": "Quick, gripping read with a premise unlike anything else I'd ever read. I grew to love the main character as the book went on, even after being initially put off by her. The younger characters were realistically flawed and likeable. While I did manage to guess a bit of what was really going on, it was a wild and enjoyable ride. I'm definitely going to be watching out for the next in the series, which is released in December.Gwen Proctor underwent a metamorphosis. Once she was Gina Royal, loyal and loving wife and mother but endlessly naive. Gina Royal died when her husband was revealed to be a sick and sadistic serial killer. Now she's Gwen... a gun-toting, smart, paranoid, tough woman who would do anything to protect her two children. There's still a lot of people out there who think she knew what her husband was up to... and a lot of families left broken when Melvin Royal took loved ones from them. They want revenge. She lives an anonymous life now, moving her little family around often and keeping their location secret even from her own mother.When the threats begin to slow down and her children begin to acclimate to their new environment for the first time, Gwen starts to think they've found a place they can be safe and comfortable for awhile. As the house she bought cheap begins to feel more like a home, she toys with putting down roots in this quiet area next to beautiful Stillhouse Lake. That hope doesn't last very long. A body is found in the lake of a young woman. There are some striking similarities between her demise and the young women her husband tortured and killed. Does he know where they are? Have the random people online hell-bent on revenge found them?A body found so close brings the police to their door, and Gwen knows it won't be long before they figure out who she really is... but bolting now will most certainly get their attention. Tired of seeing her weary children uprooted, she has a choice... ride out the storm, or run again.I received a copy of this book from Net Galley and Thomas & Mercer, thank you! My review is honest and unbiased."}, {"Review": "I finally finished this book. It's been on my currently reading shelf for a month, and I think I read four other books in the time it took me to read this short thriller, but it's finally done. Okay, thoughts-- if it wasn't for the final forty pages I think I would've given this book 2 stars. I can see why this book is popular, and would not sway anyone away from reading it, but there was just so many small things in this story that just kept distracting me as I read it, so many details that I felt were meant to create a more immersive world but just took me out of my rhythm, and it's not that long of a book to begin with so when I read details I expect them to be important later on but a lot of the time (not all, there were some important ones) they never reappeared. As I said the final 40-50 pages made this book for me. The constant \"who is after me\" thrill kept me going, and though the antagonists didn't strike me as deep or well fleshed out, they served well and mirrored Gina/Gwen's past with her husband, creating an interesting cyclical feel to it all.I might finish this series, I might not, I'm not entirely sure yet. If I do I think I might just audiobook it."}, {"Review": "Five extremely intense stars!!!Cannot even imagine being married to a serial killer.... how could you not question your judgment from that point on? How could you ever trust anybody else again? How could you ever feel safe?The author did an absolutely amazing job of putting you in Gina/Gwen‘s head for the duration of this book.... I felt just as paranoid and on edge as Gina/Gwen did.... this book was extremely hard to put down, I just needed to know what was going to happen to this family next..... Love how relentless Gina/Gwen was in protecting her children (can’t even imagine being put in this situation)... I spent the entire book trusting and distrusting right along with Gina/Gwen, and I was very surprised as to who the bad person ended up being.... and then that ending! Can’t wait for the next book in this series....Definitely one of the more intense books I’ve read this year! Definitely recommend to anybody who is a fan of this genre! narration: was stellar Emily Sutton-Smith did a fabulous job of voicing Gina/Gwen💛"}, {"Review": "3.5 stars. Chilling. Mysterious. Dark. Suspenseful. Eerie. Engrossing.Gwen Proctor hasn’t always been Gwen Proctor. She used to be Gina Royal. Gina Royal was a quiet stay at home mother of two beautiful children who came home one day to find out her husband of nine years was a serial killer. Years later, she is living miles away in a house on the edge of Stillhouse Lake, she and her children having taken on new identities. One day, a body mirroring the victims of Gwen’s ex-husband is found floating in the water in front of Gwen’s house. Could her ex-husband who is locked away in prison be behind this gruesome murder? Much of this novel had me on edge. The intensity of the prologue had me highly intrigued and curious. The characters were real, the atmosphere was vivid, the suspense was engrossing. The story kept me captivated and curious throughout, however, the gripping intensity did come and go. Toward the end, I found some of the story ventured into unrealistic territory, but I still really enjoyed it. Thank you to my lovely GR friend Susanne, whose raving review prompted me to pick this suspenseful book up! This was Book #1 in the Stillhouse Lake series. I am excited to see what Book #2 has in store! This was a Traveling Friends read that we all really enjoyed.Stillhouse Lake is available now!"}, {"Review": "What's in your garage?  Vehicles, auxiliary fridge, access to the furnace?  Seems normal enough, at least that's what is in my garage.  But let's say your garage has been converted into a workshop with access limited to an outside door.  And what if that outside entrance is kept locked?  Just what could your spouse be tinkering around with in there?  Hmmm?Stillhouse Lake in Tennessee.  Sounds tranquil enough, but Gwen Proctor's carefully manufactured life is about to implode. She, along with her two kids, have worked hard to blend in and return to some semblance of normalcy.  This fourth identity change and move seemed to have been successful.    This was a real page turner for me.  Believable dialogue, nicely developed characters, and a plot that kept my interest throughout.  Enough to where I immediately requested the second book from our library.  Can't wait to break it open!"}, {"Review": "Gina Royal returned home one night with her children in the car to find their home surrounded in the many vehicles of first responders and their flashing lights. Fearing the worst Gina announces that this is her home to only be forced from her car and put into handcuffs in front of her kids. Having no clue what is going on Gina is shocked and mortified when she finds out that a car has crashed into her home revealing that her husband's private work area was hiding his victims. Now years later Gina has remade herself into Gwen Proctor, another in a long list of aliases as she and her children have done their best to stay in hiding after the publicity and trial had died down. With public opinion continuing to crucify her on a daily basis Gwen lives in constant fear of being discovered of being the wife of a serial killer no matter how hard she's tried to prove that she was innocent in his acts. Tired of always being on the run Gwen has vowed that this time will be different and she and her children will finally have the home that they have longed for all these years since that fateful night. Stillhouse Lake seemed to be the perfect place for the family to settle down and call home with a private setting and even a safe room within their home. But when a body is found in the nearby lake all those memories of the trial come back to haunt Gwen. Stillhouse Lake by Rachel Caine is the first book in the new mystery/thriller series by the same name. The story focuses on the family that is left behind when it's found that who they thought of as a loving husband and father is found to actually be a killer and is now behind bars. The torment didn't stop after the trial however putting them on constant alert. The one thing this book makes clear in all the twists and turns and excitement of the story is how in today's age the theory of innocent until proven guilty has been forgotten. How many time reading news articles and comments do we see conclusions being made on very few facts?? This made this family's fictional story feel all the more real and it was easy to become completely invested in seeing how things would turn out for them. In the end I found this one to be a highly addictive page turner that has me extremely excited for the next in the series. I'd definitely recommend checking this one out!For more reviews please visit https://carriesbookreviews.wordpress...."}, {"Review": "Imagine coming home one afternoon after a normal, typical day and having your life turned inside out, upside down in a second. Well, that’s what happened to Gwen Proctor, formerly known as Gina Royal, the identity she had to give up so she and her two children, Lanny and Connor (also new names) could survive. A freak accident exposed her now ex-husband Mel Royal as a brutal serial killer and the court of public opinion viewed Gwen as an accomplice. She was tried and acquitted in the real court of justice but that didn’t reverse the public’s verdict. Now she’s forced to live a life of numerous moves to avoid discovery and her latest residence is on Stillhouse Lake in Tennessee, a remote location offering privacy and some level of normalcy...until now. What an incredible ride! The first half of the story lays the foundation for what’s now Gwen’s life, as well as the character development. You could just feel Gwen’s vigilance and commitment to protecting her children and the tension was palpable, especially when there’s evidence of a threat. The few people she’s let in her life all become suspects and there are plenty of clues to assemble to figure it out, some more obvious than others but all pretty subtle and nuanced. The last half of the story left me breathless as it all started coming together at breakneck and perilous speed. I literally could NOT put this book down. Let me warn you. Have the next book ready to load or be pulled from your bookshelf. This is obviously a series with a continuing story arc. It ends in a good place but with a shocker you’ll want to explore. I wasn’t fond of it but, yes, I’m very hooked. This was a Traveling Friends group read and it was so much fun discussing at pivotal points. I loved this book and am anxious to continue the series. 4.5 stars. "}, {"Review": "Exceptional, nonstop suspense from an experienced author (Rachel Caine is a pseudonym). There are so many ways this plot could have been made trite or shallow, and none of them show up. When readers start the story, one disbelieves the protagonist's naivete. Yet for the rest of the book, the protagonist describes her boomerang reactions especially to protect her children, and the horrific online fallout. Along with the reader, she self-examines again and again the question of her guilt exactly over how she could have been so naïve. Very thoughtful and emotionally-engaging.The Tennessee setting is a welcome bonus.Highly recommended."}, {"Review": "In general, I'm picky about endings. A bad ending can ruin the whole book for me. But a good ending can definitely sell me the next book.However, a blatant cliffhanger attempt to sell me the next book is what we have here, and it left me really not wanting to ever read anything by this author again.But this is something I've seen before, and I just realized I'd seen it with this same publisher. Could it be that the editors are forcing the writers into this? Whatever happened to that good old paperback habit of putting the first chapter of the next book at the end? A way to do it that doesn't spoil the first story.At any rate, this book, particularly the first third, actually kept me away from stuff I needed to do because it was just that compelling, and I would have given a much better rating if not for that cliffhanger ending."}, {"Review": "Find all of my reviews at: http://52bookminimum.blogspot.com/ 3.5 StarsGina thought she had the perfect life. Happily (enough) married to Mel, mother of two, she was a real Suzy Homemaker. That is, until a drunk driver crashed into their garage and uncovered her husband’s little secret . . . . \n(Mitchell still can’t figure out why Gina would be upset about discovering she was married to the perfect man.)Anywho, fast forward a year where we meet the new and improved Gina . . . . \nNow known as Gwen, she was cleared of all charges when it came to her husband’s hobby. Thanks to some really obsessed internet trolls (y’all think it sucks to get told how you read wrong, you should try to walk in Gwen’s shoes for a second), Gwen and her children have changed their identities and locations four times and Gwen knows how to blow your head off with whatever gun she pulls out of her arsenal. Things seem to be settling down on the psycho front and Gwen has finally started to plant some roots in a quiet little locale known as Stillhouse Lake, Tennessee. That is until a surprise pops up in the lake that has everyone pointing the finger at “Melvin’s Little Helper” . . . . \nIf you haven’t figured it out yet, Stillhouse Lake is without a doubt 100% a Lifetime Mystery Movie of the week. Save your holier than thou. Sometimes these stories are exactly what I need and after reading two really good mysteries, I needed to embrace my inner . . . . . \n(that’s a basic white girl starter kit, if you aren’t familiar) and read a different kind of thriller. I have been a fan of Rachel Caine since I read about eleven thousand of her Morganville Vampire books back in the dizzy when I was in love with all things teenage vampirey . . . . \nPut one of those in front of me today, I’d probably gobble it right up. When my friend Casey book pushed this on me (and Casey NEVER book pushes on me), I knew I would not be able to resist. I even spent my own dollars on it when the pornbrarian failed to order it for me in a timely fashion proving that miracles do happen – but you should’ve seen all the moths that flew out of my wallet! Wowzers!If you’re okay with suspending disbelief and simply want a decent read that will keep your interest and you will speed through, Stillhouse Lake might be a winner. Really my only complaints are that I immediately knew who did it – like literally at the first word out of his mouth . . . . [I TOTALLY NOTED THIS, BUT GR ISN'T SHOWING ME MY EFFING NOTES SO I CAN'T TAKE A SCREEN GRAB!]And how often Gina/Gwen jumped on the “everything is worse for me because I’m a woman” bandwagon. Uhhhhh, no dipshit – everything is worse for you because you are a fucking idiot who thought it wasn’t weird to not be allowed in part of your own goddamn house . . . . \nOther than that, though, this was pretty fun.Book #2 in the Winter Reading Challenge. I’m getting closer to you, pretty red coffee mug : )\n"}, {"Review": "\n\n\"Everyone runs from the monster. Everyone except the monster slayer...\"\n\n Yes!!! Our heroine is facing the unexpected consequences of her ex-husband's actions and they aren't pretty. In fact, they put her and her children at significant risk which means she is always in a proactive defense mode. Like she can't even breathe. She always has to stay one step ahead of any possible threat and her exhaustion is palpable. But her passion for her responsibility as a parent is even more tangible. I absolutely loved this book. Stillhouse Lake was a super fast-paced thriller with a strong villain that is oh so easy to hate, characters who aren't who they say they are, a bad-ass mother justified in her paranoia, a deadly mystery that puts this family in a spotlight they do not need... all of this culminating into a psychological/suspense/thriller/mystery that will knock your socks off. Beware, this story continues in the form of a series so while I feel there is enough closure for the main mystery of this particular book, there is a cliffhanger that perfectly sets up the next. In my opinion, Stillhouse Lake is excellent and I cannot wait to continue the story. Highly recommend.My favorite quote:\"...a gun can’t protect you unless you protect yourself mentally, emotionally, and logically. It’s the punctuation at the end, not the paragraph.\"Note: Rachel Caine's Stillhouse Lake series includes the following installments as of December 2017. Please note this series is an ongoing story and should be read in order. #1-Stillhouse Lake (July 2017)#2-Killman Creek (December 2017)#3-Wolfhunter River (expected October 2018)12/11/2017:RTC"}], "Genre": "Crime", "ID": "33128934", "Desc": ""}