{"Genre": "Crime", "Reviews": [{"Review": "It’s Live! GRABBY HANDS!Amazon US: https://amzn.to/2LVqPD7Amazon UK: https://amzn.to/2GXHx63Amazon CA: https://amzn.to/2C3qTwaAmazon AU: https://amzn.to/2AynVzI⭐⭐6 STARS⭐⭐ ”Ours is not a love story.”  It was bound to happen, but I had no idea it would happen in such spectacular fashion. Alas, all good things come to an end....With that said, several of my #1 loves have been dethroned! My new #1, Wolfe Keaton, is EVERY SINGLE LITTLE THING that ever was! The Kiss Thief is unlike any other book I’v"}, {"Review": "  A story of Nemesis and a villain with no chance at a happy ending.Where the Prince doesn't save the princessHe tortures her.And the beauty doesn't sleep.She's stuck.In a nightmare. Hold on to your hearts ladies cause the Big Daddy of All Predators -Wolfe Keaton has gatecrashed the Booklandia. This masked marauder is here to whisk Princess Rossi away on his Black Stallion. You will lose your hearts too, to this Brutish Buccaneer and if you're extremely lucky- your panties too in the process.  "}, {"Review": "English/spanish version“Falling in love was so tragic. No wonder it made people so sad”A standing ovation for ONE OF THE BEST BOOKS THAT I'VE EVER READ, and L.J Shen's best story to date. It left me with the worst book hangover of the year! ITS INTRICATE PLOT IS A NEW BRAND OF PERFECTION SO MIND-BLOWING THAT IT WILL LEAVE YOU BREATHLESS. Have you ever felt that words are not enough to describe what you feel? that's me now after reading this story, I'm an emotional mess and nervous wreck. The Kis"}, {"Review": "  Our hearts were tarnished. Stained. And guilty. Unpredictable to a fault. And bound to break.  I got two words for you here: Must. Read.I know I say this each time I finish a book of hers, but this was my favorite LJ Shen book to date.  I was born into a glided cage.  If you like a modern day arranged marriage trope, welcome to your next addiction. This book? GAH! It had an anti-hero that only Shen can write; brutal and hard but completely redeemable. This is someone you won't be able to help"}, {"Review": "Oh wow, wow, wow. I’m in awe right now. If you’re a lover of L.J. Shen’s Hotholes then The Kiss Thief is going to be exactly what you want because ladies (and gents), we have a new alphahole in town. Mr Wolfe Keaton, the man that makes men quiver in their boots and women drop to their knees. He’s sexy as sin with an attitude to go with it. He’s ruthless and harsh and keeps his true feelings locked away. The Kiss Thief isn’t your typical romance. It’s a story about a nemesis and a villain. One th"}, {"Review": "***AVAILABLE NOW - FULL REVIEW***MY FIRST FAVORITE AND MUST READ OF 20195+ Nemesis CROWNSLJ Shen has rocked me world, tilted it on its axis, and I don’t which way is up or down after the whirlwind she just took me on. The Kiss Thief is EVERYTHING I love in a romance, and I never wanted this book to end. EVER! Wolfe Keaton has taken top book boyfriend spot. With his confidence and intelligence and lethal charisma, I was utterly charmed by this man. His cold exterior makes him seem untouchable and"}, {"Review": "Gah!! You guys!! The Kiss Thief was everything we've come to expect from L.J. Shen and more!! BEYOND PHENOMENAL!! It was emotional, poignant and gut wrenching and filled with a brilliant story that had me glued to every page. It was so perfectly written with every intricate detail written with the utmost care. This is without a doubt THE BEST novel this author has written!!Without giving away any spoilers, Shen did it once again with Wolfe Keaton. He undoubtedly is the new alpha-hole to top and"}, {"Review": "    MY REVIEW:  can also be found on my blog:   ➽ KITTY KATS CRAZY ABOUT BOOKS ' 5 THE BIG BAD WOLFE STARS '  A story of a Nemesis and a Villain with no chance at a happy ending. Where the prince doesn't save the princess. He tortures her. And the beauty doesn't sleep. She's stuck. In a nightmare.   THE KISS THIEF:  Is a full length contemporary Romance novel. Spoken in Dual Perspectives. It all started with a wooden chest carved and made by a witch encasing three notes which would predict her f"}, {"Review": "5 stars!  They say that all great love stories have a happy ending. I, Francesca Rossi, found myself erasing and rewriting mine until the very last chapter. One kiss. Two men. Three lives. Entwined together. And somewhere between these two men, I had to find my forever. LJ Shen crafts a deliciously angsty and riveting tale of a Villain and his Nemesis. This was one of those books that had me glued to every page, unable to put it down for a minute. It was a story that captivated me from the start"}, {"Review": "Arranged marriage? Older man? Virgin bride? Decadently dirty romance? Obviously Leigh wrote this book just for me."}, {"Review": "5 STARS! REVIEW TO BE POSTED ASAP!!Stand-alone.LIVE! | AMZ US | AMZ UK | ARC provided to me by author L.J. Shen in exchange for an honest review. "}, {"Review": "Perfection My first LJ book was Sparrow (Loved), followed by Defy (Lovely), then it all went downhill as I couldn’t for the life of me get on board with subsequent books (particularly Vicious); yet, she stayed on my authors-to-read radar. So, to have this book be this amazing, to have an anti-hero so deliciously bad, to have a heroine who made me cheer, was everything I never knew I needed. I love this book from the depths of my cold heart. Bravo!"}, {"Review": "It's no secret that The Kiss Thief was one of my most anticipated releases of 2019. L. J. Shen is one of my favorite authors of all time, and I look forward to every single book she publishes. This time was a little different though. The mystery surrounding this book and the collective excitement of all of the other L. J. fans I knew took it to a whole new level! All the time wondering what the story would be about, what the name of it was, and basically, everything else about this book had alre"}, {"Review": "  A story of a Nemesis and a Villain with no chance at a happy ending. Where the prince doesn't save the princess. He tortures her. And the beauty doesn't sleep. She's stuck. In a nightmare.  What a fantastic beginning to reading in 2019! I knew I’d fall in love with this, because it is L.J. Shen. One of, if not, my favourite author. Ever. She’s a proficient and excellent writer—her sentences are carefully and beautifully constructed into gripping scenes and concise prose—who continues to astoun"}, {"Review": "I was lucky enough to read an ARC of the The Kiss Thief and let me tell you the chemistry between Keaton and Francesca is through the freaking roof. Once again, Ms Shen has created a damaged alpha, a-hole hero that I couldn't help but fall head over heels in love with.Ms Shen has the amazing ability to take me through an entire emotional gamut. I wanted to throttle the hero and yet . . . I also wanted to ride him like a rodeo bull. My heart broke for Francesca and the impossible situation she fo"}, {"Review": "Live Amazon https://www.amazon.com/Kiss-Thief-LJ-... 5 BEAUTIFUL STARS This is the best book I have read from L.J. Shen!!!Lately I'm saying it each time I finish a book from her but it's so true!She doesn't stop surprising me, her stories are so unique! The Kiss Thief is addictive,full of tension and angst.It is so hot and captivating! \"My sweet poison, my gorgeous rival.\"I was hooked from the prologue and I couldn't put it down!Each chapter hooked me even more.The characters were fantastic and"}, {"Review": "First thing I was able to think about when this book hit my kindle, was to start the journey with these two characters. When I found out this book the book was coming I was so exited that sleeping was hard for me. The exitement for this book got to an unhealthy level.I’m so glad to say that this book was clearly worth my whole exitement.L.J. showed me a way of writing a love triangle in a way that didn't annoy me . Because most of the stories I’ve read until now which mostly had fantasy stories,"}, {"Review": "Huge 5 stars for The Kiss Thief. This story was better than I expected and unique in many ways. Wolfe and Francesca are so hot together! Wolfe is alpha, dark, brooding and cold but the author shows us he is vulnerable and honorable. Francesca is sweet, innocent, smart and kind. Her beauty glows bright from within and out! She is really a lady but she is strong and a fighter as well! And she is caught in the middle of a fight between two men. If you really love someone, do you fight for them or l"}, {"Review": "THIS. BOOK. Y'ALL. This book will ruin you for all other books in 2019. I would give it 10 stars, if I could. I would ask ot to marry me, if that were legal. I would stand up and slow clap, but I already did that at 4:00 a.m. when I read the final word. So go ahead and request January 9th off of work because trust me, when this thing hits your Kindle, you're not going ANYWHERE."}, {"Review": "Woweeeee! I read this in ONE day and oh my word! I knew it was going to be good but it blew me away! It's a fresh, dynamic, intoxicating read. I loved the way LJ built these characters, how she created their world, and all the angsty feels she brought with each page. It was so so so good. Full review coming around release day."}, {"Review": "Surprise! Surprise! There's no surprises in this book. We have the same characters and plot, again. To be fair the book was engaging and well written. The MCs had great chemistry. Those things might be enough for you to enjoy and I didn't finish the book, so I might not be a fair judge.The amount of sexism, double standards and cliché was disturbing and unbearable for me. His thoughts about sex and women were vomit inducing. And her insecurity because she is inexperienced virgin were cringe wort"}, {"Review": "The Kiss Thief is now live! 😍OMG I loved it so much!!! 😍😍😍Full review to come later. 🙂 *ARC kindly provided by author in exchange for an honest review. ❤❤❤ AVAILABLE NOW!FREE IN KU!AMAZON US:https://amzn.to/2HbNYThAMAZON UK: https://amzn.to/2QtDcqsAMAZON CA: https://amzn.to/2VzmWrRAMAZON AU: https://amzn.to/2FhaQhdAUDIO: https://amzn.to/2Vwq73z"}, {"Review": "If you know me you know how much I love L.J. Shen. She’s one of my favorite author’s of all time so when I read and saw the cover of The Kiss Thief I couldn’t contain my excitement. I am so sad to say that even though I enjoyed it, it fell kinda short for me. Wolfe and Francesca’s sexual chemistry is off the charts from the moment they meet. I enjoyed their banter but I don’t know there was something missing. SPOILERS AHEAD(view spoiler)[It bothers me that they always refer to her as a teenager."}, {"Review": "yeetus deletus yeah i dunno, i usually sum up my thoughts in bold but i can't think of a good tag line for this book. first thoughts though: much better than dirty headlines (which is a book i wish i could forget forever).i think i'm starting to realize a pattern with lj's books and tbh once i start seeing patterns it's all downhill from there. 98% of lj's heroes are dickheads. i mean BEYOND dickheads. and you always fall for them which is fine and dandy. except that it's really hard to believe"}, {"Review": "naive at times but it was surely a page turner for me. "}, {"Review": "This looks... so fucking good. Blog | Instagram | Twitter | Tumblr | Youtube | Twitch"}, {"Review": "3.5 StarsOverall Opinion: I enjoyed this. I just didn't enjoy it as much as I had hoped. I'm in the minority yet again here. I do really enjoy this author's ability to write a nasty H. And I enjoyed this H for the most part, but I think I just needed some more of the good to balance him out. I didn't like the fact that their dates were skimmed over. I think that would've helped a ton in redeeming him and his impulsively jerkish behavior! Yes, he groveled -- but because some of it felt skimmed ov"}, {"Review": "This book hit my kindle and I literally dropped the other book I was reading just to start this one! Nothing was going to stop me from devouring this book! Well except for the annoying part where I had to adult! But between that,I devoured this book completely! What a fantastic way to start the new year! I am not usually one for love triangles or arranged marriages for that matter, but this book is written in a way where it does not feel like either of these things! Ms Shen has shown us a passio"}, {"Review": "It's no secret that Shen and I are tighter than how my jeans fit after this Christmas holiday... but make no mistake... my love for her has absolutely nothing to do with this book. It is captivating, unique, beautiful, and it drove me f***ing crazy. I have a thing where I get bored easily. If the relationship is smooth sailing, I dose off. Oh boy, that is NOT the case here.... TKT is everything that I love about reading in ONE epic page turner. Sparrow was my favourite Shen book. Then Vicious ha"}, {"Review": "I must confess that I haven't read a lot of \"love triangles\" and there is a reason for that. They make me extremely nervous. I like angst in my books but the angst that comes with \"love triangles\" can actually drive a person to drink. Which is why I am normally not a fan of this trope. You know who I am a fan of though... L.J. Shen !! So, me reading this book was a pretty much a done deal ;) Writing a review is a bit of a challenge though because I really don't want to spoiler this story. I thin"}], "ID": "41450662", "Name": "The Kiss Thief"}