{"Genre": "Crime", "Reviews": [{"Review": "  PopSugar 2019: 14. Un libro publicado en 2019  Esta es una de mis series favoritas de mafia por el simple hecho de que tiene a uno de los personajes masculinos que más amo en el mundo literario obvio hablo de ti precioso Lucca. Nunca me voy a cansar de leer más sobre él.Nunca es suficiente para míPorque siempre quiero más de tiMi corazón estalla por tu amor…🎵🎶Sorry pero tenía que fangirlear primero.Tengo dos moods para evaluar este libro:Si me pongo buena onda obvio el libro me entretuvo y hub"}, {"Review": "Thank god my office wasnt open today, cause I read this in one sitting. Wasnt as great as Lucca, and the romance took a back seat to \"the family\" drama quite a few times, BUT it kept me very entertained and I loved both MCs ANNDDDDD the book was safe. I'm very much looking forward to Maria and Dominics book, and I'm happy to see Amo is just as miserable as ever. Still loving this series and the world Sarah Brianne has built. Safety:Probably safe for most of the safety gangers out there...Hero (2"}, {"Review": "Para mí lo más interesante de esta serie, es que sus protagonistas son adolescentes.Libros de mafiosos tenemos muchos, pero ver a jóvenes metidos en este mundo criminal para mi siempre ha sido muy atrayente, por lo que ver que el protagonista de este nuevo libro es Drago, la verdad no me emociona mucho, igual le dar una oportunidad y a ver que tal. "}, {"Review": " ***3,5 \"Little Witch!!!\" stars***  \"If you thought this was going to be a love story, where they fall in love the second their eyes met... you were wrong. This isn't it.\" Hmmm.... Honestly, i don't know from where to start...My thoughts are all over the place...So, i will start with saying that i enjoyed and this book a lot, not like crazy as the first books in the series, but it was interesting...The only sure thing is that Sarah is having to write more stories about these people.... And they"}, {"Review": "Yeah, Shanny and I are giving one more chance to this author...simply because of Nero (Made men #1) even though, every single book that came after in the series was a disappointment for us both...I just hope this will be a turn around...*sigh*After all kinds of books I have read in my life, all kinds of genres, sub-genres, I have developed a palate for a certain kind of rush i seek in a storyline....It consists of several segments: solid characterisation that appeals to me on a layered level, gr"}, {"Review": "Well this was a disappointment. There really isn’t much interaction between Drago and Kat. When and how they fell in love is beyond me. There are maybe 3-4 scenes of them together. Too many side characters were present. Further, I was disappointed with the lack of sex scenes, I like a nice balance of sex and story in my romance books - this sadly did not have that there was no sex scene until the end! I like Sarah’s writing and the cover model is a hottie other then that not much to the book."}, {"Review": "hmmmm... that was disappointing. I... I can't believe that was it. I can't believe that that was Drogo's story. I think I'll stick to Nero's story and re-read it anytime I want because this book? huge pass!"}, {"Review": "Honestly, I don't know how to feel. There was some things I liked, but in whole, I feel like it's missing something. Drago and Kat relationship... I don't think there was enough time to build it. It felt like there was hate/enemies/revenge and then forgiveness/moving on/love. Beginning and end but no middle, if you're getting my meaning. And I'm confused and dissapointed. Kat susposed to be 'mafia girl' but most of the time she came as new to this world with her reactions. I'm not sure how to ex"}, {"Review": "😔"}, {"Review": "Got the Goodreads email stating this was published and got all excited and searched amazon for it just to come up empty and confused. Did some more digging and found an update from Sarah that she had to postpone Drago since her editor who has been with her since the beginning is no longer able to edit. She does not have a definitive date yet. "}, {"Review": "Honestly, I don't know how to feel. There was some things I liked, but in whole, I feel like it's missing something. Drago and Kat relationship... I don't think there was enough time to build it. It felt like there was hate/enemies/revenge and then forgiveness/moving on/love. Beginning and end but no middle, if you're getting my meaning. And I'm confused and dissapointed. Kat susposed to be 'mafia girl' but most of the time she came as new to this world with her reactions. I'm not sure how to ex"}, {"Review": "Έχω την αίσθηση πως το βιβλίο έχει λάθος όνομα. Ενώ συμπάθησα πολύ τους πρωταγωνιστές του βιβλίου, νιώθω πως η ιστορία τους πέρασε σε δεύτερο πλάνο κι αυτό το θεωρώ άδικο. Θα ήθελα να δω περισσότερο το ζευγάρι και λιγότερο την υπόλοιπη οικογένεια και την ανάμειξη των ηρώων από τα προηγούμενα βιβλία. Το διασκέδασα το ομολογώ και μου άρεσε ο κόσμος που έχει πλάσει η συγγραφέας, αλλά τελειώνοντας το αυτό που μου άφησε ήταν κάτι μισό και ανολοκλήρωτο. Ήθελα πιο πολύ Ντραγκο τον οποίο όμως είδα στη σ"}, {"Review": "YAAAS I FLOVE THE COVER AND SO EFFING EXCITED FOR THIS!!! 😍😍😍😍"}, {"Review": "Spoilers!!!!First charapter made me almost Dnf. I still dont understand it. He was shot 5 times and was in a coma for some time, then woke up all weak from that coma. He was so broken because he got shot and was in a coma? Was he broken because he lost his muscles and size? He was not beaten, tortured like that first chapter might sound.. and 99% people dont dream in a coma. Why was he so broken and hell bent on revenge? Is it only me who finds it super weird, that those bad mobster people, who"}, {"Review": "WHAT HAPPENED?OH no! I've been waiting for MONTHS for this one and it was honestly the biggest disappointment of all times! WHHYY?First, the story is only 50% about Drago and Kat. That's it. Where is the healing process of Drago? Where is Kat beeing the soothing balm to his internal wounds? What happened to Kat having to bring Drago back to the emotional available status he should be in?It was clipped and short and not at all satisfying. I kept trying to stay enthusiastic about what's to come bu"}, {"Review": "“If you thought this was going to be a love story where they fall in love the second their eyes met… you were wrong. This isn’t it.”This sentence let us think that this is gonna be some dark shit. But trust me all the scare is limited to this sentence only. Because after this there’s nothing dark or bad in their romance. In fact they slowly fall in love. And TBH it’s a sweet love. But there is a huge star cast. So it’s not only about them, it’s also about the other character who keeps popping up"}, {"Review": "Who book was it??I felt like this wasn't really about Drago or Kat??? I still know nothing about Drago character. I know nothing at all. However one shot is all up and through here, this book wasn't rushed but by all means I feel like it's missing a lot. Kat and Drago love didn't build it was so instinct I missed it. Well I'm assuming kat brothers get books soon with Marie and DOM soon. Hope it's better more fire. I don't see me reading this like I will continue to re-read Lucca. It was better t"}, {"Review": "3.5 starsSnarky h and taciturn H; he chooses her for revenge but treats her well and they bond from there ...I liked both H and h; she was very smart and I liked that she was so loyal to her brothers ... the relationship with her older brother is so sweet and poignant; H plans for revenge but cannot bring himself to be cruel; he was also sorry that he was older than her and may have spoiled her life ... Most of all, I liked the glimpses I got of Maria, Leo, Matthias and Dominic; would really lik"}, {"Review": "Αν ήθελα να διαβάσω τον Λούκα θα είχα διαβάσει τον Λούκα.Αλλά αυτό το έκανα ήδη..Εδώ ήθελα να διαβάσω τον Drago.Ηταν το δικό του βιβλίο άλλωστε,η δική του ιστορία.Υπήρχαν πολλοί χαρακτήρες που.μονοπώλησαν το ενδιαφέρον.Εκτός από τον βασικό ο οποίος παρέμενε στα παρασκήνια μέχρι να θυμηθεί κάποιος να τον φωνάξει.Ο πρωταγωνιστής ήταν απλά καλεσμένος στο ίδιο του το έργο."}, {"Review": "Sadly, like Angel this was a disappointment. I had high hopes for Drago because it had my favorite trope ever - arranged marriage. But the book ended up being 90% Kat bonding with the Carusos and reminiscing about her brothers + 10% of actual interaction with Drago. When they fell it love, it felt so sudden - they had maybe 2-3 scenes where they got to bond alone."}, {"Review": "Just okIt was just ok. I was waiting for something to happen and it never did. Kind of like a build up for her next book."}, {"Review": "This book had a lot of potential, but it fell flat. No character development, no setting development and little time or words to get into the book. This book felt rushed and its just like Chole's: a great disappointment."}, {"Review": "Ehh. about the only thing I liked about this book was the cover. It definitely needed more editing.It has so much potential to be one of the great ones and it missed the mark big time. It wasn't so much Drago's book as it was a just kind of a collection of smaller storylines. I have read this entire series and there have been some hits and misses (I'm looking at you Vincent), I was even \"ok\" with the whole Chloe book ordeal but at least that book gave insight to Chloe and why she is the way she"}, {"Review": "3.5 ’Wedding’ StarsWell, I can’t say I was highly excited about this book. You all know by now who’s book I’m dying to finally read (Yep, Maria’s...) But I guess it wasn’t her time. And I still have mixed feelings about this story.I think I like it, but this feeling isn’t close enough to loving something. But still, Brianne’s writing is one of the most powerful things I’ve ever experienced.What I really missed was the depth of the characters. They were not complex and their relationship was also"}, {"Review": "Felt rushed Hmmm, Drago wasn't good, but it wasn't bad. It felt like there was so much missing in the book, for me. Maybe it's just me, but I couldn't get behind them being in love at the end. On another note: I'm shipping the possibility of Dominic and Maria as a couple :) "}, {"Review": "I feel cheated, like someone was cut story short!!!!!"}, {"Review": "I’ve said it before and I’ll say it again. NOT ALL CHARACTERS DESERVE A BOOK! After Angel I felt that Sarah started swaying away from people who really mattered. Amo, Maria, Leo, Dante... Characters that we already invested so much time and interest in are just waiting in the wings, merely remaining secondary characters when all of them have so much potential for a good book. When Sarah announced that the next book was going to be Drago I literally groaned out loud. Although I did enjoy his char"}, {"Review": "Spoilers!!!!First charapter made me almost Dnf. I still dont understand it. He was shot 5 times and was in a coma for some time, then woke up all weak from that coma. He was so broken because he got shot and was in a coma? Was he broken because he lost his muscles and size? He was not beaten, tortured like that first chapter might sound.. and 99% people dont dream in a coma. Why was he so broken and hell bent on revenge? Is it only me who finds it super weird, that those bad mobster people, who"}, {"Review": "I wanted to love this. Truly I did; however, this book had the same flaws as the previous installment, Angel: NO ACTION. I felt no tension in the story, there was no big bad, the relationship had almost zero strain, and the \"book\" was more of a lengthy novella. There wasn't enough time to learn who the characters were or feel a growing bond between them, the big bad made a single appearance, and the entire mystery backstory of the heroine was ignored. Brianne could have really delved into who wh"}, {"Review": "Okay I love this series. That being said....I didn't love Drago and I didn't hate it. It felt lacking in some one.. Like it was a filler book. So it just didn't feel complete but Kat and Drago are super cute. I had wish we go more of them..it just felt like a sudden ending. I honestly went back to make sure i didn’t skip chapters. I felt cheated of that relationship development. I loved all of the Lucca we got and can I loved Dominic and Maria is crazy and I loved her"}], "ID": "40622772", "Name": "Drago"}