{"Name": "Long Road to Mercy", "Image": "https://images.gr-assets.com/books/1534902771l/39088984.jpg", "Reviews": [{"Review": "The prolific thriller writer David Baldacci begins a new series featuring female FBI Special Agent Atlee Pine, with quite a backstory. At the age of 5 years old, Atlee was left seriously assaulted after her twin sister, Mercy, was abducted from their bedroom. Plagued by survivor's guilt, and feeling the wrong sister was taken, Mercy was the good girl, not Atlee, Atlee's memories of what happened that long ago night have only recently returned. She is convinced that convicted serial killer, 57 year old Daniel James Tor, was responsible for taking Mercy, and although Tor's patterns of behaviour make this a possibility, there is no proof. With tattoos on her body that serve as constant reminders of Mercy, Atlee visits Tor in ADX Florence high security prison in Colorado, aware that it is highly likely he is going to play mind games with her, but she doesn't care, she has to find out what happened to her sister. With Tor being less than helpful, this is going to be an overriding storyline in this series. Atlee is a loner, she is close to nobody, and she is not ambitious, she has no interest in living and working in a city and has sought to be placed in remote locations as the sole FBI representative in the area. She is a physically strong woman who just missed out in being on the US Olympic weightlifting team. She has been at the Grand Canyon placement for a while and has spent some time getting to know the communities and people in this stunning location. A mule has been mutilated and savagely killed, and his rider, Benjamin Priest is missing, a disturbing set of facts that has Atlee investigating with the help of the Park Rangers. She can have no idea as to how deeply this will blow her world apart as she is warned off looking further into the case by her superiors in the FBI or face suspension. Atlee is not a woman to give up, no matter what the cost to her career and job. Aided by her able assistant, Carol Blum, Atlee finds herself in a world gone crazy as she is faced with desperate danger, horrifying murders, Russians, Chinese, Koreans and where she can trust no-one, not even the FBI.Baldacci's plotlines here might sound a trifle far-fetched here, until you look at the gloomy and dangerous state of US politics and the global machinations at play in the world today, at which point it all seems scarily possible. The central protagonist here, Atlee Pine, is a heavyweight as a character, you get a real sense of her as a rounded character, vulnerable but spectacularly good at her job, unafraid of doing what has to be done even when her life and those of others is on the line. Baldacci gives us a gripping thriller and the beginnings of a great series here. The book is fast paced, highly entertaining and full of suspense and tension. Highly recommended! Many thanks to Panmacmillan for an ARC."}, {"Review": "There is something to be said for an author who can juggle writing multiple book series at the same time, and even more for those who are able to see these collections continually hit the top of the charts. David Baldacci has been able to do this—without collaborators, I might add—and keeps the stories crisp, while never losing his reading base. I approached Baldacci’s latest work with some trepidation, as I am comfortable with the two strong series he actively writes and worry about diluting the quality of his published works. Atlee Pine is an agent with the FBI, but her unique backstory and location add new depth to her character. Pine grew up in Georgia, but moved out West to enjoy the open spaces, as well as some distance from others. When she is called to the Grand Canyon to help with an investigation, she jumps at the opportunity, though is highly confused when she arrives. Ben Priest was part of a group travelling through the Canyon by mule, but he has gone missing. The mule’s been found, gutted and with an odd message carved into its flank. As Pine begins investigating, she contacts Priest’s brother, who has much too say about Ben. Just as Pine locates the missing Priest, she is assaulted and both Priest brothers are abducted by someone on a military chopper. Now, the mystery thickens and Pine is called off the case by those back at FBI HQ. Refusing to stand down, Pine enlists the help of her assistant, Carol Blum, and they begin their own investigation into events, which takes them across the country. Dodging FBI officials and some of the scummier folks seeking to stop their progress, Pine and Blum uncover that there may be a plot that puts America in great danger. Neutered by orders from on high, there is no one to whom Pine and Blum can turn, until they get solid evidence. Time is running short and international entities appear to be gathering momentum, forcing Pine to make a sacrifice for her country. Baldacci has crafted a winner here, in a series that begs to continue in some way. Fans of Baldacci’s work will likely enjoy the piece and it comes highly recommended to those who are drawn to stories of action.I have long been a fan of David Baldacci and his work. Be it thrillers, holiday heartwarming stories, or something with political implications, Baldacci usually knows how to convey his point through well-developed novels. This story is no exception, as it mixes the thrill of the hunt with a female protagonist ready to solve the world’s problems. Atlee Pine is not only a strong FBI agent, but also harbours a deep backstory that is sure to be handled over a few novels. Having lost her twin sister at the age of six to a kidnapper, Atlee has been trying to remember the night Mercy was abducted. This underlying thread keeps the story moving along, as Atlee seeks to avenge the powerlessness she suffered as a child by capturing the worst criminals who cross her path. She lives an isolated life and wants few to see her inner scars, though seems destined to share when the time seems right. Baldacci has scattered enough crumbs to keep the reader wondering and one can hope that the series will continue to give more depth to the character and her inner turmoil. Those around Atlee Pine help support her and strengthen the story in their own way, as the reader pushes through this series debut. Some will surely return in the novels to come, while others are vessels for this plot line. Either way, they come to life and offer the reader something entertaining. The story itself is not entirely unique, but it is the way that Baldacci tells it that keeps things fresh and energetic. Geo-politics has become the latest craze in the genre, which is on offer here, but there is an interesting way the characters work to hash out the specifics that kept me wanting to know more. Perhaps this is the way of the future, leaving traditional terrorism as a theme of the past, allowing new and exciting threads to be developed by top-rated authors, such as Baldacci. I’ll keep reading, as the stories remain of high caliber. I can only hope there are more novels in the works!Kudos, Mr. Baldacci, for another thrilling ride. I look forward to what 2019 brings and how you’ll dazzle your fans next!Love/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"Review": "4 intriguing stars to Long Road to Mercy! ⭐️ ⭐️ ⭐️ ⭐️ It’s a shiny new series from David Baldacci with a fierce female main character! Meet Atlee Pine. She’s a tall, muscular, no nonsense FBI special agent, and she’s assigned to the most remote areas of the west. What inspired her to join the FBI? Her twin sister was abducted by a serial killer, but not before assaulting Atlee, and her life mission has become putting offenders behind bars. Atlee is a top profiler with the agency, and she keeps to herself working on lone missions in her vast assigned territory.Her current mission: investigating a missing person from the Grand Canyon. This is not the only person missing from the area, so one could could lead to another for Atlee as she profiles the crime. Startlingly, she is told not to investigate further by her superiors, but she does not not heed their orders. Atlee as a character is well-drawn. I have a sense of her as if she is a real person. I admired her morals and assertiveness. There’s also something soft and vulnerable about her balanced with a hard, strong exterior. She’s going to do what’s right regardless of what anyone else thinks. I found Long Road to Mercy to be gripping and intense. It stars strong and never lets go of the pull. The pacing is on point, and I was entertained from start to finish. I’m really excited for the next installment because I have to see what Atlee is up to. I think she has quite a story to share with us. Thank you to Grand Central Publishing for the complimentary copy. All opinions are my own. If you are interested, I’m giving away finished copies on my blog and instagram page. Www.jennifertarheelreader.com"}, {"Review": "*https://theburgeoningbookshelf.blogsp...Long Road to Mercy is the first in a new series by accomplished author David Baldacci. This book is the introduction of FBI Special Agent Atlee Pine. Atlee’s character is well developed in this first instalment and we learn what makes her tick, her motivations and her past.Atlee is strong mentally as well as physically although she does have her weak spots, one being her twin sister, Mercy, who was kidnapped and presumed murdered when they were 6 years old. This early loss caused a major upheaval in her life and so began a cycle of relationship non-commitment.I liked that Atlee was tall and solidly built. Almost making Olympic status in weight lifting her character comes across as real and believable when she has to kick major butt. She can match it with the best of them.Atlee is called in to investigate the murder of a mule in the Grand Canyon and the disappearance of its rider. As she starts to ask questions she notices that people high up the chain are taking an interest in this case. After delving a little too far Atlee is taken off the case. Atlee and her secretary, Carol Blum (who by the way I loved, a no nonsense woman in her sixties, she is intelligent and feisty) decide to go rogue.What starts as an animal murder and a missing person case soon escalates to a plot of political espionage involving North Korea, Russia and the US Government. Given the present political climate in America the plot is both relevant and intriguing.You may have to suspend belief at times but overall the plot was compelling and the characters well fleshed out and believable. The backdrop of the beautiful and mystifying Grand Canyon was an added bonus for this armchair traveller.There is a tiny, sweet romance budding at the end of the story and I hope Baldacci continues with this in the next book.FBI Special Agent Atlee Pine you have a new admirer here. "}, {"Review": "The first thing I should say is that 2 stars means I found this book to be okay. Not great. Not what I usually expect from David Baldacci but it was okay. It would probably make a good made for TV movie. Pass the popcorn.Another rogue FBI agent who is on a mission to save the world (literally) from conspirators that permeate all the various United States federal agencies. Homeland Security, the Army, her own FBI. They have helicopters, soldiers with body armor, M4 rifles, etc. Atlee Pine has her Glock and an ankle pistol. She also has a restored Mustang. Good thing that she is somewhat superhuman.Atlee Pine is the lone resident FBI agent in Shattered Rock, Arizona and that is just the way she likes it. She prefers the wild and open west to Washington D.C. where she could be a top criminal profiler. The Shattered Rock office oversees the Grand Canyon National Park and therefore it is Atlee Pine who is called when a dead mule is found and it's rider is missing. Of course it can't be that simple. A couple of the park rangers who were involved in the dead mule / missing hiker case are suddenly transferred to a different National Park and Atlee is told to take a vacation. Rather than take a vacation she and her secretary, Carol Blum, decide to investigate on their own.Atlee Pine is young, tall, athletic, and muscular. She almost made the U.S. Olympic weightlifting team. Almost. Mrs. Blum is elderly, dresses professionally, and addresses Atlee formally as Agent Pine. The two of them are polar opposites but make quite a team. Mrs. Blum thinks they are like \"Thelma and Louise\".There are some other interesting characters in this story. There is another park ranger, Sam, that Atlee develops a relationship with. I guess he could not be transferred with the other rangers. If he had been then Atlee could not start a relationship and Sam would not be there to help. There is a North Korean ninja who keeps popping up and beating up Atlee. Since this is all about a major conspiracy there are other assorted characters where the reader is left to guess as to their allegiance.The Mercy in the title refers to Atlee's twin sister. When they were six a man broke into their bedroom. He recited \"Eeny Meeny Miny Moe\" while thumping them on the forehead. Mercy lost and he took her. She was never seen again. Atlee's parents divorced and her father, who had been a suspect, committed suicide. Atlee's suffered survivor's guilt. Her life could have gone in a different direction and it fact started down the path. But she discovered weightlifting and joined the FBI. When the story opens and at the close she confronts the man, who is in prison for other crimes, she believes took Mercy. This is listed as Atlee Pine, #1 so I assume this is the first book in a series. Perhaps this question will be answered in a future novel. If this is the first book in a series I am hoping for improvement in the Atlee Pine character and a better story."}, {"Review": "A new series from a favorite author? I'm on it! And although I've just finished, I'm already eager to read the next installment.That is not to say, however, that FBI Special Agent Atlee Pine totally won me over. I like that she's strong (both mentally and physically) and thus able to handle just about anything that comes her way. That she's carrying around a traumatic childhood - her own almost death and the kidnapping of her twin sister, Mercy - is less intriguing; for me, it simply provides another dimension to the story and, most likely, a recurring theme for the series. As I read, I was reminded of another series character: Jane Hawk, the feisty heroine conceived by another favorite author, Dean Koontz. Both women live and work on the fringes of credibility - both in what they are able to handle physically and in terms of a sometimes hard-to-believe plot. But I'm one of those who go with the flow and accept a story for what it is - a story - and this is a good one.At age 35, nearly 6 feet in height and an almost-Olympic weightlifter, Atlee has joined the FBI and now happily heads up a remote office near the Grand Canyon National Park. At the beginning, she remains fixated on finding out what happened to Mercy; believing that a prolific serial killer was involved, she visits him in the no-mercy federal prison in which he's expected to spend the rest of his life. But then comes a distraction; one of the mules that transports tourists up and down the steep canyon trails is found dead - gutted with two seemingly meaningless letters cut into its hide. But as she and local park rangers begin to investigate, she's suddenly called off the case in no uncertain terms by folks way above her pay grade. Then, the two park rangers who were helping her are abruptly reassigned. When Atlee and her capable secretary, Carol Blum, forge ahead despite orders from on high, they find themselves the targets of some very nasty men. Narrowly escaping death, the two now are certain that something rotten in those canyon walls besides a decaying mule. But rather than concede victory to the higher-ups (and probably more bad guys), the pair decide to go rogue. From this point on anything I write would spoil things for others, so I'll just say they face a number of other close calls before they figure out what's really going on and decide what to do about it.In my book, it's an adventure well worth reading - highly recommended."}, {"Review": "Long Road To Mercy, the first thriller to feature FBI Special Agent Atlee Pine, begins by introducing us to our new protagonist, and we learn all about her formative years spent with her family and the troubles that have plagued her ever since, saying more would spoil it for potential readers. As her life is shaped by happenings of the past I have a feeling that this will be a recurring theme that Baldacci will continue to use throughout this brand spanking new series.I can very much relate to Atlee Pine and her attitude and tendency towards being an introverted loner, but there is no doubting her ability to get stuck in and once she gets her teeth into something, even where she has been warned off it by her superiors, she still continues to follow her heart with no qualms about the possible consequences whether personal and/or employment-related. She is both physically and mentally strong and reminds me of the type of women guys are often intimidated by. Whilst I did appreciate her tenacity I did feel she was being a little foolish and naive at certain points. What she lacks in terms of social skills and ambition she makes up for by her don't-mess-with-me nature and her investigative skill.The Grand Canyon was a stunning location for the book to be set and Baldacci's descriptions were wonderfully vivid. I remember thinking that the story was more than a little far-fetched, but after taking a step back and looking at it against the current political backdrop, I realised just how plausible it actually was! You recognise that Mr Baldacci has taken inspiration from the state of world politics but in particular those in the US. It's well written, with plenty of FBI action, a fast-moving pace and a suspense and tension-filled plot that will have both long-time Baldacci fans and those new to him devouring this captivating tale. This series appears to have opened with a cracker - roll on book two!Many thanks to Pan Macmillan for an ARC."}, {"Review": "Intriguing Start that Goes Down the Absurd Conspiracy TrailReview of the Audible Audio edition narrated by Brittany Pressley and Kyf BrewerThe opening set-up, which was also well-telegraphed in the title, and then even the mysterious death of a mule in the Grand Canyon promised a lot here but it all got side-tracked into a totally absurd conspiracy plot where each plot twist was more unbelievable than what came before.Baldacci introduces a new series here with FBI agent Atlee Pine and the western outdoors locale and accompanying characters are well utilized at the front and back end. The actual conspiracy that is finally uncovered is just far too absurd to hold the plot together but it does provide occasions for some well-written action set-pieces. I hope for something a bit more realistic and down-to-earth from any future entries in the series.The narrations by newcomer Brittany Pressley (female voices) and veteran Baldacci-reader Kyf Brewer (male voices) were both excellent. "}, {"Review": "Audiobook - 11:10 hours - Narrated by Brittany Pressley, Kyf Brewer4.0 stars out of 5.0I have been brooding on \"Long Road to Mercy\" since I finished it early yesterday. In my judgement, Atlee Pine is a true \"action hero\" moulded from the strengths and weaknesses of a multitude of such characters as John Puller, Kim Stone, John Rain, Jack Reacher, Will Robie, John Milton and the like. Because of her back story and the great set of characteristics attributed to her, including her FBI badge and \"creds\", I liked Atlee Pine. What had me hovering between 3.0 and 4.0 stars was the plot - hardly credible - and the storyline - which seemed to wander the entire USA and back again. The action stuff was pretty good but was a bit 'filled out' by the addition of some unnecessary and irrelevant writing. For example (not a spoiler), on their cross US journey, Atlee and her side-kick stop at a deserted, barely lit rest area with not another vehicle or person in sight. They both go to the 'ladies bathroom' and are immediately confronted by three young, hulking, tough dudes wanting a bit of \"you-know-what\". Of course, Atlee dealt them her brand of \"you-know-what\", leaving them all cuffed together, each suffering his own brand of pain. Atlee dials 911, gives them some details and drives off into the sunrise. Aside from reinforcing Atlee's previously demonstrated fighting abilities and her willingness to use them, plus her FBI badge and her gun, to beat guys bigger and stronger than she is, the anecdote had no bearing on the plot/storyline whatsoever.The rest of the story required a significant suspension of a reader's/listener's credibility particularly in regard to the alleged activities of various branches of USA armed forces, USA Homeland Security and the FBI. The resolution of these, umm, 'conflicts', the apprehension of the bad guys, and other stuff of an \"International\" nature, pads out the final story leaving a \"what was that all about\" taste in the mouth.I hummed and hawed about 3.0 stars or 4.0 stars, but in the end I decided that David Baldacci's creation of Atlee Pine is a good thing, particularly since I read that he has decided to develop this character as the long-term basis of a future series."}, {"Review": "I like David Baldacci. I feel like he didn't write this book. That he got someone else to write it and he just edited, added or told the story and someone else ghost-wrote it.Atlee was very unlikable for me. She's a mess and it's not working in a way that I have empathy for. Add to that incredible details of.... restoring a mustang, bench pressing/weight lifting, Grand Canyon trails... too many pages of info that didn't add to this story except for page counts.I will read more of the Memory Man series, but not going to follow Atlee around again."}, {"Review": "I usually love listening to audiobooks, however, this book would I have rather read. Or waited for the Swedish audiobook. Brittany Pressley voice was kind of OK, a bit robotic, like narrators to express more emotions. However, Kyf Brewer, GAH, very robotic voice and he voiced EVERY male character in pretty much the same way. Also, I have no problem with different voiced when there are different POVs. In this case, did Kyf Brewer voice every line that a male character speaks. And it irritated me quite badly. As for the story, well, to be honest, I've read better books by Baldacci. Much, much better books. I was actually surprised to find this book to be so bland. I picked this book as Baldacci is a safe card when it comes to a great reading experience. This time, well it was OK, and I will pick up the next book in the series. Just not the audiobook version..."}, {"Review": "DAMMIT!!!!!!!!!!!!!!!!!! I am all set to love this book when I hit the first several pages...A dead mule, a missing person, smallest FBI office possible with a female agent and awesome secretary, National Park Service Rangers, a Navajo Nation, hunky Sam, mules, mystery with a cave and all this nestled in the Grand Canyon area!!!!!!!!!!!!!! Can it get any better? Of course not, was all downhill from there. The plot is absolutely absurd for this setting. It made me very ANGRY...All of these great interesting people involved and that was the best story line he could come up with? Not every novel needs to save the world and this one definitely shouldn't have."}, {"Review": "The first book I read by David Baldacci was \"The Innocent\" and it was excellent. A great plot and characters and the story kept me very entertained. I continued to read many of David books until the plots became repetitive and more unbelievable. I didn't read anything by him for awhile and I saw his new book \"Long Road to Mercy\" and it looked interesting so I thought I would try again. Big mistake. Total disappointment. The main character, a woman, chapter after chapter, taking on two or three men at a time, and she always coming out smelling like a rose. I kept hoping the book would improve but it only got worse. Taking on the Russians, the North Koreans, and the US Government and she conquers them all. Another reviewer posed the question did he even write this book? It reminds me of a late James Patterson book. His early books were good but as he churned out book after book the stories were more far fetched and just ridiculous. Do they have to meet a publishing deadline, or the more books, the more millions? I think I've read Hardy Boys mysteries with more logic. Sorry David, you wasted enough of my time, our relationship is through. "}, {"Review": "Baldacci has created a fine new character in Atlee Pine. She's a bit too superhuman, but her emotional vulnerability balances it out a bit. Her sidekick, an older woman secretary who is more than she seems, creates an interesting dynamic. Pine is smart and funny, although both she and Carol Blum, the secretary, come off as more masculine than feminine. Speaking as a woman and a writer, I'd suggest he run his drafts past some female readers before the next book comes out. Still, what a gripping story! You're not sure who the good guys are, and the premise is really believable, unfortunately, given the current political situation in America and the world. I think the book is about 50-75 pages too long; I skimmed some details of overly-detailed scenes, but overall a very good read. I'll look forward to Book #2 in this new series."}, {"Review": "Great read, love David Baldacci's writing. Special Agent Atlee Pine is a troubled but steadfast officer of the law. Her past is her nightmare and it does disrupt her rationale at times. One thing is for sure, you want her on your side! She teams up with her office assistant - they refer to themselves as Thelma and Louise! One of the National Park Rangers becomes a personal friend of Atlee's, which is a good thing because he also carries baggage from his past. The one thing that seems to be the norm for a lot of writer's is if the character has served in the Middle East, it's always the same story: A kid from the village makes friends with the troops, then tries to kill them off - it's been done too many times now and one of the reasons why I can't give 5 stars. I so hope Mr. Baldacci continues with this series!From the blurb: Her name is Atlee Pine, the latest creation from bestselling author David Baldacci. She has unstoppable tenacity, always a fighter who is unwilling to cede any ground. She has endured real nightmares and she has the emotional and physical scars to show for it. And she got that long before she became an adult.She is a FBI Special Agent assigned to the wilds of the western US. She has to cover, often solo, vast tracts of area: Wyoming, Montana, Idaho, Colorado, Arizona. Small towns, impossibly long distances in-between, isolation like most on the East Coast have never experienced, and an environment where anything can and does happen.Working with the locals who respect, and also sometimes fear her, and have never really been allowed to know her, Atlee Pine turns her vast investigative skills and unmatched drive to find out the truth. Along the way she will revisit painful memories of her own, come to grips with what she is and what she might one day aspire to be. But in the end, she will have to confront not only a new monster, but also the old one of her nightmares.4.5 stars and 2 thumbs up"}, {"Review": "Ive only read a few Baldacci novels because I know they're easy reads. And I also like to break things up with a crime action style book. The premise sounded cool. Pines twin was murdered or has disappeared when kids, she visits the notorious killer in prison and demands to know where she is and what happened. This arc really only consists of about 40 pages so less than 10%. The second arc consists of Pine working for the FBI in a murder/disappearance investigation amongst the Grand Canyon. I wasnt overly excited about the sudden change and reliance on this plot without ever returning to the original plot until the last couple of pages. Here we get a over the top action thriller. I felt like previous novels by the author were very strong on the plot front however this seemed a little weaker. It also felt a little too heavy on the description on the scenes and very light on the action sequences. The action seemed to start and finish very quickly. Not sure if I'll continue this series. Hopefully he revisits the twin sister thread more closely though in the near future."}, {"Review": "Thanks to NetGalley for the ARC copy. When it arrived in my in box I was so excited, and started reading it straight away. I love all David Baldacci books, they are so varied and different. OK so they may all have a little bit of Washington DC in them, but that is the only similarity between them. I really liked Atlee - she seems a great character, much in the way of Michelle King. I don't want to give the story away, but the email characters are well drawn and the sort of people you want to know, whereas most of the men and awful (but brilliantly written). I just hated most of those in power and was really glad when Atlee stuck it to them. Now just a long wait for the next Atlee Pine book. I would recommend this book to anyone who likes a good Thriller/Mystery."}, {"Review": "4 1/2 Stars, rounded up to 5 I. Loved. This. Book. Seriously, I didn't want to put it down. I will admit that the plot was a bit of a reach but that was okay with me. I really, really loved Atlee and Sam (and their burgeoning relationship) but I have to say that Atlee's older assistant, Carol, was hands down my favorite character in the book. What a hoot she is! One of my favorite parts of the book was when Atlee and Carol were on their road trip (which involved one dangerous pitfall after another) and discussed who was Thelma and who was Louise!I will admit that part of the reason I loved the book so much is because I lived in Arizona for many years, and reading it brought back so many memories. Baldacci nailed the details! For what it's worth, I feel that the reason for the negative reviews on this book is because of Baldacci’s commentary on the political situation in the U.S., and discussion around the lack of trust that many Americans currently have in their own government agencies, which seem to be above the law. My reason for the 4 1/2 star rating, rather than five, is because at times there was too much detail for my taste. Atlee almost made it to the Olympics as a weight-lifter and her weight-lifting routine, etc, was a bit of a snore for me. Probably readers who lift weights will love that part, though. I am waiting anxiously for the next book to be written! "}, {"Review": "David Baldacci has become so prolific, I sort of mentally discounted some of his books the last few years. I took a shot here and was happy I did due to the introduction of his new protagonist FBI Resident Agent Atlee Pine. She's kind of a bad ass weight lifter who takes her low key position in the FBI hierarchy very seriously while haunted by the kidnapping of her twin sister years earlier. Much of the setting takes place in and around the Grand Canyon which is always a welcome break from NYC and LA. An auspicious start on a new series that I plan on reading."}, {"Review": "Great new strong heroine in FBI Agent, Atlee Pine. Agent Pine joined the FBI because she believed in truth and justice, but when she stumbles into something huge she begins to wonder whom she can really trust. When we find out what is really going on it is so mind boggling and frightening. Could this really happen? For mankind’s sake, I hope not. But in the crazy world we live in now, with powers that be that want to control the world, anything is possible. I hope there are more people like Agent Pine in all walks of life."}], "Genre": "Crime", "ID": "39088984", "Desc": ""}