{"Name": "Past Tense", "Image": "https://images.gr-assets.com/books/1518445114l/34019122.jpg", "Reviews": [{"Review": "4.5*Jack Reacher is back and tougher than ever! And as anticipated, big trouble seems to be hot on his trail…Once again, Jack Reacher is traveling along the back roads of America. His way of avoiding unwanted attention. Hitch-hiking is a roll of the dice at best, and now he’s found himself unexpectedly dropped–off in New Hampshire. He finds himself drifting back in time to his childhood, his father fondly telling him all about his hometown of Laconia. It wasn’t in Jacks’ game plan, but at the crossroads he now found himself at, has a choice to make. It looks like all roads lead to Laconia, New Hampshire. Home. And that’s the direction he’s chosen. Who says you can never go home...? Maybe it’s high time to get in touch with his family roots.Shorty and Patty have concocted a fool-proof plan. They’ll drive from Canada straight through to New York to make a quick sale for some easy money. Only they didn’t plan on getting stranded at what appears to be the Bates Motel! There is definitely something strange going on in this odd-ball place. Are the motel owners trying to help them? Or...what exactly do they want from them?As the two seemingly separate stories converge, the tension builds to an explosive crescendo.This is one of the darker Jack Reacher novels I’ve read. The story-line of Patty and Shorty will have your heart pounding and your blood running cold. If you’re a Jack Reacher fan then this is a must read for you! One of my favorites from the series so far!Thank you to NetGalley, Random House Publishing Group - Ballantine and Lee Childs for an ARC to read in exchange for an honest review"}, {"Review": "***NOW AVAILABLE***This is the second book by Lee Child that I have read and I definitely enjoyed this one more than the other which was “The Midnight Line”. I liked the dual storyline which converges later on in the story. However I did feel that the one with Reacher in it, looking into his “family tree” to be quite slow moving and a bit dry. The second story line with the two young people stranded finally at a more than creepy motel was the most interesting in the book.I like my characters well drawn and I think Mr. Child did a great job in helping me get to know Patty and Shorty and how they are hoping to set up a shop in Florida with the help of whatever is in that extremely heavy suitcase which they are unwilling to part with even when their lives are at stake. They have stopped at a motel during their cross country travels and this ends up to be the most incredibly wrong decision they have ever made. The motel in question is being run by one of the most depraved and money hungry bunch of goons I’ve ever come across, headed by a man with the last name of Reacher, go figure??? We aren’t really sure what they are up to until the ¾ mark in the book but I had a pretty good hunch once the other “guests” started arriving and let’s just say that Patty and Shorty didn’t have much say in the process. Their clever thinking and love for each other help them through their ordeals.Meanwhile we are still following Reacher and his quest for family knowledge as he searches libraries and town halls for records of his father and grandfather. I felt this was more than a bit boring and was anxious to get back to Patty and Shorty. His extreme detail in parts still drives me crazy example “Reacher hit him in the face, with a straight right, maximum force, crashing and twisting. Like a freight train. The kid’s lights went out immediately. He went slack and gravity took over. Reacher kept his left hand rock solid. All the kid’s weight fell on his own locked elbow. Reacher waited . . . .. . . The kid’s elbow broke and his arm turned inside out. Reacher let him fall, etc. etc. etc.” Too much detail already.In what I have come to know as true Reacher style his path converges with those in trouble just when he is most needed. I have to admit that I’m a little surprised at how many people are so enthralled with this character as he doesn’t grow or change in his books, at least in what I’ve read. He is also endowed with super-human strength and smarts but I was willing to suspend belief for entertainment.All in all I still had fun reading this book and would recommend it to anyone who enjoys reading series books with a character that they can count on to “come to the aid of those in need”.I received an ARC of this novel from the publisher through NetGalley."}, {"Review": "I’ve been reading the Jack Reacher series since Lee Child wrote his first. How wonderful it is after finishing #23 in the series to say it’s definitely one of my favorites!Jack Reacher, our 6’5” ex-military hero is on a journey from Maine to California and decides to take a pit stop in Laconia, New Hampshire to check out his father’s birthplace. Scanning through records at town hall and researching census from long ago bring him in contact with a lot of different characters - some nice and some not-so-nice. I always like to see the not-so-nice come into play as this means some action is to be expected. I’ve got to tell you I love his hand-to-hand fighting skills that emerge and the surprise of his foes. Bring on all the details! My father had us watching every war movie and John Wayne film since I was a kid. I love, love, seeing Reacher beat up the bullies. Bring it on!What I really liked about this book is the duel storyline. Two young Canadians, Shory, and his smarter girlfriend, Patty, break down at an isolated, creepy motel not far off from Laconia. Unbeknownst to them, they are about to enter hell. They are in desperate need of Reacher’s help. The two stories converge with a lot of action and excitement. Meanwhile, there are some other nasty folks around that our hero gives a mighty fine lesson.A definite stand out for me is the female ex-MP, now Laconia cop, Reacher interacts with throughout the book.If you have never met Jack Reacher yet, but would like to meet a man that likes intelligent women, doesn’t take any crap from anyone, and will protect those that are in despair, read this book. It doesn’t matter that you haven’t read the others in the series. Start here!5 out of 5 exciting starsThanks to NetGalley, Random House Publishing Group - Ballantine, and the fabulous Lee Child for the ARC."}, {"Review": "Lee Child returns with another Reacher adventure that takes things down some untraversed pathways, particularly interesting for series fans. When Jack Reacher sets out for California, he has high hopes about this journey. However, early during the trek, he ends up having to get out along the road in New Hampshire, where a road sign rattles in the wind. The town of Laconia triggers a memory for Reacher, which he soon recollects is Stan Reacher’s place of birth, a father who taught him the steely ways of Marine life. Armed with a great deal of curiosity and all the time in the world, Reacher ventures towards the outskirts of Laconia. Liaising with some of the locals, Reacher begins piecing together some of his family history, at least until his father fled to join the Marines at the age of seventeen. However, there are some who want nothing more than to chase him out of town, possibly because of his name, but surely also due to the fact that Reacher is never one to hold is tongue...or a punch to the face. Meanwhile, in another part of town, two Canadians arrive in their beat-up vehicle and hope to only pass through, though a group of men who run the local motel may have other ideas. As they soon learn, Laconia, New Hampshire is more than just a dot on the map, but how do they play into the larger narrative? With Reacher discovering a great deal about his ancestors and being part of a larger dust-up, he could be the only hope for those looking to forget all about this community. What Reacher secrets have been buried for over seventy years and how will this opportune visit change the dynamic for the decades to come? Child does a wonderful job in creating a strong story and keeping the reader enthralled. Recommended to series fans who want to see yet another unique angle to this ever-evolving collection.I know some people have read and reviewed this book, feeling that it is missing an essential piece of the Reacher puzzle. I, on the other hand, constantly marvel at how Lee Child has been able to take a nomadic protagonist and always find new ways to inject life and excitement into his life. Jack Reacher has seen it all in his years, but there has always been that missing gap in his past. Born abroad and having traveled as part of a Marine family, Jack Reacher never knew his grandparents and did not hear speak of them. His father, Stan, left as soon as he could get out and never came back. Now, Jack is able to peel back the mystery and learn a little more about young Stan, as well as the people he would call grandparents. As he delves a little deeper, Reacher finds more family members, who tell an interesting tale that will surely help shape this nomadic man as he continues his treks across America. The secondary story offers some interesting characters as well, two young twenty somethings who are unknowingly trapped in town by a group of young men. They become guinea pigs to a plan that they could not have foreseen. Child offers some interesting storylines related to these two, helping to shed the ‘Canadian passivity’ as soon as things get hellish. The story was quite well supported, using the typical ‘moseying Reacher’ before adding the element of personal connection for the man and helping the series fan to learn a great deal while also noticing Reacher’s typical rough-cut personality. There may be some wonderful nuggets on which Child can build in novels to come, which I hope continue. This is one series that I have found does not lose its momentum as it continues, as Child mixes ‘past’ and ‘present’ storylines in novels to better understand Reacher. While it may seem trivial, as a long-time audiobook listener of the series, I have come to discover that Child seems overly connected to the word ‘said’ when tying off dialogue. While it seems minor, to hear ‘he said.... she said....he said’ repeatedly during a dialogue makes for some mundane verbal tennis that can grate on the listener’s nerves after a time. As I said before, this seems to be a constant in books. On the note of audiobooks, I was so pleased to see Scott Brick at the helm and hope that he might be the new voice of Reacher, who suits it as well as Dick Hill did in novels past. What’s next for Lee Child and Jack Reacher? I suppose we will have to wait, but hopefully not too long.Kudos, Mr. Child, for more wonderful story writing. I know you have many ideas brewing and I cannot wait to see what twists you will toss into your novels and short stories.Love/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"Review": "Past Tense is an okayish Jack Reacher. I never felt drawn into it unlike the earlier ones in the series. This could be due to Jack Reacher outstaying his welcome - there are only so many plots available given the context or it could be that with every story, Jack Reacher becomes more and more like a Superman-Ninja combination. And that is a nice segue into one of the indications that Lee Child is himself aware of it. There were two separate threads in the story which meet only towards the end. And the meeting felt like a contrivance rather than two plot points seamlessly merging into each other. So, my take is that Lee Child had to bring in a non Jack Reacher story line to bring back the tension into the series again.Welp, I am not hopeful that this series is going to be back on an upward swing anytime soon. "}, {"Review": "I really enjoyed Jack Reacher's latest foray into the world. So much so that I could not stop reading and knocked off most of it in one afternoon. One of the best in the series to date!There are a number of story lines going on in this one and a lot of characters, some good and some really bad - as usual! Also as usual Jack manages to get caught up in several different issues and has to fight his way out. He also discovers some amazing details about his own genealogy which he takes much more calmly than I think I would.All the usual action, plenty of dead bodies, some very nasty baddies and a great story. What more can we ask for? Thank you Mr Child and keep up the good work please!"}, {"Review": "Only for the already-devoted Reacher fans and then.... The challenge for Child on book #23 is that he's already written several books in which the bad guys do unspeakable things to children, are holding one or more entire towns or communities hostage by threats of violence to anyone who steps out of line. He's also written several books in which Reacher hooks up with the FBI agent investigating either related crimes or the targets of Reacher's interest. In order to avoid duplicating these plot points and being accused of simply re-hashing the same old same old, Child here just phoned it in minus those features. The page-turning aspect remains, but there's no heart to Past Tense. Reacher plays superhero to random strangers he encounters in a situation where they could be harmed, and kills a half-dozen bad guys who connected on reddit or 4chan to pursue an unlawful and immoral impulse. We aren't invested in the people he saves and his reason for lingering in this rural New Hampshire setting is flimsy, at best. No one should encounter Jack Reacher for the first time via Past Tense. If I hadn't gotten to like him in the 7 - 10 Reacher novels I've read before this one, I'd not pick up another based on this experience. This series appeals to that unseemly side of most of us that finds satisfaction in Reacher's vigilante justice, or at least we don't feel terribly badly about the absence of the justice system prior to an execution or two committed by our favorite civilian. But there has to be more to these novels than reading about killing bad guys with impunity, or the thin veneer that we're here for more than that begins to disappear."}, {"Review": "My thanks to Random House/Ballantine and Netgalley for letting me read this arc for my honest opinion.It's actually been a few years since I've read Jack Reacher. I'll confess that when I heard that Tom Cruise was playing Reacher in a movie it kind of ruined the image. Of course, I first had to spit the vomit out of my mouth, and spend a few minutes cussing. It's not that I dislike Cruise, its just that I think he's human garbage. Oh, dear me! Well, look at my little rant. How embarrassing. Not enough to delete it....Anyways, thankfully enough time has passed, and Reacher is again a very big man. Cruise's 3 foot 8 inches...oh, damn. Look at me go! O.K., Seriously, I really enjoyed this book. I liked the story, and I actually enjoyed the main characters, and was kind of anxious for them. Reacher doesn't always save all the good guys. Maybe its because its been awhile, but Jack seemed a wee bit more cold blooded than before. I did leave this book wondering about the aftermath. Still, once again I'm engaged with Jack Reacher. I really did enjoy this story. It made me tense. When my muscles say \"let loose woman,\" then I know a book has gotten to me!"}, {"Review": "Oh, how I love this Jack Reacher series!I’ve always felt the thinking of timing, speed, movement, sequences, and assessments was Reacher’s. From previous books, I know Reacher has that internal clock and he just knows what time it is. And he pictures how things work out before taking action. In this book, I began to think that those types of thoughts were being applied to some of the other characters. I found myself wondering if it was because there were spoilery things (that I won’t mention) going on with the characters. Then it occurred to me that maybe this was really Lee Child’s thinking and it was leaking out to other characters’ thoughts and behaviors. I was a bit dismayed to think Reacher wasn’t the only one thinking like this, and I don’t know how I feel about that.Reacher is in Laconia, New Hampshire, his father’s home town, or so he always said. He decides to see the old homestead, and visits some local agencies asking for help in finding it. A second plot line involves two Canadians, Patty and Shorty, getting caught up in a situation that I really hope doesn’t occur in real life. It took most of the book to bring these two plot lines together, but all hell breaks loose after that.I eventually became very fond of Patty and Shorty after initially thinking they were being pretty stupid. I really liked the search for Reacher’s father’s history. It got me thinking about his family.I think it was in the very first book that we met Reacher’s brother, Joe. Didn’t he work for the federal government in some capacity? We know his mother was a French woman and her name was Josephine. I remember a previous book where Reacher visited her in France, but I don’t remember why he went and I don’t remember the title of the book. There was also a *.5 short story when Reacher was a kid and they lived on a base in Okinawa where his father was stationed. We really have not had much information about Reacher’s father until now. Are there any other mentions of his family history that I’ve missed?"}, {"Review": "Jack Reacher has apparently been thrilling readers for twenty years. No one told me. Although this is only my second Reacher novel (and its number 23 with a bullet), count me in as a fan. Reacher is an ex-MP who has taken to wandering the country, heading here and there for the barest of reasons. Well, he likes a puzzle and is curiouser than any ten cats. Along the way, Reacher always seems to stumble into trouble. Here, he returns to his father's hometown and decides to see his dad's old haunts. Meanwhile, a couple of Canadians head south on an adventure of their own, one perhaps that could have been better planned and in a car that certainly could have been better maintained. Their adventures could not have put them in a more bizarre and offbeat predicament. Of course, eventually their paths will cross. I found this to be an enjoyable and compelling read, although don't open it up expecting a lightning paced thriller. It's pace is more thoughtful and confident, if not laconic. What makes it work is the even pace, the narrative voice,and natural curiosity."}, {"Review": "Jack Reacher always let himself get side tracked – the journey across America ended quite quickly when he saw the sign to the town where his father had been born and he’d never been. The quick visit would only take a day – right? Wrong!Shorty and Patty’s car was on its last legs and they were running behind. They had expected to make New York in the one day – no stops, no costs. But with the day drawing to a close and the car struggling, the sign on a side road which said “Motel” had them turning toward it. Unbeknown to them, that was the wrong decision…Past Tense by Lee Child is another fast paced, adrenalin filled thriller which I loved! Gritty, intense, nerve wracking – it had everything that makes a great thriller. #23 in the Jack Reacher series, I’m already eagerly awaiting his next. Highly recommended."}, {"Review": "I was so happy to receive this as an advance review copy from NetGalley and the publisher as I had never read a Jack Reacher book until now. Let me just say - it was awful! I was so disappointed. The story line I found very far-fetched on both sides. I honestly kept thinking and hoping it would get better, but so sorry to say it did not. I was not shocked to see many one star reviews when I went to Amazon. I am not giving up on Lee Child's writing though, and I have a couple of his previous books I plan on reading. I know he can write! I just seem to have chosen the wrong book to start out with."}, {"Review": "Perennial traveller Jack Reacher is journeying down to San Diego for some warm weather, his thumb is his ticket. Early on he spots the name of a New England town he recognises as the place his father grew up. Well, he’s got to take a look at this hasn’t he.In a parallel plot line a young Canadian couple are planning to drive beyond the same town but their old clunker of a car looks like it’s not going to make it much further. They pull to a stop at a motel and decide to get the car fixed and then move on as soon as possible. They are, we’re told, carrying a heavy suitcase – it’s contents is not divulged. From this point very little of any consequence occurs for some time. The couple rattle around at the motel and Reacher searches for information regarding his grandparents and father. It’s slow going and rather dull, but the rhythm entrapped me. This Reacher novel, like all the others, has a cadence all of its own. - We meet a few people in a small, friendly town with a hick police force - Reacher finds a place to eat and drink coffee and somewhere to sleep - Lots of people say nothing and do nothing and and at least one person stares at nothing- Reacher speaks in short sentences, is methodical in his thoughts and actions and his inner clock keeps perfect time - We see and learn the obvious... and then the concealedI’m half way through the book now and my only real thought is what’s in the suitcase?Then things speed up a bit. Reacher is a big, strong guy and he’s not averse to some violence. A situation arises and he deals with it. Then things start to look and feel strange. With this tale it’s not so much about whodunnit as what the hell is going on here? It’s a puzzle we can’t yet resolve as a number of pieces are hidden. Then they’re not, at least not all of them, and a scenario is presented. It's an interesting one.All in all, it’s turns out to be a reasonably satisfying story. It’s not the best Reacher I’ve read but it’s not the worst either. Three and a half stars rounded up to four. I know I’ll come back for more – it’s just a habit I can’t break."}, {"Review": "This was about the 10th Reacher book that I’ve read, so I certainly know what to expect from him. The books are quite formulaic and you either buy into the formula or you don’t. He’s the loner who arrives at a new town and happens upon some trouble, resulting in his brutally beating a few people and crushing some bones. There was a pretty high body count in this book, which alternated between the Reacher story, as he researched his father’s background, and a second story about Shorty and Patty, a young Canadian couple who become trapped in a creepy motel. I found it slightly off putting that Patty’s internal voice and the manner in which she analyzed situations sounded exactly like Reacher’s, but no one reads these books for the great character development. The two storylines don’t come together until the end of the book. The motel plot was definitely more suspenseful and interesting. The book entertained me and I’ll continue to read the series selectively. There is absolutely no reason to read all of the books or to read them in order. I received a free copy of this book from the publisher. "}, {"Review": "4.5 stars, actually.Honestly, I'm not at all sure how much I'd like Jack Reacher if I met him in person because he doesn't pull any punches, but I'm certain I'd want him on my side in a fight for the same reason. And in this, the 23rd book in the series, he gets plenty of opportunity to practice his considerable skill.The story begins as Reacher walks and hitchhikes near a remote and tiny town in New Hampshire on his way to wherever else the wind (or more accurately, any driver who gives him a lift) takes him. When he recalls his late father Stan saying he grew up in the town, though, Reacher decides to pay a visit to the family homestead - if he can find it, that is.Concurrently, Shorty and Patty, a pair of grifters from Canada - on their way to New York with a get-rich-quick plan in tow - have car trouble. Just as the old jalopy is ready to blow, they spot a sign pointing to a motel in a heavily wooded area of (you guessed it), New Hampshire. Yep, there's a halfway decent room available - but very soon, it becomes obvious that this isn't your average Motel 6. In fact, they may have happened upon their very worst nightmare.Chapters follow the progress as Reacher tries to find what appears to be nonexistent evidence of his father's old home and the couple try to find their way out of the mess they're in. As expected, the two storylines end up converging - but not before plenty of action takes place in both. Early on, Reacher gets on the bad side of a bad seed and his wealthy father; although the local police are for the most part on Reacher's side - after all, he's been both an Army guy and a fellow cop - they don't want Trouble with a capital T that rhymes with P that stands for Problem. Just go on your way, they tell Reacher, hoping he'll heed their advice.He'd love to, but he's got problems of his own (not the least of which is getting on the bad side of the folks he runs into when he finally locates the family town). Besides that, other local and otherwise innocent folks are finding themselves in potential danger simply because they helped Reacher; how can he possibly turn his back on them and hike away?And so it goes, with excitement and action building all the way from town to the woods and back to an explosive end. If I have an issue, it's that I have a hard time believing in coincidences - meaning things that happen at precisely the time they should to make the story work. Life usually doesn't follow that kind of pattern - but then again, it's Reacher's life, not mine. In the end I'm happy, and I'll be looking forward to the next installment as usual. Meantime, I'm thanking the publisher (via NetGalley) for the opportunity to read an advance review copy of this one."}, {"Review": "They are all so good but this one is straight out spectacular. Telling you about the tension I felt reading this one!! I had to stop at some point after about page 100 to relax with some physical work exertions to get \"unwound\" and to distract myself enough to be able to swallow my own spit. It was creepy, evil terrifying- the premise AND the execution of it.The premise is one that I've read in maybe 10 novels in my life, mostly sci. fic. but in some YA reads too, like Hunger Games.That tells you enough. And I won the paperback copy here and want to thank you for the gift. Several other people will be reading my copy quite soon too.All of you who know Reacher for so many years of reading and knowing each nuance of his unique and quirky lifestyle- can you tell me if Child ever let us know how he shaves? Somewhere in Book #4 or #6 perhaps? He can't be bearded with the techniques he uses, IMHO. One day I was driving along and that thought popped into my head. He's light haired- but still. Lee Child. I am a fan. Can Child write a thriller! It almost makes you believe that the super hero is not only a true possibility but certain to be \"johnny on the spot\" with his radar for the horrendous, evil and violent perpetrator, even those as despicable as these. And ultimately solving the problem without undue regret! This one (#23) and the one that was in the plains of Kansas or Nebraska within a similar evil cabal as locale operating- they were the best. And he also gets two different unforgettable couples in there too this time. And Reacher isn't even half of either. 2 MP's and a priest. It sounds like the beginning of a joke. It sure isn't."}, {"Review": "A skillfully descriptive and masterfully intense story with Jack Reacher and a perfect cast of characters. SUMMARYJack Reacher is just starting an epic road trip, heading from Maine to San Diego. He only gets as far as New Hampshire, when he comes to a fork in the road. Left or right? He should go left to Portsmith, but the road to the right heads to a town he has never seen, Laconia, New Hampshire. It’s the town where his father grew up. He decides to take the detour to see the place his father talked about. Upon arriving he is mystified when he checks out city records, but can’t find any information about this dad. Was this the right town? Maybe his dad was really never there. At the same time, a couple traveling from Canada to New York in a worn out Honda are experiencing car trouble thirty miles outside Laconia. Patty and Shorty have a suitcase weighted down with something to sell in New York and they want to maximize their profit, so a hotel stay was not in the plans. But the car was overheating. They see a unusual motel sign pointing down a tiny canopy road. They nurse the Honda several miles down the pot-holed tunnel of a road where they find a long and low hotel with twelve rooms and zero occupancy. It seems a little strange to be out in the middle of nowhere like this, but the car will go no further. The owner is welcoming, but everything seems a little off. Something just doesn’t feel right. And then the other rooms begin to fill, and a nightmare begins. REVIEWThis is Jack Reacher #23, and I am happy to say I have loved every single one of Lee Child’s books. It’s just comfortable and fast reading. You know what your going to get when you open the cover. The story is going to be gripping and intense and Reacher is going to make things right. He always does. You may not like how he goes about it, but his rationale makes total sense. LEE CHILD’s writing is skillfully descriptive and masterfully intense. He makes it easy to visualize the red painted motel with the white trim or the knocking of the engine of the old battered Honda. He takes us on a breathless ride of action and suspense, and easily juggles multiple plot lines before merging them together. Jack Reacher at six-foot-five is his own man. He smart, strategic and strong and has the ability to find trouble even when he is asleep. And he will never turn a blind eye to someone who needs help. Unbeknownst to Reacher, Patty and Shorty need his help. Patty and Shorty’s characters are perfect for the story, and I particularly loved how Patti’s character showed strength and intelligence in a difficult situation. Thanks to Netgalley for an advance reading copy of this book in exchange for an honest review. Publisher \tDelacorte PressPublished \tNovember 5, 2018Review\twww.bluestockingreviews.com"}, {"Review": "If you're into stuff like this, you can read the full review.Similar Story Archs: \"Past Tense\" by Lee ChildI have said elsewhere that crime fiction seems to flourish in times of stress, such as our era now. I fully expect more great detective fiction in the near future as it is one of the few genres that can show society from top to bottom: the detective, investigator or whatever, in many of the best novels, talks to both the monied and the moneyless at the same time against a puzzling foreground as broad and as complex as the society, or the human beings, that carry out and solve seemingly deeply baffling crimes at the outset of any great novel."}, {"Review": "Audiobook - 12:29 hours - Narrator: Jeff Harding, after six chapters, replaced with new copy narrated by Scott Brick.NB: This review re-written Monday 12 November. See below.It is almost 1:00 am in Melbourne, 10 November, I have just finished \"Past Tense\" and my rating initial rating is 3.5 stars rounded to 4.0 Stars out of 5.0. I have some review comments to make about this Jack Reacher novel, but I will need to have some sleep before I commit them to paper. :-)Addendum - 9:30 am, Melbourne, 12 November: I've given this book more thought and \"Past Tense\" indicates to me that Lee Child may have been reacting to the comments of an increasing (in my opinion) number of malcontents in the vast army of Jack Reacher fans. Like millions of other dyed-in-the-wool Reacher fans, until this week I had read and/or listened to every one of #1 to #22 in the Reacher novels. A number of them I have read and/or listened to more than once, and a few of that group more than twice. I am not a particularly high marker and 3.0 ('I liked it') is a good mark for me. So for what it's worth, my awards for Reacher novels #1 to #22 were as follows: 0 Five-Stars, 3 Four-Stars, 13 Three-Stars, 3 Two-Stars and 3 One-Star (Did Not Finish). The One-Star's were #19, #20 and #21. \"The Midnight Line\", #22, really was a big improvement over the previous three and received 3.5 Stars. If you want to know why, read my review.Directly after listening to #23, \"Past Tense\" I was 'twixt and tween' 3.5 Stars or 4.0 Stars. After thinking about whether I 'liked it' or 'really liked it', I am confirming a full four Stars for this book. By the way, Scott Brick did an excellent job narrating the book and his reading of it will surprise those \"can't stand Scott Brick\" commenters. I have a number of Reacher books narrated by Jeff Harding and I thought he was far easier on the ear that the aging Dick Hill. I am surprised that Harding's reading was such a disappointment this time round.I have enjoyed growing older with Jack Reacher and if Lee Child is over his 'Reacher credibility hump', as it seems to me he is, I can expect more Reacher gems over the coming years."}, {"Review": "I admit I haven't read ALL of the Reacher books but I have read quite a few and I do believe this is one of the best.In this outing, ex-MP Reacher decides to travel from Maine to San Diego and starts hitching a ride. When he reaches New Hampshire, he sees a sign for Laconia which triggers a memory and an interest in digging up some family history.As only Reacher can, he makes friends and enemies quickly and is soon embroiled in some nasty business (which makes for some very exciting reading.)In a side story, a young couple traveling from Canada have car trouble and end up spending the night in a remote motel. No, it's not the Bates Motel but I swear you can hear the scary music....Both threads come together nicely at the suspenseful and satisfying conclusion. If you enjoy an action-packed thriller, this one is for you. I believe it can be read as a standalone if you haven't been reading the series. But I can also highly recommend the series, not only for the great action but for its strong, intelligent, well-fleshed-out characters. Reacher lives by his own rules, it's true, but he has a strong sense of right and wrong, justice and fairness. You'd definitely want him by your side in any fight! I received an arc from the publisher via NetGalley for an honest review. Many thanks! "}, {"Review": "4 Jack Reacher is at it once again starsMy reviews can be seen here: http://yayareadslotsofbooks.wordpress...On the road againJust can't wait to get on the road againThe life I love is making music with my friendsAnd I can't wait to get on the road againOn the road againGoin' places that I've never beenSeein' things that I may never see again (Willie Nelson)Jack Reacher is once again a traveling man. His goal is to walk from Maine to California (yikes) and so when he travels onto a road in New England, he randomly comes upon a sign which he recognizes. It seems to be he has stumbled onto a town which just so happened to be the birthplace of his father. Of course he needs to check this place out. What's a slight detour and one more day!Arriving at the town and bumping up against the fact that no one seems to recognize the Reacher name, Jack embarks on another adventure sure to involve lots of mysterious and dangerous factors. Meanwhile a Canadian couple, traveling to New York, have their dilapidated car stop, and amble to a hotel where things turn creepy fast. (a bit of the Psycho vibe happening here)Through the bulk of the story, we wonder how or if these two things are connected. What does Jack's family and this young couple have in common? How do they meet and come together and have their lives intertwine with each other. For Jack the danger is real. For the couple their fate is perilous and threatening.Tough and resilient as we who know Jack Reacher to be, this book will not disappoint those who have been with Lee Child for many of his adventures with Jack. Recommended to those who like a tough, what you see is what you get type protagonist. He is the epitome of a tenacious and resilient character who you would certainly want in your corner in a bar fight or any other precarious exploit.Thank you to Lee Child, Delacourt Press, and NetGalley for a copy of this latest Reacher exploit. "}, {"Review": "More edge-of-your seat action from Lee Child. Jack Reacher once again finds himself in the middle of a strange situation. True to form, Reacher once again manages to find trouble when he sets out to help others.A young couple, having car issues, finds themselves stranded at a rather strange motel in the middle of nowhere and there are some suspicious things happening. In the meantime Jack Reacher is walking/hitch-hiking his way across the country from Maine to California when he becomes side-tracked in Laconia, New Hampshire where his father was born. Reacher decides to spend some time researching his roots. During his stay his antenna perks up and he starts tracking some suspicious occurrences.This is a gripping, fast-paced book and if you like Jack Reacher you will certainly enjoy the story. You can, of course, read it as a stand-alone even if you haven't read any others in the series. It will be quite easy to follow. The writing is direct without a lot of unnecessary embellishment - kind of rugged like the character (and this is not a criticism; it really enhances the story). I look forward to another Jack Reacher adventure soon.Thanks to Lee Child and Random House Publishing Group - Ballantine through Netgalley for an advance copy."}, {"Review": "Our itinerate hero Jack Reacher is headed from Maine to San Diego and decides to make a visit to Laconia, New Hampshire, where he heard his father grew up. Before he died, he never did share with Jack much about his childhood beyond the fact that he ran away from home and joined the Marines in World War 2. All he remembers is him talking his father Stan having a position with a tin plant of some kind. While Jack explores family history in town, we are treated to the misadventures of a poor, young married couple on the way from Canada to Boston who end up stuck at a strange motel in the woods near Laconia. Their story interleaves with Jack’s until a point of convergence near the end.It takes him a long time and creative work for him to get past the first roadblock of no birth, tax, or property records for the family. We watch Jack do what he does best, chatting up people in different walks of life, for clues to a mystery, in this case his own family. Someone remembers a Reacher kid who was a birdwatcher and actually lived out of town in an area near the tin factory which no longer exists. Exploring the orchard where the settlement was turns up some ornery people, and asking about why reveals resentment and bad blood over possible water pollution by the plant. Around town he intervenes in a situation of personal injustice, his typical Good Samaritan role which blows up into a line of violent interludes. The scenario of him fist-fighting several opponents at once with a technical blow-by-blow account is a guilty pleasure for me and something one expects from past volumes in this series. Despite progress and diversions into violence, the possibly nefarious secrets about his father’s and grandfather’s past remain resistant until the very last pages.All that I can say about the couple from Canada is that they are being held against their will and that their strategies to figure out their situation and try to escape bears a lot of similarity to Jack’s style of problem solving. That includes quiet courage, thinking through the smallest inconsistencies in what they are told, and the willingness to take bold but thoughtful action when the right opportunity presents itself. Their teamwork was often more pleasurable than Jack’s escapades. And eventually, as we know must happen somehow, they find Jack on their side when it really counts. Giving this couple so much air time was a nice new wrinkle this entry in a series that never fails to satisfy me.This book was provided by the published for review through the Netgalley program. "}, {"Review": "Unique and inventive!! Great story! ~~~~~~~~~~~~~~~~~~~~~~~~~~Being that I’m coming in fresh on a long running series, I had a little bit to learn about Jack Reacher. What I have gathered here is that he is one person you do not want on the wrong side of you.With a history of military and military police, Jack finds himself in a predicament as he begins his journey from Maine to San Diego. I love his theoretical mind and how he’s able to think his way out of problems and issues. Almost like foreseeing the future.I also love that he’s not a young kid trying to figure things out. He’s middle-aged and has a few miles behind him. A big guy; smart, yet soft spoken in many ways. A very likable guy.This thriller starts off in an placid way. We get bits and pieces of multiple story lines stemming from the fact that Jack stumbled upon an area where he knew his family lived 75 years ago. But the research showed that to be untrue. His father and grandfather were not found in the census records.That starts a journey that takes the story in multiple directions and intertwining throughout the other story lines throughout the book. With each page you turn, you can just feel notching up, the key up in the story; knowing that something is going to happen but not sure what.In a few places I got a sense of what could be happening. And then in other areas I was confused. I had no idea what the author was thinking. Then a shocking revelation that brought the story to a new height.I have to say I love the way this author writes his story. Short, concise sentences along with small sections within longer chapters make the story interesting and flow easily. You get the sense of urgency and trepidation; that heightened interest within the thrill of the story.Past Tense is loaded with chills and thrills, action, twists, inventive plots, and a shocking revelation that might make you sick to your stomach. And it is so worth the read! I was captured with Child’s ability to write with huge impact and attention to minute detail.While I was a virgin in the Lee Child collection of the Jack Reacher series, I can let you know right now this is not my last book by this author. Past Tense was everything I hoped for in a fabulous thriller and so much more! Looking forward to my Reacher series journey!* copy received for review considerationFull Review - https://amidlifewife.com/past-tense-b... "}, {"Review": "First and foremost, my thanks to the author, publisher and NetGalley for the ARC of PAST TENSE. Mr. Child has written another suspenseful Reacher installment!  Per his wrting style, the exposition is methodical. However, in PAST TENSE the build up is slower than usual due to the lengthy, picayune details. The reader can guess where this first storyline is headed early on and the (albeit slow) and steady build up piques the reader’s curiosity and tickles the spidey-sense, which builds up the suspense!Reacher comes into play in a secondary story line, which is quite unique and interesting, involving his heritage via his father’s backstory. There are a few surprises as he makes new discoveries about his family’s past generations. (Thus the title PAST TENSE) . Reacher’s familial quest is well developed, intriguing, and cleverly executed. The pace is picking up somewhat as there is a bit more action!The two divergent storylines converge in trademark Reacher style: heart-stopping and electrifying - accentuated with explosive deadly force! However, that Reacher style does not culminate until the 75% mark in the book! Although PAST TENSE does not have much action or thrills & chills until the last quarter of the book, it is ‘worth the wait’ and the slow burn ended up being more than satisfying! Reacher’s character doesn’t grow and mature in this installment, yet it stays true to form: help the helpless, cut through the red tape of bureaucracy, say good-bye and move on. I will be looking forward to his next adventure somewhere in between his present locale of New Hampshire and his San Diego destination! He always seems to find trouble, or vice versa- trouble finds him!"}, {"Review": "Two mostly unrelated stories, based in Laconia, NH, that converge about three quarters of the way through to me in a seemingly forced manner. One is slightly interesting, the other an overused and completely predictable trope. Jack Reacher is hitchhiking from Maine to San Diego, and decides to go through Laconia, his father’s birthplace to examine his roots. Very little can be found in the public records, except that it seems that Stan's predilection for justice was passed on to son, Jack. Jack's traipsing around the public records office and the oldest members of the local community is a bore. He visits various public records offices, and gets a lot of help from the locals when dad Stan Reacher doesn't show up right away in the town’s 80-year-old census records. At the same time, a young Canadian couple on its way to NYC has car trouble, and ends up at a remote motel. They are marooned, because the weird motel owners are not helpful, using a litany of excuses. Eventually, the couple finds themselves imprisoned, because the motel owners have secret, nefarious plans for them. (The couple was about the interesting part of the book.) In the final quarter, the pace finally accelerates from a crawl, making the book okay."}, {"Review": "I received this as an ARC from the publisher, who is well aware that I've read every Lee Child book as a proof since the first one, twenty years ago. Some are better than others in my view, and I think this is one of the best. It has the pleasing simplicity of the early Reacher books - the uncluttered landscapes, the quirky perspectives - and unlike some of the author's later books, which try to vary the formula by relocating Reacher to Europe, or going back too far in time, this one hits the mark perfectly. The tension is beautifully-handled throughout; there are no intrusive sub-plots; the writing is clean and characteristically graphic. This is Lee Child back on form - and all the more enjoyable for that."}], "Genre": "Crime", "ID": "34019122", "Desc": ""}