{"Genre": "Crime", "Reviews": [{"Review": "I once read a book by a former alcoholic where she described giving oral sex to two different men, men she'd just met in a restaurant on a busy London high street. I read it and I thought, I'm not that bad. This is where the bar is set.oh, yeah - this one is going to be a must-read for those people looking to find their next Gone Girl experience. it's an incredibly fast-paced and engrossing psychological thriller, and i was on board as soon as i read the editor's bit of ARC-copy, even though i k"}, {"Review": " \"Something bad happened.\" Are you ready for a faster-paced, creepier Gone Girl?Woah. This is one unsettling little thriller and the best bit about it is that no one can be trusted, including the three female narrators who share the storytelling of this book. I literally read this entire novel in one sitting and I now need to find the words to convince you to go get your hands on it. RIGHT NOW.Between an alcoholic, a liar and a cheat, who can you trust? These are the three women at the centre of"}, {"Review": "I read this book due to the fact that everyone else read it. Yes, mom I would jump off the cliff right behind everyone else. These are some fucked up characters. I think the new trend in books where every one of the characters is an asshole may be the way to go if you are writing a book that you want to take the world by storm with. The thing is...It gets frigging boring. I wanted a bus to hit them all. Repeatedly. May go sorta spoilery:You have Rachel. Rachel is a drunk, she gets on the 8:04 tr"}, {"Review": "I just sent a 3 page, 3,000 word email about why I didn't like this book to a friend, and I still feel the urge to express myself. I suppose that tells you just how much I disliked it.This thing is a hot mess, the writing is clumsy, there are things that don't make any sense, the characters are pathetic and the opposite of complex. The women in this book are either defined by the men they are dating/married to, or by how they feel about being a mother (and by that I mean, do they already have a"}, {"Review": "4.5 stars Everyone in this book is absolutely terrible, and as a result, this book is a masterpiece in character study and development. It's also a well-written, precisely plotted psychological thriller, and deftly sketches one unreliable narrator after another. I guessed the culprit not too far into the book, but that didn't spoil my reading experience at all, particularly because the author drops so many diverting and convincing red herrings into the story. I think it's also interesting that t"}, {"Review": "Depressing from start to finish. Most every single character was a hot mess. I have literally no idea why there are so many 5 star ratings. It kind of scares me. If this kind of garbage is what the masses find appealing...I mean..I didn't care at all about the \"mystery.\" It didn't even feel like there was one. It just felt like a tedious glimpse into the messed up lives of people I'd rather not know anything about. "}, {"Review": "Good read but the ending fell a little flat for me "}, {"Review": "“Esssscuse me. Is this seat taken? Thanks. I like to sits bys the wimdow. Would you likes a little bit of wine? You know what they say, a little vino would be keen-o. No? Mores for me then. Oh, check it out. *BURP* WhatwasIsaying? Oh, sees that house over there going by? That used to be my house. True story. Me and my husbadand lived there. But the ole bastard cheated on me and lefts me and then he marriesss that stupid cow and then he knockeded her up and now they got a stupid cow kid and they"}, {"Review": "What a huge disappointment. The concept sounded amazing, and it got off to a promising...if slow...start. But it quickly turned into this messy, melodramatic story that was neither surprising, or original. Much like in Gone Girl, there was not a single likable character in the entire book. That wasn't the main problem for me, though. I could see the ending coming from a mile away. Actually more like I figured out who the main villan was within the first 20 pages. Never a ringing endorsement. "}, {"Review": "I tried to enjoy it! I swear I did! The hype told me that I had to! I wasn't bad, but it wasn't good either. I never really cared about the story and ALL of the characters were unlikeable. Sometimes characters are unlikeable in a good way, but not this time.At no point was I excited to be reading this. Side note added 4/5/2017: Kinda silly how “Girl” is in so many titles lately. It has to be intentional to ride the coattails of other successful titles. I noticed on my library site that there is"}, {"Review": "I am so disappointed in this one. It started out promising enough, but the writing and the drama got old fast. There was really only one person who could have done it, and because of that I kept thinking it must be someone else. But it wasn't someone else. It was THAT PERSON. By the time the big reveal happened, I was so ready for the whole thing to just be over already. I started out thinking I had a 4 star book in my hands. Halfway through I was looking for an excuse to give it 3 stars. Finall"}, {"Review": "this review and more on my blog -> mereadingbooksCaution. There might be some ranting ahead.This has frequently been called the next Gone Girl. And yes, that is to some extend why I wanted to read this. I wanted something suspenseful; an unreliable narrator; and lots of “what the hell?!”- moments. Out of these three things I got one – an unreliable narrator. But one written so clumsily and shallow that I was annoyed, not intrigued, by her. The plot’s mystery falls flat because it is done in s"}, {"Review": "Pfffiou... I feel like I've been holding my breath for 325 pages and only now finally exhaled."}, {"Review": "I read this one out of curiosity. Aware that it had been a huge market success, I wondered if it merited the sales. According to Riverhead, The Girl on the Train is, or was, the fastest-selling adult hardcover fiction debut ever. And that is a shame. With so many great books being published every year that do little or no business, for this one to have secured a first class ticket on the book-sales express can only be dispiriting to the good and great writers everywhere toiling away in third cla"}, {"Review": "(A-) 83% | Very GoodNotes: It's about escapism, lack, and how plausible suggestion autocorrects figments into memory and strangers into circles."}, {"Review": "4.5Here we are 3 years after the release of Gone Girl- and every twisty turny page turning novel is STILL being compared. THE GIRL ON THE TRAIN is no exception...but that was not what caught my attention. What persuaded me??? Train...Witness to murder...Hitchcock...Rear Window. Those words will get me almost every time...Rachel is depressed, angry, and bitter. Gin and tonic- is her drink of choice- Wine comes in at a close second. Every day she takes the slow train from Asbury to Euston...and ev"}, {"Review": "”Yesterday---sensible, clearheaded, right-thinking---I decided I must accept that my part in this story was over. But my better angels lost again, defeated by drink, by the person I am when I drink. Drunk Rachel sees no consequences, she is either excessively expansive and optimistic or wrapped up in hate. She has no past, no future. She exists purely in the moment. Drunk Rachel...lies.” There are certainly worse ways to spend your day than riding an S stock train into London.Rachel rides the tr"}, {"Review": "Half a \"what the hell happened ?\" star !!! 2016 Worst Read of the Year Original Review written October 3, 2016Update : October 25, 2016 (mini review of the film !!)A couple of days ago 4 single girls (well women in their forties and fifties), my bf (convinced him to join us and he agreed if I took him to Denny's afterwards) and myself went to see this film. This is the main reason I read the book as we had planned this outing for months and then I read the book just before the film came out.As y"}, {"Review": "this. book. suuuuuuuucks.i can't believe it was an international sensation. i can't believe it was adapted into a movie starring actual queen emily blunt. i can't believe it SOLD A SINGLE COPY. (i didn't buy this one. my mom did. so there.)this is just...a straight up bad book on every level. the characters are so insanely unlikable it's cartoonish. it'd be funny if it didn't make EVERY SECOND OF THIS BOOK, EVERY PAGE, EVERY WORD, A FRESH HELL TO FIGHT THROUGH IN ORDER TO GET TO THE NEXT ONE, WH"}, {"Review": "This was a perfectly decent, well-crafted thriller, which I happened not to like very much, for reasons that have little to do with its craft or its quality. This sometimes happens, and it doesn't mean that others won't enjoy it. The plot is fast-moving and with some real surprises. The portrayal of alcoholism is great (although I would have liked it to go further into the more visceral details, rather than skimming the surface of the theme). However (and yes, I know it's trivial, but) the title"}, {"Review": " All aboard!!!  TRUST NO ONE  I have lost control over everything, even the places in my head. What? “Trust No One”? Why is that sign on the railroad of this review? Is this a “The X-Files” story? Oh, no, but certainly the motto of that iconic TV series is a good advice to anyone who dares to aboard this train of thought in this very particular journey to the minds of three women that you may think that they are quite different, but......maybe not......or maybe they do......mmh......remember abo"}, {"Review": "الصوت الرتيب لسير القطار الروتيني علي قضبانههل تحب الجلوس بجوار الشباك؟ هل تخيلت يوما حال سكان هذا البيت الجميل المطل علي قضبان السكة الحديد الذي تمر عليه يوميا؟قد تنسج قصصهم في خيالك، إن كنت واسع الخيالربما تخيلتهم سعداء..لتعوض ما تعانيه من وحدة، فراغ، إرهاق لأدمانك للشرابكتلك الفتاة..فتاة القطارتعال معنا في \"رحلة الصباح والمساء\"..في القطار..حيث يقل ريتشل من وإلي لندن يوميا، قطار الساعة الثامنة صباحا والسادسة مساءاتعال إن كنت لا تمانع سماع \"حديث الصباح والمساء\" من ثلاث شخصيات مختلفةثلاث نساء مخ"}, {"Review": "This is the perfect weekend read. I settled into the story and spent most of Sunday (a dark and stormy afternoon) reading away. Murder.Public Drunkenness.Infidelity. Unreliable Narrators.Treat Yo Self."}, {"Review": "*3.5*I feel like the main reason I didn't love this book was because of my expectations being way too high. I had heard that it was \"the next Gone Girl\", and I can completely understand where that comparison comes from. Later in the book, a couple of the characters actually reminded me very strongly of Nick and Amy, which kind of just seemed like too much. I wanted to read something along the same vein as Gone Girl, but not an exact replica. This wasn't an exact replica, but there were enough si"}, {"Review": "“I have lost control over everything, even the places in my head.”The Girl on the Train captivated me from the first to the last page. Everybody was so messed up: the alcoholic main character, the promiscous victim, the desperate houswive. And don't even get me started on their husbands.The unreliable narrator made this book so spectacularly intruiging. Everybody could've done it. Everybody had a motive. None of them an alibi. I figured it out at some point, but kept telling myself that the auth"}, {"Review": "This book was INTOXICATING. I loved every single second of it. While I had gone into this story thinking it was going to be packed with suspenseful scenes, the mystery was really in the storytelling. It was unexpected but executed SOOOO well. A+ use of an unreliable narrator that propelled the story way beyond what I had originally anticipated. Not only was it extremely thrilling and kept me intrigued the entire time, but I seriously appreciated how accurate the representation of alcoholism was."}, {"Review": "Seems like this train took everyone to Gushland, but I got waylaid in Mediocre-ville. Comparing this book to Hitchcock is just laughable. Okay, okay, it does start out with intrigue, as the girl, Rachel, sits on the train day after day, and obsessively peeks at a house where she can see a man and a woman moving around. She gives them names and imagines a perfect life and perfect marriage for them. This voyeurism is pretty cool. A great beginning.But I wish Rachel had stayed on the train. In fact"}, {"Review": "El hijo idiota de Gone Girl. Una decepción enorme. El libro empezaba bien, con personajes bien desarrollados y una trama que prometía mucho. Sin embargo, conforme iba leyendo se iba volviendo lento y pesado. Daba vueltas alrededor de lo mismo y no avanzaba. También era cansino la mentira como herramienta para mantener el misterio. Si ese recurso se usa algunas veces, no hay problema, pero en La chica del tren se usa siempre. La autora no sabía qué hacer para mantener al lector enganchado y utili"}, {"Review": "Looking for a great thriller? Look no further, the train has arrived. Paula Hawkins has written a tightly woven mystery with painful secrets and startling truths reveled along the way.The main character Rachael, is a heavy drinker, whose life is teetering on the edge. She has lost her husband, and her job. Yet, she continues to ride the train into the city every day, pretending to go to work. Along the way, Rachael creates a story about a perfect couple who's home backs the tracks, a home just a"}, {"Review": "Am I 'with' it now? I've read the *IT* book! When my own favorite Bay Area Sunday Newspaper prints \"The Girl on The Train\" as the number 1 Best Seller...I said to myself....\"GEEEEEEEEEEEEE, NOT YOU TOO?\" So--I started reading! It was time already! Having read 'no' reviews --I went into this novel with a blank canvas in front of me. Having been aware that half my friends on Goodreads have already read this --I managed to 'not' read their reviews (I promise to now). I didn't want to be influenced"}], "ID": "22557272", "Name": "The Girl on the Train"}