{"Name": "Murder in the Caribbean", "Image": "https://images.gr-assets.com/books/1546687352l/37531551.jpg", "Reviews": [{"Review": "It is always a pleasure to return to this series, although the author made us wait quite a bit for this new instalment! Nevertheless, here we have another compelling murder mystery that seems rather straightforward but of course isn’t :0)I just love Detective Inspector Richard Poole with his grumpy, choleric, unsocial, attitude, utterly out of his comfort zone in the idyllic Caribbean island of Saint-Marie. To see him once more bumbling on, making all sorts of social faux-pas, and yet doggedly focused on finding out who is the murderer, is so much fun! The rest of the team is back too, from Camille with her fiery frenchness to happy-go-lucky Dwayne.A very entertaining crime read, with a nice twist, for all that love Agatha Christie’s style."}, {"Review": "Murder in the Caribbean is the fourth original story from the creator and writer of the hit BBC One TV series, Death in Paradise, featuring on-screen favourite detective, DI Richard Poole.It's a contemporary crime mystery with fake jewels and murder. Set in the Caribbean(obviously) the scenic beauty of this book sucks you in. The plot is predictable yet quite engaging and refreshing. It's solid on the entertainment factor. Also, the humour is on point.It's a light read and nothing intense. I had fun trying to guess who's done it!It's a quick read. I finished it in two days and enjoyed it very much. Looking forward to read the other 3 books in the series."}, {"Review": "Murder In The Caribbean by Robert Thorogood is a marvellous, light hearted, gripping, contemporary murder mystery. It is the fourth book in the Death In Paradise series but can be read as a stand-alone.I have watched many episodes of the BBC’s Death In Paradise series with Ben Miller but had never read any of the books before. Oh how I have been missing out. The book had the same atmosphere as the series – a camaraderie between the lead characters which sees them bouncing dialogue backwards and forwards. There is a lightness of spirit in spite of it being a murder mystery. And then there is the warm, easy going nature of the Caribbean which contrasts with the stiff upper lip of the English detective.Having watched the series, I ‘knew’ what the characters and locations looked like, which added to my enjoyment.I tried to piece the clues together but failed (as usual) to solve the crime. I loved the way the crime and all the loose ends were wound up at the end. It was very reminiscent of Agatha Christie’s Piorot.A thoroughly enjoyable read. I shall certainly be wanting to read more Death In Paradise novels.I received this book for free. A favourable review was not required and all views expressed are my own."}, {"Review": "Rating between 3.5 & 4A nice return to the original team of death in paradise. This was an good story, that had a murder mystery which has been seen before but still had some nice wrinkles to it.Richard Poole seemed even more obtuse in this story as regards other people’s feelings so would assume the story is set earlier in season 1 of the show. There also only a single appearance of the commissioner very near the end and considering the type of case under investigation that was a bit if a surprise to me.It is a year since I read the last novel so can not really rate this against that one (or the other 2) so might have to do a re-read. Rating was pushed up to 4s it is a novel I would get back down off the shelf if I wanted a quick read with characters I like and a story that passes the time easily and entertained."}, {"Review": "The fourth in the series of whodunnits based on the characters from the Death In Paradise television series, based on the fictional Island of Saint Marie. By the same author, these are completely fresh stories, and they have the same four police officers, led by Inspector Richard Poole, seconded unwillingly from London, but still wearing his suit and carrying his briefcase. The characters and their relationships, the plotting and the writing, and the surprise denouement, together make an amusing and most enjoyable read.The plot? When a small boat blows up in the harbour, investigations link this deed to a jewel robbery in London twenty years in which a young Saint Marie man was shot and killed. And the only man arrested has just been released. And the deaths continue... "}, {"Review": "I received a paperback copy of this novel as part of the blog tour for publication day 27th December 2018, in return for an honest review.I enjoy the TV series, and was looking forward to reading this novel. It didn't disappoint at all. As with the programme, the plot keeps the reader guessing, assuming they know the answer then something jumps out that makes you rethink. I enjoyed the writing and plot. I loved the interaction between the characters, especially the developing friendships as DI Poole finds his place in St-Marie."}], "Genre": "Crime", "ID": "37531551", "Desc": ""}