{"Name": "The Couple Next Door", "Image": "https://images.gr-assets.com/books/1471502242l/28815474.jpg", "Reviews": [{"Review": "A baby is kidnapped while the parents are next door.Mayhem ensues. It’s a captivating story, I’ll admit. At first, at least. Then, it becomes too convoluted to keep its realism. So the story isn’t bad per se. If you don’t mind crazy, nefarious scenarios with outcomes that lead to more crazy, nefarious scenarios, you might just love this.I couldn’t.I couldn’t because it didn’t sound right to me. Especially not the ending. What a stupid one. The character would never have done such a thing. Not after what happened. But then again, I’m not the author. What do I know?I also couldn’t because the writing is horribly amateurish. It literally feels like a thirteen-year-old wrote this. Seriously, maybe middle grade mystery books would fit this author better. And then there’s the narration. Because the writing isn’t enjoyable, the narration, in consequence, isn’t either. Plus, I felt extremely disconnected from the characters. I didn’t even care about their circumstances. Sure, I wanted the baby found and brought back but, at some point, as the story becomes more and more convoluted, the focus sharpens on who is the kidnapper instead of where the baby girl is. The two are, of course, linked but the blame is put on so many people, while the baby remains unfound, that it starts to become ridiculous after a while. Can I just say it again? What a stupid ending. We all know what’s going to happen now. Who invented open endings, though? Curse them. Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"Review": "ZERO SPOILERS!!!! ZERO SPOILERS!!!! LESS THAN ZERO!!! SAFE TO READ!!!!It's 3am....I just finish reading this -'sleep-killer'-story....My final HONEST REACTION?.......**HYSTERICAL**!!!! SO MUCH FUN!!!!! I could roll on the floor laughing right now....SOOOOOO FUNNY .....GREAT WILD RIDE!!!!!!Really...I'm not sure if I'm laughing at myself - or the story - or both! A few random thoughts - as you know I'm not going to give anything away: ......This is a question for my women friends: When you are stressed, do you start cleaning? If ever fueled with anxiety, do you need to clean something, even if your house is already spotless? I started laughing - - (to myself of course --my husband was sleeping)...when the character, Anne, had a 'cleaning episode' moment. \"She has to keep busy. She starts in the front entryway, cleaning the antique grate that covers the air duct. The scrolled ironwork is covered in dust and had to be scrubbed by hand. She gets a bucket of warm water and a cloth and sits down on the floor by the front door, begins to clean it, getting deeper into the grooves. It calms her\". That excerpt was simply a fun 'comic' release!!!I've been guilty of the 'cleaning-crime' on occasion. :)......Lots of theories to choose from in this story .....( pick your favorite): ---a baby is gone - - kidnapped her from the cribWho could it be? And why?:  ---the mother who has been suffering postpartum depression? Maybe she killed her? Or maybe the father arranged the Kidnapping for ransom since his business was in serious trouble? Or maybe the babysitter who cancelled at last minute was guilty? Or maybe the couple next door - with their messy entanglement to the parents of the missing baby are the kidnappers? Or maybe the the entire neighborhood is guilty? Regardless ..... Shari Lapena's novel, \"The Couple Next Store\", is a very fast read...engaging....a FRICKIN KICK OF FUN!!!!"}, {"Review": "3.5 starsA swanky rich couple have a six month old baby. The babysitter cancels at the last minute, buuuutt the husband really wants to go to that dinner party next door with the hottie neighbor. He convinces the wife Anne that it will be just fine to leave the baby by herself and check on her every thirty minutes.\nThey return home to find the baby is now missing. \nThen all the secrets...gotta have secrets. Mom is struggling with post-partum depression. Could she have done something to the baby and this is just an elaborate cover-up? Dad, Marco..the boy from the wrong side of the tracks that lucked up and married Miss. Money..is he telling all the truth and only the truth?\nThere is ALL kinds of drama up in here, plus evil, stupid characters. I totally ate it up. The book reads so frigging fast and some of the twisty turns had my head reeling. It's one that you want to read it one sitting even though you know there is no way the ending can do it justice. Sometimes I like a Lifetime movie just waiting to happen.\n"}, {"Review": "THE COUPLE NEXT DOOR is an outstanding debut psychological thriller novel from author Shari Lapena, and one of the best reads I have read this year! This novel, a child-abduction case, races along at an amazing speed, full of twists and turns, totally gripping the reader for the suspense ride from beginning to end. I kept flipping the pages as I had to know what had happened. I loved it! “They left their six-month-old baby (Cora) home alone and went to a party next door.” But with the monitor on next door…they would hear everything!Anne and husband Marco Contis are asked to their next door neighbors, Cynthia and husband Graham Stillwell for a dinner party, to celebrate Graham’s birthday. No” babies” allowed, so Anne hires a babysitter, who cancels at the last moment. Now what? How could she possibly go? But Marco said it would be fine, as it is only next door. They can bring the baby monitor and take turns checking on the baby every half hour.Marco was having a good time at the party and wasn’t in a rush to leave. Anne on the other hand suffered from postpartum depression after the birth of their daughter, and was anxious to return home. Then at 1:00A.M.when Anne and Marco left the party, they find the front door partly open…but she had locked it! Anne races up the stairs to the nursery…and now a parent’s worst nightmare –the baby was GONE!A frantic call to the police brings detective Rasbach and detective Jennings to the scene, to uncover the truth and find six-month-old Cory.So many lies, betrayals and cover ups in this novel. How well do you know the people closest to you?I am not going to say anymore as I don’t want to give the plot away, but this is a very riveting and powerful story. I loved it. All I can say is read this book… I don’t think you will be disappointed.Many thanks to Shari Lapena, Random House UK, Transworld Publishers via Net Galley for my ARC. "}, {"Review": "Wow . . . what was that ending?! OK, let me back up.There's no denying that this is a compulsive page-turner. At the heart of the story is a frenzied pulse running rampant and it’s addicting. Ending chapters with shocking revelations, casting doubt and making me waver on my belief of who was behind it all, time and time again, was pure magic. I read this book over the course of one day, simply because I couldn’t bear to put it down. I had to know who took baby Cora and WHY.With that being said, this is a case of a highly readable story being tainted by the ridiculousness of it all. If you took away the frantic pace, I’m not sure where that would have left me. This wasn’t a story that focused on the depth of the characters or even really forging a connection with them. It was simply about unraveling the truth.Do I believe that anyone could’ve pull off this scenario? Absolutely not. The probability that all of the pieces would fall together like they did in this situation is hard to swallow; in fact, suspending disbelief is a requirement. Who would go to this extreme?! And the ending . . . I’m just gonna say it was crazy and leave it at that.Is this the best book I’ve ever read? No way. Was it entertaining? Absolutely. Would I recommend it? Hmm, that's a tough one. Maybe."}, {"Review": "My reviews can also be seen at: https://deesradreadsandreviews.wordpr...I still haven't listened to very many audiobooks. While I prefer to read on my e-reader or read a book, I really do like having the option to listen to an audiobook now and then. It's a nice change and I can close my eyes (as long as I'm not driving). But I don't close my eyes often as usually it doesn't matter how exciting the audiobook is, I could very well fall asleep.However, I didn't have that problem with this one. I was pretty into it and it was very unlikely that I was going to fall asleep.Anne and Marco Conti are new parents to a six-month-old baby girl named Cora. It seems they have it all. The are financially comfortable, they have a great marriage and now they have a beautiful baby.Everything is perfect.Since having Cora, the couple don't go out very often. So when their friends/neighbors invite them over for a dinner party they are excited to go, well Marco is. Anne Conti would prefer not to go, especially since the neighbors, Cynthia and Graham Stillwell don't want children at the party. Anne agrees to go and they schedule a babysitter. But the night of the party the sitter cancels leaving them with no one to watch Cora. Anne tells her husband she's fine staying home with the baby. Marco really wants her to come, he thinks it would be good for her to go.\"It will be good for you to get out, you know what the doctor said\"Eventually Anne agrees to go, but only if they take the baby monitor and check on Cora every half hour. They arrive at the party but Anne just can't seem to enjoy herself. She has some wine but even that doesn't help. She's miserable...especially as she watches her \"friend\" flirt with Marco. Cynthia is gorgeous and beside her Anne feels horrible about herself, she's very insecure about the baby weight she is still carrying.On top of that, lately it seems that something has been off with her husband. She's not sure if it's her imagination or something else. Is he keeping something from her?By one in the morning, Anne has had enough and wants to go home. Marco wants to stay for another drink. Quickly she becomes tired of waiting and tells him she's leaving with or without him. Marco decides to go home with Anne.As they walk up to their from door, they notice that it's open. Anne is positive she shut the door when she was last there to check on Cora.They both immediately run up the stairs and into the baby room. They look into the crib and Anne screams.....I will leave it at that as I really don't want to spoil anything.I really enjoyed this audiobook. A great domestic suspense that honestly pulled me in right from the start. The plot was great and I thought the story flowed well. I didn't have any trouble keeping up or keeping track of who was who like I sometimes do with audiobooks.I'm finding that the right narrator can make all the difference when it comes to listening to any audiobook and I think the narrator for \"The Couple Next Door\" was great.I look forward to more from Shari Lapena!"}, {"Review": "It all started with a “what were you thinking?” moment! Then rapidly morphs into a parent’s worst nightmare. Anne and Marco have a dinner party to attend next door when the babysitter cancels at the last moment. Of course, being responsible parents, they have no choice but to cancel dinner. Right? Well...no! They make the unbelievably foolish decision to still attend. Their genius solution? Simply leave their 6 month baby home alone and just take the baby monitor! What!!?😳As you may have guessed, that superb and well thought -out plan goes terribly south!This was an engaging read that I finished very quickly (just a couple sittings). Not the twistiest thriller I’ve read, but if you’re looking for a fast, entertaining, read this may be the perfect fit. Maybe a beach or airport read! Then again, I’m pretty late to the party on this one, I may be the last one out there to read this book! But if this one is still sitting on your shelf collecting dust (like it was mine) time to pull it down! It's worth it!"}, {"Review": "3.5 starsThe first 75% of the book was terrific--lots of twists and turns, well-paced, interesting character development and relationships, I was eager to return to my audiobook every time I was away from it. I also loved that contrary to most thrillers that save the big reveal for the end, in this book, you find out who kidnapped the baby halfway through the book--so you get to watch everyone scramble and unravel from there on out. I liked it so much that I was mentally composing my 4-star review while I listened.Towards the end, things get a little messy, however, and there were a few too many convenient connections and red herrings to make it as satisfying as it should have been. The story and plotting was so good, but the impulse to make it \"and THEN there's THIS part to make you even MORE surprised!\" kind of ruined it. Okay, not ruined it, but it took some of the joy out of it. I really did like the first three quarters of the book, though. In a year of mostly disappointing thrillers, this is one of the best of the bunch. It's a shame that it got a bit too convoluted towards the end, but I'll still look forward to her next thriller.I'll come back to finish off this review with audiobook notes later, but floating it for GoodReads Choice Awards since I don't think I ever published this to the feed. It's still among the better of the thrillers published this year--I'm side-eyeing some of those other picks. But what else is new, hah.An audiobook review copy was provided by the publisher."}, {"Review": "Cynthia and Graham invite next door neighbours Anne and Marco to a small dinner party but tell them not to bring their small baby. Cynthia and Graham, themselves childless, are not child-friendly. The pre-arranged babysitter cancels at last minute so Anne and Marco decide, reluctantly. to go anyway, leaving baby Cora alone, taking a baby monitor and agreeing to take turns checking on her every half hour. So far so good.....until....Anne and Graham return home at one in the morning and to their horror discover the front door open, the crib empty and Cora nowhere in sight. The police are called and so this dreadful piece of writing continues.Where shall I begin – it's difficult to pinpoint one particular aspect of this novel as it is all so dreadful. Anne, suffering from post natal depression is constantly wringing her hands, turning sickly pale, sobbing, weeping, crying whilst pacing the floor; Marco hangs his head, covers his face with his hands and turns a paler shade than his wife........\" A pallor that is quite striking\". They communicate “with their eyes”. Here we have two distraught parents, whose baby is missing; they are wondering if she has been kidnapped, and this is what Marco tells his wife:…......“I don't know! Maybe he panicked. Which scares the hell out of me because then maybe he'll kill Cora and dump her somewhere!” This from a husband in an attempt to make his wife feel better!Our intelligent-eyed detective goes next door to speak to Cynthia and Graham. Cynthia is described thus:“…..She is perfectly made up, even though someone had stolen her guests' baby while they were at her house late the night before.......”Could anyone tell me the relevance of this peculiar sentence? This whole book is full of this sort of rubbish.The characters are caricatures: the depressed handwringing wife-from-old-money; the supportive but uncomfortable husband who is never good enough; the neighbours next door who could be Up To No Good. Then we have the wife's rich parents who want to take control, and finally Mr Plod in the shape of Detective Rasbach who has intelligent eyes – well of course he does, he couldn't be a detective without them. Oh please. Written in the present tense this reads more like directions for a play than a book. Every single thing is laid out for the reader, every angle, every possibility, every theory, and reasons for certain police procedures. Absolutely nothing is left to the imagination. This is absolutely dreadful; it is so bad I tried to read it as a spoof but even I can take only so much. I feel as though I am being repeatedly hit with a sledgehammer. I don't have the stamina to read any more of this truly awful book.Thank you Amazon, for a complimentary copy - but for you I would not have known how truly, truly awful this is."}, {"Review": "Wow! This is one of my favourite reads of 2016 and is long-listed for my Top Ten Books of 2016. This totally took my breath away and from start to finish I was totally lost in this book and the desire to know the truth. I HAD to know the truth. I guessed the ending so many times, should not have bothered, it was brilliant and had so many twists I was feeling motion sickness!Honestly, check out the blurb:You never know what's happening on the other side of the wall.Your neighbour told you that she didn't want your six-month-old daughter at the dinner party. Nothing personal, she just couldn't stand her crying.Your husband said it would be fine. After all, you only live next door. You'll have the baby monitor and you'll take it in turns to go back every half hour.Your daughter was sleeping when you checked on her last. But now, as you race up the stairs in your deathly quiet house, your worst fears are realized. She's gone.You've never had to call the police before. But now they're in your home, and who knows what they'll find there.What would you be capable of, when pushed past your limit?You pop next door to a party, then after checking numerous times your baby is gone. The baby YOU left alone. Imagine the scope of emotions that you go through? OMG, I could NOT imagine as a parent myself. I would be sick, terrified, confused, delirious...and they are. This is a stunning novel that has so much tension running through it.The plot is fantastic, nothing at all is clear-cut in this book and seriously the number of twists and reveals were bloody brilliant. It was like being slapped over and over again! I could go on and on about this book but all I can say is I loved it, I loved the journey, it had me on edge the whole time and I highly recommend to anyone looking for a read that hooks you and holds you. 5 stars!Many thanks to the publisher for my copy of this book via NetGalley."}, {"Review": "HA! What a wild and \"crazy\" ride!Sometimes when I read a crime-thriller, I become bored with the pace or exasperated with the clues and detective types, but not so this time. Each character had their own complex personality, and/or presence here, and there is never a dull moment.Without giving anything away, I'll just say, be prepared for a shocking crime and horrendous secrets revealed, some of which, you will find terribly disturbing!I entered this mystery not knowing anything about the plot so was totally surprised at what happens early on during a neighborly get-together; and have to admit, I did have an inkling of who the culprit might be (off and on) a couple of times, but the story never lost my interest or its momentum.This fast-moving intense read has a bit of everything.......including evil. (he.he.he.)"}, {"Review": "One star is for me because I finished it. One more star because the author came up with some good character names. Cora Conti, Cynthia Stillwell, Detective Rasbach I'm looking at you.Well, that's about all the nice nice I can make.I can't get past the clunky, amateurish writing! If I heard \"Marco said\" \"Anne replied\" \"Cynthia stated\" ONE MORE TIME....oh my gosh. If you, as an author, are going to write a book that is almost entirely dialogue, wouldn't you make sure you were a damn fine dialogue writer first? It was killing me.There is no mood, no setting (I can't even tell you what country this was set) and no tone. At all. Oh, and zero character development which is kind of crucial to psychological suspense.Q Come to think of it, why did I finish this book? A I like to rubberneck at train wrecks."}, {"Review": "*Thank you to Netgalley and Random House UK, Transworld Publishing, and also to Shari Lapena for my ARC in exchange for a fair and honest review*Goodness me, this book was so full of twists and turns, I don't know whether I'm on my head or my heels right now!Imagine the horror of discovering your 6 month old baby has been abducted from her crib in the early hours of the morning. Imagine also the myriad of emotions you'd experience. Well, that would be bad enough, but what multiplies that horror here, is the fact that baby Cora's parents - Anne and Marco Conti, had left her alone while they attended a dinner party next door. Their next door neighbours, Cynthia and Graham are childless by choice, and insisted that Anne and Marco didn't bring Cora, because they can't stand her crying - so when the babysitter cancels, Marco persuades Anne, (against her better judgement) to leave Cora alone, and insists she'll be fine if they check on her every half hour. I won't give anything away other than that.Detective Rasbach is the investigating officer, and it soon becomes clear that all is not as it seems, and that everyone involved is a suspect in some way, with secrets and lies aplenty.Well, what can I say? This book was truly gripping. It was hard to know who to trust, and in fact poses the question \"How well do you really know ANYONE\"? Do you really know the inner workings of someone else's mind, real deep down, where dark thoughts may lurk and take shape? I just couldn't predict what was coming next, as the plot took off in various directions, with twist after twist. It was quite simply, brilliant! Yet another great novel that screams to be noticed - and noticed, it WILL be!"}, {"Review": "First of all, I'm a skeptic by nature. By going into a thriller, I go in grudgingly knowing I'm going to be critical. Suspending belief shouldn't be required for a story done well. As I'm reading, this is the constant chatter going on in my head recalling Elaine in a Seinfeld episode - \"maybe the dingo ate your baby.\" I'm thinking anything is possible at this point - including the dang Dingo!This is warped. Let me preface it. A baby is missing. Stolen from her crib while her parents sat at a dinner party next door. An investigation begins. Betrayal and lies are revealed. Nasty characters emerge. A kidnapping gone from bad to worse. A bunch of suspects who somehow get entangled in the mess. And it's twisted and contorted and what you think is straight forward is backwards.And perhaps, just maybe, the dingo is guilty. Or you are. Or heck, maybe I am. In the end, it seemed a little hard to grasp that much conspiracy. A fun read nonetheless. 3.5*"}, {"Review": "Most of my friends loved this, but I wasn't as wrapt. At all. Yes, very, very edge of your seat worthy reading, but the end result was a little flat for me. As a debut, this was brilliant work and I commend the author for writing a book that most of us just could not put down.I felt it was a train wreck of completely messy, unscrupulous and totally moral lacking characters! I know we are not meant to always love the characters we read about, but I was eye rolling many times. Marco. What a spineless man, he had zero gumption! Richard I wanted to strangle, what a smug condescending liar! The fact that he was always referred to as Anne's father frustrated me and I felt that Anne deserved so much better. Cynthia was a witch and Anne lacking backbone as well.I think what also annoyed me was the money side of things. What people will do for it and the higher that bar is raised regardless of the consequences! But more troubling, the actions of the rich.Ultimately I could not put this down due to the amazing suspense, I was often reading this while standing up at times due to circumstance, but I was also pacing, which is a sign that I couldn't put it down. The only thing I didn't love was the storyline, it felt contrived and a little clichéd in a way. I'm glad it was a winner for so many other readers, this debut delivered suspense in spades!"}, {"Review": " \"They held onto each other, weeping. Two shattered people, one of them a liar.\" I was really enjoying this book! Lots of twists and turns and untrustworthy characters, right up until the last 20 pages, which blew it for me.Anne and Marco have a beautiful baby girl named Cora. One evening their babysitter cancels when they are due to go to their next door neighbours' for a dinner party. Marco says it'll be fine, they'll take the baby monitor and check on her every half an hour. What could go wrong?When they return from the party it is their worst nightmare. Cora has been kidnapped - who could have taken her, and why?I had my theories to start with, but as the book went on and more secrets were unveiled, I realised how many secrets these characters had, it was crazy! Anne, Marco, Anne's parents and the neighbours are all secretive and deceptive. I was shocked numerous times - this book was going to be a solid 4 star read.Then the ending happened. (view spoiler)[ Anne goes next door and murders Cynthia. After everything had been resolved?! After her dad's affair with Cynthia had been unveiled and he had gone to prison - there was no real reason for this random violent outburst?! Anne has her baby back - what was the point? On top of that, this ending is so abrupt we don't see what happened after - did Anne go to prison for murder?  (hide spoiler)] I understand the need for a dramatic ending, but I like my books tied up with a nice little bow and this ending just blew the whole thing wide open.3 stars ***************************************************************Um, what even was that ending?!"}, {"Review": "I highly enjoyed \"A Stranger in the House\" so I was very much looking forward to reading Shari Lapena's previous novel \"The Couple Next Door\". As expected I thoroughly enjoyed it, I raced through the intriguing pages and I have to say that it is neck and neck as to which I preferred the best, as both were hugely entertaining.It does takes a while to get used to the authors writing since she uses 'third person present tense' but once you adapt to it you soon fly through the story, it was very easy to follow and with regular twists and turns to keep you occupied this is a definite page turner that will keep you reading well past when you should be!Anne and Marco Conti attend a dinner party at their next door neighbours - Cynthia and Graham's house, leaving their six month old baby Cora at home, after their regular babysitter called to cancel. Nothing should go wrong - it's only next door and they planned to make half hourly checks and the baby monitor would alert them to Cora waking up. However, after returning home after the party Anne finds the baby missing. Will Anne's post partum depression be blamed for Cora's disappearance or is there more sinister lies and betrayals lying at the heart of this frightening nightmare.This truly is a riveting mystery thriller and although I did suspect who may be more involved than they were letting on, I did find it exciting and intriguing to reach the fantastically plotted end.Another fabulous five stars for a compelling, well written and suspenseful book that I highly recommend to mystery crime readers young and old!Thank you kindly to good friend and fellow reader Rachel Hall for her copy of the book. "}, {"Review": "Anne and Marco's babysitter cancels at the last minute when they have a dinner party next door. Marco talks Anne into leaving their six month Cora alone because they can bring along the baby monitor and check in on her at half hour intervals. When the two arrive home shortly after 1 am though Cora is no where to be found and the police are called in to investigate. As the investigation proceeds it becomes increasingly clear that the kidnapping was orchestrated by someone close to the couple or the couple themselves, leading Anne to doubt herself. I did like the writing, though I could've done without the switches in POV. Also (view spoiler)[ it felt kind of out of no where when we found out Marco was the one who had his daughter kidnapped even though the police had been bouncing the idea around already until we got to that point it just felt that through Marco's POV passages that he knew nothing, it didn't feel like it was hinted at or built upon  (hide spoiler)]. I felt that way about a lot of the twists in the book like they were just there for the sake of it and kind of had a hard time suspending my disbelief. Also (view spoiler)[ no offense but I kind of resent the whole mental illness makes people violent thing especially when people try to involve DID (or MPD before DID was a thing). Like yeah people dissociate that's real but they're not going to do shit that they hadn't been thinking about or had in their heads to begin with. Anne unraveling to the point of murdering at the end just got on my nerves because it felt unnecessary and it's just a pet peeve when people's mental breakdowns or history of mental illness leads them to homicide and/or violence  (hide spoiler)]. Anyway an okay thriller but personally wasn't very impressed by it and lost interest as it progressed further into the story."}, {"Review": "The Couple Next Door by Shari Lapena is a 2016 Pamela Dorman Books publication.  A hypnotic and atmospheric thriller.This story starts off with a familiar- ripped from the headlines- setup where a couple, Ann and Marco, decide to leave their young daughter home alone while they attend a dinner party next door. They bring the baby monitor and check on the baby every half hour. However, when they return home from the party they discover the child has been kidnapped. After reading the first chapter of this book, I heaved a heavy sigh, trying to stifle an eyeroll. This again? I had read a book, not all that long ago, with a nearly identical plotline. However, it wasn’t long before the story morphed into one very twisted family drama that kept me glued to the pages, especially in the last quarter of the book, where the twists were relentless. The buildup is a little slow at first, but the atmosphere is very edgy and I admit I fell into the author’s clever trap, playing along with what appeared to be the usual child kidnap case, with the parents being suspected and all those delicious skeletons falling out of the closet. But, I never could have guessed how it would all play out. I love psychological thrillers and have read them off and on for many years. The genre seemed to change very little until the mega success of ‘Gone Girl’ caused a spike in its popularity. Now, I see a whole new, fresh crop of debut novelist, giving the genre a little facelift, which is a very welcome change. But, for me, I thought this one was a nice blending together of the traditional, ‘old school’ style with the new and improved structure. While I would love to gorge myself on PT, they tend to work better for me if I space them out of bit. Thankfully, I passed on this one when it was first released, taking a slight break from the genre, so I didn’t burn myself out on it. As you can tell from my attitude concerning the first chapter, I definitely needed that space. Thankfully, the story took off and gave my brain a real workout. I thought it was a wickedly fun mind trip even if it wasn’t the most properly constructed novel I’ve ever read and the pacing wasn’t always pitch perfect. I’ve confessed many times that I tend to be a bit jaded when it comes to thrillers, often guessing the plot twists well in advance, but, there were so many whip smart turns here, I never could have seen all the twists coming, even if I had my suspicions about one or two of the characters. So, at the end of the day, it all boils down to how engaged or entertained I was and I have to say, I thought this was a pretty solid thriller and I enjoyed reading it. 4 stars"}, {"Review": "Dense particles of deception are scattered in every nook and cranny. What you think that you see with your own eyes is not necessarily what you see. Anne and Marco Conti must really have an intense thing for dinner parties. Marco talks Anne into leaving their newborn infant next door with a faulty baby monitor. They will take turns checking on her every 30 minutes. Sounds like a great plan, huh?Our model parents have also taken to tipping back on the wine goblets, too. Not a sober soul in sight. When Anne reaches the baby's bedroom after the last tag-off, Baby Cora is missing. The parents are in shock and call the police. A sobering situation, indeed.Shari Lapena presents a storyline that has received kudos from many readers. This one does have tension and uncertainty with so many zigs and zags. However, let's look closely at the cardboard characters that need propping up on every page. Explanation after explanation is necessary to give depth to them. Their movements and actions are so contrived like constructing figures that are labeled \"Insert Here\". Even the police sit on the sidelines waiting for the guilty to come to them. I won't go into detail so as not to spoil it for others. You may certainly see this one with completely different eyes than I did. I kept turning pages thinking that it's got to turn the corner about now. Kinda left me standing on a dark street with no taxi in sight. Maybe it'll keep your metering running.....maybe."}, {"Review": "Yes, yes yes yes yes!I love it when there is a up and coming author who just produces such an amazing book it looks like they have been a best seller for years. I am not kidding, this is truly a remarkable read.I know us reviewers, we say things like 'twists and turns' 'unputdownable', stayed up all night to read it, but I tell you, its so true.If you are a passionate reader, and I know that you are because you are on Goodreads writing reviews, then you will certainly understand my gushing on this book.Secrets.LiesDo you know your partner? really?Do you know your neighbors? really?Do you know your Inlaws? really?Just how do you know the good people from the bad?I was hooked, yes hooked from one page to the other, needing to put this book down but just couldn't. I had other things I needed to try and do, but this time I was happy I had a bad back and had a good excuse to be lazy and sit and read. I am aware l sound like I am gushing and people do comment sometimes, but an avid reader will know when they enjoyed a good book they just have to get out their foghorn and shout it out the world.I can't wait for a chance to read another book from this author.My thanks to Random House UK, Transworld Publishers via Net Galley for my copy"}, {"Review": "So there's a couple named Marco and Anne Conti who have a baby called Cora. They are deprived of outgoing social activities, and when the neighborly couple are inviting the Conti couple to a party, it's hard to resist.There are some twists involved in the plotting of this book one or two of which are ponderous. Like, the babysitter cancels at the last moment. That means the baby is going to be alone. The latter is still going to be monitored audibly. So the young couple go to the party.I gave the book 4 stars because the story is easygoing and there are rarely a dull chapter. Else wise there is nothing groundbreaking concerning this thriller. Having said that, I got thrills that were easily my money's worth. Check out this book. It was worth reading."}, {"Review": "Pues oye, lo he disfrutado un montón.No soy mucho de leer novelas de este género, pero he de decir que cada vez estoy leyendo más y estoy encontrando una vertiente más que interesante que de primeras no era mi favorita. He leído varios comentarios respecto a la voz narrativa, porque no es muy utilizada en este tipo de novela: es en tercera persona, sí, pero narra en presente. La verdad es que yo estoy acostumbrado a leer novelas en presente, aunque en esta ocasión había alguna cosa rara (como si el narrador supiera absolutamente todo, pero a la vez nada, y estando en presente era extraño).La pareja de al lado es una novela hecha para devorar. La he leído en menos de 24 horas porque bueno, vale, sí, la edición ayuda bastante. Pero he de decir en mi defensa que no es que tenga mucho tiempo para leer estos días. El estilo de Shari Lapena me ha enganchado. Siempre sucedía algo, por mínimo que fuera, y siempre te hacía preguntarte sobre el motivo. ¿Es una pista falsa? ¿Es este personaje el culpable o realmente es solo un peón en un esquema mayor? Me ha gustado que las revelaciones me pillaran desprevenido. Algunas cosas las veía venir, pero la manera en la que se narran y todas las explicaciones me convencieron bastante.Normalmente suelo tener un gran problema en las novelas de misterio, y es que no me suelen convencer las razones o los desenlaces. En este caso la verdad es que estoy bastante satisfecho, y el final es de esos que te hacen tener ganas de aplaudir. Maravilloso.Una de las cosas más positivas de esta novela es que, como digo, no paran de suceder cosas. Pero a la vez tenemos tiempo para conocer a los personajes, porque he terminado el libro pensando que conocía a Anne y Marco. Me he sorprendido con los giros de los personajes secundarios y hay muchas subtramas que luego demuestran estar interconectadas de manera sorprendente, y eso ha sido wow.Lo que es el misterio está muy bien llevado, porque aunque se va solucionando poco a poco, parece que tienes una visión general de lo que pasa aunque no entiendes exactamente qué. Esa intriga es lo que me ha ganado. La pareja de al lado es directa, no se anda con chiquitas. Además, todo lo que es la trama del misterio y los demás elementos que la rodean me han convencido también.No sé, me ha dejado una sonrisa en la boca. La autora ha jugado en varias ocasiones conmigo. Los personajes inestables siempre son un punto fuerte en este tipo de novelas, pero también lo son los que caminan por seguro. En este caso tenemos ambos, y sorprenden del mismo modo.Recomiendo mucho su lectura porque es ágil, llena de sucesos, se tratan temas interesantes y en general la dinámica está bastante conseguida. Si queréis una novela rápida pero con un misterio decente, es una buena opción."}, {"Review": "Shari Lapena has tapped into a universal fear among parents.  Just imagine,  your 6 month old baby is sleeping upstairs, the babysitter has cancelled at the last minute and the dinner party you have been invited to attend is literally just next door, one shared wall away.  You can take the baby monitor with you.  No problem.It is in keeping with human nature I think,  that once tragedy strikes we are all inclined  to sit back and say “How could they have possibly?”  Don’t misunderstand me, I am certainly not endorsing that this is acceptable behaviour, however we do all get comfortable with things, including our own neighbourhoods.   I know people that live within arms reach that have infants that have been left sleeping upstairs while they, with monitor in hand, attend  a get together in their next door neighbour’s backyard.  No harm done.  And what about those of us who quickly scoot into the variety store while their child remains strapped in the car seat.  What could possibly happen?   Again, I personally have never done these things, but I do remember shopping in a large mall one day while my kids were still quite young.  I got distracted, in a bookstore, of course, and when I looked up my youngest daughter was missing.  The gods were smiling on me that day, I located her within five minutes but man those five minutes lasted a lifetime.   What I am trying to say here is that there is an absolute abundance of day to day happenings that are fraught with opportunity for the would be abductor.   Anne and Marco Conti have gone next door to attend a dinner party, leaving their six month old daughter asleep upstairs.  They have the baby monitor and have agreed that one of them would slip out every half hour to come home and check on Cora.  The evening progresses and Cora is fine each time one or the other parent has checked on her.  Both Anne and Marco have over imbibed and when they finally leave the party a little after 1 a.m. they are shocked to see that their front door is ajar.  Anne was sure she closed and locked it last time she was over.  They rush upstairs to find an empty crib, no Cora in sight.  Their ride to hell and back has just begun.  Lapena plays out the next few days with a deft hand, as we, the reader, learn more about each of the parents, their next door neighbours and extended friends and family.  Cleverly plotted and  tensely paced, with many a viable red herring, The Couple Next Door will keep you turning those pages and thinking about things even after the last word has been consumed. "}, {"Review": "I've read this book before.Well, ok, not this book, but I've read many of its fraternal twins, and the gene pool is starting to feel a bit shallow to me.The Couple Next Door has an interesting hook: a six month old baby disappears from her crib while her parents are next door at a dinner party. It reminded me of the Madeline McCann case, and I was interested to see how the plot would develop. However, reading this book was at times like playing thriller bingo. The couple that seems perfect from the outside but is hiding deep, dark secrets? Check. A hyper-emotional, weak-willed woman who struggles with basic life skills and is increasingly made to feel unattractive and irrelevant by her seemingly loving husband? Yep. A cast of unlikable characters and a local police force that can't solve its way out of a wet paper bag? You bet.But this book has problems beyond being derivative. The story starts strong, but deteriorates as it progresses. The writing is just okay. Marco is a uniquely unsympathetic character, and I was so disappointed at the author's decision to portray him as a victim. What had the potential to be a compelling plot dissolves into a macho pissing match between Marco and his father-in-law. Poor, missing baby Cora gets lost in the fray. While this book certainly isn't horrible, it's impossible for me to recommend when there are so many other, similar thrillers that are executed better.Thank you to both the publisher and netgalley for granting me access to this title"}, {"Review": "A Sagrada FamíliaHá:Uma bébé desaparecidaUm casal que sabe tudo, mas nada pode dizer!Um marido gastador Um avô materno ricoUns vizinhos depravados E uma mãe perturbada capaz de sabe-se lá bem o quê?!...E é basicamente este, o berço da chama que ateia o rastilho deste magnífico thriller!...Além disso, há mais:\"O Casal do Lado\" é também um mergulho no poço Amor-Ódio que dá pelo nome de Família.Aquela amalgama de seres heterogéneos que se chocam, julgam, agridem, usam, abusam... e pouco ou nada se entendem!Um caldo hostil onde, por incrível que pareça, paira por lá o amor, apreensivo, ansioso, titubeante, interrogando-se a cada instante: \"será que estou mesmo bem aqui?!\"...Ah, o Amor, o Amor... É mesmo um sentimento ousado e resistente!!!\"O Casal do Lado\" é uma leitura que nos remete para a família com todos os seus segredos e falta de comunicação -- um agregado de seres ligados por correntes invisíveis, que partilham uma solidão acompanhada!!!“No matter how many people care about you , if you can't be open with them about who you truly are, you're still alone.”E a sua componente thriller faz dele um page turner -- uma leitura compulsiva pejada de twists e turns, daquelas que é uma seca ter que poisar!...Gostei muito -- é um 4+++ 😊😍"}, {"Review": "\"He is very interested in seeing what he will find at the murder scene.\" How does this sentence make you feel?A. So riveted! Give me 300 more pages! B. I'd rather eat a loaf of white bread than read more.C. Someone made money with this caliber of writing, and yet my 630-page manuscript about holographic forest animals remains unpublished?!If you answered A, then The Couple Next Door is the book for you! With all the intricate detail of a cinder block and sophisticated syntax of a sedated toddler, this book will leave you thinking, \"I just read some sentences!\" If you answered B, then you're in my boat, and you likely won't find this book worthwhile. As you may have gathered, the problem is not as much with Lapena's plot concept as it is with her writing. The story itself actually has plenty of potential to be exciting, and, despite my ennui with the diction, I kinda wanted to know how it ended. Give me a missing baby and I'll stick around to find out what asshole took it.But the characters were extremely milquetoast. Their inner dialogues consisted of asking themselves questions like, \"Can this be?\" and \"What should I do?\" ad nauseam. There's about as much attention to background as there is in a passport photo. Like, I don't have any idea who these people were. If you don't believe me, let's try something. I'm going to open to a random page. 142? Perfect.\"Marco gets into the Audi and drives. But not to the office. Instead he takes the nearest exit and drives out of the city. He weaves in and around traffic; the Audi is responsive to his touch.\"That is the sound of paint drying. I can't believe a car does the thing its driver wants it to do. It's almost like he...is in control...of the vehicle? If anyone would like to look me in the eyes and tell me that's good writing, PM me and I'll give you my Skype info. Oh, and if you answered C, also PM me with a copy of that manuscript because it may very well be better than The Couple Next Door."}, {"Review": "Find all of my reviews at: http://52bookminimum.blogspot.com/I read this book because everyone was reading it. We’re talking EV.ER.Y.ONE. Think I’m kidding? \nYep. I’m still 30th in line at the non-porny library (and yes I just removed this request – I’m an old lady and forget these things sometimes). Since this is a mystery you’re going to get an even crappier review than I normally barf out. The basic premise of The Couple Next Door is that Marco and Anne’s babysitter cancelled at the last minute due to a family emergency, leaving the couple all dressed up with nosomewhere to go. Not willing to let a new baby cramp their style, the two decide to leave the baby monitor as babysitter and a promise to rotate shifts every 30 minutes in order to make sure said baby is okay so they can still go next door for dinner and draaaaaaaaanks . . . . \nSave your breath if you feel the need to tell me how horrible I am for judging this couple because #1 I know I’m horrible, #2 it’s a book so calm yo tits, and #3 I would still judge these a-holes the same if it was real life and I give zero shits.So anywho, Anne and Marco return home around 1:30 a.m. to find their door partially open and zero baby in the house. I was a bit worried for a minute when the detective showed up because Anne’s reaction was. . . . \n“When a child goes missing, are the parents usually the prime suspects? Surely not.”\nSeriously Anne??????\nBut luckily the detective was not a dummkopf and he totally thought they offed their own kid. I will say I didn’t like the direction of everyone thinking “time was running out” in order to find the baby alive. Obviously I’m not an expert, but I am a geezer and every time a baby kidnapping story has been on the news for the past 412 years it’s been some crazy bitch who stole it in order to raise as her own who was the culprit. Murder doesn’t usually seem to be the M.O. in those cases. But I’m probably wrong. Bottom line is this was like watching a decent movie on this channel . . . .\nYou know what I mean, right? There’s bad stuff on Lifetime and then there’s awesome stuff . . . . \nAnd then there’s stuff like this. The pages turned quickly and the story flowed, but it’s not something that will change your life. Dat ending tho . . . . \nI mean Gimme A Break!!!!\nAre any of you old enough to get that? If not, you'll just have to trust me – it’s hilarious."}], "Genre": "Crime", "ID": "28815474", "Desc": ""}