{"Name": "The Killer Collective", "Image": "https://images.gr-assets.com/books/1534538487l/40492305.jpg", "Reviews": [{"Review": "\n\"The killing business has its own gravitational pull, and if you get too close, or stay too long, you'll never break free.\"Man oh man, Barry Eisler knows how to write thrillers! His books featuring \"retired\" hitman John Rain, and his newer books featuring troubled sex crimes detective Livia Lone are fantastic, but this one really hits a home run. Way to get my heart pounding!Livia is leading the Seattle Police Department's involvement with the FBI in a joint investigation of a child pornography ring when she and a consultant discover that there are some pretty influential people caught in this horrible, tangled web. But as Livia searches to identify the culprits, the investigation is quickly shut down.Of course, Livia is not one to be easily dissuaded—until she finds herself the target of an attempt on her life. If it weren't for her police-sharpened instincts and her martial arts skills, she probably would have been killed, but instead, you should see the other guys. Still, it doesn't take an investigative genius to know that she has stirred up a hornet's nest, and it's one that is going to get infinitely more dangerous if she doesn't drop the matter. And the likelihood of Livia walking away from children being put in the worst kind of danger is nil.Ironically, the hit on Livia, along with two other people, was originally offered to John Rain, who refused, both on principle (he never kills women) and because he didn't like the attitude of the person trying to hire him. This refusal proves to be a bit dangerous for him and two former colleagues who connected him with the potential customer. Suddenly Rain's retirement looks to be a thing of the past, as he tries to figure out what is behind all of the violence.When Livia calls on former Marine sniper (and Rain's best friend) Dox for help out of her predicament, he turns to Rain. It doesn't take long before they've essentially created a squad of highly trained killers to try and go after the mastermind of the whole circle of violence. In addition to Rain, Dox, and Livia, there's Rain’s estranged lover (and Mossad agent) Delilah, lethal black ops soldier Daniel Larison, and their former commander, Colonel Scot “Hort” Horton. No one should want to cross this group—but they know all too well someone will, soon enough.The race to kill before being killed, and capture the person behind the hit on Livia and the squelching of the child pornography investigation takes the group across the world, before everything explodes in Paris. Lives are at stake, but so are some complex emotions—love, anger, fear, loyalty, betrayal, and revenge.The Killer Collective meshes together Rain, Livia, and characters from Eisler's previous books so well. While there are references to previous books, even I didn't read some of them, and yet I didn't find that a problem at all. Not only is there some fantastic action, double-crosses, and impressive weaponry, but Eisler doesn't just give you stock characters—these are complex characters with layers of emotional baggage and, in some cases, long-standing friendships and relationships. This makes the book so much richer.The book takes a little time to build up momentum as it sets everything up, but once it does...boom! There was just so much to like about this book, the same way I've felt about every one of Eisler's books I've read through the years. For me, having Rain, Dox, and Delilah together felt like dropping in on old friends, and adding Livia to the mix added to the book's complexity and emotion.Essentially, Eisler has created a more literary version of The Expendables—that movie series that brought together Stallone, Schwarzenegger, Jet Li, Chuck Norris, Jason Statham, Dolph Lundgren, Bruce Willis, and other action heroes.Amazon First Reads and Thomas & Mercer provided me an advance copy of the book in exchange for an unbiased review. Thanks for making this available! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2018 at https://itseithersadnessoreuphoria.blogspot.com/2019/01/the-best-books-i-read-in-2018.html."}, {"Review": "John Rain is a hitman offered a job targeting three individuals. He turns down the job, but is swept up in the action when one of the targets, Livia Lone, survives the attempted hit. Not only is John involved, but so are various others with connections to Rain and Livia.Told using alternating points of view, this novel has a lot of characters and multiple storylines. Even though there was a lot going on, it was easy to follow and everything was wrapped up by the end.This book is part of a series. Actually, it's part of multiple series by Barry Eisler. I didn't realize that when I picked it as my First Reads book this month, but, fortunately, it was easily read as a standalone. This is book 10 in the John Rain series, book 3 in the Livia Lone series, and book 4 in the Ben Treven series. John Rain is a \"retired\" hitman. Livia Lone is a sex crimes detective. Ben Treven is a black ops soldier. I'm sure readers of these series get more from the book than I did, since they would already be familiar with the backstories of the characters. Still, I found it to be a good, fast-paced read. I may look into the earlier books in these series.This thriller involves multiple government agencies. From Seattle PD to the FBI to the Secret Service. A fast-paced thriller with sex crimes, black ops, and multiple bad guys. Intriguing, complex, and exciting.This book was my pick for Amazon's First Reads in January 2019."}, {"Review": "New York Times bestselling author Barry Eisler (The Night Trade) merges his two most popular franchises in his latest action-packed thriller. This time around, Detective Livia Lone of the Seattle PD sex crimes unit has her eyes set on bringing down an evil child pornography ring. Because the ring has gone international, though, it’s a federal case, and Lone is forced to partake in a joint investigation between the Seattle police department and the FBI.After making headway on the case, Lone is the victim of an assassination attempt, narrowly escaping with her life. Things take a turn, however, when she discovers that those behind the attempted hit may be linked to the FBI. Searching for help, Lone turns to former Marine sniper Dox, whom she partnered with in The Night Trade, and the duo realizes that someone tried to kill Lone in order to keep her from exposing a bigger conspiracy. Worse, the people she’s after prove to be nearly unreachable and impossible to get to, though Lone isn’t one to give up or shy away from such a challenge.As the story unfolds, it’s revealed that retired hitman John Rain (The Zero Sum, 2017, etc.) previously turned down the job to take out Lone, paving the way for their paths to cross. Rain, an elite killer who specializes in making it appear as though his targets died of natural causes . . . Continue reading this review here: https://therealbookspy.com/2018/11/25..."}, {"Review": "My review of The Killer Collective can be found at High Fever Books.Ever since Barry Eisler’s newest series character Liva Lone appeared on the scene in her eponymous 2016 debut, I was waiting for the day she would cross paths with the author’s original creation, John Rain. Finally, that day has come, and the two — along with their many and various colleagues — share page space in The Killer Collective. Like Eisler’s 2011 novel, The Detatchment, The Killer Collective brings together all of the various characters he’s written about over the years, Avengers-style. As such, this book wears a lot of hats and its characters have their own already-deeply established relationships and web of networks. The Killer Collective is the tenth John Rain thriller, the third in Livia Lone’s series, and the fourth Ben Treven book. Although Eisler gives enough information about each of these characters and their histories to make this an accessible introduction for new readers, long-time fans will likely find a lot more to appreciate given their built-in familiarity with the diverse and storied cast after having come to know all the different faces here over the last couple decades.While investigating a child sex abuse ring Livia uncovers connections to several Secret Service agents, which quickly makes her a target for assassination. Needing her death to look natural, John Rain is contacted through a cutout, but he refuses to kill women and children and turns down the job. The inquiry, though, is enough to pique his interest and draw him out of retirement in order to find more information on who attempted to hire him. Soon enough, he’s drawn into Livia’s orbit thanks to a mutual acquaintance, his friend Dox, who also partnered with Livia in The Night Trade.Given the large cast surrounding Livia and Rain, there isn’t a lot of time to develop deep emotional connections between the reader and the characters. However, those who have been with Eisler and his creations for the long haul already know these operatives and assassins intimately. It’s a handy shortcut to rely on, and it allows Eisler to focus hard on the action and keep the book moving at a rapid-fire pace.The Killer Collective moves hard and fast as Rain and his reassembled detachment go on the offensive to target those who have put them in the cross-hairs, and the action sequences are delightfully large-screen in their scope. Between helicopter attacks, pinpointing a sniper’s den, and becoming embroiled in a massive shootout at a French bar, neither the reader nor the detachment have a lot of room in which to breath and slowing down isn’t an option. While the book moves along a frenetic pace, Eisler’s depiction of action and tactics is as sharp as ever. He cleanly portrays violence, letting you see every step of the assault, inside and out. The action is high and mighty violent, but also psychologically complex. He gets us into the heads of these operators as they stage an execution or prepare a counter-offensive assault, understanding the mental and emotional components to their physical actions, how it will make their targets feel instinctively and how those feelings can be further leveraged to achieve their goals. The characters are also deeply aware of their comrades subtexts, thanks in part to their long relationships or because of their own inclinations. As I said earlier, I’d been waiting to see how Livia and Rain would get on, and in fact it’s nicely subdued. Both recognize elements of themselves in the other and understand the natural boundaries that exist around them. They’re damaged loners, but also deeply professional and aware of the deep, unspoken currents residing in the other’s psyches, even if they don’t know each others actual histories very well. Ultimately, their relationship is one built upon mutual respect, and I dug that aspect a lot. It’s hard to say if they’ll ever meet again, but as a one-off it’s a satisfying exploration and the inciting elements that bring them together are nicely, chaotically staged.The Killer Collective is not as deeply emotional as prior books in Eisler’s oeuvre, particularly the grueling debut of our latest series heroine in Livia Lone, but it does have plenty of other rewards and more than its fair share of thrills. And when it comes to staging and exploring violence from the head-space of trained killers, nobody does it better than Barry Eisler. The Killer Collective is an adrenaline-fueled marathon run of action and conspiracy from beginning to end, filled with plenty of combat and movie screen-ready violence that’s more satisfying than ten of Hollywood’s biggest summer blockbusters. Now…when’s the next one releasing?"}, {"Review": "This may be one of the best books I've read in the last (linear) year!I devoured the book in a twenty-four hour period - something I haven't done in the last few years.The Killer Collective brings together a bunch of Eisler's characters: John Rain, Livia Lone, Dox, \"the angel of death\" Larison, Ben Treven, Colonel Horton, Delilah (yay!)... For me - having Rain, Dox, and Delilah together felt like seeing old friends, and adding Livia into the mix added to the book's complexity and emotion - as well as providing the impetus (based on real types of crimes) for the novel.There are references to several of Eisler's previous novels, but even if you didn't read some of them, it wouldn't be a problem. There is great action, impressive gadgetry and weaponry, intrigue, and romance. This book reminds me of a literary version of the Expendables, but deeper and with more heart!While I could go on about the specifics of the book, I won't. I wouldn't want to spoil anything for anyone. :)I will say that I would recommend this to pretty much anyone I know!"}, {"Review": "Not the worst book Eisler has written, but overall it’s disappointing.Eisler wrote some very good paragraphs, some showing keen insight into the human condition. Ultimately, though, the book is tedious and simply goes on too long. Eisler, like many writers in the genre, goes to great lengths to establish credibility, such as providing detailed information on weapons and locations, but he fails to address, much less correct, fundamental issues such as the nature of his characters’ work and their value as human beings. For example, Livia Lone is a Seattle police officer, albeit a murderous avenging angel. Why is she associating with hired killers and mercenaries? "}, {"Review": "I started out reading thrillers years ago through a book club where our first pick was THE GOLD COAST by Nelson Demille. I have continued enjoyed to enjoy the genre on a regular basis thanks to excellent writers and Megan Beatie of MB Communications who sends excellent novels for me to review. Author Barry Eisler has written many thriller series, but THE KILLER COLLECTIVE is a standalone book. It does have protagonists John Rain, Livia Lone and Ben Treven from earlier series. Livia Lone works for the Seattle Police and is involved with the FBI in investigating a child pornography ring. She is suddenly told it is being shut down. Livia is almost killed in a hit that has been offered to John Rain, who is retired, but has excelled in the field of killings that looked like normal accidental deaths.Livia gets in touch with Dox who is a former Marine sniper. They assemble a group of \"killers\" who try to get to the bottom of the ring which may involve the FBI and other government agencies. Although most thrillers are action driven, there is plenty of character development in THE KILLER COLLECTIVE and even some touches of humor and romance. The changes in locales are engaging and the end location of Paris is particularly charming and fun.Each chapter is plainly marked with a character's name and the third person point of view which helps to propel the narrative. My only criticism of this wonderful novel is I did have a trouble keeping all the people straight for a while since the author uses last names, first names and nicknames. By mid-way through I had everyone in place in my mind.Barry Eisler writes a truly authentic tales since he spent three years in covert operations. He is also well versed in international law since he has worked with a law firm with that specialty.Entertainment Weekly magazine has already picked THE KILLER COLLECTIVE as a must read thriller and lucky Kindle First readers have the novel as a January choice. I highly recommend it as thriller that will provide with exciting entertainment."}, {"Review": "This was a pretty ambitious project for author Barry Eisler since he weaved together most of the characters in his previous books into a seamless story line. I liked the Detachment which required him to do the same thing, but I thought he did it here much better, and with more characters to boot.Eisler sets the scene well from the very beginning by introducing one of the main villains from the first act. He quickly introduces him without making him cartoonish. He quickly establishes all of his previous characters in the book without letting any of them monopolize the entire book. A lot of his characters have grown since he last wrote about them and he establishes this too in a very economical way.There is also a lot of practical information in this book. I would highly recommend the bibliography. I was definitely happy that this was in Amazon's First Reads selection. Not that I won't be getting the physical book the second it comes out."}, {"Review": "I am loving this... no spoilers but... You know how irritating it is when a writer creates a memorable character, then a series, and you love every book. Then he stops and writes another series and you love that, and then he stops and writes another series. You get annoyed because you have to wait for a bit longer each time. (Sorry Barry - not really complaining). AND THEN ....He does this brilliant thing and puts them all in the same book. Much appreciated Mr Eisler - now to persuade the Robert B. Parker estate (and Reed Farrel Coleman to put Spenser, Hawk, Vinnie, Jesse Stone and Sonny Randall in the same book properly - best of all - make it a 500 pager you guys)"}, {"Review": "Not bad, but there is still just a bit too much casual killing in these series; maybe get a little more surgical in the next one? This one is the tried and true “get the gang together” plot device after Lone discovers something nefarious with Nat Sec dimensions while investigating a pedophile ring. For all the killing there is also a bit too much Serious Talk on the relationship side. There’s a nice comic description of mansplaining in action though and some other good bits such as Delilah trapping the bad guy by his egoism. There’s also a good Schrödinger’s cat allusion - gets the theory right for a change. More of that.And as I’ve said about 2000 times, if the bad guys would react with some subtlety, instead of just starting to kill people (blowing up an airliner!) they probably would get away with it. The Deep State didn’t get where it is today by being stupid."}, {"Review": "PW Starred: In this crackling-good thriller from bestseller Eisler (The Night Trade), Seattle PD sex crimes detective Livia Lone, assassin John Rain, and former Marine sniper Dox form a testy alliance to combat a vile conspiracy involving corrupt and toxic government agencies. When Livia survives an assassination attempt while investigating an international child pornography ring, she learns that those behind the hit may work for the FBI. Livia recruits Dox, her partner from The Night Trade, to aid and abet her. Meanwhile, Rain—who originally was offered the hit on Livia—must come out of retirement to assemble a world-class team of black ops all-stars to battle a parallel threat. Persuasive action sequences lead to the merging of the two forces midway through the story. The feisty interplay among these killer elites is as irresistible as if one combined the Justice League with the Avengers, swapping out the superhero uniforms for cutting-edge weaponry and scintillating spycraft. By the satisfying conclusion, the world has been scrubbed a bit cleaner of perfidy. This is delightfully brutal fun. Agent: Laura Rennert, Andrea Brown Literary Agency. (Feb.)"}, {"Review": "Eisler knocks it out of the parkI've been an avid fan of Barry Eisler's work for a long time. When I heard he was working on another team up book in the vein of his previous 'The Detachment' that included Livia Lone, plus a couple of other characters not in the previous book, I was excited and knew that my expectations were going to be high. I'm happy to say he blew way past what I had hoped for. This may be the best novel he's written--and after the last two Livia and Rain prequel books that's an exceedingly high bar. The characters are all written well and stay faithful to their existing identities, but they also feel more fleshed out this time. I may be wrong, but it seems like since 'The God's Eye View', Eisler has expanded on the internal reflections and dialogues if his characters. Being inside John Rain's mind is a treat. He is, by now, an old friend of sorts. And his internal growth and burgeoning wisdom and maturity are great to see from first person. Livia is as multi-layered and complex as ever, and I'm happy to see her learn and open up and heal some, or at least be coming to terms with who she is(I'm still waiting for the friendly grappling match with Rain, Mr Eisler!). Dox is the class clown who has become counselor and dispenser of philosophical insights with his typical rakish charm and humor. Larrison in this outing is the most human, yet lethal, I've seen him--he perhaps grew on me more than any of the other characters this time around. I was very happy to see Delilah show up and add her skillset to the team. I'm not 100% on board with Ben Treven's contribution, but it was satisfying nonetheless. I knew the plot would involve sex-trafficking of some sort with Livia being one of the main characters--and boy did it, the revelation of hurt-core subculture was disturbing. All the moreso because of it's reality outside the pages of the book. As an aside, I'm pretty confident I had more of an emotional reaction to this part of the plot than the plots of the two previous Livia books. In fact, overall, I found myself more emotionally invested in this book, and the interplay between the characters, than previous books. I think Barry Eisler is a great writer, and I really think he shines better than ever here. On to the mostly spoiler-free plot; the team comes together over a large portion of the book in an organic and well-paced way. As the story builds they work with, against, and tangential to various agencies, both inside and outside the law, to uncover a plot that reaches to some of the highest levels of power all the while engaging shadowy international private contractors. The main story and personal plotlines all wrapped up very well. I initially thought it ended a bit fast, but upon reflection, it ended exactly how it would have in the real world after the protagonists completed their goals. There were some great references to real world events(like Snowden), a few inside jokes for those with the eyes to see it, some foreshadowing of what I assume is the next Rain prequel, and a little political commentary. In fact, if I had any criticism--and to be clear, criticism is too harsh a term, quibble would be more accurate--it would be that there were several stabs at the media and political over-infatuation with the narrative of Russia-as-bogeyman in the 2016 election and beyond. I get the reasons for this and it's a common critique from segments of the blogosphere that I read. It's even most definitely accurate criticism to some unknown extent--enough so I chuckled at some of the references and one character's obsession. But they felt oddly placed and stuck out to me as unnecessary for the story. And perhaps somewhat dismissive after what's been revealed by the Mueller investigation and researchers like Renee DiResta about the Internet Research Agency, and it's multi-front assault on social media since 2014-15. Again, less a criticism and more like something I'd love to discuss with the author to explore data points. Anyway, the research was meticulous, as always. The notes at the end provide a trove of avenues to go down for those who want further education on real-world inspirations for parts of the book, safety, tactical considerations, etc. All that to say I cannot recommend this book enough, though I would recommend all the previous books first so you don't have to play catch up. "}, {"Review": "Eisler has written another page turner, and like “The detachment”, there is something satisfying about being all of the past characters together - more satifying than when gobs of Marvel characters are in the same movie by far. MINOR SPOILER ALERT.As usual, Eisler’s realistic view of black ops and technology makes the book better than most other spy stories. He is up there with LaCarré at least.I have previously complained on the old forum, and even to Barry in person, that his attentio. To detail was lacking for motorcycles. He appeared to correct this oversight in one of the “retro-rain” stories. but he still has poor Dox riding a tiny Honda Rebel! I told him that it is more likely that Dox would ride a dual-purpose rice rocket, because it would blend better on local streets, have an easier time on rice paddy roads, and most importantly, it would provide the ability to buy out on any terrain with plenty of power.Here’s the kicker: in this novel he is dismissive of a Piaggio MP3, saying that he would prefer a “real motorcycle”. But the MP3 has twice the displacement power of the tiny rebel! Barry - please!If you are an Eisler fan of any kind, this one must not be missed!"}, {"Review": "rating 3.25When a joint FBI–Seattle Police investigation of an international child pornography ring gets too close to Secret Service and other powerful people, sex-crimes detective Livia Lone becomes the target of a hit that barely goes awry—a hit that had been offered to John Rain, a retired specialist in killings appearing to be from “natural causes.”Suspecting that the FBI themselves were behind the attack, Livia reaches out to former marine sniper Dox. Together, they assemble an ad hoc team to identify and neutralize the threat: Rain; Rain’s estranged lover, Mossad agent and honey-trap specialist Delilah; black op soldiers Ben Treven and Daniel Larison; and their former commander, SpecOps legend Colonel Scott “Hort” Horton.This book is a part of a series about this group of assassins. I think it would be better to start with book 1 so that you could develop the characters from prior activities. The book make mention of some of their prior activities but much was left to your imagination. Child pornography with \"hurt torture\" is a terrible thing and getting rid of the perpetrators necessary. A sideline plot not resolved. "}, {"Review": "Excellent Rarely do I give five star reviews. The majority of my reading is purely my form of escape and I read virtually every day to relax and escape. I find so much repetition and narrowly focused plots in much of the published books today, and while entertaining, they lack in reality or creativity or are just another story about terrorists or some superman who kills everything.This book was creative and centered on theme not well used in today's typical action novels. The characters are quite diverse and the multi-faceted dramas interwoven throughout are interesting and add reality to the cast and plot. The use of more sophisticated language was delightful (had me using the dictionary several times) as it was not so burdensome that I felt like I was reading a technical manuel, but enough to entice me to expand my knowledge (which is a plus, considering reading fiction entirely for pleasure).So, Mr. Eisler,I shall be looking for more of your work. Thank you for an exceptional reading experience...and a bit of learning too."}, {"Review": "An investigation of an international child porn ring has deadly consequenceswhen it threatens to expose the rich and powerful. Seattle detective and sex crime avenger Livia Lone is in the cross hairs. But the bad guys make a crucial mistake when they try to terminate an elite group of killers. The mercenaries join Lone in a battle that will cross the globe. I liked this book overall. It is okay as a standalone but reading the prior novels and learning the back stories adds richness to the story. Alternating narration but multiple characters makes it feel choppy. There are too many characters and refering to them by both their nick and given names is confusing. The romantic interests were clumsy and felt juvenile, especially considering that these are highly trained, soohisticated mercenaries. The ending was flat and a tad disappointing. I did like the inclusion of the footnotes and links for research for those interested in toopics presented in the book. It was a fast, kfun, if somewhat flawed read. "}, {"Review": "A great thriller that I liked for other reasons It is a terrific thriller, fast paced, never boring, with a plot that, though complicated, never caused me to feel lost. It was obviously well researched, and never did I get that feeling I get with some books, of, “oh, please!” doubts.One reason I liked it so much is that the characters were well developed, three dimensional, with characteristics to both admire and not admire so much. In other words, they felt real.Another reason is the author’s writing style. His prose is entertaining, and moving. I loved the way he created tension between Rain and Delilah, and then brought them together slowly in a thoroughly genuine and satisfying way.Lastly, the sex and violence, and vulgar language, wasn’t celebrated; it was used as needed, when and where it made sense.I highly recommend this book, one of the very few I’ve read that I have thoroughly enjoyed with no complaints, only compliments."}, {"Review": "This was my first Barry Eisler read. Picked up the ebook on Amazon's Early E-book Reader offer --or whatever it is called.Absolutely loved the tale. I am going to have to go back and read more about John Rain and Livia Lone in their perspective collections. Maybe even the four books featuring Treven. From Tokyo to the US to Paris -- this book is filled with tension, action and an unnerving plot. It is the kind that makes your stomach knot up (like when you binge watch too many episodes of Law & Order: SVU). The chapters are short, the dialogue crisp and the pace unstoppable. You can tell there is a lot of history (the other books in the other series), however I thought it worked fine as the first in a new saga, and as I indicated, inspires me to want to go back and learn more ...Phillip TomassoAuthor of the crime novel YOU CHOOSE"}, {"Review": "All star cast and fabulous plottingRain, Dox, Livia, Larrison, Delilah, Kanezsaki, and more. Virtually every character I've ever liked in an Eisler novel. Brilliant pacing. And I feel like an idiot stating: I laughed and I cried, but it's true. I loved Dox calling Larrison \"the angel of death\" and almost everything about Livia, and especially Livia and Dox, touches me deeply. Well, except for when she's dealing with sadistic child abusers, human traffickers, and rapists. Then I simply cheer and applaud. And it's more than fine that the others join up with her battles. Don't miss this one. I think it ranks up with the best Eisler has written along with The Killer Ascendant and The Detachment. Wonderful action. Brilliant characterizations. Lovely relationship development."}, {"Review": "Overall this was pretty good. All the normal Eisler stuff in it, which was good since I like that sort of thing. It was neat to see how all the characters played with each other, especially interesting to see how Dox's interaction with the group changed now that Livia is a factor for him. It's markedly different than in The Detachment. The story was for the most part enjoyable, but the ending kind of felt rushed to me. I was like 100 pages from the end, and I couldn't see how it would all wrap up before the end. I mean, it did, and it made sense, but the last little bit (view spoiler)[after Paris (hide spoiler)] felt almost like a throw away. It could have used another arc, I guess. Regardless, still good."}, {"Review": "This book was just so much fun. I didn't want to put it down. After reading so much Barry Eisler over the years, it was just an absolute pleasure to have Rain and Dox and Livia and Larison the Angel of Death and Delilah together. I hope Barry brings them all back for the Killer Collective II (though he'll obviously come up with a better name given his self-imposed compulsion to ensure his books have the right titles. The book starts off strong, adding in character after character brilliantly, with a great plot, great tension between our players, and the novel picks up speed throughout, and never lets go. I want to go back and listen to these books on audible, having read them all, since Barry is the narrator (and since he does such a phenomenal job). "}, {"Review": "This was a Kindle First Reads for January.This was my first Barry Eisler book, and I'm not sure I understand all the 5-star reviews. It's a good story (and would probably make a good movie), but it is very slow. It can definitely be read as a stand-alone, since the author goes to great (and long-winded) lengths to explain each and every characters back story in detail. Add to that, that every decision is preceded by either the characters inner monologue weighing pros and cons, or the group discussion of every single little detail.I understand the need to establish reliability, but all this accomplishes, for me, is to make me lose interest in the story."}, {"Review": "Wow I could not put this book down!I was hooked from the first page and could not put the book down.Each character is described with just enough information for the reader to connect with that character and understand their thought process.Just enough details were given though out the book that allows the reader to develop a picture in their mind without over doing it.Lots of action, companionship, and even lost love.Ties up all lose ends at end of book.Really good book and look forward to reading more from this author.Highly recommend if you like fast paced page turners."}, {"Review": "This was my first read of any of Barry Eisler's work and I did not realize I was reading a mash-up of previous novels. I presume (from the #s assigned above) that's what I was reading. I thoroughly enjoyed the story, all the diverse characters, the action and the melding of the story lines together. I plan to read more of Eisler's novels and learning more about the different characters. Then, too, I would welcome another \"combination\" story where they come together again. It will be interesting to see if the characters stand alone as well as they were portrayed and came together collectively. Good job; fun, exciting read."}, {"Review": "I actually really liked this book. At first, it was a little crazy to follow with all of the characters and various points of view. However, that became one of the things I ended up liking after I got to know the characters. I like that elements of the story were based in truth and the author provides various references at the end. I also liked the intrigue and mystery in the story. Overall, a good read for those who enjoy the suspense and mystery, plus a little romance as well. I would definitely read another book by this author. "}, {"Review": "It's the first book I've ever read by this author and I will definitely be reading more. This book kept me up long past bedtime because I had to know what was going to happen next. So many twists and turns, intrigue and deception in all of these characters. My favorite character was Livia as she embodied a good combination of strength, innocence, determination, and a willingness to do what was right no matter what. The story line was smooth and moved at a good pace. Truthfully, I didn't want it to end."}, {"Review": "A Well Executed TaleMy title should give you a clue, if you happened to miss it in the book 's name! A police detective, on administrative leave while one of her cases is under review, becomes involved with a group of assassins trying to eliminate a collective of extremists who abuse children for fun and profit. The case takes the odd assortment of across the United States and to Paris to take out the founders of this heinous group. This novel will satisfy anyone's need for mystery, violence, and romance!"}, {"Review": "Free Prime first reads book. Took me a little to get into it. I did not know it was like a Justice League of characters from various series by Eisler. The action and suspense were good. There were a lot of characters, all well enough developed and interesting, and it was easy to keep track of who was who and the inter- relationships. The love story aspects were fine - a little over done. IHaving read this, though, I'm not sure I want to go back and read earlier installments of any of the series. I would have liked discovering them first, then reading this. "}], "Genre": "Crime", "ID": "40492305", "Desc": ""}