{"Genre": "Crime", "Reviews": [{"Review": "Elly Griffiths writes the perfect October read with this contemporary take on the Victorian Gothic novel set on the Sussex coast. Attractive Clare Cassidy is a divorced English teacher with a 15 year old daughter, Georgia, teaching at local comprehensive school, Talgarth High, where there is a building that Roland Montgomery Holland, a reclusive Victorian writer lived, a man famous for a short story titled The Stranger. Clare is writing a biography of RM Holland and is interested in the death of"}, {"Review": "The Stranger Diaries has the elements of a police procedural, gothic mystery, and possibly a haunting. Yes! Yes! & Yes! Clare Cassidy is a well respected English teacher. Divorced, she lives with her daughter, Georgie, and her adorable pup, Herbert. (I love Herbert!!!) Her best friend and fellow English teacher, Ella, has been discovered murdered and covered in stab wounds. A note lay beside her reading \"Hell is Empty\". A book within a book. Clare teaches a class on R.M. Holland's horror nov"}, {"Review": " An absorbing and unsettling contemporary thriller that mirrors a gothic tale~ Some elements I loved~ 1. There is a gothic Victorian book placed inside the main story. ooh...book inside a book. 2. Several points of view. 3. The mixture of modern and old school. 4. Police procedural mixed with the creepiness of the setting. 5. A quirky female detective with a sharp eye for inconsistencies. (She was my fave) 6. The setting of a \"haunted\" school.If your craving something a little different from you"}, {"Review": "Heavy draperied rooms, long winding staircases, and imposing carved wooden doors lend themselves to a Victorian Gothic panoramic view. Elly Griffiths sets this treasure box of a story within the walls of Talgarth Academy in Sussex. There's an array of buildings that stretch across the campus including the Old Building that houses the original effects of the writer, R.M. Holland. Holland lived there with his wife, Alice, and an elusive daughter, Mariana. According to legend, no one knows what hap"}, {"Review": "Clare Cassidy, divorcee with 15 year old daughter Georgia, had moved from London to West Sussex, having accepted a position teaching English at Talgarth High School. Clare and Georgia now reside in an isolated house near an abandoned factory. Clare maintains a diary reflecting her innermost thoughts. Additionally, she shares her feelings with rescue dog, Herbert. After all, a dog will not judge his owner! Clare is thrilled that author R.M. Holland, the writer of a gothic ghost story called \"The"}, {"Review": "Although I was interested in the description of this novel, I was, initially, a little wary. I had tried Elly Griffiths popular Ruth Galloway series, and stalled with it. However, I am glad that I gave this a try, as I absolutely loved it and it has made me determined to go back and give Ruth Galloway another try.This is a clever, literary mystery, with an excellent cast of characters. Clare Cassidy is a divorced English teacher, living with teenage daughter, Georgie and working at Talgarth High"}, {"Review": "The perfect blend of gothic horror, psychological suspense, and police procedural! ‘\"If you’ll permit me,” said the Stranger, “I’d like to tell you a story.”’As much as I love spooky old houses with a dark history, and possible ghosts sightings, a thought-to-be haunted house turned into a secondary school had me even more excited. The Old Building of Talgarth High, was once home to Victorian Horror writer R.M. Holland, best remembered for his horror-themed, scary short story, The Stranger. The t"}, {"Review": "Elly Griffiths has woven together a tale of gothic suspense, psychological terror and marvelous detective work and thrown in a full measure of classical literature, all of which create a beautiful tapestry called The Stranger Diaries. Whew.If you think that opening line was a lot to absorb, just wait until you read the book. I’m still trying to untangle my mind from the who’s and who’s nots and what’s real and what’s not! For someone who had an imaginary playmate until she was 10 years old and s"}, {"Review": "The Stranger Diaries was a solid 4 stars for me. A mystery/thriller, this book centers around main characters Clare (a divorced English teacher who specializes in RM Holland), Georgie (her 15 year old daughter), and Harbinder Kaur (a detective). Most of this thriller centers around the school Talgarth High-this is where the famous Victorian writer RM Holland wrote and lived. An interesting character, Clare spends some of her free time researching aspects of his life for a book she is writing. Th"}, {"Review": "Modern gothic with a noir feel, a creepy intelligently woven story and a proper old school whodunit, The Stranger Diaries is a beautifully immersive reading experience. I read it all in one go. Excellent. Full review for publication in November."}, {"Review": "4 Stars.I’m a fan of Elly Griffiths’ Ruth Galloway mysteries, and couldn’t wait to sink my teeth into this one. I was not disappointed. It’s a treat! The Stranger Diaries is a perfect concoction of interesting characters, suspense, and thrills with a bit of spookiness thrown in. When teacher Clare Cassidy’s friend and work colleague, Ella Elphick is found brutally murdered in her home, Clare is badly shaken and their school is plunged into mourning. Who would have wanted to harm Ella? She was po"}, {"Review": "Clare teaches English – key stage 3 in term time, adult creative writing courses over the holidays – and specialises in the work of R.M. Holland, a 19th-century writer of ghost stories whose personal life was as lurid as his fiction. At the beginning of the book, Clare receives a phone call with the awful news that her friend and colleague Ella has been murdered. She's later told a handwritten note was found next to Ella's body: a phrase from The Tempest, 'hell is empty'. The quote also happens"}, {"Review": "DNF @ 5%I am just not a fan of the way this is written and it's making it incredibly difficult to read and get into/invested. I feel bad for not even getting 25% through as this was an ARC but I just can't bring myself to carry on."}, {"Review": "Two books for the price of one.Elly Griffiths has a new crime mystery that has no direct link with her two established series. One of the things it does have in common is that it is very good. Full of her delightful humour and investable characters but for her as an author a bold venture as lacking the security of the familiar. It strays into uncharted territory moreover as there is a cap doffed to gothic horror and ghostly terror.Interspersed with the modern day fiction is the frightening tale"}, {"Review": "The Norfolk settings first drew me to Elly Griffiths’ Ruth Galloway series - Kings Lynn is one of my very favourite English towns. But after several outings I’d begun to find Ruth annoying. The Zig-Zag Girl featured a fascinating period - the 1950s - but stage magic and Brighton don’t appeal to me. Yet I had very high expectations for The Stranger Diaries and I expect that I’d been less disappointed had it not promised so much. Griffiths has created a ghost story, supposedly written by R. M. Hol"}, {"Review": "“Hell is empty!”Clare Cassidy is writing a biography of the writer RM Holland, who was best known for his terrifying ghost story, The Stranger. So she’s happy to be teaching at Talgarth Academy, a school in Sussex which was once Holland’s home and where his study is still intact, giving Clare access to his papers. Clare uses The Stranger as part of her lessons, both for her school pupils and for the adults who attend her creative writing classes in school holidays. But when one of her colleagues"}, {"Review": "I’m a huge fan of any mystery or thriller that evolves around a book so The Stranger Diaries intrigued me from the start. I love the idea of a book holding clues to a mystery that’s happening in the present so this book was a big hit with me!I wasn’t sure about the main character Claire. On one hand she seemed very sassy and I found some of her observations very amusing. However she seemed like an unreliable narrator as she kept lying to the police which made me question her motives.This book is"}, {"Review": "Elly Griffiths first sensational standalone is a magnificent piece of storytelling that manages to combine a contemporary murder mystery between the pages of a chilling Gothic ghost story and proves as entertaining as it is atmospheric. The Stranger Diaries not only works as a homage to the work of R.M. Holland, a fictional Victorian writer known for his Gothic mysteries, but it also brings to life his crowning achievement in the form of his notable short story, The Stranger. Cleverly worked and"}, {"Review": "DNF @ 27%This book had an interesting setup- divorced mother with childhood trauma moves into a murderous author’s mansion. I really, really tried to like this; gothic fiction is my favorite genre, after all.I ended up hating the main character, Clare. She was insufferable with all her whining about her daughter not getting into the universities she wanted. She was the cliché evil gothic matriarch, only the author tried to force the reader to sympathize with her. I hated the protagonist so much"}, {"Review": "If you enjoyed the way MAGPIE MURDERS combined a cozy country mystery with a modern one, THE STRANGER DIARIES does something similarly smart with gothic novels. It totally gets the gothic tradition to the point that I got actually creeped out a few times while reading it. While not quite a horror novel, it was really enjoyable. (The short story by the fictional Victorian writer in the book is A+, I loved all the bits of it scattered throughout the book.)This mystery walks a fine line between kee"}, {"Review": "I read this on the strength of Elly Griffiths' name as I love her Ruth Galloway series: this book is entertaining enough but doesn't show off Griffiths' strengths i.e. her ability to create quirky characters like Ruth, Harry, Cathbart etc., and there are only occasional gestures towards her trademark comedy/satire bon mots - in fact, the only time Clare raises interest is when she articulates something Ruth would say.The story itself is a modern Gothic-y serial killer with one of those dubious a"}, {"Review": "Elly Griffiths can do no wrong in my eyes and this fantastic stand alone Gothically atmospheric mystery is every bit as brilliant as I knew it would be. I loved everything about it (but especially Herbert the Dog). Perfect reading for these longer evenings. Review to follow shortly on For Winter Nights. "}, {"Review": "I received a copy of this book from Netgalley in exchange for an honest review.An eerie, cleverly written whodunnit - very enjoyable!It's always a pleasure when I dive into a book with no preconceptions and am pleasantly enthralled by what lies within! I had no idea what sort of story would be, but right from the start, became swiftly engrossed in it. Clare Cassidy is an attractive middle-aged woman - working at a school as a teacher, with a teenage daughter called Georgia. The school happens to"}, {"Review": "Equally as good as Elly Griffiths series of books. As always, I had no idea who the murderer was. It has kept me riveted from the start"}, {"Review": "I have long been a fan of Elly Griffiths – in particular her fabulous Ruth Galloway mystery series. Therefore I was beyond excited to learn that she had written a new, stand-alone novel.“Stranger Diaries” has three distinct narrators and I was engaged with all three. I enjoyed how the three narrators sometimes spoke of the same event, so that you could learn their differing perspectives – both of the event and of each other. If I had to pick a favourite character it would definitely be DS Harbin"}, {"Review": "Elly Griffiths is well known for her Ruth Galloway and Mephisto and Stephens series’ but if you’re not familiar with those, fear not, for The Stranger Diaries is a standalone.It starts with a story from long ago, recounted by a stranger on a train at Halloween – this immediately sets the tone for a deliciously creepy and atmospheric tale.Back to the present, teacher Clare Cassidy is writing her own book about a former horror writer called RM Holland – this name, together with some of his work, w"}, {"Review": "'Just like in the books, when Poirot suddenly \"knows\" who the murderer is, but won't tell anyone because there are a hundred pages still to go.' So states a character less than half way through The Stranger Diaries. The irony being that the reader has already worked out who the murderer is, and there's over half the book to go. The blurb promises that Elly Griffiths' new novel will be a darkly gothic affair, but instead we're served up a reasonably chilling but fairly standard killer thriller wi"}, {"Review": "Book reviews on www.snazzybooks.com I am a big Elly Griffiths fan, and love her Ruth Galloway series, so I was intrigued to try a book with different characters in it. The Stranger Diaries definitely feels like a different read, but it was just as entertaining and absorbing as her other novels, and the characters - which Elly Griffiths is always so great at shaping - read like real people I could, on the whole, imagine actually existing.The plot is interesting and kept me intrigued; at some poin"}, {"Review": "Ellie Griffiths is known for her Ruth Galloway crime series, so The Stranger Diaries is a change of direction for her. This standalone gothic, murder crime novel manages to unnerve, unsettle and keep you reading until the final outcome of the plot. Clare Cassidy is an English teacher working in a school that once was the home of a famous ghost story author. She herself is writing a biography about him when a close friend is murdered. Clare finds herself at the heart of this dark tale. A great co"}, {"Review": "With thanks to Netgalley and Quercus for this ARC in exchange for an open and honest review.I have been a fan of Elly Griffiths for years and have read all her Ruth Galloway and Mephisto and Stephen mysteries. I was excited when I found this would be a new mystery.English teacher Clare Cassidy worked at Talgarth High, her 15 year old daughter Georgia was also a pupil at the school. In her spare time Clare was writing a novel about the Famous writer R M Holland who used to own Telgarth. Holland w"}], "ID": "40796097", "Name": "The Stranger Diaries"}