{"Genre": "Crime", "Reviews": [{"Review": "These books really shouldn't work. Stieg Larsson is a very weird writer. He likes to tell us absolutely everything someone is doing. If Stieg wrote the story of my morning, it would go like this:\"Joel woke up around 7:45 a.m. and looked at the clock. He decided he didn't need to get up yet and hit the snooze button. When the alarm sounded again, he dragged himself out of bed and used the toilet. He brushed his teeth and then dressed in a blue striped shirt, black tie and flat front dress slacks"}, {"Review": "What I learned from this book (in no particular order):1. You can use duct tapes to close up serious wounds; they keep the blood in and the germs out.2. You can be shot in the head and STILL have photographic memory, though annoyingly, you will forget the solution to that pesky Fermat's Theorem that you have just discovered.3. Congenital analgesia is a useful condition to have for mafia henchmen and Bond villains.4. Muscular, one meter eighty-four tall Latina policewomen who can out-wrestle a ma"}, {"Review": "(A-) 82% | Very GoodNotes: A predictable outcome with no real surprises along the way, but characters are well drawn and the pace never slows."}, {"Review": "Dear Steig Larsson,I absolutely hate you! But,I think I love you too. While every author has some characteristic quality, yours seem to be aggravate your readers. Ever since I picked up the 1st book of this Millennium saga, I have regretted my decision countless times. You have forced me to bang my head on the wall, pull my hair, throw your books at the end of the room, and then pick it up again and read it like a mad woman, totally forgetting the outside world. So many contradictory feelings ha"}, {"Review": "”Salander was afraid of no-one and nothing. She realized that she lacked the necessary imagination--and that was evidence enough that there was something wrong with her brain.” Noomi Rapace plays Lisbeth Salander in the excellent Swedish trilogy. She takes the bad girl goth look farther than even Joan Jett.Even if Lisbeth Salander had been raised in a “normal” environment of a white picket fence, with a swing in the backyard, a dad flipping burgers in a haze of barbecue smoke, and a smiling, sun"}, {"Review": "Another short review due to glitches on GR! Lisbeth is recovering in the hospital but she has to go to court because she is being charged with the murder of her rapist. Who cares if she did in my opinion. Mikael and the gang are also trying to get things pinned on Lisbeth's evil father and such as well. Lisbeth goes to trial to prove she's innocent in this matter. She's just too cool. Fin"}, {"Review": "“If love is liking someone an awful lot, then I suppose I'm in love with several people.”This book is utterly outstanding. The whole trilogy is. Just totally, absolutely wrecking and mindblowing.It's two years ago that I read The Girl Who Played with Fire, probably four since The Girl with the Dragon Tattoo. I wanted to read book 3 right after book 2, but I went abroad for a year and didn't find the time to read it. When I returned I shied away from the sheer size of this book: 850 pages. Whenev"}, {"Review": "After finishing The Girl Who Kicked the Hornet’s Nest, the last of the Millennium Trilogy by the late Stieg Larsson, I have a great desire to order a tray of sandwiches and coffee, fire up my 13 inch MacBook Pro, and order some Ikea furniture online. Larsson’s crisp, journalistic, almost report-like prose is endearing rather than tedious and just as after finishing the first two, I greatly lament his passing for the selfish reason of not being able to look forward to more of his work. This summe"}, {"Review": "Lisbeth Salander, we hardly knew ye.It seems like a particularly cruel joke that Steig Larsson died shortly after getting a deal to publish his Millennium Trilogy. Would he have continued on with these tales of Salander and journalist Mikeal Blomkvist if he would have lived? Unless the rumors are true about Larsson’s long-time girlfriend having a laptop with a fourth book saved on it stuck in a safety deposit box somewhere as she fights with his family over the cash cow this series has become, w"}, {"Review": "It seems to be unfair to rate the two first Millenium-novels by five stars and then give only three stars for the last one. On the other hand it is not fair to write two brilliant books and then publish a 600 pages long epilogue without much of a new story, either.600 pages look like a long story, but if you skip the 300 cups of coffees Micke and his friends make, stir and drink, if you skip the complete index of the Stockholm city-map and if you skip the subplot of Erika and her stalker (which"}, {"Review": "Español - EnglishLisbeth no está muerta, pero esta gravemente herida con una bala en el cerebro. Esta interna en el mismo centro que otro paciente muy peligroso que la persigue, Zalachenko.Desde la cama y pese a su estado, usa sus habilidades informáticas para ayudar a Mikael en la investigación.Mikael sabe que no puede dejar la libertad y como se encuentra Lisbeth en manos del Estado, ya que sobre ella pesan graves acusaciones.Pero aun falta una persona mas detras de Lisbeth...----Lisbeth is no"}, {"Review": "Edited to include link to Nora Ephron's very funny piece (\"The Girl Who Fixed the Umlaut\") from The New Yorker:http://www.newyorker.com/humor/2010/0... D E P R E S S I O N… You’re probably depressed when, in the space of 3 or 4 weeks, you leave the house only when absolutely necessary, and read about 30 books – 90% of which are crap, including 15 books by Harlan Coben, a grade Z mystery writer. Even worse, you read Coben’s entire Myron Bolitar series, which is the equivalent of reading the same"}, {"Review": "This is the third (completed) novel of what Stieg had hoped would be a ten-volume opus. At the end of the last book, Lisbeth Salander had been shot by her evil and well-toasted natural father, a former Soviet spy who had been granted immunity in Sweden in return for handing over information. We pick up the story here as she arrives at an ER with several wounds, including a bullet wound to the head, with the bullets still inside. Don’t even try reading this if you have not read volumes 1 and 2. T"}, {"Review": "I loved the Millennium trilogy. I hate that I've now read every novel written by Steig Larsson."}, {"Review": "  Book Review  4+ of 5 stars to The Girl Who Kicked the Hornet's Nest, the third book in the trilogy written by Stieg Larsson shortly before he died. The series has been picked up by another author who's published book 4 and set to release number 5 later this year. This is my second favorite of the series, as nothing can compare to the first one, as it focused on family history and genealogy. Lisbeth is so tragic. And you want her to get revenge. And what happens to her over the course of a life"}, {"Review": "I didn't like the second volume of the trilogy as much as the first, so I was initially wary about this book. But after the first few chapters, I was reassured. Despite some obviously implausible elements (even in Sweden, would you really keep two people who had tried to kill each other on the same corridor at a hospital?) it is extremely gripping and well-written.Having now finished the book, I can confirm that, although it's not quite as good as the first one, it is indeed a fine end to the se"}, {"Review": "Luftslottet som sprängdes = The girl who kicked the hornet's nest (millennium, #3), Stieg LarssonThe Girl Who Kicked the Hornets' Nest (original title in Swedish: Luftslottet som sprängdes, literally, the air castle that was blown up) is the third novel in the best-selling Millennium series by Swedish writer Stieg Larsson. It was published in Swedish in 2007; in English, in the UK, in October 2009; and in the US and Canada on 25 May 2010. The first three novels in the series, The Girl with the D"}, {"Review": " Mr. Larsson, wherever you are, thank you for your magnificent story telling which, like your life, ended too abruptly and much too soon."}, {"Review": "Sarah Null woke up at 8:00. She showered, dressed, and went into the kitchen. She made some coffee and sandwiches, then she went into the living room and sat in the armchair. She opened up her Sony Vaio laptop and checked her email. There were several emails from Meghan Fang and a few from the girls in her book club. The rest were mainly junk: email coupons and the like. It wasn't until after reading her email that she logged into Goodreads.com. She took a sip of her coffee and began to write he"}, {"Review": "Goodbye, Stieg Larsson. I have only gotten to know your books more than eleven years after your untimely death, but they will continue to have a thought-provoking impact on me and my reading experiences.The \"Millennium\" series is one of the most famous Scandinavian thriller books, but only attained its status after the author's early death. While dealing with the disentanglement of a complex mystery, it can also be described as three novels full of social criticism, full of character studies and"}, {"Review": "Τρίτο και τελευταίο βιβλίο που έγραψε ο αδικοχαμένος Στιγκ Λάρσον πριν από 10 και βάλε χρόνια (πότε πέρασαν καλέ, πφφφ γερνάμε!), το οποίο συνεχίζεται από εκεί ακριβώς που τελείωσε το δεύτερο μέρος. Παρόλο που το πρώτο βιβλίο είναι αυτόνομο, όπου εισαγόμαστε στο Millennium και τους βασικούς ήρωες, τα επόμενα δύο είναι αλληλένδετα. Ευτυχώς, η ιστορία κλείνει, γιατί ο συγγραφέας πέθανε ξαφνικά από ανακοπή χωρίς να έχει επίσημα παραδώσει κάποια συνέχεια. Για όσους δεν γνωρίζουν τα παρελκόμενα της σ"}, {"Review": "Sin duda alguna, una de las mejores trilogías que he leído.No sé si me ha gustado más esta parte o la anterior.La parte del juicio me ha dejado con la boca abierta, y el final ha sido perfecto.Me da mucha pena que el autor falleciese tan pronto, me habría gustado poder disfrutar de más libros suyos."}, {"Review": "I find this entire series very unenjoyable, but I appreciated what I felt were academic analyses of consent and power in the first two books. Because this third installment failed to present any academic point, there was really nothing for me here. The attempt was clearly to say something about how, traditionally, women have actually fought in wars, not stayed on the sidelines fainting and tending to wounds like, I don't know, some people expect, but really the story was more about how cool wome"}, {"Review": "E, pa svaka čast Larssonu! Toliko likova, toliko događaja, toliko zavrzlama koje su na kraju savršeno povezane i razvezane! Pisca nema već više od 12 godina, ali pali i žari i dalje! Sigurna sam da je ponosan! ;)Obavezno čitati redom, ali rekla bih i u kratkom razmaku kako bi se kvalitetno pratila radnja. Bila sam \"u strahu\" da mi se trilogija neće svidjeti jer je svima savršena, ali ispalo je da sam i ja u tom klubu! ;)Na kraju bih dodala da se isplati pogledati i švedska ekranizacija trilogije"}, {"Review": "My Rating: 4.2/5RTC"}, {"Review": "The third and final volume in the series, more like part two of The Girl Who Played with Fire, but I am not complaining these books are brilliant, fabulous story line with wonderful and colourful characters. Lisbeth Salander is a marvellous invention by the author, a very unlikely heroine, but credible all the same. I found this series totally gripping and almost unpredictable. I recommend these books to anyone who likes a good read, but especially those that like crime thrillers."}, {"Review": "This is the third book in the Millenium trilogy, and - thankfully - the last, because my hands were starting to feel a bit shaky after supporting these five centimeter thick book whenever I went around in a quest to find the most comfortable spot in the apartment without being bugged by my too enthusiastic budgies.Sadly, I couldn't say the same praise toward this one as I did to the previous two books. To begin with, I'd say this book is a must read, well if you want to know the ending of the wh"}, {"Review": "Ok, I went from wanting to hug Lisbeth in previous book to high fiving her in this one. Blomkvist did ok too. Ok, he did more than ok, he can have his cookie. Can they have more interaction already? And now that that chapter of her life is over, what's next? I should probably binge the swedish movies again before reading the next book, Hollywood versions were a drag and a new one from what I hear just plain sucks.Over and out"}, {"Review": "I also reviewed this book on my blog if you'd be so kind as to check it out! https://thatgirlbookworm.wordpress.co...You can also buy a copy of this book here!3 or 3.5. I still am undecided. My heart tells me 3.5 but my mind tells me 3 stars.So before I start my review I want to say that this trilogy is amazing! It's a 5 star trilogy and well worth reading. My rating for this book and my following review do not in any way denounce this trilogy, I will recommend it until I die and it is definitel"}, {"Review": "I really enjoyed “The Girl with the Dragon Tattoo,” which not only succeeded as an exciting thriller but contained elements of interesting characterization and relationship intrigue. Unfortunately, the Millennium series does not appear to be one which improves upon further acquaintance. “The Girl who Played with Fire” was an adequate thriller but not great, and “The Girl who Kicked the Hornet’s Nest” was just plain disappointing, not to mention way too long. 743 pages?!? I wanted to put it down"}], "ID": "6892870", "Name": "The Girl Who Kicked the Hornet's Nest"}