{"Genre": "Crime", "Reviews": [{"Review": "3.5 Unexpected Stars for Hunting Annabelle It's no secret I enjoy reading about psychotic killers and aggressive, unremorseful sociopaths. Thrillers are my jam!  Hunting Annabelle  had all of that, along with a damaged MC that you can't help but feel some sympathy for. Yikes, did I just admit I found a sociopath endearing? Yes, I did! I was intrigued by the premise of the book. Sean Suh is a killer. He is fighting demons daily, trying not to kill again. Then he meets Annabelle. He falls hard - t"}, {"Review": "This book will make your mind spin and your palms sweat, an edge of your seat ride into crazy town!Oh how I love to spend time in the mind of a psychopath! Although in the case of Sean you were never quite sure if he was a psychopath or a victim? This really was what set this book a bit apart, the not knowing if you were sympathetic towards the bad guy or the good guy... but good or bad Sean was definitely an odd duck...Sean has recently been released from a psychiatric hospital, for reasons you"}, {"Review": "Unfortunately, Hunting Annabelle wasn't the story for me. I did not like this. It started out promising, as the author's writing is actually quite strong, but the story, yeah, just did not do it for me.Around the 50% mark it turned for me and I never got my interest back. Our protagonist, Sean Suh, is a Korean-American in his early 20s who you discover early on has some pretty strong urges to hurt and kill young women. In fact, you learn that he acted on these urges at least once in a severe eno"}, {"Review": "FIVE STARSSean Suh. His name doesn’t exactly roll off the tongue, but that doesn’t matter. It works. Sean Suh is the main character, otherwise known as the UNRELIABLE NARRATOR, in debut author Wendy Heard’s novel, Hunting Annabelle. Is he a serial killer? Is he insane? Or just a one-time killer? You won’t know until the very end…(tease tease)!You will know that he is an odd duck. I guarantee he will command your full attention from page one. Delectably untrustworthy, yet incredibly sympathetic…w"}, {"Review": "Amazing!! This was a four star book for me from the very beginning....Then the ending just blew me away! Such a fresh take on the psychological thriller I love. Truly original. I highly recommend this book to all mystery/thriller lovers. You will not be disappointed!! Special thanks to NetGalley for the free copy in exchange for my honest review."}, {"Review": "3.5 terrifying starsSean is quite a troubled young man, recently released from a mental institution after being convicted of a grisly murder. Sean is mentally ill, raised by what seems to be an uncaring brilliant neurosurgeon mother, he tries to escape the hallucinations, the psychotropic drugs the delusions, and the overwhelming urge to kill. He sees auras indicative of his schizophrenia, and then one day in a park he frequents he meets Annabelle and there is an instant connection. Could this b"}, {"Review": "Hunting Annabelle features Sean, a twenty-something young man battling the personal demons surrounding his profound mental illness, when a girl he just met is kidnapped before his eyes...or was she? What follows is his pursuit to find out what happened to Annabelle while simultaneously being investigated by the police as the prime suspect in her disappearance. I enjoyed the first third of this book, however, the novelty of the plot was quickly ruined for me. I became bored with Sean's endeavor t"}, {"Review": "Dynamic, compelling, and totally twisted, HUNTING ANNABELLE blew me away. I’m still reeling. What a mind Wendy Heard has. What a debut!"}, {"Review": "Wendy Heard’s Hunting Annabelle is the best kind of psychological thriller - dark and twisted with a generous side of creepy. I had no idea where this story was going, only that i was rooting for Sean, the tortured hero whose search for Annabelle means releasing his own inner demons. Gritty, intense, and 100% surprising, Hunting Annabelle is one hell of a wild ride."}, {"Review": "Hunting Annabelle, Wendy Heard's impressive debut novel, is a truly engrossing read. From the moment I picked it up those pages were feverishly turning, faster and faster I flew until it was completely devoured. Despite having not been born until the late 1980s I thoroughly enjoyed the references to the times and thought it added a distinct mystique and intrigue to the story, and I loved how Heard builds her characters until they are complex, multi-layered and incredibly realistic. I found antag"}, {"Review": "I received a free e-copy of Annabelle by Wendy Heard from NetGalley for my honest opinion.A creepy, chilling psychological thriller that pulls you in in the first few pages. Sean, who is mentally ill, is a man who loses track of times. Sean, recently out of a mental institution, is living with his mother and is still very unstable. While visiting the local them park he meets, a beautiful girl named Annabelle. Annabelle spends the day with Sean, and then asks him to meet her again the next day. W"}, {"Review": "Hunting Annabelle... what a fascinating premise. Sean is battling his on demons with his mental illness. He has just been released from a mental institution for his previous horrible crimes and is trying to live a \"normal life\".Sean meets Annabelle at the park one day and instantly falls for her. They decide to go on a date and Sean swears that he sees someone kindnap Annabelle in a white truck on their first date. What follows is a twisty, dark, and creepy journey trying to find out what happen"}, {"Review": " Thanks to NetGalley and the publisher for providing me with a free, electronic ARC of this novel received in exchange for an honest review.  Sean Suh is trying to start his life over. After three years spent in a psychiatric institution for murder, he is hoping that a new city and a new home will bring about the change he so desperately wants. When he meets and quickly falls in love with Annabelle, he feels that he might finally be on the verge of a brand new life. When Annabelle is kidnapped i"}, {"Review": "I never thought I'd feel sympathy for someone with a thick current of evil running through their veins. And then I read Wendy Heard's astonishing book. Twists more crooked than tree roots. Coal-dark tension with heart and a hero you just can't stop from wanting to find some happiness, even in the face of unspeakable impulses. Smart, sensual, terrifying: don't miss it!"}, {"Review": "It's 1986, and Sean Suh is a reclusive, artistic, and troubled young man. He is in outpatient therapy with a licensed psychiatrist multiple times a week, and is monitored by his mother, world renowned Dr. Suh from San Francisco. After Sean was released from the mental institution he was sent to, the family moves to Texas in hopes to escape it all. Sean bumps into Annabelle one day while drawing out in public, and the two hit it off almost instantaneously. Annabelle isn't judging Sean for his app"}, {"Review": "This book was super entertaining. The writing was great. The characters were interesting. It was well paced. The plot was engaging and full of twists and turns. I would have given it 5-Stars, but I thought the \"twist\" was a little far-fetched, and what in the heck happened to his (view spoiler)[ Mom?? (hide spoiler)] Other than that this was a great read. "}, {"Review": "Hunting Annabelle is a story of a mentally ill boy Sean looking for a girl he met a few days ago and who was kidnapped in front of his eyes. The problem is that nobody seems to believe Sean's story as he is a schisophrenic and might have just imagined it all. In addition, once the police learn of Sean's violent past they believe it is Sean himself who is behind Annabelle's disappearance. But is he?This was an unusual read for me. What started as an innocent type of story - 'a boy meets a girl' g"}, {"Review": "Gritty, intense, and full of multi-dimensional characters that will keep you guessing until the end, Hunting Annabelle is a must-read psychological thriller. Readers of Gillian Flynn and Caroline Kepnes will adore Wendy Heard! "}, {"Review": "I am not sure what I just read. I feel disgusted and angry and very manipulated as I finish this book. Are there people in the world that enjoy killing? Of course, serial killers have been documented from years ago to present day. The question is do I really want to read about them and for the first 3/4 of the book I sort of fooled myself that I did but then there is a sudden shift in this story and Sean, our hero (wrong word choice) moves forward in his search for Annabelle and something happen"}, {"Review": "This was a fantastic story told completely from Seans POV. Embarking on a journey together and as the story unfolded I felt I really got an insight into what made him tick.There was almost an air of obscurity, intrigue and mystery enveloping the whole narrative and this made for such compulsive reading with some real shockers thrown in along the way.I found myself questioning the hidden motives of every single individual here and as we are almost drip fed the answers this was almost at times lik"}, {"Review": "I really struggled with this one. The ending saved it for me, or this would have been 2 stars.I realize that this is a debut, so I have to give credit for that alone...I envy anyone who can put anything on paper and get it published. With that said, this was just a bit all over the place for me to really grab a hold of. The premise was great and had me excited going in, but it never took off for me. Others have had much better luck, so give it a go!ARC provided by NetGalley"}, {"Review": "Hunting Annabelle is dark, twisted, and completely addictive. The characters will grab ahold of you and won't let go even after you've turned the last page. You'll both love and hate Sean and he'll leave you questioning everything you thought you knew about your own inner demons. Get this book the moment it comes out and let it consume you!"}, {"Review": "With a protagonist you’ll almost hate to love, and more twists than a foot-long corkscrew, Hunting Annabelle is a compulsive, deliciously addictive psychological thriller that pulls you in from the first page, and doesn’t let go until you’ve reached the shocking end. A must read!"}, {"Review": "Netgalley # 66GR giveaway winA book for all Seasons read-name in the titleMany thanks go to Wendy Heard, MIRA Books, and Netgalley for the free copy of this book in exchange for my unbiased review. Sean hangs out at his local amusement park and creates art in his sketchbook. There he meets Annabelle. He finds her captivating. They make a date to hang out another day, and sat the end of that day she is abducted. Sean spends the rest of the book looking for her because everyone thinks he's crazy."}, {"Review": "WOW...A jaw-dropping and twisted debut thriller! This book is unlike any book I’ve read. The more I read, the harder it was to put down.EXCERPT - “Her scream echoes in my memory. I know what happened. Whether anyone believes me or not, I know.”Sean is a mentally ill young man living with his mother after being released from a psychiatric prison. He spends his days hanging out at a nearby park and sketching, where he meets Annabelle. Then Annabelle disappears.Sean is sure she’s been kidnapped—he"}, {"Review": "Hunting Annabelle is solid 4 stars for me. A psychological thriller, it’s a dark and unique type of book. Sean spent three years in a psychiatric hospital (released way earlier than he was actually sentenced) for killing his girlfriend. Diagnosed as a schizophrenic, he now spends his days living with his neurosurgeon mother and hanging out at a local amusement park-people watching and sketching them. This amusement park is where he meets Annabelle-a college pre-med student. Sean immediately beco"}, {"Review": "Holy hell! What an amazing roller coaster ride! I was hooked from page one and felt horrible for Sean even though he was a murderer. I never thought I could feel any kind of empathy for a murderer before but this book had me rooting for Sean the whole way through. I never knew what was coming next which made me keep on reading in hopes to guess what happened to Annabelle. Freaking amazing! Thank you Netgalley for the awesome read!!!"}, {"Review": "I always get a bit excited when I see a Korean-American lead in a book. Even if he's one of the most unreliable narrators I've come across in a while! No one seems to believe him when he says he saw Annabelle get abducted so it's up to him to find her. In doing so, he finds himself - or at least a part of him he was extremely confused about.As a debut, this is a fantastic start to a long career for Heard. I love where her mind went with Suh's story. While I did feel it jumped the shark a bit at"}, {"Review": "Hunting Annabelle is a suspenseful on your toes book. It will keep you guessing. Sean is fresh out of a psychiatric unit living with his mom. Sean starts a friendship with a woman named Annabelle who he believes is kidnap."}, {"Review": "4 stars. This is one sick ass book and I really like it. LOL!"}], "ID": "35612376", "Name": "Hunting Annabelle"}