{"Genre": "Crime", "Reviews": [{"Review": "The Post in Which I Muse on Audio Versions of BooksStop reading the paper copy and give listening a go. You will likely not believe me; you will tell me that you hate audio books, that you lose track, fall asleep, and are 100% unable to pay attention. I believe you; until this series, you could have counted my attempts at audio books on one hand, as I suffered many of the same complaints. When I listened to Harry Potter while driving, I found myself getting sleepy. If I listened while cooking, I"}, {"Review": "Londinium Calling!“and I – live by the river!”His best so far? Maybe, but I’m biased, I love these books, they are to me as cheeseburgers to a fat guy. Wait – I’m a fat guy and I LOVE cheeseburgers! * Note to self about getting lost in a metaphor. And cheeseburgers.Fans of Ben Aaronovitch’s wildly popular and fun as a barrel of monkeys urban fantasy series about DETECTIVE constable Peter Grant who is also an apprentice wizard have been waiting since 2016 for this novel – and I hate waiting so it"}, {"Review": "Coming back to Peter Grant is always a super-huge breath of fresh air. Every time I pick up one of these books, I know I'm going to be blown away by hugely interesting details, a very tongue-in-cheek Deputy-Constable's wry humor, and a richly imagined and described London.Oh, yeah, and Peter's a wizard. Working as a cop.Always under the bureaucratic nightmare, wishing things hadn't gone so bad with his previous partner, having sexytimes with a river... it's all GOOD. Even the takeout and stakeou"}, {"Review": "My greatest concern after finishing Lies Sleeping is that it may be the final book in the series. After all it does conclude the story of The Faceless Man which has continued over the last several books. It also leaves Lesley and Peter in ways that could be seen as conclusive, where the reader can be left to imagine how they will go on in the future. It is a fun book with all of the regulars turning up to play their parts. Molly finds a new friend, Mr Punch shows up and is taken in hand by his d"}, {"Review": "This is one of my all-time favourite series – and this installment was eagerly awaited and did not disappoint, as usual. There is just something charming and compulsive about this series that makes me very happy.I won’t write about the plot so much, because doing so invariably would spoil the books that came before (and what twists and turns there were) except to say that I found the way the story went and how some parts wrapped up highly satisfying. I know that there is a novella coming out in"}, {"Review": "4 of 5 stars at The BiblioSanctum https://bibliosanctum.com/2018/11/08/...I’ve made it no secret that I love Peter Grant/Rivers of London, and right now, it’s easily one of my favorite urban fantasy series. But for the last few books, our characters have been floundering in their hunt for the Faceless Man, the main baddie who has been a constant thorn in the Met’s side since the very beginning, and I was starting to worry that the lack of progress might soon be blowing up in all our faces. Lucki"}, {"Review": "4.5*A bit slower first half but picks up pacing later on. I read it right after The Furthest Station which being short had everything more condensed. In comparison Lies Sleeping plot felt somewhat scattered with less humour, although overall tone seems lighter. It's still fun. Can't get enough of Peter Grant series! :)"}, {"Review": "This was excellent! I loved all the London history. I loved Foxglove and Molly dancing in the moonlight. I loved the foxes. The main characters are well established now and the narrator was excellent."}, {"Review": "Thanks to Netgalley and the publisher for providing me with an ARC in exchange for an honest review.Another strong installment in the Rivers of London series. The battles with the dark side are becoming more and more frequent, now that we know the Faceless Man and see more of his plans. But this one takes some even twistier twists and turnier turns and ends up in a place I didn't really expect.I had grown tired of this series after book 4, and took a VERY long break. In fact, I hadn't entirely p"}, {"Review": "Ah, that went by way too fast.If you're already a fan of the series, you won't be disappointed. And my, how our Peter's growing up, but without losing any of his self-deprecating irony. If you're not a fan yet, be apprised that Aaronovitch wrote for years for Doctor Who,  and it very gloriously shows. You'll want to start with book #1,  Rivers of London.  Snag an audio copy if you can, because the audios are amazing.slideshow disclaimer: neither Banksy nor the helmet amulet figure in the book. I"}, {"Review": "A great follow up to The Hanging Tree, Lies Sleeping continues to follow Peter Grant and his search to hunt down and thwart the plans of The Faceless Man and his apprentice while getting himself mixed up in the demi-monde world, which this time involves bells, along the way. As I said when reviewing The Hanging Tree, I’ve found these novels to get better and better as they progress as the world is now so well established, and the characters are all charismatic and varied. In particular, this wou"}, {"Review": "Move over Newt Scamander, there's a new wizard in town! With better plots that actually make sense and not just load of over-egging codswallop!Sorry, I was still a bit carried away with the Crimes of Grindelwald movie. I thank thee, Ben Aaronovitch, for keeping my faith in urban fantasy and their wizards. Peter Grant is still my man, he is a solid character that's skillful, dedicated and dependable. Boring? Not a chance. Peter, as his colleagues and guvs always said, had a penchant for situation"}, {"Review": "at this point ben aaronovitch could publish a book of photocopies of his bare arse and i'd give it five stars. regardless of that this book fucking ruled"}, {"Review": "My favorite Peter Grant so far.  “When you’re police, an interesting lie can be as useful as the truth. Sometimes more so.”“We seem to be sitting around waiting for the next fucking disaster,” he said, which went into the official log as—DCI Seawoll felt that our operational posture was too reactive.“None of this was real. But I’ve learned that just because something isn’t real doesn’t mean it’s not important.” "}, {"Review": "So, this was a rather fast one and no matter how hard I tried to read it slower, it didn't work (though not like recently I'm a very fast reader, to be honest....). Names, names, places, history, architecture, the pack is full and maybe even fuller than in last two books. L. is back and Mr Punch as well - I'm not spoiling, it's on the blurb! - and I had to confess I kind of... missed him? O.o I guess I'm going to reread the first book soon just because of that... O.oAnyways, fun fun, and I crave"}, {"Review": "(More like 3.5 stars, to be honest.)I had fun while reading this, but I can't say that I enjoyed it as much as I did previous instalments in the Rivers of London series. Peter's narrative voice is as fun as always, there's the potential for comedy and drama in the promised arrival of a baby Brook, and I'm glad that the Chorley storyline has been wrapped up (he couldn't go on doing Spectacularly Evil Stuff indefinitely without being omnipotent and/or making the Folly team seem incompetent.) I had"}, {"Review": "This book follows  The Hanging Tree (Peter Grant, #6)  (my review) and ends (maybe?) The Faceless Man #2 story arc. In the process it advances the teeming multitude of long-term series plots, including the important Lesley May plot-line while creating more. I frankly found this book to be too much a tangled spaghetti of plots and characters to be truly enjoyable.I’ve been a long-term fan of Ben Aaronovitch's Rivers of London. I typically listen to them on audiobook, although I have read several"}, {"Review": "Halfway through the book I was still trying to find a cohesive plot. No red line in this one, more like the odd breadcrumb of something familiar... the breadcrumbs made up a story eventually and there were lots of entertaining bits and chuckles. I loved Foxglove. But the final battle was a bit WTF, the resolution was a teeny bit lame and the ending left me with a „Wait, what? That was it?“So, was that really it? The end of the series? Hm. Not sure how to rate this. 4 stars, because the overall s"}, {"Review": "Although it started kind of slow and it took me a little to get used again to the rhythm and Aaronovitch's writing, of course I ended up liking this a lot, as expected."}, {"Review": "Another great installment in this excellent series. One small caveat though. I enjoyed it while I was reading it, but now that I'm not reading it anymore, I'm having some trouble recalling the scattered sequence of events. The plot and mystery are fairly clear-cut, as is the ending, but the way in which the investigation is moved along from one point to another is... hard to recall... for some reason. Or maybe I'm just getting old and my recall reserve is quickly dwindling."}, {"Review": "A satisfying climax to the Folly's operations against the Faceless Man sees our man Peter at his earnest best.This is one of the best urban fantasy series currently being published, and a lot of that is down to the main character Peter Grant and his commitment to community and policing, and more critically, his fundamental belief in both. His point of view can be wry, but he has such a deep belief in the fundamental rightness of what he's doing that it makes him a protagonist that you can't help"}, {"Review": "I have been waiting with fluctuating levels of patience for \"Lies Sleeping\" to drop. It was worth the wait.In \"The Hanging Tree\" we learned the identity of the rogue wizard known as the Faceless Man whom former PC Lesley May had gone to work for. In \"Lies Sleeping\" we learn why Leslie defected to the Dark Side, so to speak, and it's not pretty.Since learning the identity of the Faceless Man, several things have happened. PC Peter Grant is now DC (Detective Constable), and DC Sahra Guleed is now"}, {"Review": "A great 5 stars from me, I really enjoyed this book. I have to say how Ben does great research into the historical London and then ties it into his plotlines with a great deal of action and entertainment.Can’t wait to see where Ben takes the series after this book."}, {"Review": "3.5 StarsGood fun but not as interesting as the previous books."}, {"Review": " There are few series (serials?) that I last past book 3 or 4. Clearly this is one of them. After 7 books I think me liking the characters should be a given so what did I like or dislike compared to others in the series.My one ding on this one is that the novelty has worn off a bit. Everyone, for the most part, seem to be doing the same things which is comforting but might not keep my interest forever. I like Abigail's increased role and I am looking forward to more of Foxglove (hopefully) but I"}, {"Review": "I received a free ARC of this book via NetGalley. Thank you, Net Galley, I love this series. I can't wait until the audio book is out because all the characters are voiced by Kobna Holdbrook-Smith even when I'm reading the ARC. Action, magic, creepiness, and police procedural all wrapped up into one, and I'm only in the middle of the first chapter. I have still pre-ordered the audio book, though, because the writing really comes alive when Kobna Holdbrook-Smith reads it.Update: Lots more history"}, {"Review": "The worst thing about binging an ongoing series is that, eventually, you run out of books."}, {"Review": "I always think that pre-ordered Kindle books feel like surprise presents from Past Me to Present Me, and I was particularly pleased to have something I knew was going to be fun and entertaining, in the shape of Ben Aaronovitch's seventh Peter Grant novel, Lies Sleeping, to look forward to through the last few days of what felt like a Very Long Week last week.It didn't disappoint; there were lots of humorous reflections on policing, magic and the relationship between the two, enjoyable character"}, {"Review": "A really satisfying conclusion to the Faceless Man arc, and I enjoyed the deep dive into London history. As always, Peter never fails to amuse."}, {"Review": "The latest in the series doesnt disappoint and some loose threads from previous books are tied and looking forward to the next in the series"}], "ID": "36534574", "Name": "Lies Sleeping"}