{"Genre": "Crime", "Reviews": [{"Review": " “The face you give the world tells the world how to treat you.” There is something deeply unhealthy about this book. It's in the characters, in the story, in the relationships, in the sex, and just in the general mood of the novel. Reading this made me feel a little unwell, both physically and mentally, but I am glad I did. If you know me, you'll know I love complex characters with issues that feel raw and real, rather than melodramatic. The people in this novel are majorly fucked up, no one is"}, {"Review": "Last week I read the fuck out of Gillian Flynn's catalog. Three novels in eight days while my wife and kids were out of town and a sweltering late July marooned me in one of the house's two air conditioned rooms. So although this review is primarily for Sharp Objects, my favorite of Flynn's trio, let me go on record with Gone Girl (four stars, go read another of the zillion of reviews) and Dark Places (three stars, maybe too many narratives perspectives and too willing to wallow in the muck) as"}, {"Review": "Little buddy read with Her Majesty La Lionne and Jerry on January 31st!! :DThis is my third Gillian Flynn book, after Gone Girl and Dark Places. The first one blew my mind, the second one freaked me out a little and this one really scared me. Sure, after reading 5% of it I was like --a creepy story with the potential of giving me special nightmares, but by 90% I was likeWTF did I just read??All the characters were disturbing, especially even the children. Allow me to start with Camille. She's a"}, {"Review": "The razor blade on the front cover of the book is what one yearns for right after embarking on this read, sharp blade with which to cut every single page, one by one, until they are so neatly shredded that even the memory of what was written on them becomes non existent. And then, one can use the same razor to end one's own life. I'm still unsure what the author was thinking when she began this book, unless she had some very deep and very disturbing mental issues to work through. This book is da"}, {"Review": "Camille Preaker is a young Chicago reporter with a troubled past. When a second young girl goes missing in her home town, Wind Gap, MO, Camille’s fatherly boss sends her down to get the inside scoop. Who says you can’t go home again? Well, maybe you can, but would you really want to? There is a reason she is in Chicago, instead of Podunk, MO, and the danger for Camille lies as much with her delicate psychological state, a product of her childhood, as it might with a psycho-killer on the loose. \""}, {"Review": "2.5 Stars. Unfortunately, I did not love this book and it is probably my least favorite of Gillian Flynn's work. As this was her debut, I'm happy to say I feel her later works show great improvement and a lot of strength.CW: self-harm, sexualization of children, murder, child abuse (I don't normally put content warnings under spoilers but this warning is so integral to the ending AND it's so specific that I don't want people attacking me for spoiling the book) (view spoiler)[Munchausen By Proxy"}, {"Review": "*3.5/5*I felt like this book was way too slow paced for how short it was, and it sort of bugged me that the big reveal and explanation was left to the VERY end. It was like nothing nothing nothing BAM EVERYTHING. However, the ending was crazy and twisted and I loved it! I just wish that craziness had been spread out a bit, because when I finally got it, it was over too fast. Overall, a pretty good read. "}, {"Review": "Update 10/2018Doesn't seem that edgy 8 years later. We are not lacking in female anti-heroes now. The novel and the show complement each other rather well. Liked the neater ending of the book more though, but the show is a visual feast. Interesting how the show creators chickened out and made Amma older, to not offend our sensibilities? Amy Adams is fantastic as Camille.Original reviewIf you ask me which words come into my mind first whenever I think of this book, my answer will be: nasty, dark,"}, {"Review": "Well, this was a pleasant surprise. I remember all the ruckus over Gillian Flynn a while back, and my resulting tracing (not carving) of a mental note on my palm that I should eventually read something by this gal because everybody was all in a tizzy over her wonderfulmousnessity back whenever, and I was confused by that fact based on the book descriptions alone. It all just sounded like mass market thrillers dressed up in fancy lit fic suits. Ya know, the stuff of mediocre books which sometimes"}, {"Review": "عالم النساء..معقد، متشابك، صعب فهمه..مضطهدا سواء كان المجتمع شرقيا أم غربياوهذه الرواية الكئيبة السوداوية تقتحم جانب مظلم من هذا العالمكتبتها أمرأة..تقتحم جوانب نفسية معقدة لثلاث شخصيات رئيسية من النساء بأعمار مختلفة..شخصيات قاتمة ، مظلمةقد تجد بعض تصرفاتهم كريهة، بغيضة..صعبة ،مريضة.. لكن من أنت لتحكم عليهم، بالاخص من مكاني بعالم الرجالفالرواية تعرّي ايضا استغلالنا لهم احيانا، تعرّي المجتمع ونمطية نظره وتمييزه ضد المرأة هناك روايات تتعايش مع أحداثها ، كأنك في موقع اﻷحداث وتعرف اﻷبطال جيدا..قليل"}, {"Review": "Disturbing story. Disturbing characters. This book will make you feel uncomfortable, that's what Gillian Flynn does best!I'm not sure I loved it but it's definitely the best written thriller I've read so far this year... still only getting 3.5 stars though!I did suspect the right people but the twists were still... well disturbing!"}, {"Review": "1 StarOverview: I should have known better. I don’t have an excuse.I read Gillian Flynn's other book, Gone Girl, last year—and wasn’t a fan. Everyone raved about it, but I found the characters shallow, the plot twists weak, and the narrative so busy being cynical it didn’t seem to know what it was trying to say. Nevertheless, I’d heard great things about Gillian Flynn’s writing. So I went into this with an open mind--- maybe I had just started with the wrong book! But I really should have known"}, {"Review": "Update - NEWS ABOUT the HBO mini-series of \"Sharp Objects\". Who else has seen it? What are your thoughts? Which did you enjoy more? The book or the series?Amy Adams was outstanding!!! One of the best acting roles I've seen her play. VERY creepy show -- 'excellent' -- All the actors were great. In many ways --I liked the HBO show more than the book. I know --weird --right? --Or??? maybe I was more prepared for just how disturbing this story is! The ending in the HBO series -- was ................"}, {"Review": "3.5 stars.I’ll be honest, I was scared to read this book.It gave me horror vibes, and because I do not read horror – with very few exceptions on Halloween – I didn’t even want to think about reading this book.But then an opportunity fell into my lap, and so here we are. Turns out, it’s not scary. But it is quite disturbing. I can’t wait to watch the series with Amy Adams. It has got to be pretty captivating and I am curious to meet all of these characters on screen, perhaps they will be far more"}, {"Review": "When I had first come across rave reviews of Gone Girl, I was bowled over by the fact that there's after all a woman who is brave enough to try her hand at a genre rarely ventured into by women writers. And apparently, she excels at it too. Surely, she couldn't have hoodwinked hordes of unsuspecting readers into giving her books such high ratings.So I had decided I'd devour Gillian Flynn's entire oeuvre starting with her first published work. Needless to say, that it is with obvious disappointme"}, {"Review": "“I just think some women aren't made to be mothers. And some women aren't made to be daughters.” ― Gillian Flynn, Sharp ObjectsThis is one of the darkest, most disturbing books I've ever read. And I love it. Well, today I love it. I picked it up years ago, started reading and was like \"no way Jose\". I had read Dark Places and Gone Girl and, of course, thought I could handle Sharp Objects, the Gillian Flynn debut. I wasn't ready at the time for this little monster of a book.The extremely creepy p"}, {"Review": "okay so i,of course, was initially drawn to this book because it has shiny cover. i am like a magpie or a raccoon or something... and then it just sat on the shelf for ages and one day i read the description of it somewhere. and it's all \"whore\" on her ankle and \"pain\" on her heart or whatever.(which is not on the back cover copy, but is right up there in the goodreads.com description) and i thought - \"oooh you are so edgy and shocking!!\" and i rolled my eyes and figured i would just never read"}, {"Review": "Squee! This is coming out on TV on Sky Atlantic. I cannot wait! (2018). I don't know about you, but in my opinion this is WAY better than Gone Girl, I think this one is a hidden gem. It's a lot more subtle but that's why it works more. This is one spine-chilling disturbing and dark book and I absolutely loved it. Some of the scenes in this book literally just stunned me. Very clever writing from Gillian Flynn.When two girls are abducted and killed in Missouri, journalist Camille Preaker is sent"}, {"Review": "From the first page, I felt the author had just finished a Chuck Palahniuk novel and decided she wanted to be like him when she grew up. Sentence fragments can be fun if you're in the mood for things like \"A belly. A smell. He was suddenly standing next to me.\" (Not exact quotes, but pretty close.) I wasn't in the mood, and it was irritating. Also, I couldn't enjoy the main character. I found the scene where she was 12 years old and in someone's hunting shed, full of dead, bloody animals and por"}, {"Review": "Español - EnglishLa protagonista tiene fallas como todos la tenemos, pero tiene una forma de narrar que te intriga a seguir leyendo. Cuando era solo una niña murió su hermana y desde entonces escribía palabras con cortes en su piel. Motivo por el cual estuvo ingresada en un hospital psiquiátrico.Trabaja como reportera y se ve obligada a ir a su pueblo de infancia a cubrir un reportaje de una niña asesinada y otra desaparecida. Es realmente perturbadora la relación que Camille tiene con su madre,"}, {"Review": "Terrific book, truly creepy. A page turner about a journalist going back to her tiny Missouri home town to cover the recent murders of two little girls. Gillian Flynn's writing in Entertainment Weekly has always been a notch above, and her first novel is no disappointment.What's remarkable about this book is that it focuses on some of the most damaged and interesting women I've ever seen in fiction. Strong women in fiction usually means one of three things:1) Ass-kickers in fantastic outfits tha"}, {"Review": "Finally I climbed out under my rock to read my first GF novel. I was happy I did. Camille got under my skin, zero pun intended, and I enjoyed the whole ride. Whilst graphic, I wasn’t bothered, and whilst dark this was fine too. I was impressed with the writing of this book and understand why this author has hit it off worldwide.Camille is a very troubled young woman, a mediocre journalist and a recovering cutter. Self harming herself in the most dreadful way, by inscribing words into her skin. A"}, {"Review": " “Sometimes if you let people do things to you, you're really doing it to them.” It's freaky and twisted. It's terrifying and compelling. You'll sit down, grab the book and read it until you've reached the last page. No kiddings here. I read this in one sitting, no pause for water, no pause whatsoever. It'll creep you out and fascinate you and you'll connect with the story on many levels. I did. I connected with the character and I'm still having nightmares about it.By all accounts, this is a Gi"}, {"Review": "\"I just think some women aren't made to be mothers. And some women aren't made to be daughters.\"Journalist Camille Preaker is sent back to her hometown, where one girl has been brutally murdered and another one is missing.Dark and twisty and fucked up characters are my FAVE, and Gillian Flynn seems to be the absolute queen of creating them. Although one of the issues with having such car crashes for human beings in your stories is that you often don't have a character who you really root for or"}, {"Review": "This book was so stupid and hysterical and I loved every second of it."}, {"Review": " Grippin’ book!  WHERE EVERYTHING STARTED Gillian Flynn is one of the most worldwide famous and popular authors nowadays with best-selling novels like Gone Girl and Dark Places, along with the short story The Grownup, but her debut novel was this one, Sharp Objects.Flynn’s style features broken characters, nasty acts, gruesome crimes and plot twists, showing a face of American contemporary towns (not matter if they’re ficticious) that it’s not so common portraited……and a truly grippin’ narrative"}, {"Review": "Τα αιχμηρά αντικείμενα σκίζουν συναισθήματα,σχέσεις,σκεψεις,δεσμούς ιερούς και μη αφήνοντας ανεξίτηλα σημάδια και εμπειρίες ζωής! Όσο και να εξωραΐζεται το κακό παραμένει πανταμεσα στις ψυχές και την κατάλληλη στιγμή στις κατάλληλες συνθήκες δείχνει το πραγματικό του πρόσωπο! Το ψέμα η εικονική ανθρωπιά και αλληλεγγύη,η τοξική χαμογελαστή παράνοια προσπαθούν διακαώς να μας πείσουν για επίπλαστες ανθρώπινες σχέσεις ! Τελικά οι άνθρωποι που δεν αγαπήθηκαν και διαταράχθηκαν ψυχικά απο αυτη την έλλε"}, {"Review": "BEST GILLIAN FLYNN BOOK. By a mile. Sorry, Gone Girl, you are no longer welcome here. (Just kidding I'm probably going to reread it in one absolute second but will it be as good as this book? No, it will not.)This is so CREEPY and the writing is so visceral and it's so unique. There have probably been thrillers like this one since this one, but definitely not many before. There are so many characters that are just hopelessly fascinating. Like, all of them, basically. Any time the protagonist get"}, {"Review": "I really liked Gone Girl, but was quite disappointed by Dark Places, so I had absolutely no idea what I would think about this book. I'm happy to report that this one was another win for me! It was a super easy and fast read with a solid plot and interesting characters. In fact, I think the main character Camille is my favorite one out of all the ones Gillian Flynn has created over the years. Some actions of hers seemed a bit too hectic (?) for me though; I couldn't understand why the author dec"}, {"Review": "Eek. This book was twisted and eerie, it was very good. A true page turner. "}], "ID": "18045891", "Name": "Sharp Objects"}