{"Genre": "Crime", "Reviews": [{"Review": "Blood for Blood was both a page-turner and a disappointment. What began as an edge-of-your-seat read quickly deteriorated into a muddled pool of feints and missteps. The book starts on a commuter train where Ziba MacKenzie is engaged in people-watching. It’s clear that she is keenly observant as she relates the minute details of her fellow passengers and silently passes judgement on each. The reader learns that MacKenzie is a successful independent “profiler”, in the process of emerging from her"}, {"Review": "It's rare that a single side-character causes me to cut a book rating in half, but here we are. One of these days I'm going to read a book with a strong, independent female lead. 2018 wasn't a good year for me and such a book, but I entered 2019 ever hopeful. One might be fooled into thinking that this is one. But no. What we have instead is a woman still broken from the death of her husband. Which is fine. Could be great, even. It's a great opportunity to show her inner-strength as she comes to"}, {"Review": "A proper serial killer thriller with a great main protagonist and a twisty page turner with some great writing. Part of my \"First Monday Crime\" reading so will review properly at a later date. Looking forward to the next in the series!"}, {"Review": "This was my Amazon First Read pick for January. It's not a book I'd recommend, and it's not a series I'll follow. Some things that bothered me include:Ziba is an annoying character who tries too hard to be a badass. She has a habit of calling people ridiculous derogatory names, constantly, such as \"moon chicken\" and \"DI Dipstick.\" She also uses her personal lingo for common things, such as \"lifer juice\" instead of coffee. And a man's hands are \"dick grabbers.\" I swear, she never just talks like"}, {"Review": "This book was one of the two choices I made for the Kindle First offer for January. I've given up on it at 30%, though......it's full of military slang and I just got totally cheesed off having to keep looking up what she was on about. Especially as Ziba no longer works for the military. There's just no need for it and for me it ruined what is in essence an interesting story. Such a shame.She uses the word ass a lot as well when it should be arse seeing as we're based in England. Sentences like"}, {"Review": "It has been a while since a book has intrigued me as much as this one had. I am fairly good at being able to call who the murderer is but this one had me guessing, then second guessing only to revert to my original suspect. And still I was incorrect. However, it wasn't because the murderer was random or completely unforeseen but because of the way the story was written and the focus on different details that are then disregarded as new ones come to light that I focused exactly where the author i"}, {"Review": "Blood for Blood is a fantastic debut from an exciting new author. A brilliant explosive opening is followed by a thrilling plot that kept me gripped and guessing to the end. As well as a pacy plot and an enjoyable mystery, the characterisation was superb. Ziba MacKenzie is a fresh and intriguing female lead with some cracking skills and some great one liners. I can’t wait for the next instalment in the series. "}, {"Review": "To begin with, how does book one in a series leave you feeling like you missed something? Was there a series prior to this where Ziba was a background character? The fact that I came into this novel simply hearing about her husband's death, I don't feel as though her grieving made me feel what I'm sure the author intended. Nor did I feel any strong feelings one way or another about her working with, or being around, his former friends and colleagues. I feel like I am missing some major plot-line"}, {"Review": "I wanted to like this book.But, I must have been 'hitting the hippie lettuce' to have finished this supposed thriller. I suppose that just makes me 'shit stain' to not encourage this up-and-coming young author. But it's the use for such off-the-wall phrases that I find most off-putting. 'Sweet mother of dog shit', I find that annoying.But finish it book, I did. I did like the set-up and Ziba did start out with promise, but the whole thing started to fall apart when, just when we wanted to like t"}, {"Review": "Stereotypical, repetitive, gory, and too easy to spot the bad guy."}, {"Review": "DisappointingI did not like this book, and I'm sorry I wasted my time reading it. I'm not saying she's a bad author, but the subject was very distasteful for me. Perhaps her future books are good, but I will not be reading another one."}, {"Review": "I found a lot of issues with this book. First, it always bothers me when strong female characters aren’t written as people. In other words, a common trope is to have the female character solo. NEWSFLASH: women aren’t any less powerful when they ask for or accept help. Many pages were fluff - it seemed more like the author was trying to reach a certain number of pages rather than writing to move the plot forward. The author also restates things regularly, which is extremely frustrating when you r"}, {"Review": "Blood for BloodI'm glad I chose Blood for Blood for my January First Read, it's a great mystery thriller with the bonus that it is the first in a series.Ziba Mac is an endearing character, she is still grieving the loss of her husband Duncan two years ago. She gets caught up in the death of a woman killed in a train wreck that coincides with the reappearance of a serial killer after a twenty-five year hiatus. As a profiler she gets in the killers head as he sets his sights on her. There is quite"}, {"Review": "A grieving profiler receives a cryptic message from a dying woman after the train they are on crashes. Ziba, the profiler is a special forces vet. She is invited to work with Scotland Yard when a long dormant serial killer suddenly becomes active a gain. Her pursuit reveals surprising connections and puts her in jeopardy. This was certainly a readable serial killer yarn but was damaged by some plot issues, info dumps and a subtle but noticeable anti-Catholic ism. Despite significant detail, the"}, {"Review": "Amazon Prime included Blood for Blood as a free read this month. Ziba MacKenzie looked like a fresh slant on one of my favorites: strong female detectives. The first chapter pulled me in as Ziba, a profiler, automatically profiled fellow passengers on her train. After a deadly train crash, she works to save as many as she can and hears a dying plea from an older Catholic woman. \"He did it. You have to tell them he did it.\"The story slowed down so much after the first chapter I had a hard time st"}, {"Review": "I couldn't get into it at first..I almost didn't finish this First Reads pick for January, and that would have been a shame. But the phrasing was awkward, and I couldn't get into the characters. I persevered though, and I'm glad I did.Ziba MacKenzie is an ex-special forces operative turned profiler. She's also a recent widow in a world of pain. When the train she's traveling on is in a horrific accident she inadvertently catches the attention of a serial killer who has been dormant for years, bu"}, {"Review": "Amazon have spoiled Prime members this month with a new year double-whammy of not one but two 'first read' picks and this was one of mine.Ziba MacKenzie is a Special Forces veteran and a specialist in criminal profiling. Like every good superhero she has a talent (profiling, understanding human behaviour) and an Achilles heel (her grief over the murder of her husband). We meet her on a London suburban train just as it's about to crash with catastrophic impact. As Ziba tries to help the injured a"}, {"Review": "Wasn’t feeling this the whole way through. Didn’t help that it kicked off with a ridiculous number of coincidences. Our hero in in a train crash and comforts a dying woman at the top of the book. She’s also brought in on a serial killer murder investigation later that night. The mom of the first victim of the serial killer? Turns out she was the dying woman on the train. Oh and the serial killer was on the train too. (Cause why not?) "}, {"Review": "Exciting I wasn’t sure at first about this book but it was the kindle first option that seemed like something I would like the most. I like that the story goes right into it and you hav to help Ziba decipher clues as she goes. You also are trying to figure out who Raguel is and how he someone seems to understand Ziba and how she works. I like that she is a lone wolf but will call in help when she really needs it. I thought it was interesting that you were always turning a corner and learning som"}, {"Review": "Ziba MacKenzie is a criminal profiler who consults with Scotland Yard. On her way to dinner one night, the train she’s riding collides with a derailed tanker car, killing more than a dozen and wounding several hundred. Though injured herself, Ziba comforts a dying woman who with her last breath whispers an enigmatic confession: “He did it.” Who did it? What did he do? And why? are the questions Ziba asks herself.But these questions get pushed to the side as Scotland Yard requests her services to"}, {"Review": "I Couldn’t Put it DownI was enthralled by this book. I’m used to suspecting what’s going to happen within the first few chapters and almost always being right. This one had me on the edge of my seat to the very end desperate to figure out what was going to happen. Highly recommend to lovers of crime novels!"}, {"Review": "This is not my usual genre, but I enjoyed the way the story was woven together from the Ziba’s perspective and Raguel’s. It was refreshing to have a strong, intelligent female lead who was also real and relatable."}, {"Review": "I just finished watching “Killing Eve” and was in the mood for another story about a serial killer and this fit the bill. Compelling story, and although there were some head-scratching plot holes, it was very enjoyable. A good pick from the Amazon First Reads January selection."}, {"Review": "3.5 stars. I really liked parts of in and a profiler is always interesting. Sometimes this just feel flat though."}, {"Review": "Beware the bible quoting man with a knife!Zeba Mackenzie, a profiler who had taken the FBI course in serial murder , adding to her impressive resume, had been called back to Scotland Yard to lend her skills on a series of brutal murders done by a man the papers had deemed the Lancaster Lacerator. His modus operandi was particularly¿ gruesome, involving a ritual of seven slashes to the throat, stabbing through the eyes, and brutal removal of male genetilia. It happened that Zeba was on a commuter"}, {"Review": "She really tries to throw you off the scent of who the killer is but other than making you slightly curious it never really sticks. The breaks in the chapters were awkward too and made for a strangely paced story. It also could have benefited from an editor going through and looking at the spots where words were missing or odd sentences where the phrasing for one sentence was then changed to a different one. Sort of like mixing her idioms.The story was interesting though and when the next book r"}, {"Review": "Story line was okay, but...... Story line was okay, but the style of writing was poor, with far too many unnecessary slang terms and expletives. Author seems to be trying too hard to shock or be 'hip' which spoilt what could have been a good book. If you can read past the silliness, you may quite enjoy it. "}, {"Review": "Thrilling DebutIn this debut novel, Ziba MacKenzie struggles with demons while using her profiling skills to track down a serial killer in modern day London. Gripping and spellbinding throughout!"}, {"Review": "An amazing start to a new series of books. The beginning of this story is absolutely breathtaking. It begins with our Heroine, Ziba Mackenzie, getting on an ill fated train in London. When the terrible fate of that train occurs we learn that Ziba has a certain set of skills that she's learned in her former calling as a special forces profiler and when a dying woman on the train tries to pass on a final message to Ziba, a whole long line of occurrences lead Ziba around London in an attempt to sol"}, {"Review": "One of the Best, New Female-Cop ProtagonistsThis book starts off like gangbusters, introducing Ziba MacKenzie who’s on a rush-hour train when an explosion tears through it. Only 6% into the book and I know Ziba is an excellent profiler, who self-assesses her injuries, gives advanced first aid, works with injured and dead, was once “out in the field” in a desert, knew super glue closed lacerations, cusses like a man, probably worked with mostly men. So she’s an ex-military, maybe special forces?"}], "ID": "40020563", "Name": "Blood for Blood"}