{
    "Name": "Blood for Blood",
    "Image": "https://images.gr-assets.com/books/1545144195l/40020563.jpg",
    "Reviews": [
        {
            "Review": "Blood for Blood was both a page-turner and a disappointment. What began as an edge-of-your-seat read quickly deteriorated into a muddled pool of feints and missteps. The book starts on a commuter train where Ziba MacKenzie is engaged in people-watching. It’s clear that she is keenly observant as she relates the minute details of her fellow passengers and silently passes judgement on each. The reader learns that MacKenzie is a successful independent “profiler”, in the process of emerging from her grief over her husband’s murder. When the train then crashes, the results are grisly. MacKenzie springs into action, drawing strength and knowledge from her time in the special forces, helping where she can in spite of her own injuries. As one woman lay dying, her final words draw MacKenzie into a quest for truth that eventually becomes intertwined in a serial killer case upon which she is called to work with Scotland Yard. Author Victoria Selman does a great job setting the tone and breathing life into Ziba MacKenzie. It is in that character, however, that the first cracks in the armor appear. Selman is so intent on sharing her own vast store of knowledge regarding serial killers that every time MacKenzie speaks, she shares another fact that adds nothing to the read. Almost every mass murderer in history is given a moment in the spotlight. I found myself gritting my teeth whilst at the same time wanting to pen a note to the author that said, “OK, we get it! You’ve done your research! Move along!” The second downfall is in the author’s attempts to resolve the red herrings she has introduced. I understand the need to tie up loose ends, but here they come off as extremely contrived. Every minor character suddenly reveals secrets about which I couldn’t have cared less. There was never any courted investment in those people to garner interest in the explanations for their behavior. The final issue is one that involves a spoiler. (view spoiler)[The murderer is a man who was intentionally misidentified (by his mother) as the victim of a grisly murder 25 years prior. He is said to have then spent two decades in a facility for his schizophrenia, subsequently released into a day care program. Under what identity? Would a John Doe have been treated for that long then sent out in society without any idea of who he was? How was he supporting himself and affording the coke that kept disappearing up his nose? Selman tells us that his mother was surprised to see him, so clearly she wasn’t the one providing him support, and there were just no other explanations offered. (hide spoiler)] It was a huge miscalculation on Selman’s part to be so detail-oriented and then ignore such critical holes in the story. In the end, I did finish the novel, but not without some misgivings and a boatload of questions that remained unanswered. Selman is clearly in command of the language and is great with dialogue. For those with a keen interest in serial killers, there is enough here to keep you reading. For those who indulge in the mystery genre, however, this one just falls short."
        },
        {
            "Review": "It's rare that a single side-character causes me to cut a book rating in half, but here we are. One of these days I'm going to read a book with a strong, independent female lead. 2018 wasn't a good year for me and such a book, but I entered 2019 ever hopeful. One might be fooled into thinking that this is one. But no. What we have instead is a woman still broken from the death of her husband. Which is fine. Could be great, even. It's a great opportunity to show her inner-strength as she comes to grips with his death and learns to live her life without him. But nope. Screw that. Romance sub-plot!Instead we get a woman who never learns to stand on her own. Never learns to come to grips with her pain. But does come to grips with Jack. Because someone thought a serial-killer mystery involving pedophilia needed some sexual tension in it. Of course they did. Ham-fisted romance is all the rage these days."
        },
        {
            "Review": "The first book in a new crime series by debut author Victoria Selman. Ziba MacKenzie is a profiler, and her latest case involves a serial killer who is back after a long hiatus.A fast-paced crime mystery with a strong female lead. I usually enjoy books with strong female protagonists, but Ziba was kind of annoying. She seemed a bit of a know-it-all, and the weird phrases she uses threw me off. Additionally, I would have liked more backstory about Ziba. I'm guessing that as the series continues, more about Ziba will be revealed.The mystery was interesting though. The story switched between two points of view - Ziba and the killer. The writing was solid and there were enough twists to keep it interesting.I enjoy fast-paced mysteries and thrillers, so I'll probably continue with this series. Hopefully, I start to like Ziba more.This book was my pick for Amazon's First Reads in January 2019."
        },
        {
            "Review": "This was my Amazon First Read pick for January. It's not a book I'd recommend, and it's not a series I'll follow. Some things that bothered me include:Ziba is an annoying character who tries too hard to be a badass. She has a habit of calling people ridiculous derogatory names, constantly, such as \"moon chicken\" and \"DI Dipstick.\" She also uses her personal lingo for common things, such as \"lifer juice\" instead of coffee. And a man's hands are \"dick grabbers.\" I swear, she never just talks like a normal person. All this makes her unsympathetic and unlikable.Ziba lectures about serial killers at every turn. We're besieged with textbook recitations of infamous serial killers' behavior, as if in doing so Ziba proves her brilliance as a profiler. She also provides a litany of observations about people she sees, again to prove her profiling ability, when in reality most anyone would pick up on the things she points out with a flourish. There is a constant, obvious attempt to throw readers off with red herrings. It's as if the author shouts for us to look over here at this person, because it must be him, and then, no, look over here, because it's really this guy instead. It all feels too contrived.Clearly, this book was not for me. I couldn't find anything to like here at all. But that's just my opinion. "
        },
        {
            "Review": "This book was one of the two choices I made for the Kindle First offer for January. I've given up on it at 30%, though......it's full of military slang and I just got totally cheesed off having to keep looking up what she was on about. Especially as Ziba no longer works for the military. There's just no need for it and for me it ruined what is in essence an interesting story. Such a shame.She uses the word ass a lot as well when it should be arse seeing as we're based in England. Sentences like \"....trying to figure out a way to get an ident on my mystery woman\" and \"So, what's the sitrep ?\" then \"...the craphat who killed him\" and finally, for me, \"I'd spotted the shit-bird on the platform.\" Just needless and annoying, I'm afraid.The serial killer moniker of London Lacerator just sounds daft AND lacerater should be spelt like this, anyway. I didn't believe that a profiler would refer to genital mutilation and eye-stabbings in a press conference, either.However, I hadn't spotted any punctuation or grammatical mistakes before I deleted this which is nice to see."
        },
        {
            "Review": "I found a lot of issues with this book. First, it always bothers me when strong female characters aren’t written as people. In other words, a common trope is to have the female character solo. NEWSFLASH: women aren’t any less powerful when they ask for or accept help. Many pages were fluff - it seemed more like the author was trying to reach a certain number of pages rather than writing to move the plot forward. The author also restates things regularly, which is extremely frustrating when you read the same thing two pages before. Also, something that bothered me more than it probably should’ve: INACCURACIES WITH ZODIAC - the author probably meant Son of Sam, and had confused the two. Zodiac never wrote to the NYPD, and he toyed with the press, not with the police. Good lord. Finally, what is the deal with the junkie? "
        },
        {
            "Review": "I wanted to like this book.But, I must have been 'hitting the hippie lettuce' to have finished this supposed thriller. I suppose that just makes me 'shit stain' to not encourage this up-and-coming young author. But it's the use for such off-the-wall phrases that I find most off-putting. 'Sweet mother of dog shit', I find that annoying.But finish it book, I did. I did like the set-up and Ziba did start out with promise, but the whole thing started to fall apart when, just when we wanted to like this new, woman role-model, she transforms into a stereo-typical bumbling female Jane Doe, unable to exert any strong, decisive traits that would make her unique or likeable. The plot plodded...drawn out by false leads (more like random thoughts) and two dimensional characters.I wish Victoria well in her career...she may have promise if she stays away from trying to make her hero(ine) seem ordinary...even mundane...and tries to create a character with whom we feel a connection (ala Cormoran, Reacher or A.X.L. Pendergast)...the profiler angle has been popular in TV for years...maybe another direction?"
        },
        {
            "Review": "It has been a while since a book has intrigued me as much as this one had. I am fairly good at being able to call who the murderer is but this one had me guessing, then second guessing only to revert to my original suspect. And still I was incorrect. However, it wasn't because the murderer was random or completely unforeseen but because of the way the story was written and the focus on different details that are then disregarded as new ones come to light that I focused exactly where the author intended and never strayed from the path she laid out. I was delighted to be so completely engrossed in a story that it left my mind no room to wander from the world she created.Also, it was refreshing that the main character is a pretty bad-ass well written female. I adore how confident in herself she is while still having many of the flaws any real human has to contend with, that just made her 100% believable and easy to relate to despite the lack of similarities in my personal life.There were also enough details that alluded to the deranged nature of the crimes with falling into the total ick territory. I appreciate how the author chose to handle the child abuse scenes as well. Again, giving enough details to paint the picture and cause emotional turmoil without going to far. (the situation is disgusting and wrong but I am unable to emotional handle detailed scenes in my daily reading, so I am thankful with the care she took in portraying such heavy content)Scary how real it all felt but I am genuinely looking forward to the next book in the series."
        },
        {
            "Review": "Ziba MacKenzie is a criminal profiler who consults with Scotland Yard. On her way to dinner one night, the train she’s riding collides with a derailed tanker car, killing more than a dozen and wounding several hundred. Though injured herself, Ziba comforts a dying woman who with her last breath whispers an enigmatic confession: “He did it.” Who did it? What did he do? And why? are the questions Ziba asks herself.But these questions get pushed to the side as Scotland Yard requests her services to help them catch the London Lacerator, a serial killer who’s started murdering again after a two-decade hiatus. The catch? While she’s profiling him, it turns out he’s profiling her too. Now the question is: Who will get to the other first?Eventually, both sets of questions collide in Blood for Blood, the first book in a new series featuring Ziba MacKenzie and penned by Victoria Selman. It’s a page-turner with a likable protagonist, a plot with several twists, and a backstory and ensemble of secondary characters that grow on you. As a devoted reader of Sue Grafton and Michael Connelly, I’m always on the lookout for a new murder mystery series, and this one fits the bill. I’m looking forward to Nothing to Lose, the second book in the series, which releases March 26, 2019.Book ReviewedVictoria Selman, Blood for Blood: Ziba MacKenzie Book One (Thomas & Mercer, 2019).P.S. If my review helps you form an opinion of the book, please vote “Helpful” on my Amazon review page."
        },
        {
            "Review": "Blood for BloodI'm glad I chose Blood for Blood for my January First Read, it's a great mystery thriller with the bonus that it is the first in a series.Ziba Mac is an endearing character, she is still grieving the loss of her husband Duncan two years ago. She gets caught up in the death of a woman killed in a train wreck that coincides with the reappearance of a serial killer after a twenty-five year hiatus. As a profiler she gets in the killers head as he sets his sights on her. There is quite a twist to the story, this is an exciting read. Can't wait for more in the Ziba Mac series."
        },
        {
            "Review": "To begin with, how does book one in a series leave you feeling like you missed something? Was there a series prior to this where Ziba was a background character? The fact that I came into this novel simply hearing about her husband's death, I don't feel as though her grieving made me feel what I'm sure the author intended. Nor did I feel any strong feelings one way or another about her working with, or being around, his former friends and colleagues. I feel like I am missing some major plot-line by simply being introduced to her after her husband's death.Then, while it is quite obvious that this author has a solid grasp on what makes a good story, and how to execute just enough \"is it or isn't it\" to keep you guessing, however I was left with A LOT of questions. The most glaring of which is how did the killer keep their identity a secret for so long? Considering the things that happened to them, I feel like someone, somewhere along the way would have caught on. Mental Health treatment is often expensive, and I cannot imagine his therapists, doctors, facilitators, etc, calling him just by the name he gave himself. How did they get paid? How did they keep tabs on him? Perhaps things are different in the UK, and this is plausible, however I just don't understand it. I also found Ziba to be a bit... snobbish? Standoffish? Unbelievable? Even with her impressive record (even more impressive when you take into consideration how old she is compared to what she has done), she still comes across as the person with all the answers. Even working with detectives who have been around awhile, she still sees things that (to me) should have been obvious, and she takes risks that are wholly unnecessary. All in all, this is a well written first novel, and I do think I will continue on with this series, just to see how the author and her characters evolve.DISCLAIMER: This was an Amazon First Reads for January. This has not affected my review in any way. All thoughts and opinions expressed in this review are 100% my own."
        },
        {
            "Review": "Exciting I wasn’t sure at first about this book but it was the kindle first option that seemed like something I would like the most. I like that the story goes right into it and you hav to help Ziba decipher clues as she goes. You also are trying to figure out who Raguel is and how he someone seems to understand Ziba and how she works. I like that she is a lone wolf but will call in help when she really needs it. I thought it was interesting that you were always turning a corner and learning something new. I liked that the book gives you a lead into the next book Nothing to Lose it’s already drawing me in waiting to see what can potential happen to Ziba and Jack as well as the newest serial killer she is to profile. Great kindle first read. Worth reading if you like shows like criminal minds. "
        },
        {
            "Review": "Amazon have spoiled Prime members this month with a new year double-whammy of not one but two 'first read' picks and this was one of mine.Ziba MacKenzie is a Special Forces veteran and a specialist in criminal profiling. Like every good superhero she has a talent (profiling, understanding human behaviour) and an Achilles heel (her grief over the murder of her husband). We meet her on a London suburban train just as it's about to crash with catastrophic impact. As Ziba tries to help the injured and dying, a woman's dying words haunt here. \"He did it. You have to tell someone\". Ziba is called in by the police to help on the investigation of a serial killer who kills and mutilates older gay men. After appearing on the news supporting the police, the killer thinks she understands him and is his guardian angel and soon starts setting her tests and challenges. Can Ziba get under his skin sufficiently to stop the killing, whilst trying to tie together dozens of loose ends over more than 25 years?The serial killer sub-genre is a crowded market place and increasingly it seems like authors think the only way to make their mark is to make their stories more and more complicated, fill them with devious blind ends and red herrings and repeatedly lead the reader astray. Selman doesn't do that. Her story is more linear and logical than most and I'm grateful for that relative simplicity. As a reader, I want to think that I too can piece the story together if I follow all the clues and she let me do that without an over-reliance on unknown-unknowns or super-clever forensics. This is, at heart, a rather old fashioned style of criminal investigation. Hoorah for that.I'm happy to see this described as Ziba MacKenzie #1 because I'm sure there'll be a good few more Ziba Mac books before I get jaded with this new protagonist. I liked her a lot. "
        },
        {
            "Review": "Beware the bible quoting man with a knife!Zeba Mackenzie, a profiler who had taken the FBI course in serial murder , adding to her impressive resume, had been called back to Scotland Yard to lend her skills on a series of brutal murders done by a man the papers had deemed the Lancaster Lacerator. His modus operandi was particularly¿ gruesome, involving a ritual of seven slashes to the throat, stabbing through the eyes, and brutal removal of male genetilia. It happened that Zeba was on a commuter train involved in an horrendous crash; all of her training made her valuable in helping with victims who were trapped in the rubble - one person in particular pleaded for her help;and so she was perceived by the murderer to become his designated protector in his divine mission to rid the world of child molesters. The story progressed as Zeba considers the madness of the perpetrator as she perceived his identity!"
        },
        {
            "Review": "DNF at 38%.I don’t normally read books on Kindle, but since Amazon offered two free books for January, I couldn’t turn it down. I’d been stuck in a repetitive cycle of reading WWII books so I decided a thriller would be a nice way to break out of it…unfortunately, it appears I should have waited a bit for some of the reviews to come in or chosen from one of the other two books I had considered as a secondary but passed in favor of this.Ziba is by far one of the top ten most obnoxious characters I’ve forced myself to read about.I’m still not sure what the author was aiming for with this character, was she supposed to be quirky? Badass? A quirky-badass? Or was she supposed to be as annoying? Because she was very annoying.Between the military abbreviations (that had no explanation and I couldn’t be bothered to look up) and her frequent need to differentiate herself by making up words like a kindergartner (ie: Lifer Juice=Coffee. Ink Stick=Pen) instead of talking like a normal adult…Ziba, with the giant chip the size of Everest on her shoulder who assumed she was better than everyone else (especially if they possessed a penis), was insufferable. As far as the made up words go, it’s almost like the author had a word count she needed to meet and like a desperate college student started making up and/or breaking down words to overly simplified forms to fluff the number count.A lot of the slang and terms were very British. Like, if you dissected them, they’d bleed little Union Jacks, level of British. Seeing as the author and the book are British I shrugged it off as a little quirk…until the terms started being thrown into what felt like every other paragraph. Why wasn't Ziba capable of just talking normally and saying what she means without the overly British slang and made up terms? Now, before you get defensive about my \"typical American attitude\" I fully expect British terms in British books, so no I'm not referring to words like \"chips\" instead of french fries, \"flat\" instead of apartment, or a \"dummy\" instead of a pacifier, etc. It wouldn't be or feel British without their own terms sprinkled throughout. Ziba, however, is slightly obsessive about throwing out British slang and terms that are so unusual they required me to pause and look them up. Two of them (the two examples I use) are mostly my own fault from misunderstanding but some of them were just ridiculous. As if her made up words weren't bad enough...Two examples (both of which I think are very minor but more importantly are spoiler-free):“…as I shook the cellar over my fries…”Again, minor. But it did make me pause, a ‘cellar’ (besides being a place to store your excess junk) is a small bowl without a lid that holds spices. Basically, that little bowl you see the chefs on cooking shows grabbing pinches or fistfuls of seasoning and throwing it over food...that's a 'cellar'.I’m not sure if this is what salt shakers are referred to in the UK because when I googled it, I came up with nothing useful. So, I’m going to have to side with her husband on this, if she’s shaking an open bowl of salt on her chips (French fries), she’s going to die young and has no taste buds (after being forced to eat military rations/food, this might be true).And another:“…We’d eat them straight out of the fat standing by the hob…”Now this is my own fault. Being a typical mostly oblivious American I don’t keep up with many trends (both on my own soil and overseas), so to me “hob” still meant “hearth” (which is obviously a fireplace). Apparently, I’m a few centuries out of date because it now means “cook-top”. I will confess it was kind of amusing to picture two modern people, so desperate for fatty, unhealthy goodness, they resorted to cooking chips (French fries) in a cast iron pot over an open flame.Another issue I had was Ziba’s line of work…I can’t remember where exactly she lives, but apparently, she lives in a pretty nice neighborhood since she never worries about people breaking in or stealing her car…which is where I have many questions. Ziba pretty much makes it clear she’s a freelancer, meaning she doesn’t have a reliable form of income. She could be called in every day for a year or get nothing for months while they used other people. She isn’t the only Profiler in the UK (which I’ll be talking about in a moment). So how does she afford both the nice apartment and a car that goes for almost $200,000 (which is like £155,000)? I’ve heard its very expensive to live in London, so how does she afford the apartment, the car, and all the other expenses that living in a big city brings…on freelancer pay?I doubt the military, her husband’s life insurance, and the government pays well enough for her to maintain all her living and car expenses, plus keep up with her going out to eat nearly every single day for two meals a day.Also, if I remember correctly, Ziba is under or pretty close to 30 years old. She was in the military most of her young adult life (18-35). Where and when did she have the time to magically become a profiler, between her frequent deployments with special forces? Profiling is something that takes years and a ton of training to achieve. You don’t just read a textbook (which is what a lot of her profiling passages felt like…these being very frequent) and magically become one. Going by her age she’d still be in training and wouldn’t have nearly the amount of prestige needed to be called on so frequently. And using the old “she was in the military” argument won’t work, they train you to look for danger not figure out the dude on the train with sores on his face, unwashed hair, skeletal complexion, and constant fidgeting is (surprise, surprise) a meth addict. Or that mutilation of someone’s genitals means they’re angry with that sex.She also doesn't have the maturity level expected of someone in her position, which requires emotional detachment and serious observation skills. She frequently gets angry and calls people by childish names. She's also pretty oblivious to the obvious behaviors of people around her.So how did she become the \"go-to\" profiler, when there are probably hundreds of other profiles with more seniority and experience than her?I still don't understand why authors think female leads need to be \"lone wolf\" types of gals, as if they're all powerful and are what people are clamoring to read about. They aren't.Actually, I like the dynamic of partners that balance each other out. It makes the characters stronger to have someone to ask for help, softens out the jagged edges, and adds a new dynamic and point of view (be it rasher or calmer) for both male and female characters.The other big issue I had was how many coincidences there were, it was absolutely ridiculous. Be wary, this paragraph is heavy in the spoilers, just skip over the bolded text to avoid it:So Ziba gets on a train that just to happens to blow up, that coincidentally is not only also occupied by our serial killer who is stalking a young woman but the serial killers mother as well. Somehow the mother, who doesn’t recognize her son at all, dies (along with 90% of the people in the carriage) but Ziba and serial killer conveniently walk out without a scratch. You really expect me to buy what you’re selling here?And finally, let me start off this last section with a little disclaimer that I myself do swear, and it only bothers me on two occasions: if it’s done in front of my young child or it’s used excess. Ziba, as it turns out, is not very articulate in expressing her frustration and anger preferring to just resort to swearing like a Neanderthal every couple of pages. I did a search on some of the more common words to see how often it was said:D-ck- 10 timesA-s(hole)- 12 timesF-ck- 15 timesSh-t- 30 timesB-tch- 4 timesB—tard- 4 timesD-mn- 14 timesSo she swears (using the most common words, at least) about 89 times in a book that's about 300 and some pages. Just a bit excessive.Again, swearing doesn’t bother me but I know it bothers other people so that’s why I edited the words a bit. Recognizable but still hidden for those of a more “sensitive” nature.Unfortunately, this is a series I won’t be retrying or continuing."
        },
        {
            "Review": "A grieving profiler receives a cryptic message from a dying woman after the train they are on crashes. Ziba, the profiler is a special forces vet. She is invited to work with Scotland Yard when a long dormant serial killer suddenly becomes active a gain. Her pursuit reveals surprising connections and puts her in jeopardy. This was certainly a readable serial killer yarn but was damaged by some plot issues, info dumps and a subtle but noticeable anti-Catholic ism. Despite significant detail, the serial killer's dormancy and reapparance where not satisfactorily explained. Ziba's clumsy efforts to deny her attraction to her husband's best friend and constant wallowing in grief were tiresome and juvenile. She seems to be unable to do her job without giving lectures on serial killers. But most offensive was the anti Catholicism. Granted in England and Scotland it is an acceptable prejudice. Ziba proudly chortles about being a Persian Jew Protestant but doesn't miss a chance to take a shot at the repressive, hypoicritical Catholic faith. BTW vernacular services replaced the Latin Mass circa 1965 and even Catholic schools don't require Latin classes. It was unnecessary to play upon prejudice in that way. Yes religious whackos aboundbut in this context the targeting of Catholicism was offensive. The book is a tad uneven with a few too many obvious red herrings. Imperfect but still readable and fairly enjoyable. 2.5 stars"
        },
        {
            "Review": "⭐️⭐️⭐️Blood to Blood tells the story of Scotland Yard profiler Ziba Mac as she hunts to find a serial killer who, after many years, has returned. While riding on a train, Ziba becomes a victim of a train explosion. A dying woman tells her something during her final breath that sends her on a hunt (for the bomber or something more?)While ferreting our clues, Ziba quickly learns the serial killer has set his eyes on her. What follows is Ziba’s suspicions as to the identity of the killer as she begins and cat-and -mouse game, uncovering clues and riddles to hunt down the killer. This is a straightforward Serial Killer/Profiler novel. It’s fast-paced and twisty enough to keep you turning the page. The heroine is somewhat one-dimensional and that took down my rating.Thank you to NetGalley and publisher who provided arc in exchange for honest review. "
        },
        {
            "Review": "Amazon Prime included Blood for Blood as a free read this month. Ziba MacKenzie looked like a fresh slant on one of my favorites: strong female detectives. The first chapter pulled me in as Ziba, a profiler, automatically profiled fellow passengers on her train. After a deadly train crash, she works to save as many as she can and hears a dying plea from an older Catholic woman. \"He did it. You have to tell them he did it.\"The story slowed down so much after the first chapter I had a hard time staying with it. Ziba spent pages mourning and remembering her husband, a murdered policeman whose killer was never caught. Interspersed with her mourning were italicized first person chapters about a small boy, and other chapters from the point of view of the serial killer. The author threw in lots of red herrings and made Ziba suspect someone on her own Scotland Yard team was Lacerator, the famous serial killer. She was sure the killer was someone she knew, someone who knew her well. She decided the killer was schizophrenic and lectured the reader on different types of schizophrenia. Two other things kept me from really liking Blood For Blood. The ending was weak, anticlimactic. And there were many British colloquialisms that made me stop reading to try to figure out what was meant. I read British mysteries all the time and this usually is not a problem."
        },
        {
            "Review": "I couldn't get into it at first..I almost didn't finish this First Reads pick for January, and that would have been a shame. But the phrasing was awkward, and I couldn't get into the characters. I persevered though, and I'm glad I did.Ziba MacKenzie is an ex-special forces operative turned profiler. She's also a recent widow in a world of pain. When the train she's traveling on is in a horrific accident she inadvertently catches the attention of a serial killer who has been dormant for years, but he's ready to start killing again.Results: admittedly the awkward and sometimes strange phrasing is difficult to get past, but if you can get through the first five chapters you'll find an interesting and exciting thriller. There was some strong language, and some adult themes, but nothing very graphic. It would be fine for older teens and adults."
        }
    ],
    "Genre": "Crime",
    "ID": "40020563",
    "Desc": ""
}