{"Name": "A Study in Scarlet", "Image": "https://images.gr-assets.com/books/1519031842l/102868.jpg", "Reviews": [{"Review": "The birth of a legend.... \nThis is it...the novel in which Sir Arthur ushered the world’s greatest second best detective (after Batman) into our collective consciousness. Being the non-conformist rebel that I am, I started off bassackwards by reading The Valley of Fear and then The Adventure of the Final Problem because those were the two stories with Moriarty in them. Shocking, I know, but that’s just how I roll. Btw, it still really chaffs my cheeks that Doyle wrote 56 short stories and 4 novels about Holmes and the arch-enemy appears in exactly TWO. I know less is sometimes more but, come on Doyle, that is on the scrimpy side of weak. Anyway, I have now circled back and returned to the genesis of the Sherlockian mythos and begun with the tale that started it all. Now, for those that have never read any of the Holmes mysteries, I have come to believe that your level of enjoyment of these stories will be directly proportional to your feelings toward Sherlock Holmes himself. Sir Arthur’s a fine writer and his prose is concise and polished with enough flair to make reading him very enjoyable. In addition, his plotting and pacing are excellent and I think mystery fans will appreciate both the content and structure of the central investigation and the procedural components of clue-gathering and interpretation. These things all point towards a pleasurable experience, However, in the end, the most important barometer in gauging your level of happy will be your reaction to Holmes himself. Thus, I thought I would focus most of my review’s attention on his character bio after briefly summing up the plot as follows: PLOT SUMMARY:Holmes and Watson meet....murder is committed...Holmes investigates....clues are found...Holmes figures it out....a murderer is caught...long flashback to America where Doyle does a Krakauer-style expose on Mormons describing and their child-stealing, polygamous ways...jump forward to present.... all is made clear..... Watson slobbers all over Holmes....... A STUDY IN CHARACTER:Now, let’s take a look at Sherlock’s profile. Whether you are a hater or a homey when it comes to Holmes, I think most people would agree with the following attributes: ** The man is unlikeable...very unlikeable...extremely unlikeable. ** He is self-absorbed to the point of being sociopathic.** His has zero empathy for the victims of the crimes he investigates. ** He is so egotistical that it actually makes his general unlikeability pale in comparison** While never explicitly diagnosed, he is a severe manic-depressive ** He is inconsiderate, callous, cold and socially inept. From a personality standpoint, one of my buddies here on GR said it best...Holmes is “a dick.”Despite that, I find myself very much in the “homey” camp and think he’s among the more fascinating creations in the annals of literature. Part of that appeal is precisely because he is such a prickish turd in the social skill department. However it his mental faculties, the trait he is best known for, that makes him so intriguing. Yes, he is brilliant. However, that is not the end of the story Paul Harvey because it is a unique and very specialized kind of brilliance. Holmes knows the details, and I mean details, of every major crime to have been perpetrated in Europe (and possibly beyond) over the last 500 years. He can also distinguish between every variety of dirt or soil in London and and can tell you the precise brand of tobacco/pipe/cigar simply by its ash. However, as is divulged in this story, Holmes also has no idea that the Earth travels around the sun.  Further, “of contemporary literature, philosophy and politics he appeared to know next to nothing.” How can a man of such singular ability be so woefully lacking in common knowledge. Holmes explains to Watson thusly:\nI consider that a man's brain originally is like a little empty attic, and you have to stock it with such furniture as you choose. A fool takes in all the lumber of every sort that he comes across, so that the knowledge which might be useful to him gets crowded out, or at best is jumbled up with a lot of other things so that he has a difficulty in laying his hands upon it. Now the skillful workman is very careful indeed as to what he takes into his brain-attic. He will have nothing but the tools which may help him in doing his work, but of these he has a large assortment, and all in the most perfect order. It is a mistake to think that that little room has elastic walls and can distend to any extent. Depend upon it there comes a time when for every addition of knowledge you forget something that you knew before. It is of the highest importance, therefore, not to have useless facts elbowing out the useful ones.\n This just struck me as particularly awesome from a story perspective. Not only does such a philosophy provide a cloak of believability to Sherlock’s preternatural detecting skills, but his glaring knowledge deficiencies make him that much more fascinating as a character. I guess I just find Doyle’s profile of Holmes to be superb. He is like a “not quite human” storm of deduction. He’s dispassionate, callous and unimaginably effective. Additionally, he solves crimes not because of a perceived duty, but merely because it is the only thing that keeps the boredom of life away. That and the giant stroking his ego gets when he does “the big explain” which is always entertaining and makes each story worth reading all by itself. Finally, I also see Holmes as a tragic figure. He is a sad, lonely and devoid of any lasting sense of contentment or pleasure. While alive and invigorated when the game is afoot, most of his time is spent as a mere husk of a man with no feeling of day-to-day happiness. All of this makes Holmes an extraordinarily compelling figure to me and one I hope to spend a lot more time reading about. While I did not enjoy this as much as The Adventure of the Final Problem (my favorite so far), I was still glued to the page watching Holmes maneuver through his scenes and really enjoyed the flashback portion set in America. I look forward to many more of his adventures. 4.0 stars. HIGHLY RECOMMENDED!!"}, {"Review": "Arthur Conan Doyle's first Sherlock Holmes novel is utterly unimpressive. In short, the book starts like this:[image error]and mid-way turns into this:And I am not even joking. The novel begins with Holmes and Watson meeting, moving into their Baker Street apartment and then investigating a murder of a man found in an abandoned house. At the half point, however, the story completely changes its course and becomes the most awkward introduction of the murderer's back story and motives involving Mormons, polygamy, violence, money, and Brigham Young. The structure of The Study in Scarlet is utterly bizarre.But let's not linger on the bad. I want to use this review to shamelessly hype the new BBC version of Sherlock Holmes.[image error]This is an absolutely delightful modernized take on the old characters and it offers a much better version of Arthur Conan Doyle's dreadful story. So, check it out. "}, {"Review": "بالرغم من أعجابي الشديد بشخصية شيرلوك هولمز منذ الصغر بسبب مسلسل الانيمي الشهير في الثمانيناتوالذي قدم بشكل \"كلب\"، بينما بنفس الوقت قدمه ديزني بشكل فأر، في فيلم وكوميكس بمجلة ميكيوبعد سنوات طويلة، شاهدت بالصدفة فيلم شيرلوك هولمز لروبرت داوني جونيور..لم أتحمس له بالبداية، لكنه أيضا جذبني بذكاء الحبكة وقوتهاواخيرا، منذ أيام شاهدت الحلقة الاولي من مسلسل شيرلوك، بعد الضجة المثارة حول موسمها الاخيريقدم المسلسل صورة معاصرة لشيرلوك، بشكل ذكي ومثير، الحلقة الاولي بعنوان \"دراسة في اللون البمبي\"، ذكرني بعنوان رواية شهيرة بعنوان \"دراسة في اللون القرمزي\"، وبقليل من البحث..أكتشفت أنه عنوان أولي روايات وألغاز شيرلوك هولمز نفسه كما كتبها السير آرثر كونان دويل 1887، منذ 130 عاماوالغريب انها هي ماجعلني واعطتني دفعة لابدأ القراءة لشيرلوك هولمز اخيرا بعد كل هذا الوقتكانت لدي النسخة الالكترونية بما أن حقوق الملكية سقطت ، وبقراءة الفصل الاول فحسب ، أكتشفت أن المسلسل قام بعبقرية شديدة تحويل الخيوط الرئيسية للقصة نفسها حتي بمعظم مشاهدها ومقولات ابطالها الي المسلسل، في احداث معاصرة بعد 130 عاما من صدور القصة الاصلية\nالاحداث\"هناك الخيط القرمزي للجريمة يجري خلال نسيج الحياة عديم اللون وواجبنا أن نفك خيوطه ونفصله لكشف كل بوصة منه\"تدور الأحداث حول جون واتسون العائد من بعثة عسكرية بريطانية من أفغانستان-ما أشبه البارحة باليوم، جون واتسون في المسلسل يعود من نفس المكان بعد قرنا من الزمان، سلسلة جي كي رولينج البوليسية الشهيرة أيضا بطلها جندي سابق مصاب بأفغانستان يعود في 2009 لبريطانيا ليعمل محقق-وبالصدفة يشارك السكن في 221ب شارع بيكر مع شيرلوك هولمز، محقق خاص جدا غريب الاطوار .. حيث ستتعرف مع واتسون -الراوي- بسلاسة علي جزء من شخصية شيرلوك، وطريقة تفكيره العجيبة التي ترفض أستقبال أي معلومة لا يستخدمها في حياته اليومية الخاصة ، حتي إن كانت مهمة كأن الارض تدور حول الشمس مثلاستتعرف علي علاقة شيرلوك المعقدة مع البوليس، الذين يرفضون الاعتراف بفضل أي طرف خارجي في مساعدة القبض علي الجناة، مع ذلك يعترفون بعبقرية شيرلوك الإستثنائية في الاستنتاج والحدس والاستنباطلتبدأ الجريمة الاولي الغامض وقائعها وهنا يبدأ الاختلاف الجذري في القضية بين المسلسل و الروايةيشترك واتسون مع شيرلوك في رحلته البحث عن الجاني واسباب الجريمة لانه كان متشككا من تفاخر شيرلوك بدقته في قراءة الشخصيات والبشر والاماكنليكتشف أنه محقا بشكل مرعبلدرجة أنه يقوم بأحضار والقبض علي المجرم أمام البوليس في بيته الخاص بنفسهليبدأ جزء ثاني من الروايةالجزء الثاني من الرواية مختلف تمامانصفه الاول سردي لا يرويه واتسون.. يرجع لبضع العقود الي الوراء في سهول أمريكا الواسعة بمنتصف القرن التاسع عشرحول جماعة من المورمون ، تلك العقيدة الامريكية المتشددة ، تجوب سهول امريكا المقفرة للبحث عن مكان تبدأ فيه مدينة جديدة لهم ، يقومون بأنقاذ رجلا ما وفتاة صغيرة يتبناها بعد أن ماتت جماعته من الجوع والعطش بالصحراء المقفرة الامريكيةالجزء غني جدا، به رسم ديستوبيا لشكل الحياة المتشددة للمورمون بشكل مختصر لكن يضاهي رائعة جورج اورويل 1984 التي كتبها بعده بنصف قرنما علاقة كل هذا بالجريمة الثنائية بلندن؟هذا ما يجيب عنه النصف الثاني من الجزء الثاني من الرواية بين واتسون وشيرلوك والجاني************************الاسلوب والشخصياتلسبب ما لم يهتم كثيرا السير آرثر بكتابة ماض لشيرلوك أو حتي واتسون فيما عدا جزء من عادات الاول، وتجربة الاخير في الحرب البشعة بافغانستانبل وببعض البحث ستجد أن هناك لعبة كبري يلعبها كل عشاق ومدمني ألغاز شيرلوك من يستطيع تجميع تاريخ حياة وعائلة شيرلوك النادر وجودها بين رواياته الاربع وال56 قصة قصيرة التي هي ميراث السير آرثر لشيرلوكلم يكتب لسبب ما السير الكثير عن شيرلوك، مع ذلك ظل ملهما للكثيرالظريف هو ما كتبه السيد واتسون عن شخصية هولمز في هذا الكتاب يعتبر حجر الاساس لما سيحدث لاحقامعارفه في الأدب : صفرمعارفه في الفلسفة : صفرمعارفه في علم الفلك : صفرمعارفه في السياسة : ضعيفةمعارفه في علم النبات : متنوعة، جيدة في الحشيش والأفيون، والسموم عامة، لكن لا يعرف عن البستنة عامامعارفه في الجيولوجيا : عملية لكن محدودة، يميز بسهولة بين أنواع التربة المختلفة، يميز البقع علي البنطلون من أي مكان لطخته بلندن من لونها وكثافتهامعارفه في الكيمياء : عميقةمعارفه في علم التشريح : دقيقة، لكنها بعيدة عن تشريح الاجهزة بالجسممعارفه في أدب الإثارة : ضخمة، يعرف كل تفصيل في أي رعب حدث خلال القرنيعزف على الكمان بشكل جيدلاعب محنك بالعصا والملاكمة والمبارزةلديه معرفة قوية عملية بالقانون البريطاني\nالسلاسة في الاسلوب، رغم شئ من تطويل الجمل والفقرات كما هي عادة كلاسيكيات اواخر القرن 19 وأوائل العشرين، جعلت من الاحداث مثيرة وسهل التعايش معها.. تقديم الشخصية لأول مرة رغم كما قلت عدم رسم ماض او تاريخ له جاء سهل التعرف عليه والانجذاب لاسلوبه الغريب وذكاءه الاستنتاجي الممتازوكما قلت، تغيير الاجواء في نفس الرواية والانتقال بين الراوي وبين احداث في مكان اخر تماما، بالرغم من انها كانت مفاجئة لكنها منحت تنوع خاصا انها كتبت بشكل مثير للمتابعة وتسجل جزء من تاريخ تلك الجماعة الدينية في يوتاه بأمريكا، مما أثقل الحبكة بشكل عام كما يقول السيد شيرلوك دائما The Plot Thickens************************التأثر والتأثيرخلال الاحداث يذكر الكاتب كثيرا بعض الاشارات لأدب الجريمة وقتها... اشهر تلك الاشارات هي للمحقق سي اوجست دوبين لمؤلف الرعب والاثارة الاشهر إدجار آلان بوحيث يشبه واتسون شيرلوك بدوبين ، والذي ظهر في 3 روايات لإدجار منذ اقل من نصف قرن من ابتكار شخصية هولمزدوبين مختلف، كما يقول شيرلوك نفسه في الاحداث، مع ذلك فهو شعر بالاطراء لهذا التشبيه.. ولكن فعلا يري الكثيرين ان السير آرثر استلهم الكثير من شخصية دوبين كما استلهم منها غيره كاجاثا كريستي وحتي دوستويفسكيولكن شيرلوك كان له نصيب اضخم من الاقتباسات ، سواء مباشرة او حتي مع تغيير الاسم-فشخصية دكتور هاوس مثلا صاحب المسلسل التليفزيوني الشهير يعتبر مقتبسا بشكل غير مباشر من شيرلوك، والمسلسل نفسه مليء بالتلميحات لروايات دويل-كما صار هناك الكثير من الروايات عن هولمز يكتبها مؤلفين جدداخرها نسخة نسائية ليدي شيرلوك، بعنوان شبه مماثل للرواية الاولي تلكA Study in Scarletفي كل اقتباسAdaptation من التي ذكرتها في البداية ستجد ملامح لشيرلوك التي ذكرها السير آرثرشيرلوك هوند، الانيمي الياباني، للمبدع لهاياو ميازاكي له نفس النبرة الباردة الواثقة لشيرلوك... مع ظهور اكبر لموريانتي، عدوه اللدود رغم أنه لم يظهر في الروايات الاصلية سوي مرة واحدة فقطهو وباسيل من شارع بيكر ، الفأر الذي ابتكره ديزني، يعزفان الكمان... ويحسب لكارتون ديزني والكوميكس هو الجو الضبابي البريطاني الغامض الذي اشتهرت به السلسلة الاصليةكما أنها من المرات النادرة التي يلتزم فيها ديزني بالواقعية في الحجم ، فباسيل \"شيرلوك\" هو فأر بالحجم الطبيعي وليس كباقي شخصيات ميكي احجامها غير واقعية\nولكن عندما قدم روبرت داوني جونيور الشخصية قدمها بكثير من الغرور والانعزالية المشابه لطبيعة شيرلوك الاصلية ، وزادها بيندكت كامبرباتش جنونا في شخصيته المعاصرةولكن يحسب للنسخة الاخيرة الذكية تلك هي الدفعة التي دفعتها لي لقراءة تلك الرواية الكلاسيكية رغم عدم تحمسي للكلاسيكياتمع ان -كما ذكرت بمراجعة رواية \"ثم لم يبق أحد\"،-ان والدتي كانت تدفعني لقراءتها قديما بجانب مجلة ميكي روايات اجاثا كريستي وارسين لوبينلكني لم اجد ترجمات وقتها لشيرلوك رغم حماسي لفكرة المخبر السري بسبب كوميكس لغز ميكي الشهيرحسنا، هي مناسبة سعيدة اذن، وتركتني برغبة في قراءة المزيد عن شيرلوك والغازه والتي بالتأكيد سأبدأ بها هذا العام أن شاء اللهمع الرواية الثانية قريبا، ومجموعة قصصية تلحقها لنقرأ الاعمال بالترتيبمحمد العربيمن 15 يناير 2017الي 17 يناير 2017"}, {"Review": "Sherlock Holmes and the case of the Killer Mormons!But more about that later...Ok, the big deal about this one is that you get to see the Sherlock/Watson meet-cute. I mean, this is one of the most important meetings in the history of all literature! Come on, people! Get excited!It's only fair to mention that I've read and reread all of these stories a bjillion times, and these are by far my favorite classic characters.Well, except for Lizzie & Mr. Darcy...But I know I haven't read P&P as many times as I have Sherlock's mysteries, which should tell you something right there.I LOVE YOU, SHERLOCK!And, just to be clear, I loved him before he was all sexified.Ok, so Watson is back from the war (he basically just got trounced on and then came home), and has wasted all of his money is running low on funds. Luckily, he runs into an old pal from school, who just happens to know of this guy who's looking for a roommate. One thing leads to another, and the next thing you know, Felix & Oscar have found their forever home!Alright, as far as the mystery goes, it's just Sherlock running around sniffing things, (implausibly) being able to identify cigar ash, and tracing the movement of criminals using day-old (tromped on) footprints.Given what we know about forensic evidence now, is any of this, in any small way, even remotely believable? Can Sherlock actually deduct the answer to this mystery from horse tracks, a dead man's bad breath, and a plain wedding band? You're goddamn right, he can!So...WhoDoneIt?Now, I'm fully prepared to admit that I had forgotten about the Mormon Connection. I haven't read this one years, mostly because I prefer the short stories. Duh!But, to uncover the reasons behind the killings, Doyle takes us on a journey to the wilds of America! Specifically, Utah.Land of the Magic Underwear!This was where the tale of one man's thirst for vengeance was born. And it's all Brigham Young's fault. He was eeeeeeevil!\nBwahahahahaha!\nI'm assuming that Mormonism (like most religions) has its share of shady skeleton's in the closet. Now, I don't claim to be an expert on these guys. And I don't personally know very many Mormons, due to their predilection for Salt Lake City. All I know about that religion is what I've seen on tv or read in books, and it's not much.They wear special underwear. They can't watch R-rated movies. And they used to go door-to-door, until the Jehovah's Witness got to be too much competition.There's something else I'm forgetting though... What is it? It's right there on the tip of my tongue. Is it that they write best selling novels about sparkly vampires? No, there was something that looked like a big pink elephant...Oh! I remember!Yes. Well, from what I can tell, the only Mormons who practice polygamy now are fringe groups that are more or less shunned by their peers. And while I'm not on board with any religion, I doubt that this one is much weirder than most, at this point anyway. Plus, at least most Mormons seem to be pretty educated and well-off. It's not like Salt Lake City is one huge trailer park filled with toothless hillbillies. And (bonus!) they seem to have the sense to keep their crazy old people off the airwaves...Or so I thought! Now that I've read this, I'm going to have to rethink my plan to move west! Who knew these guys were so devious!?Kidnapping, forced marriage, murder, and secret bird calls!? Was this really a five star book?Fuck, no. But it's my favorite character's first book, and I enjoyed the hell out of it.Buddy read with my Non-Crunchy Friends!"}, {"Review": "SO I DID IT. CONGRATULATE ME. I read an adult book and a classic and I survived!! *flings confetti over self* Okay, except that actually I listened to an audio and I'm 100% sure the audio is the only reason I survived it, because, gawsh...while it's incredibly interesting, it's written so incredibly boringly. The writing is potato. That's all I can say. Maybe I'm not \"appreciating the arts\"...but the whole thing is like a monologue!! Where are the scenes??! Where is the development?!?!? Gah. And then halfway through, it just suddenly goes -- BOOM -- LET'S TALK ABOUT AMERICAN PIONEERS!! And I was just sitting there thinking, \"Wut.\" I literally had to abandon the audio and find a website online to confirm that the audio wasn't screwy and yes, in fact, A Study in Scarlet does just flip RANDOMLY to talking about American pioneers. (Which was an equally dry and boring story.) Um...just...how is this okay?! AGAIN. I'm obviously not a classic appreciator. But it was so random and abrupt.But it's Sherlock Holmes! So I definitely enjoyed that aspect! It made me squeak whenever I recognised a teeny tiny reference that one of the many shows/movies used. SO CLEVER. And I was actually surprised to find that Sherlock is NOT the incredibly self centred onion that most of the TV shows say he is!! Weird, right?! He's conceited, as Doctor Watson impassively informs us. (Seriously Doctor Watson = impassive melon 100% of the time.) But Sherlock had a lot of manners and if he said something to rude or abrupt, he'd take like 4 minutes and then apologise and explain his perspective. Dude. Yes.But the narrative...ugh. It was all This happened and then this happened and then they had lunch and then they found a murderer. No life or passion in the story at all. The I confess the conclusion was AWESOME. That weird pioneer-section REALLY gives you perspective later and it's all rather interesting and clever...I did kind of expect more from Sherlock...which is weird to say!? Maybe I've been spoiled by the modernised shows? But all the marvellous things Sherlock did at the crime scenes was basically just \"modern\" detective work. So stunning for the era, yes, but not for now.AWK. And Lestrade and Gregson have this EPIC rivarly!! I can't believe none of the TV shows/movies have made use of that!! It's wonderful. And when they all puff up into the room, strutting that they've solved a mystery, Sherlock is all, \"Oh excellent job, good man, I say, I say, you are a clever chap...AND TOTALLY WRONG HAHAHAH but good stuff for trying.\"Do I plan to read more? Probably yes. This was only 4 hours on audio and I whipped through it in a day. (It was a free audio off Libravox so, um, the narrator was an American woman. WATSON SPOKE LIKE AN AMERICAN WOMAN. Not the best narrator, but what can one do but take the free stuff?)(Also...just to inflame a war: Elementary is better than the BBC Sherlock and ROBERT DOWNEY JUNIOR WINS AGAINST THEM ALL. *whips away in a cloud of evil smoke*)"}, {"Review": "\nThe Game is on!\n\nENTER THE DETECTIVE\nIt's in this very first novel where the great character Sherlock Holmes, along with Dr. John Watson, are introduced to the audience in their first case together.It wasn't an instantenous success, but gladly it was appreciated soon enough to the point that when the author, Sir Arhur Conan Doyle, wanted to \"kill\" the character, not only their loyal fans wrote letters against the decision (something unheard at those times) for not saying that even people in London were seeing wearing mourning black bands showing respect to the \"death\" of the character, that Sir Arthur Conan Doyle finally \"resurrect\" the character writing even more adventures.But everything began here......Dr. John Watson got injured in war, and when he got back to London, he isn't able to afford a decent apartment on his scarse pension, so he is introduced to a peculiar man who is a \"consultant detective\", the first and only in the world, that not only private detectives consulted him but even the very Scotland Yard was resigned that Holmes' help was needed, for not saying crucial to solve impossible crimes.While this case, maybe wasn't that astounding, it is quite astonishing at the speed that Holmes is able to solve it, thanks to his uncanning deduction skills.I think that the middle section where the culprit explained his background and the reasons to commit the murders, could be exposed in a less extended way, but still, it was the first story, so I am able to forgive this kinda of a deviation of the main storyline.In this first novel, you met along with Holmes and Watson, also the Detective Inspector Lestrade, and the Baker Street Irregulars (which are vital for the search for people and clues to Holmes).A literary legend was born here."}, {"Review": "This nifty novel ( really a novella) the first Sherlock Holmes book written in 1887, is rather strange since it is set both in the culture, of brimming Victorian London, 1881, and the  dry , very hot desolate deserts of the savage wastelands of Utah, 1847 , nothing here...before there was a state established there or giving that name. Or even part of the United States, since technically still Mexican territory , neglected by them and ruled by the Ute Indians... hence the appropriate appellation . The almost forgotten war between the U.S. and Mexico...1846-1848 caused the maps of the world, to alter significantly the long borders between these two giant but rather sparsely populated, combating nations...Changed the status , the news surprised the Mormons who had fled persecution , seeking freedom, for their weird belief in polygamy (which men loved) but caused momentous trouble , in the American Midwest. Angry crowds killed many Mormons, including their founder , Joseph Smith, and escape was now impossible they thought...except this harsh, distant place from 19th century civilization, made them almost completely sovereign... The plot begins when the new Mormon prophet Brigham Young, soon to have 55 wives, leading the first 2,ooo Mormons to the promise land, an exodus of 1,300 miles ... his men, find two pathetic, starving people , a man and a girl child the only survivors of a lost wagon train, sleeping on a hill overlooking the wilderness ... an account about love , a forced marriage and revenge ... endlessly sought ... is revealed...Back to Mr. Holmes and Dr. Watson ( pardon the history lesson but it is quite important for understanding this great book ). The actual narrative starts with young Dr. John Watson returning from the horrendous second British- Afghan war ...sadly there will be many more...Wounded, nearly fatally, then let go from the army , trying to recover his health and spirits , save money too, he rents a room at 221 b Baker street ...this is where the famous duo become friends, the reserved Holmes fascinates the good doctor with his many eccentricities...what does he do to make a living. Obviously exceptionally brilliant but keeps to himself. NOT a medical man, yet knows much about medicine...interested in discussing grisly crime cases, the bloodier the better, an unusual obsession...why? Then Scotland Yard contacts Holmes , asking for help with a murder investigation...a mystery that only the violinist Sherlock can resolve, with an assist from the Baker street irregulars, nevertheless will not get credit for... The very different stories , unite masterfully at last , in faraway England...Americans in London start being killed for no apparent reason... not political or for profit either, and all came from Salt Lake City...This will give readers a nice taste ...and why Sir Arthur Conan Doyle 's Sherlock Holmes is still popular today."}, {"Review": "A Study in Scarlet (Sherlock Holmes, #1), Arthur Conan Doyle A Study in Scarlet is an 1887 detective novel by British author Arthur Conan Doyle. Written in 1886, the story marks the first appearance of Sherlock Holmes and Dr. Watson, who would become two of the most famous characters in popular fiction. The book's title derives from a speech given by Holmes, a consulting detective, to his friend and chronicler Watson on the nature of his work, in which he describes the story's murder investigation as his \"study in scarlet\": \"There's the scarlet thread of murder running through the colourless skein of life, and our duty is to unravel it, and isolate it, and expose every inch of it.\"عنوانها: اتود در قرمز لاکی، عطش انتقام؛ نویسنده: آرتور کانن دویل؛ موضوع: داستانهای پلیسی کارآگاهی از نویسندگان انگلیسی سده 19 م؛ تاریخ نخستین خوانش: سال 2001 میلادیعنوان: اتود در قرمز لاکی؛ نویسنده: آرتور کانن دویل؛ مترجم: مژده دقیقی؛ تهران، شهر کتاب - هرمس ( کارآگاه )؛ 1380؛ در 180 ص؛ چاپ دوم 1384؛ شابک: 9647100841؛ چاپ سوم 1389؛ چاپ چهارم 1392؛ شابک: 9789647100847؛عنوان: عطش انتقام - ماجراهای پلیسی جنایی شرلوک هولمز؛ نویسنده: آرتور کانن دویل؛ مترجم: حسینقلی انگالی؛ تهران، موج، 1372؛ در 192 ص؛ اتود در قرمز لاکی، نخستین بار در سال 1887 میلادی، در سالنامه ی کریسمس بیتن، منتشر شد، و در ژوئیه سال 1888 میلادی، به صورت کتاب مستقل، از سوی ناشران همان سالنامه، به چاپ رسید. نخستین داستان از مجموعه داستانهای شرلوک هولمز؛ و نخستین اثر سر آرتور کانن دویل است. داستان دو بخش دارد، بخش نخست را، دکتر واتسن روایت میکند، شرحی ست درباره ی حرفه ی پزشکی دکتر واتسن در ارتش، و ملاقاتش با هولمز. بخش دوم وقایع نامه به روایت سوم شخص است، در باره ی ماجراها، و راه حل کارآگاه زبردست، برای یافتن پاسخ معمای جنایت ها. ا. شربیانی"}, {"Review": "\n\nAn anti-review\n\nI don’t read reviews of books, of which I am damn sure I will be reading it very soon. Now, I don’t know how this habit affects my reading.So, what happened was..I was not aware of the fact that “I had to be surprised when the second part of the book starts and wonder what happened to the story with Sherlock Holmes in it and how that mystery was solved! Moreover, I had to wonder whether the second part was from some other book, somehow got binded in my copy and curse the publishers”. I was not surprised and neither did I curse the publishers.As I was ill-prepared for reading, this resulted in me being not disappointed like I was supposed to be.I was not aware of the fact that “I had to loathe the second part because it didn’t have Sherlock Holmes but instead Mormons and whatnots”. I couldn't loathe it because it was equally good.I was even not aware of the fact that “I had to drop my jaw when Sherlock Holmes says ‘Gentleman, let me introduce you to Mr. Jefferson Hope, the murderer of...’”. But I did, so atleast I got some expression right.You see, I was not aware of such shortcomings and issues so I enjoyed it a bit more than I should have. It’s a promise that I will hate the second part and enjoy it less on my re-read. And I mean no...\nEarlier...\nOkay, what the hell am I going to write for this review without writing spoilers, because everything turns out to be a spoiler.Damn! This is hard.I don’t know what to include and what not to include!Maybe, I should include this line, for this is best:\nI consider that a man's brain originally is like a little empty attic, and you have to stock it with such furniture as you choose. A fool takes in all the lumber of every sort that he comes across, so that the knowledge which might be useful to him gets crowded out, or at best is jumbled up with a lot of other things so that he has a difficulty in laying his hands upon it. Now the skillful workman is very careful indeed as to what he takes into his brain-attic. He will have nothing but the tools which may help him in doing his work, but of these he has a large assortment, and all in the most perfect order. It is a mistake to think that that little room has elastic walls and can distend to any extent. Depend upon it there comes a time when for every addition of knowledge you forget something that you knew before. It is of the highest importance, therefore, not to have useless facts elbowing out the useful ones.\n No, I should not, since almost every reviewer has used this line. So I am not going to write it in my review too and lengthen it unnecessarily, I will skip this.This is going to be damn hard, I can't find a single thing to write about.And what should I write about Sherlock Holmes?Kemper wrote: “Sherlock Holmes is a dick.” and got bunch of votes. I should also write something like that.Like, Sherlock Holmes is douchebag. Nah! that doesn’t sound nice and that is not correct either.I don’t want to write about the same issue of disjointed second part being a problem and this part being boring too, I didn’t felt so. But almost every review says same thing.I can’t think of anything to write. I should probably skip this one and write review of Cosmicomics, I need to edit that ‘FUCKING MINDFUCK’ I have left over there.No, I must write something!Maybe, I should review others' reviews and in this process the book will also be reviewed. This sounds like good idea, but may be offensive. So I should mention in my review at last that:I mean no harmdisrespect, I just happen to love Sherlock Holmes."}, {"Review": "A STUDY IN SCARLET!!! First group-read for the intact official Non-Crunchy-Sans Pants- for no reason that I can figure out...but none-the-less...NON pants wearing GRs classic reading group. [image error]I read A STUDY IN SCARLET waaaaaaaay back in my younger days- and remembered very little of it. To be perfectly honest- I remembered the title...and reading it- but nothing else. Whether it is my memory...or the fact that it wasn't memorable can be argued- but I liked it. A LOT.[image error]Setting:221B Baker Street, London- 1881A mutual acquaintance introduces: John Watson -physician, and Sherlock Holmes- detective consultant, to each other- both men in need of a room-mate. Thus starting a friendship and working relationship that will most definitely be a formidable pairing.[image error]At first Sherlock's personality is somewhat off-putting (not unlike Dan 2.0's)...but as Watson settles in- he gets used to the detective's unusual ways.Plot:[image error]Scotland Yard detective Gregson asks Holmes to assist him in solving a recently committed crime...and in turn- Holmes asks Watson to accompany him. They travel to an empty house in a London- and there they observe a crime scene that includes: cab prints in the street...footprints in the yard...a dead man who has been poisoned, and the word RACHE- in blood on the wall.[image error]The game is afoot!!! Need I say more?"}, {"Review": "\n\n“There is a mystery about this which stimulates the imagination; where there is no imagination there is no horror”\n\nI’m going to keep this short and (somewhat) sweet, because this is a very short little introduction that started it all. Everyone’s favorite original detective is Sherlock Holmes, and I’ve been wanting to see how it all began for a long while now! But I can honestly say that I was not prepared for the last half of this tiny book. Yet, I am still happy that I can finally say I’ve read the source material. ➽ PART ONE:We get to learn a little background information on Watson, and we get to see how he and Sherlock met and developed the most unusual of friendships. I really loved this and I feel like the story benefits so heavily from being told in Watson’s perspective. And I loved seeing the Baker Street apartment and I loved the mysteries, too.➽ PART TWO:What the fuck even was this last half? Utah? Mormons and polygamy? Questionable child care? Gross words describing Native people? What the hell did I stumble into? But I guess we needed to know the murderer from part one's back story? I am so damn confused, but yikes. Overall, this was a wild ride, but I am happy that I went on it. I’m not sure if I will be continuing on with anything else from Arthur Conan Doyle, but I can’t wait to jump into a reimagining, A Study in Charlotte, and see all of the parallels! Especially since this original material left me feeling very underwhelmed. Blog | Instagram | Twitter | Tumblr | Youtube | TwitchI read this for #CatchUpOnClassics!"}, {"Review": "Mysteries are my go to palette cleanser in between denser reads. I have a few go to series, but as my current contemporary series may be winding down, I am always on the lookout for mysteries both old and new. Even though the phrase \"elementary, my dear Watson,\" has become part of the vernacular, I have never read a single Sherlock Holmes story. Looking to alleviate that, I decided to encounter Holmes and Watson when they first met in Sir Arthur Conan Doyle's first novella, A Study in Scarlet, composed in 1887. Complete with color engravings by Gus Grimsly, I immersed myself in a period piece written at the dawn of the golden age of mysteries and settled in for a fun ride.Dr. John Watson was returning to London from his service in the British army after being stationed in Afghanistan. Looking for someone to split rent with, a mutual friend suggested a scientist and amateur detective who he thought Watson might be compatible with. Meeting at a university science lab, Watson first encountered Sherlock Holmes as he investigated the properties of blood in water. Holmes deemed Watson someone who he could live comfortably with and the partnership at 221B Baker Street began. As the two men kept different hours while Holmes dabbled in both his detective work and science experiments, Watson and Holmes had little contact in the early days of their living arrangement. Watson had little idea that Holmes was even a sleuth, that is until the day a letter arrived asking for Holmes' assistance on a case, which Holmes insisted that Watson accompany him for. The most famous of detective duos had embarked on their first case.As in many modern detective stories featuring private investigators, Sherlock Holmes solved the mystery before the police detectives even began to suspect whodunit. Also similar to the modern cases I have read, the police receive all of the credit for solving the mystery even though it is Holmes who comes through in record time. In this case, Holmes' record as a scientist is linked to two murdered bodies with the word Rache written in blood on the wall above their corpses. The police immediately believe that the suspect attempted to write Rachel only to run out of blood, throwing them off the trail. Holmes points out, much to Watson's bewilderment as well, that rache signifies revenge in German. What is the revenge that the murderer is seeking? Only Sherlock Holmes is capable of finding this out.Doyle's novella takes readers to the old west as he tells a backstory in the second half of this novella. In historical fiction focusing on the formation of the Mormon community in what is now Salt Lake City, Utah, Doyle paints his picture of religion, love, and later revenge. This story is augmented by Grimsley's engravings and black-and-white illustrations, which show the period of both 1850s Utah and 1880s London. I was captivated by the graphics as I had never encountered Holmes or Watson before and was curious as to how they were depicted on paper. The mystery itself is compelling as Doyle's tale moves across thirty years and two continents in a case that finally reaches its apex in London. Holmes scientific background and deduction skills come into play, and it was refreshing to read a mystery that takes place at a time when detectives had to do all of the sleuthing themselves without the aid of gadgets. Leaving the police baffled, it is obvious throughout that Sherlock Holmes is meant to be one eccentric yet intelligent sleuth.As this is the first of many Holmes and Watson stories, Doyle is first introducing his cast of characters and does not give readers the full spectrum of the Holmes and Watson partnership. Yet, this novella was compelling enough that I have a feeling that this will not be the last time that I visit 221B Baker Street. Hopefully, in the next story I read, I will even be fortunate to hear Holmes utter the famous words, \"elementary, my dear Watson.\" Palette cleansed.4 stars"}, {"Review": "This is an underwhelming debut for one of literature’s most famous characters. Doyle’s Sherlock is in the nascent stage here and isn’t the fully fleshed out character, readers came to know. The steady and reliable narrator, Dr. John Watson gets introduced to Holmes in Watson’s attempts to find a roommate. “Can two odd Victorian Era men share a flat without driving each other crazy?”Sure, why not.Watson takes measure of Holmes:Although the illustration below belies it, the producers of the TV show pretty much took the first time Holmes and Watson encounter a dead body and lovingly re-produced it almost to the letter.I think what most readers get put off by is the huge “evil” Morman digression that pops up around midway in this novella. It’s a jarring, uncomfortable fit. It gives credence to belief that Doyle’s Holmes should be read as short stories and not as longer narratives. For a little over a hundred pages, this took a lot longer to plow through than I would have initially thought.Recommended for those who have an interest in knowing where the legend began and for Sherlock completists.This was a buddy read with a bunch of non-crunchy folks who like to read whilst pants free."}, {"Review": "The first Sherlock Holmes and Doctor John Watson novel, Arthur Conan Doyle's A Study in Scarlet is just lots of fun! The scenes, especially in part 1 are ones we've seen interpreted in shows like BBC's Sherlock, but it's definitely enjoyable to read about (as well as watch) how it all started. In my mind, this book is most compelling for bringing Holmes and Watson together (and for making Watson the chronicler and foil of Holmes' amazing deductions). Doyle makes Holmes every bit as interesting as the cases he solves (probably a reason for his continued success). Holmes isn't motivated by some moral duty to find the bad guy. For him, crimes are puzzles for his intellect, a way to combat boredom. (This is something we've seen in earlier detectives like Edgar Allan Poe's Dupin). While the first part here has the traditional London backdrop, the second part is a flashback which transports us to a frontier Utah. These seemingly disparate sections work well together and make for a compelling story. 4.5 stars. "}, {"Review": "Gregson and Lestrade had watched the maneuvers of their amateur companion with considerable curiosity and some contempt. They evidently failed to appreciate the fact, which I had begun to realize, that Sherlock Holmes's smallest actions were all directed towards some definite and practical end.This is the first Sherlock Holmes story, a novel which introduces the now legendary detecting team of Sherlock Holmes and Dr. Watson. Watson is looking for a roommate and is introduced to Holmes with some warnings.\"Holmes is a little too scientific for my tastes - it approaches to cold-bloodedness. I could imagine his giving a friend a little pinch of the latest vegetable alkaloid, not out of malevolence, you understand, but simply out of a spirit of inquiry in order to have an accurate idea of the effects. To do him justice, I think he would take it himself with the same readiness. He appears to have a passion for definite and exact knowledge.\"But Watson and Holmes get along, and end up being one of the strongest pairings in all of literature....This isn't my first, second, or even third time reading this book. Parts of it are etched on my brain, never to be erased.\"I consider that a man's brain originally is like a little empty attic, and you have to stock it with such furniture as you choose. A fool takes in all the lumber of every sort that he comes across, so that the knowledge which might be useful to him gets crowded out, or at best is jumbled up with a lot of other things, so that he has a difficulty in laying his hands upon it. Now the skilful* workman is very careful indeed as to what he takes into his brain-attic. He will have nothing but the tools which may help him in doing his work, but of these he has a large assortment, and all in the most perfect order. It is a mistake to think that that little room has elastic walls and can distend to any extent. Depend upon it there comes a time when for every addition of knowledge you forget something that you knew before. It is of the highest importance, therefore, not to have useless facts elbowing out the useful ones.\"Now, I don't agree with Sherlock on this. But the passage stays with me, and is often discussed amongst my friends and family. This is probably the most memorable passage in the book (for me, at least)....Holmes is rather self-sufficient and self-contained, but in no way is he a cold, callous, rude or even distant man. I dislike when he's portrayed as emotionless or cruel, because even in this first story he's obviously not an anti-social creature.When he meets Watson he is a bit anxious that his violin playing will disturb him. Later, to make up for all his meandering here and there on the violin, without shape or form - he plays beautiful and famous pieces for Watson in order to please him.And he thrives on Watson's wide-eyed awe of him and his innate trust in Sherlock's abilities.My companion flushed up with pleasure at my words, and the earnest way in which I uttered them. I had already observed that he was as sensitive to flattery on the score of his art as any girl could be of her beauty.This adoration of Watson somewhat makes up for Holmes the bitterness and rancor he feels on not getting the credit he is due for solving the police's more difficult cases.\"What you do in this world is a matter of no consequence,\" returned my companion, bitterly. \"The question is, what can you make people believe that you have done?\"...The book is really divided up into two parts, and the first part is the more enjoyable part.In the first part, Watson and Holmes meet, slowly get acquainted and suss each other out. Then eventually Holmes's profession is revealed, and the fun starts when a man is found murdered in an empty house. The police are stumped and come to Holmes for help. And Holmes wants Watson along for the ride.The second part is more uncomfortable due to the extreme battering of Mormons and Mormon religion. Mormons are portrayed as evil rapists and slavers. If you are upset by this portrayal, this book might be very painful for you to read.Not to say that the first part is free and clear. For instance, when Watson sees the body of the murdered man, he remarks:\"So sinister was the impression which that face had produced upon me that I found it difficult to feel anything but gratitude for him who had removed its owner from the world.\"This kind of idea - the person is ugly; Ugliness is a manifestation of evil in a person just as beauty is a manifestation of good. Judging a person - a person who was murdered, terrified and alone! - by their ugly facial features as \"deserving of murder,\" makes me upset. However, this was a common literary trope back then and (unfortunately) still is today. Ugliness, disability, and deformities are often shown as \"signs\" and \"proof\" of a person's deviance and malevolence....This book focuses on a revenge plot, and there are some great quotes about vengeance in here.\"There is no satisfaction in vengeance unless the offender has time to realize who it is that strikes him, and why retribution has come upon him.\"And\"I had always known that vengeance would be sweet, but I had never hoped for the contentment of soul which now possessed me.\"...Tl;dr - A classic, and for a good reason. Who wouldn't enjoy seeing the world's most famous detective solve his first case with Dr. Watson by his side? And unlike many classics, this is easy to read and fast paced. Besides a few slang terms no longer in effect, and one or two times I was reaching for my dictionary, this reading presented no problems at all. Doyle possesses a straightforward and exciting writing style - he doesn't spend hours describing the scenery or make his characters talk in an affected way. The story is gripping and will have you turning pages quickly. As Watson would say,There was no need for him to ask me to wait up for him, for I felt that sleep was impossible until I heard the result of his adventure.You will also find sleep elusive as you chase murderers alongside the fierce Sherlock and the intrepid Watson! Happy trails!*It's spelled like this in my copy.Available in Spanish as Estudio en Escarlata."}, {"Review": "This was a reread. I have read this book many times. It still holds up well. Sherlock Holmes is here, intact, unchanged, canon.Both Lestrade and Watson are a foil to Sherlock's genius. I liked reliving the case and its unraveling. It was a nicety to concentrate on the serious side but also the humor. Rache!Books like this always hold up. The prose is so modern sounding. Books that came after ASiS, are sometimes so outdated. But not here. Sherlock's various incarnations - I wouldn't say pale in comparison - but they make me yearn for reading Doyle's masterpiece."}, {"Review": "Ah! My dear reader of review, I see you have just returned from Afghanistan, in a black cab, driven by an Italian driver, on your way here you stopped for breakfast at a McDonald's where you were served by a pregnant red-headed lady. I am sure you are wondering how I know all this. Well, my dear fellow (I have also immediately deduced your gender) I have my methods. Now, to the matter of writing this A Study in Scarlet review, that, my friend, is a three pipes problem.Wait! Don't go away just yet! I've finished with that crap now, I am aware that reviewing is a serious undertaking which should not be subjected to this kind of tomfoolery and silly references. Not to worry. The game is afoot! (sorry).A Study in Scarlet is Conan Doyle’s very first Sherlock Holmes story, and as such appears to be the most read, according to Goodreads’  Arthur Conan Doyle page. So the first section of the novel introduces our beloved narrator, Dr. John Watson; just back from Afghanistan, looking for an affordable accommodation. Some bloke introduced him to Sherlock and Bob’s your uncle. Of course, we are treated to the very first depiction of Holmes’ amazing power of observation. (Gratuitous Sherlock photo)Then they get settled into 221B Baker Street, Holmes starts shredding on his violin, and the British bobbies coming to consult him about the strange case of the gentleman what died of unknown causes, which they find to be “too many” for them. Homes does a lot of his patented scrutinizing, crawling, sniffing, tasting thing, to the astonishment of everybody, but none more so than Watson who is an instant fanboy. Not long after, just when Holmes is about to collar the guilty party, the book goes to Part 2 and something happened which would have flummoxed even Holmes himself if he wasn't confined inside the narrative.Basically, in “Part II: The Country of the Saints” Holmes and Watson completely disappeared from the book, and the narrative shifts to the backstory of the murderer who is kind of a good bloke, multiple homicides notwithstanding. When I first read A Study in Scarlet many years ago I very much enjoyed the introduction of Holmes and Watson, when I reached Part 2 I was jarred by their sudden absence from the narrative, I flipped through the book and found that Part 2, sans Holmes & Watson goes on for more than 50 pages! I almost gave up on the book then, but gritted my teeth and finished it anyway. Of course, H&W do come back for the excellent denouement. I remember being bored by this Part 2 though, it made me feel like a Holmesless man!Rereading the book now I have to say that Part 2 is actually a very good standalone-ish story; full of dark villainy, bloody vengeance, and evil Mormons (what?). Anyway, it is lots of fun if you can forgive the lack of Sherlock, it does help a lot, knowing that in advance. So, fair warning, you read this book and you do without Sherlock for quite a while. In any case, Conan Doyle was a first class storyteller, and this Part 2 is not at all dull. If you want a novel without a meaty non-Sherlock sandwich filling, you may want to pick up  The Hound of the Baskervilles, but really just read A Study in Scarlet and enjoy it as it is. it's elementary.___________________Notes:• Audiobook credit: Free Librivox audiobook , read extremely well by David Clarke. Thank you!• The very first Sherlock episode \"A Study in Pink\" takes a surprising amount of plot elements from this book. I shouldn't be surprised really, but I insist.• Spoiler talk:(view spoiler)[“Providence would never have allowed his guilty hand to pick out anything but the poison.”Jefferson Hope’s plan with the poison pills is very dodgy. Imagine, if “providence” does not oblige him as he expected, he would have died, and the Mormon villain he has been chasing for years would have thought “WTF?”, then have a good old laugh at Jefferson’s stupidity.Ah, but never mind providence, Conan Doyle is on Jeff’s side so he could not have possibly lost. Still, stupid bloody plan! (hide spoiler)]"}, {"Review": "“There is no satisfaction in vengeance unless the offender has time to realize who it is that strikes him, and why retribution has come upon him.” Sherlock Holmes is a legend. I've watched movies and TV shows, heard stories and read adaptions, but to this day I never read the original work. I wondered if original Sherlock would own up to BBC Sherlock, and so he did. But while their personalities are quite similiar, their stories still differ a lot, which was to be expected. I have to admit that I got a little bored and annoyed throughout this book, and I blame five big chapters in Part II of A Study in Scarlet. Suddenly I was in the middle of America, reading a story about Mormons, Secret Societies and the Great Plains - a subplot that had, to my disappointment, no Holmes included. The murder mystery was interrupted by a large background story that I had no interest in whatsoever.This novel was a classic example of a good story that took an undesired turn and therefore changed my formerly positive opinion of it. I still intend to pick up the sequels, this one was nevertheless promising.Find more of my books on Instagram"}, {"Review": "Not related to the book yetThis is the book that completes my 2011 Goodreads Reading Challenge! 275 books and I still have 3 days to spare. My first target was 200 because that was the the annual target of the author Nicholas Sparks as he said in one of his interviews. But I achieved it in September so I changed it to 250. But I achieved 250 on the last week of October and I thought I could still read 25 more. So, here I am, proud that I was able to read 275 books!!! Last year, I only read 196 books and I did not top Nicholas Sparks. Now, I am able to and I still keep my 8-5 office job.So, how is it to read 275 books in 360 days? It is very rewarding. Reading brought me to a lot of unfamiliar places, time and situations. Reading is very enriching (at least in mind, not yet in terms of financial rewards). I no longer worry about so many menial and mundane things that I used to worry about. When I am worry now, I think of the books about holocaust or 9/11, since I read a lot of books about these two, and say that my worry (of something that did not actually happen) is nothing compared to what Elie Wiesel or Victor Frankl experienced in the concentration camps. Also, when presented with a situation, be it in the office or at home, I now have a bigger perspective and no longer focus on my personal bias and prejudices. I used to have a lot of those before I became a voracious reader.How was I able to read a lot? Two techniques that I developed this year: (1) I read in every opportunity. I bring at least two books everywhere I go. I read before going to sleep. I read before getting out of bed. I read almost the whole Saturdays and Sundays. We have maids in the Philippines. I read while waiting for the car ban (we call this color coding) at the gym. I read while on queue at the ATM machine. I read the bible or any related religious book while waiting for the priest to show up during the Holy Mass; and (2) I read 5-12 books simultaneously. The idea is that if the book becomes boring or the story becomes dragging, switch to an enjoyable one. Normally, the start of the book is very engaging and the end is very interesting but the middle could be a bore. If this happens, start a new one. If it is good, then I'll be able to finish it in few days and then I go back to the previous book. Because my energy is high, the boring part will be manageable (translations: forgivable or unnoticeable) and I'll be able to continue.Have I cheated? Are there books whose entirety I did not read? No and yes. I think I did not understand everything but I tried reading each and every word in all of the 275 books. They say that there are indeed books that are intended to be taken as puzzle. Think of Ulysses by James Joyce. He put so many puzzles or riddles in the story that he expected to be interpreted in many different ways by generations to come. I think this is the beauty of reading and one reason why I enjoy works of great literary masters: their works can be interpreted in many ways and each of their works give different meanings to me every time I read them. So what will be my objective for 2012? I will read more classics. I have to finish Sir Conan Doyle's canon. To finally finish and try to get the gist of the whole of Ulysses, my \"waterloo\" book. I am still to read Mark Twain. My long delayed appreciation of Henry James' works. I have to re-discover Charles Dickens. I will read another Virginia Woolf. Another Jane Austen. Another Salman Rushdie. I need to complete the works of Haruki Murakami since I have the copies already. I will also need to increase my quota for Filipino works particularly novels written in Tagalog. I should be able to support Filipino authors by buying and reading their works.\nTop 10 Favorite Reads in 2011:\n 1. Anna Karenina by Leo Tolstoy; 2. Pere Goriot by Honore de Balzac; 3. Embers by Sandor Marai; 4. The Inheritance of Loss by Kiran Desai; 5. Wuthering Heights by Emilie Bronte; 6. Dusk by F. Sionil Jose; 7. One Flew Over the Cuckoo's Nest by Ken Kesey; 8. At Swim-Two-Birds by Flann O'Brien; 9. The Wars by Timothy Findley and 10. Ang Sandali ng Mga Mata by Alvin B. Yapan. These are the books that I'd like to recommend to you if you have not read them. Except #10, they are all in English.Now about this bookThis is my first novel about Sherlock Holmes. I only read two books from this genre before and both of them by female writers: Agatha Christie's The Murder of Roger Ackroyd and Sarah Cauldwell's And Thus Adonis was Murdered. These two are good and well written but I just find all those whodunnit quite uninteresting. Mystery crime books are focused on what happened (where, who, why and when actually not just what) and authors make them so convoluted for the readers to not be able to predict who is the real murderer. This being the nature of the genre, it normally lacks the human emotion that make me enjoy reading.And so I thought that Sir Arthur Conan Doyle is the same as the two ladies. A big mistake.A Study in Scarlet his first novel and where Sherlock Holmes was introduced to the world, has that emotional drama particularly on revenge because of lost love. The structure of the novel is very interesting: two seemingly independent \"stories\" fused into two. The first one is about Holmes meeting his narrator, Dr. John H. Watson and they started sharing a room because they cannot afford the rent. There is a crime that two detectives cannot solve and they want to have the opinion Holmes. Before the end of the first story, Holmes is able to tell who the real killer is. When he said \"Gentlemen, let me introduce to you Mr. Jefferson Hope...\" my mouth was open, my jaw dropped and I could not speak as I was taken by full surprise.Then suddenly comes the \"second\" story whose narrative style, characters and setting are totally different that the first. It was quite jarring and I asked myself, is this still related to the first part or maybe the publisher made a mistake during the book binding or reprint as this could be a totally different story, one of the 46 stories? Only after 10-15 pages when some names became familiar and I was able to predict the connection. However, I like this \"second\" story better. The setting is in the heartland USA and it felt like an old western story (a totally unexplored genre for me). It has that emotional drama of forbidden love and the father supporting his daughter to follow her heart. Mushy yet yummy for me. Men, real men, writing about love are really interesting for me. They don't go overboard and play or trick your emotion yet they are in it.I liked this book. My first foray to Sherlock Holmes. The Adventures of Sherlock Holmes is a 501 Must Read Book and it also became a Book of the Month for our Filipinos group here in Goodreads. I thought why only read that collection of Sherlock Holmes short stories if I could read the whole canon? With me liking his first novel A Study in Scarlet, I think I now have the right motivation to read his other 3 novels and all his 46 short stories. Had this been a disappointment (2 stars or less), I think I would not bother reading all his other works."}, {"Review": "Sherlock Holmes is a dick. And I don’t mean that as a reference to the character being a private detective. Sure, he may be brilliant, but he’s also arrogant, condescending, cold, rude, self-absorbed and generally an insufferable douche bag. If Watson wasn’t such a brown-noser, he’d have snapped and pimp slapped the shit out of Holmes about five minutes after meeting him. It’d been a long time since I’d read any of the stories, and I thought I’d check some out after watching Robert Downey Jr. play Holmes. And while RDJ’s version was an action hero that made Holmes purists bleed from the eyes and ears, at least he was a likeable rogue. Where as reading original recipe Holmes makes you want to jump into the book and strangle him just for being such a prick.But I guess that’s part of the mythos around the character as the cool analytical logic junkie. I may have liked him better if this was one of the stories where he was freebasing cocaine out of boredom because at least he would have come across as more human then.Holmes may be a key character in crime fiction, and while I actually found the mystery and detailed background of the motives in this pretty interesting, I was cringing every time Sherlock opened his mouth."}, {"Review": "I realized recently that I never reread Sherlock Holmes. I received collected SH for Christmas when I was nine, and read it all (with the exception of Hound of the Baskervilles, which I skipped at the time because I was afraid it might involve bad things happening to dogs) over vacation. I enjoyed the stories very much but at this point only remember colorful details and quirky solutions -- some orange seeds, a secret snake, men with red hair, different colors of mud.I don't know what happened to that nice hardbacked volume of my childhood. I certainly haven't seen it since leaving for college. For this reread I got the Everyman edition from the library. The previous borrower had also checked out Shirley Jackson ( Hill House, Richard Matheson (Hell House) and three books on raising chickens. She ordered all those, they weren't the result of casual browsing. I guess if you're raising chickens you need some thrilling reads.I can see why this held such appeal to Victorians. Smart, yet not difficult, not exclusive to those with less education. Yes, there are some classical allusions, but if you don't get them the story still makes sense. It's not like some English lit with important dialog in French. (I love you, Dorothy Sayers, but really?) And the long Mormon flashback section was probably quite exotic at the time, although I could've done without it.Once I started, it turned out that I mostly did remember the plot, but I still enjoyed this and look forward to more rereading."}, {"Review": "Read for Popsugar's 2018 Reading Challenge: a book with your favorite color in the titleThe beginning was great, as we got to see Watson meet Holmes for the first time, and discover some of his quirky personality traits. We see them jump into a little murder case, and work through that with the police force, which was all awesome. Halfway through the book, it shifts to different characters to sort of explain a bunch of backstory about how Sherlock figured it out, but I found this portion to be tedious and uninteresting, as I just want SHERLOCK. ALL THE TIME. So this was a decent introduction to the characters, but I hope the rest of the books don't follow this format!"}, {"Review": "Rating: 4 starsThis is my first Sherlock Holmes novel and yes, I am ashamed for not having read it earlier. I suppose that, what LOTR trilogy is to the fantasy world, Sherlock Holmes is to the detective/crime genre. Reading it is kind of like getting a degree. So anyway friends, I have graduated and am finally an official member of the crime/mystery fandom. And I am most definitely a part of the bandwagon of Sherlock Homes fans. Okay, off to the plot them:“A Study in Scarlet” introduces the famous, haughty and exceedingly intelligent detective and his sidekick Dr Watson. There is a murder committed, Sherlock Holmes investigates it, and he bashes the police force along the way, brushes off Watson when he turns all gushy with admiration, and solves the case and catches the murderer. So simple, NOT!!!! Holmes handcuffs the culprit but gives no explanation about his reasoning either to the poor police officers or to the readers. Then starts of Part 2: The land of the saints.You are reading this part and start wondering if your edition missing pages. There are, of course, beautiful descriptions of the deserts of, but you can’t find any freaking link between the stories.  You are majorly pissed at Holmes Though, as pages pass you get engrossed into this this beautiful, unconnected tale about Mormons. There is love, father- daughter and the romantic kind, there is polygamy, and Bollywood style running away (DDLG guys, only SRK brings along the dad too).Since it’s not Bollywood, there is no happily ever after, instead there is revenge, and heartbreak and then, murder. Suddenly, everything falls back into place. The stories collide. The murderer himself gives the much awaited explanations, and the Holmes and him, both gain mutual respect and admiration for each others talents (NOT KIDDING, I SWEAR!).The novel ends with the fulfillment of Holmes prophecy about the police talking all the credit and our sidekick Watson, proclaiming that he will let the world know the real truth through his journal. The storyline was therefore, in one word amazing Also, along with this fast paced plot and legendary characters there is the added bones of memorable quotes. My favorites were all spoken my Holmes. Especially those where he describes the mind to be like an attic. The part where Watson gets horrified at Holmes’ ignorance about the solar system was also exceedingly entertaining. When HOLMES SAID : “What the deuce is it to me?\" he interrupted impatiently: \"you say that we go round the sun. If we went round the moon it would not make a pennyworth of difference to me or to my work.”  I was mentally cheering him up, metaphorically waving pompoms This series is definitely worth the hype, even though I was a tad underwhelmed by this particular novel. I am going to continue reading it though, because I am soooo in love with arrogant prick called of a detective called Sherlock Holmes. "}, {"Review": "Los libros cortos me producen algo extraño: no puedo entrar en la historia y en los personajes (Con excepción de los libros del único y gran Franz Kafka). Cuando siento que estoy camino a meterme en la historia, el libro se acaba y no puedo hacerme muy amigo con los personajes o incluso con la historia.Es el caso de este libro. A pesar de la importancia que tiene Conan Doyle en la literatura policial, no me convenció. Es raro, Holmes conoce a Watson, investigan el caso de la casa abandonada, se mezcla con dinero y violencia... nada anormal cuando se trata de un asesinato. Si a esto le agregamos poligamia y mormones se convierte en algo bizarro.¿Recomendable? Sí, se puede leer en una tarde, pero insisto: no me gustan mucho los libros tan cortos, prefiero saborearlos más y estoy totalmente consciente de la importancia que tiene Conan Doyle en la literatura universal."}, {"Review": "You should read this if you like: Sherlock Holmes stories or its many adaptations, detective novels, short mysteries, Victorian London setting. What a delightful read! Sherlock Holmes and his detective stories have always been a favorite of mine. But while I’m very familiar with the numerous TV and film adaptations of the series, ASIC was my first foray into the novels. As expected the reading experience was slightly different, but equally entertaining. In A Study in Scarlet, author Arthur Conan Doyle introduces his readers to the infamous Sherlock Holmes, his partner Dr. John Watson, and their crime solving adventures. The story is told in roughly two parts: the first half is seen from Dr. Watson’s perspective as he is pulled into Sherlock’s world of crime solving via deduction. The second half is narrated from the perspective of the criminal as he details his motivation behind the murders. The mystery is a pretty straightforward one. Especially if you have seen \"A Study in Pink\" from BBC’s Sherlock, then you already know how this goes. But the Victorian setting, certain nuances in the characters, and lack of technology are things that kept the mystery fresh and engaging. It made the process of deduction that much more impressive.  “You have brought detection as near an exact science as it ever will be brought in this world.” My companion flushed up with pleasure at my words, and the earnest way in which I uttered them. I had already observed that he was as sensitive to flattery on the score of his art as any girl could be of her beauty.”  With the changes in setting and time period, I was curious to see if the characters had undergone modifications when adapted onto the screen. I was quite used to seeing the neurotic, sociopath version of Sherlock Holmes as played by Benedict Cumberbatch. In A Study in Scarlet, Sherlock’s character retains his personality with slight changes: this Sherlock was more excitable at the prospect of crime solving and wasn’t as cynical as the Sherlock from the 21st Century. Victorian Sherlock was also slightly more pompons, though he still carries his love for theatricality and his genius craves attention. He wears his emotions on his sleeve for the most part, though he can be quite tight lipped with information. \"They say that genius is an infinite capacity for taking pains,\" he remarked with a smile. \"It's a very bad definition, but it does apply to detective work.” Watson’s character in the novel is more that of an observer than an active participant at least in this first installment of the series. By all accounts he becomes a more active partner for Sherlock as the series progresses. Already in this novel, we see him slowly evolve into Sherlock’s friend and confidante. Though a little one dimensional, Watson is an integral part of the novel. He informs and mirrors the reader’s fascination with Sherlock and his methods of observation. In A Study in Scarlet, he exists as a foil to Sherlock own extraordinary abilities. But I have hope that this improves as I make my way down the series. My only other complaint with the novel is how abruptly the story splits into the second half which is narrated from the killer’s perspective. The digression acts as a flashback into the killer’s background and motivation, but it happened so abruptly it took me out of the story for a bit. It’s such an odd choice to pause for the info-dump right after apprehending the murderer specially as they then go on to narrate the past events when we come back to the cliffhanger from part 1. But that is a minor complaint, and I really enjoyed the mystery otherwise. It served as a really good introduction to the characters and the series as a whole. I would recommend it to anyone looking to get a sense of the Sherlock Holmes stories or looking for a place to start reading this gargantuan series. You can also read this novel for comparison with the BBC Sherlock and see how the show diverges from the source material. It certainly made me appreciate the Pilot episode a lot more the direction the BBC version took to establish its characters and the mystery in just its pilot episode. 3 stars out of 5."}, {"Review": "3.85En esta brillante y corta historia, Sir Arthur Conan Doyle nos introduce al descarado y sumamente analítico detective Sherlock Holmes y a su inseparable acompañante, el doctor militar John Watson —como dato, esto representa una de las más grandes presentaciones en el mundo literario y cinematográfico—. Doyle nos otorga un caso realmente misterioso, que conforme avanza la secuencia de los sucesos el lector espera ir resolviendo junto al gran detective. Se nos otorgan pistas y revelaciones pero no hay más que un hombre que podrá resolverlo todo. La novela está dividida en dos partes, por lo que entendemos desde un comienzo que habrá una reinterpretación o al menos un giro que resultará crucial en el desarrollo de la historia. Muchos se quejan de lo anterior, pero a mi parecer no fue realmente malo, aunque uno esperaría que fuera el mismísimo Sherlock quien devanase todo el asunto. De cualquier forma, una vez que se progresa en la lectura se entiende todo y ambas piezas encajan de manera perfecta. La obra funge una función crítica en un principio al sistema judicial de la época y después al fundamentalismo mormón, lo cual, me haría pensar que el autor pretendía presentarnos una opinión teo/eclesiofóbica o exponernos una problemática real de un aborrecible sistema que cree tener el poder sobre los demás.Y como punto extra a discutir debo argumentar que contrario a lo que esperaba, este libro carece por completo de pretensiones y exalta en su narrativa la influencia del grandísimo Edgar Allan Poe. Y eso, no puede ser nada más que bueno.\"Populus me sibilat, at mihi plaudo.Ipse domi simul ac nummos contemplar in arca.\"¿Lo recomiendo?"}, {"Review": "★★★☆☆½\n“There's the scarlet thread of murder running through the colourless skein of life, and our duty is to unravel it, and isolate it, and expose every inch of it.”\nHere we have the first ever Sherlock Holmes mystery originally published in the magazine, Beeton's Christmas Annual in 1887. Read as part of a buddy reads twofer since apparently much of our group, including myself, is OCD and can’t simply skip ahead to book two. Although none of the four novels¹ are connected it’s still nice to see how it all began for one of the greatest fictional detectives of all time.Dr. Watson is the narrator for this story, as well as all of the numerous Sherlock Holmes tales that followed. Watson has returned to London, after a brief, injury plagued, campaign in the Afghan war. He’s looking to save some money on rent, and is introduced, through a mutual acquaintance, to Holmes who just happens to be in search of a roommate. Sherlock runs through a brief list of potentially annoying habits which include smoking, occasional chemical experiments, violin playing, depression mixed with long bouts of silence. Watson admits to keeping a bull pup (which mysteriously never appears again), avoiding rows because his nerves are frayed from the war, keeping odd hours, and being extremely lazy. Both agree they can live with the other’s proclivities, and sign the lease on a two bedroom suite.There’s some time wasted where Watson tries to figure out Holmes vocation. It’s sort of comical that he’s afraid to just come right out and ask for fear of upsetting him. He even compiles a list of Holmes strengths and weakness in an attempt to puzzle it out. Which leads to an astonishing discovery: on certain topics, Holmes ignorance was as remarkable as his knowledge. For example, it was suggested he didn’t even know that the Earth traveled around the Sun. Holmes tells Watson that he believes a man’s mind is like an empty attic; the more you stock in it the more useful bits get crowded out. Therefore it’s important to only keep the most important items cataloged.Holmes was also a bit of a dick, and got a kick out of watching Scotland Yard’s finest chase false leads. He’d hold back pertinent information and watch as others struggle to solve the mystery. He also was sensitive to flattery and enjoyed hearing of his profound genius, and amazing powers of deduction. He cleverly employed a group of filthy street kids, whom he dubbed, “The Baker Street Irregulars” to help with certain aspects of the investigation. They could go into places and hear things no officials ever could.The mystery itself was well thought out, and enjoyable enough. The main problem I had was that the perpetrator is caught within the first half of novel, and then nearly the entire final half of the book switches into a flashback which details the history and motivations of the killer and his victims.I didn’t have much of a problem with Doyle going after the Mormons; it is a fictional story after all. And most religions have had their fair share of fanatics and ugly histories they’d like to forget about or cover up. Where I think Doyle crossed the line was in adding the leader of the church to conspiracy. That was uncalled for, and done in poor taste, in my opinion. That being said, that part of the story was slightly scary, and intense, and the suspense was nicely ratcheted up towards the end. The problem with the whole thing was that the two parts are so dissimilar from one another they felt like two entirely separate stories, and didn’t really mesh well together.The combination of British mystery with Western frontier story was an odd choice although I did enjoy both sections. The first half of the book, especially the initial meeting and budding friendship was probably my favorite part. I felt like much of part two was unnecessary, and all the explanation at the end of the story really drags out. Overall though, another fun story and very non-crunchy™.¹There are actually 56 short stories featuring Sherlock Holmes, but only the 4 full length novels."}], "Genre": "Crime", "ID": "102868", "Desc": ""}