{"Genre": "Crime", "Reviews": [{"Review": " “I have a meanness inside me, real as an organ. Slit me at my belly and it might slide out, meaty and dark, drop on the floor so you could stomp on it.” I highly recommend reading this whilst sitting in the sun with plenty of happy people around you (as I did) - that way you can avoid contracting something evil and nasty from its pages, and also avoid losing any hope you had for humanity. Okay, sorry, I make it sound so negative when actually this book is pretty fantastic if you can stomach the"}, {"Review": "I loved the writing style and the characterization so much--Gillian Flynn is a fantastic author! And I was so hooked by the mystery right away, I just flew through this book. Toward the end I did feel like we lost a little steam, but all the twists and revelations still kept things interesting, and overall I thoroughly enjoyed this! Definitely looking forward to seeing the movie, and probably picking up Gone Girl very soon here!"}, {"Review": "i was not a lovable child, and i'd grown into a deeply unlovable adult. draw a picture of my soul, and it'd be a scribble with fangs.gillian flynn sure does love writing about horrible people doing horrible things.and i sure do love reading about them. especially because she isn't one of those writers coasting on shock value and \"can you belieeeeeve a delicate flower of a woman is writing this??\" but she can really tell a story and i, for one, was completely surprised and pleased by the ending o"}, {"Review": "*4.5 Stars*Gillian Flynn scares me.But it’s a good scare! A keep-you-up-all-night-anxiously-reading-because-closing-the-book-is-not-an-option kinda scare. If you thought Gone Girl was twisted, make room for  Dark Places  because this suspenseful thriller takes “freaky” to a whole *nuther* level.I went in thinking I was fully prepared.I wasn’t. This book is so astoundingly  demented, it truly makes me wonder exactly how Miss Flynn thinks up such bold scenarios. The plot is so “out-there”, yet way"}, {"Review": "As seen on The ReadventurerSeriously, what goes on in Gillian Flynn's head? She writes the freakiest stuff. Sharp Objects was nasty enough, and Dark Places is just as vile. Luckily for her, I (along with millions of people) like vile now and then.Libby Day is a sole survivor of a horrendous massacre. Her mother and two sisters were brutally killed one winter night and, mostly thanks to Libby's testimony, the murders were attributed to Libby's older brother Ben, an alleged active Satan worshiper."}, {"Review": "{BR with Scarlet} \"The truly frightening flaw in humanity is our capacity for cruelty - we all have it.\"  I have no emotions left. This is a book that will stay with me forever. It left me speechless in different ways, with pretty intense emotions from anger and sadness coupled with hopelessness. This is not just a thriller/mystery/suspense novel but an absolute psychological roller coaster. I found myself almost too scared to keep reading, but so riveted I just HAD to find out what would happen"}, {"Review": "Gillian Flynn's first novel, Sharp Objects, was interestingly disturbing; in fact, it walked a razor-thin line between \"Huh, you certainly don't read that every day\" and \"Gillian Flynn has some serrrriiiious issues and I'm a little bit afraid of her\". I wasn't sure whether I respected her extremely dark side or her dark side is so dark it makes her books kind of uncomfortable to read. Strangely enough (once you know the story outline) Dark Places actually has a more conventional plot than Sharp"}, {"Review": "Normally I wouldn't give a genre book like this a 5-star review, because I'm picky and controlling about handing out major praise. How could a crime/mystery be as good as, say, Thomas Hardy or Alice Munro? Apples and oranges.But I just finished this about five minutes ago, and it made me gasp. It's so good -- a well-paced page-turner, beautifully wrought. I literally couldn't put it down for longer than a couple hours at a time once I picked it up (with the exception of sleep).According to her A"}, {"Review": "I have now officially read all of Gillian Flynn's books, and I really enjoyed this one!The story and the characters were so twisted, and the last hour or so of the audiobook was insaaaane. "}, {"Review": "As someone who grew up in rural Kansas and has lived in the suburbs of Kansas City for the last fourteen years, I made my peace long ago with the fact that I don’t reside in one of the hip places on the map. The only Kansas based things that have worked their way into popular culture are In Cold Blood and that goddamn Wizard of Oz. (As a Kansan, I listen to everyone I’ve met from somewhere else do the “I guess you’re not in Kansas anymore! Ha ha!” thing and can barely resist the urge to punch th"}, {"Review": " Gripping and entertained!  DAYS GO BY  You gotta believe in something, right? Everyone has their thing. This is my second novel by Gillian Flynn, and now I am realizing that I have been reading them backwards, I mean in the opposite publishing order, but this has been due mainly the order of film adaptations. However, I won’t wait until having any film adaptation of Sharp Objects, to read that one. I do hope to read it in the following months.My reading experience with Gone Girl wasn’t any good"}, {"Review": "When person or persons unknown murdered her entire family, seven year old Libby Day managed to escape and fingered her brother Ben as the killer. Now, decades later, she's dysfunctional and nearly penniless, and after meeting some true crime enthusiasts, isn't so sure her brother was the murderer after all. Can Libby discover the truth?After dodging Gillian Flynn for years in the wake of Gone Girl, I finally caved it when this showed up in one of my daily cheap ebook emails. Gillian Flynn, where"}, {"Review": "Lesson learned # 1: Gillian Flynn is excellent at creating unpleasant characters and disturbing situations. “I was not a lovable child, and I'd grown into a deeply unlovable adult. Draw a picture of my soul, and it'd be a scribble with fangs.” Lesson learned # 2: Reading her books in a dark apartment at 3 am is a big making-skin-crawl mistake. Dark Places is a book capable of leaving a nasty aftertaste and vague uncomfortable feeling for days after finishing it. I strongly suspect it is its inte"}, {"Review": "This is by far my favorite book ever! I started this knowing how much I enjoyed Gone Girl and when I got started with this I couldn't put it down. My soul bonded to this book from the first word. Page turner and an unforgettable ride. A hell of a ride. The movie is just as good and I can rarely say that about books and movies. Ugh, great, spectacular, amazing, eventful, mind-blowing, utterly fantastic. Read this book!!!!!! After reading Gillian Flynn's Gone Girl I knew I had to read her other no"}, {"Review": "Nothing like reading Gillian Flynn during the holidays to make you feel significantly better about your own familyWatch me discuss this book in my December wrap up: https://youtu.be/ReIV4UHlHCI"}, {"Review": " 4.5 stars . *breathes deeply* What a ride! Finally a mystery that keeps its appeal intact after the first 50% and does not make me roll my eyes all duh! like in the end. Let's see why, shall we?► Highly recommended if you can stomach the depression. *whispers* In the end, I even rooted for Libby. Don't ask me why. I just did. Nobody's perfect, okay? I said that the characters made me sick, but oh, the sadness. The despair. The misunderstandings. The loneliness. My heart aches from lack of hope."}, {"Review": "Well. I can't really say that I liked this book. None of the characters are likable, including the main character. Libby Day's family was killed by her brother when she was 7. By the time she hits 30, she's still 7 inside, her inner growth stunted by the tragedy. She can barely take care of herself, has never had a job, and suddenly the money that strangers donated out of charity over the years is down to about $900. To replenish her bank account, Libby grudgingly agrees to pimp herself out to a"}, {"Review": "This book was insaaaaane. But so so good. Dark Places was my first Gillian Flynn book (though I have seen the Gone Girl movie) but I fully plan on picking up her other books now.It’s the kind of novel that makes you question what on earth we humans can come up with. I kept wondering what was going on in Gyllian Flynn’s head. How does she think of these things?Dark Places is vile, macabre and gruesome. The author doesn’t hold back, instead she seemingly bombards you with everything ugly that is o"}, {"Review": "Dark Places is a masterpiece, composed of troubled characters,disturbing deeds and buried secrets.For me, it wasn't as good as Gone Girl or Sharp Objects but it still managed to be a fantastic mystery, full of suspense and tragedy.Gillian Flynn takes a similar route with her characters as Libby Day is a deeply troubled individual, seeking the truth behind her family's murder.She uncovers numerous shocking truths which shape this novel into a true page-turner.Libby Day is an incredibly complex ch"}, {"Review": "I didn’t like  Gone Girl, which I though started quite well but went rapidly down hill from half way. So I approached this one with caution. I shouldn’t have worried though; I could tell from the start this was going to be right up my alley. Libby is a lazy kleptomaniac who is living off the inherited life insurance from her hideously slaughtered family – well, who wouldn’t warm to a character like that! Libby’s brother Ben is the only other survivor of the massacre, and he is in prison having a"}, {"Review": "Back in 2012 and early 2013, I remember hearing a lot about a baseball player named Mike Trout. Being a Cubs fan (see: suffering), I didn't get many chances to watch the Angels since they play late at night, and for me that's prime writing time. But my son and I got the opportunity to catch an Angels-Cubs game on July 10th, 2013, and I finally got the opportunity to watch Mike Trout play in person at Wrigley Field. His stat line? Three hits, two of them doubles. A walk. A stolen base. Some spark"}, {"Review": "I read Dark Places  waaaaaaaay before I ever thought about writing giffy reviews for a hobby. That ‘splains why there’s always just been my 4 Star rating sitting here with no picture book accompaniment. But I live where this book takes place and I’m familiar with the landmarks and the vibe of certain locales that made the action so tangible to me and soon it will hit the big screen filled with A-list actors in the starring roles causing people to poke around and find my ugly blank review space.I"}, {"Review": " \"I was not a lovable child, and I'd grown into a deeply unlovable adult. Draw a picture of my soul and it'd be a scribble with fangs.\" Flynn has a gift for creating absolutely despicable characters that you can't help but sympathize with. Everyone in this book is horrible, from the narrator's ten-year-old sister, who is a gossip-monger and blackmails people for their silence, to the deadbeat dad who physically threatens his wife for money. Even the main character, Libby, isn't spared. She's the"}, {"Review": "“I was not a lovable child, and I'd grown into a deeply unlovable adult. Draw a picture of my soul, and it'd be a scribble with fangs.” Gillian Flynn, Dark PlacesGillian Flynn is the MUTHA of all domestic noir. She's my spirit animal. I feel defensive about her books, I think sometimes she gets a bad rap because her novels are so dark. Her characters unlikeable. Her plots are crazy. True, true, true.Underneath it all, it is impossible to overlook her talent in characterization. Every book I read"}, {"Review": "Other Reviewers mentioned they didn't like Libby! How can you NOT love Libby. She's emotionally troubled, selfish, lazy, angry and does not want to love anyone including herself. She is exactly how you would expect someone to be when your entire family is butchered while you are hiding and eventually running for your life. Flynn, I bow down to you for not making this character \"rise above\" her past and for writing a character so perfectly, that my heart literally felt like it was broken while I"}, {"Review": " Meh.Well, unfortunately this wasn't the page turner Gone Girl was for me. The most interesting thing about this book in my opinion was Libby's character. Where Gone Girl started out slow and then got really good, this one started out amazing and then went flat. I do like that Gillian Flynn creates these screwed up characters and I found Libby to be somewhat entertaining. Ms. Flynn isn't known for writing likable characters to be inspired by, but Libby was interesting. Her emotional growth was k"}, {"Review": "I randomly decided to listen to this because I wanted to watch the movie. It turned out to be a fascinating, yet disturbing mystery read. I couldn't stop listening, and came to care for these messed up characters. If you enjoy mysteries and thrillers, this is a must read. However, be warned, the content is pretty graphic."}, {"Review": "Gillian Flynn scares the shit out of me. Whilst this is nothing more than pure conjecture, it wouldn’t surprise me to learn she was a serial killer in a former life, or that she stabs bunnies and kittens and hamsters and toy poodles during her spare time (for research purposes). Sure, she has her shit together, but she has an interesting way of sprinkling her love for Kansas across 368 ink-splattered pages. It begs the question: What would she do with a state like California and in a city like L"}, {"Review": " Disturbing /heartbreaking /Perfect/thriller/mystery/suspense novel i loved the twist i really didn't see that one coming, The main character, Libby was a damaged soul, 3 of her family members were killed by her brother Ben (that's what the author wants you to think :p) i didn't like Libby very much she's a slob lonely woman, she had a rough start in life but that's not an excuse for sitting around and waiting for people to support her financially, it was annoying but she had her reasons, her br"}, {"Review": " I am a liar and a thief. Don't let me into your house, and if you do, don't leave me alone. I take things. You can catch me with your string of fine pearls clickering in my greedy little paws, and I'll tell you they reminded me of my mother's and I just had to touch them, just for a second, and I'm so sorry, I don't know what came over me. Libby Day's entire family was slaughtered, and she fingered her brother as the murderer. Locked up and far out of sight, Libby is 'living' her life... as muc"}], "ID": "5886881", "Name": "Dark Places"}