{"Name": "In the Galway Silence", "Image": "https://images.gr-assets.com/books/1523726317l/39218054.jpg", "Reviews": [{"Review": "Jack is back! After his last outing this was much in doubt. This hard drinking, Xanax popping, ex-garda, attracts violence like no other. Here he actually saves a man from drowning, a man bent on killing himself. He actually did a good deed, but the old adage, no good deed goes unpunished, is so true here, as he finds out much to his dismay. He will take another personal hit, and this one is hard to get over. People who friend Jack, seem to have short lives, and so it will prove again.With his trademark black humor, one liners, quotes from books and or music, and previews of current or near current events, Bruens writing is as unique as Jack's character. He doesn't mince words, nor does he hold back. Much like the structure of Ali Smith's writing, their is a plot running through, with many side trips, and opinions as a detour. Of course, structure is the only similarity, Smith's characters are no where as dark as Bruens. Yet, Jack's, tender but tough personality appeals, the writing never boring though I do wish Jack could at last catch a break.How long can he keep rising from the the ashes of his life, like the proverbial Phoenix?ARC from Edelweiss."}, {"Review": "For those not familiar with ‘The Jack Taylor Series’ by Ken Bruen a bit of back story is in order. Taylor is the creation of Ken Bruen, starting back from the year 2001. With 14 books now released in the series to date, the series is about the protagonist ‘Jack Taylor’ who is a cop turned private eye in Galway, Ireland.The series begins with “The Guards” released in 2001, where Jack is initially a member of the ‘Gardaí’, which is the Irish equivalent of a police force. Sincere to his job in the force, he flags a speeding politician one day for a traffic violation. But soon the politician touches Taylor’s nerves, and this leads to an assault from Taylor which makes him loose his job in the ‘Gardaí’. With a drinking problem and no job to live for, Jack Taylor soon turns into a private eye, but at first, rather reluctantly.Set in an Ireland where there are almost no private investigators, Ken Bruen’s character soon finds himself solving and attending cases that the ‘Gardaí’ disregard as they are of no significance to them. With old school detective skills and a maverick attitude and way of proceeding about matters, Jack soon finds himself a case more challenging than what he has ever attempted while in the force.We follow Jacks life beingAlcoholic.Coke fiend.Pill popper.Angry.Bitter.Scarred.Broken.Battered,TatteredTortured.Jack is a reader. His reading tastes are exceptional, I find myself making lists as I read not only of authors, but of books, music and Television shows. Mr Bruen’s writing style is unique and well worth getting acquainted with. His friends tend to die. Swans tend to die. Relatives of Jack tend to die. At times Jack’s despair is so viable he wants to die, What a great and compulsive series. "}, {"Review": "No one does Irish Noir like Ken Bruen, brutal, violent, lyrical with a musical quality in the prose, often sharp and staccato set in beautiful Galway, although it's underbelly of crime and horror once again slams into the broken but well read PI Jack Taylor's life. A shock that Jack is still of this world and for once, happy, in a relationship with Marion, whose son Joffrey is not so taken with her beau. This is not going to last long, this is Jack after all, and Bruen is not going to let this state of affairs continue without once more splintering his life apart as tragedy strikes again, albeit this is done with style, violence and verve. The father of murdered twins asks Jack to investigate. The twins were over privileged, disgraceful and entitled brats wreaking untold damage and despair into the lives of those they came into contact with. Not such a great loss to humanity then but Jack has it in his DNA to continue poking about in their murder, not a great idea, neither is rescuing a man intent on drowning himself. A vigilante, Michael Ian Allen, aka The Silence brings murder, mayhem, malice and machinations as he begins to dismantle and destroy Jack's life.Jack's past intrudes into his present, in the form of a wife with a daughter he never knew about, and a paedophile roams free but with badness in his heart. Jack continues to partake in the demon drink and popping the Xanax. A documentary maker wants to document the life of a hero and broken PI and dogs are being poisoned in the city. As usual, Bruen slips in quotes galore, the game of Chess, and documents events throughout the world, all indicating a world gone mad in a chorus that echoes what is happening in Galway and to Jack. Fans of this series know what to expect by now in this remarkable series, although it often feels like observing a deadly car crash in slow motion. My only complaint is that as usual the book feels far too short. Fantastic read."}, {"Review": "3.5 stars rounded down to 3.Thanks to Grove Atlantic for sending me this eARC through NetGalley. This is my first book in this series, but I have watched several of the tv adaptations. I would have understood it better if I had read the previous books in the series, but it worked ok as a stand alone. Jack Taylor is an ex Garda(police) now working as a PI. He is approached by a man who wants him to find out who murdered his 2 sons. Jack is an alcoholic and bitter about his lot in life--a failed marriage and now a failed relationship.Pros: Jack Taylor does solve a mystery, and the ending ties up all the threads. It is a bittersweet ending, with the deaths of various innocent people. Jack is driven even further into alcoholism by all the deaths.Cons: I did not like the stream of conscious writing--switching back and forth between Jack's thoughts in the first person and dialogue. I realize that fans of this series are legion and that this is my reaction. I read it in 2 days, as it is a short book.Two quotes:  \"There is a man, served three tours in Iraq and had the distinction of surviving three bomb attacks. He understandably developed a phobia about noise. He now specializes in what the Americans call wet work. More prosaically, he kills people. They call him the Silence.\"\"In Irish folklore three kinds of silence are identified: Silence through fear, Silence through choice, Silence of compassion.\" "}, {"Review": "EXCERPT: I turned very slightly, moved my face close to supercop, whispered, \"I'm going to shoot him on Friday, at about three in the afternoon, so you can be there to make the big arrest.\"He moved back a step. \"Are you serious?\"I pondered, then, \"Maybe it's the drink talking.\"Debated. Added, \"Could be Thursday. I'm lousy with dates.\"ABOUT THIS BOOK: Ken Bruen has been called \"hard to resist, with his aching Irish heart, silvery tongue, and bleak noir sensibility\" (New York Times Book Review). His prose is as characteristically sharp as his outlook in the latest Jack Taylor novel, In the Galway Silence. After much tragedy and violence, Jack Taylor has at long last landed at contentment. Of course, he still knocks back too much Jameson and dabbles in uppers, but he has a new woman in his life, a freshly bought apartment, and little sign of trouble on the horizon. Once again, trouble comes to him, this time in the form of a wealthy Frenchman who wants Jack to investigate the double-murder of his twin sons. Jack is meanwhile roped into looking after his girlfriend's nine-year-old son, and is in for a shock with the appearance of a character out of his past. The plot is one big chess game and all of the pieces seem to be moving at the behest of one dangerously mysterious player: a vigilante called \"Silence,\" because he's the last thing his victims will ever hear.This is Ken Bruen at his most darkly humorous, his most lovably bleak, as he shows us the meaning behind a proverb of his own design--\"the Irish can abide almost anything save silence.\"MY THOUGHTS: Random. Compelling. Dark. Funny. This book is all these things, and more. I was concerned about joining this series at book #14. I needn't have been. After some initial confusion, I was entranced. I wondered if the author was on speed. I wondered if I should be. I had to shift my brain into random mode and just go with the flow.'You always had a way about you, Jack. Not fully nuts, but circling.' - a quote that says it all. A great experience. I will be reading more from this author. 😂😲😆😨😉THE AUTHOR: Ken Bruen, born in Galway in 1951, is the author of The Guards (2001), the highly acclaimed first Jack Taylor novel. He spent twenty-five years as an English teacher in Africa, Japan, S.E. Asia and South America. His novel Her Last Call to Louis Mac Niece (1997) is in production for Pilgrim Pictures, his \"White Trilogy\" has been bought by Channel 4, and The Guards is to be filmed in Ireland by De Facto Films.He has won Two Shamus awards by Private Eye Writers of America for the best detective fiction genre novel of the year for The Guards(2004) and The Dramatist(2007). He has also received The Best series Award in February 2007 for the Jack Taylor novels from The Crime Writers Association DISCLOSURE: Thank you to Grove Atlantic via Netgalley for providing a digital ARC of In the Galway Silence by Ken Bruen for review. All opinions expressed in this review are entirely my own personal opinions. Please refer to my Goodreads.com profile page or the about page on sandysbookaday.wordpress.com for an explanation of my rating system. This review and others are also published on my blog sandysbookaday.wordpress.com https://sandysbookaday.wordpress.com/..."}, {"Review": "After finishing The Emerald Lie, I wasn’t sure if Jack Taylor would be with us much longer. Yet here he is…bleary eyed & bushy tailed. But there’s something odd about him. It’s like he’s…*gasp*…happy. He’s cut down on drink & cigs, quit the PI biz & has a new woman in his life. Initially the only fly in the ointment is her pompous 9 year old son. But who are we kidding? This is Ken Bruen & he seems to revel in putting Jack through the ringer. In the prologue, we watch as teenage twin brothers meet a horrible end. Their wealthy father approaches Jack with a job. Find the killer. Jack has just about recovered from a recent brush with mortality & isn’t eager to descend back into the world of thugs & violence where his investigations inevitably lead. Still, it seems pretty straight forward. Oh Jack…that should have been your first clue. Turns out the twins were spoiled, psychopathic gits & the only real surprise is no one killed them sooner. Then he runs up against the man responsible & life as he knows it is over. A master manipulator, the killer proceeds to dismantle Jack’s new life from the inside. What else can he do but welcome back his dark side?This is a quick read full of twists, violence & a kind of psychological warfare that leaves Jack reeling. He’s used to dealing with “disagreements” the Irish way. You either ignore it or get right up in its face. This time someone is getting to him by infiltrating the lives of those he loves. Jack’s not used to feeling helpless & has no choice but to return to his former life.I suspect there’s not a lot of ambivalence when it comes to whether or not you’re a fan. You either like his stuff or you don’t. I love it. No one writes like Bruen. Bleak, gritty & darkly funny…all written with the soul of a poet who composes each book as a love letter to Galway. We see everything through Jack’s eyes & become well acquainted with the ghosts that haunt him still. The narrative is lean & light on dialogue. Instead, we listen in on Jack’s thoughts as he ponders everything from how to kill a guy to the simple pleasure of a perfectly poured pint. Galway’s streets come alive through the characters he meets & his wry observations. Liberally sprinkled around the prose are quotes & comments from politicians, authors & musicians that pertain to the central theme of silence. He’s also a prolific reader & I always enjoy his terse book reviews. I’ve got a big soft spot for Jack & this is one of my favourites in the series. If you haven’t read Bruen before, I’d recommend starting at the beginning (The Guards). That way, if you fall under his spell you’ve got a whack of books to look forward to."}, {"Review": "3 hard to rate this one starsMy reviews can be seen here: https://wordpress.com/post/yayareadsl...Jack Taylor is not one of the characters I would like to know. Seriously, he is one messed up dude, drinker, drugs, and profanity seem to be his mantra. Of course dealing in the underworld he inhabits would definitely make more a bit abrasive right? This seems to be the fourteenth book in the series and I feel as if I am a bit behind understanding Jack as this is my first book about him and his escapades. However, Jack is trying to recover, to put his ducks in a row, to be a better person.Twins have been murdered, and Jack is hired by the French twins' father to investigate. Meanwhile, Jack is enticed to watch the nine year old son of his current flame. As poor Jack has been trying to stay out of the fray, trying to get his life in order, he does not want to enter the underworld that he was formerly a part of. But, things happen and Jack is drawn back in hook line and sinker into a world where the hits just keep coming and he descends into the hell he was trying so hard to escape. Life often does run in a complete circle and Jack finds himself back at the very beginning of a life he tried so hard to escape.I am somewhat ambivalent about how I feel about this book and the way in which Mr Bruen writes. It was a short book, but written in that kind of flow of consciousness way that had you flipping around trying to absorb the happenings. One might refer to this writing as controlled chaos. So, I am still thinking and still digesting whether this might be one of those love/hate relationships one can sometimes have with a book. Would I recommend this book? hmmm don't really know.Thank you to Ken Bruen, Mysterious Press, and NetGalley for a copy of this book due out on November 13th."}, {"Review": "Marilyn Stasio of the New York Times Book Review calls author Ken Bruen “hard to resist, with his aching Irish heart, silvery tongue, and bleak noir sensibility.” How right she is. And 13 turns out to be Ken’s lucky number. Because his baker’s dozen in the Jack Taylor crime fiction series — known as Ireland’s most distinctive — is an absolute winner. Riveting, hard-bitten and darkly funny, IN THE GALWAY SILENCE makes you feel anything but ... you want to shout its raves o'er the roiling waves of Galway Bay. Note: Bruen has a doctorate in metaphysics. Somehow that seems fitting. 5/5Sláinte to NetGalley and Grove Atlantic/The Mysterious Press for the early copy. Opinions are truly mine.#InTheGalwaySilence #NetGalley"}, {"Review": "“The Irish can abide almost anything save silence.”A few paragraphs into a new Jack Taylor novel and you hear the musicality and fall into the familiar rhythms of Ken Bruen’s prose. It is distinctive, like listening for the first time to your favourite band’s new album, you instantly the instrumentation and look forward to new tunes. Nobody in crime fiction writes like Ken Bruen. It is not just the words he uses, it is the way he puts them on the page.Ex-Garda, Jack Taylor is a violent and poetic man. He beats his problems in the most literal way possible, with a hurley. Jack cares about people, yet he is self-destructive. He appears to have a death wish, yet he consumes, and enjoys, popular culture (I have gained so much from exploring books or albums recommended by Jack Taylor, although he may have taken one too many to the head - considering “Perfect” by Ed Sheehan to be, well, perfect).Bruen’s plots are like a fever-dream. Jack narrates the madness that surrounds him, in this case a deranged killer and a returning out of the blue ex-wife, while commenting on craziness in the wider world - Donald Trump, Harvey Weinstein, Brexit - which only serves to heighten the sense of unreality.I love these books and, while jumping aboard here without reading any of the previous dozen books might not be the best recommendation, if you can find the rhythm, you will definitely enjoy the song."}, {"Review": "I received a copy of this book from the publisher through NetGalley to read and review.IN THE GALWAY SILENCE by Ken Bruen is the 14th book in the Jack Taylor series, and opens with Jack doing well and in a relationship with a woman named Marion that is giving him much to be thankful for; with the sole exception being her nasty young son who goes out of his way to antagonize Jack and sabotage his relationship with the mother at every turn.Jack is happily unemployed, and doesn’t wish to take on any cases, but is approached by a businessman named Renaud, who wants to find the killer of his twin sons Jean and Claude; even though they were miserable characters undeserving vengeance, and eventually Jack takes on the case to seek out the vigilante who leaves a sign marked 2 4 J, which Jack later learns means “two for justice”.Minding his own business, Jack reacts to an attempted suicide of a young man by saving him from death by drowning, and immediately regrets it as the intense young man named Tevis seems determined to attach himself to Jack, and reveals ties to the yet unknown vigilante responsible for the twins’ murder.Several things take place making Jack become a part of the planning of the vigilante, who’s name is revealed to be Michael Allen, a psycho known to law enforcement suspected but never convicted due to lack of evidence in several cases, and he’s intrigued with Jack and tries to force his hand by threatening those close to him, which is a sure fire way to get Jack’s attention by provocation.Jack is as cynical and pessimistic as usual once things turn for the worse, and his mile-wide mean streak serves him well in his pursuit with reckless abandon of the killer.Some of what I like about Jack is his unwillingness to conform to any expectations others have of him, his irreverent attitude towards the current state of his country’s Americanization and direction of the younger generation, as well as the corruption within the Catholic church, but along with his willingness to embrace some things that seem completely out of character, which surprises those who think they know him well.Dark humor and wit are Jack’s most used tactics employed in his dealings with others, and in making light of things that trouble him deeply, as it seems to be the only way he can deal with the horrible things he comes up against that cannot be resolved.Ken Bruen has done what several of my favorite authors of this genre in long running series have done, and that is to successfully age an older character yet keeping him relevant and able to adapt to change; albeit unwillingly as is often the case.I’ve only read a few books in the series, but so far liked this one best.5 stars."}, {"Review": "Irish noir!Even when things are looking up it seems like Jack Taylor's only way is down. When he rescues a suicide from drowning his life moves in a different direction, including a competitive killer who plays one-up-manship with Jack. A bleak Irish detective novel complete with wonderful stereotypes that reek of Jameson Whiskey and Irish fatalism is served in large doses.Staccato presentation leads from one scenario to another, with Jack giving the reader a sotto voice, often self deprecating commentary. Take his reflection on what to wear when meeting his previous wife's new person of interest.\"Right. How do you dress to meet your ex-wife’s new man? Carefully. I put on the obligatory black jacket, white shirt, tie, loosely (to suggest mellow or couldn’t [care]), black jeans, Docs. They had steel toe caps because who knows? Checked in the mirror, saw a battered undertaker’s assistant, the guy you keep in the background.\"Wonderful tone, and fatalistic nuances surround Jack's self reflections.I am just as fascinated as I always have been with this anti hero. Whimsy borders on tragedy. Great!A NetGalley ARC"}, {"Review": "Ken Bruen does it again - number 14 in my favourite series. Jack Taylor, ex guard, no saint, Irish noir that is at times hilarious, written in Bruen's inimitable style with paragraphs that more closely resemble verse than prose. It's original, unusual and continues to entertain as it appears that Jack might have at long last found contentment. Still loves the Jameson and still dabbles in uppers, but he has a new girlfriend, a new apartment with glorious views and little sign of trouble on the horizon......don't be daft. This is Jack Taylor, finds himself looking after his girlfriend's spoilt nine-year-old and trouble is heading his way. Wealthy Frenchman Pierre Renaud, a double murder, his ex-wife and an unfurling past.In the Galway Silence - it's grim, dark, hilarious - it's unique. Love him or hate him - it's Jack Taylor.I am definitely in the first camp..."}, {"Review": " Although I have seen the TV series, this is the first book of his I have read. It's like being on a roller coaster without having a chance to catch your breath. Perhaps if I had read others in the series, it would have been easier to follow but it jumped around so much that it was hard for me to keep up. Jack Taylor has many problems, more than one person should have and his use of drugs and alcohol don't help matters. This involves a secret group of bad people killing others and Taylor trying to stop them. When the main baddie gets involved with Taylor's family, he takes serious action. There is also a dog poisoning ring going on which was disgusting and some pedophilia. This really wasn't my couple of tea but I am sure long standing fans will enjoy it. Thanks to Grove Atlantic and Netgalley for a copy of this book to review."}, {"Review": "Jack is back. He’s bought an apartment. He has a new lady in his life and seems to be happy. The only little fly in the ointment is her obnoxious nine year old son Joffrey who gives Jack no end of trouble. But happiness and Jack don’t go together and he is still his old pill popping, drinking, ill humoured self. The book is full of dark humour and twists and turns with many characters out to get Jack. I like that Bruen puts in references to today’s news and has no trouble telling us how he feels about Trump. I am a Ken Bruen fan from way back and this book does not disappoint. He still has the gift of the old Irish gab.Thanks to the publisher via NetGalley for a copy of this book in return for an honest review "}, {"Review": "If you like mysteries that are dark, bleak and, at times, humorous, the Jack Taylor novels by Ken Bruen in general, and In the Galway Silence in particular, are just the ticket. Jack Taylor is his own worst enemy, as he attempts to solve a double-murder while managing his often chaotic personal life, with his usual Irish charm and blarney. Where Jack goes, confusion follows. Ken Bruen's prose quite often reads like poetry and the staggered style loosely imitates Jack's human condition as he goes from one problem to another. This is a quick and enjoyable read and transports the reader to Ireland, as sure as being there. Thank you to Grove Atlantic and NetGalley for the e-ARC of In the Galway Silence by Ken Bruen in exchange for an honest review."}, {"Review": "I want to thank NetGalley and Grove Atlantic for providing me with a digital copy of this bookThis is my first read of a Ken Bruen novel (Jack Taylor series #13) so I must admit I am a bit of a neophyte when it comes to following Bruen’s style of storytelling. How it compares to other books within the series is for others to say, but for me it is a difficult novel to read. The discourse is rapid and choppy and at times difficult to follow.Jack Taylor says he is happy, although his drinking and drug consumption have you wondering. So when Monsieur Renaud enters the bar and asks Jack to find out who killed his twin sons he refuses to take the job. Of course, as with any good detective, saying no is not that easy. This change of heart as well as the return of a girlfriend and then his ex-wife spins things out of control for Jack and many of the people close to him.The story itself is interesting but morbid. The black humor and quick-witted insults serve to speed the book along, but for me they are also a distraction. Frequent and non-relevant references to worldwide current events will quickly date the book (at least I hope Trump is history very soon). Having said this, once you are into the rhythm of Ken Bruen’s style of writing, this story is a unique and engaging read. It can be funny and yet heartbreaking. I recommend one give it a try and for the reason I score it 3/5."}, {"Review": "Ken Bruen deserves his own category. Rather, Jack Taylor, his angst ridden, retired P.I. who has seemingly found stasis in his beloved Galway, defies cliched norms. While let's hope the events of Bruen's life don't coincide with those of Jack, I can't help but surmise that he shares with his alter ego the disgust with which he perceives the world of 2017. Beginning with revulsion at the current occupant of the White House, he notes with horror the unfolding of news from, among others, mass shootings at the concert in Manchester and the massacre in Las Vegas. But this being Ken Bruen, there is plenty at home to occupy Taylor mostly at the hands of a psycho-vigilante who seems teflon coated in his ability to escape retribution. Also, being a work by Ken Bruen, there is much black humor as well as pop cultural reference throughout. Very short, very quick, satisfying addition to this series."}, {"Review": "This is the 13th outing for Jack Taylor, disgraced ex-Garda, heavy drinker, all round misanthrope with a heart of gold - or maybe butter. Now a private detective who gets results, usually by default. Set in Galway on the West coast of Ireland, this city on the edge of the sea before it starts rolling away to America, has much to recommend it as a location for crime fiction. A small city, with an excellent university, myriad bars and restaurants, and tourism an important part of its economy, it offers a wide choice of locations and possible characters for the resourceful writer. This is my first ever Jack Taylor novel and while I am aware of the awards and praise earned by previous books in this series, there seemed to me to be an awful lot of stuff crammed into a plot that seldom seemed important to Mr Taylor, leaving the reader to ask, ‘Why should I care?’ As the book opens with the murder of two utterly obnoxious twins by a not-so-disabled man in a wheelchair. We then get the quote which seems to be the moto of this book, “The Irish can abide almost anything save silence.”We next learn that Jack Taylor was happy. A new apartment courtesy of a deceased homicidal goth punk, a new girlfriend and a friendship with a nun – this is Ireland after all. One morning-ish while having his first coffee and Jay*, (Jamison’s) he is approached by the father of the murdered twins who wants him to find the person who killed his sons. So, as Sherlock was fond of muttering, the game was on. We now get over 300 pages of murders, kidnappings, aborted suicides, more murders, interspersed with references to current and historical events, like Trump’s latest atrocity or nuns dropping children’s bodies down a septic tank. There is also a sub-plot involving chess, but I never quite figured that one out. Each (short) chapter is introduced or ended by a quote, some recognisably real some invented. These are I imagined there to alert us about the salient point of the chater to come or just finishing. I was never sure which. Bruen is also a fan of lists and wonky punctuation and so provides us with many and much...There is a certain type of wanna-be intellectual that likes to be snotty about the fiction genre known as ‘Chick-lit’. Well, I now want to stake my claim as the inventor of the sobriquet, ‘Guy-lit.’ These can be identified by their fast-paced, short sentences, high-level of erudite trivia and a pervasive anti-modern civilisation, anti-church, anti-authority posturing. Reading one of these is like eating an entire box of Christmas chocolates in one or two sittings. Tasty going down but you wouldn’t want to do it again in a hurry. As I’d never hear of him before, I looked Ken Bruen up on Wikepedia where he is described as an Irish writer of hard-boiled and noir crime fiction. I’m a Finn living in a Nordic country and lemme tell ya – this is not noir. Only on the last 50 or so pages does this book acquire any sense of danger, horror or real trauma. I’m sorry Mr Bruen 3***"}, {"Review": "I have a spiral notebook dedicated to Ken Bruen where I take notes on his books. I don’t write down the plots, which are memorable in themselves. Rather, his Jack Taylor novels (and a number of his other works as well) contain an encyclopedic range of quotations, reading suggestions, music references and other pop culture nuggets that are all worth seeking out and sampling. Regardless of how well-read you may be, he will lead you to something new and startling.Bruen has a distinctive style, comprised of both short and run-on sentences that dip and swirl throughout Jack’s first-person past tense narrative. That worthy text is not a stream-of-consciousness technique, but occasionally comes close. Without warning, Jack will veer off the page into a tangent (always an interesting one) that may consist of a story from the past, a list of favorite books, or reminiscing over an old flame. The result is that one never knows what is going to happen next from the beginning of the book to the end. Sometimes there may be a vague hint or two, but it is always soaked in a general wash of foreboding.This is particularly true with the newly published IN THE GALWAY SILENCE. The first surprise, which arrives in the opening pages, is not a bad one: Jack has money, lives in a nice apartment, is in a relationship, is (reasonably) sober and seems somewhat happy. This is unfamiliar territory for the sodden Galway private eye whose usual state has him one foot in the grave and the other on a banana peel. However, all of this good fortune and clean living changes when Jack is retained by Pierre Renaud to find and return the individual responsible for murdering his twin sons. He is not really inclined to do so, given that Renaud is a notorious hedge fund manager, and whoever took his sons off the table did Galway and the world a favor.Nevertheless, Jack reluctantly immerses himself in the investigation, even as he gets wrapped up in babysitting his girlfriend’s precocious and obnoxious child and then finds himself suddenly confronted with a ghost of Christmas past bearing a gift that most assuredly was not offered by one of the Magi. Meanwhile, a vigilante assassin popularly known as Silence begins to slowly interject himself into Jack’s life with unfortunately predictable results. By story’s end, Jack is not on the precipice but is hanging close. Still, he promises --- or at least indicates --- that he will be back.I assure you that no one other than Ken Bruen is producing books quite like this, or quite this side of wondrous. He writes like an angel, a fearsome one such as he describes here, but one that you will want to keep and have close to you in order to appreciate your quiet and blessed life. A stunning experience from beginning to end, IN THE GALWAY SILENCE surpasses even Bruen’s usual superlative standards.Reviewed by Joe Hartlaub"}, {"Review": "Další anti-detektivka od Kena Bruena, spíš sled vztekle depresivních myšlenek a zuřivých činů než kriminálka. Ale stejně, i když mě to hladí proti srsti, i když jsou postavy vyvázány z logiky a jsou spíše unášeny náhodnými impulsy, čtu stále další Bruenovy knihy. Ta nikotinem prosáklá nervnost a vztek mě prostě přitahuje. Nehledě na strohý styl. Byť jsou si jednotlivé knihy hodně podobné. Taylor dostane případ. Taylor chodí po hospodách a chlastá. Taylorovi vezmou případ. Taylor chodí po hospodách a čte knihy. Za Taylorem přijde někdo a řekne mu kdo je pachatel. Taylor chodí po hospodách a shlédne několik televizních seriálů. Za Taylorem přijde pachatel a dělá ramena. Taylor chodí po hospodách a vede pár krátkých dialogů se starými kámoši. Taylor přijde o někoho či něco, na čem mu ještě záleží. Taylor buď zabije pachatele (obvykle během dvou vět), nebo se dozví, že někdo pachatele zabil. Taylor někam odjíždí. Ne, příběhy fakt nejsou to, kvůli čemu to člověk čte. Ale to kašlání na veškerá schémata, nedávání čtenáři to, co by chtěl, krutá nahodilost a vykořeněnost a především atmosféra... ty to táhnou. A navíc se s tou úderností pojí i to, že jsou knihy docela krátké, takže vás nestihnou nudit. "}, {"Review": "IN THE GALWAY SILENCE. (2018). Ken Bruen. **1/2.It has probably been 10 – 12 years since I last read a book by Bruen. I used to be a dedicated fan of his works, then suddenly I wasn’t interested anymore. When my wife came home from the library with a copy of this, his latest book, I felt that I owed Bruen a read to see if there was anything different about what has gone on over the last several years. Bottom line: Bruen is still writing the same non-book over and over. I’ve ordered several of his books from my ‘missing’ period to see if I am right or not, but we’ll see. Somewhere in this book there is a novel. It’s hard to find, and, when you think you have found it, you will soon determine that you were wrong. It wasn’t the book at all. The advantage of reading most of Bruen’s stuff is that you can lay the book down for a couple of days and pick it up again and start most anywhere. You won’t have missed much, except for maybe a murder or two. Chances are that those murders don’t really fit in to the main theme of the plot – assuming there was one. We’ll see if my survey of some of the books I’ve missed over the past few years changes my opinion or not."}, {"Review": "Ken Bruen's 'In the Galway Silence' is the 19th book in the Jack Taylor series. It is as fresh a read as I could have hoped for. Considered an action packed mystery, it is truthfully its own genre, one that only could have been conceived and executed by Bruen, who holds a doctorate in metaphysics. If he had studied epistemology, I don't think the book would have been this good.In case you're wondering, Jack still drinks way too much, has trouble with women, and has naughty surprises coming out of the woodwork from every angle. Ostensibly, he is hired to find out who murdered a man's two adult twin sons, disgusting creatures who probably deserved what they got. Jack goes to the site of the murders, a pier in Galway, and ends up jumping in the water to save a man who is trying to drown himself. The man is too grateful and becomes something of an albatross for Jack.If you're looking for a page turning literary read that will have you guessing all the time and sometimes laughing out loud, this book is a good choice. My only complaint is it was a little too ADD for me, going in too many directions at too frantic a pace. "}, {"Review": "This is the 14th book in the Jack Taylor series. In this outing, Taylor still drinks too much and continues taking Xanax and has a new woman in his life. On the surface his life seems to have settled. It doesn’t last long, just long enough for a wealthy Frenchman to find him and ask Taylor to investigate the murder of his twin sons. Added to that, he stopped a man from committing suicide, who, in turn, became a confidante passing on information on the murder case. There’s also a mysterious person known as Silence who seemingly is manipulating Taylor somehow.This not your typical mystery by any stretch of the imagination. Taylor is an unique character in the annals of mysteries, an alcoholic and addicted to Xanax, he moves through life without many friends, is unorthodox in his methodology, and doesn’t improve his lot when he’s successful. This could have been a fantastic read, but the way it is written is as unique as Bruen’s main character – so unique in fact, that it impedes reading book like a typical page-turner. Readers must take it slowly in order to keep track of who is speaking, who is doing what to whom, and how the story is progressing. The book is told in the first person, which has its problems as well.While this is the fourteenth book in the series, it can be read as a stand-alone, but I suspect that some things might make more sense if the first thirteen books had been read."}, {"Review": "Bruen has a unique writing style that takes, for me at least, some getting used to. This is only the second of his books I’ve read, and the first Jack Taylor, although I have seen the JT television series. Because of the way it was written, with incomplete sentences and sketchy details, I was able to sail right through it, but I realized after finishing it that the abbreviated prose hid a much deeper story. But you have to read between the lines. The review says that Jack is enjoying a period of contentment but there is little to support that in the book. Trouble starts almost immediately and escalates throughout the book. To say that the ending is abrupt is an understatement, but then most of the book seems that way. But Bruen somehow manages to convey Jack’s personality as well as his fatalistic view of life. "}, {"Review": "This is the latest in the fantastic Jack Taylor series of books and I absolutely loved it. Some readers have said they struggle with the style of writing but for me (especially having watched the excellent tv series) it is just like it is Jack thinking out loud and the narrative flows beautifully. There is the main part of the story running through (the murders by an ex-army killer for hire with his own problems) with smaller sub plots alongside, and as usual ex-Garda turned private investigator Jack has his share of good luck. However in this book he also has his share of tragedy which can only add to the woes of the hard drinking already embittered character that folk love and call a hero. I for one am looking forward to many more tales of Jack Taylor."}], "Genre": "Crime", "ID": "39218054", "Desc": ""}