{"Genre": "Crime", "Reviews": [{"Review": "ILLUSTRATED!What I learned from this book (in no particular order):1. Swedish billionaires furnish their multi-million dollar apartments with IKEA --- well, at least ONE peculiar Swedish billionaire.[image error]Poang Chair $402. Asperger's Syndrome may give you the idea that a T-shirt that says ‘I’M AN ALIEN’ is acceptable office wear, but also photographic memory and phenomenal mathematical ability.3. \"Sweden is one of the countries that imports the most prostitutes per capita from Russia and"}, {"Review": "(A-) 82% | Very GoodNotes: An entirely different mood, pace and atmosphere than its predecessor, it thrives off the strength of a single character."}, {"Review": "The first book was for the most part plot-driven. The 40-year old mystery took a while to unfold, but was interesting when it did. So was Lisbeth, although she wasn't the main focus. Enter, The Girl Who Played With Fire. The story has now turned character-driven with Lisbeth as the protagonist. But instead of having much of a plot of any character revelations about her early on, we read about her buying a new apartment, grocery shopping, and what furniture she picked out at IKEA in *great* detai"}, {"Review": "Stieg Larsson doesn't really do subtle. If he thinks an issue is important, he will shout it from the rooftops. With a megaphone. But since he is condemning misogyny and violence towards women, I'm ok with that. \"Salander was the woman who hated men who hate women.\"  This book, much more than its predecessor, focuses on the tiny-but-tough Lisbeth Salander. We learn quite a bit about the fascinating and horrific backstory that led to Salander developing her unique, defensive, prickly personality."}, {"Review": "I am confident that Stieg Larsson has a reason for this, but Lisbeth Salander is not much of a heroine. Let's list her transgressions from The Girl Who Played With Fire (and these will be deliberately out of context):1. She forces herself on a 16 year old boy in Granada.2. She kills a man on the beach during a hurricane.3. She shuts out Blomkvist for a very long time for a perceived slight, giving him no explanation.4. She fails to take or show the necessary care with her ex-guardian after his s"}, {"Review": "Very short review due to the glitches on GR. This is the second book in the trilogy. I loved it and I loved the movie. The book bogs down a little but it's all good. Lisbeth is back and doing her own thing. Lisbeth has been away from Mikael for some time. But, they come back together when Lisbeth is accused of killing that jerk rapist of hers. *****Spoiler*****Lisbeth looks into a sex trafficking ring that Mikael is involved in and finds out some things about her past she didn't want to know. He"}, {"Review": " He had come.He smelled of aftershave.She hated the smell of him.He...observed her for a long time.She hated his silence.Then he spoke to her. He had a dark, clear voice that stressed, pedantically, each word.She hated his voice.He laid the back of a moist hand on her forehead and ran his fingers along her hairline in a gesture that was probably intended to be friendly.She hated his touch.  Lisbeth Salander is simply unforgettable.  I read the first book in this trilogy the year it was published"}, {"Review": "Flickan som lekte med elden = The Girl Who Played with Fire (Millennium, #2), Stieg Larsson The Girl Who Played with Fire (Swedish: Flickan som lekte med elden) is the second novel in the best-selling Millennium series by Swedish writer Stieg Larsson. It was published posthumously in Swedish in 2006 and in English in January 2009. The book features many of the characters who appeared in The Girl with the Dragon Tattoo (2005), among them the title character, Lisbeth Salander, a brilliant computer"}, {"Review": "A downright masterpiece. The action sequences, the constant tension continually building up to lead to a tremendous ending. Lisbeth freaking Salander, she may actually be one of the best, and most complex characters I've ever had the pleasure of reading about. Introverted, extremely genial, and dangerous if need be, she's the epitome of the formula to the creation of a super-intriguing character.Like the first book, this was a complete investigation-kind-of-book. But unlike the first one, this h"}, {"Review": "Español - EnglishLisbeth ha desaparecido, se ha tomado un tiempo para superar lo de Mikael.Mikael esta escribiendo un gran reportaje sobre el tráfico y la prostitución.Sus caminos se cruzarán nuevamente...----Lisbeth has disappeared, she has taken time to overcome Mikael.Mikael is writing a great story about trafficking and prostitution.Their paths will cross again..."}, {"Review": "  Book Review  4 of 5 stars to The Girl Who Played with Fire, the second book in the Millenium thriller series written in 2006 by Stieg Larsson. Although I am very fond of this book, it wasn't quite as good as the first one, The Girl with the Dragon Tattoo. But it's a very strong follow-up sequel worth reading. It packs an even larger punch as far as violence and drama, as well as brings out the sexual chemistry and tension between Mikhail and Lisbeth. But this book is all about Lisbeth... and i"}, {"Review": "Three people are dead and Lisbeth Salander's finger prints are on the murder weapon. Can Mikael Blomkvist clear her name before the police find her? And what does Lisbeth's situation have to do with an expose of the Swedish sex trade two of the murder victims were working on?I was afraid The Girl Who Played With Fire would suffer from the sophomore jinx. I'm pleased to say it did not.Larsson must have figured out he had a good thing in Lisbeth Salander while working on The Girl With The Dragon T"}, {"Review": "4.75/5 stars. This sequel to \"The Girl with the Dragon Tattoo\" is brilliant! This is some of the best crime fiction that exists, in my opinion, and Lisbeth Salander remains one of my favourite fictional characters of all time. The plot of this novel is clever and the diverse set of characters fascinating. The only reason why this novel is not just as good as the first one, is because it contains some passages that at times seemed dwelling and somewhat repetitive. That being said, the conclusion"}, {"Review": "Much later. After such insistence on preserving my idea of my father, my memory of our last meeting, this happened a couple of Fridays ago. I opened up some photos taken by my brother and there my father is, dead in his coffin. I must confess to being quite distressed. And I still don't understand why on earth is this something to preserve? I don't get it one little bit.----------------Hooked. Totally, completely, utterly hooked. I read this book yesterday during lunch even though I was with two"}, {"Review": "“There are no innocents. There are, however, different degrees of responsibility.”Wow. Stieg Larsson did it again. He took my breath away.Larsson's style of writing is unique. It is so very detailed and everything seems to be perfectly planned.The characters are diverse and interesting and I am not only talking about Lisbeth Salander, the novel's heroine, but about most side characters as well.This novel is full of nerve-wracking suspense and thrill, especially the beginning and the middle.Howev"}, {"Review": "Unfortunately not as good as Män som Hatar Kvinnor. He has gone too far, and Lisbeth Salander is no longer a fully credible person; also, the puzzle isn't as satisfying as in the first one.Start geek-rant: as a former mathematician, I was annoyed by his sloppiness concerning Fermat's Last Theorem. To start off with, he misquotes it several times. And the whole idea that Lisbeth is able to solve it on her own in just a few months, with no formal mathematical training, is cheap. If this were the o"}, {"Review": "This is the sequel to The Girl With the Dragon Tattoo and it was immediately as good as the first but this time I knew this from the very first page.The first one I felt was slightly more clumsy at the beginning and took a while to truly love it. I speak only for myself of course. This one it starts off with a bang and you know immediately from the first page it is going to be just as good if not better.Blomkvist takes a back seat here and Salander takes the lead. She after all is really the mos"}, {"Review": "If loving the Millennium books is wrong, baby, I don't want to be right.In scanning through the other reviews, I have to concur with many of the problems mentioned: superfluous detail (specific IKEA furniture is mentioned several times--as if I know what any of it looks like just because I have the model number provided, sandwiches are made, coffee is brewed, Billy's Pan Pizzas are consumed); there's a real dearth of poetic or stylized language; there's a cast of hundreds (maybe not quite, but i"}, {"Review": "O_o  O_o O_oهو اللي انا قريته دا حقيقي؟يعني فيه واحد كدا عاديمسك ورقة وقلم او اي الة طباعةوبدا يكتب عادي يعني فكرة وبعدين قعد يشتغل عليهاوطلعت الرواية دي؟؟؟؟خليني اسئل سؤال كام مرة حد قرأ جزء تانيوكان بينافس او علي الاقل ف نفس مستوي الجزء الاولبالنسبة ليانسبة صغيرة جدادايما العمل الاول بيبقي فيه تفاصيل الراجلدا كسر الموضوع الجزء التاني من اول 50 صفحةانت متبنجحاسس ببنج ف عقلكالاحداث عامله تنقلكالفكرة عاملة تخليك تسئل مليون سؤالرسمه للشخصياتلا يقال عليه شئ غير سحريمتأكد ان فيه ملف كامل لكل شخصيةمف"}, {"Review": "There is ample description of our titular heroine in the first third of \"The Girl Who Played with Fire.\" Lisbeth Salander is composing and arranging a new life for herself while still maintaining the baggage left over from her early years (tons of child abuse) and the occurrences of Book #1. And she's still acting, to put it nicely, quite unconventional. It is precisely this mask, as well as people's prejudices & judgements that make her the ideal infiltrator of conspiracies in the highest e"}, {"Review": "This book was pretty slow getting started, but when it did, it did it with stupendous style. Lisbeth Salander ran the show in this one, which I really loved. I liked Lisbeth in the first book, but in this one, we see more sides to her than ever before. Let me put this plainly, I want to slurp freshly brewed coffee and scoff Billy pan pizza's with this woman, even if she is a cold and calculated pain in the ass at times. What I especially liked about this book, was all the weird twists and turns."}, {"Review": "Larsson's second novel about Lisbeth Salander, or about MIkhail Blomkvist of Millennium Magazine, either as it may be, was a suspenseful gem. A little slow to get started, this one lacked the steady momentum of the first, but the second half more than makes up for the inconsistent and morose first half. Larrson was immensely talented and it is a great shame that we can look forward to no more novels from him. As Blomkvist was the center of attention in the first, Salander is definitely the subje"}, {"Review": " “Not him too.” “Not him too what?” “Another admirer of Fröken Salander.” Why yes, I am too! Lisbeth has earned herself another admirer. Well, not completely but mostly.This was a BR with the Lisbeth Fanatic who promised me a mindfuck but unfortunately I didn’t get that and then the said fanatic disappeared soon after we commenced the journey got busy reading! ;)Happy now? :PThis is a hard book to review without giving anything out and since I myself haven’t read the last part, I can’t say what"}, {"Review": "I struggled through this 514-page book.To begin with, all the homo, bi, double-partner, and heterosexual talk was a bit much. Way beyond my comfort level.To be fair, once I got about half-way through the book - after all the characters' sexual preferences were clearly established - it did become a page-turner as I raced to find out the ending.If you like books with lots of character sketches, this might work for you. I was tempted to get out a notepad and sketch out all the characters and their"}, {"Review": "I LOVED THIS 2nd book by Larsson. The \"Tattoo\" Girl (The Girl With The Dragon Tattoo), is a wonderful character --even better in `this` book! Keeps getting better......I've already ordered the 3rd book from the United Kingdom. It comes out Oct. 1st."}, {"Review": "Wow! Such an intense story. Can't wait to read the third book because this cliffhanger is crazy"}, {"Review": "Culture imposes on women constant indoctrination of the idea that our vaginas should make us small, weak, and incapable of caring for ourselves or others.\"A woman could obviously never be a fire fighter, for example.\" \"We couldn't send a woman to do that military job because what if she got her period? She couldn't take a week off when she's there!\" \"There are just some days in the month when a woman diplomat wouldn't be able to do her job.\" \"I wouldn't watch women's sports because women aren't"}, {"Review": "I liked The Girl With the Dragon Tattoo, I thought it was clever and well-written and Lisbeth Salander is a unique and intriguing character, but I wasn’t knocked off my feet. I had the two follow up books on my shelf, but I wasn’t in a hurry to get to them, just thinking I would when I could. This week I picked up The Girl Who Played With Fire and stepped back into Lisbeth’s world, with a bang.This book is even better than the first one, perhaps because you already have a feeling of knowing who"}, {"Review": "In the second of his three volume series (well, at least it was three until Larsson's heirs hired someone to make a fourth from his notes) centered on the remarkable researcher and hacker Lisbeth Salandar and journalist Mikael Blomkvist, Larsson has delivered a totally engrossing page-turner. About to publish a book that reveals many dirty secrets concerning the international sex trade in Sweden, Blomkvist is caught up in a deadly race for the truth when his two authors are murdered and Salandar"}, {"Review": "You do NOT want to get on Lisbeth Salander’s bad side… The anti-social genius computer hacker is back in this terrific thriller that improves on The Girl With The Dragon Tattoo. Following the events of the first book, Lisbeth has left Sweden and been traveling abroad for over a year. She’s angry with Mikeal Blomkvist and has broken off all contact with him, but he has no idea why since Salander is far too socially awkward to ever explain herself or try to mend a damaged relationship. Blomkvist i"}], "ID": "5060378", "Name": "The Girl Who Played with Fire"}