{"Name": "The Silkworm", "Image": "https://images.gr-assets.com/books/1540217126l/18214414.jpg", "Reviews": [{"Review": "Welcome back to 12 Bar Cafe.. to Cormoran Strike's.Welcome back in London,and to actually Being Strike.I still see him as \"Hugh Jackman\" :),with some hair style to match, & Emma Watson as his adorable blonde, smart secretary, Robin.And Welcome to The Case of the Manuscript of....Bombyx Mori\n“..writers are a savage breed, Mr. Strike. If you want life-long friendship and selfless camaraderie, join the army and learn to kill. If you want a lifetime of temporary alliances with peers who will glory in your every failure, write novels.” ―Robert Galbraith, The Silkworm\nThe case this time is bloody strange, mysterious, full of twists , and yeah .. full of blood. It forces Strike to enter the nest of the Literary community, Which is Never as calm as you may think..It's full of envy, bloody parodies...indecent metaphors , and in this case,A carcass that slaughtered brutally ,viciously and , somehow, symbolic..It's the Silkworm Case...A worried wife comes to Cormoran Strike's to investigate the usual disappearance of her husband the writer after some troubles with his agent about publishing his new novel.Strike discover that the manuscript of his unpublished novel is awfully describes every one in the author's life in a sarcasm, indecent bloody metaphors, some of it'd even ruin lives and reputations.The problem is , the manuscript get leaked, and most of London literary community knows all about, the people involved are important ones, powerful and some of them, as many people of the literary circles, weirdos or even worst, maniacs..\n“The whole world's writing novels, but nobody's reading them.” “We need readers,” muttered Daniel Chard. “More readers. Fewer writers.” ― Robert Galbraith, The Silkworm\n\nWell don't look at me just like that...it's J.K.Rowling Robert Galbraith's opinion about them...and sure knows better than us about the habitants of this nest of Writers, Authors' Agents ,Editors, Publishers..And really what she said is shockingly bold..\n“I said that the greatest female writers, with almost no exceptions, have been childless. A fact. And I have said that women generally, by virtue of their desire to mother, are incapable of the necessarily single-minded focus anyone must bring to the creation of literature, true literature. I don’t retract a word. That is a fact.” ― Robert Galbraith, The Silkworm\n\nAnd I called it 'nest' because Owen , that poor author,founded brutally viciously murdered by a cold blooded murderer..And we'll wonder the whole novel Who did it? You may suspect -as I did all the characters, even his little daughter :) , But you won't ask why, you'll read big parts of 'Bombyx Mori' that can be enough reason for any one who get metaphorically mentioned in it to do so.And remember my friend...not all writers are as sane as you may think..******************************The Characters---------------As book one, every character ,main or secondary, is deep enough to feel like it's a real person.And again you'll be able here to read their body language and could tell their moments of confidence, or disruption..You'll know if they're hiding something...even before Strike would clear that out..BUT STILL, you'll never tell who did it before him saying so.****************And in the second novel we get to know more and deeper into Strike and Robin's lives ,more of the family and friends of Strike and Robin appear in this one, which really enrich the characters and the novel overall.And again Rowling is keeping us on edge to know whether they will be working together till the end of this case or not.********************************The Writing Style------------------I really adore the writing style of J.K.Rowling Robert Galbraith... although it's really a bit difficult to me, too much describes with 'classic' language mixed with new expressions ...But it always worth the long hours read with the clever plot..Here, there's more pages about Strike's other cases he works on in the same time of the case of The Silkworm..That may be a bit boring for some, But I think it's good as we actually  live with Cormoran Strike for the 3,4 weeks that the main case takes.It's like we not reading just A case and that's it, we experience Full Time of the detective's life 'both personal and professional' in the time of the main case.One more thing, The Amazing London life style experience ... I mean since the sample of first 2 chapter here, I felt I'm actually in London, by dawn's early light in the perfectly described Smithfield Market.. not only describing the places, BUT also a glimpse of its history...The novel as the first one is like a tourist guide for the pretty traditional London.I enjoyed so much reading about The Simpson's restaurant and loved when I googled it and saw it's as I imagined while reading the fine description. The part when Robin drive Strike,the car travel in the snowy weather, and trying to get to Kings Cross in time was awesome part too.And for making the novel even more Real.... check these 2 Real magazines covers of Dec.2010, you'll find them hidden in the novel. And I shocked when I read about the sinkhole in Germany was real..I saw the pictures 3 years ago but thought it's fake..Do you think it's got something to do with the Magical community? are Deatheaters back? Potter must know about. :) Well, finally , it's a shame this review appears in Wikipedia,\n Val McDermid from The Guardian gave the novel a positive review, but criticized the descriptions of the different London settings, which she considered superfluous: \"I suspect that having spent so many books describing a world only she knew has left her with the habit of telling us rather too much about a world most of us know well enough to imagine for ourselves\". \n\n Well, the novel isn't selling Only in UK... AND not all the readers worldwide know London streets \"well enough\" to imagine.. It's good to visit and see London's streets, Bars, Cafes...etc by Rowling's writing style..as Dan Brown does also when he takes us into different countries by his novels pages...and so she does here.PS: check my illustrated Book One's Review Rowling is a master of visualizing her novels' settings..whether it's Hogwarts, Bagford ...or London.A novel that you really Must Read...enrich with characters, setting and fine Thriller.Mohammed ArabeyActual Read :from 31st July 2014To 15 Aug. 2014**************************************************^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^First 'Preview' is hidden(view spoiler)[*I am Become A Name..Cormoran Strike\nAnd after my experience with The Cuckoo's Calling..as I've said at the review,to me all the character were, some of them even more than, a Name.My review for Book One. I believe that Cormoran Strike is a very rich character, even more than,with all respect, Agatha Christie's Hercule Poirot or Arthur Conan Doyle's Sherlock Holmes.His brilliant debut really hunts me,with it's clever plot and amazing characters even when I never read a scene for Lula Landry at the first novel but I just like her and she was a Name.Spending -willingly- about 4 weeks reading and living with the first novel;..I can't wait for Cormoran's new Strike.*\"I cannot rest from travel: I will drink Life to the lees; all times I have enjoy’d Greatly, have suffer’d greatly, both with those That loved me, and alone; on shore and when Thro’ scudding drifts the rainy Hyades Vext the dim sea: I am become a name…\"from \"Ulysses\" by Alfred, Lord Tennyson** I honestly can't believe the people here who already rate the book without even knowing the plot of it or even its title.Mohammed Arabey31th October 2013 (hide spoiler)]"}, {"Review": "\nWicked brilliant!\n ( Yes ;) Pun intended! )\nHERE COMES CORMORAN & ROBIN AGAIN!\nIf you are respectably active on the reading community, it will be no surprise that this \"Robert Galbraith\" is really the mega-famous writer J.K. Rowling, author of the ultra-mega-famous book series of Harry Potter. Why bother on making up the pseudonym when it was revealed after like two weeks when the first novel of this different series got out, that's a mystery to me! (Yes, another pun intended :P ).Evidently the genre, topics and setting of the Cormoran Strike book series is totally different from what you find on Harry Potter, but there are other authors writing different kind of genres and to different target audiences, and still they keep their own established author names.Anyway, the relevant point here is that \"Robert Galbraith\" doesn't exist but J.K. Rowling definitely exist and a lot in the literary world.\n...writers are a savage breed, Mr. Strike. If you want life-long friendship and selfless camaraderie, join the army and learn to kill. If you want a lifetime of temporary alliances with peers who will glory in your every failure, write novels.\nWhile this still is a fictional detective mystery novel, I think that easily can be one of the most personal books that J.K. Rowling ever written. Due that in the first book of this series, she chose the world of modeling and couture, but in this second novel she is opting to use the world of publishing books as the ambiance for the mystery to solve.\nFROM FASHION TO BOOKSELLING\nThe story is set like eight months later of the previous book, and if you hadn't read it yet, but you just can't wait to read this one, you can do it, since while it's a series, you will get the very basic highlights that you need to know to get into the second book BUT without spoiling the culprit on the first novel. So, you can even read both books in reverse order and you still be able to enjoy and get surprised in both novels.Now, Cormoran Strike's business is rising up thanks to his success in solving the Lula Landry's case. The lovely Robin is still his assistant (THANK YOU, J.K. ROWLING! I LOVE YOU FOR THAT!) and the good thing is that her role in this book series will be growing and growing. While Robin was my \"anchor\" on the first novel and the main reason to keep reading and reading the first book, I am truly glad to mention that I still love Robin BUT now I do like a lot the character of Cormoran Strike too and there is no doubt that he is the truly main character of the series. The two of them now are making a wonderful team. Beware villains! Here comes Strike and Robin! (Yes, this is a third pun intended! Please, indulge me! ;) )Strike has been quite busy getting a lot of clients meaning that his business of private detective is finally afloat. However, he is kinda dissapointed that many of these cases are basically discovering cheating spouses or crooked politicians, so when he finds in front of him what it seems the chance of helping a helpless old woman to find her husband, he accepts even while the chance of getting a payment out of this seems really unlikely.\nTHE BOOK SERIES GETS BETTER!\n\nThere are always loose ends in real life.\nI am truly glad to mention that while the first book took like an 80% of writing to boost my interest, in here, it was right from the beginning. In the first book, it was like monotonous interviews basically asking the same questions and re-living the same crime scene on and on and on...zzzh...mmh? Oh, right...In here, while he still does interviews, each of those are really interesting, asking different stuff, looking for different angles on the case. Also, another good thing was that while in the first book, you get to know irrelevant moments of Strike's personal life, in this second novel, Rowling was able to exploit each personal moment to be totally involved in the case. The story is focused on the case, however there were some scenes mentioning other cases where Strike is working too. Yes, I understand that in real life, detectives work in several cases at the same time but in literature, one doesn't want to lose time reading about irrelevant cases that aren't the main story.I commented on the first book that it could be better with less pages, and I was glad to see that this second novel has less pages than the first book, making the rhythm of the story more fluent. However, if Rowling can make the third novel (since I do hope the making of a third book in the series) with even less pages. I really think that this book series can be a total blast having novels with 300 pages or less focusing in scenes only about the main case.\nForever encased in the amber of a writer's prose.\nI was delighted to know that I was wrong about who the culprit was on this case. I think that any reader of detective novels invested time in the middle of the reading experience trying to deduce who did it. And again, J.K. Rowling surprised me with a great process by Strike joining the clues and exposing the case. And when Strike is explaining it, you say: \"Wow! Yes, he's right. All those clues were there!\"\nHard to remember these days that there was a time you had to wait for the ink and paper reviews to see your work excoriated. With the invention of the internet, any subliterate cretin can be Michiko Kakutani.\nWell, J.K. Rowling, you did it again!!! And even better!!!\nLightning doesn't strike twice.\nThis second book is a real proof that lightnings can strike twice! J.K. Rowling brought magic to the hearts of readers with Harry Potter and now she is thrilling them with Cormoran StrikeDefinitely this second novel is an enormous improvement from the overall reading experience of the first book, now the book series is on tracks and I can hardly wait for the third novel!Highly recommended!\nP.S.\n\nThe whole world's writing novels, but nobody is reading them.\nIt's not an easy task, but every day I do my best to read a bit of all those novels out there. ;)"}, {"Review": "2.5 stars - SpoilersDisappointing, it wasn't awful but it wasn't good either. It was all rather predictable and generic, I wouldn't have minded the cliches and obviousness of it all if the main characters (Strike and Robin) had stood out in some way. Sadly, they didn't. I didn't care about either of them… I actually kind of hated both. -I wasn't a fan of the writing, there were a number of times where I came across sentences that didn't flow very well. Some of the more 'difficult' words seemed to be added in just to make the writing seem more impressive but it only ended up doing the opposite.-There was nothing actually impressive or genius about Strike's detective skills or intelligence, the only reason he came across as half competent was because most of the people around him were completely thick. I mean, literally everybody on the police force were thickos… Yea, I could maybe buy a few of them being dim or lazy or something but not all of them. Most police officers have years of experience and various training/qualifications, not to mention all of them have access to countless resources and other experts (criminal psychologists and the like). I very much doubt Strike could compete with that — so yea, the only way to make his character come out on top and solve everything was by making everyone else dumb, which was plain lazy writing.-I didn't like the heavy handed portrayal of Robin and Matthew's relationship. It's so obvious they'll end up splitting up because of Matthew not supporting Robin's quest to be an investigator, the amount of times he was shown as not understanding Robin or her work was ridiculous. It kept cropping up over and over, it was like Rowling was trying to make extra sure that her readers knew how unsuitable Robin and Matthew were for each other whilst simultaneously not-so-subtly showing how us perfect Strike was for Robin and how he understood her. Ugh, it made for nauseating reading.-What was with Robin being all submissive and servant-like when it came to Strike? Yea, he was her boss but she went above and beyond her work duties… She acted more like a downtrodden, dutiful wife the way she fetched things for him and made him tea and coffee. Of course, Strike loved her meek, submissive wifey behaviour and thought she was such a good little girl whenever she was quiet and did all his bidding. Ugh, it was all rather misogynistic and cringey. -It was laughable that so many beautiful and successful women (like Nina) kept throwing themselves at overweight, hairy, unsuccessful, middle aged, bland Strike. Yea, bloody right. It was disgusting and off putting when Strike called Nina desperate and needy for wanting to sleep with him straight away… Yet he didn't think any badly of himself for sleeping with her when he didn't even like her, at least Nina slept with him because she for some reason fancied him… Whereas he basically slept with her just because and as a thanks for the information she provided on his case (though she didn't know that), his behaviour was rather prostitute-like… He had no right to be casting judgement on anyone else. The prick.-There were so many stereotypes of women, they were either some variation of a Mary Sue or they were shallow, desperate losers who threw themselves at Strike or were completely messed up. None of the women came across as real people.-What was with all the female characters eating/drinking things like soups/salads/water whist Strike was chugging down pints and having steak and chips? It was irritating to read the females always eating such healthy/little food whilst Strike stuffed his face with all sorts. Has Rowling never met any women who eats takeaways or desserts or something?!-I actually think I would have enjoyed reading Bombyx Mori (the much talked about manuscript in the book) more than this — it sounded wonderfully bonkers.-I did really love some of the side characters, they were infinitely more interesting than Strike and Robin. I also enjoyed the setting and descriptions of London - it was captured really well. All in all, this was just a run of the mill mystery novel — the main characters were so blah and it was obvious who the bad guy was as soon as they were introduced. Yea, I expected more from Rowling."}, {"Review": "\n\"...Writers are a savage breed, Mr. Strike. If you want life-long friendship and selfless camaraderie, join the army and learn to kill. If you want a lifetime of temporary alliances with peers who will glory in your every failure, write novels.\"\nAnd just like that, J.K. Rowling under the pseudonym of Robert Galbraith takes on the familiar to her world of writing and publishing, bringing to light the petty conflicts, backstabbing attitudes, hurtful gossips and inflated egos. The bared claws and at-your-throat attitudes, the dislikes and grudges held between successful writers and less successful ones, the wannabe writers, the ones who can and cannot write well, the agents, the publishers - it all looks like an ugly mess, to say the least.\n\"The whole world's writing novels, but nobody's reading them.\"\nThis unpleasant world serves as a backdrop for a rather gruesome murder \n(let's just say that a writer spilling his guts can have a very literal meaning, okay?)\n that matches precisely the final scene in the victim's book. The victim, Owen Quine, is a not-too-successful writer and, frankly, a very unpleasant person, whose latest book seems to focus on trash-talking everyone connected to him in the literary world and personal life and pisses off quite a number of people. In fact, it seems to have upset someone enough to brutally murder Quine in a way that combines intestines and hydrochloric acid and a feeling of nausea trying to imagine the resulting crime scene.It, of course, falls to the private detective Cormoran Strike (who recently solved the murder of Lula Landry, earning himself some notoriety and a bit of cash) to untangle this mess and find the killer. Yet again he's aided by his secretary Robin Ellacott who, having worked with Strike for a while now, dreams of receiving some investigative training herself, seeing that she has a knack for the job - while struggling to explain her love for the job and admiration for her gruffy boss to her way more conventional fiancé Matthew.Rowling continues the pattern she set in the first Strike book. The solution to the mystery unfolds slowly, through the grunt of investigative work, through long interviews with suspects, through long treks on the streets of London, with many false trails and red herrings, guided by Strike's unerring sense and skill. The mystery is slow-moving and lacks the easy 'gotcha!' moments, hinged instead on character studies, allowing the suspects to slowly reveal their inner selves full of shallow and sometimes quite dark unpleasantness, propelled by almost casually shrewd observations of social inequalities and prejudices. Every character (short of almost idealized Strike and Robin - just for once can Cormoran Strike ever be wrong about anything?) gets the not-too-pleasant but very apt treatment of Rowling's sharp characterization which makes them come alive even when you'd rather them not. The plotting is intricate, the multiple plot strands so tightly woven together that it's a pleasure to look back at the end of the story and see how they all were coming together. And even the annoying turn in the last quarter of the book when Strike has solved the murder but the readers are kept waiting for the final reveal does not spoil the enjoyment of the story.All in all, I enjoyed this book quite a bit. While not perfect, it captures Rowling's talent as a storyteller and a master plotter quite well. 4 stars. I'll be quite happy to follow the adventures of Strike and Robin for quite some time."}, {"Review": "As much as I enjoyed the first Strike book this second venture was rather a let down. What we have in \"The Silkworm\" are alternating chapters of the main character lamenting about the pain he is suffering from his injured leg, and his assistant Robin suffering from angst about her relationship with her soon to be husband. These concepts were rather new and interesting in the first installment, but have grown weary and tiresome being constantly replayed in this second. The pair travel from bar to bar to eat meal after meal drinking and ignoring the elephant in the room which is their own relationship.J.K. Rowling does noting to further the overall plot along. She does nothing to grow the characters only to trundle them through their repetitive motions. Yes the mystery has changed plot from a murder of a starlet in the first book to a murder of and author in the second book.The assumption is that the Silkworm takes place a few months after the finish of the first book, and the dates dropped within the text indicate that they were written in the 2010/2011 time frame. Most likely without a pause between them. Ms. Rowling did not give herself enough time to re-charge her batteries. Just enough time to re-tread her tires. She is capable of so much better. After all what was the rush to get this book to market ... oh perhaps a book contract as it certainly can't be for the need of money. Sadly, for the accomplished writer of books she has shown herself capable of, the book was not as good as it should have been."}, {"Review": "أنه وقت معرفة سبب أخر وراء أستخدام جي كي رولينج أسما مستعارا لكتابة تلك السلسلة\n\"الكُتّاب قطيع متوحش، سيد سترايك. إن أردت أن تكوّن علاقات تدوم العمر كله وصداقات حميمة خالية من الأنانية، أنضم للجيش وتعلم كيف تقتلوإن أردت حياة مليئة بالتحالفات المؤقتة، مع أقران يأتي فخرهم ومجدهم من أي لحظة فشل لك، فلتكتب روايات\"\nأو أكتب مراجعات مثلا، لا فارقففي هذه الرواية القضية الدموية الكثير من الغيرة والأحقاد، تشبيهات أدبية وأستعارات فجة، محاكاة ساخرة غير لائقة، مجازات غير أخلاقية..وبيست سيلرزفي هذه القضية يقتحم كورموران سترايك ومساعدته الحسناء روبين عش الدبابير، الوسط الأدبي الذي صار مزدحما كمحطة مصر -محطة كينجز كروس في حالتنا تلك- وقت اﻷعياد\n\"العالم كله يكتب روايات، لكن لا أحد يقرأها.نحن نريد قراء\" تمتم دانيال تشارد\"قراء أكثر، كتاب أقل\"\nدخل سترايك، بطل روايتنا، ذلك العش لتحقيق في قضية مقتل دودة قز لم تستكمل شرنقتها..مؤلف كان يسعي للتحول كأقرانه نحو الشهرة، لكن تم قتله بشكل دموي بشع...طقوسي ورمزي ويحاكي مخطوطته اﻷخيرةمخطوطة بومبايكس موريألم أقل لك إنها قضية أدبيةإذا قرأت \"دودة الحرير\" ستشعر أن المؤلف فعلا رجلا..فظا بعض الشئليس حتي مؤلف وإنما رجلا يكتب وينتقد مساوئ قطيع لا بأس به من المؤلفين والوسط الادبيبشكل دموي وفظ ، ولكنه بنفس الوقت ممتع ومثير وغامضاعتقد ان جي كي رولينج لديها هذا الحس البوليسي كما كان في هاري بوتر حين كنا منذ الكتاب الاول نشك في من سرق حجر الفيلسوف او فتح غرفة الاسرار، من يساعد سجين أزكابان ومن وضع أسم هاري في كأس النار...ولكن هنا لعبة الأسم المستعار جعلت منها اكثر جراءة في تقديم المشاهد الدموية العجيبة الشاذة باﻷخص اﻷجزاء الطويلة التي يقرأها سترايك من مخطوطة رواية 'بومبيكس موري، دودة القز' والمليئة بالتشبيهات الغريبة لكنها تظل لائقة للقراءة وليست فجةولنتعرف علي المزيد عن الرواية فلتأتي معي إلي لندنوحلقة جديدة من سلسلة المحقق كورموران سترايكأهلا بك في قضية بومبايكس موريقضية دودة القز*****************اﻷحداث----أهلا بك مرة أخري في 12 بار كافية، شارع دانمارك الشهير بمحلات اﻷدوات الموسيقية المتفرع من طريق توتنهامعذرا إن ضايقتك أعمال البناء في توتنهام، أنني أشعر وكأنها تحدث منذ اﻷزلاﻷن فلنصعد مبني 12 بار كافية بواجهته السوداء للدور الثاني ، لا تقلقك صوت خطوات قدميك علي السلم الحديدي الضيق الذي يحيطه القفص الحديدي لمصعد قديم معطلا منذ اﻷزل ، لن تزعج أحدا فلا أحد يسكن هنا، هناك مكتب جرافيك بالدور اﻷول ، مكتب المحقق كورموران بالدور الثاني و الدور العلوي لا يسكنه أحدا حالياتسألني كيف أعرف كل هذا عن المنطقة والمبني، ألم تأتي معي من قبل في العام الماضي ، للتحقيق مع كورموران سترايك ومساعدته الفاتنة روبين في أول قضية كبري له؟ لتنتقل فعليا إلي لندن وتلك الشوارع من خلال صفحات الرواية؟ إن لم تفعل يمكنك العودة للقضية اﻷولي لاحقا فمكتب سترايك مشغولا اﻷن بأحداث قضيتناوالتي تبدأ بزوجة مؤلف يعاني أهمال الوسط اﻷدبي له، تطلب من كورموران سترايك أن يحقق في أختفاء زوجها في غيابه المعتاد كلما أراد اﻷختلاء بنفسه لكتابة رواية مثلابالرغم من أن الموضوع معتادا إلا أنها قلقة علي حالته المزاحية وتريد أن تطمئن علي مكانهليكتشف سترايك أن للمؤلف مخطوطة رواية قام باﻷنتهاء منها، تصف بوحشية وسخرية كل المحيطين بحياة المؤلف من وكلاء أعمال، ناشر، مراجع، مؤلف منافس تحظي رواياته بالبيست سيللر، عشيقته وحتي زوجته وأبنته..كل هؤلاء برموز ومحاكاة ساخرة، قبيحة وفجةبعض ما تم ذكره بالرواية حتي قد يهدم أسر، يحطم معنويات وسمعة من تم ذكرهم بالروايةرواية دودة القزالمشكلة اﻷكبر ، فهي الطريقة الدموية البشعة التي سيجد سترايك عليها أوين المؤلف البائسألم أقل لك أنه عش دبابير بحقأما المشكلة اﻷضخم، أن تلك المخطوطة تسربت...وقراها الكثير من الوسط اﻷدبي بلندن ، ووصلت لأغلب من تم ذكرهم بتلك المحاكاة الساخرة الفجة وبالطبع لا أحد يريد شهودا عليها..وبعضهم ذوي نفوذ ويسعون للتخلص من أي ممن يملكون أي نسخة من تلك المخطوطةوعلي سترايك أن يسارع الزمن لمعرفة مرتكب الجريمة قبل أن يجد نفسه مهددا بالقتل هو أيضا\nاﻷسلوب الروائي--------أضمن لك الغموض واﻷثارة لدرجة ربما أعلي من الجزء السابقستجد نفسك تشك حتي في أن المؤلف أنتحر أو أن أبنته الصغيرة ذات اﻷحتياجات الخاصة هي من فعل ذلك في بعض اﻷوقاتستقرأ لغة الجسد لا أراديا وقت قراءة تحقيق سترايك للشخصيات المختلفة ، فتعرف من يشعر بالثقة، من شعر بالتوتر ومن يبدو أنه يخفي شيئا حتي قبل أن يتم ذكر ذلك بالرواية..فقط من خلال الوصفولكن حتي أخر وقت لن تدري من فعلها، كيف ولماذا ...كما قلت مسبقا ان هذا التشويق طابع مميز في أسلوب جي كي رولينجوكما الجزء السابق ستجد نفسك تعود للندن -إن كنت قرأت الجزء اﻷول- لتعيش الرواية نفسها ..بوصف تصويري للندن واﻷماكن بشكل رائعمن اﻷنتقادات بوكيابيديا أن أحدهم أنتقد إن لكونها أعتادت الوصف بالتفصيل الدقيق لعالم لم نراه من قبل في سلسلة هاري بوتر، عالم السحرة وهوجوارتس،فإنها هنا بالغت في وصف عالم نعرفه جيدا لنتخيله بنفسنا دون وصفها الدقيقهذا اﻷنتقاد جاء من أحد اﻷنجليز، والذي أراه متغطرسا بما يكفي لأعتقاد أن الرواية تطبع وتقرأ ببلده فحسب ، وأن باقي العالم عليه أن يكون زار وحفظ لندن ليتخيل الاماكن التي تدور بها الرواية بنفسهلم تكتفي رولينج هنا بوصف أماكن وبارات وشوارع جديدة بلندن بل أضافت أيضا لمحات من تاريخ بعض تلك اﻷماكن كسوق سميثفيلد الشهير بالمجازر الكبري وموردو اللحوموحتي الدقة في وصف البارات والمطاعم الكبري إن بحثت في صورها علي جوجل بعد القراءة ستجد رغما عنك أنك قد تخيلتها بالظبط كما في الصور الحقيقية أمامكأيضا الدقة والواقعية في مزج احداث الرواية بأحداث حقيقية ولو بتفصيل بسيط يجعل من تجربة الرواية لمحبي التفاصيل والمعايشة أمرا ممتعافمثلا أغلفة المجلات التي يراها سترايك في كشك الصحافة في ديسمبر 2010 تطابق اﻷغلفة الحقيقية بنفس الفترةوأعجبني التلميح بجزء الفجوة الغريبة بألمانيا والتي أتذكر عندما شاهدت صورتها منذ سنتين أو ثلاث ظننتها فوتوشوبهل لها علاقة بالمجتمع السحري؟ أعتقد أن هاري ووزارة السحر عليها التحقيق في ذلك\n ليس هذا فحسب، فإختفاء المؤلف أوين ذكرني كثيرا في البداية بأختفاء صحفي المصري بالاهرام رضا هلال والمكالمات الغريبة من عائلات الرئيس السابق ووزير الداخليةوايضا كل الاساليب في الهجوم الشاذ بين المؤلفين وبعضهم ذكرني بهجوم مؤلف منافي الرب علي الكتاب الشباب وبعض هجوم الشباب علي نبيل فاروق وغيره بشكل غير موضوعيبل وهجوم الكثير من المؤلفين لجي كي رولينج بمجرد صدور روايتها الاولي بعد هاري بوتر، منصب شاغر كل تلك اﻷنتقادات لبعض عيوب المجتمع اﻷدبي سواء اﻷنجليزي أو في العالم كله تقريبا، سيجعلك تتذكر ،إن كنت قرأت ريفيو الجزء اﻷول ، ذلك التعريف بالمؤلف روبرت جالبيرث بأنه ضابط تحقيقات خاصة سابق تابع للجيش اﻷنجليزي، وأنه ليس مؤلف من اﻷساس وإنما شخصية سترايك نابعة عن تجربته الخاصة كمحقق خاص ومن حوله من رفاقهذا التعريف تم حذفه بمجرد معرفة انها جي كي رولبنج بأسم مستعاروكالعادة تمزج رولينج اللغة القوية وتركيبات الجمل التي قد تكون مربكة لمن يقرأ لها لأول مرة من حيث الاستطراد الزائد -والذي بالمناسبة صرت أعشق استخدامه كثيرا- مما قد يجعلك تعيد قراءة الفقرة مرة أخري لتري الصورة كاملةالشخصيات------لا جديد عما تم ذكره بريفيو الجزء اﻷولكورموران سترايك و روبين ايلاكوتفقط ستتعرف علي المزيد عن حياتهم الشخصية وتطوراتها ...المزيد من عائلاتهما وأصدقائهماالعلاقة العملية والشخصية بينهما تتعقد أكثر وتصير أكثر جمالا مع أنها ليست قصة رومانسية، فروبين مازالت تستعد في اجراءات الزواج من ماثيو خطيبها من الجزء الأول، وسترايك مازال محطما من قصته مع شارلوتولكن الحكاية التي تجمعهما اكثر جاذبية من اي قصة أو جانب رومانسي قرأته بأي رواية أخريالجزء الذي كان به رحلة طويلة بين روبين وسترايك للتحقيق مع احد المشتبه بهم كان ممتعا ومثيرا حتي اخر لحظة ومحاولة اللحاق بالقطار، جزء قدم تطور للعلاقة بينهما بشكل أكثر من ممتازوكالجزء السابق...لن تعرف إلي ما قبل النهاية ما إذا كانت روبين ستستمر معنا للأجزاء التالية أم لا، وهو من أكثر الاجزاء تشويقا ليباقي شخصيات القضية فلكل منهم شخصية مفصلة ستتعرف عليها وشكوك ومفاجأت ستعرفها طوال تحقيقات سترايكربما كان عيبا للبعض ، بينما أراه معايشة أفضل، أنت تتابع حياة المحقق الخاص كورموران سترايك ومساعدته الحسناء روبينوفي هذه الرواية تتابع حياتهما خلال التحقيق في قضية أوين ، قضية دودة القز...وهذا معناه أنه بالرغم مم أن القضية البوليسية هي الحدث الرئيسي فإنك أيضا ستجد بعض السطور والصفحات عن قضايا وعملاء أخرين يحقق عنهم سترايك لا علاقة لهم بالقضية اﻷساسيةبالرغم من أن الجزء السابق قد تم الاستعانة بقضية فرعية ليتم استخدامها كطعم للقضية اﻷساسية ، فهنا اﻷمر منفصلهذا من وجهة نظري يجعلك تشعر أنك تعيش مع الأبطال طوال فترة الثلاث أو أربع أسابيع هي فترة قضية إختفاء أوينالنهاية---هي سلسلة قد لا نمل منها بحق طالما الشخصيات بهذا العمق وتشعر أنها قريبة لقلبك منذ البداية، والقصة دائما بهذه القوةهذا الجزء زادت نسية اﻷثارة والتشويق به عن الجزء الماضي ، بل وبقراءة فصلين من الجزء الثالث أري أنه سيكون اكثر قوة ايضاربما هو عشق لاسلوب رولينج ، بالرغم من دمويته بهذا الجزء التي تليق بمؤلفي روايات الرعب والاثارة كستيفين كينج ، ربما للقصة الجميلة بين سترايك وروبين بالرغم من تعقيد العلاقة بينهمايجب أن تجربها إن كنت تعشق الروايات البوليسية ، ولا تمانع بعض -أو الكثير- من الاستطراداتمحمد العربيالريفيو الانجليزي The drawings of 1st photo of Robin and Stike's source The drawings of 2nd photo of Robin and Stike's source (view spoiler)[The 2 Chapter sample reviewWelcome back to 12 Bar Cafe.. to Cormoran Strike's.Welcome back to a London life experience..Can't describe how exciting was these first 2 chapter since I really loved Cormoran Strike's first novel.Here's the same.. I felt I'm actually in London, by dawn's early light in the perfectly described Smithfield Market..It's not only describing the places, in a way that makes you'd wish to visit, BUT also a glimpse of its history ,as you'd read at these only just 2 chapters... Also you'd feel \"even for 12 pages sample\" that you become actually Being Strike..to think as his mind, to see what he sees..I adore the writing style of J.K.Rowling Robert Galbraith... although it's really a bit difficult to me, too much describes and 'classic' language mixed with new expressions ...But it always worth the long hours read with the clever plot...And this time it's really way easier since at the first novel was introduction and setting the basis of the character, so this time it's easier to get into them and think like them..I love Strike...I still see him as \"Hugh Jackman\" :), or sometime \"Robert Downey Jr.\" with some hair style to match Strike's.. also was glad to meet Robin back by the end of this sample.And the Plot \"from the description of the book two\" seems even more interesting this time..-I mean if I even don't know it's Rowling's book, I'd love to read it for this plot-So, Those who, like me, can't wait...here's first 2 chapter from the author's page :)..I've ordered the book ,But for sorry I'll delay reading it till next month \"Aug.2014\" because of Ramadan..Till then..I wish to see some spoiler free reviews :)PS: check my illustrated Book One's Review Mohammed Arabey22nd June 2014 (hide spoiler)]"}, {"Review": "The Silkworm is the tenth J.K. Rowling novel I’ve read. I believe that after ten often gargantuan novels I can make fairly accurate generalizations about her writing. And it saddens me to say that she keeps making the same mistakes.Most glaring is her treatment of female characters. In the Cormoran Strike mystery series, we have another female character of much greater intrigue shunted to the side in favor of a male protagonist, aka Hermione Granger Syndrome. Robin is Strike’s young personal assistant who could definitely contribute to mystery solving but mostly answers phones, schedules appointments, makes coffee, and provokes male gazing. The thing is, Robin is much more fascinating to me than Strike! Robin is desperate, unsure, diffident but ambitious—she would have been a fabulous heroine for a detective series about a woman trying to break into a traditionally male profession. Strike, on the other hand, does not interest me as a protagonist: he’s arrogant and infallible (sorta reminds you of a character whose name rhymes with Barry Lotter, non?), meaning that whenever Strike eliminates a suspect from contention, I know him to be absolutely right, simply because J.K. Rowling writes Strike in a way that he is always right. For all of Rowling’s characterization skills, Strike is lacking. He has a cool backstory—missing leg, missing rockstar father—but none of it manifests itself in his psyche or quotidian actions. They are just things we know about him; like, oh hey, that’s Cormoran Strike, he lost his leg in Afghanistan and his dad is a famous guitarist. In general, I find J.K. Rowling’s characterization maddeningly brilliant. She’s super into the physicality of her characters. In The Silkworm the first few chapters serve no other purpose than to introduce the story’s players. But we are told who these people are, with special emphasis on their attractiveness and one-word descriptors: he’s the ambitious one and she’s the daffy one. Rowling is an expert at character portraits but you can only know the characters on her unique terms; there’s no room for personal interpretation. It’s as if she is this master dollmaker. Each character is impeccably painted, you can admire the surface details for hours, but if you cracked the dolls open, they’d be hollow. Nothing murks beneath the detailed yet limited picture Rowling has painted us. And yet, she’s a magnificent plotter, a skill really well-suited to the mystery genre which gives me hope for any subsequent installments (though I will perpetually groan about Strike’s usurpation of the protagonist role in lieu of Robin). She carefully charts her reveals and includes tons of clever but useless information to throw you off. I’m not the biggest fan of how she writes climaxes—this isn’t participatory mystery where you can solve alongside the detective; you must wait for Mind-Numbingly Boring Detective Genius Cormoran Strike to figure it out and share his conclusions with you—but the underlying plot structure is solid. I’d just love to see her combine this knack for plot with deepened characters and themes. Otherwise, it’s forgettable. "}, {"Review": "4.5* When I finished The Silkworm two weeks ago I was planning to give it 4* for reasons that I will discuss later. I decided to upgrade my rating when I went to visit my mum and I saw the novel on the nightstand, halfway read. “It’s really good, isn’t it”, I asked her with excitement in my voice. I realized then that I enjoyed this more than I did other mysteries so why not give it full recognition. J.K. Rowling (also known as Robert Galbraith) can do no wrong. She is a brilliant story teller and manages to fully immerse me in the world she creates, no matter if it is magical or “real”. Obviously, I was immediately drawn by the mystery of this novel as it deals with the literary world. Yes, most of the characters are either writers or editors, how can I not be excited? Add a remarkably twisty and dark plot to this mix. Also, we cannot forget the secret ingredient, Strike and Robin. I love both characters and I was enthralled to see how their relationship developed. I particularly enjoyed that the book was half mystery and half the life of the two characters.You might wonder why I did not want to give it the maximum rating from the start. Well, I had problems with ending. Just as the previous installment, it was a bit underwhelming and it was over too fast. It wasn’t the wow moment that I was expecting. I hope she will work a bit more on the endings as she almost ruined Harry Potter for me with the over the years recap. I can’t wait to read Career of Evil. Good for me that I gifted the book to my mum for Christmas. ;) "}, {"Review": "I love a good detective story and Galbraith really delivered on this one. Either she is a master of the red herring or I am an incurably gullible old sod because I was firmly convinced I knew who it was for two thirds of the book, only to have it turn out to be someone I never even considered suspecting. There were several twists that were surprising and intriguing. She plays with the concept of the manor house mystery by staging a convenient party for all of the suspects to attend where the detective Strike calls out his murderer from the herd. The relationship between Strike and his girl-Friday/Watson/Hastings/Bunter character Robin was fun to get a closer, more complex glimpse of in this second installment of the series. It's my understanding that when Galbraith was unmasked as Rowling this particular novel had already been submitted to the publisher and was in the process of being edited, so I don't know if that experience has soured her on continuing the series, but I sincerely hope that it has not as I hope for many returns of these characters. I hope to see more of Strike's estranged paternal family and to learn more about his childhood. I also look forward to seeing more of how Robin's work affects her relationship with Matthew, her fiancée. All in all I think we can safely say that Rowling has found herself a new niche. Even if she publishes other work unrelated to this series (and I hope she does) I hope she plans to return to the surly detective soon."}, {"Review": "The Silkworm (Cormoran Strike #2), Robert Galbraith (Pseudonym), J.K. RowlingThe Silkworm is a 2014 crime fiction novel by J. K. Rowling, published under the pseudonym Robert Galbraith. It is the second novel in the Cormoran Strike series of detective novels and was followed by Career of Evil in 2015. Several months after solving the Lula Landry case and seeing a sharp improvement in business, Cormoran Strike is tasked by Leonora Quine with locating her novelist husband Owen. Owen, a former literary genius whose attempts to recreate his past success have failed, disappeared around the same time his latest book, Bombyx Mori, was leaked to London's literary community. ...تاریخ نخستین خوانش: نوزدهم جولای سال 2015 میلادیعنوان: کرم ابریشم کتاب دوم؛ نوشته: رابت گالبریت؛ جی.کی. رولینگ؛ مترجم: ویدا اسلامیه؛ تهران، تندیس، 1394؛ در 805 ص؛ شابک: 9786001821769؛ موضوع: داستانهای نوجوانان از نویسندگان انگلیسی قرن 21 مکتاب نخست این اثر آوای فاخته است؛ آوای فاخته عنوان کتابی جنایی، به قلم: جی. کی. رولینگ است، که در ابتدا تحت نام مستعار و گم‌نامِ: رابرت گالبریث؛ در آوریل 2013 میلادی به چاپ رسید. آوای فاخته نخستین رمان از مجموعه داستان‌های جنایی: «کورمورن استرایک» است که به گفتهٔ نویسنده، بیش از هفت جلد خواهد داشت. موضوع رمان دربارهٔ: «کورمورن استرایک»؛ کهنه‌ سرباز زخم‌ خورده در جنگ افغانستان است، که به عنوان کارآگاه خصوصی، درگیر پروندهٔ خودکشی یک مانکن شده است. کرم ابریشم، کتاب دوم از مجموعه است؛ که در سال 2014 میلادی منتشر شد؛ ادامه ی رمان آوای فاخته است. ا. شربیانی"}, {"Review": "Find all of my reviews at: http://52bookminimum.blogspot.com/I read this book MONTHS ago and never got around to writing a review . . . \nThanks for the reminder. Now that all of my friends are reading/have already read Book #3 I figured it was time to get off my butt.The Silkworm is the follow up to “Robert Galbraith’s” bestseller The Cuckoo’s Calling. The difference this time around is everyone knows the author is really J.K. Rowling. The leading male, Cormoran Strike, is a little different too. Rather than getting by on a wish and a prayer that he’ll be able to pay the bills on time, Strike has more clients than he can handle and . . . \nWhen novelist Owen Quine’s wife contacts Strike, he thinks there isn’t much to the mystery but decides to take the case purely for curiosity’s sake. Once Strike starts digging in to the potential whereabouts of the missing author he discovers an unpublished “fictional” tell-all that dishes so much even Kitty Kelley would cringe has been written and that the author is most definitely not missing at all . . . . \nWe also get a bit of a sidestory with Robin, who although hired as a receptionist is ready to start proving she’s capable of so much more and is getting just a wee bit ticked at Strike for underutilizing her . . . .\nLucky for Robin she’s woman enough to speak up for herself rather than simply filling out one of Shelby’s trademarked “Butthurt Forms” and that this mystery becomes big enough her help is needed.And that’s that. I can’t tell you if you’ll like this book or not. Just because you loved (or hated) Harry Potter doesn’t mean you’ll love (or hate) this because they are sooooooo not the same type of book. And just because you loooooooove mysteries doesn’t necessarily mean you’ll love this one because it doesn’t follow the formula of most bestselling mystery books today. There aren’t a lot of twists in the road, or shock and awe, and there are LOTS of pages. But I found the pages to be filled with nearly 100% good stuff. The only thing I’m not on board with is the potential developing relationship between Strike and Robin. Dear J.K. Rowling . . . \nPlease don’t. I’m begging. You’re better than that.Don’t want to take my word on this one? I don’t blame you. Go check out Ashley the Hufflepuff Kitten or Mairéad (is exploring a floating city) or Steve or Stephanie or Becky or Casey or Stepheny’s reviews (or thousands of others) instead . . . \nThe folks who don’t make the “lists” every week are most definitely better reviewers than most who do (and they won’t ever bog your feed down bumping 50 reviews at a clip in order to fulfill some bizarro high school fantasy of being “popular”). I’d like to throw in a dissenting opinion, but seriously were NONE from my friends. Ron 2.0, you should read this so you can tell us all we’re wrong ; )"}, {"Review": "Reading J.K. Rowling’s writing for adult audiences reminds me irresistibly of bumping into grade-school teachers on the street. There’s the obvious comparison, of course, which is not having to pretend that sex and crass language don’t exist anymore, realizing your former educator is an actual human being, an experience, for some, that can feel surreal. If you’re really lucky, of course, you make friends with your old teacher, have coffee together. You start to view them complexly. Now that you’ve made it to the other side you realize that you quite like the aging pedagogue’s sense of humor. They’ve got depth to them. And I think that’s a better mindset to have then others seem to, which, from the much more lauding critic’s perspective is that Rowling is “evolving” as a writer, and to the distaste of fans, that she’s “changing.” Not really. I think that she’s always been like this, not that she’s always demonstrated the other shades of her as a writer with Harry Potter, just as a grade school teacher wouldn't as a person—she’s an author with a taste for wry, satiric overtones, dark humor, twists on classic styles, and a nasty predilection for writing about bad people, very bad people. And that’s not such a terrible thing, because this book has got one or two good people that keep you turning pages. Rowling is an author with a masterful command of pathos, for drawing people in, her antihero just heroic enough and her mystery just traditional enough to hook readers, who are then subjected to creative and occasionally inspired workings of her mind. A lot of people don’t like the style of this “new Rowling,” and I can get why. But I feel fortunate to be among those who genuinely do. Her writing is incredibly cozy—a lot of complaints are towards her prose, which is definitely wordy. But it’s fun to get lost in, in the same way a Dickens novel is. It’s very bookish; her writing reminds me why I love reading. But it’s Dickens for a contemporary audience, which is actually a lot better in practice than it sounds in theory. Her style is Dickensian, alright, and utterly literary, but it’s edged subtly with a very black, very frank sense of humor. In the hands of a less-apt writer it would come off as circumlocutory; but Rowling knows her syntax and revels in every turn of phrase, the result being really satisfying to delve into. Her satiric flair is really highlighted by her writing style—her descriptions of people are deliciously fun to read, because like I said, under the eye of Rowling, no type of person is safe from her critical and observing eye. And that gets us into the plot of this model—murder. Murder you'll find in any mystery, the screen versions much sexier, but harking back to the classic mystery novel from the days of Christie and Poirot, Rowling weaves a story that goes above and beyond the conventions of the genre. The mystery is not only meaty, twisty, and complex, but it’s also as strong a satire as it is a work of detective fiction. One of the things I talked about in my review of The Cuckoo’s Calling was just how much I enjoyed the socioeconomic backdrop of the book; the contrast between the exploration of high society as well as that of the impoverished class, the homeless, the destitute, and the not-so-glamorous. The dynamics explored were a lot similar to the ones in The Casual Vacancy, which wasn’t as successful, and that made me nervous as I wondered if it would be the same in her follow-up. It wasn’t—isn’t. And it’s a lot better than I could have hoped. Rowling knows what it’s like to be poor, and what it’s like to be rich and among socialites and Hollywood big-shots, but she also knows quite a bit about the colorful characters of the publishing industry. This isn’t an area that’s explored that much, either because existing writers lack the skill to do so, or considering the irony of the industry that’s publishing it, the bravery, but Rowling is Rowling for God’s sake and does so not only fearlessly but with aplomb. The thing that I can see this series being known for in the future—well, the other thing, is the fact that it’s characterized by such a deep exploration of different worlds, this one of publishing. One writing skill that Rowling doesn’t get to show off much is her one for world-building, but her argument is, apparently, why need to? Since reality holds such delectably vicious worlds for her to unmask. And some of the characters here play with that adjective a lot. The archetypes, such as those of agent—played here by the cold and chain-smoking Elizabeth Tassel—are interesting, but even more fascinating is that of writer.This book earns itself a lot of positive praise—exceptional, fun, witty, dark—but I’m reserving “brilliant” in the area where the book really deserves it, and that’s in Rowling’s commentary on what it’s like to be a writer. The writers in this book are self-absorbed, egotistical, prone to dramatics but not so much decent writing. Rowling really has fun in her dissection of these different caricatures of what could only be people from personal experience. Bombyx Mori is the title of Owen Quine’s unpublished last book—the victim of the novel’s central murder—and the end death scene mirrors his own grisly killing. Quine himself thinks more of his writing than his sales (or reviews) warrant, and is overly fond of symbols. I found Michael Fancourt to be the novel's most enjoyable character to read about, perhaps due to the fact that he represents the “famous writer,” something Rowling undoubtedly knows a lot about being. It could be said that he’s her alter-ego, in regards to his thoughts on being famous and criticisms, status and writing; if anything, he was a great conduit for some of Rowling’s more nasty, more clever, thought processes. I found one character’s commentary on his work (“Fancourt can't write women…he tries but he can't do it. His women are all temper, tits and tampons.”) to be an amusing jab at male writers trying to write from female perspectives. Rowling has no trouble being in the flipped situation; Cormoran Strike is such a fully-realized protagonist that I think she could have hid under the guise of Robert Galbraith had she pleased. Rowling isn’t particularly nice to these different types of writers that we encounter. Any character unfortunate enough to stick around for more than a page or two can’t dodge her scrutinizing gaze, Rowling’s sharp and entertaining irreverence. I’m going to reiterate another thing that I brought up in my review of this novel’s predecessor, which is that we’re not meant to like these characters, Cormoran and Robin being the exceptions. The thrill of Harry Potter is loving the characters as much as the world, but that’s not on Rowling’s—or at least Galbraith’s—agenda. Rowling makes some challenges to the publishing industry at large as well, ones that I think are pretty relevant, most notably that of the lack of respectable representation in modern lit. Why don’t we see more transgendered characters, for one? Why don’t we see any transgendered characters? Rowling loves to inundate her work with a look at the various trappings of human morality, going deeper here, one surprisingly contemplative chapter catching onto a thread left by the last book, Strike dealing with the aftermath of an unhealthy relationship, which was well-explored there and can occasionally grow wearing here. It builds on the revelations of the other characters (Strike recalls what Fancourt touts earlier in the book, that “love is a mirage, a chimera”), mulling on the toll that love takes on identity in a surprisingly bleak and thoughtful manner. Rowling is a writer with the observational skills and the prowess to toy with the reader’s emotion in whatever way she wishes; but she’s a plot-driven writer, and from the way she sees it, writing is a lot more than attaching your readers to your books by a mere manipulation of pathos—that’s the skill set of a much less artful writer. And while it’s a rule of thumb that you should never have to explain your work, Rowling almost does just that here. \"Bombyx Mori\" literally translates to “the silkworm,” whose silk, the book points out, isn’t retrieved by the web-spinning some lovingly and falsely misconceive into public knowledge. Silkworms are boiled. It’s meant to be a metaphor for the plight of the writer, that they must go through great pain and suffering before something beautiful can be produced. It’s a hell of a metaphor; Rowling goes beyond that and studies what’s wrong about modern writers (“with the invention of the Internet, any subliterate cretin can be Michiko Kakutani”)—suggesting these flaws can seem like a conceited thing to do, but when you’re as so obviously not-subliterate as Rowling is, it’s legitimized. Especially when it’s as entertainingly done as it is here. And it really emphasizes what a phenomenal writer she is. Rowling really immerses herself in the craft of writing—she doesn’t just spit away unbridled passion onto a page. She takes her love of the medium and creates a well-made novel. This one in particular really emphasizes what a phenomenal writer she is. Three-dimensional characters, flawless prose, on-the-nose genre details, and a thought-provoking question here or there. It’s highbrow and it’s not highbrow. It’d be an insult to call her a mix of Dickens and King, as she’s so sincerely Rowling. Or Galbraith. This name-game is growing tiring. Working for the highbrow side of things is the incorporation of Latin phrases and verse, quotes from classical plays and stories that remind us that modern tragedy is only modern because it occurs in the present, and that’s the sort of perspective that to some degree makes Rowling feel like the time-travelling author. Then, working for the not-so-highbrow (and perhaps I only note the distinction because this book is as satisfying as a guilty pleasure) is the riotous humor, contrasted so starkly by the black and tongue-in-cheek. Rowling knows how to keep us turning pages as well—there’s not a dull moment in the book. I mentioned “cozy,” meaning that the reader is given a chance to relish the novel unfolding before them, and that’s a difference that I can’t emphasize enough, which a more novice writer would have trouble not making dull or slow. These pauses are varied by hands-clamped-to-seat-edge-level moments (who knew that Rowling could write car chases? I mean, swap car for broomstick and you’ve got your answer). Filling the pauses is the sweet, growing relationship between Strike and Robin. This isn’t a stilted relationship, the biggest flaw of the episodic novel. It grows professionally, it grows in terms of their friendship, and it’s compelling. It’s funny. It’s not overtly complex, but it’s a welcome relief from the cast of unlikeable characters that permeate the rest of the book. There are twists, there are turns, and there will be vocalized gasps—with a mystery as layered as this one, the seasoned mystery reader may be able to guess some developments, but Rowling is killer with a red-herring and you’ll doubtlessly emerge from the pages with your brain tried and tested. It’s a genuinely good mystery that plays with social dynamics adroitly. Say what you will about Rowling’s writing, I can’t imagine someone giving up in this book without dying to know what happens. Personally, I prefer the big reveal at the end of Cuckoo’s Calling a bit more, but there was more high concept there, as well as camouflage. But that doesn’t detract from the thrill of the way events unfold here. This, this is the kind of book that reminds me why I love reading. It’s not fervor-inducing, the type of literary fire that creates by-the-billions fanbases. J.K. Rowling showed me, long ago, the astronomical limit to which a person could love a book, and with this, she’s reminded me why I love doing it more than anything else, with a warm, curl-up by the fire kind of read. In a culture that has recently been swept up in a visual mania, as evidenced by the recent Golden Age in television, this is a phenomenal reminder of why books do a better job of getting us to escape than any other medium, to get us to empathize, to get us to think—when they’re done well of course. My hope is that Rowling keeps showing me again and again why I love to read (and I’ll be here, waiting for the assuredly good third Cormoran Strike novel), and if the day should ever come that she realizes that she misses her wand and broomstick, or anything in the fantasy world at all, I don’t think I’ll be the only one highly anticipating the reminder."}, {"Review": "I remember being in a trance after reading the first book in the series. And now I am again at the same emotional state. I don't know what makes J.K. Rowling's books so charming to the eye and mind but when you start a book of hers you get lost in it. The main characters, Cormoran and Robin, they're both incredibly well-structured. I'd also like to add that there's quite a lot of character development, something rarely seen in detective novels, or at least that's my opinion. Cormoran weans off Charlotte while Robin stands up for what she likes to do.The first one was about a model supposedly commiting suicide, although it turned out, her dropping off the balcony was far from a suicide. What I liked about this one, was that it strayed off the formula of the first book. This one was a bit more risky and macabre, guts out and kept in a fridge and all (you'll understand if you read the book). This one is about an author gone missing. I think we all suspect that this writer is not missing, but rather dead. There is a book involved, which that author wrote and after having his agent pass some of them along to superiors, he disappeared mysteriously. Cormoran is then approached by his wife to find him. And so the search begins. What's most interesting though, isn't the fact that he is found dead, but who and why and how the author came to be murdered in such a manner. Highly addictive, and mezmerizing to the last word, J.K. Rowling proves once again why she's so famous. It's a page-turner, even more so fhan the first."}, {"Review": "Re-read February 2018: Okay, so now having finished my first re-read of this book, I am so tempted to up the rating to five stars. A large portion of that desire comes from listening to the audio this time around. There’s something really satisfying about Robert Glenister’s voice narrating this story; it most definitely increased my enjoyment.Another part is that this just feels like the ideal murder mystery to me right now. It was exactly what I was craving, plus some. I love all the clues and red herrings (and spotting them all this time was so much fun now that I knew what I was looking for); I love the atmosphere; I love the denouement (everybody who loves murder mysteries loves a good denouement). But I also love the characters here. And the little extra oomph you get when your book ties together thematically. (I was particularly impressed this time around with the ways that Robin/Matthew, Strike/Charlotte, and Leonora/Quine paralleled each other.)I’m really having to hold myself back from downloading the third audiobook and just going to town on it, but that would be dumb, because I would then have even longer to wait for book four, which is apparently going to be the longest in the series. I’m still crossing my fingers for a late 2018 release date. Lethal White: November 2018. Make it happen, universe!I’m sure there will be even more whinging on this topic when I do finally allow myself to re-read Career of Evil and experience that cliffhanger all over again.This is a terrible review.See my original below if you want something better. My thoughts still stand! Though, actually, reading it again, the book seems to have defeated me then as well. Will I ever be able to write a cogent review of this book? Shrug.[4.5 stars]Update 7/29/2014: Ugh, this is going to be one of those reviews where I just flounder for things to say because a) I waited too long to write it, and b) I can’t really sum up my feelings into precise words.The short of it: I really, really, really liked this book. I still don’t quite LOVE it, but I’m allllmost there. A couple more books should do the trick. (In fact, I did like it better than The Cuckoo’s Calling, although at certain points it was much more uncomfortable for me to read.) So, no pressure, book three. No pressure.So in the last one, Strike and his new assistant Robin end up investigating the death of the famous supermodel Lula Landry (aka “Cuckoo”), but in this one instead of models, it’s writers. Strike–fresh off his notable capture of Lula’s murderer–is very in demand as a a P.I., so it’s him that the wife of missing author Owen Quine comes to in order to locate her husband (who she believes has just gone off to some writer’s retreat and forgotten to tell her where it is or when he’ll be back). Turns out, yep, he’s dead, and not only that, but he was murdered in a pretty horrible fashion, exactly recreating a scene from his own unpublished book, Bombyx Mori. Only, Bombyx Mori (the latin name for the silkworm) is basically the most infamous unpublished book in London right now, owing to its being a very, very thinly veiled representation of basically everyone in London’s literary scene, agents, publishers, editors, and authors alike. None of it is flattering, to say the least, and most of it is at turns horrifying, gruesome, gut-churning, and purposefully offensive (all couched in metaphor and allegory, of course).So that’s the mystery. Being inherently more interested in authors and publishing than I am in models and such, the mystery in this one definitely grabbed me more than in Cuckoo, but Robin and Strike continue to be the real draw for me in this series. (I also continue to fancast them in my head as a chubbier, more hirsute Richard Armitage, and Jenna Louise Coleman.)Visuals:So yes: Robin and Strike. I’m very much into that. Not necessarily shipping it, although I wouldn’t be against that pairing in the future, but these two as a professional partnership are just really fun to read about. Especially since Rowling (as Galbraith) confronts head on Robin’s feelings that Strike is marginalizing her at work. I was a bit worried about a third of the way through that she was going to fall into the trap of having a conflict grow between them that could have easily been solved by communication (my least favorite type of conflict), but I shouldn’t have worried. They handle it all professionally, and both characters come away from the book having taken really satisfying leaps of growth. (I’m still holding out hope that Robin will dump that fiance of hers, but at least he’s now not being such a huge asshole about everything. Honestly, one of the main reasons I just can’t bring myself to give this that extra half a star is that I want more Robin in these books. I know Strike is the main character, but I really feel like Robin should have equal amounts of POV-time. Maybe now that she’s taking more of an active role in the business we’ll get more POV from her. More Robin, Jo! Do you hear me? (I suppose she could do worse than have Strike as her main character, though. He’s persistent and smart and he has issues that aren’t easily resolved.)Anyway, like I said at the beginning, I was feeling a bit weird when I was 1/3 of the way through. The thing with Robin and Strike was making me feel upset, and the excerpts of Bombyx Mori that we hear about and read for ourselves are, frankly, disturbing as fuck, but I pushed through and both things were addressed by the end. More importantly, the reason behind them being there in the first place was made pretty clear (won’t explain–sorry, spoilers). There was just a bunch of good stuff packed in this book, and I’d have to read it multiple more times to probably get it all, just stuff about her skewering the publishing industry and certain kinds of writers, which is also wrapped up in some sly commentary about the ways women deal with working in traditionally male fields (surely she has drawn on personal experience here, on both counts). Her love for underdogs and disadvantaged people is also very much present. And her dead man, Owen Quine, could very easily have been portrayed one-note, but he ends up being a rather complex figure. Anyway, the storytelling of this book just sucked me the hell in. I spent the whole day reading, curled up on my couch with hot tea, listening to the monsoon. And it was very memorable and wonderful. This is most definitely a book-reader’s book–it will give you the experience, not just the story.Again, hesitant to give this the full five stars, but can easily see myself doing so on a re-read. I hope she’s able to get book three out by summer next year. I was all trained to wait several years (at least) between Rowling books, but now she’s given me three in two years and my expectations have been adjusted. I now expect books yearly and shall be sorely disappointed if things turn out otherwise.[4.5 stars]July 2013: I only have to wait a year for a new Rowling book? What is this devilry?"}, {"Review": "Sjećam se kad je izašao Zov kukavice da se HP čeljad masovno dala u pljuvanje knjige, a Rowlingovoj su smjesta pripisali trenutnu književnu smrt. Moram priznati da je i mene iznenadila činjenicom da je odlučila napisati krimić ali baš zbog toga mi je još više porasla u očima, jer malo je danas pisaca koji se usude probati nešto drugo; obično ogromna većina ostaje vjerna žanru kojim su se proslavili. Jako mi drago da J.K ne spada u tu grupu, nego da i dalje radi na sebi i istražuje svoj talent.Ovoga puta Cormoran i njegova asistentica Robin istražuju nestanak kontroverznog pisca. Roman pisan u maniri onih starih krimića, radnja je užasno sporaaaa ali slojevita i puno zanimljivija od prethodnika stoga svi vi koji očekujete neke velike preokrete i iznenađenja u ovom romanu toga nema.Nije zgorega napomenuti da je J.K iskoristila priliku da preko romana popljuje današnju nakladničku industriju i sve ono u što se ona pretvorila.Nisam impresionirana, ali sve u svemu dobar krimić!"}, {"Review": "An author decides to put out a tell all book bashing some of his fellow authors and even some of the women in his life. His wife then contacts my lovely Strike to help her find him. I'd have left his arse gone but what do I know? Strike ends up finding his dead body and decides to stay on the case.I love Strike and Robin. This team is just so much fun to read about. I keep wanting them to hook up but then I don't want them to either. I remember that ruined several other great relationships and I don't want that. I wouldn't mind Robin kicking her whiny boyfriends bum though."}, {"Review": "Cormoran Strike's business is now better than afloat following his last high-profile case. When the wife of a missing writer asks for his help to find him, Strike opts to take the case even though he probably won't get a fee from the seemingly down and out woman. What appears to be a cut-and-dried investigation turns into something much more.I enjoyed this so much I hated seeing it end. There's nothing ordinary about the writing, the story slowly unfolding while expertly crafting vivid characters and setting, creating a strong sense of place. The literary epigraphs preceding each chapter add to the quality of the prose, combining the classics with contemporary. The case is highly interesting, sometimes horrific and at others, simply intriguing. We learn so much more about Strike and Robin, too; what drives them and where that comes from. The narrator was just perfect, providing distinctive voice to the words and characters. I read the first book but am hooked on the audio version from here on out. I love these stories and this one had a fine ending. But, the journey to get there was just wonderful."}, {"Review": "Genuinely liked this book even more than the Cuckoo's Calling, which is saying something. Loved the initial dive into the main character's personal lives, loved the central mystery in this one, and honestly can't wait to keep reading this series. I am so pleasantly surprised and can't believe I waited this long to read them.Joe and I have been listening to these books together on our commute and it's been the perfect series for both of us to enjoy, and puzzle around who we think is behind the murders. It's been a great time. :)"}, {"Review": "I enjoyed this more that The Cuckoo's Calling. I think that Galbraith/Rowling is getting better at this type of writing. I remember reading somewhere that it was easy to tell that it was Rowling because her style came through - but I cannot see any similarities between this and Harry Potter at all.I will say, though, that the first two Strike books use a similar formula. All the players are laid out at the beginning and then Strike goes through meeting with each of them throughout the book. In each, there was one main character that keeps coming up that he does not end up talking to until the very end - good way to keep us interested! I think with The Silkworm, the process of Strike's interrogations was way better integrated with the action of the story. With Cuckoo's, it just felt like a series of interviews (i.e. Now Strike goes here to talk to someone, then he goes here to talk to someone else, etc.)."}, {"Review": "Good slow mystery is probably my favorite thing to read. The author knows about the publishing industry. Any famous author most know about it, the good, the bad and the ugly. And oh my God this story was an ugly succeed. The book is not your normal mystery novel. It has no action at all, tons of dialogs and inner thoughts, but I love these characters with their positive and negative attitudes. Plotting and creating not perfect personalities are some of the strongest virtues of this author and we know that. Solid mystery, interesting plot, sick murderer. Yes, this novel is a succeed for me. Una mente retorcida detrás de un sádico crimen. Te interesa?\n\n“La ficción abarca terrenos poco definidos. Si cuentas la verdad de forma grotesca…no podría ser literalmente cierto.”\n\nEn esta segunda parte de la serie de Cormoran Strike, el detective ha estado teniendo más suerte con su agencia. Tiene más clientes, desgraciadamente todos son ricos intentando destapar a su esposo/esposa en infidelidades. Así que, cuando un caso con profundidad surge, lo toma sin dudar. Y nos adentramos en el mundo de las editoriales, publicidad literaria, escritores y critica. Un mundo que luce mucho más grotesco y oscuro de lo que una amante de la lectura quiere admitir. Y este libro toca todos los trasfondos de lo anteriormente mencionado: Escritores buenos y famosos, escritores malos y famosos, escritores malos y olvidados, intento de escritores, agentes arruinados, chisme literario. En fin egoísmo y vanidad de una forma tan asquerosa que solo un medio tan grande como el de la publicación de libros puede tener. \n\n“Los escritores son así. Unos chiflados”\n\nEl misterio dentro de ese ambiente es buenísimo debido a los personajes tan diferentes y con tantos secretos escondidos, al final encontrar a un asesino es solo una de las muchas cosas que descubrirás conforme avanza la trama. La autora no se toco el corazón con ciertos detalles grotescos e imágenes inquietantes tan bien escritas. Y hablando de la trama, es necesario decir que es bastante lenta. Aunque yo adore ese ritmo que te sumerge despacio en su historia. Son muchas conversaciones en restaurantes, etc. Mucho dialogo entre personajes e interno. Pero gracias a eso es que tenemos unos personajes perfectamente bien caracterizados. Todos los grandes sospechosos, el gran autor Michael Fancourt, el dueño de la editorial Daniel Chard, el editor Jerry Waldgreve, la agente Liz Tassel y la esposa Leonora Quine son mas de lo que se ve a superficie y como alguien que adora ver psicología en personajes, descubrir todas sus capas fue toda una aventura. Y mezclado con un buen misterio tenemos a nuestros protagonistas: Strike y Robin. Ambos con una vida fuera de la agencia que hace que obtengamos una novela más completa. Lo que mas me gusta es el atrevimiento de su creador a dejar ver sus partes más feas en su personalidad de vez en cuando. Sus errores y pensamientos más egoístas, eso me gusta porque odio que me den protagonistas perfectos. Así que, a pesar de no ser los perfectos seres humanos, son grandes personajes con la intención de llegar a la verdad. Robin en especial va tomando más y mas protagónico conforme avanza la trama y me gusto mucho ese crecimiento gradual que hemos tenido desde el primer libro. Creo que mi parte favorita fue cuando te cuentan de que va el libro Bombyx Mori. Decir que es grotesco es poco. \n\n“De la maraña de pruebas inconexas empezaba a surgir una imagen clara, una imagen descarnada y aterradora: la de una mente calculadora y brillante, pero tremendamente trastornada, dominada por la obsesion, la ira y la violencia.”\n\nMuy recomendado, si te gusta el misterio que no tiene sentido hasta el final cuando todas las piezas encajan. Para lectores con paciencia y gusto por el género. No te lo recomiendo si te gusta o andas de humor para algo con mucha acción o con una trama sin respiros. Otra gran obra de una de las actuales maestras del plotting. (view spoiler)[Yo estaba tan segura de que había sido Jerry, y en un momento pensé que fuera Chard pero LIZ? Nunca. Y era tan obvio. La tos, el ácido. Pero como fumaba, se me fue ese detalle, tenia todo el equipo de protección menos algo para la cara, QUE ESTUPIDA SOY, soy química y se me fue justo ese pinche detalle! DAMN! XDXDXDLo de Fancout siendo estéril, no me lo esperaba, si pensé que JOJO era su hija.Al terminar el libro recordé la frase que tuvimos antes “Las mujeres cuando se tuercen, se tuercen de verdad.” Me gusto la razón por la cual Liz lo asesino, soy una fiel creyente de que muchos años viviendo una vida que no quieres y sin conseguir lo que quieres puede trastornar a cualquiera. Sobretodo a alguien en un mundo tan asqueroso como pintan el de las editoriales en este libro.  (hide spoiler)]Creo Que esto de los detectives me gusta mucho así que ya va siendo hora que me deje de hacer la pendeja y me compre algo de Sherlock Holmes. (mi lista de libros por comprar en la Feria del Libro es tan larga que me urge sacarme la lotería) #sadstory D:"}, {"Review": "Update 21/09/14: Rating: 4,25 stars.My overall thoughts on The Silkworm were similar to those I had about The Cuckoo's Calling. It started out pretty slow-paced (the course of the investigation requiring many descriptive parts) and for a while there was a lot of random-sounding information, but once it picked up and I started connecting dots and making predictions (all of which turned out to be wrong; I royally suck at solving mysteries) I was totally HOOKED.The mystery was very intriguing (a missing author who leaves behind a manuscript with libelous depictions - maybe real secrets? - of almost everyone he knows). The case turned out to be a lot grittier than the one in TCC, both sadistic and grotesque (there was a scene where I actually gagged). I was captivated by detective Strike’s sometimes random-sounding lines of inquiry and towards the end I was positively dying for him to reveal the identity of the killer and how everything was tied together. I wasn't entirely happy with who the criminal turned out to be. Without spoiling anything, I’ll just say given how GRUESOME the murder had been, I was expecting a bigger showdown at the end and the killer to be someone with an altogether different personality (view spoiler)[more deranged and prone to violence at being confronted by Strike, instead of pathetically coughing and running away crying (hide spoiler)]. HOWEVER, this didn't change how much I enjoyed the progression of the case throughout the book. Something I really liked: Helping Leonora (and Orlando) became something personal for Strike and she wasn't ‘just another client’. I really felt for the mother and daughter and wished them well. Or perhaps I felt personally invested in their well-being because Strike was invested himself.What I loved MOST about TS (just like with TCC): The real-ness of the characters, which were complex, flawed and portrayed without the literary embellishments authors tend to grant their MCs. If I suddenly learnt that Galbraith/Rowling had based the characters on real-life people (I know she didn't really), I wouldn't be surprised at all. Strike and Robin could easily be real, living people.About Strike and Robin: In my review of The Cuckoo's Calling I said I loved the duo but couldn't see them ever getting romantically involved. Well, I still stand by that, mostly, except that ever since a glorious chapter (Nº30) (view spoiler)[SHE WAS THE ONLY PERSON HE WANTED TO TALK TO ABOUT WHAT HAD HAPPENED!!! My shipper heart! (hide spoiler)]I've been having FEELINGS and wondering if maybe, waaaay down the road, something could happen between them. I'm torn between wanting them to have a platonic Sherlock/Watson kind of friendship lest they ruin something great with stupid romantic bull, and (I can’t help it) wishing than someday, far-off after they've forged a solid bond, they will end up together romantically. On the one hand they seem to understand each other in a way I don’t see anybody else understanding them (And I really don’t see things between Robin and Matthew working out in the long run); on the other hand Robin seems to want a family apart from her job and I don’t see Strike ever being ready to settle down and have kids (he is majorly fucked up). Something I missed: There was a little less of the great sarcastic humor that I so enjoyed in the previous instalment, though there was certainly some of it there. Strike and Robin were each going through complicated personal stuff, so the atmosphere ended up being a bit more serious and angsty.In a nutshell: I had a couple of issues with this instalment but mostly it was wonderful and I ended up caring for Strike and Robin even more than in TCC. I enthusiastically await the next book in the series.Ps: What is it about Cormoran that attracts all those beautiful, clever women? I love his character and I think he’d make a great friend (loyal, provides entertaining conversation) but he’s also married to his work and pretty fucked up and it’s pretty obvious he would suck as a boyfriend. How do they not see this?*********************************************************Update 03/07/14: My country sucks. Big time. There's a new import policy which basically means I won't be getting this (or any other of my much awaited books) for a while yet. SO DAMN ANGRY I CAN'T EVEN. *starts raising money to move to an English-speaking country**********************************************************Update 16/02/14: There's a title, a cover, a synopsis AND A RELEASE DATE which is ONLY A FEW MONTHS AWAY!!"}, {"Review": "\n\"Ha, ha, ha, thou entanglest thyself in thine own work like a silkworm, John Webster\" ~ The White Devil\nOwen Quine was the man. He was the author who thought a day was wasted if he hadn't made his readers gag at least twice, according to Jerry. Owen Quine's books was simply gory and disgusting. His final book was a tribute to the equally gory and disgusting people in the publishing world, disguised as six prominent characters in the plot. Appropriate names, describing their secrets, was ascribed to them. One of them was called Phallus impudicus. \"Phallus impudicus is actually the proper name for a toadstool called stinkhorn. Apparently they smell vile and…well,” she giggled some more, “they look like rotting knobs. Classic Owen: dirty names and everyone with their bits out.”And then Quine titles the book  Bombyx mori, - the Latin name for a silkworm.All the 'villains' in his book were associated with the publishing house Roper Chard. A scramble ensues to save their own names and then Quine disappears. Their reactions, when Cormoran Strike, the private detective, interviews them were placid fury disguised as nonchalance.  \"...he was seen for what he was: a man with a dirty imagination and an interesting style who had barely an idea that wasn’t pornographic. Some authors,” said Fancourt, “have only one good book in them. That was Owen. He shot his bolt—an expression he would have approved of—with Hobart’s Sin. Everything after that was pointless rehashes.”\"I never denied that Owen could write, you know, it was just that he was never able to dredge up anything profound or interesting to write about. It’s a surprisingly common phenomenon. But with Bombyx Mori he found his subject at last, didn’t he? Everybody hates me, everyone’s against me, I’m a genius and nobody can see it. The result is grotesque and comic, it reeks of bitterness and self-pity, but it has an undeniable fascination. And the language,” said Fancourt, with the most enthusiasm he had so far brought to the discussion, “is admirable. Some passages are among the best things he ever wrote.”COMMENTSSomewhere there will be an explanation for why J.K. Rawling, writing this book under a pseudonym, came out with who the real author was, since the book could have made it on its own merit. However, according to rumor the sales were not so good, and it might have caused some embarrassment for this mega-famous author. Hence the need to come out of the closet! This books was a brilliant read. It is the first Robert Galbraith book that I read and wasn't aware that it is actually part of a series. It is a FREE-STANDING BOOK! Five stars for that alone!Private investigator Cormoran Stike is the so-called protagonist in the book. His PA, Robin, is the secondary main character. Through them the story unfolds. He is short of cash, although a previous case brought him fame and his business was surviving the debts he has to pay. He can hardly keep up with the usual cases of adulterous spouses, dirty politicians, and other shadowy transactions he has to investigate. But something tells him to accept the case of Leonora Quine, looking for her husband-a lame duck-case he never accepts as a rule. Instincts tells him to go for this one though ...Surprisingly, the actual main character is the notorious script of the non-published book,  Bombyx mori. The entire saga evolves around the content, characters and consequences of its publishing. J.K.Rawling uses this actual main character to voice her opinion on the publishing world and she has a lot of fun in doing so.As a result, this whodunit offers much more than the usual suspects and intricate plot. And what would a murder mystery be without a surprising ending! With all the elements in place to make it a thrilling experience, the author uses the opportunity to comment on the publishing world, through the various characters. ( I found it as delightful as The Salinger Contract by Adam Langer: https://www.goodreads.com/review/show... )Some of the comments made by the author in The Silkworm:\n\"...writers are a savage breed, Mr. Strike. If you want life-long friendship and selfless camaraderie, join the army and learn to kill. If you want a lifetime of temporary alliances with peers who will glory in your every failure, write novels.\" \n\n\"Hard to remember these days that there was a time you had to wait for the ink and paper reviews to see your work excoriated. With the invention of the internet, any subliterate cretin can be Michiko Kakutani. \"“The whole world’s writing novels, but nobody’s reading them.”\nSoooo, let me allow my sense of humor to prevail and ignore the obvious. Let yours truly, just another subliterate cretin, without further ado, rate this book a five star murder mystery."}, {"Review": "There are some things that I think this series has really got going for it. It totally has that old school detective story vibe going for it along with engaging characters and settings even the plots are really pretty good. This reminds me a little of a T.V. series though where the detectives solve a case an episode. But will this story be for you? Well I guess that depends on a few things. There is something about Robert Galbraith’s (aka J. K. Rowling) that will forever feel a little bit like coming home for me. After all my time in the wonderful wizarding world of Harry Potter it is hard not to love the base of the writing involved no matter what the actual story is. Because there is a certain style and knack to telling the story that is inherent no matter what pseudonym is used. There are a lot of extra details about the many of the characters and some of them are really important to the story but others are just important to making the characters seem like regular people you might meet on the street.I have enjoyed this series so far for a couple of reasons. The plot of who-dun-it is interesting and there are enough clues that you can figure it out along the way. I actually knew who the killer was really early in this book (mostly because of my job as a chemist) but still it is about the journey and even though I had figured out the who I enjoyed going about with Strike and Robin to figure out the why of it. The other reason I have liked the series is because of Strike and Robin. I like their dysfunctional relationships with other people, there slightly charged professional relationship, the way that they seem to understand a lot about the other without necessarily talking about it. They aren’t a couple and probably won’t be for a long time in the series but there is just enough there that I’m hoping it goes that direction later.We have gotten a lot of details about Strike as a person so far. His failed off and on relationship that seemed incredibly volatile and the loss of his leg. I actually really love some of the details put in the story about this and how he struggles with some of his disability and tries to not let anyone see him vulnerable ever. I want to learn more about Robin and her past, why she left university and how the hell did Matthew land her because as far as I can tell most of the time he is a jerk.  A few of the best parts this mystery.The excerpts from the actual fictional book in question. I’m not sure what genre that was supposed to be or if that is what they read regularly in England but they were part dream, part metaphor and downright strange. I don’t think I could read an entire book like that but it was cool to see snippets throughout the story.Seeing Robin and Strike’s relationship grow and how both of them have a way of telling the other exactly how it is no filter sometimes. They have a pretty good friendship right now and mutual respect happening that is enjoyable.The Client, she is a bit messed up and not necessarily a nice person but I liked that she seemed like a real person. She has a disabled daughter at home and a philandering husband and one friend in the world. She is doing the best she can and so if her responses are the social norm so be it.A peak into this world of authors, agents and publishing houses. I really hope that this isn’t how it has been over the years for Rowling but it did make entertaining reading.OverallI was completely entertained and I enjoyed my time in this world. It isn’t the best mystery I’ve read but I do like all the extra details that are thrown in and I like feeling like I’m inside every part of the daily lives of Robin and Strike while reading. "}], "Genre": "Crime", "ID": "18214414", "Desc": ""}