{"Genre": "Crime", "Reviews": [{"Review": "I don’t read a lot of page turners. I often find myself unable to put a book down—but they’re not the kinds of books that would keep most people glued to their chairs. Still, I recently found myself reading a book so compelling that I couldn’t turn away.Bad Blood: Secrets and Lies in a Silicon Valley Startup by John Carreyrou details the rise and fall of Theranos. If you aren’t familiar with the Theranos story, here’s the short version: the company promised to quickly give you a complete picture"}, {"Review": "Fascinating accounting of the Theranos scam and I do mean SCAM. Exhaustively reported. I do wish there had been more analysis of how a scam of this magnitude was made possible and enabled. This girl dropped out of college and convinced Henry Kissinger, George Schulz, Rupert Murdoch and a bunch of other famous and/or incredibly talented people to give her money or work with her even though there was no there, there. WHAT? There are so many incredible WTF moments. Just wow. Privilege is a hell of"}, {"Review": "\"The resignations infuriated Elizabeth and Sunny. The following day, they summoned the staff for an all-hands meeting in the cafeteria. Copies of The Alchemist by Paulo Coelho had been placed on every chair. Elizabeth told the gathered employees that she was building a religion. If there was anyone not prepared to show complete devotion and unmitigated loyalty to the company they should “get the fuck out.”The Steve Jobs SyndromeI have covered Silicon Valley as a journalist and author for three d"}, {"Review": "While reading Bad Blood: Secrets and Lies in a Silicon Valley Startup, my blood was boiling. Partly because I have enormous dislike towards Elizabeth Holmes, but also because our house has been doing 35 to 40 degrees (celsius) a day as does my workplace, too.(Finland, as well as many other European countries, is not designed for a hot weather, but instead our buildings and ventilation is made to keep warmth in. This includes private housing but also public infrastructure such as hospitals, shops"}, {"Review": "Early in my career I worked at a next-generation sequencing startup with Theranos-level ambitions. In fact, it went further. The founders’ mission was to cure aging. Literally, the goal was immortality.There were other similarities: The company was founded by wunderkinds, they won the attention and support of a prominent professor in the field, they dropped out and raised millions of dollars from non-hard tech investors off the back of a concept, then tens of millions of dollars off the back of"}, {"Review": "The True Cost of IdealismI have been guilty of the grave fault of idealism in much of my professional life. Consequently I cringe when I read of the young Elizabeth Holmes and her idealistic trajectory from the thrilling emotionally-laden launch of Theranos, which promised a breakthrough in medical technology, to its ignominious destruction as a fraudulent scam. In her I see myself - not in her level of talent or her self-confidence but in her profound self-delusion. It is this self-delusion whi"}, {"Review": "4.5 Stars Elizabeth told the gathered employees that she was building a religion. If there were any among them who didn’t believe, they should leave. Wow! What a powerful story. I'm a fan of financial stories and I personally work in the tech industry so when I heard about this book I knew I had to read it. If you like shows like Shark Tank, I think you will find this story interesting.Elizabeth Holmes is 19 and an incredibly smart girl. She decides to dropout of Stanford because she has an idea"}, {"Review": "A company that set out to save lives… only to put those same lives in danger with its malfunctioning technology.What a scary and fascinating story. It’s hard to believe that Theranos really happened because you think that nowadays it’s easy to spot liars and lying technologies… but it’s not that easy after all, especially if the person duping you is as charismatic as this Elizabeth Holmes is. But the main reason why it took a VERY long time for people to catch on that Theranos was doing more har"}, {"Review": "I don’t read a lot of nonfiction books. I love the imagination of fiction. When I heard about this book from a television show, it sounded unbelievable. The fact that this was a true story that seemed stranger than fiction, I had to give it a read. I’m really glad I did because this was really good. This story is about the youngest woman, to become a self-made billionaire, and the giant fraud she committed on Silicon Valley. Elizabeth Holmes, was a Stanford drop-out that used her knowledge and f"}, {"Review": "Tips on how to make an unicorn:- Be a sociopath- Excel at sales&marketing- Get some cool people on your BoardTips to how to fake it till you make it?- Hire a lot of lawyers- Intimidate all your employees- Pretend that you are a vocal proponent of a cause that you are actually againstHow to make it as a woman in the tech world?- Baritone- Intese staringWhat can fuck up your amazing future as a tech billionaire?- Facts and data :( I love any story that shows how sales&marketing can change"}, {"Review": "How does a woman who was once lauded as the youngest self-made female billionaire find herself now broke and charged with fraud? Her face was on the cover of many financial magazines as the golden girl of Silicon Valley, the female Steve Jobs. In her black turtlenecks, she even dressed like Jobs. Elizabeth Holmes had an idea for a medical device that used breakthrough technology that could provide lab results from a simple finger prick and a minuscule drop of blood, and thereby revolutionize the"}, {"Review": "HOLY COW. I followed the Elizabeth Holmes/Theranos story slightly but this book does such a fantastic job of showing how completely banana pants this situation was. This was also great on audio, and so addictive that I started making up chores I could do just so I could keep listening.Watch me discuss this book in my July wrap up: https://youtu.be/8kaQcaNn9uw"}, {"Review": "Mesmerising. Unbelievable. Compulsively readable. I cannot recommend this highly enough. I sped through this audiobook in a few days because I just could not stop listening to it. There were so many unbelievable things in this true account of the Theranos scam that my mouth dropped open in a way I wouldn't have thought happens in real life.John Carreyrou traces the story of Elizabeth Holmes and her medical start-up Theranos from the beginning with the help of countless interviews and other insig"}, {"Review": "Bad Blood is a straightforward read about the rise and fall of Theranos, done in chronological order in third-person up until Carreyrou becomes personally involved, at which point things accelerate to the SEC civil settlement. Carreyrou doesn't end too strongly but says that the criminal investigation may well end up charging Holmes & Sunny. This means that it lacks a really conclusive 'ending': Theranos was continuing to limp on, having received funding from a vulture on the strength of its"}, {"Review": "Fascinating! Bad Blood: Secrets and Lies in a Silicon Valley Startup is a detailed account of the (perceived) rise and demise of Theranos, a blood testing startup once valued at nearly $9B. I thoroughly enjoyed this book and barely wanted to put it down. It was baffling to read about the scams, stunts and lies this company pulled, led by founder Elizabeth Holmes and her former boyfriend, Ramesh “Sunny” Balwani. The red flags surrounding Theranos were rampant, and Carreyrou does an excellent job"}, {"Review": "Just when I thought all reporters ever did anymore was see what was trending on social media and write stories with titles like \"You'll cheer how this mom clapped-back at her body-shamers on Twitter,\" this book gives me hope that old-fashioned investigative journalism is alive and well and doing exactly what it's supposed to: shine an unflinching hot light on those who abuse their power and privilege. Here, it's aimed at the bizarre cult of Elizabeth Holmes and her \"disruptive\" \"game changing\" c"}, {"Review": "A captivating, interesting, and (almost) unbelievable story. I had heard of Therano's downfall in the news, but the way this author investigated and narrated the events was absolutely remarkable.The book details the rise and fall of Theranos, a Silicon-Valley company that aimed to provide fast, blood test results with a single drop of blood. Elizabeth Holmes was the founder and CEO, her goal was to revolutionize the healthcare industry and, at some point, she was compared to the likes of Steve J"}, {"Review": "Oh, Silicon Valley, the place of realized dreams and sometimes of unexpected nightmares.Bad Blood immediately drew me into buying a copy right when I read \"a riveting story of the biggest corporate fraud since Enron\" (I like to read about Enron as well as the less sunny side of modern corporate history). With the infamous story of Theranos splashing across the news and through media anyway, I figured now was as good a time as ever to actually read this book and learn more about exactly what happ"}, {"Review": "What an audacious fraud! Elizabeth Holmes must be the Queen of self-hype to get so many powerful (and allegedly smart) men to support this scheme (Jim Mattis! Henry Kissinger!). I would enjoy seeing both her and Sunny Balwani in jail, for what they'd done not only to their customers, but their employees.Although I am not a fan of Wall Street Journal and the baloney they peddle in their opinion pieces, I was impressed by how their investigative department stood up against legal pressures from The"}, {"Review": "“Bad Blood” details the fascinating journey of a brilliant, soulless, young entrepreneur in pursuit of riches and fame. The story has heroes and villains, twisting and turning subplots, political intrigue and -even while we know the eventual outcome- plenty of surprises. It has all the elements of a good fictional thriller, but what makes this story most shocking and intriguing -- is the fact that it really happened. The details in this book will leave you shaking in your boots when you realize"}, {"Review": "Should be mandatory B-School readingI read this book in one day. I had read some articles and/or saw TV shows on Theranos and Elizabeth Holmes, but my knowledge was pretty general. Once I started the book, I could not put it down. I canceled lunch with a friend so I could continue reading. I ordered pizza for the family so I could continue reading. The story is interesting and shocking. It is a story that every Board should read because ultimately it failed in its oversight responsibilities - wh"}, {"Review": "Scandalous, riveting, and well reported. I tore through this in a weekend. This is an unbelievable story - I literally cannot believe how so many people were duped by this company. It's a story of a Stanford grad dropout who had a vision, and an uncanny ability to make others believe her, and as the pressure piled on, as she started to be compared to Steve Jobs, and get accolades like \"first female self-made billionaire\", she started to cheat. I'm sure it started small at first - the story of th"}, {"Review": "I have little else to add that hasn't already been said elsewhere, except that I'm amazed this could happen. I marvel at how Holmes and the rest could bullshit so many people, including those in positions of power, for so long. "}, {"Review": "In case you weren't already aware: Absolute power corrupts absolutely.I so want to discuss various elements of Bad Blood, but I want even more not to give anything away for those who haven't read it yet. I'll just say that this book is about power and money and megalomania and extreme cowardice and fear but also the kind of extraordinary bravery for which we should all be grateful. I was riveted and APPALLED and it was such a good story that I didn't want it to end, but at the same time I really"}, {"Review": "Simultaneously riveting and immensely frustrating in the way that I imagine watching a trainwreck in slow-motion might be, major props go to John Carreyrou for seeing through and doggedly pursuing a story that undoubtedly could have ended with a fallout far beyond the scope of SV royalty.This isn't even a review so much as a reminder that this, yes, this (below) is the face of a willing destroyer of worlds… "}, {"Review": "58th book for 2018.John Carreyrou the unicorn killer!Shortly before Carreyrou's expose appeared in the Wall Street Journal, Theranos, a Silicon Valley biotech startup, had a valuation of 10 billion dollars, within a few months it's net worth was close to zero. All hail the power of investigative journalism!It took me about a third of the book (100 pages) to really get into the Theranos story, but once hooked, I couldn't put the book down and read the final 200 pages in a single afternoon. In Bad"}, {"Review": "amazing. I am not a reader of non-fiction however this was extremely well written, researched, and read like a thriller. scary how they could have gotten away with it if not for the whistler blowers."}, {"Review": "Wow. Usually when things sound too good to be true, it's because they are. The Theranos device never made sense to me from the news reports. But the college dropout with the fancy connections managed to fool all kinds of famous and important people for years and years, and get about $1 billion in investments, publicity, etc. It's hard to say what's more breathtaking --her evil or their stupidity. And what does that mean about the leaders of government and industry that they are so gullible? Henr"}, {"Review": " “Grow fast, lose money, go public, get rich. That’s the model.” -- Dan LyonsUnicorns are rampant in the Boston area, and a slide my previous employer liked to show touted that any given time there were just under 1000 biotech or pharmaceutical based companies in the greater Boston/Cambridge area--a roughly 6 mile radius. While this book is set in Silicon Valley, it isn't the first account I've read about rampantly abusive corporate culture, and idolizing the unicorns that made it big. This part"}, {"Review": "Author Carreyrou gave a book talk in Palo Alto that was (as you can imagine) well-attended. I read his articles at the WSJ as they developed, but it's always fun to see the author in person (as you know, dear Reader). The biggest stir in the audience was his reveal that Rupert Murdoch, owner of the WSJ and hence Carreyrou's ultimate boss, had made a $125 million late-stage investment in Theranos, now worth nothing. Theranos lawyers made multiple appeals to Murdoch personally, trying to get him t"}], "ID": "37976541", "Name": "Bad Blood: Secrets and Lies in a Silicon Valley Startup"}