{"Name": "The Tattoo Thief", "Image": "https://images.gr-assets.com/books/1502603624l/35478973.jpg", "Reviews": [{"Review": "This is an infinitely dark crime thriller set in Brighton in the fascinating world of tattoo artists, with a macabre serial killer that takes pleasure in removing tattoos by flaying alive the murder victims. The youngest DI Francis Sullivan faces hostility from his second in command, the older, more experienced DS Rory Mackay, who thinks he should have been the one promoted and from his boss, DCI Martin Bradshaw, disinclined to trust Sullivan's judgement, whilst insisting on courses of action that do nothing to advance the investigation. Experienced tattooist, Marnie Mullins, is not doing well in distancing herself from her ex-husband, Thierry, and has a traumatic past history that has left her distrusting the police. She is providing clients with intricate tattoos at the Brighton Tattoo Conference, when she slips out to get a cup of coffee. To her horror, she discovers a dead body in a refuse bin, and phones the police to let them know anonymously.So begins DI Sullivan's first murder case where leads prove to be elusive, and he faces intense pressure within the police team watching him, waiting for him to fail and the unhelpful micromanaging tendencies of his boss. Sullivan is a bright guy who tracks down Marnie, a woman ambivalent about helping the police but unwavering in her commitment to help her community, being targeted by a serial killer. The serial killer's perspective and motivation is interspersed in the narrative, along with a clearly troubled family history. We are given a picture of a killer who finds it hard to control their blood lust and sees their work as a form of art. Sullivan needs Marnie to understand the world of tattooists and the two find themselves working together informally as more murders occur. Sullivan finds that there some orders from his boss that he cannot in all conscience obey if he wants to protect the public but irrespective of all the obstacles he faces, he will not stop trying to nail the killer. This brings danger to him and Marnie, as the determined pair get closer to the killer.Alison Belsham's debut novel is a promising beginning to her career, she writes a bleak, disturbing, gripping and gory tale of a unhinged serial killer roaming Brighton, spreading fear in the community. I particularly enjoyed the insights into the alternative world of tattooists and the prejudices that those who have tattoos can encounter. Sullivan, a committed Catholic, cannot see why anyone sane should disfigure their body by having one until he has his eyes opened by Marnie. If you like your crime thrillers dark, brutal, unsettling, with plenty of blood and gore, then this is a read for you. Many thanks to Orion for an ARC. "}, {"Review": "This book will not be for everyone... it is dark, disturbing and graphic. If you can cope with that you will love this book! Lately there have been a lot of books with such similar stories that it has been hard to tell them apart. This one was absolutely an original story, and one that had me hooked.Marni Mullians is a tattoo expert, she knows her ink as a tattoo artist in Brighton. When she makes the horrifying discovery in the rubbish near her studio of a man who has had his tattoos removed, she becomes the leading expert for the police investigating the murder. DI Francis Sullivan is newly promoted and has to prove himself to his superiors. This is his first murder case. Then a second body is found and they have serial killer on their hands.. a killer who is collecting tattoos from his victims while they are still alive.Thanks to Orion Publishing and NetGalley for the advanced copy of this book to read. All opinions are my own and are in no way biased "}, {"Review": "he Tattoo Thief flicks between four characters. Marni a tattooist, Francis a DI, Rory, who works under Francis and the killer. The killer even though we get to meet them and see inside their dark and twisted mind, we don't actually know who it is. Obviously I was trying to guess who but failed miserably.Marni is quite a strong character and I have to say I loved finding out more about tattoo's and what a normal working day is like for a tattooist. It really makes for some fascinating reading. Marni has a lot going on in her life without being caught up in a murder case but it made her so much more interesting and I really liked her.Francis I loved. Such a great character and I really hope there is going to be more books featuring him. I liked how he really invested himself in this case even though higher up think they know better. He comes across as determined and caring and he would certainly someone I would be happy to have working on a case.The Tattoo Thief is such an original story line that makes for a page turner of a read. It's a very dark read that will have you on the edge of your seat as they close in on the killer. There was so many heart in mouth moments that horrified yet thrilled me and I couldn't get enough. It was such a great climax also and didn't disappoint. Certainly look forward to reading more by the author.My thanks to Trapeze and NetGalley for a copy of this book. All opinions are my own and not biased in anyway."}, {"Review": "The Tattoo Thief is a pacy and addictive thriller that I read all in one go - it is dark and quite brutal with an excellent twisty plot and some intriguing characters.I liked Marni, tattoo artist, who gets caught up in a serial killer case despite her best efforts to stay out of it and the mystery elements are well plotted to keep things unexpected. It is gripping and often darkly violent, descriptively this is not for the faint of heart.We get a glimpse into the world of the Tattoo artist, which was fascinating, the author also does a good job of looking at prejudice and politics - often unsettling, The Tattoo Thief is one of those books that can affect your dreams, the imagery staying with you long after finishing it.I really enjoyed it - an addictive crime thriller for those upcoming cold dark nights.Recommended."}, {"Review": "I received a copy of this book from Netgalley in exchange for an honest review.A well paced whodunnit with great characterisation - though sometimes a bit far-fetched.Marni's tattooing a guy called Steve in her hometown in Brighton, when she discovers a body in the bins outside. She phones it into the police, only to find herself hauled into the centre of a twisted serial killing spree. As if the poor love hasn't got enough on her plate with her problematic ex-husband still in the neighbourhood. Turns out that this murderer has a taste for collecting tattoos, and whats more, they only want the finest that's out there. Francis, a religious copper who's recently been promoted, is on the case -but only if his boss will let him get on with the task at hand. However, he didn't count on meeting a lady like Marni...Overall, I liked the book and read it very quickly (over the course of a couple of nights). I was invested in the characters (particularly brittle Marni, who was a definite treat to read) and wanted to find out what happened. The ending was fairly satisfying, with a couple of twists that weren't immediately obvious, and it was enough to keep me satisfied. I think the author definitely excels at characterisation - with some of her characters, you really get a sense that she's dug deep to pull out their authenticity and vulnerability. However, I was slightly disappointed to see some very over-used genre cliches in this book; not least the golf-playing police chief who obstructs the 'good cop's' efforts - that was a trope I could well have done without. There were also a few moments that felt a bit unconvincing. For example, if you'd just been brutally attacked by a serial killer and they'd tried to flay you alive, would you check yourself out of hospital without anyone knowing, then return the the scene of the crime in the middle of the night? Also, what happened to Marni's dog?! I needed to know, I was worried! However, this sort of thing is quite common in books like this. It's such a popular, over-populated genre that there's bound to be some crossover and it must be hard to get total originality. As such, I'm giving it a four out of five stars as it was really compelling to read. "}, {"Review": "Well. If you like your crime dark and graphic then this is the book for you.As to what the book is about, “It does what it says on the tin”. There is a killer selecting people with tattoos and removing them – whilst the person is still alive. Gory enough for you? We’re not talking tiny butterflies here by the way – all those chosen have some amazing body art which someone is obviously desperate to own.DI Francis Sullivan has been newly promoted at just 29 years of age. His promotion has not gone down well with his colleague DS Rory Mackay who was also hoping to get the post. Tensions between the two simmer with Sullivan’s inexperience being an irritant to Mackay. It doesn’t help that their DCI is a rude ignorant brute of a man who has no time for reasoning or excuses and just wants results. Now.Set in Brighton, the story is told from 4 perspectives – Francis, Rory, a tattooist called Marni Mullins and an unknown voice, who I took to be the killer.Marni is a complex character, clearly damaged by past events of which the reader is gradually made aware. Divorced from fellow tattoo artist Thiery Mullins, she is a respected tattoo artist in her own right. She still holds a torch for her ex-husband and even though she resents his interference in her life, she can’t quite let go. It is Marni who discovers the first victim and when Francis approaches her for assistance with his enquiries into the tattooist community, she is conflicted. She wants to help catch the killer but doesn’t want to help the police. There were the inevitable eye rolls from me whenever she went off-piste and ignored advice. How many times do bad things happen when they do that? Some people never learn!The Tattoo Thief is rather more graphic than the crime thrillers I would normally choose but I really enjoyed this. I can be a bit of a wuss where mutilation of bodies are concerned and there were times when I winced and had to look away at a particularly gruesome description but the story raced along at a pace and kept my interest all the way through. The voice of the killer, is particularly chilling, as are the references to ‘The Collector’.I particularly liked the interaction between Marni and Francis – partly because they were so very different in personality. Francis was very religious, a regular church goer with family issues of his own. His inexperience in dealing with suspects and witnesses meant for some clumsy interviewing which did get people’s backs up – including Marni’s. However for all her antipathy towards the police there was a connection between the two which I suspect might be explored further.I did feel quite sorry for Francis. His lack of experience made him a marked man in some quarters and some people had no hesitation in throwing him under a bus if it suited them. However he had a stubborn nature and wouldn’t go away quietly. He wants to prove himself by solving the case any way he can. In that respect he and Marni were well matched.The Tattoo Thief was an intriguing and tension filled read from beginning to end. I’m interested to see how the characters of Sullivan and Mullins develop and will definitely be reading more of this series."}, {"Review": "Buzz!!! Buzz!!! and the tattoo machine inks another person having given their consent to the tattooist to make their mark. However, there is a thief about who steals tattoos off people, leaving them for dead.This crime thriller is set around Brighton and in her debut novel, Alison Belsham gives the case to newly promoted DI Francis Sullivan. What is nice about this police procedural, is that there are separate chapters from the point of view of the 4 main characters. DI Francis Sullivan and DS Rory Mackay give their view as the case progresses plus you also get chapters from tattooist Marni Mullins and the bad guy who is stealing the tattoos from the victims.I enjoyed reading The Tattoo Thief and liked all the bits that Marni told the reader about her job as a tattooist. Most crime thrillers dwell on the job of the police officers and it was very nice to have detail about a very different day job. This gave The Tattoo Thief added value. Characterization of Francis, Rory and Marni was good and I liked the chemistry that built between the 3 of them.I thought the plot of The Tattoo Thief was okay but found the ending with all it’s racing action disappointing. Getting the location of where the bad guy may be living, chasing there page after page followed by more charging around was rather tiresome and lacked a WOW! factor compared to finding the first victim in the beginning. The final chase for the bad guy did not grab me at all, although the thought of Marni naked did brighten my mood.I liked The Tattoo Thief and thought the beginning, the structure and the character development and chemistry to be good. For a debut novel Alison Belsham has done very well and I think her book is a GOOD read that gets 4 stars from me.Thanks to NetGalley and the publisher Orion for giving me a copy of this book on the understanding that I provide an honest review."}, {"Review": "WOW – This is one gory and gruesome debut and if you have a strong stomach I am pretty sure you will love this book. The Tattoo Thief is the debut novel from Alison Belsham, published by Trapeze and available to buy now and is the first book in a trilogy.The gory story is narrated through four main characters. The Killer: a really sick and twisted individual who is killing people around Brighton and removing their skin to collect their tattoos; Marni Mullins: a divorced mother who works in Brighton as a tattoo artist and discovers the first victim; Francis Sullivan: a newly promoted Detective Inspector in charge of investigating these horrific crimes and DS Rory Mackay; a slightly disgruntled policeman who was overlooked for the DI position and now has to report to Francis Sullivan.I personally thought that this was an original and interesting story. Whilst the murders were really graphic and I found myself grimacing every other page, I was utterly engrossed in the fascinating back stories of Francis and Marni as well as the current plotline around catching this sick serial killer.Without giving away anything, it was great to read about a policeman who had such strong personal beliefs and was thoroughly determined to solve the crime and Marni Mullins – a brilliant, strong and unwavering female lead character with a dark past.I will definitely be reading the next book Poison Ink when it’s released in Feb 2019."}, {"Review": "The Tattoo Thief was a bit of a disappointment. The premise is awesome. Tattoos and serial killers? Sign me the f up. However, I couldn't help but change my mind when I was halfway thorugh it. You can tell the author did her research and knew where she wanted this story to go, but apparently got a bit lost in the making because 1) it takes really tooooo much for the story to start and 2) there are plot holes and unsolved questions that will haunt me forever. I found this book a little too inconclusive, rushed in some points (like the ending????), while being dragged in others. Too bad, because I totally saw myself loving the shit out of it. "}, {"Review": "Buen libro, entretenido, con buen ritmo. Libro de lectura rápida, con una estructura de capítulos cortos, muy fácil de seguir, sin embargo hay una voz que nos describe con todo detalle algunas escenas que no son aptas para estómagos sensibles. Francis es un inspector creyente y asiduo practicante, que recién ascendido, no solo tiene que enfrentarse a resolver este primer caso que se va complicando, sino también a un subordinado con más experiencia que aspira a su puesto y a un jefe que solo quiere resultados rápidos y no termina de confiar en él. De la mano de Francis y Marni, la persona que descubre el cuerpo, nos van metiendo en el mundo del tatuaje a través de una trama ágil, bien estructurada que mantiene el interés y la intriga hasta el final. Me ha gustado mucho la voz que nos va relatando con toda meticulosidad los pensamientos y las acciones de la persona que va ejecutando estos asesinatos. Sin embargo, hay algo que en la escena final que no concuerda con la imagen que podríamos tener del cerebro que está detrás de estos hechos y que chirría un poco, pero en general, la historia me ha gustado bastante. Dado que este es el primer libro de esta autora, espero poder leer pronto sus siguientes libros. Valoración: 8,5/10Lectura: Noviembre / 2018"}, {"Review": "I really enjoyed The Tattoo Thief. I wasn’t sure what to expect going into it, but I found myself getting pulled into the story really quickly. I liked the tattoo angle, not least because I have a few myself, so it was interesting to read about.Marni Mullins is a tattoo artist, and she stumbles upon a body in a dumpster when taking a break at a tattoo show. Conflicted, she calls it in but then goes back to work at the tattoo show, not expecting anything to come of it. Until the police find her.What follows is a twisty-turny read with lots of things going on. DI Sullivan is investigating the discovery, but he has a lot more going on than what he’s letting on. I enjoyed reading about him and his thinking processes.I loved the interactions between Francis and Marni too, especially as the book progresses. Their back and forth banter is good fun to read. There is definitely a connection there, and I liked them both as characters.The Tattoo Thief is a really interesting crime thriller, told from multiple viewpoints, including the killer. It is graphic, and more than a little tense at times. Hard to believe its a debut!Recommended for sure!"}, {"Review": "Recensione di Martina per il blog Le Lettrici Impertinentihttps://lettriciimpertinenti.blogspot...Di questo libro ne avevo sentito molto parlare. Ho letto la trama, le recensioni su Amazon e nei vari blog, alcune entusiastiche altre un po’ meno, e quando ho avuto la possibilità di averlo fra le mani non me lo sono fatta sfuggire!! IL TATUATORE, titolo italiano, The Tattoo Thief quello americano, è senza dubbio un thriller: c’è un serial killer, un poliziotto, Francis Sullivan, fresco di promozione a ispettore a soli ventinove anni, e Marni Mullins, tatuatrice di Brighton. Di libri di questo genere ne ho letti a quantità: storie con sangue, morti violente e psicopatici allo sbaraglio. Non mi spaventano e per questo mi ha risucchiata nel suo vortice. Le vittime di questa storia hanno tutte dei tatuaggi, e a tutte vengono asportati proprio quei pezzi di pelle disegnati dai migliori tatuatori in circolazione. La trama è molto originale, la ricerca dietro a essa svolta dall’autrice, per capire a fondo il mondo dei tattoo, si percepisce in maniera chiara, i pov alternati dei vari protagonisti ti permettono di sentire e vivere la vicenda sotto i diversi punti di vista: quelli del serial killer sembrano deliri quasi a sottolineare maggiormente la sua psicosi. Ho amato particolarmente i racconti e le spiegazioni sul significato dei vari tatuaggi, come essi vengano considerati opere d’arte che prendono vita sulla pelle. Tirando le somme il libro mi è piaciuto, però c’è un piccolo ma… La prima parte della vicenda è la classica di tutti i thriller: la squadra che inizia a occuparsi del caso, a fare congetture, ricerche, a un certo punto brancola nel buio e molti sono i buchi nell’acqua. La seconda parte corre via troppo velocemente, dall’arresto del killer fino alla scoperta di tutta la verità, sembra di assistere a una corsa, quasi la Belsham volesse chiudere in fretta. Per essere il suo libro d’esordio credo che di questa scrittrice sentiremo ancora parlare: ha scritto un buon thriller, dalla trama originale, con uno stile ricercato, creato due personaggi, Francis e Marni, che spero possano essere protagonisti anche dei suoi lavori futuri, visto che le auguro che questo sia il primo libro di una lunga serie. Mi è piaciuto moltissimo come l’autrice abbia dato uno spessore caratteriale e psicologico a entrambi, perché ha permesso di capirli in toto. Anche con il killer ha fatto lo stesso e pur non amandolo si riesce però a comprenderlo meglio. Unico neo è stata appunto la fine, forse un pochino troppo frettolosa, che mi ha lasciato un po’ l’amaro in bocca, ma Il Tatuatore è un libro che tutti gli amanti del genere come me dovrebbero assolutamente leggere."}, {"Review": "This book was on my radar for quite some time before I read it and once I did get my hands on a copy I just had to start it straight away. And I read it in one sitting as well as it is so completely and utterly gripping that I couldn’t bare to put it down! If, like me, you’re finding it hard to distinguish between police procedurals at the moment or want something a little bit different that really stands out from the crowd, then The Tattoo Thief is the book for you! It’s a fresh and exciting debut novel with interesting and intriguing characters whom I absolutely loved!Marnie Mullins is a tattoo artist in Brighton with a rather complicated private life and a secret past. When she discovers a body whilst outside on a coffee break, she comes into contact with DI Francis (not Frank!!) Sullivan a newly promoted detective who needs to prove his worth. And when these two came together then sparks really did fly! Marnie has reasons to be wary of the police but when she spots a link between the body she discovered and other murders then she needs to work with Francis to bring a very disturbed serial killer to justice.Pretty much everything about this book worked for me!! I loved Marnie Mullins, I found her to be a very strong minded individual but with a soft edge that made me want to protect her, especially as her tattoos also made her a target for this deranged murderer! I loved the idea that someone was killing people for their tattoos even though it was one of sickest collections I’d ever read about! And Alison Belsham did an AMAZING job of bringing the dark side of the tattoo scene in Brighton to life with her quirky characters and grisly murder scenes. I was completely gripped by the creepy antagonist and their point of view throughout the narrative and the twists and turns meant that I didn’t work out who was responsible until the big reveal.I can’t wait to read more by Alison Belsham. This was an outstanding debut that took over my life whilst I was reading it. I was so utterly engrossed that I became part of its shadowy setting immediately and that feeling didn’t let up until the very end. Marnie and Francis were both characters who will stick in my mind and I would love to meet them again in the future.Highly recommended by me!"}, {"Review": "Een meedogenloze serial killer met maar één doel voor ogen : het verzamelen van tattoos. Een gecompliceerde zaak voor inspecteur Francis Sullivan. Samen met Marni Mullins (een tatoeëerder) probeert hij de moordenaar te stoppen. Een spannend en (voor sommigen) af en toe best gruwelijk boek. 2 sterke personages, waarvan ik hoop dat we ook Marni in een volgend boek terug zullen zien. Alleen geen idee wat voor rol zij dan moet spelen, aangezien haar expertise gericht is op tattoos. Maar ik denk dat er nog genoeg uit dit karakter te halen valt en daar zal de auteur vast raad mee weten. Wederom hebben we weer te maken met een debuut, maar na het lezen van deze, kijk ik uit naar meer! ****"}, {"Review": "Well, that’s one way to kick off a book! We are talking tattoo removal with not a laser in sight! The Tattoo Thief brings a whole new method to the removal of body art! Moving swiftly onto a tattoo convention in Brighton and this book has got all my synapses snapping!The Tattoo Thief is the police investigation into a brutal killer with a unique fascination. The killer is tracking down tattoo fans and killing them slowly for their skin! Enter newly promoted DI Francis Sullivan who finds himself in a race against time while having to prove his worth to his superiors as well as his team.Sullivan is an intriguing character, intensely religious with a family burden lying heavy on his shoulders. Slightly pious and standoffish to begin with, I began to warm to him as the author drew out his character and by the end, I was shouting for more! His DS Rory MacKay was passed over for promotion and he clearly resents Sullivan for this and boy was he a snaky little snake at times! Yet the two of them kind of worked well together in a twisted sort of way!Marni Mullins was by far my favourite character in the novel, a tattoo artist with an impetuous and arrogant French ex-husband and a past that causes her to lack any trust in the police. So when she gets caught up in the investigation it was interesting to watch how her relationship with Sullivan developed.Interspersed with the Tattoo Thief’s narrative gave the novel that chilling element that kept me on my toes; clues dropped and snatched back before being dropped again, this one keeps you guessing all the way through.Set in Brighton and the narrow little lanes and alternative culture it was the perfect setting for the story. It is hard to think of any other detective other than Peter James’ Roy Grace policing the streets of Brighton but I think that Alison Belsham has brought in an excellent alternative. Now you can imagine both of them bumping into each other in the midst of an investigation! There was also reference given to the stigma still attached by some, to the subject of body art and it was interesting to watch this play out.This is a macabre debut from the author and definitely one that has piqued my interest in the latest DI in my life! If you like your crime fiction dark, bloody and twisted then I think The Tattoo Thief will be right up your street!"}, {"Review": "Wanneer tattoo-artieste Marni Mullins tijdens haar lunchpauze op de tattooconventie een lijk vindt in een prullenbak, belt ze anoniem de politie. Ze weet dan nog niet dat ze wordt meegetrokken in een spannend kat- en- muisspel die de zoektocht naar een verzamelaar van tatoeages centraal heeft staan.Hoewel er een aantal clichés in het boek zitten, is de opbouw erg sterk. Afwisselend lezen we vanuit Marni, haar ex-man Thierry, politieagent Francis, zijn collega Rory en natuurlijk de dader. Vooral de stukken die we vanuit de dader lezen zijn erg spannend. De gedetailleerde en lugubere teksten zijn beeldend geschreven en slaan zich hierdoor meteen op je netvlies op. Het verleden van de personages komen op een goede manier aan bod en overheersen nergens het verhaal. Het wekt nieuwsgierigheid op omdat je wilt weten wat er zich voorheen heeft afgespeeld. Gestaag wordt die informatie beschikbaar en hierdoor krijg je fijne karakters waarmee je je kunt identificeren. Je gunt ze van alles en hoopt dat alles goed komt. Maar ook wordt er informatie over tatoeages op een fijne manier gegeven. Lezend als leek in deze wereld, weet je na het dichtslaan van het boek ineens toch een tikkeltje meer over tatoeages.De tattooverzamelaar is echt een prima debuut en laat aan het eind ruimte voor een vervolg. Ik kan niet wachten, heb genoten van dit boek!"}, {"Review": "Peccato, mi viene da dire per prima cosa. Perché l’idea che è alla base de “Il tatuatore” non è male e l’autrice ha fatto davvero un ottimo lavoro di ricerca, per quanto riguarda la concia delle pelli e non solo, ma ci sono alcune leggerezze che, a mio avviso, guastano la forza della narrazione. Per prima cosa, una risoluzione troppo semplicistica quando si riesce a individuare il covo del serial killer e poi, un’incongruenza su orari e tempistiche nell’ultima parte del romanzo (non entro troppo nel dettaglio solo per evitare spoiler) che probabilmente poteva essere risolta in fase di editing. Peccato, perché a un lettore attento certi particolari non sfuggono e quando si tratta di un thriller, si sa, il lettore si fa ancora più attento.Un’altra cosa che mi ha lasciata insoddisfatta è stata una mancanza di spiegazione su alcune ripercussioni del passato di Marni sul presente. Dato che non credo ci sarà un seguito con gli stessi protagonisti, alcune domande rimangono senza risposta: chi ha giocato a Marni quei brutti scherzi? Chi è che vuole spaventarla?Peccato, dicevo, perché ci sono diverse cose de “Il tatuatore” che mi sono piaciute. Ho apprezzato moltissimo, per gusto personale ovviamente, il continuo cambio di punto di vista che offre la visione della storia da diverse angolazioni, e allo stesso tempo consente di conoscere meglio emozioni e sensazioni dei singoli personaggi, ognuno dei quali ha molto da raccontare.Ho trovato ben strutturate le parti in cui è il “ladro di tatuaggi” a parlare: le scene degli omicidi hanno descrizioni di forte impatto così come tutta la fase di lavorazione della pelle (non nascondo che in alcune momenti mi sono dovuta prendere una pausa…).Queste descrizioni sono narrate con una particolare cura del dettaglio e fa molta presa sul lettore anche il lato emotivo del killer, la sua rabbia, la sua frustrazione, il suo sdegno. I motivi vengono centellinati, lasciando al lettore il tempo per assimilare la sua storia per poi farsi sorprendere dal colpo di scena…Torno a ripetere peccato, perché ne “Il tatuatore” c’è dell’ottimo materiale e una scrittura che sicuramente ha del potenziale. Dato che Alison Belsham è una sceneggiatrice e questo è il suo primo romanzo, sono certa che in futuro sentiremo ancora parlare di lei."}, {"Review": "Removing tattooed skin with the victim still alive is definitely an original and rather gruesome method for a killer. I can only wonder at where the author got their inspiration from but it made for a good read. I didn’t care much for any of the police officers and they had a bit of a tv cop feel to them. Surely a DI should be delegating more. The bitchiness of the relationship between Rory and Francis seemed about right though. I was surprised at how much I liked Marni and she was definitely the standout character for me. I’m not convinced that the police would have shared so much information with her or allowed her to be so involved in the investigation but I suppose that’s the joy of fiction.Heartily recommended for readers who like rather dark crime."}, {"Review": "3.5 stars Il tatuatore è uno di quei libri che non so come giudicare. A lettura ultimata posso dire che la trama è interessante ed è proprio quello ad avermi attirata mentre la storia in sé è curata male e poco coinvolgente. In generale ho trovato il libro impersonale, i POV multipli mi hanno dato la possibilità di leggere una storia a più sfaccettature ma non mi ha permesso di legare con nessun personaggio in particolare. Marni Mullins è una tatuatrice e sta partecipando a un grande evento, in una pausa tra un tattoo e l’altro trova un cadavere in un cassonetto e procede con una denuncia anonima.Quello che sembra essere un caso isolato, si scopre essere il modus operandi di un killer: chiamato il collezionista di tatuaggi, esporta porzioni di pelle o parti del corpo per avere i tatuaggi disegnati che fanno parte della sua lista. Per il giovane ispettore Francis Sullivan questo caso rappresenta l’occasione giusta per conquistare fiducia e credibilità agli occhi dei colleghi più anziani. Nonostante la reticenza della donna, Marni darà un grande contributo all’ispettore per risolvere il caso mossa da un sentimento di protezione verso le persone del suo “mondo”. Oltre al POV di questi due personaggi sono presenti quelli del killer, questi sono i più intriganti e più forti con descrizioni di scuoiamento e concia della pelle. I suoi capitoli hanno la caratterizzazione psicologica che non ho trovato negli altri e che mi ha incuriosito nello scoprire la sua identità. A proposito di questa devo dire che non me l’aspettavo, la polizia sembrava sempre un passo troppo indietro al killer e non sono riuscita a cogliere gli eventuali indizi. Con questa trama avvincente avevo delle aspettative troppo alte che non sono state soddisfatte, la prima parte era troppo dispersiva, lenta per me tanto da farmi perdere l’interesse mentre verso la fine è troppo sbrigativa, quindi non ho trovato un giusto equilibrio che aiutasse la lettura. Un libro che ricorderò per la trama ma che dimenticherò u po’ troppo presto per il mancato coinvolgimento emotivo. "}, {"Review": "Sometimes a book comes along that is so clever that when you finish it you feel like you have been hit on the head with a brick, like in the cartoons you watched as a child. As you exhale a WOW and sit for a few minutes in the stunned awe. Replaying your favourite parts over and over in your head. A fantastic place to be may I say, it doesn’t happen a lot. So when it does, the book is truly magnificent. The Tattoo Thief is a debut novel by Alison Belsham. Set in Brighton, England. We meet two key characters Marni Mullins and Di Francis Sutton. When Marni discovers a murdered victim, their life’s become entwined in a way neither could imagine. The plot is genius and I don’t think I am giving much away, the clue is in the title. It includes a killer who is a thief of tattoos. A tattoo, something so personal and of course you would think once it was on your body, that was it a permanent addition. But this killer has other ideas.I loved the gory gritty descriptions and the unpredictability of the storyline. I was never bored and it was an extremely enjoyable read.Marni Mullins is my new favourite crime fiction crush. She is ballsy, tough, strong and underneath all that hard exterior has a beautiful heart of gold. It was refreshing to read about a female character who wasn’t afraid to speak her mind and who wasn’t feeble and girlie. I was as very lucky to hear the talented Alison Belsham read from The Tatto Thief at the Noir at the Bar Edinburgh event and hearing an author read from their own book is always special. But having Alison Belshams voice bring it to life was so delicious and moreish. I wanted to read it again.I loved The Tattoo Thief, if you are looking for something different to tantalise your crime fiction taste buds then buy it today. Let Marni Mullins into your life, you will be so glad you did."}, {"Review": "The Tattoo Thief is a unique police procedural with an interesting premise, albeit not one for the faint of heart and weak of stomach!The story has a gruesome opening and – be warned – is stomach-churning at times throughout. The killer’s narration is creepy and grim. From the start intriguing questions are raised about Marni’s backstory and her relationship with her ex-husband, Thierry, and the police.I must admit that, to start with, I didn’t really find any of the characters particularly likeable: Marni was prickly AF, Thierry only aggressive, Francis a bit wet, Rory smug and unpleasant and DCI Bradshaw a bit of a ranting cliche. However, as the story progressed, Marni and Francis both really grew on me and Rory and Thierry both developed to be much more three-dimensional.The plot here is original and the idea of someone murdering people for their tattoos is genuinely chilling. To begin with, I felt a little frustrated as we, the readers, knew more than the police and, with Bradshaw’s constant posturing, stonewalling and interfering, it felt like the police were running around in circles. Once the plot gets into its stride though, and the police catch up, the pace really picks up and I enjoyed the second half of the book even more.The tension increases throughout the investigation and there are some unexpected turns taken. The finale is particularly gripping; I was on the edge of my seat, racing through the pages to see how things would end up. I am presuming from the ending that there will be more to come in this series and I will be interested to see where Alison Belsham takes her characters next.Thank you to Orion Publishing for my copy of The Tattoo Thief."}, {"Review": "RECENSIONE SENZA SPOILERIl Tatuatore è il thriller d'esordio di Alison Belsham, finora dedita alle sceneggiature. In città avvengono diversi omicidi accumunati da un solo fattore: il killer rimuove parti del corpo tatuate. Sarà compito del neo-promosso ispettore Francis Sullivan, aiutato dalla tatuatrice dal passato turbolento Marni Mullins, risolvere il caso e dimostrare a tutti coloro che dubitano di lui il suo valore.Un thriller interessante, che si legge con facilità e che invoglia il lettore a proseguire la lettura per scoprire sempre più dettagli. Purtroppo i personaggi che andranno a influire sul finale del libro sono facilmente intuibili e il finale, seppur ben scritto, logico e interessante, mi ha lasciato con l'amaro in bocca. Le scene finali avvengono molto rapidamente rispetto al resto della storia, sarebbe forse stato meglio allungare un po' la parte finale del libro e renderla meno cliché (Classico salvataggio in stile principessa nel castello protetto dal drago). Il killer viene scoperto per un errore molto banale, non accettabile in un personaggio così preciso e attento ai dettagli.In generale un buon libro, forse non un \"capolavoro\" come viene definito da alcuni ma sicuramente un ottimo inizio per Belsham.Il libro è diviso equamente in capitoli di 5 minuti circa ciascuno, ognuno dei quali descrive la storia dal punto di vista di un personaggio differente tra Marni, Francis, Therry (l'ex marito di Marni) e Rory (collega di Francis). Questo ci permette di capire la storia vedendola da due mondi differenti, quello della polizia e quello dei tatuatori.I due protagonisti vengono coinvolti nella storia per due motivi differenti ma ugualmente validi, cosa che mi è piaciuta molto. Marni Mullins vuole proteggere il suo mondo, quello dei tatuaggi, dal Ladro di Tatuaggi mente Francis Sullivan deve risolvere a tutti i costi il caso per dimostrare il proprio valore e per poter far carriera. Sia Marni che Francis sono caratterizzati in modo ottimale, anche grazie alla narrazione multipla, ma i personaggi secondari sono lasciati un po' da parte. Non è del tutto un punto a sfavore, visto che ci si concentra maggiormente sui crimini e sui personaggi principali. Più spazio al thriller.Vi sono anche parti dove \"parla\" il killer. Sentiamo cosa pensa mentre uccide, mentre scuoia, descrive nel dettaglio i suoi metodi. Sono parti che ho trovato molto affascinanti e, secondo me, arricchiscono notevolmente la qualità del racconto.L'ebook si trova a soli 3 euro, un furto per un libro del genere. Consiglio vivamente l'acquisto a chiunque, io stesso non sono un grande divoratore di thriller ma ho apprezzato molto quest'opera.Sul mio blog (https://artedellalettura.blogspot.com) trovi altre recensioni. Una visita mi farebbe molto piacere :)"}], "Genre": "Crime", "ID": "35478973", "Desc": ""}