{"Genre": "Crime", "Reviews": [{"Review": "Full review hereSentence is Death starts with the murder of a divorce lawyer and Horowitz sets to write a second book of this case alongside working with Hawthorne. The victim had been threatened by a well-known, award winning and fiercely literary writer and his husband seems to be hiding things… Of course, there are also issues from the past that bubbles up in surface of the case. Who visited the victim before he died, and why is there a number on the crime scene? This was such a fun read, and"}, {"Review": "Hawthorne is back with his rather abrasive personality and his undoubted skill at finding clues and solving cases. Horowitz features again as himself acting as Hawthorne's sidekick attempting to solve not one but possibly two murders.Having the author actively involved in his own book makes for some interesting reading. Occasionally I sat back and wondered which bits were fact and which fiction, but in the end it really does not matter. The book is totally enjoyable and very easy to read. There"}, {"Review": "This is the 2nd novel in the Daniel Hawthorne, Private Investigator series by Anthony Horowitz.I have not read the 1st book 'The Word is Murder' nor in fact any other books by this author but quickly realised once I started this novel that times were going to change. I was so impressed and enjoyed reading this book that I had already purchased a couple of the authors other books before finishing it.For me the book had a feel of an older style of detective novel, maybe an Agatha Christie or more"}, {"Review": "Another witty crime book from Horowitz. If you liked The Word Is Murder, you will enjoy this one too. I thought it was better than the first, the case being more cohesive.There were convenient coincidences after all, but still an enjoyable read. "}, {"Review": "Anthony Horowitz never disappoints!Richard Pryce, a high profile divorce attorney, is murdered in his home, bludgeoned to death with a two thousand quid bottle of wine, which is strange in itself as the victim didn’t drink alcohol. Even stranger, written on the wall near the body are the numerals 182. What does the message mean? Hawthorne and Horowitz are called to investigate. As per usual I was hooked from the onset, and couldn’t put the book down. Interesting and engaging characters, a suspec"}, {"Review": "4.5 stars Once again (again), Horowitz does not disappoint. I can honestly say that I will read whatever this man writes because he has a way of writing that is so hard not to love. It’s impossible. Both Horowitz and Hawthorne are in this novel, and I just want to say that their partnership is a very weird one. I wouldn’t call them friends, but they aren’t so much acquaintances? It’s so hard to describe what they are but that’s the fun think about their partnership. In this novel, we are introdu"}, {"Review": "The Sentence is Death, the second novel to feature ex-policeman and Private Investigator Daniel Hawthorne, has an old-school, authentic atmosphere to it much like the crime classics of Agatha Christie and Arthur Conan Doyle. Horowitz focusses on mystery, suspense, intrigue and keeping it clean, rather than gratuitous violence or profanity, so if you like your reads clean, then this is a fantastic choice!Here, the author pairs up with Hawthorne to investigate the suspicious death of divorce lawye"}, {"Review": "3.5 stars rounded up.I very much enjoyed the first book and this one was also a good read. His style in this series is very chatty, like he is actually in the room telling you about his day. I’m still confused about how much of this is true.. thanks to Netgalley for an arc of this book."}, {"Review": "I adored, “The Word is Murder,” the first in the Daniel Hawthorne series, and was delighted to receive the second, “The Silence is Death,” for review. As before, Anthony Horowitz, or ‘Tony,’ as Hawthorne calls him, is very much telling the story as himself. Horowitz is working on a television series when the book begins, and Hawthorne’s reappearance is cleverly introduced – his arrival causing unintentional mayhem and annoyance. As before, Hawthorne is wonderfully irritating and yet has a bizarr"}, {"Review": " I've not read THE WORD IS MURDER, book one in this series, but I definitely want to after reading this one! To be honest didn't I know a damn thing about the story before I started to read/listen to this book (yes I tend to mix it when I have the chance, listen at work, read and listen at home). And to find that Anthony Horowitz has written two books with himself as a character was a great joy (such a fun idea). He's like Private Investigator Daniel Hawthorne's own Watson. Although, their worki"}, {"Review": "This is the second book in this series and I am really enjoying it. Love that the author narrates it and is a character in the books. High recommended!!"}, {"Review": "Anthony Horowitz better be a character in this book 😡😤"}, {"Review": "If you a) like a baffling mystery and b) you’re a fan of Hercule Poirot then c) it is dead certain this novel will please you.I didn’t know at first but The Sentence is Death is actually the second in a series following PI Daniel Hawthorne and the writer, Anthony. That’s exactly right, the author of this novel is also acting as a main character, following the PI around in order to write a book (this book) about him. This infusion of some veritable facts mixed with fiction made it quite an except"}, {"Review": "Book reviews on www.snazzybooks.com The Sentence is Death is another brilliant novel from one of my favourite authors, Anthony Horowitz. I particularly enjoy this series as it's definitely different from most other 'crime' novels; I love the self-aware style of writing. Anthony Horowitz writes as himself, having been employed to write three books about ex-Detective Hawthorne. This is the second - the first one being The Word is Murder, another great novel [read my review here] - and throughout A"}, {"Review": "For my full review click on the link below:https://crossexaminingcrime.wordpress..."}, {"Review": "Private Investigator Daniel Hawthorne returns in the sequel to The Word Is Murder. Once again he teams up with sidekick Anthony Horowitz (the author himself) and once again they are on the trail of a murderer.As with their previous adventure there is plenty of humour, most of it at the author's expense! I love the eloquent plotting & the nice mixture of what I feel must be the \"real\" Anthony Horowitz & the \"fictional\" one. However, what I like most is that this novel is quite simply Fun"}, {"Review": "I like Anthony Horowitz books and this one was pretty different to the others I've read. Basically it's more of a slow-burn mystery. More of an Agatha Christie or Sherlock, old-style detective story.The core mystery seems to be based on a true story, though it was difficult to understand whether the elements (letters, historical articles etc.) which were added in to the story, were actually 'real' or part of the fictional book (I found this lack of clarity annoying, though perhaps it was my lack"}, {"Review": "Immensely enjoyable and very clever crime thriller in which the author plays a most unusual role. Every bit as good as The Word Is Murder. Roll on book 3. Review to follow shortly on For Winter Nights."}, {"Review": "Horowitz has kept the promise he created in his first book in this series, alive and well in the second one. My only sadness is that I have no more Daniel Hawthorne to read at the moment and must wait for 'Tony' to write some more.The way he mixes up reality and fiction has me with my finger on my kindle and another on my search engine checking things out. Me, another Sherlock in the making.Now to the story. Horowitz gives the clues then he does his utmost to confuse you and make you forget them"}, {"Review": "My first five-star-book in 2019 and I absolutely loved it!The story is gripping, I had no clue who the murderer was throughout the book but in the end it all made perfect sense, just how a good detective story should be! I don't know why but I just love the way Anthony Horowitz tells a story."}, {"Review": "Visit the London locations in the novelI remember the feeling I had when I read the first of the novels where Anthony H appears as a character in his own novel. Wow I thought, did that just happen? Well it did and this is a second one just as good as the first with a twisty tale of intrigue.It's a fascinating angle for a book as Horowitz writes of his issues of waiting around on film sets, how writers might be on a film set . As the book opens he is - on the set of Foyle's war no less when Micha"}, {"Review": "I wanted to like this more than I actually did as I think Mr Horowitz is a fine author. Sadly this felt like a rehash of the previous book in the series. Having said that, if you'd come to this book cold and read it as a standalone, it would be perfectly fine so perhaps I'm being overly critical.The whole DI Grunshaw subplot, however, was unnecessary and a bit ridiculous."}, {"Review": "If you’ve not read The Word is Murder yet then I highly recommend you do so before starting this book. The narrative is so unexpectedly crafted that I don’t think you could just jump into book 2 of this series without reading the first book to feature Hawthorne, a unique detective who could give Sherlock Holmes a good run for his money any day of the week!Once again a baffling murder case means the police call in Private Investigator Daniel Hawthorne and he takes along his partner in crime, the"}, {"Review": "A captivating whodunnitThis is the latest and second in the Daniel Hawthorne series. I haven’t read the first but this in no way detracted from my enjoyment of this novel. Hawthorne has been brought in to investigate the murder of Richard Pryce, a high profile (and expensive) divorce lawyer whose throat has been slashed by a broken bottle of very expensive wine. His capacity in investigating the crime is a little vague, but it is crystal clear that there is no love lost between him and the senio"}, {"Review": "This is the second book in Horowitz’s Hawthorne series. It’s not absolutely necessary to read the first book, The Word Is Murder, before this one, but I would strongly recommend it. That’s in part because this series has an unusual premise that’s explained in more detail in the first book. The premise is that Anthony Horowitz, the author, is writing a fictional series in which Hawthorne is a sort of a downmarket Sherlock Holmes-ish genius, with Horowitz himself acting as Hawthorne’s Watson. Not"}, {"Review": "Once upon a time, there was a woman scrolling down her Twitter feed. Her heart missed a beat when she spotted a cover. You know all about cover love, don’t you? Well, The Sentence Is Death proudly wore her favourite colour, so the woman clicked on the link and discovered a very interesting blurb. Then, something wonderful happened. The kind book fairy Sarah Harwood offered to send the woman a copy of this beautiful book in exchange for an honest review. This post is a thank you and a have a wond"}, {"Review": "I read this book through The Pigeonhole, a free online book club and read it with other readers on the web. It was split into 10 parts, called staves, that I read through the nifty Pigeonhole App. I was able to leave comments throughout and interact with the other readers.Even though this is the second book in the Daniel Hawthorne series, this was my first outing with the author and his detective acquaintance, and I really enjoyed it.I’d recently heard the author on the Simon Mayo’s Books of The"}, {"Review": "I enjoyed The Sentence Is Death – probably rather more than its predecessor The Word Is Murder. It can be read as a stand-alone book, but it may help to set the background if you read The Word Is Murder first.Anthony Horowitz, narrating as though these events really did happen to him, is again roped in to “help” and write the story of the enigmatic ex-detective Hawthorne as the police call him in to assist with the investigation of the murder of a divorce lawyer in his Hampstead home. Needless t"}, {"Review": "Horowitz and his detective muse Hawthorne investigate the murder of a divorce lawyer. I love this series and it's rather reminiscent of Conan Doyle. Hawthorne is at times both infuriating and intriguing and the mystery soon sweeps you into the middle of it."}, {"Review": "Read in a day.Testament to this great author. The clues are there - you just have to see them!"}], "ID": "39913740", "Name": "The Sentence is Death"}