{"Genre": "Fantasy", "ID": "5907", "Name": "The Hobbit or There and Back Again", "Reviews": [{"Review": "Some books are almost impossible to review. If a book is bad, how easily can we dwell on its flaws! But if the book is good, how do you give any recommendation that is equal the book? Unless you are an author of equal worth to the one whose work you review, what powers of prose and observation are you likely to have to fitly adorn the work? 'The Hobbit' is at one level simply a charming adventure story, perhaps one of the most charming and most adventurous ever told. There, see how simple that was? If you haven't read it, you should, because it is quite enjoyable. At some level, there is little more to say. Enjoy the story as the simple entertainment it was meant to be. Read it to your children and luxuriate in the excitement and joy that shines from their faces. That's enough.But if it was only simple entertainment, I do not think that it would be anything more than just a good book. Instead, this simple children's story resonates and fascinates. It teases and hints at something larger and grander, and it instructs and lectures as from one of the most subtle intellects without ever feeling like it is instructing, lecturing or being condescending.At its heart, the complaint I opened the review with is just a variation on one of the many nuanced observations Tolkien makes in 'The Hobbit' when he complains that a story of a good time is always too quickly told, but a story of evil times often requires a great many words to cover the events thereof. How often has that idea fascinated me.Consider also how the story opens, with Bilbo's breezy unreflective manners which are polite in form but not in spirit, and Gandalf's continual meditation on the meaning of 'Good morning.’ How much insight is concealed within Gandalf's gentle humor! How often do we find ourselves, like Bilbo, saying something we don't really mean and using words to mean something very unlike their plain meaning! How often do we find ourselves saying, \"I don't mean to be rude, but...\", when in fact we mean, \"I very much mean to be rude, and here it comes!\" If we did not mean to be rude, surely we wouldn't say what we say. Instead we mean, \"I'm going to be rude but I don't want you to think I'm someone who is normally rude...\", or \"I'm going to put myself forward, but I don't want you to think of me as someone who is normally so arrogant...\", or even, \"I'm going to be rude, but I don't want to think of myself as someone who is rude, so I'm going to pretend I'm not being rude...\"I think that is what makes this more than just a good book, but a great one. Tolkien is able to gently skewer us for our all too human failings, and he does so without adopting any of the cynicism or self-loathing so common with those that seek out to skewer humanity for its so evident failings. We fantasize about heroes which are strong and comely of form, and we have for as long as we've had recorded literature. Our comic books are filled with those neo-pagan mythic heroes whose exaggerated human virtues always amount to, whatever else may be true of them, 'beats people up good'. These modern Ajaxs, Helens and Achilles dominate the box office, and I would imagine dominate our internal most private fantasy lives as well. Oh sure, the superhero of our fantasy might have superhuman ethics to go along with his superhuman ability to kick butt, attract the opposite sex, and enforce their will upon others, but it is always attached to and ultimately secondary to our fantasy of power and virility. How different is Tolkien's protagonist from Heracles, Lancelot, Beowulf, or Batman - short, small, mundane, and weak. Of all the principal characters of the story, he possesses probably the least of that quintessential heroic attribute - martial prowess.And yet, he is not actually merely an 'average Joe'. Bilbo is just as much an exaggerated idealized hero as Heracles, it's just that those attributes in which Bilbo is almost transcendently inhuman isn't the sort of attributes we normally fantasize about having ourselves. Bilbo is gentle. He is simple. He is humble. Power and wealth have little attraction for him. He is kind. He takes less than his share, and that that he takes he gives away. He is a peacemaker. Though wrongly imprisoned, he bears no grudge and desires no vengeance for the wrongs done to him. Rather he apologizes for stealing food, and offers to repay in recompense far more than he took. Though mistreated, he harbors no enmity. He never puts himself forward, but he never shirks when others do. How often do we fantasize about being this different sort of hero, and yet how much better we would be if we did? How much better off would we be if we, like Thorin could declare in our hearts, \"There is more in you of good than you know, child of the kindly West. Some courage and some wisdom, blended in measure. If more of us valued food and cheer and song above hoarded gold, it would be a merrier world.\" How often is it that we hunger after all the wrong things? What profit would we really have if we had in great measure the power to 'beat people up good'? What real use could we put it too? How much better off would we be individually and as a people if we most desired to be graced with Bilbo's virtues, rather than Achilles speed, strength, and skill with arms? How much less mature does this mere children's book of a well lit-world cause our darker fantasies to seem?Now, I admit I am biased in my review. I read this book 36 times before the age of 16. I broke the spines of three copies of it with continual reading. Yet in my defense I will say that I'm considered only a moderate fan of the book by many. I've known several devotees of the book who, like the protagonist of Bradbury's 'Fahrenheit 451', can recite whole chapters from memory - ensuring that this would be one of the few books that would survive the sudden destruction of all the world's technology if only the world's story tellers survived. If you are inclined to think no book can be that good, and that my review overhypes it, so much the better. Go in with low expectations so as to be certain that they will be met or exceeded. Forget all I have said save that, \"If you haven't read it, you should, because it is quite enjoyable.\""}, {"Review": "Dear Tolkien fans: please don't leave a comment if you're going to spew hatred - I'll just delete it. I'm glad you enjoy Tolkien's work, but I am actually allowed to feel this way, no matter how scandalous you find that idea. Thank you.\nTo be fair, it really is a cool story. Mr Tolkien’s imagination is endless and I respect him immensely for that. To be able to conjure a whole new, magical world and all these creatures in it.. absolutely amazing. But it is also a very long-winded story and I found myself struggling to get the job done. Reading is not supposed to be a job; it’s supposed to be fun and relaxing. For me, The Hobbit was not an engaging story – I was distracted constantly and kept missing paragraphs. The story in itself is pretty great, but the way it is told makes the magic disappear. I am not quite sure how to explain. Maybe it was the way it was written, or the fact that they take a long time before anything happens. I should also mention the highly anticlimactic end of Smaug, and the fact that I can’t tell any of the dwarves apart. And the songs! Dear Merlin, the songs! I felt like I was in a ruddy musical.I’m sad that I didn’t like it as much. I wish I did. In any case, still a cool story."}, {"Review": "\nIn a hole in the ground there lived a hobbit.\nBooks exist in time and place and our experience of them is affected by the specific time and place in which we encounter them. Sometimes an uplifting or inspiring book can change the path of a life that has wandered onto a wrong course. Sometimes a book, discovered early on, can form part of the foundation of who we are. Or, discovered late, can offer insight into the journey we have taken to date. Sometimes a book is just a book. But not The Hobbit. Not for me. In January, 2013, I pulled out my forty-year old copy in anticipation of seeing the recently released Peter Jackson film. It is a substantial book, heavy, not only with its inherent mass, but for the weight of associations, the sediment of time. The book itself is a special hard-cover edition published in 1973, leather bound, in a slipcase, the booty of new love from that era. The book, while victim to some internal binding cracks (aren't we all?) is still in decent shape, unlike that long-vanquished relationship. Not surprising. I had read the story six times and been there and back again with this particular volume five. J.R.R. Tolkien - image from Vision.orgThe Hobbit had first come to my attention in 1965 or '66. I was then a high school underclassman, and my eyes were drawn to it at a school book fair. That was probably the ideal age, for me anyway, to gain an introduction to Tolkien. Not too far along into adolescence and an appreciation of the reality of the world to have completely tarnished my capacity for child-like wonder. That is what one must bring to a reading of this book, openness and innocence. Tolkien was a step sidewise for me, as I was a fan of the science fiction of that and prior eras. It was also, of course, a gateway drug for the grander addiction of LOTR, still my favorite read of all time. One might think that looking at this book again with old, weary fresh eyes might lend new insight. After all, I have read literally thousands of books since, and have picked up at least a little critical capacity. And yes, there are things I notice now that perhaps skipped past back then. Of course that begs a specification of which back then one considers. While I first read the book as a high-schooler, I read it again when I was gifted with this beautiful volume, in my twenties. That makes two readings. But there would be more. I well recall reading the book aloud while sitting in a chair by my son's bed. And yes, each of the major characters was delivered with a distinct voice. I went as deep as I could for Gandalf. I vaguely recall giving the dwarves a Scottish burr. Bilbo was definitely a tenor. My Gollum was remarkably like the sound of the one created by Andy Serkisssssss. (patting self on back). Of course, my son was not the last to arrive at the gathering. Some years later there was a daughter, and more bedside theater. It was a bit more of a struggle then. Life was rather hectic. Nerves were often frayed. Sleep was in short supply. And there were far too many times when my eyes closed before those of my little gingersnap. But reading it that fourth time, one couldn't help but notice the absence of any significant females. Who might my little girl relate to here? It is certainly possible for folks to identify with characters of another gender, but the stark absence of representatives of the female persuasion did stand out. Somehow I managed to keep my eyes open long enough to get through the volume.But the party was not yet complete. There would be one more arrival, and one more opportunity to sit on or near a daughter's bed and read aloud, sometimes to an upturned, eager face, sometimes to a riot of ringlets as she settled. My capacity for consciousness remained an issue. By then, my voice had also suffered a bit with the years, the reward for too many cigarettes, too much yelling, too much ballpark whistling, and the usual demise of age, so it took a fair bit more effort and strain than reading it aloud had done previously. I am pretty certain I made it through that third time aloud. Truthfully, I am not 100% certain that I did.You probably know the story, or the broad strokes anyway. In the quiet rural village of Hobbiton Across the Water, in a land called Middle Earth, an unpresupposing everyman, Bilbo Baggins, lives a quiet existence. He has a smidgen of wanderlust in him, the genetic gift of ancestors on the Took branch of his family tree, but he is mostly content to enjoy hearty meals and a good pipe. One day, Gandalf, a lordly, father-figure wizard Bilbo has known for many years, comes a-calling and Bilbo's life is upended. Gandalf is helping a group of dwarves who are on a quest. Led by Thorin Oakenshield, a dwarf king, they aim to return to their home, inside the Lonely Mountain, somehow rid the place of Smaug, the dragon who has taken up residence, and regain the land and incredible treasure that is rightfully theirs. Gandalf has recommended that Bilbo accompany the group, as a burglar. Bilbo, of course, has never burgled a thing in his life, and is horrified by the prospect. But, heeding his Tookish side, Bilbo joins the dwarves and the adventure is on. One need not go far to see this as a journey of self-discovery, as Bilbo finds that there is more to him than even he realized. This raises one question for me. How did Gandalf know that Bilbo would be the right hobbit for the job? Bilbo faces many challenges and I betray no secrets for any who have not just arrived on this planet by reporting that Bilbo's dragons, real and symbolic, are ultimately slain and he returns home a new, and somewhat notorious hobbit. Bilbo serves well as the everyman, someone who is quite modest about his capacities, but who rises to meet the challenges that present, acting in spite of his fear and not in the absence of it. He is someone we can easily care and root for. Elements abound of youthful adventure yarns, treasure, a map to the treasure, a secret entrance that requires solving a riddle to gain entry, a spooky forest, foolishness and greed among those in charge, a huge battle, and, ultimately, good sense triumphing over evil and stupidity. Oh, yeah, there is something in there as well about a secret, powerful ring that can make it’s wearer invisible. Sorry, no damsels in distress.(Rivendell remains a pretty special place. If I am ever fortunate enough to be able to retire, I think I would like to spend my final days there, whether the vision seen by Tolkien or the Maxfield Parrish take as seen in the LOTR films.)There are magical beings aplenty here. Hobbits, of course, and the wizard and dwarves we meet immediately. A shape shifting Beorn assists the party but remains quite frightening. There are trolls, giant spiders, giants, goblins, were-wolf sorts called wargs, talking eagles, a communicative, if murderous dragon, elves of both the helpful and difficult sorts, and a few men, as well. Then there is Gollum.IMHO, Bilbo is not the most interesting character in Tolkien's world. Arguably there is a lot more going on with Gollum, an erstwhile hobbit riven by the internal conflict of love and hate, corrupted, but not without a salvageable soul. While he is given considerably more ink in the LOTR story, it is in The Hobbit that we meet him for the first time. He is the single least YA element in this classic yarn, one of the things that elevates this book from the field and makes it a classic. The Hobbit was written before Tolkien's ambitious Lord of the Rings. While there are many references to classic lore, the bottom line is that this is a YA book. It is easy to read, and to read aloud, (something that is not the case with LOTR. I know.) and is clearly intended for readers far younger than I am today. It remains a fun read, even on the sixth (or so, I may have dipped in again somewhere along the line) time through. Were I reading it today for the first time, I would probably give it four stars. But as it bears the weighty treasure of memory and fond association, I must keep it at five. If you are reading this for the first time as an adult, or an antique, the impact is likely to be different for you. If you are a younger sort, of the adolescent or pre-adolescent persuasion, particularly if you are a boy, it might become an invaluable part of your life. Maybe one day you can sit by your child's or grandchild's bedside and be the person who reads these words to them for the first time, \"In a hole in the ground there lived a hobbit\" and begin the adventure again. To see the glowing young eyes as the tale unfolds is nothing less than absolutely precious.PS – I would check out the review offered by GR pal Ted. He includes in his review outstanding, informative and very entertaining excerpts and comments re info on The Hobbit from JRRT's son Christopher. ==============================EXTRA STUFFHere is a lovely article on JRRT, from Smithsonian Magazine, January 2002In comment #32, below, GR pal Rand added a link to a reading of the entire book by Nicol Williamson. It is just the thing for bedtime, yours or your child's. Adding it here was done with Rand's kind permission."}, {"Review": "There are some days when I actually think that the humble Hobbit is superior to it's bohemoth brother, \nThe Lord of the Rings\n. It's a much tighter story, and Bilbo is a much more appeal character than is Frodo. I also just love this poem, from The HobbitFar over the misty mountains coldTo dungeons deep and caverns oldWe must away ere break of dayTo seek the pale enchanted gold.The dwarves of yore made mighty spells,While hammers fell like ringing bellsIn places deep, where dark things sleep,In hollow halls beneath the fells.For ancient king and elvish lordThere many a gleaming golden hoardThey shaped and wrought, and light they caughtTo hide in gems on hilt of sword.On silver necklaces they strungThe flowering stars, on crowns they hungThe dragon-fire, in twisted wireThey meshed the light of moon and sun.Far over the misty mountains coldTo dungeons deep and caverns oldWe must away, ere break of day,To claim our long-forgotten gold.Goblets they carved there for themselvesAnd harps of gold; where no man delvesThere lay they long, and many a songWas sung unheard by men or elves.The pines were roaring on the height,The winds were moaning in the night.The fire was red, it flaming spread;The trees like torches blazed with light.The bells were ringing in the daleAnd men looked up with faces pale;The dragon's ire more fierce that fireLaid low their towers and houses frail.The mountain smoked beneath the moon;The dwarves, they heard the tramp of doom.They fled their hall to dying fallBeaneath his feet, beneath the moon.Far over the misty mountains grimTo dungeons deep and caverns dimWe must away, ere break of day,To win our harps and gold from him"}, {"Review": "From a hole in the ground came one of my favorite characters of all time, the very reluctant and unassuming hero, Bilbo Baggins. As a child, The Hobbit sparked my young imagination, causing wonderful daydreams and horrible nightmares. As a teen, the book made me want to become a writer of fantastical tales...or go shoeless, live in a hole and smoke a pipe. As an adult, Tolkien's novel maintains within me a link to my childhood, safekeeping cherished memories and evoking everlasting emotions. The troubles with trolls, those slinking spiders, the finding of treasure, cave exploration, riddles in the dark...it all added up in me a love for adventure. I would make many an ornate wooden sword in my father's basement workshop, because of Sting. Funny I didn't take to wearing rings though...Being pint-sized, Mr. Baggins makes the perfect magnetic character for a young person. He is about a child's size, yet he is mature. Similar, yet something to aspire to. His diminutive stature made his implausible escapes and victories that much more satisfying. Nothing bores me more than muscle-bound killing machines wielding swords the size of windmill blades. I have read this fantastic tale a number of times, watched the 70s cartoon movie version countless times and was counting down the days with unabashed eagerness until Peter Jackson's new live action film came out. I will continue to read The Hobbit again and again, for the road goes ever, ever on...Appendix-ish type reviewsThe Hobbit, the 1977 animated film version by Rankin & BassThis may be the movie I've watched the most in my life. This is the one I can quote from start to finish and annoy the fuck out of my friends. I try to refrain, but when John Huston bellows out, \"I am Gandalf and Gandalf means ME!!!\"...well, I just can't help myself. Crazy-off-his-rocker Brother Theodore as Gollum still astounds me with the sheer depth of his guttural growl. Sorry voice-straining Serkis, but this is the real Gollum, the creepy muthah that kept me up nights. Though Rankin & Bass's version skips over the whole Beorn scene entirely, coming in at 90 minutes, they actually managed to pack in quite a bit of story. Certainly it is truncated (to absurdity during The Battle of Five Armies), but at least it's not overblown, as appears to be happening with Peter Jackson's unnecessarily long trilogy of this single book. The Hobbit, or There And Back Again (An illustrated book by Rankin & Bass)Though it's a few pages shorter than the regular paperback version, this marvelous part-text, part-illustrated version seems to be unabridged. It includes screenshots taken directly from the 70s cartoon, plus where the movie skipped over parts of the book they've included extra illustrations, admittedly of mixed quality. It's a little strange to see the same characters rendered differently sitting side by side......but nonetheless, it's always fun to see how artists interpret the work, especially when it's a work dear to your heart.The Hobbit, a film version by Peter JacksonIt's never fun to see an artist tear the heart out of a work. Peter Jackson was given too long a leash when New Line stretched this one book out to three separate movies. Instead of one movie packed with awesome, we get three that, so far (I've yet to see the third and I'm not eager to), have been watered down and dragged out. Extra scenes are added and add nothing: Really, a sleigh ride chase scene with an incredibly minor character? And honestly, can Richard Armitage (as Thorin Oakenshield) act with any other part of his body besides his eyebrows?"}, {"Review": "To call this the epitome in which all high fantasy should be judged does not quite suffice; this is simply one of the best books that has ever been written or will ever be written. The Hobbit defines the high fantasy genre along with its sequel, of course, and has been an inspiration to countless authors and readers alike. Tolkien, quite literally, kick started a genre that would eventually capture the hearts of thousands of people. He changed the literary world. He made fantasy real. The best fantasy universe ever createdMiddle Earth is undoubtedly the best fantasy universe created. It is the most original and richly devised. It is very hard for fantasy authors not to borrow elements from Tolkien. He set the definition with his wonderful world. Tolkien’s references to modern day are also very amusing and almost unnoticeable in the brilliant narrative, but a perceptive reader will notice the whimsical contrasts he has drawn between his world and the real world. The sheer depth of Tolkien’s imagination is really unmeasurable. I wonder what other ideas for books he may have had that he never got to write. “The road goes ever on and on”Bilbo, like the reader, is blown away by the breath-taking landscape of Middle Earth. We must remember that he too is experiencing the majesty of Rivendell and the mightiness of Erabor for the first time. His reaction reflects a reader who is also awestruck by a world that is as beautifully magical as it is corrupt and wicked; it is a world in which both the benevolent and the malignant reside; it is a world whose people are capable of both great kindness and equally as great cruelty. The peoples are diverse and contrasting; I think the differences between the elves and the dwarves are best captured in their music. The music of the elves is full of mirth and is generally quite playful whereas the music of the dwarves is strong, deep and full of resolve to match their stubborn nature. The wonderful, wonderful, storyThis story belongs to Bilbo Baggins. This is something I think Peter Jackson would do well to remember, but that’s beside the point. The tale begins as Bilbo accidently, unexpectedly, invites Gandalf for tea the next day after a brief encounter. The Wizard marks him as the fourteenth member of his company, his burglar. Bilbo doesn’t really understand what he is getting himself in for when he agrees to join their mission. Indeed, the next evening thirteen dwarves, headed by Thorin Oakenshield, arrive along with their quest to reclaim their gold and slay a dragon: Smaug. Smaug has stolen their home fortress of Erebor. They want it back. Bilbo reluctantly gets dragged along though this reluctance is quickly overcome by a strong, secret, desire for adventure. “I am looking for someone to share in an adventure that I am arranging, and it's very difficult to find anyone.' I should think so — in these parts! We are plain quiet folk and have no use for adventures. Nasty disturbing uncomfortable things! Make you late for dinner!”The story becomes darker as they close in on the mountain. The company are attacked by spiders and abducted by the wood elves who want a share of the dwarfish treasure. The dwarves begin to rely on their burglar who they believed would become a liability. How wrong they were. Bilbo was destined to come along. They would have surely failed if he had not, and the ring of power may never have been destroyed. But, that’s another wonderful story. The game of riddles and the finding of the ring is one of the more memorable scenes of the book and is Bilbo’s gateway into heroism. I think the power he receives from the ring helps him to discover that not only does he have courage and fortitude, but he has lots of it. Gandalf, if anything, is an excellent judge of character. The ending is just the beginning The ending of this book is undeniably rushed. Bilbo is unconscious for most of it, and we receive a post battle update. There are off page deaths and victories. In this, I think Tolkien cements the message of the story; it is not about the tragic death of a dwarf who went slightly mad, and then redeemed himself; it is not about a boatman who slayed a dragon, and became a renowned hero: it is about a Hobbit. This is Bilbo’s story and no other's. It is a story in which a Hobbit who had no courage and no bravery found it. It is a story about a hobbit who was too scared to leave his house without a hanky eventually evolved into a Hobbit that would trick a dragon.“You have nice manners for a thief and a liar,\" said the dragon.”It also sets the readership up for a sequel. If Tolkien focused too much on the dwarfish storyline at the end then the focus of the story would have appeared different. It may have shocked the reader that the sequel was about more Hobbits and not about the Dwarves. This, again, is something Peter Jackson did not realise. I know this is a book review of the Hobbit, but what better place than here to share my distain for that terrible trilogy that Jackson recently farted out? This is Bilbo’s story, not Thorin’s and certainly not Legolas’. This book is called the Hobbit not the hobbit, the dwarf and that elf with the cool sword. “In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.”Furthermore, I read this first when I was twelve years old and again now. I am not sure at which time I enjoyed it the most! This is a book that I will read many more times in my life and it is also book that I will never stop enjoying, no matter how many more times I read it. Also if you like this book as much as me I recommend reading The Art of the Hobbit. I think this captures Tolkien’s vison of Middle Earth more than any artist or movie maker ever could. Alan Lee’s work is more artistic, but Tolkien’s is from the most original source: himself. Five stars. I think you know why. The original cover of the Hobbit, as painted by Tolkien:"}, {"Review": "I probably won't write a full review here, as this is just a reread for me, but I found this just as enchanting as the first time I read it. While I still like this one only SLIGHTLY less than The Lord of the Rings, I'm glad I took the opportunity to read this first before diving into a reread of LOTR this year. When I first read Tolkien's books about 15 years ago I didn't experience The Hobbit until I finished LOTR, so it gave me the feeling of being able to read this one as an introduction to the latter book. Highly recommended to anyone who may not have read this yet; Tolkien's world building and storytelling skills are rarely matched and aimed for all ages. "}, {"Review": "Maybe one day soon I'll write a proper review of The Hobbit.In the meantime, I want to say this:If you are a child, you need to read this for Gollum's riddles.If you are an adult, you need to read this book to children (if you don't have children, rent borrow some) for at least one opportunity to roleplay Gollum.Becuz \nGOLLUM ROOOLZ!!!!!\n \nSee here, he even won an award!!\n (PS. Since Gollum features so strongly in this review, \nhere\n is an interesting video on the acting and CGI genius that went into the making of the screen Gollum.)Of course the most compelling reason to add this to your reading list in haste is that it's coming to the MOOVIEZZZ!! (Update: commentary on the moviez below).Btw, if you like kickass fighting elves, not to mention pretty kickass she-elves and some sizzling elf/dwarf romance--well, then you might like the second Hobbit movie more than the book... ahem!Part 3 coming to a cinema house near you soon(-ish). My PRECCIOOOUUSSSSS!...and soon I'll have a copy of the all the moviez, and they will be me MINE, all mine, just like my precciousss illustrated copies of the novel.Ha, you didn't think one copy would be enough did you??If you get around used bookstores a lot, do look out for an illustrated version of the book!Update: About the 3 films by Peter Jackson: I didn't find the first 2 films very memorable. He seemed to draw it out almost unbearably, and it also felt to me as if he was embellishing the original story a bit. The whole thing seemed like actiony rubbish, though I personally actually quite enjoyed the swinging, shooting, swordfighting ninja elves and the bit of romance.But the THIRD film, The Battle of the Five Armies , now -that- was a good one. I almost missed it on the big screen because of the mediocrity of the first two films. But I was glad, oh so glad that I actually did go and see it. The cinematics, acting and editing was all very well done, but it was the screenwriting and directing that really shone. Here we saw a story of courage and cowardice; of generosity; of greed and avarice; of greatness of soul and of smallness of soul; of love; of selflessness; of brotherhood; of hatred; of humanity; of pain; of sacrifice; of struggle; of moral and spiritual victories; of sadness and loss, but above all, of triumph of the soul.Yes, The Battle of the Five Armies  is certainly something that does Tolkien justice at the very least, and what a joy it was to behold on the big screen. :)PS. The movies also taught us that dwarves CAN be hot!"}, {"Review": "What makes The Hobbit such a seminal work in the fantasy genre? Is it the nine hours of over-budget, sensorially explosive movies by Peter Jackson? Nope. Is it a complex tale of multiple human kingdoms slaughtering each other for an Iron Throne with buckets of blood and guts and plenty of sex? Nope. Is it simply wonderful writing. As simple and boring as that. Does that mean that I was incredibly disappointed in the movie adaptation (not to say abortion)? Yep. Does that mean I don't love Game of Thrones (books and TV shows)? No, they are great too. But the seminal work, the Divine Comedy that created the language and inspiration for George R.R. Martin as Dante created Italian from the common vernacular in Florence and Ravenna, was The Hobbit. The book, even for a slow reader is most likely able to be finished in 1/3 the time that Peter Jackson spent telling the story in 70mm film. Unlike Peter Jackson's version, there are no orcs and the element of danger is more psychological than psychical: Bilbo Baggins is battling his fears and his provincialism and growing up. The Hobbit should be read as the Odyssey of Middle Earth - a voyage of self-learning and maturation that is more about the monsters in Bilbo's imagination than those encountered in his baptismal voyage into the unknown with Gandalf. Gandalf. Honestly, would there EVER have been a Dumbledore had there not been a Gandalf? Did any Tolkien reader not NOT picture Gandalf when Rowlings talked about Gandalf in the first Harry Potter book? Bilbo does encounter some monsters and even outsmarts Smaug the Dragon (wow, I mean what a perfect name for a dragon! More evocative than Drogon, Rhaegal, and Viserion in my opinion - and again would they even have existed had Smaug not preceded them?) and he saves Middle Earth before returning to the Shire. He is not the same person he was before leaving. He is Ulysses without a Penelope waiting for him (unless his pipe is secretly called Penelope in his expanded imagination). In literature, there is nothing quite like the Hobbit in its simplicity and beauty and its symbolic voyage: we are of course introduced to the elves, the humans, the dwarves...but they are all on the outskirts of the story. The Hobbit is about one small hobbit fighting his greatest fears...and winning."}, {"Review": "610.\tThe Hobbit = There and Back Again, J.R.R. TolkienThe Hobbit, or There and Back Again is a children's fantasy novel by English author J. R. R. Tolkien. It was published on 21 September 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction. The book remains popular and is recognized as a classic in children's literature.عنوان: هابیت - آنجا و بازگشت دوباره؛ جی.آر.آر. تالکین؛ ادبیات فانتزی انگلستان برای نوجوانان؛ تاریخ نخستین خوانش: ماه نوامبر سال 2004 میلادیمترجمین هابیت: رضا علیزاده؛ نازنین پوریان؛ سپیده حبیبی؛ فرزاد فرید؛ شاهده سعیدی؛ پریا آقاسی بیگ؛ ماه منیر فتحی؛نمیدانم چندبار این هابیت را خوانده ام، همیشه تا نام بیلبو را میشنوم پرواز میکنم، لابد شمایان هم فیلمش را دیده ایدهابیت‌ها گونه‌ ای از موجودات خیالی در رمان‌های تالکین هستند که در سرزمین میانه و شایر زندگی می‌کنند. هابیت‌ها نخستین بار در کتاب هابیت تالکین مطرح شدند. شخصیت اصلی این داستان، بیلبو بگینز هابیتی ست که ماجراهایی دارد. شخصیت اصلی مجموعه ی ارباب حلقه‌ ها، فرودو بگینز نیز یک هابیت است. در کتاب هابیت، تالکین هابیت‌ها را موجوداتی کوچک توصیف می‌کند که نصف قد انسان را دارند، لباس‌هایی به رنگ روشن می‌پوشند، کفش به پا نمی‌کنند (کف پاهایشان به طور طبیعی پوستی چون چرم دارد) و پاهایشان پوشیده از موهای ضخیم و مجعد است. از نظر اخلاقی تالکین هابیت‌ها را موجوداتی خوشرو، خوش خوراک و به دور از ماجراجویی توصیف می‌کندباد در خلنگ زار ِ پژمرده میوزیداما در جنگل هیچ برگی بر درخت نمیجنبیدشب و روز سایه آنجا را گرفته بودو موجودات اهریمنی خاموش به زیر درختان خزیدندباد از کوهستان سرد وزیدن گرفتو همچون موج غرید و غلطیدشاخه ها آه کشیدند و جنگل نالیدو برگ درختان بر روی خاک ریختباد از غرب راه شرق در پیش گرفتو هر جنبشی در جنگل فرومرداما رها شد صدای زوزه اشخشن و گوشخراش در سرتاسر مردابهیس هیس علف ها برخاست، و منگوله هاشان خم شدجگن ها به خش خش درآمدندبر روی آبگیر پر موج، و زیر آسمان سردآنجا که ابرهای پرشتاب، پاره پاره شکافتندبر تنها کوه برهنه گذر کردو برفراز کنام اژدها وزیدآنجا سیاه و تاریک، افتاده بود تخته سنگهای بی روحو دودی به هوا برخاستجهان را وداع گفت و به آسمان پرگشوداز فراز دریاهای پهناور شبانهماه برفراز تندباد بادبان کشیدو اخگر ستاره ها در برابر دم آن برافروختص 190 و 191 کتاب. ا. شربیانی"}, {"Review": "Now I don't remember all the names of those 13 dwarfs, but still I can legitimately say I enjoyed the book. The Hobbit (the version rewritten by Tolkien) is sophisticated enough to please adults and children alike.Initially, nobody knew how Gollum looked like. Seriously, just take a look at the various covers of the book and you'll see diverse bodies as Gollum. The Ring acquired by Bilbo is so quaint, so practical.Tolkien weaved his magic here and delivered a timeless classic. The adventures of Bilbo, especially those without Gandalf to bail him out, are very original. I hope the uninitiated don't get deterred by the movie trilogy. That would be a tragedy. I give this book a perfect five stars."}, {"Review": "Gosh, that last chapter. Sigh.And you can start celebrating the updates are over. Now let's start LotR :)Buddy read with Jen the unexpected partyGet it? the unexpected party, as in chapter one's title. Oh I'm hilarious.----------------------------------------------------OK let’s do this.But first let’s talk about something totally unrelated but totally is.So I don’t know about you guys but when I watch a sporting event, no matter what it is, and I see these world class athletes doing their thing, all I think about is I couldn’t possibly do this. That’s why they are the ones doing it and I’m the one watching it, but once in a while comes these, well there’s only one word for it, Legends.These legends when predictable, still unstoppable, they do the hardest things the easiest way, they don’t do things to show you they can, they do it so you know you can.Mr. Tolkien is a legend, The Hobbit is a legend and Bilbo Baggins is a legend. There’s so much I want to say but above and beyond all, If somehow you haven’t read this book and you stumbled upon this review please do yourself a favor and go read it instead of this, because it’ll be devastating to know that I cost you precious time you could and should spend reading The Hobbit.It’s rare to read a fantasy novel and relate to its protagonist us much us I did.Hero, or as I said legend are words associated in our minds with pictures of smart strong characters, with someone who spent a life in training or maybe a chosen one destined to change the world. Although technically Bilbo is chosen, the way the story address it and develops around it you don’t think of him as a hero, at least I didn’t, not more than I would think of myself if I were in his position, and here where the story gets me, because I do feel I’m in his position from the very beginning. I think Bilbo managed to be this unusual yet relatable hero, because of how human he was in this inhumanly world, how nice he was or at least tried to be to Gandalf and the Dwarves even when they made him uncomfortable and how he saved them even when they needed saving from themselves.I can see myself reading this for my kids one day, and it won’t be boring, it’s still going to be an enjoyable and fun journey, because it’s gold and gold does not rust with time. This story is associated with only beautiful things in my mind, in fact the whole time writing this review I can’t help but think of sunny spring fields and cold breezes.I loved the world in this book and I mean this book, because I haven’t read the other Middle Earth books but I still love it, it was so vast and beautiful, it wouldn’t be the same journey if it was set in a different world.I feel I’m not doing the other characters justice because so far I only talked about Bilbo but the truth is I love them all. Gandalf is probably my favorite besides Bilbo but I also love Dwalin, Balin, Kili, Fili, Dori, Nori, Ori, Oin, Gloin, Bifur, Bofur, Bombur, and Thorin. The other character I loved is Beorn, I don’t know why but I just did and the whole thing with him and Gandalf and how the Dwarves didn’t come all at once, I really loved that part.I watched the movies and I enjoyed them but they didn’t reflect the joy I had reading this book. The movies were darker, they were more about war but the book was more about the journey. This is probably the only time a movie has been bigger than the book but to be fair the movies built the story to be a prequel to The Lord of the Rings and they had a lot more than what was in this book to build upon. The movies hold the main story of the book and I’ll be happy if every movie adaptation was like this, they all should. I have to say that the cinematography and all the landscapes were exceptional and it reflects the beautiful world in the book.The other thing I loved about the movies is the soundtracks, I cannot express how much I loved that, it was one of the best things about the movies, because I loved the poems in the book and the movies didn’t disappoint on that account, the best one has got to be The Misty Mountains Cold, it was one of my favorite parts in the book, and the music in the movie made it perfect, I only wish they made a bit longer. Every time I hear it, I want to grow a beard and go on an adventure."}, {"Review": "“In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.”So begins J.R.R. Tolkien’s love letter to fantasy literature.A reader to this timeless classic will first notice that this is a first person narration, the reader hears Tolkien’s voice as he narrates the tale of Bilbo Baggins, Belladonna Took’s odd son who, though he resembles his respectable and comfortable father, has an unexpected adventure in him. J.R.R. Tolkien is telling us a story, with an occasional soliloquy and off stage remark to us the reader.This of course is the charming and entertaining prequel to Tolkien’s monumental fantasy trilogy, The Lord of the Rings, but a fine tale in its own right and by itself. Generations of readers and dreamers have loved this story for its whimsical allure and for its role as a stage setter for its more epic later cousins.The Films. Readers nowadays have the good fortune of being audience to Sir Peter Jackson’s magnificent films, but I and many folks of an earlier generation better recall the 1977 Bass and Rankin animated film with voice talent from John Huston, Orson Bean and Richard Boone. This cartoon was my first introduction to Tolkien’s work and would inspire me to actually read the Hobbit and Lord of the Rings later.Thorin, the important Dwarf and company leave from the Green Dragon in May, accompanied by the wizard Gandalf and having employed Mr. Baggins as their lucky number (14) and as a burglar. And Bilbo’s unexpected adventure had begun.“I am Gandalf, and Gandalf means me!” – The significance of Gandalf in fantasy literature cannot be overestimated. Certainly there had been wizards, magicians and sages in literature before 1937, but Gandalf in many respects is THE wizard. As fine a performance as Sir Ian McKellen did in all his films portraying Gandalf, I still, in my mind, hear John Huston’s husky yet urbane voice speaking for him. Later readers of the Lord of the Rings and The Silmarillion will learn more about the Gray Wanderer, but in the Hobbit he is simply Gandalf.Chapter 5 – Riddles in the Dark. After some fairly pedestrian undertakings Tolkien has Bilbo getting lost in a deep cave and introduces us to one of his and literatures greastest, most complicated, and strangely likeable villains, Gollum. Later readers would learn the deeper truths of his history, but Tolkien’s guests in this chapter see him as a eccentrically troubled scoundrel.Songs. A reader in the twenty-first century, and especially one who has enjoyed the Jackson films, may be surprised to discover that Tolkien’s original story was not as martial as the films. Certainly Jackson produced his Hobbit films to be less war-like than his epic LOTR films, but Tolkien’s prose contained a fair amount of poetry and song, casting his story in a more innocent and lyric form than would be palatable in today’s publications.I remember trying to convince my high school English teacher that this was deserving of more literary praise and so this was also my first or one of my first indications that many literary folks place an asterisk on the science fiction / fantasy genre when it comes to acknowledging the quality of the writing. Kurt Vonnegut mentioned that as soon as the science fiction label was affixed to his name many critics would not take him seriously. The Hobbit is a great example that sometimes critics can be myopic and time will tell the true greats. The prologue to a great trilogy, simple and charming, The Hobbit is a great book by itself.Finally, this review is of a re-visit to The Hobbit, after a hiatus of perhaps 30 years. I rarely will re-read a book, there are just so many great books and so little time – but The Hobbit is one of those special works that can be savored and enjoyed again and again."}, {"Review": "I love the feeling of connectedness you get when you've wondered about something for a long time, and finally discover the answer. I had a great example of that yesterday. As I said in my review of The Lord of the Rings, for me Tolkien is all about language. I must have read The Hobbit when I was about 8, and even at that age I was fascinated by his made-up names. They sort of made sense, but not quite.Then, when I was 21, I learned Swedish, and suddenly there were many things in Middle Earth that came into focus! Of course, the Wargs get their name from the Swedish varg, wolf. And \"Beorn\" is like björn, bear.But I never figured out why Bilbo was teasing the spiders in Mirkwood by calling them \"attercop\". Now I know. It's an archaic English word related to the modern Norwegian word for spider, edderkopp. The Swedish word, spindel, comes from a different root. I've thought about that for over 40 years. See how much fun it is to acquire a new language?__________________________________If you want to know what I think of Peter Jackson's three Hobbit movies, look here, here and here."}, {"Review": "Buddy read with Fares and I could not be more excited! Edit after finishing: So I'm bawling right now. Every time I have to say goodbye, I just can't bear it. Full review to come.Since this is a buddy read with the awesome Fares , my review will be chapter by chapter, accompanied by appropriate gifs and quotes every two days.Chapter 1: An Unexpected Party. This is giving me such nostalgia!Underrated quote: The hobbit was a very well-to-do hobbit, and his name was Baggins. The Bagginses have lived in the neighbourhood of The Hill for time out of mine, and most people considered them very respectable, not only because most of them were rich, but also because they never had any adventures or did anything unexpected; you could tell what a Baggins would say on any question without the bother of asking him. This is the story of how a Baggins had an adventure, and found himself doing and saying things altogether unexpected.\"Chapter Two: Roast MuttonTolkien's humour is really underappreciated: \"Thorin and Company to Burglar Bilbo greeting! For your hospitality our sincerest thanks, and for your offer of professional assistance our grateful acceptance. Terms: cash on delivery up to and not exceeding one fourteenth of total profits (if any); all travelling expenses guaranteed in any event; funeral expenses to be defrayed by us or our represented, if occasion arises and the matter is not otherwise arranged for.Or another gem:\"Where did you go to, if I may ask?\" said Thorin to Gandalf as they road along\"To look ahead.\" said he\"And what brought you back in the nick of time?\"\"Looking behind.\" Chapter three: A short restWhat I love about this chapter is that it establishes my favourite ship, Bilbo X Rivendell. All jokes aside, it is the chapter where Bilbo discovers a lifelong connection with Rivendell, a place that will ultimately provide him with respite and comfort in his late years.They stayed long in that good house, fourteen days at least, and they found it hard to leave. Bilbo would gladly have stopped there for ever and ever.Chapter 4: Over Hill and Under HillWhen he peeped out in the lightning flashes, he saw that across the valley the stone-giants were out, and were hurling rocks at one another for a game, and catching them, and tossing them down into the darkness where they smashed among the trees far below, or splintered into little bits with a bang,Chapter 5: Riddles in the darkGollum had no sword. Gollum had not actually threatened to kill him. Or tried to yet. And he was miserable, alone, lost. A sudden understanding, a pity mixed with horror, welled up within Bilbo's heart: a glimpse of endless unmarked days without light or hope of betterment, hard stone, cold fish, sneaking and whispering. All these thoughts passed in a flash of a second.If it weren't for Bilbo's empathy at that moment and he had decided to kill Gollum, Frodo and Sam would have had Gollum to help them make it to Mordor on a more secret path. Bilbo's empathy saved Middle Earth. Think about that. Deep stuff.Chapter 6: Out of the Frying Pan and into the FireUnpopular opinion time: I love the Hobbit movies with all my heart. This chapter is one of my favourites in the movie (even though there's a lot of Bilbo/Thorin drama - alright, I love the drama. That bromance is the best). This chapter has some great lines by the dwarves, especially underrated ones like Dori and Balin. There are wargs, goblins and of course, Eagles in this one. The Eagles are cool and neutral assholes as usual. You know, as the saying goes, don't risk a feather for a mortal. I totally made that up, but that's how they areWhat did I tell you?\" said Gandalf laughing Mr Baggins has more about him than you guess.\" He gave Bilbo a queer look from under his bushy eyebrows, as he said this, and the hobbit wondered if he guessed at the part of his tale that he had left out.Chapter 7:Queer LodgingsI love this chapter so much. I love Beorn. I can relate to him - he's a vegetarian who loves nature, animals and plants. And he's a bee keeper! It's as if Tolkien predicted our bee crisis and rise in vegetarianism. Beorn is the Tom Bombadil of the Hobbit - he doesn't care for shiny things, rings and gems. He just loves his nature.I love how Gandalf introduces the hobbits! We get spoiled by Gandalf's sharpened-by-a-whetstone-wit and Beorn's hilarious sense of humour! There are some tantalising parts of this chapter where Beorn wants to know the story of the company's journey thus far. However, there are some weird bits like the dogs serving food on their hind legs and Bears dancing outside in the moonlight. This is the whimsical side of Tolkien I love! Gandalf leaves the dwarves to journey through Mirkwood alone. AND THIS is where things get awesome!Some of my favourites quotes:At any rate he under no enchantment but his own. He lives in an -oak-wood and has a great wooden house; and as a man he keeps cattle and horses which are nearly as marvellous as himself. They work for him and talk to him. He does not eat them; neither does he hunt or eat wild animals.\"So they all went to breakfast with him. Beorn was jolly for a change; indeed he seemed to be in splendidly good humour and set them all laughing with his funny stories; nor did they have to wonder long where he had been or why he was so nice to them, for hetold them himself. He had been over the river and right back up into the mountains - from which you can guess that he could travel quickly, in bear's shape at any rate. From the burnt wolf-glade he had soon found out that part of their story was true; but he had found more than that: he had caught a Warg and a goblin wandering in the woods. From these he had got the news; the goblins patrols were hunting with Wargs for the dwarves and they were angry because of the death of the Goblin King.Side note: I wanted to share something special with all my reading buddies. This is the exact copy of The Hobbit my aunt gave me ten years ago for my 11th birthday. I've read it about eight times. It is the book that got me into reading and eventually got me two Tolkien tattoos and a lifetime of love. What I love about The Hobbit is that the protagonist isn't some young person with strength and energy to boot - he's a middle-aged guy who finally lives a life of adventure. It's a message that anyone out there can have an adventure despite their age."}, {"Review": "\nWhere there's life there's hope.\nI've been thinking a lot of how many stars giving to the book, since there were parts that I loved a lot, but there were others that I found tedious and even anti-climatic, but in respect to this great writer, J.R.R. Tolkien, I think that the book deserves at least 4-stars rating with which I feel easy since I am not giving it a full rating but also I am not punishing it for things that maybe a future re-reading will solve.\nIn a hole in the ground there lived a hobbit.\nAnyway, it's amazing how with this line... In a hole in the ground there lived a hobbit. ... the epic fantasy were never the same... it got better!It's so fantastic to think how Tolkien felt the impulse to write down this line, and from it, a whole epic universe came into life. I loved to read when some book came up from a dream (like Mary Shelley's Frankenstein) or from an unknown impulse, like in these case. I watched at some moment a documentary abour Tolkien's work and I learned how he was looking for a mythology, in the sense like the Nordic one or the Greek one, to call as own on England, and it was the trigger to creat such vast and appealing universe. And even more interesting to choose its point of development, since the core books like this one, The Hobbit and the following trilogy of The Lord of the Rings, are located in an time where the magic is leaving the Middle-Earth and the age of men is becoming the important one.\nIf you sit on the doorstep long enough, I daresay you will think of something.\nI think that certainly many people could love \"more magic\" in the main story, there would be others who enjoy the \"more downed\" tone with more \"realistic\" elements. In that way, everybody can like this story since there is a good balance of magic and \"terrenal\" stuff. I learned that in the second edition/fifth printing (if I am not mistaken) was where Tolkien made the corrections in the Fifth Chapter, Riddles in the Dark, to make it fit better with the evolution of the sequel known as The Lord of the Rings.\nThief, thief, thief! Baggins! We hates it, we hates it, we hates it forever!\nStill, it was amazing how Tolkien could develop such impressive \"sequel\" from the book of The Hobbit with only editing one chapter, but definitely a key one. It's wonderful how the mood of the book is at hand with the maturing of Bilbo Baggins, the main protagonist, since the story started quite innocent and even with such humoristic moments and step by step is turning more and more serious, in the same way as Bilbo is getting more serious about his role in the mission. \nMy Precious, my Precious.\nThe two introductions about characters that I absolutely loved were the Elrond's and Smaug's...\nAbout Elrond...\n\nHe was as noble and fair in face as an elf-lord, as strong, as a warrior, as wise as a wizard, as venerable as a king of dwarves, and as kind as summer.\nI mean...wow!!! If you are not impressed about a character when he or she is introduced in such way, well, I don't know what else you'd need.\nAbout Smaug...\n\nMy armour is like ten fold shields, my teeth are swords, my claws spears, the shock of my tail a thunderbolt, my wings a hurricane, and my breath death!\nOh yes, right then, anybody without a ring of power on his finger should run like crazy and never \nNEVER\n stop to look behind.\nIt does not do to leave a live dragon out of your calculations, if you live near him.\nWithout spoiling anything really crutial, I think that my most favorite part were the moon-letters. I mean, secret messages that you can read only at certain position of the moon in the year... WOW!!! and my favorite moment there, was when is asked to Elrond if the map says something else... Not with this moon. (Or something much like it) I mean, it gives a promise that may that map has some other secrets in there, only to be revealed at the right position of the moon in the year. WOW!!! It's cool when you read or see an scene where certain treasure's location is revealed when the sun's light or moon's light came into a certain room at certain moment of the year, but I think that this \"moon-letter\" and/or \"moon runes\" are way WAY MUCH COOLER.Obviously, Gandalf is a great character, but I think that it was \"too\" great and Tolkien had troubles to think about challenges to put into the travelling group and they could mean a real risk having a powerful wizard in the midst. And you sensed it when they are in peril UNTIL Gandalf appears again. I understand. Gandalf rules! But hey, if you create such powerful character you have to live with him/her, I mean, if you will have troubles to think about adventures involving him/her, well, then, at least, let's present him/her as a passing character like Elrond, but when you have Gandalf in the travelling group, it's even more notorious the conflicts of the author when that character is dissapearing and appearing.In here, about Smaug's fate... (view spoiler)[You have such powerful and intimidating character as Smaug, the last of the dragons, with such fearful introduction and later bam! it is beaten with a dang arrow? Thanks to a very convenient failure in his armour that a hobbit that he doesn't know anything about warfare, he was able to deduce a weak point that many, many, many warfaring races weren't able to deduce? And so, this menace that it's been spoken about along the whole book...bam! It's killed with a single arrow and even the arrow is shot by a totally new character that you didn't know anything about until that moment? Geez! (hide spoiler)]I was expecting more about Thorin Oakenshield. Certainly, the first part of Peter Jackson's film adaptations gave him a lot of credit and respect, presenting him as a powerful leader, where in the book, he doesn't do anything useful. And in fact, I didn't find out why so many dwarves in the story since nobody did something particulary memorable. At some moments, you think that Balin will become something more in the story but no, Bombur is only remembered by his weight (that I found something cruel how he is treated in the story) and even I thought that since Gloin is the father of Gimli, he would do something awesome at some moment but no. So, why so many dwarves in the group if they won't do something useful in the story? I think Gimli, one single dwarf, did more to give a good name to the dwarf race in The Lord of the Rings, than 13 dwarves in the whole The Hobbit.I loved the trolls! Maybe some people didn't get the most humoruous aspect of them. I mean, you are in the Middle-Earth and everybody has names like Bilbo, Thorin, Gandalf, Elrond, etc... but the trolls' names are: Bert, Tom and William!!! I don't know but I found that such amusing, that they had such common and \"modern\" names in the middle of such \"epic fantasied\" names. At the end, The Hobbit is a wonderful piece of writing where you find a totally new race in almost each chapter and not only you know the new race but also you get a \"glimpse\" realizing that behind of each race there is an extensive and rich history that you won't be able to know in its entirely way, adding more mystery to the whole universe created here."}, {"Review": "Unpopular opinion time: I don't like The Hobbit.Before all of you start hating me forever, please, hear me out. I truly respect J. R.R Tolkien. If I'm not mistaken, this was one of the first really popular fantasy books ever written. And fantasy just happens to be my favourite genre. So you can see why I really wanted to like this book. I wanted to like it so much, in fact, that I have tried to read it three times now. But each time, I have had to DNF it. I love The Lord of the Rings movies. I love The Hobbit movies. But I cannot, for the life of me, finish this book. Allow me to explain:\nThree Perfectly Logical Reasons As to Why Ryan Can't Finish The Hobbit, So Please Don't Hate Her, Thank You\n1) The writing style is just not for me. I love beautiful descriptions in books, but when the description has been going on for more than four sentences, I'm out. I get it. It's a really nice tree. Just get back to the story.2) The plot dragged on. Not much seemed to be happening. I can't even remember 90% of what little I read. A 366 page book somehow managed to seem like an 800 page book. It was tedious. 3) I've already seen the movies.Now before you shout, \"SACRILEGE, HOW CAN YOU LIKE THE MOVIES AND NOT THE BOOK!\" let me reiterate the fact that I've tried reading this book three times. After the supposed \"third time's a charm\" attempt failed, I moved on to the films. And I really enjoyed them. (Well, I didn't like how they stretched one book into three movies, but that's a discussion for another time.) The movies managed to keep everything I liked about the book, and cut out everything I didn't. Lovable characters and awesome world? Check. No overly-descriptive writing? Check. If you're one of those many people who adore this book with all of your heart and soul, great for you! I'm glad you liked it. It's just not for me.(And no, I will not try to finish this book again. That'd make four failed attempts. I've got to draw the line somewhere.)"}, {"Review": "The Plot  القصهThe Action  الاحداثThe Settings  الاماكنThe Characters  الشخصياتBut.. The Oscar Goes to.. J.R.R. Tolkien for BEST STORYTELLER فعلا لعل اكثر ما اعجبني في رحلتي مع الهوبيت ..تلك الرحله غير المتوقعه ليهو اسلوب روايه جي ار ار تولكين للقصه فله اسلوب مميز بالفعل في الحكي, كانه يروي وهو يجلس معك أنت شخصياالهــوبيت هي حجر الاساس والبدايه في واحده من اهم الروايات في العالم \"سلسله ملك الخواتم\" \"وكانت السلسله الاعلي مبيعات حتي اطاحت بها روايه الساحره الانجليزيه جي كي رولينج عن قصه حياه هاري بوتر\" , وحتي الكتاب منفردا قد حقق مبيعات عاليه ونسبه قراءه اعليلم اكن انتوي ابدا البدء في قراءه عالم فانتازي من اوله لاخره..فهذا لم يكن ابدا نوع القراءه المفضله بالنسبه لي \"فلا الخيال العلمي مثل حرب النجوم او الهوبيت هو النوع المفضل لي في القراءه واحيانا الافلام ايضا\"..فانا افضل الخيال الذي يحدث في العالم الحقيقي الواقعي,الفانتازيا التي تحدث في البلد المجاور والشخصيات الحقيقيه حتي وان كان لها قدرات خارقه..ولكن عندما تعج روايه بشخصيات غريبه كاقزام وغيلان وهوبيت وجن, بل وتدور في ارض خياليه فهذا كنت اعتبره كثيرا جدا لمخيلتي الي علي قدها :)ولكني اتذكر جيدا ان اول مشاهده لفيلم \"ملك الخواتم\" 2001 اعجبني قصه الجزء الاول نوعا ما الا ان يكون \"الهوبيت\" هذه الشخصيات الخياليه مع الاقزام مع الجن والغيلان والترول والصقور العملاقه, كل هذا في اراضي غير حقيقيه وعالم اخر تماما اربكني جدا ولم يجعلني استمتع بالاجزاء التاليهوتشأ الظروف ان اشاهد بعد اكثر من 10 سنوات النسخه الممتده من الفيلم, وشعرت ان الشخصيات لها عمق والسيناريو الممتد افضل بكثير من مجرد الاكشن والحروب التي ضجرت من طول مدتها خلال الاحداثومن هنا شعرت ان بالتأكيد الروايه نفسها وشخصياتها لها عمق غير الاكشن ولها تاريخ ايضا..وبعد صدور الفيلم الذي خرج عن روايه \"الهوبيت\" بعد اخر جزء بعشر سنوات واعجابي فعلا برسم الشخصيات قررت ان ابدا في دخول عالم الارض الوسطي ,عالم تولكين كما رواه بنفسه وكما \"اختلقها\" بقلمه وريشته ايضا..ومن البدايه********* الاحداث *********------- The Plot ------فكره الرحله وطريقه تقديمها اعجبتني جدا, وجود خريطه المسيره في غلاف الكتاب الداخلي بريشه تولكين امر اكثر من رائع وافادني كثيرا لتخيل الرحلهالا ان العيب الوحيد هو تسرب الملل في بعض اجزاء الرحله نفسها..ربما -واقولها مره اخري- هو ملل مقصود ادبيا لكي نشعر بمدي الملل الذي يعانيه البطل \"فالبطل كان متمللا جدا طبعا ولايحلم الا بفراشه الوثير\" ولكن مازالت بعض الاجزاء كانت اطول مما ينبغي ولم ترق لي كثيراوهنا يأتي جمال الفيلم والذي اعتبره مكمل للصوره الكامله التي رسمها تولكن, بيتر جاكسون فعلا منح الحياه البصريه للروايه بشكل رائع ويستحق فعلا ترشيح اوسكار اخربيتر جاكسون منذ بدايه الجزء الاول من سلسله ملك الخواتم قام باختيار اجمل مواقع التصوير التي يمكن جعل بها الارض الوسطي حقيقه مرئيه وليس في الامكان اجمل مما كانوهذا ما استخدمه هنا بطريقه اقوي في \"الهوبيت\" وحتي ان كان هذا الجمال اكثر بكثير من الروايه نفسها في وصف الاماكنكما قام في مغامره تحسب له بحذف بعض الاحداث الممله بالروايه \"كالدوران مرارا وتكرارا في ممرات الغيلان بالجبل او الغابه المظلمه\" ولكنه اضاف بعض الاحداث الاخري الاكشن والتي ربما زادت من الملل قليلا بالنسبه لي مثل جعل مطاره الغيلان للاقزام تأخذ مساحات اطول واحيانا في اوقات لم تكن بالروايهكما اضاف في الفيلم احداث تدور بين جاندلف وبين النكرومانسي والتي تم ذكرها عابره في احداث الروايه ولم نشهدها او نعرف عنها اي شئ..وهي اضافه في هذه الحاله تحسب له جدا وفعلا اتمني ان اقرأ عنها في روايه اخريوان اشفق الراوي الرائع علينا ويلات الحرب الاخيره -وهذا من حسن حظي اني غبت عن الوعي مع بيبلو \"طبعا وكل من قرأ الروايه- لعدم تطويل الاحداث في وصف الحرب فاني اعتقد انها سيخصص لها نصف الجزء الثالث من الفيلم تقريبا, وربما يكون الامر مشوقا وقتهاولكن كما قلت جمال الطبيعه والتصوير الذي قام به الفيلم يشفع له التطويلولكن الاجمل فعلا كان في تصوير ********* الشخصيات *********-------The Characters--------Dwarf فعندما يكون هذا ...قزم تعرف انك امام فيلم يعشق شخصيات الروايه ويريد ان يقدمهم في اجمل صورهموقد كان.........حقافتصوير الشخصيات بالفيلم قدمه بيتر جاكسون باروع مايمكن ,وحتي ليس بصريا فقط بل وبناء الشخصيات نفسه وتطورها كان مشابهه للروايه ويعلوه في بعض الاحيان\"بالطبع لطول فتره الفيلم باجزاءه\" فسموج التنين مثلا كان رهبته افضل بكثير \"بصوته\" وهيئته في الفيلم الجزء الثاني, وان كان هناك اختلاف طفيف بين الحوار بين الروايه والفيلم الا انك تجد ان كلاهما مكملين لتصويره الرهيب...ولكن يظل توليكن يتفوق بالتأكيد وبدون اي شك او حتي معارضه في تقديمها اتذكر شخصيه \"بوروين\" الرجل الدب اني قرأت بدايه هذا الفصل وتقديم الشخصيه نفسها قبل نصف ساعه من دخول الفيلم الجزء الثاني..روح الدعابه في روايه القصه كان واضحا جدا وكان من اجمل الفصول فعلا, ولكنه تحول في الفيلم الي مشهد اكشن فحسب فلم يكن رائعا مثل الروايهفالحوار بينه وبين جاندلف كان في غايه الطرافه فعلا...وشخصيه جاندلف بالاخص اعشقها \"صارت شخصيتي المفضله الجديده\" لاني اشعر ان بها الكثير من ********* الـرواي *********----- The Storyteller -----تولكن , والذي منحناه الاوسكار في اول الريفيو كان له اسلوب اكثر من رائع في الحكي...في وصف العالم الذي يعشقه والشخصيات وماضيها وتاريخها ونفسيتها وعائلتهالغته المحببه في الروي وروح الدعابه واشعارك بانه يحكي لك الروايه خصيصا هو اكثر ما شدني لاستكمال رحلتي الغير متوقعه فعلا معهانجليزيته المحببه سواء في اللغه او حتي تصرفات شخصياته جعلتني اعشق اكثر الادب الانجليزي \"فلا ننس ان جي كي روليج كاتبتي المفضله انجليزيه ايضا\" جندلف انا متأكد انه شخصيته المفضله..\"ربما سأبحث في هذا الامر فعلا\" وقد اعجبني جدا حواره منذ اول مشاهده والتي حافظ عليها بروحها ونصها المخرج بيتر جاكسون“Good Morning!\" said Bilbo, and he meant it. The sun was shining, and the grass was very green. But Gandalf looked at him from under long bushy eyebrows that stuck out further than the brim of his shady hat.\"What do you mean?\" he said. \"Do you wish me a good morning, or mean that it is a good morning whether I want it or not; or that you feel good this morning; or that it is a morning to be good on?\"\"All of them at once,\" said Bilbo. \"And a very fine morning for a pipe of tobacco out of doors, into the bargain....\"Good morning!\" he said at last. \"We don't want any adventures here, thank you! You might try over The Hill or across The Water.\" By this he meant that the conversation was at an end.\"What a lot of things you do use Good morning for!\" said Gandalf. \"Now you mean that you want to get rid of me, and that it won't be good till I move off.” \nستشعر فعلا بتلك الروح المرحه في الروي سواء من الراوي او من جمله جندلف نفسها \"هل تتمني لي صباح سعيد ام انك تعني انه صباحا سعيدا سواء شئت انا او ابيت , او انك تعني انك تشعر بالسعاده هذا الصباح , او انه صباح لتكون فيه سعيد؟\"“Do you wish me a good morning, or mean that it is a good morning whether I want it or not; or that you feel good this morning; or that it is a morning to be good on?” \nفي النهايه********فعلا هي رحله غير متوفعهUnexpected Journeyلم اتخيل انه سيعجبني عالم خيالي وشخصيات خياليه الي هذا الحد..ربما تظل لاحداث القصه بعض الاجزاء التي مللت منها الا ان روح الراوي وتعبه في هذا العالم وتاريخه سيجعلك متشوقا لمعرفه المزيد من الاحداثالنسخه التي لديPaperback -Movie Tie inكان بها اخر 25 صفحه بخط اصغر من الخط الصغير اساسا اخاص بالروايه اول فصول ملك الخواتم, في البدايه عندما كانت اضجر احيانا من الملل اقول اني لن اقرأه وسيكفيني الفيلم بنسخته الممتدهالا ان بعد النهايه وجدت اني اريد المزيد , وفعلا شدني جدا الفصل الاول وسيكون لي رحله اخري للارض الوسطي ومدنها وجبالها وجمال طبيعتها وحتي طرقها الوعرهمع الهوبيت..مع جاندلف..والخاتم..وحتي بيتر جاكسون وفوقهمالرائعجي ار ار تولكنمحمد العربيمن 12 ديسمبر 2013 الي 29 ديسمبر 2013"}, {"Review": "Now the route Mr. Bilbo Baggins transverses to seek adventure and a pot of gold...several in fact, may not be as glamorous as the yellow brick road nonetheless thoroughly lucrative...he will never complain....after he is safely back home.... As our story begins the Hobbit is having a quiet, delightful time drinking his tea and a nice breakfast, steps out the door (from his hole in the ground the unkind would say) blows a wonderful smoke ring...And is the last one for many moons... a peaceful situation I mean. An old man, a stranger appears the polite hobbit greets him, Bilbo later regrets it often but that's further down the road. The sociable Mr. Baggins invites the man who reveals himself to be the powerful, mystifying, lofty wizard Gandalf to tea...tomorrow. The nervous hobbit, half the size of a human just wants to be left alone and enjoy his comfortable life which unfortunately doesn't occur, on the other hand the reader is greatly rewarded. Next day a dwarf arrives Dwalin, than another Balin, and still more, two in fact, Kili and Fili, five then, Dori, Nori, Ori, Oin, and Gloin, this will in a short while ( pun intended) be thirteen, no I haven't forgotten Bifur, Bofur, Bombur, and last very appropriately , the leader Thorin, they are a superstitious bunch. The need for a fourteenth member is obvious ( you can't count a wizard) , these creatures are eating, drinking at poor Bilbo's home... an unexpected party is fully in bloom causing the owner a headache ...think of the expense and danger to his dishes and furniture. Finally Gandalf comes and the purpose of the gathering disclosed, a bold plan to kill a huge dragon Smaug the Magnificent, take the vast priceless treasure, the winged fire breathing behemoth sits on, inside the very distant Lonely Mountain, the dwarves ancient home. The reluctant Mr. Baggins agrees to go along, not too confidently , he can see disaster in his future... Deadly monsters, goblins, wolves, unfriendly elves are between their goal, the sinister Misty Mountains, rivers to cross, lakes too, the dark thick forest Mirkwood, where evil giant spiders, sinister wizards, unfriendly wood-elves reside, with only a little stream to guide and follow , then Gandalf abandons them...Still the frightened little hobbit becomes the leader, with the help of a magical ring. The battle of five armies, a grisly fight where no quarter is given, an epic style end to this tale is the high point. This classic written in 1937 is the original, The Lord of the Rings are sequels and more magical than Mr. Bilbo Baggins band. If you wonder why someone would read a book for the third time all you need to do is get this title... (yes more than one novel in my library ) . A trip in a world where you can forget your troubles and drop into one let's face it, quite interesting ... an ominous place to become a hero even get rich if you serve well, and survive obstacles in the way that all good people will."}, {"Review": "I find it hard to believe there are people who have no clue what the book is about. Still the possibility exists so I will give the high points of the plot. See there once was a hobbit (a race entirely created by Tolkien and endlessly recycled since under name halflings - for copyright reasons) named Bilbo Baggins. Think a humanoid creature of about half of a grown-up adult human height with furry legs who goes barefoot - it is a hobbit.These guys live underground in holes similar to rabbit's, but much more comfortable. Speaking about comfort, they love it and for this reason never ever go adventuring. One fine day Bilbo was sitting outside minding his own business when Gandalf showed up. Gandalf was a wizard who gave birth to practically all mighty wizards appearing in any art form. Albus Dumbledore from Harry Potter is probably the most famous example and yes, he would not exist without Gandalf.Anyhow, for reasons entirely unclear through the whole book Gandalf decided to involve poor hobbit into a grand adventure - the kind where heroes go from a mortal danger to being miserable from hunger and weather having just escaped said danger and to yet another mortal danger again, still remaining miserable. Who would not want it? By the way, this never-explain-your-reasons-and-motivations thingy is a trademark of all mighty wizards that come after Gandalf. And so off to a grand adventure Bilbo went, accompanied by 12 dwarves and Gandalf himself who kept them company only part way. Adventure they wanted, and adventure they got, full of misery and dangers. I said it before and I will say it again at the risk of making some people very angry: this is a children tale; nothing more, nothing less. If you are trying to find some deep philosophical meaning in it, you are wrong: it is not supposed to have any. You might as well find some hidden messages in Itsy Bitsy Spider.Just look at Gandalf: the guy who dueled Balrog in the Lord of the Rings (this is an adult tale) at times looks like a total fraud in Hobbit: at one time he was sitting in a tree throwing flaming pine cones at wargs and set the forest on fire - his own tree included. As I said, a simple tale. It does not make the book bad by any means. It is a children classic for children and adults alike for a reason. I had a blast reading it in my childhood; I reread it later and liked it and I still like it after my latest reread. The rating is 4 very solid stars. "}, {"Review": "Este es mi primer Tolkien. Nunca me había animado, siempre le tuve mucho respeto. Tampoco sumaba el hecho de que no soy muy fanática de la fantasía. Y para mal de males, me advirtieron que el autor no era ameno de leer, muchos renunciaron a sus lecturas de manera muy prematura, sin lograr que los atraiga. Sin embargo, esta es una de esas lecturas donde, si pudiera, le daría mil estrellitas más.Leí esta historia completamente hechizada. Tan pronto empecé este libro me dieron ganas reales de llorar al pensar en lo absurda que fui al negarme tanto con este autor. La historia es tan hermosa, y la prosa de Tolkien es una cosa de locos. Pensamiento completamente ajeno a la historia: ojalá hubiera tenido una edición ilustrada para acompañar esta hermosa aventura. Ya voy a buscar alguna que esté preciosamente ilustrada y tendrá su relectura. Pero mientras tanto, no quisiera dejar de recomendarlo, ya que a diferencia de lo que yo había escuchado, el libro es completamente amigable y accesible, y los hobbits son sencillamente entrañables.Les dejo la video reseña más completa que hice en mi canal: youtu.be/qKU5XjXpOT0 "}, {"Review": "3/5I'm definitely glad I gave this a fourth chance (lol). There's no way this is a 1 star novel like I previously rated it; however, there's no way it's five stars either.When I started my fourth \"re-read,\" I could immediately tell I was going to enjoy the story more this time than I had previously. The writing grabbed me and I wanted to know where the journey would go... It was all great.Somewhere in the middle I started getting tired of the whole \"journey\" thing. The writing never wavered, but I suppose I got bored of reading about their travels. I don't know. I felt as though I wanted more to happen, but not in an adventurous way.So, am I glad I finally enjoyed this? YES. Am I upset it wasn't a four or five star rating? Not really. I don't think I ever expected to like it that much. Especially since it took me four times to get into it.Now, it's off to giving the actual series a chance!_________________________________Original Review:1 StarGuess I'm going to be one of those few people who hate this book. Oh well. In my defense, I didn't enjoy  The Lord of the Ring's  either, so I didn't really expect to like this..."}], "Image": "https://images.gr-assets.com/books/1546071216l/5907.jpg", "Desc": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.Written for J.R.R. Tolkien’s own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero, a powerful and dangerous ring, and the cruel dragon Smaug the Magnificent. The text in this 372-page paperback edition is based on that first published in Great Britain by Collins Modern Classics (1998), and includes a note on the text by Douglas A. Anderson (2001). Unforgettable!"}