{"Genre": "Fantasy", "ID": "65605", "Name": "The Magician's Nephew", "Reviews": [{"Review": "Suffers from the same problems as Lewis' other books, both his children's fantasy and his pokes at theology: Lewis' worldview is not sophisticated, and his sense of psychology has a large blind spot. However, it's not his faith that is the problem--it certainly wasn't a problem for Donne or Milton.Lewis is simply unable to put himself in another's shoes, which is very problematic for a writer or a theologian. He cannot understand the reasons or motivations for why someone would do something he considers 'evil'. Unlike Milton, he cannot create a tempting devil, a sympathetic devil, and so Lewis' devils are not dangerous, because no one would ever fall for them.His villains are like Snidely Whiplash: they are comically evil, evil not due to some internal motivation, but because the narrative requires it. Yet Lewis is not reveling in the comedic promise of overblown evil, he's trying to be instructive. So he dooms his own instruction: it is only capable of warning us about dangers which are so ridiculous that they never could have tempted us in the first place.Likewise, his heroes are comically heroic: they are not people who struggle to be good, who have motivations and an internal life, they are just habitually, inexplicably good. There is nothing respectable in their characters, nothing in their philosophies for us to aspire to, they are just suffused with an indistinct 'goodness' which, like evil, is taken for granted.But then, Lewis' world is mostly a faultless one. People never act or decide, they are lead along by empty symbols of pure good or pure evil, following one or the other because they are naive. As usual, Lewis' view of humanity is predictably dire: always too naive, too foolish to know what good and evil are, even when they are right in front of us, and yet we are apparently still to be reviled and cursed when they make the wrong decision, even if we couldn't have known what we were about.Like many of Lewis' works, this could have made a profound satire, but it's all too precariously serious for Lewis to be mocking. There is something unusual in the fact that, whenever the amassed evidence of his plot, characters, and arguments point to a world of confusion in which man is utterly lost, Lewis always arrives at the conclusion that we are fundamentally culpable, despite the fact that he always depicts us as acting without recognition.The really frightening thing about Lewis' worldview is that we can never seem to know whether we are naively following good or naively following evil, but that the difference between the two is vital and eternal. Like Calvin, he dooms us to one or another fate, and we shall never know which, yet unlike Calvin, Lewis never really accepts the ultimate conclusion this worldview suggests.There seems to be, at the heart of Lewis' works, a desperate pride, a desperate sense that we do know, even when we think we don't, even when Lewis shows us a hundred examples where we couldn't possibly know. But that is the crux of the fundamental paradox around which Lewis inevitably frames his stories, the paradox which defines his life, his philosophies, and the impetus for his conversion.Like most of us, Lewis seems to feel a deep need know what is right--to be right. Yet his experiences have shown him, again and again, that we are fundamentally ignorant, despite our most devoted attempts to be knowledgeable. It's an impassable contradiction.Lewis saw a world filled with pain, ignorance, selfishness, cruelty, senseless violence, and refused to accept that this was part of human nature; so he made it an outside thing, a thing which was, for him, always clearly defined. He spent most of his writing career trying to show how the effect of this thing could be the excuse for why man commits such terrible acts, but without making man himself evil--but many men are desperate to avoid the idea that their own mistakes, their own forays into 'evil', are ultimately their own fault.He is never able to define the point at which mere naivete becomes guilt. The two opposing forces of ignorant evil and willful evil are always nebulous for Lewis, and he never succeeds in defining where one ends and the other begins, where foolishness becomes damnation.He never defines it philosophically, theologically, or psychologically. Usually, he just draws a line arbitrarily between 'good people' (people like him) and 'bad people' (everyone else). Like Tolkien, he takes the comfortable and familiar and fences it off--a little peaceful island home, safe against an incomprehensible world. It's a comforting worldview, one many of us feel drawn to, that sense of isolation, 'us against the world', the need to be right at all costs, to be different from those we habitually condemn, to know what is good and what is not--but it is not a coherent philosophy, it is not conducive to self-awareness, and it's certainly not the sort of thing we need to be feeding our children. Indeed, the only thing such self-justification invites is further ignorance, prejudice, and conflict.My List of Suggested Fantasy Books"}, {"Review": "It's mildly embarrassing that I've lived almost 32 years and I've only read one book from the Narnia series. Well, I guess I've read two now, but I feel like I should have read those a long time ago. As an adult, it's difficult to even rate this book fairly because the adult version of myself wants to be all critical and make comments about how this isn't Lord of the Rings or Harry Potter, but it's not supposed to be. And that's fine with me. Is this the first book in the series! Is it the sixth? Does it even matter? I'm reading it first because I conducted a very thorough investigation into the series and determined that my plan to read them this way is the right way to read them. However, my very scientific thorough analysis also concluded that this book can be read later and no one really cares and it doesn't really matter in the grand scheme of things. Just read the series is all I'm saying, although I haven't even read the series myself so that may be moderately premature on my part. It was neat to read about the origins of Narnia. Whoa... did I just say \"neat\"? That was an accident. Lemme get back to words I actually use in real life. It was awesome to read about the origins of Narnia. The lamp post and the witch and whatnot. Aslan. That was just autocorrected to Asian so that was funny. I don't have any reason to believe he is an Asian lion, but I again haven't read the entire series yet so that could be explored in future novels where Aslan spends his childhood as a small lion cub in Beijing before creating Narnia later in life. I don't think that's accurate though. Lewis really writes an engaging fantasy tale that is surprising full of beautiful descriptions rather than nonstop action. I appreciate the world building in the book which I found pretty detailed for a children's book. I also like that I don't really know some of the characters well, but feel like the less important ones are gonna be showing up later on down the road. I'm excited to continue this trek through Narnia. My kids don't give a flip about it so I'm gonna be on my own. Maybe when their older they will have a longer attention span and a better appreciation of great books. Dad's gonna keep rolling in the meantime. "}, {"Review": "\n“No great wisdom can be reached without sacrifice.” \nI loved the narration of The Magician's Nephew, it's clear, imaginative, and addicting. This book took me book to the time when I was sitting and listening to my grandma's tales. She always told me about folklores. I can still remember the story about there's a ghost hiding in the closet, it made me so scared and never ever wanted to open the closet alone again.This book literally made me feel like that. I kept wondering why I did and figured out because of its voice that was very classic and magical that I didn't want it to be over. Besides the fun I get from this book, The Magician's Nephew is alike a doctrine as if I was reading the Bible.\n“What you see and what you hear depends a great deal on where you are standing. It also depends on what sort of person you are.” \nLewis had his way to tell the story. He thoroughly showed me about this world where the origin of Narnia comes from. Not only I got to know about the wardrobe, but I was introduced to the characer that would be a big part in the next book. The Magician's Nephew should be read before The Lion, the Witch, and the Wardrobe for you to get full knowledge about this world.https://goo.gl/qk8zDx"}, {"Review": "The Magician's Nephew (Chronicles of Narnia, #6), C.S. LewisThe Magician's Nephew is a high fantasy novel for children by C. S. Lewis, published by Bodley Head in 1955. It is the sixth published of seven novels in The Chronicles of Narnia (1950–1956). The story begins in London during the summer of 1900. Two children, Digory and Polly, meet while playing in the adjacent gardens of a row of terraced houses. They decide to explore the attic connecting the houses, but take the wrong door and surprise Digory's Uncle Andrew in his study. Uncle Andrew tricks Polly into touching a yellow magic ring, causing her to vanish. Then he explains to Digory that he has been dabbling in magic, and that the rings allow travel between one world and another. He blackmails Digory into taking another yellow ring to follow wherever Polly has gone, and two green rings so that they both can return. Digory finds himself transported to a sleepy woodland with an almost narcotic effect; he finds Polly nearby. The woodland is filled with pools. Digory and Polly surmise that the wood is not really a proper world at all but a \"Wood between the Worlds\", similar to the attic that links their rowhouses back in England, and that each pool leads to a separate universe. They decide to explore a different world before returning to England, and jump into one of the nearby pools. They then find themselves in a desolate abandoned city of the ancient world of Charn. Inside the ruined palace, they discover statues of Charn's former kings and queens, which degenerate from the fair and wise to the unhappy and cruel. They find a bell with a hammer, an inscription inviting the finder to strike the bell. Despite protests from Polly, Digory rings the bell. This awakens the last of the statues, a witch queen named Jadis, who, to avoid defeat in battle, had deliberately killed every living thing in Charn by speaking the \"Deplorable Word\". As the only survivor left in her world, she placed herself in an enchanted sleep that would only be broken by someone ringing the bell. ...تاریخ نخستین خوانش: ماه ژانویه سال 2002 میلایعنوان: ماجراهای نارنیا 6: خواهرزاده جادوگر؛ نویسنده: کلاویو استیپلز لوئیس 1898 - 1963 ؛ مترجم: امید اقتداری 1330؛ منوچهر کریم زاده 1328؛ کتابهای کیمیا، تهران خیابان ولی عصر، بالاتر از میدان ونک، شماره 133؛ چاپ نخست 1379، هفت جلد در 1368 ص؛ جلد ششم در شش و 172 ص؛ شابک: دوره هفت جلدی 9647100116؛ چاپ سوم 1386؛ شابک: 9647100108؛ موضوع: داستانهای کودکان برای کودکان از نویسندگان انگلیسی - سده 20 ممترجم: پیمان اسماعیلیان؛ تهران، قدیانی، بنفشه؛ 1387، در 256 ص؛ چاپ دوم 1388؛ مترجم: آرش حجازی؛ تهران، کاروان؛ 1376، در 199 ص؛ شابک: 96491607؛ کتاب اول: شیر، کمد، جادوگر؛ کتاب دوم: شاهزاده کاسپین؛ کتاب سوم: کشتی سپیده پیما؛ کتاب چهارم: صندلی نقره ای؛ کتاب پنجم: اس‍ب‌ و آدم‍ش‌؛ کتاب‌ ششم: خواهرزاده جادوگر؛ کتاب هفتم: آخرین نبرد؛ این جلد (ششم) از نظر زمان چاپ، ششمین کتاب است، اما از نظر زمان رخدادها و وقایع، به پیش از زمان کتاب: شیر، کمد و جادوگر، برمیگردد؛ و در مورد نحوه ی آفرینش جهان نارنیا ست. در این داستان «پالی» به همراه «دیگوری» خواهر زاده ی «دایی اندرو»، وارد دنیایی جنگلی میشوند، که همانند یک تونل، آنها را به دنیاهای دیگر میرساند. در دنیای نخست، یک جادوگر همراه با آنها، به دنیای خودشان راه مییابد. در سفر دوم، مرد درشکه چی و اسبش، دایی اندرو، دیگوری و پالی، اشتباهاً وارد نارنیا، که هنوز کاملاً بوجود نیامده، میشوند، و شاهد ایجاد نارنیا هستند. درشکه چی، و همسرش نخستین شاه و ملکه ی نارنیا هستند، و نامهای آنها در نارنیا: «فرانک» و «هنی» ست. برگزیده از متن کتاب: نارنیا، نارنیا، نارنیا، بیدار شو، عشق بورز. اندیشه کن. سخن بگو. درختهای روان باش. جانوران سخنگو باش. آبهای ملکوتی باش. ص 107 از کتاب ا. شربیانی"}, {"Review": "My autistic-spectrum son Jonathan is fascinated by the White Witch in The Lion, the Witch and the Wardrobe. He wants to know what her motivation is. \"Why is she always so angry?\" he asks. \"Why does she hate Aslan? Who is she like?\" These are good questions. I have suggested that he should read The Magician's Nephew, but Jonathan only reads the books he wants to read and ignores recommendations. A pity, I would like to discuss it with him.The White Witch is the best character in the series, and it is indeed difficult to think of anyone who strongly resembles her. She is a little like Auntie Medusa in The Rescuers, another of Jonathan's favorite films, and she's also a little like the Sea Witch in The Little Mermaid, Madame Mim in The Sword in the Stone, and, of course, the Wicked Witch of the West. But there are some important differences. The other witches are ugly, and it's plausible to believe that they are motivated by envy of the heroines' effortless youth and beauty. This is perhaps most evident with Auntie Medusa; I love the scene where she's removing her false eyelashes and Penny involuntarily recoils in horror. The White Witch, however, is genuinely beautiful, not just using magic to cast an illusion of beauty as Madame Mim and the Sea Witch do on occasion. She doesn't order Maugrim to kill Susan and Lucy because they're better-looking. It is, rather, a political decision: she is concerned that they will take her throne. Nothing personal, just business.In general, it seems to me, the White Witch is motivated entirely by love of power, and she hates Aslan because he is stronger than she is. She is in fact a rather good children's book adaptation of Milton's Satan. But why did C.S. Lewis decide to make her a woman? I'd love to know the background to that artistic decision."}, {"Review": "I have owned this beautiful set of illustrated hardback editions of these books since childhood and am only now getting around to reading them. After reading this spellbinding first installment I am so mad at myself that I have missed out on entering this world for so long.I decided to begin reading this series in chronological rather than publication order (as per the numbers on my books) and I am so glad I did. This brilliantly sets up the rest of the series without giving any spoilers of what is to come. The particulars of the plot for The Lion, the Witch, and the Wardrobe are well known to me, as I have seen the movie adaptation numerous times, and it made reading this so special and exciting as facets from the second book were incorporated into the first.Regardless of the order, this is one series I believe has universal appeal, regardless of age, and is one that everyone must read at some point in their lifetime!"}, {"Review": "I hadn't been to Narnia in 11 years, and I wanted to take my daughters there for the very first time this summer, so I called my son (my Narnia expert) and asked him if I could skip The Magician's Nephew this time around, when I read it to his sisters. My son was an only child for 12 years, (before the Disney princesses, Pocahontas and Jasmine, arrived), and I read to him, every night, religiously, for an hour, including C.S. Lewis's Narnia collection. He's in college now, and he's a very respectful young man (not to mention a purist and a stickler), so there was a long, silent pause, then, “Well, yes, Mom, I think you need to start with Book One.”Oh, bother.“I barely remember it,” I groaned. “Can't we just go straight to The Lion, The Witch and the Wardrobe? It's so much more exciting!” Another patient pause, then, “Mom, I think you should read them in order.” (He's, like, so much more mature than I am).I was still hesitant, even as I started to read it to my daughters, but within just a few pages, I remembered why it's important not to skip it.I could intuitively sense, within the first few chapters, that this book influenced not only J.R.R. Tolkien, but Robert Jordan and J.K. Rowling, as well. I could feel it, I could feel the connection between their writings and this work.And I was reminded of how Polly and Digory (couldn't help but wonder about Rowling's Cedric Diggory here) are allowed to witness the birth of a world, along with Digory's reluctant uncle, the cockney Cabby and his horse, Strawberry. This was, for me, the most stunning part of the story, and C.S. Lewis does a beautiful job of capturing both the grandeur and awe of Creation here.If you had seen and heard it, as Digory did, you would have felt quite certain that it was the stars themselves which were singing, and that it was the First Voice, the deep one, which had made them appear and made them sing.“Glory be! said the Cabby. “I'd ha' been a better man all my life if I'd known there were things like this.”We all would have, sir. Well, all of us except Jadis. . . the evil Queen who reminds us how imposing, ego-maniacal and terrifying she really is. (I startled my daughters, twice, while imitating her speech). And Aslan. . . Does Aslan ever get old?I'll call my son and confirm that he was correct. Yes, you've got to read this one first."}, {"Review": "Despite the fact that The Magicians Nephew is the first book in the Chronicles of Narnia, strangely, it is frequently overlooked. People skip straight ahead to The Lion, The Witch, and The Wardrobe, and then, at a later date come back to this book.Personally, I like this book just as well as any others in the series. I love to see how everything got started, the lamp post, the wardrobe, the White Witch. Not to mention the beautiful allegory of Creation. The Magician's Nephew also has good morals, and I really appriciate that. I would recommend this book to anyone, boy or girl, old or young.3-4-14, edited to add:Please feel free to read and enjoy the series however you deem best. I haven't read any of the Chronicles of Narnia in six years, and now have very little opinion on the debate of what order to read these good books in. My previous opinion was based on my long-lived, chronological order reading preference. I liked to see things in a linear sequence. Of course this was AFTER my initial reading of the series, most likely in publication order. "}, {"Review": "Oh gosh, how many years must it be since I last read this book, 30 ? or more, who knows, but I zipped through it like we were the closest of friends who met every day. A true joy to read, that is how writing should be. Probably one of the lesser known Narnia books but the start of the series none the less and our first introduction to Aslan, and a delight to read. 5 stars all the way. I had no intention of starting this series this year or even anytime soon, but I saw the boxed set on the shelf and thought why not. What a great decision that was. If you’ve never read a Narnia book, you have to try it, if you have read them, never forget them and re-read as soon as you can, you will not regret it. "}, {"Review": "El sobrino del mago es un libro maravilloso, lleno de magia, de valores, de reflejos de una realidad actual, que me sorprende que se haya escrito hace años. Es una saga especial y confió a los padres estos libros para que se los lean a sus hijos, porque es de suma importancia que entiendan el mensaje, y los símbolos que tiene, además que el estilo es muy fresco y sencillo de ser interpretado. Nunca es tarde para leer las crónicas, siempre encuentras cosas diferentes, siempre te diviertes y nunca paras de amar el mundo que creó C.S. Lewis tan bello y sutil. Este libro es como una biblia para los niños, realmente me encanta volver a conocer a Aslan y la creación que hizo. Ahora de verdad espero tener algún tío con magia que me haga ser sobrino del mago."}, {"Review": "The Magician's Nephew tells of how it all started. How Narnia was created. How the first Sons of Adam, and Daughters of Eve \"traveled\" to Narnia. And, how the wardrobe came to be. A wonderful read, full of magic, wit, adventure, and hope.Next, Spoiler alert.I noticed that CS Lewis seemed to point out similarites between Uncle Andrew and his nephew, Digory. That's not a good thing. Uncle Andrew was selfish, un-caring, and really, a blundering fool. While reading, I often found myself wondering if Digory was destined to end up like his Uncle. But, my dear friends, I can happily tell you he does not. The power to overcome our weaknesses, our evil tendencies, and even our bad genes, is very real. Especially when we surround ourselves with good people, as Digory did. Though we may not always have all the power needed residing in our own being, know there is a much higher, and greater power to call on.The evil Queen Jadis, so horribly magnificent. She is obviously, the serpent of the story. I find it interesting that Queen Jadis had to be awakened, before she could cause any damage. Is that not how it really works? We let, and somtimes invite, our own serepnt in, even if we don't specifically mean to do just that. And it's usually through those weaknesses that it happens. Digory was a very curious boy. Digory woke her by ringing a bell that was sitting in the middle of the room. He had no idea what he was doing, when he did it. But sometimes curiosity overrides judgement. Polly, Digory's friend throughout the story, was never even tempted to ring the bell. I find she is a great support for Digory, even though they may be very different. Surrounding yourself with others with different strengths and opinions, help us to be balanced and reasonable.And of course, the regal and just Aslan. The king, the savior of the Story. I laughed throughout this book, but there were two times that I cried. You should know that Digory left behind a Mother who is deathly ill. He wanted nothing more than to have her be healed and well again. He missed her. Aslan sent Digory on a mission, to make up for awakening the queen, and thus bringing her to Narnia. Before he leaves, and Aslan asks him if he's ready for his mission . . . you know, I'm just going to put the whole segment here.  \"I asked, are you ready?\" said the Lion. \"Yes,\" said Digory. He had had for a second some wild idea of saying \"I'll try to help you if you'll promise to help my Mother,\" but he realized in time that the Lion was not at all the sort of person one could try to make bargains with. But when he had said \"Yes,\" he thought of his Mother, and he thought of the great hopes he had had, and how they were all dying away, and a lump came in his throat and tears in his eyes, and he blurted out: \"But please, please - won't you - can't you give me something that will cure Mother?\" Up till then he had been looking at the Lion's great feet and the huge claws on them; now, in despair, he looked up at its' face. What he saw surprised him as much as anyhting in his whole life. For the tawny face was bent near his own and (wonder of wonders) great shining tears stood in the Lion's eyes. They were such big, bright tears compared with Digory's won that for a moment he felt as if the Lion must really be sorrier about his Mother than he was himself. [and that is where I cried for the first time in the book] \"My son, my son,\" said Aslan. \"I know. Grief is great. Only you and I in this land know that yet . . .\"To make it a little shorter Aslan needs the seed of that fruit to protect Narnia from the Witch. \"\"Yes, sir, \"said Digory. He didn't know how it was to be done but he felt quite sure now that he would be able to do it.\"He is sent to a far away hill that contains a tree which bears special silver apples. These apples give you endless life. So he takes an apple, puts it in his pocket, and returns to Aslan. They throw the apple, and it plants itself in the earth, where a new, large and wonderful tree grows. And this is what happens next . . . [Aslan speaking] \". . .What I give you now will bring joy. It will not, in your world, give endless life, but it will heal. Go. Pluck [your Mother] an apple from the Tree.\" For a second Digory could hardly understand. It was as if the whole world had turned inside out and upside down. And then, like someone in a dream, he was walking across to the Tree, and the King and Queen and were cheering him and all the creatures were cheering too.\"So that second part when I cried was when I realized after all that this boy has been through, the struggles he's had to endure, the pain and sorrow, the healing and forgiveness. After doing Aslan's bidding, knowing he will get nothing in return, he does receive something in return. What he's wanted with his whole heart throughout the book. Because of Aslan. This kind, just, and merciful creator of Narnia."}, {"Review": "For Christmas when I was 9 years old, my parents gave me a box set of The Chronicles of Narnia. I read and re-read those books until they literally fell apart. I loved the magical story of Narnia, Aslan, the Pevensies, the White Witch, Mr. Tumnus, Eustace, Prince Caspian, Reepicheep, and all the other lovely characters in the series. I re-read this series every few years because the stories are still incredibly enjoyable for me. Religious allegory and symbolism never enter my head as I read this series.....I enjoy it as delightful children's fantasy and leave the author's religious views out of it. The books do impart important lessons on friendship, loyalty, cowardice and bravery, respect, forgiveness, and love. Just a lovely book series for children and adults alike!The Chronicles of Narnia is included in the list of 100 books and series for The Great American Read. So, as part of GAR, I'm re-reading this series. I started with The Magician's Nephew because even though this book was published as the fifth book of the series, it is a prequel to the other books explaining how Narnia was created. I listened to an audio book version of this novel. At just under 4 hours long, it was an easy afternoon listen as I did housework and worked in my garden. Kenneth Branagh narrated. He read at a nice even pace. Despite my hearing loss, I could easily hear and understand the entire book. It was great to re-visit an old favorite! I'm currently on my library's waiting list for the next audio book: The Lion, The Witch and the Wardrobe. I'm happy to be #16 waiting on 4 copies. The wait means that others are reading this lovely series, and that makes me happy! I have the \"real'' book on my keeper shelf, of course. But I'm going to continue listening to audio book versions until I've listened to the whole series. Up til now I have read the books, watched video versions....but never an audio presentation. Loving it so far! I totally support The Chronicles of Narnia being included in The Great American Read. I know as a young child the books gave me hours and hours of happiness....not to mention the British television series and the newer movies. Since the 1950s when the books were first published, this series has given so much joy and wonder to so many readers. It's just outstanding! If I had to pick a favorite book from the series, I would have to go with The Horse and His Boy (Book 5). Favorite character -- easy choice for me -- Reepicheep, the very brave mouse! The Magician's Nephew is the 16th book/series I have read or re-read for The Great American Read. Before all is said and done, I will have re-read all 7 books in the series. While I wait for The Lion, The Witch and the Wardrobe to come available at the library, I will move on and read other books from the list. I can't wait until the television series starts airing on PBS on September 11, 2018!! "}, {"Review": "Originally reviewed at Bookwraiths. The Magician’s Nephew by C.S. Lewis is one of those books I read just because. Because I’d read The Lion, the Witch, and The Wardrobe when I was a kid. Because I always wondered what exactly Narnia was. Because I’d watched all the Narnia movies with my kids. Because it was sitting on my son’s shelf collecting dust and it had a number one written on it: i.e. first book of the series. So because of all those reasons, I wiped the dust off of it and read it.This book isn’t about anyone I was familiar with from the other Narnia books/movies. Well, I guess Aslan is there toward the end, but honestly, the majority of the book is about Digory Kirke and Polly Plummer and that was okay, because their story was easy to grasp. You see, these two neighbors met, become friends then decide to explore the attic connecting their houses. Unfortunately, during their exploration, they accidentally go into the study of Digory’s Uncle Andrew, who is a magician. Hence the name of our book: The Magician’s Nephew. Once in Andrew’s study, Polly is tricked by Digory’s almost evil uncle into touching a magic yellow ring which causes her to vanish. It seems Uncle Andrew has been dabbling in ancient magic that allows one to travel between worlds. In order to save Polly, Digory is blackmailed by his uncle into testing another magic ring so as to follow Polly; our young hero also takes two green ones just in case they can actually try to return home. When Digory touches his yellow ring it transports him to a wood between the worlds where he finds Polly alive and well. Also, there is a series of pools which the two discover leads to separate universes. Of course, our two, young adventures decide not to immediately return home to England but to explore a different world and so jump into one of the nearby pools. Instantaneously, Digory and Polly find themselves in a desolate, abandoned city of some strange, ancient world, which they later learn is Charn. Inside an ancient building, which they surmise must have been a palace, they discover a huge room filled with statuesque figures of Charn's former kings and queens. These perfect statues are beautiful beyond compare but seem to degenerate from the fair and wise of the first to the unhappy and cruel of the later. Among these images from some long forgotten past, there is a bell and a hammer with these words written:Make your choice, adventurous Stranger Strike the bell and bide the danger Or wonder, till it drives you mad What would have followed if you had.The story of Narnia start with that bell. Everything else spirals out from the fateful choice placed before Digory and Polly on whether to ring that bell. Sure, the rest of the book reveals to us the creation of Narnia and its talking animals,, the origins of the lamp-post, the wonders of its first human king and queen, the first evil deed of the White Witch, and of course Aslan’s role in all of it. We are even told how the wardrobe becomes “the wardrobe” which ever after will transport some lucky few to Narnia. But it begins at the decision before the bell.All in all, this was a very entertaining story. If I was still a kid, I would have undoubtedly rated it much higher, but it was still well-worth my time, especially since it answered all the “how” questions about Narnia. For that reason alone, I recommend fans of the series give it a try."}, {"Review": "I've gotten so used to always having a new Narnia book to read when I feel in the mood and now I only have one more book to read. Then I'm finished! It's kinda sad actually lol But I really had a good time reading this one! Definitely another favorite! But who am I kidding? I've LOVED every Narnia book I've read thus far xD I would love to see this as a movie along with some of the others. I hope they continue making them! Anyone else feel the same? :P Great book all-in-all. Loved getting to see how Narnia got started!"}, {"Review": "Reading with my little girl. :)The formation of Narnia, of certain rings, and a lion's song. :) And, of course, apples.In certain ways, I liked the more than the first time and less as well. The first half was an awful old slog that had me as bored as my daughter while we were in dreary old England.But once we got to the fight in the streets and the chaos that drove the group to empty Narnia, I think we were both pretty excited. From then on, too.Quite nice to experience the backstory this way. Much better now as an adult, too. That light post sure means a lot more. :)"}, {"Review": "Even though The Magician’s Nephew was written as the sixth book of the Narnia series, the story predates The Lion, The Witch and The Wardrobe. Seeing as this served as the prelude to the series, I chose to begin with this. Lewis himself is known to have shown a slight preference to this order of reading, rather than in the order of publication. And the reason to why I have chosen to start reading a children’s book now relates to the arrival of a very tiny human being in the Paul household, exactly a month before Christmas to ensure her stockings and bow wrapped packages hold the ‘popper’(proper) gifts! Also, with the festive season looming, it seemed like a good time to get this one off my BBC Big Read reading list (which I only sometimes remember I am supposed to be completing!)Now, I am familiar with the story of Narnia and Aslan from the movies, but there is something to be said about reading one that strains beyond that knowledge to inspire the imagination. It is quite simple, and straightforward, but set in early 20th century England, it has a charm of its own. It bought back memories of books that I had read almost two decades ago, of secret passages and simple friendships, of the magic that waterfalls held, and talking animals! But even beyond all these, there is a power in the story, simple as it is, that it has remained ‘young’ and inspired so many years after it was published.The story follows two children, Polly and Diggory, who get manipulated by Diggory’s uncle to make use of two magical rings that act as portals between worlds. Of the many incidents that result from this, the children meet Aslan and the witch. Here, Lewis explores the creation of Narnia itself. And some conflict between good and evil has been thrown in for good measure. The book seemed to have been designed as a moral lesson to little children, in addition to being a fantasy story, and with some Biblical references thrown in, I suppose Lewis also wanted this to be a fun way to introduce them to religion. But what I loved best is that it answered many questions that seemed to have been overlooked in The Lion,... For example, why did the witch hate Aslan so much? How did the wardrobe end up being the portal to Narnia? What is the significance of the lamppost? The Magician’s Nephew answers these questions and many more, thus satisfying the vague forgotten questions I had had from the movies. The child in me is happy, and my niece has fallen asleep. It was a good read."}, {"Review": "I'm not really a fantasy fan, but I have always wanted to read the Chronicles of Narnia, especially after watching the movies. The Magician's Nephew, although 6th in the publication order, chronologically it is the first in the series. I read that C.S. Lewis himself had recommended reading this as the first in the series. Although written way later than the Lion Witch and the Wardrobe, I can understand why the author wanted the readers to start his Chronicles with Magician's Nephew. Here the readers are introduced to the world of Narnia and the great Lion - Aslan. It also introduces the characters of Jadis who will become the White Witch, Digory who will be Professor Kirke, and it also explains the famous lamp post in Narnia and the wardrobe through which the passage to Narnia was secured. The story is a beautiful introduction to the series was good. It sets the pace well for the chronicles to unfold. The creation of Narnia is so beautifully done and I felt so glad to have entered that amazing world. The read was interesting and engaging. I enjoyed it. Looking forward to read the rest of the chronicles in their chronological order."}, {"Review": "UPDATED REVIEW: Very excited about this one! :)INTRODUCTION – Once, The Magician’s Nephew was only three stars. It used to frighten me. It was different from the other Narnia books. But there were parts of it I liked very much and I tolerated the rest of it because it is, after all, Narnia. Then I read it again at the beginning of 2018 and enjoyed it in a way I had never been able to before . . . and raised my rating to four stars.I didn’t think I wanted to read it again in 2018, but since I planned on reading the whole series, my neat-and-tidy self demanded that I did . . . and I did . . . and The Magician’s Nephew finally snatched five stars from me, straight from the heart. THE SETTING – Lewis perfectly captured that 'new virgin land' feeling, the innocence of a new world and new creations. As the only book that partially takes place in the Western Wild, there is a wild, tangier scent to this novel, but it still smells like Narnia – a rich, satisfying smell that would make even the Bulldog “who resent things strongly” agree that this is undoubtedly Alive – and Narnia. The mood is very dreamy and rich \"as rich as plum cake\" and I was pulled irretrievably in. It is a little darker than the other Narnia books, but it still has the old sweet scent of Narnia - but a wilder, tangier scent - it feels different from all the other Narnia books. A great deal more of the story takes place in our World, as well – and Lewis perfectly captures that grimy, clattery feel of London – and yet it’s a Mary Poppin’s sort of London. Something magical might be sparkling beyond the greyness if only we look hard enough – or climb into the right attic. With its emphasis on portals, this book has more of a science fiction feel than the other books, and because it’s partially set in Victorian England, it could almost be called (dare I say it!) Steampunk. The setting of Charn, a dead and empty city, has a post-apocalyptic tone.CHARACTERS – Digory: He's so different from all of Lewis' other English boys - you can really see the budding scholar in Digory. The flame will burn him, but he HAS to touch it to make sure. Digory has an inherently curious and busy mind and needs to test and question everything around him. Naturally, in the form of a little boy who hasn't learned a lot of restraint yet, that will lead to complications. He has an ego that sometimes comes with being academic, and is very much afraid of looking foolish and often does foolish things to preserve his dignity. And yet, there is a sweetness to Digory, a depth of grief that is missing in the other young heroes of The Chronicles of Narnia. The arc between him and his mother is raw, beautiful, and heartbreaking. We rarely get to see filial love in The Chronicles of Narnia, and it was so precious to witness. I also noticed that, as a Victorian boy, Digory was the most gentlemanly of the English boys - always helping Polly in and out of things or up onto things. In some ways, he is the weakest of all the English boys in Narnia, but in other ways, he is the strongest, and shares an unusual connection with Aslan, for it only they that truly understand sorrow. Polly: Also vastly different from any other English girls in the Chronicles of Narnia. She’s quite feminine and yet there’s such a toughness to Polly – there’s nothing giggly or soft about Polly’s femininity. Far less emotional than other Narnia heroines, Polly has an immensely strong will and a strong personality – she goes toe-to-toe with Digory without flinching and sometimes wins. She’s quite determined, and one rather gets the idea that if she had a little brother, she might bully him a bit. It’s clear that Polly’s occasional pugnaciousness will one day be refined into immovable strength. Polly can be curious about small things, but when it comes to the big picture, she opts for safety and practicality, she is perhaps one of the most practical characters in Narnia but she is not a whiner about it. But even though she wants to go back to London after entering the Wood between the Worlds, she doesn't whine about it as Susan Pevensie did when she wanted to run home through the wardrobe. Polly can be afraid but she doesn't let it control her. There's a good, old-fashioned stouthearted Victorian quality to Polly. You can easily see how this young girl growing into the independent character of Last Battle who is a perfectly happy, single woman. Digory and Polly - The Duo: Every set of children from England is so different in The Chronicles of Narnia. Polly and Digory are a far more clinical, studier lot than the children that come after them. They act older and far more self-reliant, as opposed to the more child-like Pevensies. They are far more polite than the liberalized, bad-mannered Pole and Scrubb, nor are they complainers, but put their heads down and do what has to be done. I loved how Lewis showed a very subtle and brilliantly done culture shift through his three sets of British children, and as far as their general tone, Polly and Digs might be my very favorite, because of their no-nonsense, mini-adult charm. Frank:He might be a cab driver, but he is a true King. I love Lewis’s fondness for focusing and elevating the ordinary man, acknowledging that the ordinary can be truly great. You rather get the feeling from other authors (Tolkien does come to mind again) that no mere common citizen could ever become King. I loved the gross disregard Lewis has for someone’s class or the British social hierarchy. Frank might seem simple, but we see a core of faithfulness and goodness – a Goodness that contagious, and a Steady Heart is as irresistible as a warm fire on a cold night. From the very moment we are introduced to him, we see a kindness under the rough edges. The moment our heroes are plunged into emptiness, it is Frank who keeps everyone calm and advises that they sing a hymn and we know that here is a man who is not only spiritual, but knows where to turn during disaster – and that is what makes him great. Lewis shows that kings and queens are just ordinary people. We also, are just ordinary people, and yet God will make His ordinary children rulers. The Talking Animals: Oh these darling, darling animals! I cannot express enough love for these creatures. Very few authors can accurately portray true innocence – but Lewis can. I rejoiced in the boundless and joyful innocence of these dear animals. These, sturdy, good-hearted and thoroughly British animals, blessed with Life by the Lion and romping for the sheer joy of it. Lewis used his talking animals to show that there is nobility in servitude and submission, and beauty in the unclutteredness of a simple spirit. I adored every one of these thoughtful and humorous creatures so much. But I must give special mention of Fledge, who, unlike the other animals, started out as a very ordinary, dull beast and was given new, magnificent life by Aslan (while still retaining that sturdy personality). The only Pegasus ever mentioned (or at least dwelt on) by Lewis, Fledge is definitely a wonderful character. Aunt Letty: I had to mention her. I love that there is nothing pathetic about Aunt Letty. She's a spinster shouldering the full responsibility of a child, a good-for-nothing, and an invalid, but despite what some people would call being \"beset on all sides\" there is nothing self-pitying about Aunt Letty. She is sturdy, steady, no-nonsense, and \"holds the line\" with admirable elan. Aunt Letty, in all her brevity, is nothing short of a delight. Speaking of Aunt Letty requires me to mention all of the other tiny characters sprinkled throughout this book - the bobby with a small pencil, the singularly saucy crowd mocking Jadis, the maid who enjoys all the carnage and spectacle, and even the poor, dear guinea pig. Lewis is a meticulous and thoughtful author who doesn't overlook a single character - and gives a happy ending even to guinea pigs.Uncle Andrew:Uncle Andrew: I think all authors could benefit from studying this character. Most writers style their villains off of Jadis - evil arch villains. Uncle Andrew is a human villain, and as such more unique, more humorous, more pathetic . . . and more dangerous. Jadis is a representation of spiritual evil, but Andrew is the representative for human evil – and true evil is “an unblinking gaze at Self.” Uncle Andrew is an academic, like Digory, and utterly in love with the sound of his own words and his own flawed reasoning. He is enamored with the idea of his quest, with the idea of being a benefactor and a genius – and, naturally, he is nothing of the kind. His true love is believing that he is “misunderstood” – and there is probably no other hill that he would chose to die on then to revel in the status of being “misunderstood” – even though the reader understands him entirely. Andrew is the dangerous and pathetic character of a man trapped in the refuse of their own shallowness and spiraling rapidly down the drain of self-destruction. But even those he is despicable, Lewis portrays him with a kind of pitying tone, as indeed, we pity all those who stand against the True King. Jadis: I am so tired of the villains in fantasy—they are always painted so lavishly, their darkness is so awful. The fear they invoke seems unavoidable, their cruelty undefeatable. But then we have Jadis, one of the best allegories for Satan I’ve ever seen—a twisted, petty, small-minded, overblown, cruel bully. Here at last, at last, is Evil as portrayed as it truly is—fleeing before Light. There is a feeble act of defiance and rebellion here and there, but it is always skulking in the shadows, but when the Lion approaches, Evil shrieks and flees. One of the reason I grow frustrated with Tolkien and so many other fantasy authors; evil is given too much respect, too much power, too much dignity, and those attributes should never be attributed to evil. Evil may be powerful, but it is not all-powerful. Satan has what he truly wanted—enmity with God—and in having what he wants, he is forever doomed to despair, fury and Hell, and we see that picture painted so clearly with Jadis, as she bites into the apple from the garden, gaining what she desires - and still finds nothing but defeat.Truth upon truth, as Digory and Polly come to understand the villains, themselves, and Aslan better and better – they are less afraid of Jadis. They are wary of what damage or complications she might inflict, but fear no longer controls them – THEY control each encounter with her. They fully understand that they have the power to escape her tricks and attacks – and if they cannot, their trust lies in a far greater Person than Jadis. Aslan is more powerful than Jadis and is it Aslan that will save them. Aslan: Which brings me to Him. All Narnia stories are always, ultimately, about Aslan. Always, always – it is about Aslan. Every other character, every scene, is merely dough for the filling, skin and ligaments surrounding the Heart—a beautiful, sacred Heart that beats with unending Love. In every book, Aslan grows bigger as I grow older. In every book, we see a new side of Aslan, with every re-reading. Here, in The Magician’s Nephew, we see him as Creator – and it is a wondrous sight. That glorious lion, singing the song I love best of all, the song of life. And yet, we see a foreshadowing to His ultimate sacrifice. Even surrounded by New Life, there is a moment of grief between Digory and Aslan – but when the grief is shared and put into perspective, there is beauty in it, and it belongs. This Great and Terrible Beauty, this, Aslan’s introduction, firmly establishes, his might, his majesty and his dignity. There is a prostration here before Aslan that, I think, is a tad stronger than the other books, for this is where the tone is set for the rest of the series. This is the point where we acknowledge Him as the Core, the Song, the LifeGiver, the Lion who Must be obeyed, the King we must surrender to. Aslan is merely the reflection of the One I love – but what a beautifully and humbly crafted reflection. SPIRITUAL THEMES – This book is a bit darker than the rest of the series, partially, I think, because one of the main themes of this book is man trying to make things happen on his own outside of God’s will. Fiction nowadays will show us anything but this . . . that to surrender to God’s will is our calling. Fiction is glutted with characters trying to do things their way, railing against God, making deals with God, ignoring God. But here at last, in Aslan, we get a portrayal of God that will not be ignored. Here, in these young children flailing in their reasoning, doing the unthinkable in modern fiction – humbling themselves before the Divine. Until we surrender utterly to him, we’ll never be at peace. Until we are at His mercy, we can’t receive His mercy. There is also incredibly moving themes about pain in this story. Digory bears a heavy weight of loss. I connected incredibly with Digory during this reading and his quest to be free of the hurt he holds. Jadis’s cruel temptation stabbed my heart. “You can be like other boys.” Oh, the cry of everyone holding hurt!—to be like other people. As if we are the only ones carrying pain!— and yet, we are trapped in our aloneness, trapped underneath our own weight. Until we give it to Aslan. At first, Digory struggles to find solutions with his own power and strength and inevitably falls into sin and is pressed even deeper into the pit under the force of failure. We cannot make deals with God—to do so is not only the height of disrespect, but shows how little we know Him. One does not bargain with a King. And finally, at the end, Digory sees the truth of that. The scene where Digory asks Aslan if he will heal his mother brought tears to my eyes. Surrounded by excitement, joy and newness, and yet Digory feels slightly removed because of the burden he carries. The new life is around him, he has been obedient, but the life and joy has not yet entered his heart. Until he finally learns to stop asking. At the end of the adventure, Digory is no longer asking for favors or seeking healing—He looks into Aslan’s eyes, and he is content. He stops asking – it’s enough just to know Aslan. I didn’t expect to find myself in you, Digory, but I did. Your journey is my journey too: I understand it intimately. The true healing was looking into Aslan’s eyes. It is when we stop trying to force the King to our will, that we find His hand is open, reaching out to us, and full of miracles. In the end (as Digory cuts down the magic tree and builds a wardrobe) we are filled with promise. Like a balloon billowing with a burst of air, we are filled up and caught up into a limitless sky. And that, ultimately, is the theme of The Magician’s Nephew—promise. Lewis lays down a groundwork of faith in The Magician’s Nephew– teaching readers that God’s promises can be trusted, that His promises will come to pass, and that His promises are greater than anything we could accomplish on our own or anything our minds could ever conceive."}, {"Review": "I thought this book was so beautiful. Favorite quotes/parts:\"He put on a very high, shiny, stiff collar of the sort that made you hold your chin up all the time. He put on a white waistcoat with a pattern on it and arranged his watch chain across the front . . . He took his eye-glass, with the thick black ribbon, and screwed it into his eye; then he looked at himself in the mirror.Children have one kind of silliness, as you know, and grown-ups have another kind. At this moment Uncle Andrew was beginning to be silly in a very grown-up way. Now that the Witch was no longer in the same room with him he was quickly forgetting how she had frightened him and thinking more and more of her wonderful beauty.\"\"When the great moment came and the Beasts spoke, he missed the whole point; for a rather interesting reason. When the Lion had first begun singing , long ago when it was still quite dark, he had realized that the noise was a song. And he disliked the song very much. It made him think and feel things he did not want to think and feel. . . . And the longer and more beautiful the Lion sang, the harder Uncle Andrew tried to make himself believe that he could hear nothing but roaring. Now the trouble about trying to make yourself stupider than you really are is that you very often succeed. Uncle Andrew did.\"\"'But please, please - won't you - can't you give me something that will cure Mother?' Up till then he had been looking at the Lion's great feet and the huge claws on them; now, in his despair, he looked up at its face. What he saw surprised him as much as anything in his whole life. For the tawny face was bent down near his own and (wonder of wonders) great shining tears stood in the Lion's eyes. They were such big, bright tears compared with Digory's own that for a moment he felt sure as if the Lion must really be sorrier about his Mother than he was himself. \"'My son, my son,\" said Aslan. \"I know. Grief is great. Only you and I in this land know that yet. Let us be good to one another.\"\"Do not fly too high,\" said Aslan. \"Do not try to go over the tops of the great ice-mountains. . . . There will always be a way through. And now, be gone with my blessing.\"\"'Oh - Aslan, sir . . . I forgot to tell you. The Witch has already eaten one of those apples.' . . . 'Child,' he replied, 'that is why all the rest are now horror to her. That is what happens to those who pluck and eat fruits at the wrong time and in the wrong way. The fruit is good, but they loathe it ever after.' . . . 'I - I nearly ate one myself, Aslan,\" said Digory. 'Would I -''You would, child,' said Aslan. 'For the fruit always works - it must work - but it does not work happily for any who pluck it at their own will. . . . And the Witch tempted you to do another thing, my son, did she not?' . . .'Yes, Aslan. She wanted me to take an apple home to Mother.''Understand, then, that it would have healed her; but not to your joy or hers. The day would have come when both of you would have looked back and said it would have been better to die in that illness.'And Digory could say nothing, for tears had choked him and he gave up all hopes of saving his Mother's life; but at the same time he knew that the Lion knew what would have happened, and that there might be things more terrible even then losing someone you love by death. But now Aslan was speaking again, almost in a whisper:'That is what would have happened, child, with a stolen apple. It is not what will happen now. What I give you now will bring joy. It will not, in your world, give endless life, but it will heal. Go. Pluck her an apple from the Tree.'\""}, {"Review": "“A damn fine woman.”The Magician's Nephew is about the beginning of Narnia. Two children, Polly and Digory, are pushed into an adventure that leads to an unexpected, magical world by Digory's Uncle Andrew. What do the children's curious eyes discover, and what mishaps lay before them? The Magician's Nephew is the prequel to the Chronicles of Narnia.At first I was unsure where to begin. Should I start chronologically here with The Magician's Nephew, or should I start by publication with The Lion, the Witch, and the Wardrobe? It was a very serious question for a moment, by I decided with The Magician's Nephew, because I like to do things in order. Was it necessary? Probably not. While reading I somewhat felt like you needed some information about the series, to spot the important aspects, for instance the wardrobe. I never read the series, but I did watch the movie, so I felt like I could question how things started. Like, how did the wardrobe come about? Maybe, this book is better to read after you finished the series, but whatever floats your boat. The Magician's Nephew is a charming, adventurous, and brightly imaginative children's novel. I absolutely adored every moment of it. No wonder it is a classic, and I cannot believe I never read this book, nor the series, before now. I must of been a lame child. I loved the idea of how the children were transported into different worlds. I believed that was done impeccably, and I could imagine my childish heart hyperventilating at the thought of transporting me into another world. How many times I imagined myself visiting another place by going behind a curtain, or opening a door when I was younger. Probably a billion times! I thought it was so relatable to children, and to quote Anne from Green Gables, it brought a \"scope for the imagination.\" I loved it. Once we walked into Narnia, it literally warmed my heart. It was like sun streaming through clouded weather. There was this spark I felt while reading this book that I cannot really describe. I felt it before while reading the The Lord of the Rings Trilogy, but I knew it was because of how beautiful Tolkien described his world. Maybe, it was my childish imagination running wild that brought on this warming spark, but I would like to travel to Narnia soon. I bought all seven novels recently, and they should come into the mail today. I cannot wait to read them. Polly and Digory are cute, smart, curious children that I again felt relatable to children. Their personalities felt realistic. They had curious natures that lead them to another world, but still being grounded by the consequences for their actions. They were real to me, even if some of the adults were not. But the adults were not the focus. The one thing I did not care about, but didn't break the story was the biblical portions. It is fine that it was in there. It was simple stories about Adam and Eve, and the seven days to create the world. It was okay, but I wasn't really sure what he was trying to do or say here. If he was religious that is cool, it get it. I wish he was more creative here, and created his own world his own way. If that makes sense. Kenneth Branagh did an amazing job narrating this classic novel. He modified his voice for many of the characters, which is most appreciated. You could find this book on Hoopla.The Magician's Nephew is a charming, adventurous novel, that I plan to re-read. I hope to read it to my daughters when appropriate. I would really love to show the magical world to them, and hope they have the same feelings as I did. Happy reading!blog: www.dancingbetweenthecovers.com"}, {"Review": "¡Narnia, Narnia, Narnia, despierta, ama, piensa, habla!Me gustó mucho, el libro se me hizo super rápido de leer y la historia de cómo se formó Narnia es simplemente maravillosa. Polly y Digory son geniales, los ame muchísimo juntos, tan chicos y lindos descubriendo juntos sus aventuras y sus peleas debes en cuando, me encantaron.(view spoiler)[ Una estafa que no quedaran juntos para el final, los shippeo aunque sean unos niños apenas. (hide spoiler)]Muy entretenido, fácil de leer y que te va adentrando muy bien a la saga, realmente me gustó mucho. "}, {"Review": "I somehow missed out on reading the Chronicles of Narnia when I was a child and recently my roommate bought a box set of the entire series so I figured what better time to amend my ways? I honestly didn't know anything about Narnia when I started The Magician's Nephew because I haven't seen the movies or read the books before and I didn't expect to like it as much as I did. C.S. Lewis writes with such a fun and whimsical style that I was drawn into the story pretty quickly. My favorite thing about this book was getting to see the origins of Narnia and how a lot of the iconic Narnia imagery such as the lamppost and the wardrobe came into being. The book had such a beautiful quality to it and the illustrations in the edition I read were absolutely gorgeous. I'm a little angry with myself for never having read this as a child because little Loran would have loved these stories so much. I cannot wait to pick up the second book soon and continue on with the story!"}, {"Review": "I loved the Chronicles of Narnia as a child and was excited to read this with my 8 year old son. As a child, I thought it was so magical and amazing that these children got to escape to different worlds. As an adult, I now see the parallels to the bible, and the messages it is intending to teach. The end of the book becomes a retelling of sorts of the story of the creation story from the bible. I must say my remembrance of the book was that of a 5 star read, but in re-reading it, I can only give 4 stars. My son, although very interested and attuned to the storyline throughout, I think would agree.I will keep this review short as there is so much already written about this novel and instead of providing discussion questions, I will simply provide links. To see them, please visit http://www.book-chatter.com/?p=471."}, {"Review": "\nInstagram || Twitter || Facebook || Amazon || PinterestMy mom used to read me THE LION, THE WITCH, AND THE WARDROBE when I was a little kid. I had always assumed that that was where the story began and it wasn't until fairly recently that I'd learned there was a different order to the books apart from publication order, where you could read them chronologically, in the order that the events within happen in the Narnia universe.THE MAGICIAN'S NEPHEW was the second to last book published but is the first in the chronological order to the series, and by sheer luck, I managed to pick up the entire series as reprinted by HarperCollins and for some reason they decided to number the books chronologically, so this book is #1. Confused, yet? Don't worry, I am, too. I actually think that THE MAGICIAN'S NEPHEW is a really cool place to start if you don't mind a few minor spoilers because it's in this book that you learn about the origin of not just the Witch but also Narnia herself.This book stars two Victorian-era children named Polly and Digory, who despite their different sets of circumstances, go from being neighbors to being friends and exploring, as children like to do. Digory's uncle is a Grade-A creeper, though, and forces the children to become unwilling participants in his magical experiments, which ends up taking them to several different worlds. The use of \"dust\" and the idea of the multi-verse being accessible through magic gave me strong His Dark Materials vibes, and I thought fondly back to my first pleasurable reading of Phillip Pullman's GOLDEN COMPASS. I'm almost certain that he was inspired by this book in particular, and I was surprised by how chilling Charn was, and how haunting the last page of this book was, when everything is brought full circle, leading quite neatly into THE LION, THE WITCH, AND THE WARDROBE (or, if you're reading in publication order, providing a nice callback to the events of the actual \"first\" book).Really, I think it says something about how these books were fleshed out that the reading order is so flexible and still makes sense, despite being read in various orders. Now that I've finished THE MAGICIAN'S NEPHEW, I think I prefer starting the books in chronological order because the back story this one provides is so rich and good. Polly was a great character and Digory is one of those selfish characters redeemed, rather like Edmund or Eustace from some of the earlier Narnia books. You also get to learn the Witch's name, and it's funny; she sounds like a Sailor Moon villain.I'm really glad I picked up these books and finally got around to reading them. They're YA and sound like YA, but once you can get over the way the narrative sometimes talks down to you, the story-telling is very good and will make you so nostalgic for the times when you were a kid and still believed the veil between fantasy and reality was so much thinner than it was. I won't tell you how many times I hopefully, and sadly, worked my way into the back of my own closet and pressed against the wall, wishing it would transport me into a world of endless winter filled with centaurs and talking animals and magic. Alas.3.5 to 4 stars"}], "Image": "https://images.gr-assets.com/books/1308814770l/65605.jpg", "Desc": "The secret passage to the house next door leads to a fascinating adventureNARNIA...where the woods are thick and cold, where Talking Beasts are called to life...a new world where the adventure begins.Digory and Polly meet and become friends one cold, wet summer in London. Their lives burst into adventure when Digory's Uncle Andrew, who thinks he is a magician, sends them hurtling to...somewhere else. They find their way to Narnia, newborn from the Lion's song, and encounter the evil sorceress Jadis before they finally return home."}