{"Genre": "Fantasy", "ID": "136251", "Name": "Harry Potter and the Deathly Hallows", "Reviews": [{"Review": "“I’m going to keep going until I succeed — or die. Don’t think I don’t know how this might end. I’ve known it for years.” — Harry PotterMost seventeen-year olds don’t view the possibility of an early death as being, well, possible. But then again, most seventeen-year olds haven’t come face-to-face with death almost half a dozen times before their first kiss either.In Harry Potter and the Deathly Hallows, the seventh and final installment of the ridiculously popular Harry Potter series, J.K. Rowling brilliantly ties up every loose end that she has planted over the last ten years since the very first outing of the series was published in 1997. Truly, Rowling has learned exactly what her fans want and subsequently delivers a book that answers every Potterhead’s questions — and then some. Not only does Deathly Hallows revisit key places and characters from all of the previous six books, but Rowling even manages to make clever references to previous bits of dialogue from her earlier books. Case in point: near the end of the first Potter book, after Hermione fails to see the magical solution to saving the trio from a nasty patch of Devil’s Snare, Harry’s best mate Ron bellows “HAVE YOU GONE MAD? ARE YOU A WITCH OR NOT?” Now, six years later, Hermione finally gets her revenge on her red-headed friend when Ron believes that all is lost until Hermione yells to him “Are you a wizard, or what?” thus reminding Ron to use his wand to solve their problem. Subtle references such as this are a large part of what makes Rowling’s books so enjoyable to re-read as there are always deeper meanings and additional allusions that are often only discovered via multiple read-throughs.Harry’s bold statement regarding his own potential death is also a prime example of how much Rowling truly wrote Harry’s last tale for her long-time fans. This line seems to read as a secret “shout-out” to the Potterites who have also known for years that the series might not end happily ever after. The prophecy in the fifth book revealed that “neither shall live while the other survives”, and therefore by the end of book seven either Harry or Voldemort had to die. Rowling cleverly fills her last installment with so many twists, turns and complications, however, that it becomes practically impossible to determine which way this book is going to end. More than any of the other Potter books, Deathly Hallows is a true quest narrative, with the trio spending the majority of the story hunting for horcruxes and hallows whilst evading capture by Voldemort’s Death Eaters. The multiple close-calls that all three main characters find themselves in throughout the book add to the tension that continues to build until the predictably bloody battle at the end of the tale. The book does, after all, chronicle a brutal war, so be prepared for a lot of killing and, consequently, a lot of tears. This is not to say that Deathly Hallows doesn’t offer up a great deal of laughs as well. The hilarious twins Fred and George Weasley make several appearances to ensure that the book isn’t all doom and gloom. By far, the funniest part of the story is the secret radio show Potterwatch, anonymously hosted by former Hogwarts Quidditch commentator Lee Jordan with special appearances from Fred, George, and ex-Defence Against the Dark Arts professor Remus Lupin. Rowling perfectly mixes this blend of humour, tragedy and adventure so that her epic-length novel never lags or drags.To write a 607 page book that millions of die-hard fans around the world are able to devour in less than 24 hours is no mean feat, but Rowling’s farewell to the Boy Who Lived is an incredibly gripping page-turner that will leave all Potter lovers immensely satisfied."}, {"Review": "It's hard for me to believe that I finished the Harry Potter series... I wish this series would go on forever!I don't know how I've gone through my life without these books. I regret not reading it when I was younger, but I am so happy that I finally did, better late than never, right?The world built in these books is so real and tangible, it is truly a masterpiece. The characters are engaging and brilliant, and I love how the plot is so interwoven and twisted within itself, especially in this last book.I was taken by surprise when I started the series, I didn't think it would pull me in as it did. As I kept reading through the books, the characters slyly stole my heart. Now, having finished the last line, I am flooded with emotion. This series is more than a story or words on a page, it is magic."}, {"Review": "Ok, before I start a few warnings. This will contain spoilers (though since I'm writing this a year after the release I don't think it's too much of a tragedy), it will be long and it will be negative because I really didn't like this book.Reading books one to five I was very impressed with the storytelling from a novice novellist. There was magic, there were characters you could love, and sure there were some cliche'd storylines, but they were interspersed with really interesting sidestories (Peeves, SPEW, Weasley's Wizard Wheezes). I was enthralled as a teenager and I am enthralled now as an adult when I re-read them.But I have to say the the quality dropped markedly in books six and seven. The ramblings (that started out cute in GoF and OotP) have become pronounced and boring. The characters have lost much of what made them endearing, and the plot has gone to hell.Focusing on Deathly Hallows, I had a very strong feeling that six months before her deadline, JKR went on to the internet, discovered that everyone had guessed her 'twists' (honestly, who didn't know that Harry was an accidental Horcrux, RAB was Sirius's brother, the diadem was at Hogwarts, the locket was at Grimmauld Place, Dumbledore ordered Snape to kill him, Snape was in love with Lily and Ron would be a it and abandon Harry and Hermione?), and felt the need to come up with a new plot device. This would explain the incredible stupidity that is the deathly hallows and the plot holes and gaps in logic that involve them.Now, it has been a while since I read it so some of my names and such might be wrong, and if it does answer the questions in the book in such a round about way I apologise, but the Elder Wand does not make sense. I'm willing to accept that it follows it's own set of rules separate from those of other wands (where Haary can use Hermione's wand almost as well as his own and all of the disarming they did in book five didn't make their wands all change ownerships) but the course of events whereby Harry became the owner of the wand are just plain silly. If Grindelwald simply stole the wand from Gregorovich (sp?), how did that make him the wands owner? If the wand is unbeatable, how did Dumbledore defeat Grindelwald (I know Rita Skeeter theorised that Grindelwald surrended, but how does that pass the wand's ownership to Dumbledore. Surrender is not the same as defeat). And if the wand is unbeatable, why was Dumbledore unable to defeat Voldemort when they dueled on OotP? And also, is Harry really so conceited and stupid to think that no one would ever defeat or disarm him, making them the owner of the wand? Shouldn't he have broken it? If he does become an auror in later life someone is bound to disarm him eventually, and if they knew about the wand, they could easily steal it back from Dumbledore's tomb.The other major thing that ticked me off was the characterisation. Hermione, Harry and Ron have always been some of my favourite characters, but here they are acting completely different from previous books. Harry using Unforgivable curses without a hint of remorse, and not comforting Hermione when Ron takes off, instead staring at a 'Ginny-dot'. Can we say creepy and stalkerish? And Hermione, who for the most part was still loyal and brave and smart (loved the bottomless bag bit, and her being there for Harry at Godric's Hollow), was so pathetic when it came to Ron. I know love makes people do the wacky, but crying for days on end when they're supposed to be searching for Horcruxes, kissing him in the middle of the war because he finally showed a tiny inkling of care towards the house-elves. And Ron. Gah! I mean, I love Ron, but you would have thought he could have grown up a little, just a smidgen. But no, running away because of the locket (one ring to rule them all...). Those who defend him saying it affected him more than Harry or Hermione because he had more insecurities is just dumb. Harry and Hermione had just as much to be insecure about. Harry, with his saving-people-thing, could easily have gone nuts with the locket around his neck and ran away from the others because he was terrified that they'd get killed. And Hermione has always been insecure, about being Muggle-born, about proving herself, about Ron and Harry and their friendships. Sure, he wanted to come back the moment he left, but he still left. Which I could accept were it not for such a stupid reason. And then he got his 'super-moment' which was so lame. Honestly, 'Ron can remember and copy paseltongue', uhuh. Wouldn't it have made much more sense to say, have Ginny come along, who could possibly still say the word from when she opened it under Tom's control in CoS. And then Ron mentioned the house-elves, to make himself 'worthy' (JKR's words, not mine) of Hermione. For one thing, why does he need to make himself 'worthy' since she already loved him for all his insensitivity and insecurity, and why did that 'worthiness' have to be something that Harry already had in abounds?Yes, I am a H/Hr shipper, but that is by no means the reason I hated this book (as you can see from above). If H/Hr had been handled as badly as R/Hr or H/G, I would have hated it. But the fact remains that the most romantic scenes in this book were between Harry and Hermione. At Grimmauld Place when Harry showed Hermione the picture, at the wedding where Hermione beamed at Harry, at Godric's Hollow where they strolled arm in arm under the kissing gate in the snow. While in canon, Harry married Ginny and Ron married Hermione, that will never convince me that they are the better couples. Harry and Hermione had the friendship, the trust, the alchemy. They were the most developed relationship in the series, and the fact that they didn't end up together in the book doesn't change that.The final things I feel like picking on - the epilogue came across as being written by a teenage fangirl. No depth, no meaning, just stupid-named kids. I get that JKR wanted Harry to end the book with the normal family life he never had, it could have been handled so much better. And seriously, Albus Severus? That poor kid must have been teased horribly. And why Severus? Sure, he turned out to be not evil, but for Harry to chance his mind about the man after seven years of abuse and ill treatment just because he was scamming on Lily. It's just gross. And unrealistic. I was so hoping there was more to Snape's story than twenty years of unrequited love. Gah. It may have been a sweet way for him to become not evil, but Lily was very, very dead for a very long time, and no one holds on that hard to love. If caring for her wasn't enough for him to stray away from the dark arts while she was alive, why was it enough when she was dead?Also, the invisibility cloak was supposed to be infallible, and yet Moody saw through it in OotP and Dementor's could see through it in PoA, supposedly. And, my god did the death scene's suck in this book. Yes, its a war so plenty of people, including main characters were going to die, but when I felt worse about Dobby than I did about Remus (who is one of my favourite characters) you just know that the author hasn't put enough emotion into it. He was the last of the Marauders, for god's sake, he deserved an on-page death at the very least. Maybe defending Harry or Tonks. Something!Well, there ends the rant. There were a few good points in the novel (like Godric's Hollow, before the stupidity of Harry not realising that Bathilda was Nagini, and the awesomeness of Neville) but they were few and far between and do not at all make up for the rest of the drivel.Read it because it is the conclusion to a series that took seventeen years to write, but do not expect the fireworks that such a finale could have been. There's better fanfics out there."}, {"Review": "This is just a pithy review on the Harry Potter series as a whole. It is not an in-depth analysis of the work in general, nor is it a review on any one particular installment.Harry Potter is a work of art. I got made fun of once¹ when I was out to dinner with some friends, because while we were discussing these books I made the mistake of referring to them as “literature.” I felt like I had to defend that assertion because, although the definition of literature is pretty broad, it seems like it should really only apply to works with some definable qualitative value or literary merit. In this case, my friends were wrong—Rowling explores themes and concepts in this series that I think are valuable to children and young adults who look to her characters for qualities they seek to emulate, and I believe her works will have lasting impact on this and future generations.I’ve heard it said before that everything you need to know you’ve learned in kindergarten. Well, that might be somewhat of an oversimplification, but I do think children or young adults who grow into this series, seeing Harry and his friends mature as they themselves mature, can glean some pretty important life lessons from it. They are impressionable human beings who are learning about themselves and are starting to make the choices that reflect the kinds of people they want to be.So what does Harry Potter teach them? Well, here is a bullet list of what it has taught me. And if you’re good, I’ll think about turning this into a PowerPoint presentation. Or maybe not.• The quality of your character is not a reflection of where you come from or who your parents are; rather, it is a reflection of the choices you make, so make them wisely.• The way you treat other people, especially those less fortunate than you, reveals your true colors more quickly and more completely than almost anything else you do.• It is a good thing to have dreams and ambitions, but that alone is not enough. You cannot expect success without effort.• It is far less important what your abilities are than what you actually do with them. Your abilities alone do not define you.• Nobody likes to fail, but to refuse an attempt at success on the grounds that you’re afraid to fail is failure in itself.Growing up is about figuring out who you are and coming to terms with your strengths and weaknesses, and it is about deciding how to utilize the strengths and mitigate the weaknesses in order to become a better person. It’s a lifelong struggle, but it starts early, and I think Harry Potter offers the tools to help achieve that. It can help young people find their way, and maybe that’s an oversimplification for a seven-volume series of novels, but that’s what I got out of it, and that’s why I will recommend this to my kids as they start to become ready for some life lessons of their own.¹This is misleading; I’ve been made fun of countless, countless times."}, {"Review": "هذا ريفيو رواية هدفها الايمان بالخير، التغلب علي الشكوك وزعزعة الايمان وإيجاد القوة الذاتية للتتغير للحقرواية عن الصداقة والحب الذي قد يغلب اي انواع السحر..الظلم والقهر والعنصريةفي كل جزء بالنسخ الأنجليزية تهدي المؤلفة الكتاب لاحد اقاربها أو معارفهاولكن بالجزء السابع ستفاجأ إنها مقسمة الاهداء الي 7 ، منهم إليك أنت شخصيا\nAnd to You, If You Have Stuck With Harry Until The Very End\nوأنا لم اكن فقط ملاصقا مع هاري منذ سبتمبر 2002 منذ قرأت أول كتب السلسلة.. والتي كانت تجربة مختلفة تماما عن مشاهدة الفيلم ، بل وحتي أبطالها -بدون مبالغة الأكثر حيوية من أي أبطال روايات قراءتها.. برغم من أنها رواية خيالية إلا أن أحداثها مرتبطة جدا بعالمنا الحقيقي، وشخصياتها كلها ستشعر بنبضها وانت تقرأها- شعرت أن الأبطال اصدقائي بالفعل، وأني فعلا أعيش معهم في مدرسة تعليم السحر \"هوجوارتس\"، والتي يمكن القول انها كانت بيتي الجديدولكن دعني اؤجل حديثي حول تجربتي الرائعة مع ملحمة هاري بوتر ونتحدث هذه المرة عن هذا الجزء الذي بين أيدينا\"هاري بوتر ومقدسات الموت\"الاحداث*****قبل صدور الجزء الاخير ، لم أكن أتخيل كيف ستنهي المؤلفة كل الأحداث و المشاكل والمهمات التي تواجهه هاري ورون وهيرميوني ... خاصا بعد وفاة دمبلدوركيف سيجدوا الأربع الهوروكركسس المتبقية التي تحتوي علي أشلاء من روح فولدمورت ، كيف سيتعرفون عليها من الاساس ، وهم وحدهم بدون مرشد أو دليل، وفي النهاية كيف سيتم تدميرها؟ثم كيف سيقوم الأبطال بعد ذلك بمواجهة فولدمورت نفسه ؟ واتباعه من اكلي الموت و سناب الخائن الذي قتل دمبلدور؟أعتقد إني -ولست وحدي- ظن أن النهاية ستكون إما متسرعة لإنهاء كل شئ ، أو ستظل بعض خطوط القصة لها نهايات مفتوحةولكن لم يحدث هذا ، أتسع الكتاب لكل الأحداث المنتظرة.. بل وأحداث جديدة وفكرة \"مقدسات الموت\" التي أتت لإغلاق دائرة البحث عن القوة والخلود الذي يسعي له فولدمورت ،بجانب صراع الهوركروكس وفكرتها الرهيبةالاحداث قدمت لنا كل مانريد معرفته عن الابطال ، ولم تنس لمحات من الأحداث السابقة والاماكنمن لم يتأثر بوداع هاري من ابن خالته \"ددلي\" وتلك \"الختمة\" الجميلة لتلك العلاقة 'الصعبة' بينهما سواء المؤثرة أو الكوميدية في بعض اجزائهاومن لم يتأثر من مشهد هاري وهو يتجول بهيدويج \"البومة الاليفة\" في بيته في 4 برايفت درايف لآخر مرة... يلقي نظرة وداع علي حجرته القديمة تحت السلم. وهو يتذكر هذه الايام وكأنه يتذكر أخ اصغر له ضاع منهIt felt most strange to stand here in the silence and know that he was about to leave the house for the last time. Long ago, when he had been left alone while the Dursleys went out to enjoy themselves, the hours of solitude had been a rare treat: Pausing only to sneak something tasty from the fridge, he had rushed upstairs to play on Dudley’s computer, or put on the television and flicked through the channels to his heart’s content. It gave him an odd, empty feeling to remember those times; it was like remembering a younger brother whom he had lost. (view spoiler)[ثم موت هيدويج..والذي لا اعتقد ان هاري وحده شعر بالحزن لذلك بالتأكيد كلنا شعرنا به لذكرياتنا معها و نجحت المؤلفه في تعميق ذلك الاحساس باخر مشاهدها في برايفت درايف. وان كنت احسب للفيلم تعميق دورها بهذه الطريقه  (hide spoiler)]هنا ستشعر بالمعني الذي تقدمه المؤلفه والنادر تقديمه في روايات تصنف بنفس النوعيةComing of Ageستكون كهاري واصدقاءه..تشعر بكم المسئوليه عليهم ..توديعهم للطفوله والمراهقه للالتفات للمسئوليه الكبيره الواقعه عليهم كي يتغلبوا علي المحن والقهر الواقع عليهم وعلي كل من حولهموتبدأ الرحله الشاقه والرموز والحقائق والمفاجأت بعد استراحه قصيره في اول حفل زفاف سحره نحضره سويا مع الابطال..وبمعلومات بسيطه وادوات ابسط تركها دمبلدور في وصيته نبدأ في الرحلهنبدأها بزعزعه \"ايمان\"هاري بوتر في \"دمبلدور\" والذي بوفاته صار الكثيرون يشككون فيه وفي توجههاته و اسلوبه وحياتهيبدأ يشك ان دمبلدور لم يكن يثق فيه ولم يعلمه بما فيه الكفايه ولم يمنحه ما يساعده في المهمه التي القي بحملها علي عاتقه قبل وفاته .. فيتسأل هل كان حقا يهتم به ام انه تركه للمجهول دون مساعده واضحه كما صار الكثيرين يتهمونه بذلك..تركه ليهلك دون مساعدههل حقا كان وقت شبابه يبحث عن ان يحكم بالقوه؟يحكم في ان يكون هو ومن مثله من السحره هم من يحكمون العالم؟امر اخر لاحظته في هذه النقطه...الاعلام ليس دائما حيادي..الاعلام سلاح ذو حدين قد يساندك في قضيتك والحق, وقد يزعزع ايمانك..وفي نفس الوقت من الممكن ان يكون مجرد بوق دعايه للحكام..انظر الي كتاب \"حياه واكاذيب دمبلدور \" للصحفيه الكاتبه الرهيبه ريتا سكيتر...انظر كيف حولت احداث تاريخيه وقامت بتفسيرها علي اهوائها مما يؤدي لزعزعه الايمان في الرمز المتمثل في دمبلدورمما لا شك فيه ان جي كي رولينج اصرت علي الاشاره لتحكيم العقل في ما يقدمه الاعلام من صحافه وكتب..خاصه ان الامر بدأت تحذر منه منذ الجزء الرابع للسلسلهتبدأ حقائق ومفاجات تظهر, اذا تابعت الاجزاء السابقه كلها ستجد ان الامر كان ممهدا له وليس مجرد \"تقفيل\"للاحداث بل اتقان لخيوط القصه من اول الاجزاء لاخرهاتتوالي الاحداث هنا ..قد يستشعر البعض بالملل من وسط الاحداث ..وقت التخييم والهروب من مكان لاخر..ولكن الم يمل رون من نفس الاحداث..الم يمل هاري نفسه من الموضوع ككل وصب غضبه علي صوره دمبلدور؟ولكن في النهايه ..تقدم لنا المؤلفه بحنكه واعظم طريقه للتصوير, الصراع النهائي والذي يدور في مااعتبرناه بيتنا منذ اول جزء..في هوجوارتسنتفاعل مع كل الابطال..وبطريقه تجعلك فعلا تتفهم دوافعهم للمحاربه ..لانك شعرت بالتعذيب والعنصريه معهم..تشعر كيف تبدأ الثوره وكيف يبدأ محاربه الظلم والتعسفلتجد في النهايه نفسك امام نهايه كتاب كما قلت في البدايه كنت تعتقد انه يحتاج الي ثلاثيه كامله لتنهي مابدأت به الاحداثنهايه ليس فقط للاحداث بل وانهاء رائع لكل شخصيه رايتها وتعايشت معها في الكتاب منذ اول صفحات الجزء الاول وحتي النهايه *****************************الروايه محكمه ادبيا جدا من وجهه نظري..رسالتها ورموزها الروحيه كالايمان والعقيده والدين تظهر هنا بتجلي وفي نفس الوقت بدون اي شكل مباشر يجعلك تنفر من الروايه او تشعر انك \"اتخدعت\"مثلا فيهافالحب الذي يقهر اي انواع السحر هو امر عرفناه منذ اول مواجهه بين فولدمورت و هاري بوتر للحصول علي حجر الفيلسوف في السنه الاوليالسحر لا يعيد الموتي كما نتمني , -بل وهنا تشير ايضا المؤلفه بذكاء كيف ان السحر لا يجلب لك الطعام من لا شئ-القوه والبحث عنها حتي وان كان للخير الاعظم لم يكن من الحكمه ابدا..دمبلدور كان خير مثال لذلكوعاما قالت جي كي رولينج وقت انتهائها من الروايه انها شعرت انها افضل خاتمه لقصه هاري بوتر...وقد صدقت تماما في ذلككل اسئلتنا عن السحر, وتجاوزاته التي في خيالنا, الشخصيات و حقيقتها ودوافعها واسرارها وكل ماهو عنهاحتي الاسئله التي ربما ظننا ان ليس لها اجابه او اننا اكتفينا بما نعرفه مثلا \"لماذا هناك تابو عند نطق اسم فولدمورت, او ماهو سر النزال بين دمبلدور و جريندلوالد الذي كان مكتوب في كارت الشيكولاته في الجزء الاولكراهيه بيتونيا خاله هاري للسحر..معرفتها بالديمينتورز و سر ان تشابهه عيني هاري بعيني امه كانت احد اسباب حمايته من جانب...ولكن مش حابب احرق اكتر من كده في الاسئله اللي بتجيب عليها الاحداث المثيره للجزء الاخير الشخصيات********هل من السهوله ان تقتنع ان بطل قصه يسير الي هلاكه..موته ..حتي وان كان يعلم انه حتميا بكل ثقه وهو يشعر انه يفعل الواجب عليه؟من اصعب حبكات الدراما والتي دائما ما يقع فيها الادباء عندما يقدم البطل نفسه للموت..دائما ما يكون الامر سطحيا ويبتعد كثيرا عن الواقعالا ان الامر ليس هكذا ابدا في هذه الحاله..في هذه الروايه العبقريه ان المؤلفه اختارت للجزء الاخير تيمه الموت..وهذا ما كان واضح ايضا من كل الرموز التي قدمتها حتي الدينيه منها والتي لاول مره تفصح عن توجهاتها الدينيه.(view spoiler)[هاري كان خائفا من الموت..كبشر طبيعي وليس كبطل..كان يذهب للقاء الموت وهو يتمني ان يراه احد ويوقفه..كان يفكر في شئ واحد,هل سيؤلمه الموت؟ نعم هو ذاهب ليموت ولكنه لا يستطيع كتمان خوفه..هذه-بالاضافه لكل الروعه في رسم الشخصيه- جعلت لهاري روح ونبض بكلماتها الذكيه ..لهذا تشعر ان فعلا جي كي رولينج يجب ان تلقب كملكه الروايه (hide spoiler)]هاري ما زال هاري..مازال يتعلم من اخطائه..مازال كما وصفه دمبلدور في الفصل قبل الاخير Hot Head راسه حاميلم يكن ملاك باي حال من الاحوال..ولكنه كان بشرياكل الشخصيات في الروايه كانت تستكمل دورها بكل سلاسه لم يكن هناك تجاوزات او اشياء غير متوقعه ..ربما كانت خفيه لنا بذكاء وحنكه ..وأؤكد انه اذا تم اعاده قراءه الاجزاء كلها مره اخري ستكتشف ان ليس بالامر اي خدعه..كل مافي الامر هو ان المؤلفه نجحت بعبقريه شديه اخفاء ما تريد من الشخصيات لاظهارها في وقت لاحقكذلك بالنسبه للدوافع التي تختلف بحسب المواقف التي تقع فيها الشخصيات , مثلا عائله مالفوي ودوافعها, دافع هاري عند عودته لهوجوارتس والذي لم يكن من اجل المحاربه في ذلك الوقت.لا اعتقد - من وجهه نظري- ان المؤلفه افسدت روح شخصيه او خيبت املنا في اي حدث من احداث الروايه(view spoiler)[ومن اجمل المواقف في الروايه هو المواجهه الاخيره بين هاري وفولدمورت.. والذي يدعوه فيها للندم علي كل من قتله..الندم علي افعاله في روحه التي قسمها وارواح الاخرين التي ازهقها\n“You’re right. But before you try to kill me, I’d advise you to think about what you’ve done. . . . Think, and try for some remorse, Riddle. . . .” “What is this?” Of all the things that Harry had said to him, beyond any revelation or taunt, nothing had shocked Voldemort like this. Harry saw his pupils contract to thin slits, saw the skin around his eyes whiten. “It’s your one last chance,” said Harry, “it’s all you’ve got left. . . . I’ve seen what you’ll be otherwise. . . . Be a man . . . try . . . Try for some remorse. . . .” \nحتي هنا الامر ليس غريب علي هاري , وليس غريب علي فولدمورت رد فعله عنهاما عن سناب..فبما اني قرأت الروايات مره ثانيه فاني اؤكد ان من المستحيل ان يتم التشكيك ان نهايه شخصيته كانت ملفقه او بها خدعه..الشخصيه مرسومه بكل دقه من اول ظهور له  (hide spoiler)]النهايه******* لن يكون هناك نهايه لما اريد ان اقوله حول سلسله هاري بوتر..اعتقد اني يجب ان اعيد كتابه الريفيوهات من الجزء الاول حتي استطيع كتابه كل ماتستحقه السلسلههي سلسله انصح اي من لم يقراها او استكفي بمشاهده الفيلم البدء فيها , فهي ستغير مفهومك عن الروايات..لن تجد مثل ذلك الخيال الواقعي,الشخصيات التي تنبض عبر الصفحات, الاحداث الشيقه التي تدخلك فيها دخول هاري بوتر لمذكرات توم ريدل في الجزء الثاني :)محمد العربيالنسخه العربيه من 25 يناير 2008الي 30 يناير 200814/01/16: ورحل عن عالمنا المبدع الذي جسد شخصية بروفيسور سناب بمنتهي الأتقان, الان ريكمان"}, {"Review": "“Words are, in my not-so-humble opinion, our most inexhaustible source of magic. Capable of both inflicting injury, and remedying it.”Harry Potter and the Deathly Hallows. It was the end of an era, and then it wasn't.I can't express how thankful I am, for this series, for this world, for the magic, power and love behind J.K. Rowling's words. I don't know what I would be without Harry Potter.It's crazy how much time I spend reading the books, listening to the audiobooks, watching the films or just thinking about them. So many things between thousands of pages and millions of words. No wonder Harry Potter has such an impact on our society, as it deals with so many topics that have moved, and still move us today, will move us in future:Race and racism for one, hate, ignorance, arrogance and how to fight all of these things. Power and influence of the media, slavery, dictatorship, revolution, feminism, depression, death, loss, equality, love, friendship.J.K. Rowling is probably one of the most important teachers to every child (and adult) reading her books. She shows us, that our dreams are dreamed to become real, that family is who we chose our family to be, that friends can be our greatest strength and that every being, whatever our differences might be, deserves kindness and respect.I still can't believe that this amazing woman was able to put all of this in seven books.Thank you.Find more of my books on Instagram"}, {"Review": "Wheeeeeere do I even start with this? WHERE. Every human and their bobcat has reviewed this book, but I'M GONNA ANYWAY BECAUSE MY THOUGHTS ARE IMPORTANT. (I am also a Slytherin, FYI.) I'm also really angry because I'm giving it 5-stars because it's so freaking clever. But I've got complaints. But life is short. Eat dessert first. Give books 5-stars. I feel emotionally manipulated by this sneaky paperback, DARN YOU HARRY POTTER AND THE DEATHLY HALLOWS. MY LOVE FOR YOU IS COMPLICATED.First: let's talk about the problems:• The fact that the pacing is rubbish. The beginning borderlines boring. Not enough that I wasn't interested? But enough that I was annoyed. It felt like the book didn't know what to do with the characters if they didn't have Hogwarts classes to get to.• I'm annoyed that the Slytherins were still labelled at the end as \"badies\". C'mon. Honestly?! Especially in that epilogue when (view spoiler)[Ron (hide spoiler)] says \"don't make friends with Slytherins, kids!\" I mean. Rubbish and growls. (I am a defensive Slytherin, FYI.)• And speaking of Slytherin's...I kind of thought Harry and Draco might've (view spoiler)[made up or something?? Been tentative friends????? BUT NO??!?! (hide spoiler)] Apparently all the stuff I'd gleaned from the internet is wishful thinking wow.• There was VERY cliche Voldemort-must-monologue-before-he-kills-stuff scene.• To be realistic...Harry should've passed out from FOOD DEPRIVATION. Why is not one angry about this? The lad barely ever ate. I was hungry reading this. Someone give the kid a scone.• I'm annoyed Luna and Neville didn't get more page time. REALLY annoyed.• I still don't ship the ships. In bk6 I was totally onboard with Harry and Ginny. But now? Meh. They like have no chemistry, sorry. And Hermione and Ron? No. Ron is still a bully and freaking annoying and Hermione could do better....okay. My wrath is out. Now time for the feels. Don't say I didn't warn you.What I Loved:• My darling baby Neville Longbottom. He is a fantastic creation.• The plot is clever. Okay seriously IT IS CLEVER. I loved how things tied in and tied up and I loved all the \"reveals\" and it was just clever.• And the world building is my favourite as always. I want to live a Hogwarts. BUT DOESN'T EVERYBODY?• Professor MacGonagall. Because she gives life. She is everything. All my love for Professor MacGonagall and her terrific dialogue lines, okay?“Our Headmaster is taking a short break,\" said Professor McGonagall, pointing at the Snape-shaped hole in the window.• I love Harry. I really do. Like at the end there, he was almost a little too perfect, which was a little irritating. But he is a precious little piece of pumpkin juice and I love how he makes mistakes and sometimes needs slapping with a broomstick, but at the end of the day he's just a GOOD KID.• Obviously Hermione. And I'm glad Ron grew up a lot in this book, because gee that kid was 3 centimetres away from getting his nose punched by moi.• I hate hate hate hatttttte when the word \"bitch\" is used in a derogatory way towards women. But. There was this scene with Molly Weasley and Bellatrix LeStrange = and I liked it. YOU KNOW THE ONE, FOLKS.• Snape. Omg. Snape. I do agree that his a very complex character. But I still hate him. Why? Because he could've done EVERYTHING just how he needed too -- sans bully children. I get why he hated Harry. I would've hated Harry if James had been like that (question: why the hell did Lily marry James? He was utter trash.) but Neville?! Why did Snape pick on Neville so bad? He literally traumatised my darling baby and I shall not forgive him. I do not \"like\" Snape but I like the complexity of his story.• THE DEATHS. <3 Okay that sounds marginally sadistic. But hear me out. I hate when big battle finales keep all the \"favourites\" alive. It's dumb and unrealistic. There need to be deaths, and I think HPatDH did it really well. I got all tied up in knots several times.• I love Luna. She is an amazing special creature and I wish she was in the books more.• Speaking of which...I have to admire how ALL the characters are just so epic. I would seriously read spin-off series on anyone of them. That takes skill to write even secondary characters so the reader is invested.• I LIKED IT EVEN THOUGH IT KINDA MANGLED FEELS AND IT FRUSTRATED ME. But it surprised me! When I thought I'd seen all the spoilers of ever. And I was emotionally invested. Omg. I WAS.• (No tears though. I am a Vulcan.)*** ABOUT THAT EPILOGUE ***Okay but, spoilers about the finale below. (view spoiler)[I am twitchy about the finale. I thought there'd be more. All we know is who married who and how many kids they had and what STUPID names they gave their children. And Harry's son James is basically Harry's father reincarnated. Does that not disturb anyone? *raises hand*But what did Harry and Ginny do? Like did they get a Killed Voldemort Pension and get to retire? Did Harry become an Auror? Why the HECK didn't he get to teach in school? I think he'd been an awesome Defence Against the Dark Arts teacher.Did Lunar and Neville marry?Or did Neville save himself for me?What did George do, sans Fred? Like, could George exist without a Fred?Why did Hermione settle so low when she married Ron?What happened to Kreecher? I want to hug Kreecher. I also want him to bring me a sandwich too.Did Professor MacGonagall stay in school to teach or did she scream when she saw Harry's children and say \"I QUIT\"?....I am kind of angry there are no answers to these. (hide spoiler)]Aaaaand...I'M DONE. What else do I say? Yes. I loved it. YES. I love this series. I had a rocky start, and I thought it was dumb. But seriously? If I'd been reading this as a kid. I would been obsessed. As is, I really want to own the books because they're good and they're amazing and they deserve the world-wide cult fandom. It's a satisfying and grand and perfectly wretched finale and I should like to cheer enthusiastically.“Of course it is happening inside your head, Harry, but why on earth should that mean that it is not real?”(Also that quote means so much to me I cannot even.)"}, {"Review": "happy thanksgiving to everyone celebrating today! we all have so much to be thankful for! this year (and every year), i am immensely thankful for books; but in particular, this series. i know im not original when i say the harry potter books are what made me fall in love with reading. but they gave me a childhood far more magical and imaginative than i could have ever asked for. they opened my eyes to a world beyond the one in which i lived. the series taught me the value of empathy, that courage comes in many different forms, the importance of having and being a true friend, that love is the greatest power above all, and most importantly, it taught me to believe in magic. i would not be who i am today without these books and i love that stories have the power to do that, to change lives for the better. i owe so much to this series, which became such a massive part of my life. and for that, i will be forever thankful. <3↠ 5 stars"}, {"Review": " http://www.youtube.com/watch?v=C0MSwa...>> آلان ريكمان،، وداعا<<ولأن كثيرين كتبوا ويكتبون عن هذه السلسة المدهشةسيكون الريفيو مكرس لتلك العلاقة المهمشة‏التي ربما لم ينتبه إليها كثير من القراء لانشغالهم في أحداث متتابعة ‏التشويقهذا الريفيو إهداء لروحا سنايب و ليلي...وهذا الحب الذي ظل يتألق بهالة من نور فضي كظبية هاربة من ‏آهات عصاة سحرية ظلت وحيدة للأبدكنت أبكي كمن فقد عزيزا وأنا أرى حشرجات سنايب الأخيرة ‏تتنفس ذكريات حبه المكتوم في صدره لسنوات طويلة طويلةكنت أنشج بحرقة على هذا الرجل الذي أبى إلا أن يقتله كبرياؤه و ‏يحرقه ذنبه الأكبرأنه كان بطريقة ما سببا في موت أعز مخلوقة على روحهليلي وسنايب طفلين يتكشفان أعاجيب السحر لأول مرةليلي وسنايب فتاة كثمرة متوهجة وفتى نحيل منطوي واقع بيأس ‏في غرامهليلي وسنايب في هووجوارتس تفرقهما الأقدار كلٌ في بيتليلي وسنايب لآخر مرة حينما تتبدى عليه إمارات اتجاهه إلى ‏الطريق الآخر وانضمامه إلى فرق الظلام‏ظلام وسواد وكراهيةليلي تقع في حب جايمس الطيب لكن المتعجرفالوسيم و(الفهلوي) وأشهر لاعب في الفرقة الرياضية السحريةوجايمس يكره سنايبلا لشيء سوى نحالته ومظهره الغير مهندم وغرابة أطوارهوجايمس يسخر منه ويجعل منه أضحوكة أمام المدرسة كلهاوليلي تترك سنايبوليلي تحب جايمسوسنايب يتقوقع أكثر على ذاتهويحمل حبه داميا في قلبهويتجه بكل قواه إلى الطريق المعاكسوتكون النتيجة قتل جايمس وليليليبقى هاريطفلهمايشبه جايمس كثيراولكنه له عينا ليليولذا سيحميهحتى إن قُتل في سبيل ذلك سيحميهحتى إن كرهه الجميع وأولهم هاري نفسه سيحميهبقى سنايب الحامي والمدافع ‏ولكن في السرفي الظلام كما عاشوكما أحبوكما تعذبوحدهدائما وحدهأو بالأحرى دائما معهاهي من ليست معههي من لم ترهوهي من لم تشعر به وهو يحتضنها للمرة الأولى جسدا هامدا بلا ‏روحظل سنايب يدافع عن هاريويتقبل لعنات الجميعوكراهيتمظل يعمل من وراء الستارحتى سقط وتهاوىلتكون دموعه الأخيرة مصدر معرفة هاري ومعرفتنا نحن أيضامصدر كشفنا لقصة العشق ابائسة تلكمات سنايب وماتت ليليوبقى هاري ليتذكر الإثنينوليسمي أبناؤه الثلاثة ليلي وجايمس وسنايب\"سيفيروس\"لتكتمل الدائرة مجدداولكنها هذه المرة بلا حزن ولا كراهية ولا سخريةإنها تكتمل حبا كان أولى به أن يظهر من زمن طويلطويل جداوفي النهايةستظل سلسلة هاري بوتر محفورة في تاريخ الأدب كأليس لويس ‏كارول وخرافات أندرسن الساحرةفما فعلته رولينج في روايتها العظيمة الحجم والمتعة يستحق ذلك ‏بلا جدالحتى وإن شاب ذلك مسحة تجاريةلن تؤثر على كل هذه العظمةالأفلام ستموتوالورق سيبقىدائما ما يبقى"}, {"Review": "It is finished. I’m thrilled to say that I managed to follow through with at least one book related commitment this year, and that was to read the entire Harry Potter series for the first time. It’s tough to pick a favorite from the group, but the Deathly Hallows is a worthy contender for that coveted first spot. As the dark tension that began growing at the finish of the Goblet of Fire has come full circle, I felt this was the perfect finale to a (rightfully) highly acclaimed series. I’m so happy to have finally experienced first hand this beloved story arc that so many readers hold dear to their heart. I’m already trying to figure out when I can reread them. 😭 Now, on to our annual Christmas time watching of the films while we wrap presents! 😍———Gulp. This was my PIFM choice for the month of November in the A Good Thriller group here on Goodreads. I can't believe its finally time for my first read through of the Harry Potter books to come to an end, but I'm also dying to read this one and see how it compares to the film."}, {"Review": "First of all, It's awesome finding out that this book is Dedicated specially to you by the Queen herself -for me Joanna Rowling is the English Queen for Magic, just as there's a Queen for muggles- & it's Really yours personally..If you Stuck With Harry Until The Very End.I've been stuck with Harry myself for 10 years now..when I first read the Arabic edition of the 1st book on Sep.2003.. I felt how it's different than the movie,The characters more alive ,forcing you to feel that they're your friends, like you're already living with them in the School of Witchcraft and Wizardry,it was like my other HomeI finished the series in Arabic and start it in English 2 years ago,It was still fresh and as thrilling, emotional ,great as ever.Here I'll try to stick to review that part of the series only ,till I write more about the experince of living The Harry Potter SagaThe Plot********Remember before book 7 release how were we been feeling?**Harry still got 4 Horcruxes to find -and even to know what it'll be- and even how to destroy it.**And then Fight the 7th Part of the shuttered soul...Voldemort himself, his Death Eaters and the traitor Snape. **How he can do all that without Dumbledore , Black and all of those he can't tell about his quest as Dumbledore ask him to not tell but to Ron and Hermione.We all thought it will be difficult to fit it all in one last volume ,and to wrap up characters and events. But the amazing plot of that book didn't only fit for that all. and also add a new element \"The Deathly Hallows\" and fit it perfectly into the full story.. I can't believe how that book fit everything we're all been asking about since the very early beginning ,and some of the facts that anyone wondered about like How the trace dedicate the underage magic, Why we can't just create food from thin air, or why there was a Taboo on saying \"Voldemort\"'s name..and so more.It dive deeply into the past of important characters we thought we know enough , Dumbledore and Snape.From the beginning you see a wrapping up for the characters,the places -like Private Drive- and the events.. you'll see a lines that connected to the very early of the series and book one..you'll be in a journey toward the ending without feeling disconnected from the whole previous events and characters.There's no something you'll feel-if u pay enough attention - out of place ,out of the plot or out of the characters .The Characters **************Was so glad that J.K.Rowling announce that there's no \"new\" character presented in the last books which was perfect since it's the end of the series and it's better to focus on our beloved characters and the ones we lived wit them for years.The characters deals here with the \"real responsibilities\" that comes with the coming of age. or the quest they asked for and they have to do for their good and greater goodThere were no any \"Exaggeration\" or over acting, the characters go normally ,naturally and very real, The writer chose to describe even the smallest feelings they feel in some important situations like for example Harry's final visit to the Dark Forest, or the boredom of the days on the run from place to place.And won't forget the wrapping up of Every character sometimes with surprises which is never out of character.She was always have it all planned and well drawn The Message ***********I have to admit at my second reading I find an extraordinary spiritual amazing messageIt starts with the 2 quotations one is pagan, and one is from a Christian tradition.. one about the Death and one about Friends..and it fit perfectly to the theme of the book,and the message of Love that can beat any other force.I saw also a symbol in the Dumbledore's character and the whole Harry -Dumbledore's relation, complicated symbol of Faith, religion and religious people. in many ways that you have to look carefully to dedicate it.ِِAnd look at the final fight between Harry and Voldemort ..I was like..My God you're the best writer EVER\n“You’re right. But before you try to kill me, I’d advise you to think about what you’ve done. . . . Think, and try for some remorse, Riddle. . . .” “What is this?” Of all the things that Harry had said to him, beyond any revelation or taunt, nothing had shocked Voldemort like this. Harry saw his pupils contract to thin slits, saw the skin around his eyes whiten. “It’s your one last chance,” said Harry, “it’s all you’ve got left. . . . I’ve seen what you’ll be otherwise. . . . Be a man . . . try . . . Try for some remorse. . . .”  It's not just normal fight between Good and Evil , It's amazing written novel.Can't seriously describe all of what I want to say about this series Just one thing I can admit,It's my wonderful journey, It's my friends, It's the books that made me- trying to be- a better person. It's where I meet my friends.. It's where I truly Laugh while reading/living the story..It's where I cry with characters and feel sorry for some. It's magic..It's real magic cause It's words of LoveSo glad to finish it at 2nd May, And so strange I didn't feel I'm going to miss the Harry Potter books although I finished it before in Arabic, and that was the ending of my experience with it in English, But deep inside me is sure I'll go back to Hogwarts again ,re-reading from one to seven soon ISA.Before I finish I have to share this great man's word..Who really was the best transforming a paper character to a real life Thank you Joanna Rowling. Mohammed Arabey16 April 20132 May 2013 \"Harry Potter International Day\"****On That Day 2nd May 1998 ,The Battle of Hogwarts and Lord Voldemort's downfall .Happy 15th Anniversary..14/01/16R.I.P Alan Rickman..one of the greatest talented actors ever,here's his last farewell for a character he made so real..Oh God, And that's even Sadder...:("}, {"Review": "This review and other non-spoilery reviews can be found @The Book Prescription“Of course it is happening inside your head, Harry, but why on earth should that mean that it is not real?”🌟 I just decided not to write a review, because you either have read the books or you didn’t and in that case I can’t write a review without spoiling much. Instead I am going to pay tribute to the characters (I established that the series has the best characters ever) with GIFS!!!🌟 Hermione: I think without Hermione they would not have been able to accomplish anything!🌟 Molly Weasley:“Not my daughter, you bitch!”🌟 Professor McGonagall🌟 Dumbeldore🌟 Fred and George🌟 Voldemort“The scar had not pained Harry for nineteen years. All was well.”"}, {"Review": "Hot take: I like A Very Potter Musical more than I like the Harry Potter series. Please feel free to physically fight me. (And no, “AVPM wouldn’t exist without the series” is not a valid argument, because duh.)https://emmareadstoomuch.wordpress.co...God, what an unexpected result this is. Let's talk about it for six pages. I loved Half-Blood Prince so much that I postponed finishing the series for five months. More context: I started rereading this series in December, I was done the sixth book in February, and I didn’t pick up the finale until July.I thought this book was going to destroy me!!!And, like, it almost did. But not in the oh-my-god-this-amazing-series-is-over-cry-cry-cry way I expected. More like I, too, divided my soul into horcruxes, and they, like Voldemort’s, were being taken out at an excruciatingly slow pace over the course of 784 pages. Just weakening infinitesimally and kind of being like, can you just get this over with already? But instead of, you know, my actual self being killed, it was my enthusiasm for this series and any appreciation I may have had for JK Rowling.Seriously, I feel like any love I had for a couple of the books in this series has been brutally, torturously, painstakingly extinguished.This book was a CHORE.Let’s talk about why (for an extraordinarily long time).(Like all of my Harry Potter reviews, this is nothin’ but spoilers.)PLOTYou saw those glorious GIFs. You know the concept for the first half of this book is Not Great.The storyline is already, like, What if we just sat around in the most depressing on Earth for a few hundred pages, jumping locations every day, having the same conversation repeatedly, and granting our readers in-depth analyses of the gross fish we’re eating? (Sorry, British people, but I think we can all agree that a freezing/damp moor is no tropical vacation.) (Also shoutout to the time when Harry, Ron and Hermione overheard other wizards saying “Accio salmon” in order to eat and were just like, That information’s going straight in the mental trash can.)But then on TOP of it, the pacing is so!! horrible!! Nothing happens, and then something will happen and take literally no effort by the golden gang. Like when a thing they need just SHOWS UP in a frozen pond. How exciting. So glad I waded through hundreds of pages of freezing moor bickering to get to this point.Also, the bickering is legitimately the same three conversations over and over and over and over.HAHAHAHA. I just remembered that the seventh book was divided into two movies. LITERALLY WHAT WENT DOWN IN THE FIRST MOVIE?? Hahahahaha. Oh man. I am just never going to watch those adaptations, probably.I’m almost grateful that this book was so bad. Because now I never have to be sad it’s over! I do so much better with anger.CHARACTERSLike every young woman with a semi-functional brain, I’m big into Hermione. Or I was, for the first five or six books, before she was completely ruined and it was like she was never goddamn helpful or smart in the first place.IN OTHER WORDS, WHY DID J.K. ROWLING DO HERMIONE LIKE THIS?In this book, Hermione totally ignores logic in order to: a) stare lustily after Ron (Ron! Can you believe it?? We’ll get to that), b) sustain the stupid arguments that keep cropping up between the supposedly-golden trio, c) also maintain the TOTALLY USELESS ROMP THROUGH THE BRITISH COUNTRYSIDE, and d) ignore the good ideas that are exclusively coming from Harry presumably just in order to extend the book.Which, speaking of, this book is just the goddamn Harry Potter show. He comes up with every single plan, everyone at Hogwarts defers to him like he’s Team Good's Voldemort, and the whole book he’s treated like this misunderstood genius, too smart for the world around him.WHAT HAPPENED TO THE MAGNIFICENT SIXTH-BOOK CHARACTER DEVELOPMENT FOR GOD’S SAKE.Ron also sucks. He is constantly complaining and picking fights. He offers exactly zero (0) good ideas throughout the book. Legitimately all he does is try to be funny AND NOT BE. I cannot believe the (usually) fab Hermione was handed off to him like some sort of prize for the biggest pumpkin at the state fair.The only character who got what they were owed in this book was Neville. Which, if I had to pick one character to get the best ending, that’s who it would be, BUT STILL. His perfection is no excuse. He’s barely even in the f*cking books. Impossible to mess up.And I missed Dumbledore soooo muuuuuch but then he showed up (in death or quasi-death - this book is stupid and we’ll get to it) AND TALKED TO HARRY FOR EIGHT HOURS AND IT DIDN’T FEEL LIKE HIM ONCE. It was just sh*tty writing and plot exposition and explanation. How DARE you use Dumbledore as a plot point.Wow, I am especially bitter today.ROMANCEEVERY SINGLE ENDGAME ROMANCE IN THIS WHOLE SERIES IS THROWN TOGETHER AND BAD. I will go through each and explain this.Harry and Ginny: Ginny is so cool in the sixth book. So cool that I took back all of the Ginny-sh*t talking I did for approximately four years. I was even open to the concept of Harry/Ginny (even their ship name must be awful, no? Hinny? OH MY GOD I AM PRAYING IT’S “Garry”) just based off of Ginny’s apparent greatness. BUT NO IT’S JUST BAD. Harry spends a significant chunk of this already-boring book moping about Ginny. And it couldn’t be less cute. It’s just I miss Ginnyyyyyyyyy overandoverandoverandover without any mention of like, who she is. Or what their relationship is like. OR ANYTHING. It’s just J.K. Rowling being like, Oh, Harry would probably miss Ginny. Here’s a substance-less reminder.Ron and Hermione: like...areyoukiddingme. Not even Joanne and her terrible Twitter account are pro-Ronmione. They could NOT be less compatible. They are not fun together at all. My last words will be WHY NOT HERMIONE AND FRED. (I will scream them, which will be very startling to the loved ones who may be gathered around my hospital bed.) And no, Joanne, Harry and Hermione are not the correct answer. SERIOUSLY HOW IS HER TWITTER ACCOUNT THIS BAD. HOW DOES SHE HAVE SO MANY REGRETS ABOUT THE DUMB CHILDREN’S SERIES SHE WROTE 15 YEARS AGO.Lupin and Tonks: I don’t...I don’t even...when do they interact? When did this happen? How am I supposed to even support this? Isn’t Lupin a million years old? A shabby sloppy old were-man? Isn’t Tonks a young hottie? Also, literally how f*cked up is it that everyone thinks Tonks is like mourning and blaming herself when actually she’s all, “Why won’t Lupin loooooooove me.” Dumb.Lily and James: This one makes literally NO sense. Just because your BFF calls you a racial slur doesn’t mean you have to f*ck and then marry his bully. James sucks. Just because Snape somehow sucks even harder doesn’t mean that James’s dreamy green eyes override his TENDENCY TO BE THE WORST PERSON IN THE MAPPED UNIVERSE. (Second-worst.)Are there any more? Actually, scratch that. If there are more I do not want to recall.WHERE IS THE GODDAMN LOGIC. SOMEONE FIND IT AND HAND IT BACK TO JOANNEOne, don’t just KILL CHARACTERS TO TRY TO MAKE YOUR BOOK SEEM SAD AND POWERFUL. A good writing strategy is definitively not, “Oh, guess what, the stakes are high. How do you know? Um, I’ll just...kill these 14 people. Who matter a lot to you nerds I guess. How crazy, it’s almost like I’ve emotionally manipulated you into building a devotion to these works of fiction for the entirety of your child and made a literal billion dollars off it! But this book has already been super boring? No time to mourn!!! Sorry! Whatever, bye!”You can literally watch my progression into convincing myself that J.K. Rowling is a full-on real-life witch over the course of this review. And not a Hermione type of witch. A Wizard of Oz Wicked-of-the-West witch. A Salem witch trials witch. But CAN YOU BLAME ME. She’s a billionaire with nothing better to do than tweet about the project she keeps pretending she can move past!!! But she can’t!!! Because she keeps writing stuff! Is a billion dollars not enough? Can you release your stupid 90-page ebooks for not-money??? I am FURIOUS. And also sleep-deprived.But back to the stupid stuff. Well, the other stupid stuff.The sh*t that goes down in this book makes literally no sense at all. Dumbledore even says, “You and Voldemort have traveled into realms of magic hitherto unknown and untested,” which is really Joanne saying, “I have really f*cked up this time. Wow, I have no clue how this makes even a magical sense of logic of my own creation. Um, what if...can I just not explain it?”Here’s one example of how dumb this is. Voldemort survives death continuously because there’s a piece of him in Harry, which supposedly “dies” when Harry dies. This is somehow the only part of Harry that isn’t, like, resurrected, but whatever. There is then in turn a piece of Harry (or Lily’s protection force-field thingy) within Voldemort, which is what keeps Harry alive. SO WHEN VOLDEMORT DIES, HOW DOES HARRY SURVIVE???? THIS MAKES NO SENSE NO SENSE AT ALL AND YES I REALIZE I’M THE TECHNICAL-ADULT TRYING TO READ LOGIC INTO WIZARD-DEATH BUT IF JOANNE, WHO IS A MILLION YEARS OLD, IS ALLOWED TO STAY IN THIS WORLD FOREVER THEN I’M ALLOWED TO DO THIS.Fair is fair.SNAPEI am barely controlling the section of my Harry Potter-related fury that is dedicated toward the pond monster/anthropomorphized dumpster/human Port-a-Potty/damp sock that is called Severus Snape. (It actually makes up 84.6% of my Potter-anger, so you ain’t seen nothing yet.)All I will say is that there is a Snape rant coming, but I am almost frightened to write it. I think when I start typing I may transform into some sort of anger-monster. In four stages. Duh. Like the cover of an Animorphs book.I’m going to go drown my sorrows in A Very Potter Musical now.Bottom line: The number one item on my bucket list is “get in an Internet fight with J.K. Rowling.” AVERAGE SERIES RATING: 3.57 starsQUESTION: Should I read Harry Potter and the Cursed Child???-------------------------whoops, my hand must have slipped. either that or this book was garbàge.regardless, i'll never admit to being wrong. ever. in my life. i am always correct and perfect and infallible. that's actually in the fine print of the contract you agree to when sending me a friend request. (the whole contract is fine print.)ah jesus. you guys thought you hated me before.review to comeeeeee-------------------------me waiting for this book to be over"}, {"Review": "(So I never did a review of this and am deciding to add one now.)I'm a Millennial, and like most Millennials, I grew up with Harry Potter. Not just the books, but we kinda aged with him (or thereabouts). It's a coming of age story for our whole generation, whether or not we received our Hogwarts letters.And we were there together. We were at midnight release parties and movie theaters, lined up and excited to share in the adventure. I can't think of the number of people who I've bonded with over these stories--people who I wouldn't have thought to have much in common with in the first place. We came from all different backgrounds, much like the 4 houses, and joined in the Battle of Hogwarts.We mourned the deaths of beloved characters.And cheered on the sheer wit and bravery of others.We debated what Harry should have done with the Elder Wand.But we never let go of this world. We continue to relive these memories through fan fiction, arts and crafts, music, food and drink, and theme parks.Being that it came out nearly a decade ago, I think it holds up pretty well."}, {"Review": " ***** CONTAINS SPOILERS SO MAYBE DON'T READ THIS WHEN YOU HAVEN'T READ THE BOOK YET. :) *****  “The true master of death does not seek to run away from death. He accepts that he must die and understands that there are far worse things in the living world than dying.”  -Albus Dumbledore\nTo you, yes you, reader of this review\n, should you decide to read this review from beginning up to the very end, I offer you my deep thanks for your resilience, bravery and loyalty for this may be one of the longest reviews you’ll ever read on Goodreads. You still have time to back out though, so don’t tell me you haven’t been warned.^^\nTo J.K. Rowling, \nthere is no argument about your brilliance. You are a certified genius, a person with superhuman writing ability and imagination and I can’t praise you enough for writing these books that have forever changed my life. But you’re still human and surely you’ve recognized your flaws. One of which is your penchant for killing your characters. You can’t blame me for thinking that one of the reasons you created so many great and memorable characters is for you to be able to kill as many of them as you want to. I accept though with the heaviest heart that certain characters needed to die, needed to sacrifice their lives for the greater good but I find no good reason for the death of (view spoiler)[Fred! (hide spoiler)]. Why? Why kill him? Haven’t you killed enough already? Why did he even have to die?! Why not Percy instead? (kidding). I honestly think no Weasley should have died for obvious reasons I don’t think I still have to enumerate. Also, I honestly believe the last book lacks at least 200 more pages. Why jump to 19 years later epilogue right after the devastating war? Don’t the rest of the other characters deserve a few pages about them? A simple tribute perhaps to all their sacrifice and pain and loss? I have gone so far, have read hundreds and hundreds of pages from book one only to be spared of better resolutions before an epilogue. Also, don’t you think (view spoiler)[Professor Severus Snape (hide spoiler)] deserved a better, more respectful way to die? And whatever happened to (view spoiler)[Professor Moody’s (hide spoiler)]body? So you see, even though I admire you with 99.72 percent of my heart, .28 percent percent is resenting your choices. But thank you. Now my heart is tougher and braver. Characters in the next books I read could all die and I probably wouldn’t shed a tear. I just wish I read your books before Allegiant and Mockingjay. I probably would have considered those happy endings.\nTo Harry Potter\n, I will never forget your brave and pure heart. You showed me that heroes can be an average boy with no special superpowers except courage, trustworthy instincts and strength of will, oh and of course, a bunch of awesome wizards and witches supporting and protecting him the best way they can. \nTo Hermione Granger \n, you are the most kick-ass heroine I’ve ever met without needing to actually kick ass. You only needed your intellect, level headedness and kind heart and like Ron said, without you and your beaded bag, he and Harry would not have survived a day during your quest.\nTo Ron Weasley\n, you probably are the biggest idiot in the story but you showed the best of you in times you are needed the most. I admire your loyalty, sarcasm and free spirit and there is no better man for Hermione than you. \nTo Fred and George\n, when in tears, I could always count on you guys for a good laugh. It's no fun without you. (view spoiler)[George, it’s hard enough losing a part of your body but to have to lose your twin brother too. Oh Gaaaaawd! *wails*  (hide spoiler)]\nTo Hagrid (and Graupy) \n, *hugs* I’ll never forget your gallons of tears and rock cakes! Thank you for your loyalty, friendship and bravery. You will be remembered for generations. \nTo Professor Snape,\nyou are indeed the bravest of them all. Your sacrifice is utterly selfless and certainly the biggest of all. Your memories Harry and I saw in Dumbledore’s Pensieve ripped my heart to pieces and I spent days and nights crying for you. You're a true hero and you deserve a monument. Maybe I'll name my son after you. *wails*\nTo Professor Dumbledore\n, you are the true epitome of sacrifice, love and humility. You find something good in every person and you never fail to offer kindness even to those others deem undeserving.\nTo Dumbledore’s Army led by Neville, Luna, Ginny,\n, you guys are awesome!\nTo the Order of the Phoenix,\n you were amazing especially you Mrs. Weasley! I’m so sorry for your losses but thank you, thank you so much.\nTo the Hogwarts Professors led by Prof. Mc Gonagall\n, you did an amazing job holding off Voldy! You were all brilliant!\nTo the Malfoys,\nuh I don’t know. How about I just stick my tongue out at the lot of you!\nTo Dobby, \n *wails* I can’t…just thank you so much. You’re the most loyal elf. The bravest free elf I know.\nTo Kreacher,\n you poor thing. I had no idea what you had to go through and what made you the way you are. In the end, thank you for your bravery and for leading the elves to the battle.\nTo the Death Eaters and Snatchers led by Bellatrix and Greyback\n, I have two words foryou. “AVADA KEDAVRA!”\nTo Umbridge,\n off to Azkaban, you go! \nTo Voldemort\n, that’s right, I dare! I am completely with Harry, You don’t learn from your mistakes, Riddle, do you?\nTo the rest of the fallen,\n (view spoiler)[Professor Moody, Cedrick, Sirius, Remus, Tonks, James and Lily, Colleen Creevey and many others (hide spoiler)], like Neville said, your death was not in vain. Thank you! *wails*\nTo the movie makers and actors\n, thank you for bringing to life the characters we love. We will always look up to you people. Don't you dare disappoint us!^^\nTo my Goodreads friends who bullied me into reading Harry Potter,\n thank you for destroying my life! I was doing perfectly fine without these books. You wrecked me pretty bad especially when I was reading the last book. I felt like hundreds of Dementors were surrounding me while reading it that I had to constantly cast a Patronus Charm while reading. It was really exhausting. My Patronus is a baby elephant, btw! Oh and I'm House Gryffindor, hurray! I'm afraid, I'm becoming worse than Luna Lovegood.\nTo Jia and Kyra\n, HAPPY BIRTHDAY, my young, smart and beautiful friends (March 06 is their actual birthday). You are both gifted for having such passion for reading at such young ages. Savor that gift and seize your most special day! <3"}, {"Review": "REVIEW TO COME TOMORROW\n'Do not Pity the dead, Harry. Pity the living, and above all, those who live without love.'\nit still feels weird to me me for finishing this series. I mean, I had read this series since August and I feel really ... weird. I feel like I just bought the first book yesterday instead of months ago. I feel like I just read the first book yesterday instead of months ago. Months ago, I thought I would feel okay when I finished this series but I do not feel that way. I feel ... like empty or hollow on the inside, you know what I mean, right? like there is this sad feeling and you just want to read it forever and ever but you can't because the story is over and there is nothing you can do. the only thing you can do is hugging the book because that way you would feel much better, like you actually hug the main characters.maybe this is how it feels like when you have to say goodbye to your best friends who have always be with you. no matter how difficult the situation is but they are there. I always envy those people who grew up with Harry Potter series. I envy them because they have such incredible childhood and me, I was a muggle that time and I used to hate reading novels so much and I had never once thought that I would love reading novels as much as I love breathing. Harry Potter series also has a great impact in my life. I was the kind of girl who always shy and never be myself because before reading HP I wanted people to like me, so I became what they wanted me to be and I rarely stood up for myself even when I knew I was right but Harry Potter series has changed me. you guys do know Luna, don't you? many people called her \" Loony \" because she believed in many things but Luna didn't care what they called her, she kept being herself and she had never ashamed to show her true self and that was the time I realized I was such a stupid girl who let my so-called friends changed me to be the girl I didn't even want me to be and now, my friends often say that I am such a weirdo or crazy girl who is very different from them because I love reading books so much and you know what? I just don't care about them anymore. I don't care when they say about me such a weirdo because I am not ashamed of being myself anymore because this is who I am and Luna also taught me one more thing, when you are being yourself and everyone teases you because of it. don't you ever worry about it because your true friends will come to you. these friends will accept who you are. Just like Luna who has amazing friends, Harry Ron, Ginny, Hermione and Neville.like I told you, I used to be very shy that I never stood up for even myself. few weeks ago, my friend who always insulted me, she insulted me again and no one in class was brave enough to stand up for themselves. the next thing I knew was that I snapped back at her and she was shocked and she has never insulted me again since that accident and she is kind of nice to me and we're friends now.This series has changed me to be a braver person. I don't think I can say this is a review because it's all about me and one more thing,,(view spoiler)[ I will never ever forget 2nd May 1998. I lost so many great friends Remus, Tonks, Colin, Fred, Sirius and many more. (hide spoiler)]I really want to say many thank you to Mrs. J. K. Rowling who wrote this awesome series because this series has changed me to be a better person and this series also changed me to be so much braver person. Thank you very much, Mrs. J. K. Rowling and thank you very much for reading this guys. ❤❤❤P.S. I found all these wonderful pictures on Google. Many thanks for the creators."}, {"Review": "***SPOILERS:From an interview with Rowling on the Today show:http://www.msnbc.msn.com/id/19...Rowling said her original epilogue was “a lot more detailed,” including the name of every child born to the Weasley clan in the past 19 years. (Victoire, who was snogging Teddy — Lupin and Tonks’ son — is Bill and Fleur’s eldest.)Harry, Ron and HermioneWe know that Harry marries Ginny and has three kids, essentially, as Rowling explains, creating the family and the peace and calm he never had as a child.As for his occupation, Harry, along with Ron, is working at the Auror Department at the Ministry of Magic. After all these years, Harry is now the department head.“Harry and Ron utterly revolutionized the Auror Department,” Rowling said. “They are now the experts. It doesn’t matter how old they are or what else they’ve done.”Meanwhile, Hermione, Ron’s wife, is “pretty high up” in the Department of Magical Law Enforcement, despite laughing at the idea of becoming a lawyer in “Deathly Hallows.”“I would imagine that her brainpower and her knowledge of how the Dark Arts operate would really give her a sound grounding,” Rowling said.Harry, Ron and Hermione don’t join the same Ministry of Magic they had been at odds with for years; they revolutionize it and the ministry evolves into a “really good place to be.”“They made a new world,” Rowling said.The wizarding naturalistLuna Lovegood, the eccentric Ravenclaw who was fascinated with Crumple-Horned Snorkacks and Umgubular Slashkilters, continues to march to the beat of her own drum.“I think that Luna is now traveling the world looking for various mad creatures,” Rowling said. “She’s a naturalist, whatever the wizarding equivalent of that is.”Luna comes to see the truth about her father, eventually acknowledging there are some creatures that don’t exist.“But I do think that she’s so open-minded and just an incredible person that she probably would be uncovering things that no one’s ever seen before,” Rowling said.Luna and Neville Longbottom?It’s possible Luna has also found love with another member of the D.A.When she was first asked about the possibility of Luna hooking up with Neville Longbottom several years ago, Rowling’s response was “Definitely not.” But as time passed and she watched her characters mature, Rowling started to “feel a bit of a pull” between the unlikely pair.Ultimately, Rowling left the question of their relationship open at the end of the book because doing otherwise “felt too neat.”Mr. and Mrs. Longbottom: “The damage is done.”There is no chance, however, that Neville’s parents, who were tortured into madness by Bellatrix Lestrange, ever left St. Mungo’s Hospital for Magical Maladies.“I know people really wanted some hope for that, and I can quite see why because, in a way, what happens to Neville’s parents is even worse than what happened to Harry’s parents,” Rowling said. “The damage that is done, in some cases with very dark magic, is done permanently.”Rowling said Neville finds happiness in his grandmother’s acceptance of him as a gifted wizard and as the new herbology professor at Hogwarts.The fate of HogwartsNineteen years after the Battle of Hogwarts, the school for witchcraft and wizardry is led by an entirely new headmaster (“McGonagall was really getting on a bit”) as well as a new Defense Against the Dark Arts teacher. That position is now as safe as the other teaching posts at Hogwarts, since Voldemort’s death broke the jinx that kept a Defense Against the Dark Arts professor from remaining for more than a year.While Rowling didn’t clarify whether Harry, Ron and Hermione ever return to school to finish their seventh year, she did say she could see Harry popping up every now and again to give the “odd talk” on Defense Against the D"}, {"Review": "\nI started the Harry Potter audio books at the end of August 2016. It took me a little over 4 months to listen to them all (I fit a few others in-between) but I’m so happy I finally finished. If you haven’t read them before, or you’re a long time fan looking for a re-read I can’t recommend the audio books enough. Jim Dale does a fantastic job with the narration. I can see myself going back one day and listening to them all over again! Now to the final book of the series: Harry Potter and the Deathly Hallows. The book begins with Harry, Ron and Hermione on the run doing the task that Dumbledore gave Harry. To be honest, the first part of the book (and by first part, I mean the first 70-80% or so) was a little slow for me. There were exciting things to pop up here and there, but a lot of it was slow. Then the last few hours of the audiobook happened. I’ve gotta say, once this trio got back to Hogwarts, the ending was epic. There were moments of sorrow, moments that made me laugh, smile, cry… it was very emotional (view spoiler)[GAWD that Snape scene.… I can’t even! It made me cry like a baby. And love a character I didn’t care for much! (hide spoiler)]. I’m pleased with the way it ended. Overall, this series has been fantastic for me. I’m so glad I finally made the time to read them all. I’ve always loved the movies and been a fan, but now I feel like I need to go and re-watch everything! Harry Potter is a heartwarming series with courageous characters that I will hold near and dear to my heart. "}, {"Review": "\n“Do not pity the dead, Harry. Pity the living, and, above all those who live without love.” \nHarry Potter and the Deathly Hallows literally touched the deepest part of my heart. This book has many layers and each one was refined by the smartest author I've ever known. J.K. Rowling always has a plan, she never threw anything into her books without thinking it first. In this case, I think she planned the ending of this book since she started writing for sure, and every point she emphasized in HP 7 was unfaltering and made me believe that it's a pure diamond when she ended her story with an epic score.\n“Of course it is happening inside your head, Harry, but why on earth should that mean that it is not real?” \nHarry, Ron and Hermione prove themselves that they're just ordinary humans. They bicker. They argue each other. They make the sly plan. Importantly, they get to know how to forgive and forget, that's all that matters.\n“We're all human, aren't we? Every human life is worth the same, and worth saving.”\nThis book is EVERYTHING. It became much more than just a fiction for me. It had its voice and when it whispered in my ears, I literally believed that there was magic in this world. Each chapter made me strong and wanted to be someone better. Each character epitomized a different kind of person. This book doesn't deserve five stars review, it's beyond measure and a thousand stars are not even enough.\nAlbus Severus,\" Harry said quietly, so that nobody but Ginny could hear, and she was tactful enough to pretend to be waving to Rose, who was now on the train, \"you were named for two headmasters of Hogwarts. One of them was a Slytherin and he was probably the bravest man I ever knew.”\nMore at http://goo.gl/RWrdg3"}], "Image": "https://images.gr-assets.com/books/1474171184l/136251.jpg", "Desc": "Harry Potter is leaving Privet Drive for the last time. But as he climbs into the sidecar of Hagrid’s motorbike and they take to the skies, he knows Lord Voldemort and the Death Eaters will not be far behind.The protective charm that has kept him safe until now is broken. But the Dark Lord is breathing fear into everything he loves. And he knows he can’t keep hiding.To stop Voldemort, Harry knows he must find the remaining Horcruxes and destroy them.He will have to face his enemy in one final battle.--jkrowling.com"}