{"Genre": "Fantasy", "ID": "7896527", "Name": "Throne of Glass", "Reviews": [{"Review": "Are you kidding me? What the hell is this shit? How do you screw up your story quite so badly after starting from an INCREDIBLE premise involving the most notorious assassin in the land - now a slave - being offered the chance to win back her freedom, sort of, in a \"to-the-death tournament - fighting the most gifted thieves and assassins in the land\" [says the back of my book, conveniently forgetting that (a) right before the final duels, the king specifically states that the competitors \"can win only by trapping [their] opponent[s] in a position of sure death ... and no further\" so to-the-death my foot, and (b) apart from thieves and assassins, a number of the competitors are actually ex-guards and random other criminals, for the most part disposable enough not to warrant names, and I'd only consider a small handful of them to be gifted at anything]? I mean, you really have to be TALENTED to go from all of *that* Exciting Sounding Awesomeness to - well - to Throne of Glass.After reading the Q & A included in the back of my book, though, it all started to make sense, and I wish I'd known before buying this stupid-ass book that it's inspired by DISNEY'S CINDERELLA, of all things. I know what you're thinking: Where the fridge tart does Cinderella come in? Isn't this story about, like, a TOUGH-AS-NAILS former-assassin-now-slave competing for her life in, like, the most badass tournament ever? Well ... actually, no. And I'm happy to spend the next few hours of my life quoting this most dumbass book if it means AT LEAST ONE PERSON might decide not to waste their money on it, no need to thank me.'\"Wake up.\" Not surprisingly, it was Chaol.She shimmied beneath the blankets, pulling them over her head, but he grabbed the covers and threw them to the floor. Her nightgown was wrapped around her thighs. Celaena shivered.\"It's cold,\" she moaned, holding her knees to her body. She didn't care that she had only a few months to beat the other Champions - she needed sleep. [Nope, this isn't your bratty kid sister, but the most notorious assassin EVAH! You know, the one who - after slaving away in the salt mines for four months - was so desperate to escape that she even tried a mad suicide dash. What the hell, though; they're only offering her her freedom.] It would have been nice if the Crown Prince had considered springing her from Endovier earlier so she could have some time to regain her strength; how long had he known about this competition, anyway? [Sheesh. I know, right? Silly Crown Prince, not considering the feelings of, like, one of the most terrible criminals his men have ever captured. I mean, he gives you large, comfortable living quarters in his castle, a billiards table, a chance to change your life, even a puppy, and - what - he thinks this is enough?!] \"Get up.\" Chaol ripped the pillows from beneath her head. \"Now you're wasting my time.\" If he noticed how much skin she was showing, he didn't react. [That wasn't irrelevant at all ... ]Grumbling, Celaena slithered to the edge of the bed, dangling a hand over the edge to touch the floor. \"Fetch my slippers,\" she mumbled. \"The floor's like ice.\" [Yeah, put those servants in their place, Cinderella!]...From the doorway, Chaol asked, \"Why, might I ask, are you so tired?\"She gulped down the rest of the pomegranate juice and wiped her mouth on a napkin. \"I was up until four reading,\" she said.' [Why do you even have to ask, Chaol? It's only the start of the tournament of Celaena's life; of course she stayed up all night reading. SLEEP WHEN YOU'RE DEAD, YO!! If the competition barely merits any page time, why should the competitors actually give a shit about it?!]'A few minutes later, Celaena frowned at herself as she hurried after the captain into the foyer. \"I look ridiculous! These pants are absurd, and this shirt is awful.\"' [Way to be descriptive, Cinderella! Generic complaints FTW! It's not like you've been slaving in the salt mines for a year, or anything like that, OF COURSE YOUR CLOTHES MATTER and HOW DARE THEY?! DON'T LET THE BASTARDS GRIND YOU DOWN!!?!!?!!]'\"You expect me to use a mace an hour after sunrise?\"' [The horror!]'She bit into an apple. It was tart, with a sweet, honey-like aftertaste. \"Oh? And what books do you love?\" He named a few, and she blinked. \"Well, those are good choices - for the most part. What others?\" she asked, and somehow, an hour flew by, carrying them on the wings of conversation.' [Jesus. This paragraph isn't a pointless waste of space at all.]'There was something girlish about her, too. Oh, he couldn't stand her contradictions!' [INVASION OF THE BODY SNATCHERS!!! Because *my* Chaol doesn't have a va-jay-jay ... ]'Celaena bit down her laugh. Archery? It was an archery contest?' [Yeah, that was my reaction, too ... ]'Pelor, the gangly assassin, wasn't yet strong enough to manage a longbow, and barely made any shots. When he finished, his eyes gleaming with resentment, the Champions sniggered, and Cain laughed the loudest....Despite herself, Celaena felt badly for the boy. His shots hadn't been that bad.' [Yeesh! If barely making any shots isn't *that* bad, I can see how CINDERBRAT is the world's scariest assassin.]'\"Why would she kill me? I think she likes being pampered. [*snort*] If she hasn't attempted to escape or kill anyone, then why would she do it now?\" He patted his friend on the shoulder. \"You worry too much.\"' [ZOMG! U NVR HERD OF BIDING UR TIME B4? This Crown Prince is clearly not the brightest crayon in the box.]'Sam. What would he make of all this?' [Since he's never been mentioned before, I really can't say. Sorry.]'Dorian peeled himself from the wall. For all her assassinating experience, she didn't notice him until he sat down on the bench beside her.' [Yeah, I can see why she's Most Baddest Assassinator EVAH! And who glued you to the wall, anyway, Crown Douche Bag?]'\"No. I can survive well enough on my own - if given proper reading material.\"He looked at the fire, trying not to think about where she'd been only weeks before - and what that kind of loneliness might have felt like. There were no books in Endovier.' [I find it hard to believe that loneliness is your biggest problem when you're a beautiful seventeen-year-old girl slaving away in a salt mine, but ... what do I know? A BOOK!! A BOOK!! MY KINGDOM FOR A BOOK!!!!]'It wasn't until later that Philippa brought the news. The Champion who hadn't shown up for the Test had been found dead in a servant's stairwell, brutally mauled and dismembered.The new murder cast a pall over the next two weeks, and the two Tests they brought with them. Celaena passed the Tests - stealth and tracking - without drawing much attention to herself or risking her neck to save anyone.' [When your plot's so boring that you're summarizing it all, you've got a problem ... ]'He remained in the doorway, fearful that she'd wake up if he took another step. Some assassin. She hadn't even bothered to stir.' [I know, right? Also, you're a stalking stalker, Crown Douche Bag!]'She smiled at the young chevaliers they passed - and smirked at the court women who eyed her pink-and-white gown. She couldn't blame them; the dress was spectacular. And she was spectacular in it.' [Bloody hell, you'd think a year of slavery would knock the vanity right out of a girl ... ]'The assassin pivoted around the table and took aim again. She missed. Gritting her teeth, she considered snapping the cue in half across her knee. But she'd been attempting to play for only an hour. She'd be incredible by midnight! She'd master this ridiculous game or she'd turn the table into firewood.' [Now, now, CINDERBRAT. Temper tantrums are, like, so unbecoming.]'\"For the world's greatest assassin, this is pathetic,\" said Dorian, stepping from the doorway.' [Because assassins are widely known to be proficient at billiards. What, you didn't know??]'She had often wished for adventure.' [If you spend seven years as an assassin and somehow manage not to stumble headfirst into all sorts of adventures, you're probably not doing it right.]'So she'd cheated a little, but she'd won.' [LADIES AND GENTLEMEN, HOLD ON TO YOUR SEATS; WE'VE JUST HAD OUR FIRST GLIMPSE OF CELAENA ACTUALLY BEHAVING REMOTELY LIKE AN ASSASSIN!!!! And it's only page 240 ... ]'It had been over three weeks since her last encounter with Elena, and she hadn't seen or heard her at all, despite the three Tests she'd had, the most exciting of which being an obstacle course, which she passed with only a few minor scratches and bruises. Unfortunately, Pelor hadn't done so well, and had been sent home at long last. But he'd been lucky: three other competitors had died. All found in forgotten [well, obviously not that forgotten] hallways; all mutilated beyond recognition.' [The plot overload! It's ... it's ... positively ... unbearable ... ]'Amidst her worrying, another Test passed without incident or embarrassment - though she couldn't say the same for the soldier who'd been sent home - and she kept up her intense training with Chaol and the other Champions.' [WOW: So Much Story! How can I process it all?]'\"Candy!\" A large paper bag sat on a pillow, and she found that it was filled with all sorts of confectionary goodies. There was no note, not even a name scribbled on the bag. With a shrug and glowing eyes, Celaena pulled out a handful of sweets. Oh, how she adored candy!Celaena issued a jolly laugh and crammed some of the candy into her mouth....\"Someone,\" she said in between chews, \"is very good to me.\"' [I just ... oh God ... I have no words! :D Cookie Monster strikes again?]'\"Of course I want her,\" Celaena said, then realized what the implications would be. \"But I want her trained. I don't want her urinating on everything and chewing on furniture and shoes and books. And I want her to sit when I tell her to and lay down and roll over and whatever it is that dogs do. And I want her to run - run with the other dogs when they're practicing. I want her to put those long legs to use.\"Dorian crossed his arms as Celaena scooped up the dog. \"That's a long list of demands. Perhaps I should have bought you jewelry after all.\" [Hold your puppies, Dorian, CINDERDIVA STILL isn't done.]\"When I'm training\" - she kissed the pup's soft head, and the dog nestled her cold nose against Celaena's neck - \"I want her in the kennels, training as well. When I return in the afternoon, she may be brought to me. I'll keep her in the night.\" Celaena held the dog at eye level. The dog kicked her legs in the air. \"If you ruin any of my shoes,\" she said to the pup, \"I'll turn you into a pair of slippers. Understood?\"' [Jesus Christ. Is it bad that what *I* want is for someone to rend Celaena limb from limb? And why does she have a bunch of shoes, anyway? Am I the only one who remembers that she's a fucking FORMER-ASSASSIN-NOW-SLAVE?!?!?!?!?!?!?!?!?!]'Philippa huffed. \"Just don't tell them I helped you when you get dragged back here.\"' [Sure, because if Celaena says nothing, they'll probably assume it was one of her other, non-existent maids who helped her navigate her way into her dress.]'Frowning, Chaol watched his friend dance with the assassin. He wouldn't have danced with her, anyway. And he was glad he hadn't worked up the nerve to ask her, not after seeing the color that Duke Perrington's face turned upon discovering the pair.' [WTF is the author Chaol talking about? What actually happens five minutes prior to this is that Celaena asks him to dance and he says no. Also, this guy's kind of a wussy-with-a-\"p\" for a Captain of the Guard. He's never even killed anyone before. Yeesh. Captain of the Guard, my foot.]' ... Cain was little more than a pawn in a game to amuse the king ... ' [That's what they keep saying, but the king isn't even present in the castle for the majority of the competition, so ... ]Oh, one more thing: THE NAMES! How the heck do you pronounce Chaol? Kale? Like the cabbage? And Kaltain Rompier has to be one of the stupidest names I've EVER come across. It makes me think of frolicking unicorns, or ... something. As for the main character, well, I don't even know what to call her. Selena? Kay-lay-na? (that's the one I eventually settled on, after spending half the book mentally mumbling her name) I mean, what in Erilea kind of a name is Celaena? Is it really any wonder that Nehemia eventually renames her?! Other people get normal enough names, such as Dorian and Grave and Sam and Elena and Xavier and Cain and Philippa and Verin and Ned; simple names, really. I guess the special snowflake needs a special name to go with her very special personality impairment. Don't even try to get me started on the place names, because I tuned them out after Eyllwe, so I have no idea how these countries / lands / coffee beans relate to one another, but I'll probably live.And what is even the point of the glass castle? Or the non-existent throne of glass that the book's apparently named after? Thinly-veiled CINDERELLA references FTW!!!! If you ask me, the author should have gone for Cinderella in Candyfloss Land!, because you certainly don't get much more than that. I don't even know what Celaena spends most of the second half of the book doing. The tournament trials and murders are mentioned in passing here and there (Yesterday we threw knives! Another three people were eaten over the past three weeks!) and the book focuses on - I don't know what - Celaena sitting in her room, Celaena fawning over herself in front of one mirror or another, Celaena boasting about her amazing assassin skills that you'd otherwise never know she had, Celaena going for walks, Celaena admiring pouffalicious dresses, Cinderella Celaena wishing someone would invite her to the ball, Celaena eating sweets, Evil King being evil, and Frolicking Unicorn being high. It's ... exciting stuff. Really.Also, since when do slaves have possessions? Why does some random slave (who immediately gets murdered by some random people, so yay for the Drama Llama) have enough salve to pass around as required? Who makes this salve? From what? Who are these slaves allowed to associate with that they can procure salve? What do they trade for this salve? Their bodies? Their hair? Salt they've squirrelled away from the mines? Yeesh! Explain yourself, Sarah J. Maas!UGH! Terrible, terrible, horrendous. Nonsensical, stupid, pointless. Fluffy, pathetic, ridiculous. Need I say more? Really? Need I? Throne of Glass tries to emulate Poison Study ... and fails ... spectacularly. Save yourself the torture and go straight for Poison Study. If you've already read Posion Study, read it again. Or try Graceling. Just ... don't say I didn't warn you."}, {"Review": "DNF 35%Meet Celaena. She’s the world’s best assassin. Or so we’re told. She’s very, very talented. Very talented. And famous. She’s also really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, *takes a deep breath* really pretty.\nIt was true that she had been attractive once, beautiful even.She looked at her rags and stained skin, and she couldn’t suppress the twinge of shame. What a miserable state for a girl of former beauty!But it was her golden hair that caught the attention of most, hair that still maintained a glimmer of its glory. In short, Celaena Sardothien was blessed with a handful of attractive features that compensated for the majority of average ones; and, by early adolescence, she’d discovered that with the help of cosmetics, these average features could easily match the extraordinary assets.“What remarkable eyes you have!”The prince’s eyes shone with amusement at her brashness but lingered a bit too long on her body.No, he had to remember that she was an assassin with the blessing of a pretty face […]He found her beautiful. […] It was something in the way her eyes sparked when she looked at something lovely in the landscape. […] Through a clearing in the swirling mass, a cluster of stars could be seen. He couldn’t help thinking that they gazed down at her. [...] A lovely girl gazing at the stars, and the stars who gazed back.\n\nGag.\nShe looked spectacular. Utterly and completely spectacular.Though she may look pleasant, […]“Beautiful ladies are always associated with the Crown Prince – you should be flattered that you’re attractive enough to be considered his lover.”“Your face is much more pretty when you smile.”She smiled at the guards outside her door, and her smile burst into a grin at their exchanged approving glances.“You look rather pretty today.”An expression of surprise crossed his features when he beheld her in her finery […]“[…] it would be hard to pass off someone so pretty as your sister.”“I bet they won’t expect to be trounced by a beautiful lady.”His dark eyes snaked along her body, […]Her disgust didn’t improve when Grave ran an eye over her body.Her turquoise eyes glittered as she stared at his hand, and his heart quickened when her gaze rose to his face. Yes, sweaty as she was, she was beautiful.\nMuch pretty.\nI had hopes that the book would pick up once the competition began, and for a split second, it did. But then they added more drama in the form of more suitors for her big-hearted future love interest, and there was another potential love interest, and I just really can’t be bothered.I'm out."}, {"Review": "First cover: \"Yeah, don't I look badass in this? Wait, hold on, does my hair and makeup look okay? I think I need to pose like this, so I look all strong and tough.\"Second cover: \"Fuck off or I'll end you.\"I still stand by my opinions on the covers. I never liked the first cover, and am infinitely grateful that they changed them for the sequels. But as far as how Celaena herself is? I would say she's a bit of both. I feel like these covers portray two very different extremes, and Celaena seemed to possess a quality from each of them. That's actually what I loved about her. She's fast becoming one of my all-time favorite YA heroines.I'll admit that a long while ago, I hadn't expected the book to be this good. But as soon as I read the prequels, I fell in love, and I definitely have high hopes for this series."}, {"Review": "Caleana Sardothien, young woman assassin, is betrayed and sentenced to the salt mines of Endovier. After a year, however, she is given an opportunity: If she wins a contest to become the king's champion, she will be granted a four-year contract, working as an assassin for the empire she hates, at the end of which time she will be freed. After reading the premise of the book, I thought, \"Sign me up!\" After the first chapter, I knew I was in good hands. This book has plenty of mystery, magic, humor and romance -- a perfect brew for fans of good YA fantasy. If you liked Graceling, Grave Mercy, Shadow and Bone or other fantasies featuring strong female protagonists with scary good skills, I think you'll enjoy this quite a lot. And it's the first of a series!"}, {"Review": "Want to be updated on everything Throne of Glass?Visit the Throne of Glass fansite!CELAENA be all like:Leaving me like:Let me just clear things up. People are rating this book low because they don't \"like\" Celaena, saying she's \"arrogant\" or \"self-centred\" or \"over-confident,\" first of all, if Celaena were a guy, you'd be head-over-heels for her. But she's a girl and now her story is being over-looked because, instead of drowning in self-pity, she decides to stand up, throw her hair over her shoulder and say \"screw the world, I'm gonna survive.\"I admire her for not letting her time in Endovier break her. How many books have you read with an author spending a dominant part of the plot trying to pry away the pity in the heart of her damaged characters, yeah, that's right, almost every time. They're usually so engrossed with whatever they did or whatever they went through, they bury themselves in their past and drown themselves in their own sympathy that it's actually ridiculous.But Celaena isn't like that and she's getting hate for it.Celaena aside, Dorian was okay, I've got no rotten points to divulge about him. I would, however, like to see his character develop further, because right now he's; [x] Not what he seems[x] Doesn't like being a prince[x] Insanely good-looking[x] Has daddy issues. (never forget the daddy issues)And these are such stereotypical characteristics of a YA Prince. Dorian is charming in a boyish non-arrogant way. He makes Celaena smile and is an all-around good guy. And he loves books. Those are always plus points in my book.I don't really know what to think about Chaol, at this point, he's still a raw character, not entirely cooked enough to be eaten (what?). Sometimes he's so frustrating, other times he's so adorable I want to hug him.Right now, I've already read The Assasin's Blade and Crown of Midnight, I'm also halfway through an ARC of Heir of Fire and I can confidently say that if you give this series a fair shot (and Celaena too) then you'll see what I love so much about it. Just so you know: I've never completely disregarded major negative points in a series before, so much so that I still gave it 5 stars. and I am not going to deny that Throne of Glass deserves its varied ratings. But I love Throne of Glass for reasons of my own, I'm not reviewing this for some publisher, so I'm letting you know now, my views are biased. I empathise with Celaena on so many levels, it's almost like we're the same person when I read the books, so with that, I've grown attached to the series as well. "}, {"Review": "Once again, it seems like I'm in the minority for this book because I didn't like it. It's such a shame too because I'd heard a lot of good stuff about it. Oh well, maybe it's just me...or maybe because this book just plain sucks.Let's start off with our protagonist, Celaena who's the \"greatest assassin in the world.\"Okay, I'm cool with that. But it'd be nice if she could actually prove it because from what I've seen, she's once hell of a crappy assassin. People walk in and out of her room all the time when she's sleeping and she just keeps on snoring. Hello, aren't you supposed to spring awake like a ninja and hold a knife to that person's throat?That's what I expect from someone who just left a death camp. Instead I get this.The real clincher is what I call the 'Candy Incident'. There's a bag of candy left on Calaena's bed with no note or anything. This is during the period where a murderer is going around killing Champions and a couple have died already. And what does the 'greatest assassin in the world do? She gobbles them up immediately, going Oh, how I adored candies!Remember that episode in Avatar: the Last Airbender when Sokka drinks cactus juice and gets all high? Then, it wears off and this happens:Couldn't have said it better myself, Katara. Calaena is the kind of idiot that licks stuff off walls, even without the hallucinatory assistance of cactus juice.But wait, there's more! Nothing happens to her because she's purrrfect and fabulous, like that song from High School Musical. In fact, I'm pretty sure she's a Mary Sue. Let's check off her traits, shall we? Tragic past, check. Pretty, check. Amazingly good at something, check. Has more than one love interest, check. Don't even get me started on the love interests.There is absolutely no difference between Dorian and Chaol except for the fact that I'm more leery of the name Dorian. Maybe it's because I just recently finished The Picture of Dorian Gray so whenever I see his name, I think of this:It could be me but then again, you wouldn't name your kid Lolita, would you?And the ending (view spoiler)[where Calaena breaks up with Dorian because she's the King's Champion and it would be inappropriate? We all know it's a ploy to squeeze in some kissy-kissy time with Chaol in the next book. And by being single, she doesn't look like a cheater. (hide spoiler)]On a side note, I saw this took 10 years to write because it was originally published on FictionPress.net or something. Seriously? It took George. R. R. Martin to that long to write A Game of Thrones and look what he came up with!And this is Calaena's world:My review of Crown of MidnightMy review of Heir of FireMy review of Queen of Shadows"}, {"Review": "Sorry, but it looks like I've been excited for NOTHING. After enticing me with its promises of a reading experience reminiscent of Megan Whalen Turner and George R.R. Martin, Throne of Glass ultimately let me down. Having been excited for this novel for weeks and actually liking the sample I read, I have been brought back to earth now – with a jolt. This YA fantasy is a rather sorry example of its genre.I have the notion that a big part of this book did not work for me because of its heroine. Celeana is smart, athletic, talented and beautiful. She loves music and reading. She is fluent in different languages. She is great. And she knows it. And rubs it in your face repeatedly. As do her suitors and admirers. I had the feeling that Sarah J. Maas tried everything to make me love her heroine. How do you make readers love someone? Present them with a book lover! But somehow, she accomplished the opposite. I did not loathe Celaena, but she grated on my nerves. I wished someone would tell her off, would for once not grant her every wish; I wished the characters I liked would not fall for her charms and good looks. The little romance Celaena had (I won't say with whom) was laughable at best and mostly resulted in me rolling my eyes at the fact that the only attraction that existed between those two stemmed from them both being beautiful.In terms of plot, I cannot deny that there was always a level of suspense present. I did want to know how this story ended, and yes, there were actually parts when I feared the whole thing would not end well – partly because my beloved heroine did not deem it necessary to inform certain people about what she had witnessed in the castle. Overall, though, the story remained a tad too juvenile and simple for me. Important events were mentioned only in passing and the mythology did not go any further than what was important for the main story line. Many things remained unsaid – doubtlessly for the sake of sequels yet to come – but it was not the subtle way of remaining unsaid but hinted at I love in fantasy novels, it felt more like remaining unsaid to lure me into reading on. There were aspects I liked - Celaena's friendship to Nehemia, the Eyllwe princess, and Chaol, the loyal and fierce captain of the guard – but in the end, there isn't enough to make me interested in reading any sequels.In short - what I wanted: A less is more mentality. World building that does not only cover what is necessary to follow the main story arc. Subtle romance. Villains in different shades of grey. Assassins that actually assassinate. And do not only sit in their room talking or thinking about clothes and boys. What I got: A vain and mostly unlikeable heroine. Two men absolutely bedazzled by her presence. Hints of a love triangle. Lots and lots of descriptions of clothing. Flimsy world building. An overall poor execution writing-wise. Thank you. Next?Thanks a lot to Netgalley and Bloomsbury for the review copy."}, {"Review": "You can find the full review and more about this book on my blog!____________________________________________\n\n“Libraries were full of ideas–perhaps the most dangerous and powerful of all weapons.” \n\n____________________________________________\n5 BADASS STARS!\nFirst of all,look at this amazing cover.I also liked the first one but this is a masterpiece.I do have a weakness for awesome covers,that's why I decided to read this.Also a lot of people recommended this to me,and I heard great things and saw great reviews for this one.So I picked this up.It didn't disappoint. ____________________________________________\n\n“How long was I asleep?\" she whispered. He didn't respond.\"How long was I asleep?\" she asked again, and noticed a hint of red in his cheeks.\"You were asleep, too?\"\"Until you began drooling on my shoulder.” \n\n____________________________________________This is a fantasy adventure action pack novel.It is the first book in \"The Throne of Glass\" series.It's full of suspense and thrilling moments,which keeps you turning the pages.The romance and the action collide beautifully together,and the writing style is also perfect.____________________________________________\n\n“You could rattle the stars,\" she whispered. \"You could do anything, if only you dared. And deep down, you know it, too. That’s what scares you most.” \n\n____________________________________________The start was kind of slow.The main character didn't awe me,and in my opinion she was quite annoying(at the beginning).But after that everything got better,everything was perfect.I started to understand the characters,their lives before,and their intentions.The ending was epic.Especially the duel.I could visualize the scene,the people,the action.This book will be an awesome movie ,if it ever gets to be one/p>____________________________________________\n\n“We all bear scars,... Mine just happen to be more visible than most.” \n\n____________________________________________I also liked the sense of humor.It was minor,but it had it's moments.Especially conversations between Celaena and Chaol.And smart talks.You would be surprised how many characters are wise and smart.So it was not predictable.Everyone was hiding something____________________________________________\n\n“No. I can survive well enough on my own— if given the proper reading material.” \n\n____________________________________________The world the author has created it's brilliant,especially the caste and it's chambers.The big library with a million books,the icy throne and castle,the tomb and the secret tunnel,the gargoyles,everything.____________________________________________\n\n“Sometimes, the wicked will tell us things just to confuse us–to haunt our thoughts long after we've faced them.” \n\n____________________________________________The story follows an assassin named Celaena who is caught and taken to the king's castle.There she finds out that she is there for a reason.They want her to participate in a competition with 23 other fighters,and the winner gets to be the king's Champion,also gets the freedom and money.She has wished her freedom for so long and it was her chance to take,so she took it.Now she has to stay at the castle where the competition is being and there she discovers new things,battles new forces,and finds new people,people she could never think she would care about.____________________________________________\n\n“With each day he felt the barriers melting. He let them melt. Because of her genuine laugh, because he caught her one afternoon sleeping with her face in the middle of a book, because he knew that she would win.” \n\n____________________________________________Calaena is one of my favorite badass heroines.She is funny and awesome and likes teasing.Chaol and Dorian,they both were the same for me,good characters with common and different personalities.____________________________________________\n\n“No matter what happens,\" she said quietly, \"I want to thank you.\"Chaol tilted his head to the side. \"For what?\"Her eyes stung but she blamed it on the fierce wind and blinked away the dampness. \"For making my freedom mean something.” \n\n____________________________________________\nI highly recommend this book to every reader out there.It's one of my favorites of 2014 and I can't wait to read the rest of the series.So pick it up!\n*Pictures from the review are not mine, I took them mostly from Google images or Tumblr*"}, {"Review": "Characters were badly written, the plot was full of telling instead of showing. Very underwhelmed after hearing for years that this was THE YA series to read. I don't mind unlikeable characters, heck I love them but it didn't feel I was supposed to dislike our main snowflake. So tired of the \"strong\" female character who can kill everyone in a heartbeat but she's tiny and incredibly pretty, she hates all other women and... Oh also everyone wants her... just because.For more details and quotes, here's my reading vlog https://youtu.be/euovGE_A1Ik"}, {"Review": "4.5 stars\nI can survive well enough on my own— if given the proper reading material.\n Man oh man, this was a good oneCelaena, an 18-year-old master assassin, spent the last year as a salt-mine slave as punishment for her crimes. She's slowly wasting away but one day, the prince (along with his guard) comes by to lift her from her bondage.The king is in need of an Champion and had devised a convoluted plan to obtain one. All of his trusted advisers submit one criminal to a months-long tournament. The one surviving person endures a few years of servitude in exchange for complete freedom and pardoning of past crimes. \nSecond place is a nice title for the first loser.\nCelaena thinks she's stumbled upon an opportunity of a lifetime but she soon realizes that things are not what they seem. Someone (or something) seems to be killing off the other champions. The royal court wants to get rid of her. And, to top it all, the prince is attracted to her  which is putting a far higher price on everything. Despite all of the chaos and the killings, one thing holds true -\n at least she has her books. \n\n“Don't you ever do anything other than read?\" \nI honestly did not expect to like this one as much as I did.  I'm tired of the YA heroine trope. It's to the point where if I read a smidgen about a girl deciding the fate of the world, the book gets tossed on the back-burner-for-eternity pile.But, when my friend read this series and insisted (and by insisted I mean \n\ninsisted\n\n) I read it...I was a bit hesitant. I dragged my feet and I hemmed and I hawed.I shouldn't have - cause this book rocked. (I also learned that I need to trust my friends more.) I love it when all the characters literally spend their spare time reading. Makes my heart happy. \nLibraries were full of ideas—perhaps the most dangerous and powerful of all weapons.\n  And my favorite part to the book? The \"bedroom\" scene - anyone else with me? \n“She moaned into her pillow. \"Go away. I feel like dying.\"\"No fair maiden should die alone,\" he said, putting a hand on hers. \"Shall I read to you in your final moments? What story would you like?\"She snatched her hand back. \"How about the story of the idiotic prince who won't leave the assassin alone?\"\"Oh! I love that story! It has such a happy ending, too—why, the assassin was really feigning her illness in order to get the prince's attention! Who would have guessed it? Such a clever girl. And the bedroom scene is so lovely—it's worth reading through all of their ceaseless banter!” \nNow excuse me, I need to immediately start this sequelBlog | Instagram | Twitter"}, {"Review": "It feels like Throne of Glass has been a book I've been thinking about maybe reading for a million years. The reviews and ratings from my GR friends on this book are very mixed and I can easily see why after finishing this entertaining but disappointingly tame and romance-y young adult fantasy. Throne of Glass is like Shadow and Bone round two. The premise is awesome for both: full of hardcore warriors/assassins, royal/noble secrets and scandals, a touch of magic... but each one, though entertaining, quickly hangs up its weapons and becomes far more concerned with dresses, bitchiness and whether or not that sexy dude thinks the MC is hot (he does). This book is to the fantasy genre what Twilight is to vampires; though I have to stress that it is a fast-paced, compelling read and Maas does tame fantasy as well as it can be done. Despite my frequent eyerolls and disappointment at the romantic turn the story took, the pages seemed to fly by. I tend to read several books at once; I'll spend a few chapters with one and then mix it up by moving on to another, but Throne of Glass managed to hold my attention from start to finish with no time for interference from another book. This, in itself, was quite an achievement.Celaena Sardothien is the star of this show. A former assassin turned prisoner, she spends every day in the salt mines prison of Endovier. Having given up on hoping for freedom, she wishes only for death. That is, until one day The Crown Prince (Dorian) and his Captain of the Guard (Chaol) arrive with a proposition for her - fight in a competition, win, become the King's Champion for four years, and finally earn her freedom. It's an offer Celaena can't refuse. But, of course, things aren't that simple. Some dark evil is at work inside the King's castle; something that is killing off the competitors one by one. Plus, there's the handsome Prince and moody Captain to deal with too.I don't think Celaena is in the King's palace for a day before she starts obsessing over her looks, her new dresses and whether or not either or both of the aforementioned men find her attractive. She still manages to have more badassery than Alina in Shadow and Bone and the book is, in my opinion, nowhere near as boring as Grave Mercy. But, still, I couldn't help being like \"BUT you said ASSASSIN!\" when she's there swanning around in front of the mirror. I like that she's \"feminine\" (whatever you want to take that to mean) as well as a brutal killer, but there's only so much high school changing rooms behaviour I can take. I think there's an excellent quote, a question that Celaena wonders to herself, that basically sums up what was running through my head for a lot of this novel:\n\"How had she gone from the most feared prisoner in Endovier to this sappy mess?\"\nHow, indeed. But, that being said, I really enjoyed the banter between her and Chaol. And Dorian wasn't bad either. I've said it before but I'll say it again for the benefit of this review: I actually don't mind love triangles when they're convincing and both candidates for the MC's heart are on equal footing so there's some tension over who they're going to end up with. Though I may have to do all kinds of evil things - like... stomping around my bedroom angrily or letting library books become overdue - if Celaena doesn't end up with Chaol. Ms Maas, you've been warned.So, yes, I will be reading Crown of Midnight, god help me. I'm hoping it will please me more than the sequel to Shadow and Bone did, but the ending of this does make me think the second book could have more action and nastiness (yes!). I think you can enjoy this book if you go into it knowing exactly what you're letting yourself in for. It isn't high fantasy. It isn't mind-blowing. But it is kinda fun *grins*"}, {"Review": "I really enjoyed this book. The characters were well formed and excellently developed. There are recognisable and enjoyable twist on the classic Cinderella. Example Celaena Sardothien's fairy godmother is a ghost of an ancient warrior queen. There are also slight touches such as Celaena has an innate charm with animals.I was also very impressed with the pacing and evolution of the story. Honestly the 406 pages just seem to fly by. Just because Celaena was the greatest of assassins after being in a death camp for over a year she need to capture her old form, but her skills are still intact. Also I like the way the author plays with her feeling even though she is an assassin she is still very young and prone to her feeling and ego getting hurt.The book does leave a lot of questions many of which are for the second novel, but as much as I hate prequels I will have to read the back up stories on the kindle version. I cannot wait for the next book and am really looking forward to what is going to happen next. Like I said earlier this book was more about Celaena recapturing her old form and claiming a position of power, also setting up her side cast, I am expecting a lot more action in the next book after all the training in this book."}, {"Review": "This is going to be a rather personal review because Throne of Glass took away a week of my life and my SJM virginity.I wish I’d let it wine and dine me, first. At least, I’d still have the good memory of a nice six course dinner. It’s not like I have a problem with this book, but…I do have a problem with this book. A couple, actually, and they mainly involve the writing and a certain main character which I won't name for now. Now, before I start, I must say that I’ve been forewarned by a lot of readers that this is probably the weakest book in the series and that the writing is a bit quirky, because at the time, the author was young and (I suppose) unexperienced. I can see that. I actually could see a writing style development between the first and the second half of the book. This to say that, since from the beginning, I didn’t expect much.But since I’m here do discuss books and not to dig into the author’s background, I’ll admit I’m not a huge fan of the writing. Too many exclamation points!!!!!! too much self-indulgence in the characters descriptions and actions, and, definitely, too much walking around the edges. Sometimes I like it when a book shows its contents rather than shoving them explicitly into the writing as to say “hey, here’s how you’re suppose to interpret said emotion and fact”, and so on. I don't like that, nuh-uh. Plus, most of the time, it really looked and felt like a thirteen-year-old fangirl wrote a fanfiction based on scratches of books she's seen her big sister read.The plot is not bad. There’s magic and princes and the right amount of stabby-stabbing. Not bad, but not breath-taking, either. I'm not giving up, though, because I trust my fellow readers and I believe it when they say it's gonna get better.Well,\nNow, another thing that threw me almost completely off the Throne of Glass Train, was the main character, Celeana Sardothien. Oh, boy. I had such a hard time with this one. Not only I didn't connect with her and her way of thinking before the very last chapters, she's also made it into my Top 3 of most annoying characters thanks to her immaturity.I think only America Singer from The Selection and Zoey Redbird from Marked could top that, and this is saying a lot.She’s like that popular chick in high school who thinks she’s head and shoulders above the others. She’s like Regina George with daggers and an even snarkier holier-than-thou attitude.Basically Celeana in every single line ever:\nFor someone who's supposed to be a deadly assassin, she's pretty weak and dull. I get it that she's a girl who likes being pretty and wearing nice clothes and dating hot boys (I actually love it when a female character can be girly and badass at the same time), but she's just so narcissistic and stubborn, she never (or rarely) speaks without thinking first, that you can't help but put aside her best sides and focus on the tooth-cringing ones. Sometimes, she really lacks tact, not to mention good manners, and, for the most part, she walks around feeling like she invented the concept of being a badass. I’ve got news for you, Cece. You still have a lot of road ahead.So flipping frustrating. Sure, she had her good moments, I actually appreciated her spirit and braveness in many occasions, but they were rare and ephemeral enough that they couldn’t have overcome the flaws even if Batman himself joined the collab. I really hope she’ll redeem herself, or at least, grow some sense into that little superiority complex-affected brain of hers.To be completely honest, sometimes I even enjoyed this book, but I couldn't help but notice they were chapters or paragraphs in which Celeana was silent or absent or too busy fighting for her freedom to care about other stuff.Ahem, I'll leave the math to you, peeps. Bless the multi-pov option! I really didn’t mind at all those Dorian or Chaol chapters.And, yes, feel free to read this as: I really didn’t mind Dorian nor Chaol. Which brings us to the romance side. Guess what? There was a love triangle! *fakes shock* I know. So. Original. And. Unexpected.\nEven if Huey, Dewey, and Louie engaged in some sort of inevitable, twisted and confused love triangle, which I’ll never be a fan of, I still couldn’t care enough to let it bother me. Just give me some substance, I don’t care who sucks whose face. Now, at the question, do you ship Celeana with Dorian or Chaol, I'll reply: WHAT EVEN IS SHIPPING ANYMORE.Since, y'know, I think it'd too much to hope Dorian and Chaol will both dump Sardothien, grab a dozen puppies each, and ride their way into the sunset, together.The other characters didn’t really convince me that much (although no one got nearly on my nerves as Miss Main Character did), I felt like there could have been more work behind, just like the whole story didn’t exactly engage me from start to end for the very same reason.You can tell someone didn't really do their best at researching. The setting and the way all characters behave could have been a little more authentic, and, holy crow, the ooc-ism was too much, even for a mediocre book.Still, I think after a good 60%, both the writing and the plot really improve right before my eyes.I’m convinced, maybe, I would have loved this book better if I read it when it first came out. I have too high standards now. really, it's like a curse.I’ve never really followed SJM but I feel like I should give her another chance (brain screaming: I WANT MORE DORIAN AND CHAOL). I’ll try not to let it influence negatively my coming judgment and consider this book an isolated case, and also this series’ chance to prove how sometimes books can upgrade in reverse, and put some more hopes into Crown of Midnight.Until then, two and a half stars are more than enough. ACTUAL RATINGS 2.5/5"}, {"Review": "I hateread a chapter from book five of this series with a friend. And I'm going to register my opinion that while it may have slightly improved in character development or worldbuilding or etc etc etc - I wouldn't know - it is, objectively, just as horribly written as this book.And that's the tea.\n\n🌺 montage of me screaming \"why is this hyped\" for five hours\n\nLet me give this book one minuscule fragment of credit: the plot isn't horrible. Okay, yeah, the plot is kind of boring and there are a lot of opportunities for deception and badassery that are not taken. I take full offense at badassery being missed. But seriously, guys, this book suffers from fucking terrible character work. Thesis Statement: Celaena is a badly written character. She is arrogant as hell, really petty, and somewhat obsessed with her own appearance. And that's not even the problem - a horribly unlikable assassin as a lead character could be amazing. But Celaena does not have enough character depth for her unlikability to be tolerable. Her alleged tragic past? Pretty much not represented on page. Frankly, tragic pasts need a lot of fleshing out to be compelling and believable, and I don't even think Celaena's trauma is acknowledged once in this book - come on, at least do the bare minimum? Listen, okay, you want to get me started on my #1 pet peeve in YA for all eternity? Heroines that have less sense than the audience. I like my heroines to be one step ahead of me, or at my level. Let's talk about the fact that Celaena is just... a complete idiot. Some assassin. I am 98% sure I have more sense than this character / prop for love triangles does. Like, I'm sorry, but how am I supposed to be intimidated by someone who 98% of the audience could outthink?I am so disappointed by all this character could have been and all this character is not. completely lighthearted. Again, that could be super enjoyable to read about! I'd LOVE a book about a slightly unbalanced girl who murders people with a smile on her face. This could be Celaena if she were cleverer and a bit - okay, a lot - more fleshed out. But she's just an unbelievable, annoying heroine.And Jesus, I am so annoyed by the love triangle. Dorian is just flat as hell and has no character. Chaol is... okay, I know someone is going to fight me over this but I do not care. Chaol is an overprotective ass. I can't believe he's supposed to be the good romantic interest compared to Rowan. Jesus, how bad is Rowan? What is happening in this damn series?? And yeah, I forgot just how much I hated it until the hateread, but the writing style of this book is worse than amateur. It is so tedious, it is so typical, and it is so overdramatic. I take full issue with both overuse of exclamation points and lack of ability to truly get into a character's head. I have made my decision and I am not continuing.Blog | Goodreads | Twitter | Youtube"}, {"Review": "4/5 Stars ⭐️ ⭐️ ⭐️ ⭐️“Libraries were full of ideas—perhaps the most dangerous and powerful of all weapons.” Here I am again, back in a different world of Sarah J. Maas! This is a very popular series. An extremely popular series, an exceptionally hyped up series, a tremendously OLD AF SERIES. Listen to me here, if I were a fantasy fan when I was a teenager, I would have definitely read this book. But you know, my relationship with fantasy hasn't been lit for the last 2583 years, so I hadn't picked it up. I started loving fantasy again this year because of A Court of Thorns and Roses, a book I bought because I needed it for my uni thesis, not because I was interested in reading fantasy again. SO YOU CAN SEE HOW MUCH WORK I GOT WITH FANTASY BOOKS. I haven't read fantasy since 2010. I have a million fantasy series to catch up to. I'm nervous. I WANT TO READ ALL THE FANTASY NOW AND NOTHING BUT FANTASY. ANYWAY, LET'S TALK ABOUT THIS BOOK.After serving out a year of hard labor in the salt mines of Endovier for her crimes, 18-year-old assassin Celaena Sardothien is dragged before the Crown Prince. Prince Dorian offers her her freedom on one condition: she must act as his champion in a competition to find a new royal assassin.Her opponents are men-thieves and assassins and warriors from across the empire, each sponsored by a member of the king's council. If she beats her opponents in a series of eliminations, she'll serve the kingdom for four years and then be granted her freedom. Celaena finds her training sessions with the captain of the guard, Westfall, challenging and exhilarating. But she's bored stiff by court life. Things get a little more interesting when the prince starts to show interest in her ... but it's the gruff Captain Westfall who seems to understand her best.Then one of the other contestants turns up dead ... quickly followed by another. Can Celaena figure out who the killer is before she becomes a victim? As the young assassin investigates, her search leads her to discover a greater destiny than she could possibly have imagined.I had very high expectations for this book which were partially met. As I said before, my first Sarah J. Maas book is A Court of Thorns and Roses, which is the her latest series. Most of you have read Throne of Glass first and then A Court of Thorns and Roses, and you have experienced her writing flourish. I haven't. I read her better book first. I can see now that she has improved so much, her writing is so much better now. Some things in the writing of this book weren't my thing, like repetitions of some phrases, \"assassin\" being referred to Celaena the whole entire time (which bugged me a bit), poor choice of words at some parts. But I recognized Sarah in this book. I can recognize her writing style now, and I truly love it.This book gave me such Game of Thrones and Harry Potter and the Goblet of Fire vibes! From the badass main character with the hard to pronounce name which reminded me of Daenerys Targaryen to the championship which was like the Triwizard Tournament in Goblet of Fire, the vibes were fucking lit yo! The world Sarah J. Maas has created in this book was so immersive, I was so into it when I was reading the book. I wasn't even confused with all the names and places and words, it all came natural to me. I can see how after this book, the world will expand to an enormous extend with magic and Fae and so many new characters appearing, and I'm here for it! The multiple character perspectives was a surprise to me. Celaena owns the most chapters, but we can see things told from mostly all the characters, (even the fucking King) which is something I was surprised about as it does not happen in her other series. I loved it. This is what I missed from the A Court of Thorns and Roses series. The multiple character POVs. And I relish in the fact that we can explore things from numerous viewpoints.CELAENA GUYS. CELAENA SARDOTHIEN. I LOVE YOU TO THE MOON AND BACK. I WANT YOU TO BE HAPPY AND FIND THE BEST MATCH FOR YOU AND UNDERSTAND YOUR PAST AND YOUR LINEAGE AND BASICALLY CONTINUE TO BE A BADASS QUEEN. I didn't expect her character to be like this, to be honest. The book description suggested a ruthless, cold-hearted killer, and I expected as much. But her compassion and her kindness and her passion for multiple things showed from the very first pages. She is a merciless assassin who can end you with a snap of her finger but she has also kept her personality. Her humor, her quirkiness. She loves beautiful dresses, she loves to eat good food, puppies 🐶, and she loves books. SHE IS A READER GUYS. I absolutely ADORE when book characters are readers. Especially in fantasy. I can relate to them so much easier. I immensely appreciated her friendship with Nehemia and that it wasn't ruined at the end. I was so scared about this. I loathe when they make female characters hate each other in books, especially about a love interest! Just don't, please. Girls need to stick together! I want to see more of her in the future books. I'm sure we will, but it was left kind of wonky in this book. I suspected her too, in the middle of the book, and I was certain it was her, orchestrating everything. But it was Cain. The obvious choice. It was anticlimactic, to be totally honest. I wanted it to be someone else. We all expected Cain, and it was Cain. I didn't believe it would be him, I was certain there would be a plot twist, at the end, or something. But no.AND NOWWWWWW the romance. I love both Dorian and Chaol, both for different reasons. I'm so fond of the relationships Celaena holds with both of them. They're so different, and yet they both mean so much to her. I SHIPPED BOTH THOSE SHIPS THROUGHOUT THIS BOOK. But I lean like 51% on Dorian. Their scenes were cuter, and I think they have more things in common. Their passion for books, the billiard scenes, the music scene, THE FUCKING PUPPY, the dance, the kisses, the candy. They made me feels so many things! And then we have scenes with Chaol and I was back in that train again. COME ON CELAENA, DARLING, JUST CHOOSE. I will choose for you, but for myself. I have no problem with that, sweetie 😉 I was conflicted about her train of thought, to be frank. The one moment she found Dorian extremely attractive and she wanted to kiss him, and the next she found Chaol handsome and she wanted to spend more and more time with him. I was as much confused as she is. But I'm delighted that the author didn't make the romance the main part of the book. She didn't portray Celaena as a character who depends on a man to save her, or to make her feels special or anything alike. She would have been fine without them as love interests in her life. Furthermore, I have to talk about Nox. What a sweetheart. What a wasted opportunity on a character. We basically saw nothing of him. I thought he was gonna be a third love interest in the beginning and I was like \"WOAH WOAH THERE SARAH HON SLOW DOWN\" but luckily he wasn't. But I kept thinking about his character. YOU'RE THE TRUE AND UNDOUBTFUL EPITOME OF THE WORD \"FRIENDZONE\". I hope we see him again. The final battle... oh man. It dragged more than it should, to be honest, but it was breathtaking. Sarah knows how to write a good jaw-dropping ending. There was so much information throughout this whole battle, that I had to reread some parts to totally grasp what was going on. It was so intense and magical and out of this world. I was so proud of my GIRL for still being strong and trying to fight even though she was drugged. She made me believe, at some parts, that she would win. Kaltain. UGH. May we never see this bitch again. I WAS SO HAPPY WHEN WE FOUND OUT THE DUKE WAS SCHEMING BEHIND HER BACK ALL ALONG. I know we will see her again, but fuck her. I don't want to see her lying ass point of view again.To sum it all up, this was a pretty strong beginning to a series. I only gave it 4 stars because it didn't overwhelm me. I keep comparing it to A Court of Thorns and Roses, which is like my favorite series, at the moment. I can't stop comparing these two series, damn it. But I loved it nonetheless and I'm waiting for the next book, Crown of Midnight, to arrive. I'm actually pretty excited, cause I have heard these books get so much better. and I can already see that. So till the next one... K BYE!!"}, {"Review": "I'm afraid this just wasn't for me. I heard it being sold as GRR Martin's Game of Thrones written for the female audience --- well, as a female audience, I am offended. As an avid reader of the fantasy genre, I am saddened that this is marketed as a fantasy-for-females. This being a YA does not excuse it from being riddled with clichés, painfully obvious foreshadowing, and a ghost of a fantasy world ruthlessly overshadowed by romantic overtones.Fans of fantasy - actual fantasy - I don't suppose would much enjoy Throne of Glass, either. And even though the synopsis makes it sound Hunger Games-esque, I'm afraid on that front, you'd be disappointed, too.I would say, if you enjoyed The Selection by Kiera Cass, but long for a less self-abasing character than America, then I think you might enjoy Throne of Glass.I must warn you: this review will be long, and most of it dedicated to a bit of a character study if anything; and why Sarah J Maas failed at her character of an assassin. But let's start at the beginning.Celaena Sardothien has spent years in the death camps of Endovier, where she will ultimately spend the rest of her life. Until, that is, crown prince Dorian appoints her to enter in a competition for the title of King's Champion, who will be tasked to do the King's secret bidding. But when one by one, the competitors turn up dead, Celaena knows that something evil lurks the castle.Instead of the action-packed novel I was lead to believe I'd be reading, all I got were ... balls and dances, and then some fight scenes are thrown in there just to make sure we don't forget that this is supposed to be a story of an assassin. No, Sarah J Maas, I hope you don't forget what we came here for.When I say that \nThrone of Glass lowers the standards of Fantasy\n, I mean that it doesn't seem to know much about its own setting.Royal Households everywhere, at every turn of the century, have a set of rules dictating things such as etiquette; what is proper and what is improper. And these rules don't exist for the sake of it - there are reasons behind etiquette: to prevent affronting your peers, for instance. To prevent harmful court gossip. To prevent a crown prince from running around and fathering a thousand bastards before he is even dubbed King, creating more than enough future claimants to the throne.I assume the same applies in Throne of Glass; for instance there are etiquettes mentioned that deem a prince dancing with only one partner something considerably rude.So it threw me way out of time and place when I found out that Chaol, Captain of the Guards, would enter Celaena's chambers at any time of day he wishes - even when she's still dressed in her scanty nightgown.Even the Prince does this; visiting her whensoever he pleases. You may call me a prude, you may call me many anti-feminist names, but this is not acceptable. Not because I give two cents on what the court would say about Celaena; not that I give two cents whether or not the prince was copulating with her; but \nbecause this is simply not done\n. Especially not without repercussion, if even in the form of social stigma.Celaena had a maid waiting on her - but it seems that all she was good for was putting her clothes on. It was Chaol who barged in her room, underdressed as she was, just to wake her up. He is a Captain of the Guards. This should not even be his task!These small, ridiculous ignorance of Royal Household etiquette and division of labour made it seem as if the whole thing was poorly researched. You may argue that this was not feudal England; that this world was built entirely of Maas' imagination, but things such as logic should still apply. And when has it ever been logical for a Captain of Guards to be responsible for waking up guests? When has it ever been acceptable for a Prince to come and go, without repercussion, into a common girl's chambers?But that is exactly the problem with Throne of Glass. \nThe entire premise wasn't logical.\n By this I am of course talking about the King's competition.\"(...) He's hosting a competition. He invited twenty-three members of his council to each sponsor a would-be Champion to train in the glass castle and ultimately compete in a duel.\"... and this Champion of his is tasked ...To work for the King of Adarlan as his loyal servant. She raised her chin. To kill for him (...)\nBut where is the logic fail?\n you ask me. Allow me to reiterate. He wants a \nloyal\n subject to kill for him, without question, with the utmost secrecy. Yet he chooses this loyal subject through a \ncompetition\n. Not only that, he makes his \ncouncilmen\n choose the competitors for him.I may not be a direct member of a royal family myself, but I know there are things such as court intrigue and hidden agendas and hell, there are hundreds upon thousands of discrete allegiances and plots being made left, right and centre.Do you really want your future, \"loyal\" Champion to be handpicked out of a number of criminals and entrusted to your councilmen?The whole competition thing wasn't at all very thought through. In the end, it felt as if it was just there to get the story going, to get Celaena into the castle.The competition itself was a let down; meaning instead of some fight-to-the-death (or similar) trope, we get ... a race. An archery competition. Wall-climbing. And a lot of others that happened off screen.Amidst all these competitions and training programs, the plot scattered into flirting banter, gatecrashing parties, and some girl-on-girl hating; as if \nthe author wasn't quite sure whether she wanted her novel to be the story of a ruthless assassin, or the romances of a ruthless assassin princess-wannabe\n.And now I get to that point -- Celaena, the princess-wannabe. Allow me to present a number of quotes I've highlighted:She loved clothes--loved the feeling of silk, of velvet, of satin, of suede and chiffon--and was fascinated by the grace of seams, the intricate perfection of an embossed surface. And when she won this ridiculous competition, when she was free ... she could buy all the clothes she wanted.*Everything was wet and half-frozen, and while she could bear sodden hair, she couldn't withstand the agony of wet shoes.*There were more Champions seated at the tables--even the pimply-faced Pelor sat near Chaol! A half-rate boy assassin! She bared her teeth. How dare she be denied an invitation to the feast?You read all that and tell me, do you imagine these thoughts coming from a renown, world-class assassin?An assasin complaining about her wet shoes?About not being invited to a banquet?No. Two things strike me here: First, she had just spent years at a death camp, but her behaviour upon leaving it did not portray any humility or gratefulness of being far away from all those whippings and forced labour. You'd think she'd just be glad to be away from the mines and pickaxe to be complaining about wet shoes SMH.Second; this sounds more like something a ditzy princess-wannabe would say. Oh, after I win this competition, I'm gonna buy myself some clothes. For someone who has spent years suffering, who spent her childhood being trained as a ruthless killer, she comes across sounding so privileged.Now, I'm not an assassin. I've never been trained as one, but for years I did go through a whole series of martial arts before finding one that suited my small stature. And of all martial arts -- from karate to jiu-jitsu to wushu to the one I finally settled with -- there was one thing we were taught was the foundation of any great martial artist. Discipline.And I'm sorry, Celaena. But you don't have it.This is her reaction to failing at a game of pool:A shriek of rage ripped from her throat, and Celaena ran over to the pocket. She first screamed at the ball, then took the cue in her hands and bit down upon the shaft, still screaming through her clamped teeth. Finally the assassin stopped and slapped the three ball into the pocket.This is her discipline at training:\"It's cold,\" she moaned, holding her knees to her body. She didn't care that she had only a few months to beat the other Champions--she needed sleep.\"I'm afraid it doesn't work that way; you don't get to tell me that this girl is an accomplished, feared assassin at the age of.... sixteen?.... but \nher entire mentality, her entire personality does not ring true of an assassin\n.Do you think the realm's greatest killer would be afraid of walking in a glass house?\"Only an idiot would walk in a house made of glass.\"(...)The thought of standing on floors of glass made her queasy.....afraid of heights?She had a terrible headache around her left temple. Everything was sickly and frail. They were so high up, so dangerously high ...Do you think they moan and whinge and complain at the drop of a hat?Once they'd finished their run, they trained in a private room far from her competitor's eyes. Until, that is, she collapsed to the ground and cried that she was about to die of hunger and fatigue.*Celaena frowned at herself as she hurried after the captain into the foyer. \"I look ridiculous! These pants are absurd, and this shirt is awful.\" For heaven's sake, you're an assassin, not a supermodel. No. Discipline doesn't just mean getting up every morning and training every day. It also means a discipline of the mind. It means self-restraint. It means keeping your head low. What kind of assassin wants to be the centre of attention?? To have her skills known?? If you want glory, then you're in the wrong career path. Be a damned knight.But Celaena is vain and self-absorbed. She wants to be in the spotlight.\"I hate all these guards and nonsense; I hate you telling me to hold back when Brullo sings Cain's praises and I'm just there, boring and unnoticed in the middle.\"*\"Do you know how insulting it is to pretend to be some nobody thief from a small city in Fenharrow?\"Not only that, but she's also very contradictory and hypocritical:What was a \"Champion\" but a dressed-up name for murderer? Could she actually stomach working for him?And I suppose \"assassin\" is just a synonym for mercy-killer? But enough of her faults. Let's take a look at her more positive attributes. She's beautiful. In fact so beautiful that she drains the blood out of people who sees her:Celaena smiled smugly to herself as she nodded to a passing noble-man, who raised his eyebrows at the sight of her. He was immensely pale, she noticed as he opened his mouth to say something, but Celaena continued down the hall. In fact so beautiful that other ladies envy her and she has to shove that in their faces (view spoiler)[because you can't have a YA novel without other girls being envious of our heroine! (hide spoiler)]:She smiled at the young chevaliers as they passed--and smirked at the court women who eyed her pink-and-white gown. She couldn't blame them; the dress was spectacular. And she was spectacular in it. Even Redd, one of the handsomer guards posted outside her rooms, had said so.Also shallow, as it seems, because if Redd hadn't been handsome, his opinion wouldn't have mattered, right? Still not convinced that she's shallow?Why did Chaol never joke with her as Dorian did? Perhaps he truly didn't find her attractive. The possibility of it stung more than she would have liked.You see, because people can only like you if you're attractive. Oh, sorry, I got sidetracked. We were talking over her positive attributes. Well, she's a great dancer:She didn't falter a single step, nor did she seem to care about the many angry female faces that watched as dance after dance passed and they didn't switch partners.She also plays a mean piano (view spoiler)[because music is like, the way we show just how deep and artistic our heroine is (hide spoiler)]:Celaena eyed the pianoforte. She used to play--oh, she'd loved to play, loved music(...)She loves dogs (view spoiler)[because that's how we know she's a kind-hearted person. No evil person is an animal lover! (hide spoiler)]:\"Of course I want her,\" Celaena said, then realized what the implications would be. \"But I want her trained. I don't want her urinating on everything and chewing on furniture and shows and books. And I want her to sit when I tell her to and lay down and roll over (...)Oh, but she doesn't want to be inconvenienced so she doesn't want to train it herself of course! She speaks foreign languages, and! just so we can all relate to her -- she also loves books!I could go on and point out her inconsistencies, but this is getting much too long for my liking. In short, Celaena Sardothien is a Mary Sue. But even worse -- \nshe is an unlikeable, vain, shallow, self-centred Mary Sue\n. And if you expect me to believe she's a deadly killer, then you better think again.But that is the final problem I had with this book -- the narrator constantly tells us what to believe.There was something great and deadly concealed within her, and he didn't like it. while moments later, she's rolling on the ground, crying and whinging that she's gonna die of starvation. Yeah, no.Also, \"Because it looks like he's in love with her,\" he said, and walked away.(...) His shoulders were straight, his back erect. He looked like a man. Like a king.Yeah, if you say so.\nBut, Amanda,\n you say to me, \nthere must be \nsomething you liked?Well, I did like Celaena's relationship with the err, Indian princess. I forgot her name. Because I didn't like the actual princess herself -- she doesn't know tact. She doesn't know diplomacy. She comes to a foreign realm and all she does is whinge and insult their language and clothes and court.So, no. I didn't like the plot, I didn't like the characters. The only stars go to Chaol for being a beacon of sanity amidst all the awfulness. It's a pity he, too, fell for our Mary Sue.\n"}, {"Review": "if this garbage can get somehow miraculously get published then i have hope the smut i wrote three years ago can too. this book is fucking horrible. i wanted some badassery but instead i got a shitty love traingle and annoying characters who i wished just......... died. i was so incredibly bored for the first 130 pages of this book and them i skimmed so much that i made it to page 295 in two minutes. then i forced myself to suffer and actually read and i found it somewhat alrightbut this book was still fucking bad? i really don't get why people like this, but whatever, my guy. each to their own. Also, don't come @ me saying I didnt read the right book or \"your opinion is wrong bitch!!!!!\" do yourself a favor and leave and don't annoy me with comments like that. everyone has a right to express their opinions however they want. thanks and goodnight. -----i want my sjm virginity taken in the most painful way possible. i haven't saved myself for this long just to be disappointed. seriously, I'm so excited to read the badly written smut and growls and purrs and talons. (or is that in her other series? lmao)"}, {"Review": "Reread x 4!I can’t believe this series is coming to an end. 😢 It’s brought me so much comfort and happiness. Obsession isn’t enough of a word to describe what I feel towards Sarah J Maas and these books. Fandoms have never been my thing. Well, since Harry Potter. Then I came across her books because of the hype and I am grateful to have found people as loony over it as I am. ——————————————————This series seems to be getting better with every reread! And this book in particular as it was my least favourite. But it helped reading The Assassin's Blade before Throne of Glass as it delved deeper into Celaena's character and one is able to form a connection with her. Her skills as an assassin aren't really explored in Throne of Glass, it's all talk and no action. But reading the prequel novellas, you are able to see how hardcore and badass she actually is, thus accepting the all talk and no action that happens in Throne of Glass. I love the characters, the world and Maas's writing. I always feel so wrapped in it! So many hints were dropped in this book that are explored in the other books. I loved being able to pick up on them this time round and appreciate that Maas cleverly plants those points in her books and later builds up upon them so thoroughly."}, {"Review": "Actual rating 3.5 starsThorne of Glass has a lot going for it. It's packed full of action, mystery, likable characters and fun dialogue. On the flip side, it also has a few tropes that I usually make me want to rip my hair out strand by strand: the love triangle, semi-insta love and predictable plot twists. That by no means makes this a bad book, because despite those annoyances, I was fully engrossed in Throne of Glass.The Plot and Writing:While the synopsis may come off feeling a little Hunger Game-esque, let me calm your fears now. It's not. Celaena is a young assassin who begins the book being dragged from her prison in Endovier, a salt mine prison for criminals. She's given a choice to become the king's champion (or lackey) for four years in exchange for her freedom at the end of her service. The catch is she must compete for the \"honor\" against other criminals. Sounds easy, right? Of course. Then people start dying, ahem, mysteriously!With that small description the plot sounds like a winner, but I found it to be very predictable. I knew who the villain was and the foreshadowing was not subtle at all. At one point, Maas does try to steer the reader in another direction, but I knew it was just that, a distraction. But regardless, I couldn't deny that it was an exciting read. It's kinda like this: I knew how things probably would end, but I still ended up having fun along the way.Even with it being a little over 400 pages long, it certainly doesn't read like that. The narration is set at a good pace and flows very nicely. The only thing I have to say about the writing style was that at times it felt a wee bit cheesy. There were a few lines like \"Oh and she simply adored...\" or \"Oh how she loved candy!\" that made me cock an eyebrow, but thankfully they were few and far between. Characters:There's nothing I love more than a strong female character who speaks her mind and gives an entire male cast of characters a run for their hard-earned, cash money. Throne of Glass is being marketed as the teen girl version of Game of Thrones. Now, I've never read the books or seen the TV show, but I've heard enough about the depiction and treatment of woman in that series to say it's probably not for me. However, this is where Throne of Glass excels. Not only does it present a strong female MC, but a another secondary character, Nehemia, who also happens to be a person of color. Oh, yes, you read that right. No, ridiculous, over stereotyped, token character here! Because you know, if there is one thing that irritates me the most, it's misrepresentation in YA novels. But that didn't happen here. Nehemia is strong, incredibly smart and underestimated (of course) by everyone at court because of her nationality. Their mistake! I pity the fool who finds their self on the other end of her staff. It won't be pretty. Beautiful chaos. I'm hoping we get to see a lot more of her in the series. ;DAs for Celaena, well, she and I had this love/hate relationship going on. I find it really interesting and smart for Maas to create a character who is almost the opposite from what her society expects of her. They expect a proper lady, who never swears, has proper manners, reads poetry, quiet, ect. But Celaena is none of those things.  Early on it's established that she dislikes the social expectations and makes it a point to use profanity and to embarrass the man folk with her readings of \"Sunset's Passions\". Seriously, she was owning these guys left and right.\"By the Wyrd! Do you actually read this rubbish? What happened to Symbols and Power and Eyllwe Customs and Culture?\"She finished her drink, the ginger tea easing her stomach.\"You may borrow it when I'm done. If you read it, your literary experience will be complete. And,\" she added with a coy smile, \"it will give you some creative ideas of things to do with your lady friends.\"I mean, can we all say, \"In YO face.\"\"Here's a lesson for you, Weapons Master,\" she said, stalking past him. \"Give me real men to fight. Then maybe I'll bother trying.\"\nAnd her witty lines only get better and better from there. But of course, with all the pwning going on, she had her faults with being arrogant. Very, very arrogant. And that is where the hate comes into play. She was just too good and from the very beginning I knew Celaena would triumph because she is depicted as slightly Mary-Sueish. She's a well known assassin that can seemingly not be defeated and all man-folk fawn over her left and right. And that bothered me because it felt like there was so much more to her. The Triangle of Love:I was warned that this book contained a love triangle and this alone is enough to make me cringe. There are very few love triangles that I love and unfortunately this isn't one of them.  When Celaena arrives at Rifthold she is drawn to both the Captain of the Guard, Chaol Westfall, and the Crowned Prince, Dorian Havillard. Oddly, it's not because the characters aren't likable enough together and it's not even the fact of one of the love interests treating her wrongly. The problem I had was Dorian and Celaena's attraction. Most of the time it felt forced, awkward and contrived. I couldn't understand where they had the time to get to know each other long enough for her to stop hating him BEFORE she started liking him. There was even a scene where Dorian promises Celaena that he won't kill one of his new pups that he deemed untrainable. And she goes, \"You'd do that for me?\" I swear I could FEEL her eyelashes batting at him at that very moment. I think that was supposed to make me like Dorian, but all I could do was roll my eyes. Contrastingly, Chaol's seemed like a much more developed and realistic relationship, if you even want to call it that. But their feelings felt more organic. Side note: I don't know if this is even considered a love triangle yet. It reminds me of the whole Jacob vs. Edward. We all knew Bella would pick Edward in the end. Was Jake ever a real contender? I think not. But from what I hear from readers of the original story on Fiction Press, Celaena had quite a few suiters. It'll be interesting to see how Throne of Glass deviates from its roots. So, I suppose we will just have to wait for future installments to find out.All in all, though it was not what I was expecting, I still enjoyed Throne of Glass. I really believe it will appeal to many young girls and I'm happy to see great examples of strong female characters in a YA novel. It feels like the sequel can only get better from here based on that ending (no cliffhanger, thank goodness!) and I, like many others, eagerly await book two.ARC was provided by the publisher via NetGalley. Thank you! More reviews and other fantastical things at Cuddlebuggery Book Blog."}, {"Review": "DNF @ 50%This book was such a huge disappointment.A young, notorious female assassin is thrust into a competition where she must fight for her freedom in exchange for service as the King's body guard? That sounds awesome, right? Too bad this book didn't deliver on that premise. There's no way some badass assassin would have a giggly, carefree demeanor upon meeting Prince Dorian and Captain Chaol, these are both people she should loathe? This is not a girl who should notice how the sun shines in a boy's eyes or how cute he looks in his guard attire. The author keeps harping on the idea that Celaena Sardothien is a top notch, tough as nails killer with little fear or inhibition, but hardly anything Celaena does actually reflects that. She seems downright lighthearted to me. That's not to say an assassin can't be lighthearted to some degree, but I don't imagine a person who just spent a year in a slave camp where the typical survival rate is 2-3 months would possess this type of flippant, joking attitude.I honestly did not care about any of the characters while I read this. I did not care who won the competition, and I did not care who won Celaena's heart. The author told me exactly how I should feel at every turn, but did little to SHOW me why I should feel that way. I gave it a shot, but I'm not going to waste another 6 hours torturing myself with this audiobook."}, {"Review": "  0/5 stars 5,000/5 stars    “Still, the image haunted his dreams throughout the night: a lovely girl gazing at the stars, and the stars who gazed back.”    warning: anything marked spoiler is a spoiler for the entire series. so maybe beware or something if you are that one person who hasn't read up to  Empire of Storms  okay? there may also be some unmarked spoilers bc this review is 3,000 words long and i'm too lazy to read through it a thousandth time. So even though I am certified trash™ for the ToG series, and will actually die for any SJM book  even if they have the most fulgiest cover I have ever seen *cough* tower of dawn *cough* , this rude elf decided that I remembered absolutely nothing about the series and roped me into a reread. Which was probably for the best, considering it's been two years since I first read Throne of Glass and all I remembered going into this book was• Celaena gets her period• There's a dog• Talking doorknob aka bae• (view spoiler)[ Celaena dies and is overtaken by some snowflake named Aelin  (hide spoiler)]• Rowan is the worst thing to ever happen to me And after rereading, i realize now that only two of those things even happen in this book. I know, I know. I am  such  a fake fan. but considering this book is so unnecessary to the rest of the series, who hasn't forgotten a detail here and there????And I was promised a talking doorknob and the fact he isn't in this book is so insulting. THe only reason I agreed to this reread was for him and i'm mort-ified rn. Sarah J Maas will be hearing from my lawyers any day now. I'm also suing because not once is there a throne mentioned that is made out of glass. the title is misleading and i'm triggered. What is next? Are you going to tell me there are no crowns made out of midnights???things that did happen in this book that I totally forgotten about:• Dorian having a brother? like wtf since when?• Kaltain??? i swear she wasn't in the book the first time i read it• the castle is actually made of glass.what kind of architectural advances are in this regressed society? also that can't be safe? one dropped item and the entire castle is broken. how do you even get enough glass to make a castle? Like i understand maybe an accent wall of entirely windows but an entire building? that would be like a giant pain in the glass??? Also is there any privacy? what happens when feyre and rhysand visit and need some alone time? everyones gonna see them get naked.• there's no manon and i'm still crying over that• cain and how obvious it was that he's the villain. honestly the entire book you are like \"cain is acting really suspicious, it is way to obvious that he's the bad guy\" and guess what? he is. • mort the doorknob doesn't show up until book 2 and i'm still upset• there was a time when celanea was (view spoiler)[ a normal human being who wasnt' magical at al  (hide spoiler)]• i would literally predict this series to go in any direction except the direction it went. but those things actually happened and I'm still in shock? It's only been two years since I first read this book and I can't believe how forgetful af I am. What did I forget in the later books? Am I imagine things? I am really such a fake SJM fan. Is there even a talking doorknob at all or did I just make him up????URgh this book is so cliche and tropey and so predictable why am I such trash for it? Since this review doesn't already have enough lists, here's another to get you through the day.This book contains the following:• (view spoiler)[ long lost princess  (hide spoiler)] Celaena who is both beautiful not like other girls• the amazingly young and single and hot bachelor prince Dorian who is not like his tyrant father• the young and successful and hot best friend guard prodigy Chaol with family issues• the mean tyrant king who is so unimportant to the plot SJM forgot to give him a name but he's mean and hates life • a love triangle bc all YA fantasies published in 2012 need a love triangle• also bc it is 2012 and we are trying to leech off the success of the Hunger Games probably there is a lot of weapons and archery and \"will she survive\" stuff going on• the beautiful princess, Nehemia,  who's somehow still a princess even though her country was overtaken like five years before  that seems to have ulterior motives but we also need her bc friendship• The main character is a strong independent women who don't need no man so obviously she needs a man• Forbidden magic bc that's such a game changer. never before seen in a book ever. • ALso smart, beautiful rich girl is also a really big bitchIf this book was written by anyone but SJM I would probably just shrug it off and be like \"nope\" and forget it even exists but of course it's SJM and her writing and stories and characters are addicting af. I want rattle the stars tattooed on my forehead and i cry everytime i hear the words \"will not be afraid\" and will probably ship Celaena and Sam until the day I die. #SamDeservedBetter this book is the absolute worse don't read it I love this book. How could anyone ever give it less than five stars??????  I mean i did consider giving it 0 stars bc I was misled to believe mort was included in book #1, but then I remembered rowturd doesn't exist yet in this series and obviously, that is the greatest thing ever and I'd give it a billion stars if I could Let’s discuss some things I just don’t understand for a minute, okay? I tried my hardest to either ignore these things or pretend they make sense but I can't let it go. They all make absolutely no sense. 1. Dorian, the Crown Prince of Adarlan, travels in person to Endovier go recruit Celaena to be his champion. He abandons all his princely responsibilities to make the long trek to a concentration camp to personally invite a notoriously dangerous criminal that could very well have died months prior to compete in a tournament thrown by his asshole of a father. Obviously, this is a ~great~ idea.2. Also, who’s brilliant idea was it to recruit a notoriously dangerous criminal to compete? It only took your country years to capture her, so why not? All that time and money and effort that was spent trying to arrest her will be wasted, but it’s not a big deal right? (view spoiler)[ Honestly, thank god Dorian ends up being run out of Adarlan in book five because he’d be a horrible king  (hide spoiler)]3. The king may be a horrible man throughout this entire series, but at least he has some heart in between prequel and series to not murder the infamous assassin that has been wreaking havoc on his streets like any intelligent ruler would and instead send her to a concentration camp where she won’t die instantly or else we’d not have any series to be trash over4. Chaol is like 19? 20? in this book, but somehow he is able to snatch the highly elite job of Captain of the Guard. I’m sure he’s great and all, but what about Joe or Frank over in the corner who’s been working at the palace for twenty plus years, has a family of five to feed, and learns that they lost their promotion to some inexperienced teenager????5. The entire love triangle thing (view spoiler)[ why even waste the words when rowturd shows up in book three and ruins everything  (hide spoiler)]6. Also Celaena agreeing to serve as the king’s champion? (view spoiler)[ This man killed your entire family and overtook your country. Just kill him in his sleep and get the hell out of that castle you idiot. don't just stand there and take his orders HE MURDERED YOUR ENTIRE FAMILY GET YOUR REVENGE  (hide spoiler)]7. The book kept on mentioning that Sam is dead????? Sam isn't dead. He's alive. The events in  The Assassin's Blade  never happened. He was never killed. He's happy and alive. But anyways, let's ignore all those for a second because I haven't even started talking about the plot of this book. Which is soo innocent compared to the rest of the series. (view spoiler)[ Like what do you mean this fire breathing bitch queen was once a small naive girl who liked puppies, cake, and books??? What do you mean her only issues involved beating a bunch of boys she was already way more talented then??? Where's the evil fae queen tryign to kill her? where is some old ass white boy  who needs a haircut  proclaiming he's her mate????? where's the awkward sex on the beach????  (hide spoiler)]If you somehow don't know, which I strongly doubt, this book starts out with the infamous Celaena Sardothien imprisoned in a concentration camp bc of some shit that went down in books prior. Then she's rescued by Crown Prince Dorian and Captain of the Guard Chaol in order for her to compete in this competition to become the king's personal assassin. Both boys eventually fall in love with her. Someone's killing off other competitors. If you haven't read this yet, ignore all the obvious tropes and go read it bc don't judge a series by its first book. Let's talk about characters now shall we?  \"My name is Celaena Sardothien. But it makes no difference if my name's Celaena or Lillian or Bitch, because I'd still beat you, no matter what you call me.”   Celaena Sardothien.  Celaena might just be one of my favorite fictional characters ever. (view spoiler)[ Like, Aelin Ashryver Galythinus who? I only care about Celaena.  (hide spoiler)] Honestly, I make fun of how much of a special snowflake she is but name another YA character that is strong/independent/sarcastic but doesn't shun away all things girly. Even though I'm the weakest thing to ever walk this earth, I relate to her so much? I like books and dresses and dogs and sleeping. Celaena Sardothien is the most relatable special snowflake and I love her. I would probably pay Celaena to assassinate me let's be real here. We should just call her Ce-slay-na, amiright???And even though she's gone through a lot of shit in her life from (view spoiler)[ having her entire family murdered by the dude she's competing for  (hide spoiler)] to being trained as a ruthless assassin where sometimes she'd have to do things like break her own hand to watching the ONE TRUE LOVE OF HER LIFE SAM DIE  Rowan who???? Celaena loves Sam and no one else  to spending a year as a slave in a salt mine she doesn't let that affect her  which is probably really unrealistic now that I think about  but she acknowledges that it happened and it helped shaped her into the person she is today(view spoiler)[ When I first read this book, I was pretty quick to guess that Celaena was the long lost Queen of Terrasen bc it mentioned A) she's 18 B) her parents died when she was 8 and C) The royal family of Terrasen were killed ten years prior. Also it's a YA book. But during this reread, I was actually shocked about how obvious SJM makes it without explicitly stating it. For example, there is a quote on 37 pages into the book that left me so shook.   Magic was dead, the Fae were banished or executed, and she would never again have anything to do with the rise and fall of kingdoms. \n She'd never    AGAIN    have anything to do kingdom politics? Honestly how more obvious could SJM be? I am so mad at my past self for wasting all that time doing Sherlock shit trying to figure it out. The answer was written in plain text.  (hide spoiler)] Dorian Havilliard.  I kinda feel sorry for Dorian bc he has the lamest name in the history of young adult fantasy novels. But I don't blame him. It isn't his fault. It kind of reflects his character. I mean I love Dorian, don't get me wrong. I love any guy who loves books and puppies. But what is the point of his character? He kinda gets with Celaena for ten pages and then she dumps him for Chaol. (view spoiler)[ I know he gets magic in book 2 but that still doesn't add much to the plot tbh  (hide spoiler)] And let's be real here, there's enough evidence that proves he's gonna be a crappy king. Like who abandons his country to go off and free a dangerous criminal from her already way-to-considerate sentence?  I think he was just introduced to be a love interest for Manon, he was just accidentally introduced way to early. At least they are cute together, him and Manon. Or, as I like to call them, Donkey and Dragon. Actually, scratch that. Dorian is in love with Chaol and you can't convince me otherwise.   \"You look radiant, he said. \"And you look radiant as well, Chaol.\" He winked at his friend. \n  Chaol Westfall.  I just learned like two weeks ago his name isn't pronounced Kale but it's Kay-all and I haven't recovered. What do you mean he isn't a leafy vegetable???? All of you Chaol haters can eff off. I don't care what you think Chaol is the best and I love him and he's going to do many great things in life, despite the fact his book has an fugly a$$ cover. He can, and will, overcome that. Chaol haters are just jealous that he is unrealistically young and successful and beautiful and is possibly in love with his best friend. But anyways I love Chaol and he forever has my heart. Sam Cortland. I know he's technically not in this book but I just wanted to remind you all he  isn't dead. He's alive, walking the streets of Adarlan doing his everyday Sam thing. Him and Celaena are planning to get married next fall. They are going to be together forever and ever and ever Nehemia Ytger.  (view spoiler)[ Honestly I can't look at her the same after that one scene from Empire of Storms. Like stop your lying girl. You know Celaena is Aelin. You know you are gonna die in a few months. You probably even know Rowturd is gonna show up in book three and ruin everything.  (hide spoiler)]When we first met Nehemia, she’s this beautiful princess who can barely speak the language and slowly as the book progresses, we learn that she’s more than just her trope, but she is also acting as a super secret undercover agent who wants to take down the king. She’s so smart and brilliant and urgh i love her. It's hard not to love Nehemia though? She pretty much infiltrated the glass castle and is pretending to be this silly princess who doesn't know what anyone is talking about but she's really there to cause chaos. I love her. Nehemia is the best. (view spoiler)[ She didn't deserve to die in book two and I will never, ever be over it  (hide spoiler)] Nox.  It's been 5 years and like 6 books and Nox is still missing in action???? Sam.  He's still not dead okay??? Manon.  I know she's not in this book but I just hope she's doing okay.  The King.  The fact that the king doesn't actually have a name bugs the living crap out of me. It's so annoying? Is he just that forgettable? Or is he just not well developed at all? Why doesn't your character have a name????? Anyways, I hate him and it (view spoiler)[ it takes way too long into the book series for him to finally die  (hide spoiler)]How does someone so frustrating and stupid help create someone like Dorian  ignoring the fact that Dorian is probably not even his son i'm guessing, i mean there's hints thorughout the entire series Duke Perrington.  (view spoiler)[ Still waiting for him to die....  (hide spoiler)]This book expands so much that there are so many other characters I want to talk about bu tthey aren't even in this book sooo..... in conclusion...  Anyways, i hate this book so much and if you read it you are just committing yourself to like eight books of pure torture especially when you hit book three a certain douchey white boy comes into play and then by book five there's awkward sex on the beach and urgh don't read this book it sucks you'll hate it. literally no one ever had read it anyways. Wait is there eight books? There's so many I have to admit that when I try to name them all I'm just like: Considering how good my memory seems to be on this series, I'll probably forget everything that happened in this book before the Chaol novel comes out, but who cares? It's not like this book has anything to do with the rest of the series???  actually i refuse to admit that ToG and EoS are even in the same series. (view spoiler)[ I have read this series and discused it with so many people and yet I still don't understand how we go from infamous assassin who likes puppies to fae warrior fire queen trying to take down a country and marries a bird (hide spoiler)]Anyways, I'm just gonna go on living life as if Sam is still alive. I just really  hate  love this book so much okay?"}, {"Review": "Throne of Glass came to me highly recommended by someone who thinks Twilight is among the best books of all time, so I was instantly wary, but I promised to keep an open mind since, well, high fantasy and a kick ass assassin, what could go wrong? Well, a lot, apparently. I’m not saying this book is by any means on Twilight’s level of awfulness, but it is one of the shallowest, least impressive fantasies I’ve ever read.I've never read the original, but I think I have a good idea where Sarah J. Maas went wrong writing her final version. She started out with her badass chick assassin, Celaena Sardothien, figured she needed a love triangle to keep the romance interesting, then settled on a plot, and finally filled in the setting. Unfortunately, setting really should've come first. In every other fantasy I've read, there's always some interesting hook that almost immediately tells me why the author created that particular fantasy world for his or her characters. For me, it's probably even more crucial than the characters themselves. And for the first half of this book, Erilea is just generic - tyrant of fancifully named country tries to conquer other fancifully named countries. Nothing about the world building tells me why I should care about what's going on. I'll admit a little before the halfway mark, Maas introduces the concept of Wyrdmarks, sort of like ancient runes, and adds in a little ancient history of Erilea with Elena, the first queen of Adarlan, but while these developments did add a little flavor to bland Erilea, I'm still no closer to understanding, why Celaena? Why Erilea?Celaena herself may be the best thing about this book, but that's not saying much. She's not entirely one dimensional, she's got the survived a death camp but was tough enough to leave with her humanity intact thing going for her, but I found her difficult to like at first. She talks big, whether it's how she can disarm so and so in three moves or kill so and so in five seconds, but never backs up those words with actions until way too late in the book - by then every other sentence being about how awesome she is was seriously grating on my nerves. Even then, I still can't believe how someone who complains about how uncomfortable corsets are and likes to sleep in can be Adarlan’s Assassin. Isn't the kingdom's best assassin supposed to be tough and more than willing to bear nuisances as trivial as a tight corset? And when there are scenes like the one where she's surprised in bed by a bag of candy, she doesn't know who it's from and promptly eats half the bag even though there's a killer loose in the castle ... ummm, am I the only one who sees so many things wrong with that? How did she not wake up when the bag was delivered, especially when she's rigged the doors to squeak? Why didn't she suspect poison? Is she even a competent assassin?But I definitely reserve the brunt of my criticism for Chaol and Dorian. First of all, in most books there's a plot and a romance on top of that, in Throne of Glass two thirds of the time it feels like romance first and plot second. I mean, the Captain of the Guard and the Prince, they don't do anything, they're just there to be love interests. It's frustrating to read scene after scene of batting eyelashes and inane banter, expect these characters to do something relevant to the plot, and they just stand around flirting with Celaena. Even minor characters Nox and Pelor ended up doing more, having a bigger impact on the plot, than those two, and Nox and Pelor are definitely in far fewer scenes. Look, I have nothing against love interests, but these guys are just pointless love interests.And the flirting, I am not exaggerating when I say setting up the love triangle takes up two thirds of the book. Actually, Throne of Glass's first half is entirely dull and forgettable, the real story doesn't even begin until over two hundred pages in. Even then, the way everything comes together, it's entirely predictable. Maas drops way too many too obvious hints about the champion deaths, the strange Wyrdmarks, the villain behind the whole thing, I was three steps ahead of Celaena the whole time. And yet, somehow she still doesn't explain the point of the entire plot. Instead, it's one of those, yeah, congratulations you get a bit of somewhat intense action and some closure with the defeat of a minor villain while I tease the real plot but will be secretive and cryptic about it so you better read the sequel. I don't get it. How can a book that had four prequels to set up the story still be nothing but setup? Maybe the whole thing will make sense in the sequel, but that's no excuse for the lack of substance in this book."}, {"Review": "Reviewed by: Rabid ReadsThe first time I saw my sister after I finished reading THRONE OF GLASS by Sarah J. Maas, she was in the middle of reading the latest book from one of her favorite series. I did not care. I pestered, cajoled, and harassed her until she downloaded the THRONE OF GLASS sample chapters and read them.She stopped reading her book and read ToG until the wee morning hours when she finished it.*lap of victory*A few months later, my mom came to visit for a long weekend. Her first night here, she asked me for something to read. I gave her THRONE OF GLASS. She stayed two extra hours to finish it. My MOTHER. And they aren’t the only ones I’ve pushed/thrown/shoved THRONE OF GLASS at. Why? Because it’s stupendous, that’s why. Celaena Sardothien is an assassin trained by the King of the Assassins. Caught (after potentially being betrayed—you can read all about it in \nThe Assassin's Blade\n, which I HIGHLY recommend), she is sentenced to hard labor in a salt mine until she dies for an indefinite period of time. After a year, she is offered a way out--all she has to do is defeat twenty-three other candidates in a competition to be the King’s Champion.That’s all. Just beat a multitude of bigger, stronger men after spending a year as a slave in a work camp. No big.And it isn't for Celaena b/c Celaena is just that good.SIDE RANT: I’ve read a lot of reviews for this book, and the most common complaint is that Celaena is too girly to be a believable assassin. I say N-O-N-S-E-N-S-E. No one bats an eye when Gin Blanco (\nElemental Assassin\n by Jennifer Estep) starts baking. What’s the huge difference between a love of cooking and a love of pretty things? I’m not seeing it. In fact, a love of clothes and a preoccupation with appearance is more consistent with being an assassin, in my opinion. A love of cooking is more of a choice of hobby whereas a desire to look pretty is characteristic of the narcissistic personality type that would be required to kill indiscriminately (unless, of course, it’s a child or a Terrasen) <------Celaena’s hard limits.Whatever. I like Celaena. She’s alternatingly badass and hilarious. I don’t know which version I prefer—the one that takes on her chauvinistic opponent in a sword duel without bothering to unsheathe her sword, or the one that shrieks at billiard balls for refusing to go where she wants them to go.But Celaena isn’t the only thing THRONE OF GLASS has going for it, not by a long shot. Both of the potential love interests are seriously swoonworthy, and the big bad(s)—sometimes it/they seem to operate in a committee-like fashion—are a well-crafted target for your contempt. There are exotic foreign princesses and magically summoned monsters, and there are just enough hints-of-things-to-come to keep your nails chewed to nubs while you wait for your next fix, I mean next book.If you’re a lover-of-Fantasy, THRONE OF GLASS should be at the top of your to-read list. The only problem is that right now it’s a six book series, so we won’t know how it ends until 2017. Here’s to delayed gratification. *wink*My other reviews for this series:\nThe Assassin's Blade: The Throne of Glass Novellas\n\nCrown of Midnight (Throne of Glass #2)\n\nHeir of Fire (Throne of Glass #3)\n\nQueen of Shadows (Throne of Glass #4)\n\nUntitled (Throne of Glass, #5)\n"}], "Image": "https://images.gr-assets.com/books/1495278054l/7896527.jpg", "Desc": "This is a previously published edition of  ISBN13: 9781599906959.After serving out a year of hard labor in the salt mines of Endovier for her crimes, 18-year-old assassin Celaena Sardothien is dragged before the Crown Prince. Prince Dorian offers her her freedom on one condition: she must act as his champion in a competition to find a new royal assassin.Her opponents are men-thieves and assassins and warriors from across the empire, each sponsored by a member of the king's council. If she beats her opponents in a series of eliminations, she'll serve the kingdom for four years and then be granted her freedom. Celaena finds her training sessions with the captain of the guard, Westfall, challenging and exhilarating. But she's bored stiff by court life. Things get a little more interesting when the prince starts to show interest in her ... but it's the gruff Captain Westfall who seems to understand her best.Then one of the other contestants turns up dead ... quickly followed by another. Can Celaena figure out who the killer is before she becomes a victim? As the young assassin investigates, her search leads her to discover a greater destiny than she could possibly have imagined."}