{"Genre": "Fantasy", "ID": "33", "Name": "The Lord of the Rings", "Reviews": [{"Review": "Twenty-five years ago I'd have given The Lord of the Rings my highest possible praise. I came to Tolkien's masterpiece on my own, and that meant much to me at twelve. The only books that had been reached by me alone were books on mythology and horror. Everything else I read, from DH Lawrence to Hemingway to Dickens to Shakespeare (and this also included Dracula and Dr. Jeckyll and Mr. Hyde because they were \"true\" classics), was suggested and sanctioned by my mother (for which I will always owe her deeply).But The Lord of the Rings was mine and mine alone. It is easy to forget that The Lord of the Rings was not a pop culture phenomenon in the seventies and early eighties. It was a fringe book (at least in North America), something that was not yet considered a part of the canon, something that was not a name on every boy's lips (even if they were just getting to know D&D) let alone every child's lips. Sure it was respected and loved by those who knew it, but knowing it was not a foregone conclusion as it is today, and its audience was almost completely genre oriented. In my little community (my school and the blocks surrounding my home), I was the first kid to read it.And that first reading was a revelation. Sure I'd read The Hobbit, but that didn't prepare me for the breadth and depth of The Lord of the Rings. Middle Earth in its grandest incarnation. To create a fantasy world is one thing, but to breathe life into ages of that world, to keep all the pieces together with such magnificent detail and rigour, to create character after believable character and make us care about most of them, even poor Smeagol/Gollum, that is a literary labour of Hercules. And by pulling it off, Tolkien created the single most important manifestation of Fantasy that has ever and will ever be written. The Lord of the Rings has rightly been named a classic. It is part of the canon, and it deserves its place. It is entertaining, it is weighty, and it is loved by nearly all.Aye...and there's the rub.Its indisputable greatness has made it indisputable. It has become dogma among fanboys and fangirls that the bastions of The Lord of the Rings are unassailable. Criticize Tolkien's work -- academically or otherwise -- and you put yourself in almost as much danger as a chatty atheist trying to engage in a theological discussion in a coliseum full of Jehovah's Witnesses (how many of those folks will make it into the afterlife? Isn't there a limit?).Feminist critics point out the lack of women in The Lord of the Rings, and that those women who are present fulfill only the narrowest stereotypes. Éowyn's strength is dependent upon adopting male gender qualities, a typical stereotype of \"powerful women in fantasy,\" and she is alone amongst the Rohirrim as a woman who can and will fight. All other women in her culture are present as a reason to fight rather than as integral parts of the struggle. Arwen's place (in the books, at least) as a maiden waiting for the hand of her king takes the \"reason to fight\" to even greater heights. And the only powerful female, Galadriel as the terrible, beautiful elven Queen, is too far removed from mortality and reality to be anything more than a mid-tale deus ex machina, thereby removing her from the realm of women and men and making her a pseudo-god whose power is allowed only because it is arcane and mysterious. Post-Colonial critics have latched onto the racism inherent in The Lord of the Rings, pointing out the hierarchies between the races: from the \"superiority\" of the elves, to the \"chosen\" role of \"European\" Men of the West under the leadership of Aragorn, to the lesser races of Dwarves and Hobbits (the former are \"lesser\" because they are \"too greedy\" and the latter are \"lesser\" because they are children). Post-Colonialists look to the \"orientalization\" of Sauron's forces and the configuration of evil as an inherent quality of Orcs and \"the dark folk.\" They point out Tolkien's family's history as a cog in the mechanism of English Imperialism, and his own birth in one of the most blatantly racist colonies of all, South Africa (while he did leave at three years old, his family's presence there at all suggests that some of the classic colonial opinions about the colonized \"dark races\" helped form the man who wrote these books), as possible reasons for this racism. These criticisms further suggest, at least to me, that the archetypal source of all fantasy's entrenched racism -- even those books being written today -- is The Lord of the Rings. Those fantasy authors who have followed Tolkien consistently and inescapably embrace his configuration of the races (yes, even those like R.A. Salvatore who try and fail to derail this configuration) and the concepts of good and evil that go along with them, which leads to the stagnation and diminishment of their genre.The fact is that these flaws do exist in The Lord of the Rings. They are present. They are easy to find. But few of Tolkien's rabid fans want to hear about them. And even when the criticism is not necessarily suggesting a flaw in Tolkien's work but merely the presence of some subtext, the dogmatists react with rage and condemnation. A fine example of this is when Queer and Gender theorists point to the overwhelming relationships between men, and how the relationship between Frodo and Sam is homosocial, at least, and possibly even homosexual. The only true intimacy in the book occurs between the men, after all, and to ignore that fact is to ignore one of key components of why The Lord of the Rings is so emotionally satisfying, especially to young men. Even faced with these ideas supported by convincing arguments, however, many fans either strive for ignorance or attack the messenger. This may have much to do with the worry -- unreasonable though it is -- that to admit that a flaw or something uncomfortable exists in any of these books, which so many people love so deeply, is to accept that The Lord of the Rings is neither great nor worthy of love.But this is not the case. I love The Lord of the Rings even though I subscribe completely to the post-colonial criticism, and see the merits in both the feminine and queer criticisms, not to mention the countless other criticisms and subtexts that are floating around.The books are racist; they are sexist. They are not perfect. And I must criticize the elements of The Lord of the Rings that make me uncomfortable and deserve no praise. But my complaints and the complaints of critics make Tolkien's achievement no less great. Tolkien created the most magnificent imaginary world ever conceived, and, for good or ill, Fantasy would be nothing today were it not for him. The Lord of the Rings is a triumph on countless levels, but it is not the word of God, nor should it be elevated to such heights.I love The Lord of the Rings, but I love it with reservations. I love it because of its place in my personal mythology, its genuine originality, its creativity, its power, but I love it with my mind open to its flaws, and I refuse to make excuses for Tolkien or his work.Twenty-five years ago I'd have given The Lord of the Rings my highest possible praise. Not today. But I am still willing to admit my love. "}, {"Review": "Considering that The Lord of the Rings is one of the most popular books of the last century, it's surprising to see how few reviews there are here. I get the impression that many people feel guilty about liking it. It's a phase you go through, and the less said about it, the better. I think this is unfair to the book, which, I am prepared to argue, is a whole lot better than it's generally made out to be; I don't think its huge success is just evidence that people have no taste. It's something that can be read at more than one level, and, before dismissing it, let's take a look at what those levels might be. On the surface, it's a heroic fantasy novel, and quite a good one. It's a gripping, well-realized story, with an interesting fantasy world as background. Under the surface story, it's also clear that there's a moral discourse. It's not an allegory; as Tolkien points out in the foreword, he hated allegory, and we certainly don't have an in-your-face piece of Christian apology by numbers. None the less, the author has constructed some inspiring and thought-provoking symbols. The Ring confers great power, but the only way to defeat Sauron is to refuse that power, and destroy it, even at great personal cost. Frodo's self-sacrifice is quite moving. I also think that Gandalf is an unusually interesting Christ-figure; sufficiently so that many people refuse even to accept him as one, though, at least to me, the argument on that point seems convincing. He comes from Valinor, obviously the Heavenly Realm, to help the Free Peoples of the West. A central part of his message is the importance of mercy, as, in particular, shown by the memorable scene near the beginning, when he rebukes Frodo for wishing that Bilbo had killed Sméagol when he had the opportunity. As we discover, Sméagol is finally the one person who can destroy the Ring. And let's not miss the obvious point that Gandalf is killed, and then returns reborn in a new shape. I find him vastly more sympathetic than C.S. Lewis's bland Aslan, and he is the book's most memorable character.But I don't think the morality play is the real kernel either. What makes LOTR a unique book, and one of the most ambitious experiments in literary history, is Tolkien's use of names. All authors knows how important names are, and use them to suggest character; though when you think about what is going on, it is rather surprising how much can be conveyed just by a name. Proust has a couple of long discussions about this, describing in great detail how the narrator's initial mental pictures of Balbec, Venice and the Guermantes family come just from the sounds of their names. Tolkien goes much further. Most of his names are based on a family of invented languages, linked by a vast complex of legends and histories, the greater part of which are invisible to the reader and only surface occasionally. The astonishing thing is that the technique actually works. The interrelations between all the invented names and languages make Middle-Earth feel real, in a way no other fantasy world ever has. When some readers complain that characters and locations are hastily sketched, I feel they are missing the point. Tolkien was a philologist. He loved languages, words and names, and tracing back what the relationships between them say about their history. In LOTR, he's able to convey some of that love of language to his readers. You have to read the book more than once, but after a while it all comes together. To give just a few obvious examples, you see how \"hobbit\" is a debased form of the word holbytla (\"hole-dweller\") in the Old Norse-like language of Rohan, how the \"mor\" in \"Moria\" is the same as the one in \"Mordor\" and \"morgul\", and how Arwen Undómiel's name expresses her unearthly beauty partly through the element it shares with her ancestor Lúthien Tinúviel. There are literally hundred more things like this, most of which one perceives on a partly unconscious level. The adolescent readers who are typically captivated by LOTR are at a stage of their linguistic development when they are very sensitive to nuances of language, and programmed to pick them up; I can't help thinking that they are intuitively seeing things that more sophisticated readers may miss.Perhaps the simplest way to demonstrate the magnitude of Tolkien's achievement is the fact that it's proven impossible to copy it; none of the other fantasy novels I've seen have come anywhere close. Tolkein's names lend reality to his world, because he put so much energy into the linguistic back-story, and before that worked for decades as a philologist. Basically, he was an extremely talented person who spent his whole life training to write The Lord of the Rings. In principle, I suppose other authors could have done the same thing. In practice, you have to be a very unusual person to want to live that kind of life.Writing this down reminds me of one of the Sufi stories in The Pleasantries of the Incredible Mullah Nasrudin. The guy is invited to a posh house, and sees this incredibly beautiful, smooth lawn. It's like a billiard table. \"I love your lawn!\" he says. \"What's the secret?\"\"Oh,\" his host says, \"It's easy. Just seed, water, mow and roll regularly, and anyone can do it!\"\"Ah yes!\" says the visitor, \"And about how long before it looks like that?\"\"Hm, I don't know,\" says the host. \"Maybe... 800 years?\""}, {"Review": "Writing a review of this masterpiece is impossible. I can’t do it. There’s too much to talk about and I love it far too much to articulate my thoughts in a normal way. So instead I’ve picked one element of each book that I liked the most (taken from my list of ten on each review) and added them here. It’s the best I can do, though I know many goodreads users share my difficulty when reviewing this book. Anyway, here’s my top three:1.Finding your courage- The Fellowship of the RingNot all the party have been fully tested. With them travel four young hobbits, the most unlikely of companions for such a journey. They are the overlooked, the forgotten about, the race that is casually discarded and considered insignificant in the wider world. And perhaps this has been the downfall of society in middle earth previously. The forces of darkness exploit everything they can get their hands on, from giant spiders to rampaging trolls, from dragons to orcs, from men of the east to the undead, Sauron tries to wield it all. This is something the forces of good have not fully considered until recently. Within the bosom of the hobbit beats a strong heart of fortitude and resilience. “My dear Frodo!’ exclaimed Gandalf. ‘Hobbits really are amazing creatures, as I have said before. You can learn all that there is to know about their ways in a month, and yet after a hundred years they can still surprise you at a pinch.” They carry with them the key to destroying the dark. Bilbo showed them how he could resist the ring. The hobbits are an almost incorruptible race, and because of this they are Sauron’s doom. It is something he has overlooked. “It would be the death of you to come with me, Sam,\" said Frodo, \"and I could not have borne that.\"\"Not as certain as being left behind,\" said Sam.\"But I am going to Mordor.\"\"I know that well enough, Mr. Frodo. Of course you are. And I'm coming with you.” 2. Gandalf the White - The Two Towers“Do I not say truly, Gandalf,' said Aragorn at last, 'that you could go whithersoever you wished quicker than I? And this I also say: you are our captain and our banner. The Dark Lord has Nine. But we have One, mightier than they: the White Rider. He has passed through the fire and the abyss, and they shall fear him. We will go where he leads.Gandalf the Grey was charming and quirky; he was everybody’s friend and advisor. But he was also a great wonderer and a great quester. He was an unearther of dark secrets and mysteries. And Middle-Earth no longer needs such a figure, darkness is now on her doorstep; it is no longer hidden. So Middle-Earth needs a man (or Istari) with far sight that can unite the scattered forces of Rohan and manipulate events in order to ensure that the King does, indeed, return. It needs a methodical man of great wisdom and intelligence; it needs a stagiest: it needs a new white wizard now that Saruman has changed his colours. And he has come. 3.Girl Power!-The Return of the King“What do you fear, lady?\" [Aragorn] asked.\"A cage,\" [Éowyn] said. \"To stay behind bars, until use and old age accept them, and all chance of doing great deeds is gone beyond recall or desire.”There have not been many moments for women to show their strength in this story. Arwen’s moment in the films was non-existent in the book. Frodo was saved on the river by an Elf-lord called Glorfindel. So when Eowen battled the Witch King, it is the first major moment Tolkien gave to a female hero. In a vastly male dominated genre, it was great to read this scene. If I have one criticism of Tolkien, it’s that we didn’t see more of such things. And here's a gif I like:"}, {"Review": "The true source of the fantasy fiction genre. Tolkien has spawned so many fantasy writers since The Lord Of The Rings went into print. I love all the earlier ones too like Verne and Carrol and CS Lewis but The Hobbit and The Lord Of The Rings its like an institution.🐯👍Who else, besides me, has the notion that the real hero in the Lord Of The Rings story is Sam? Sam is the typical accidental hero. He is the girl or boy next door, the ordinary folk. Sam is you and me and represents the courage we all have inside of us. He shows that when the going gets tough and the shit hits the fan it is the most unlikely of us that step up. Hero's are not always musclebound hunks. Not always the James Bond type character or the brilliant lawyer bringing justice to the deserving. Almost all of the time the hero is the one that does the things that go unnoticed, uncelebrated. There is a hero in all of us whether we know it or not.🐯👍A Hobbit finds himself on a quest that will change his lifeAn adventure full, of peril and strifeAn ancient evil is rising, to come forth againLike a dark cancer, enveloping, causing suffering and painA gold ring will help Frodo on his way, make him invisible to all near byBut give away his location, as Sauron see's him, from most highLike the all seeing eye of Lucifer, the eye from the skiesAnd Frodo is in extreme danger, as a dark army begins to riseStrider, and Legolas, and Gimley will aid him and Samwise GamgeeAnd Meriadoc Brandybuck, and Peregrin Took, and Gandalf, to complete the band of brothers, a familyGollum, the sinister one, the gold ring an obsessionGollum wants it back, from Fodo's possessionA tale of great adventure, fantasy of the highest esteemTolkien was a master, to me, that's all he has ever been. 👍🐯"}, {"Review": "\nThree Rings for the Elven-kings under the sky,Seven for the Dwarf-lords in their halls of stone,Nine for Mortal Men doomed to die,One for the Dark Lord on his dark throneIn the Land of Mordor where the Shadows lie.One Ring to rule them all, One Ring to find them,One Ring to bring them all And in the darkness bind themIn the Land of Mordor where the Shadows lie.\nThree thousand years after the defeat of the Dark Lord Sauron before the slopes of Mount Doom, a magic ring falls into the care of Frodo Baggins, a young hobbit from the Shire. Aided by his gardener Samwise Gamgee and the mysterious wizard Gandalf the Grey, he takes the ring on a journey to Rivendell, a hidden refuge of the Elves. But evil stirs in the fell lands of Mordor, and black riders scour the countryside in search of their master’s most prized possession…Thus begins the most legendary saga in the history of fantasy.\n\"It’s a dangerous business, Frodo, going out your door. You step onto the road, and if you don’t keep your feet, there’s no knowing where you might be swept off to.\"\nI’ll kick off this review by telling a little story. A story starting, as the stories often do, with 'once upon a time'...Once upon a time, there was a little boy who have never read a fantasy book. Thinking back on it, it does seem like an awfully sorry state of affairs. He was a devoted reader already as a quite small child, but he mostly read children’s books like The Hardy Boys and other juvenile and boyish stories like them. The one day he discovered this huge brick called The Lord of the Rings, and started reading it. It would change his life forever. There were other books at the time, for instance the immensely popular Harry Potter series, which was being published back then, but none of them could ever hope to compare to what was now the little boy’s favourite book.The little boy grew into adolescence. He read other books, few of them fantasy. He discovered a passion for history, and started reading that. He read classics and sci-fi and mysteries and even religious texts. He read books considered by some as among the best books ever. And none of them could ever hope to compare to what was still the boy’s favourite book.Later that little boy would grow up to become a man (though he probably never will grow up completely, mind you). And he started reading fantasy again. A Song of Ice and Fire was one of the first attempts, and it quickly turned into a favourite. But compared to The Lord of the Rings? Nothing. It was followed by tons of other fantasy series, among them Narnia, The Inheritance Cycle, Shannara and so on. And he loved them all. But every once in a while, he had to go back to this huge brick to remember that there existed something even better.\n\"Where now the horse and the rider? Where is the horn that was blowing?Where is the helm and the hauberk, and the bright hair flowing?Where is the hand on the harpstring, and the red fire glowing?Where is the spring and the harvest and the tall corn growing?They have passed like rain on the mountain, like a wind in the meadow;The days have gone down in the West behind the hills into shadow.\"\nI have been struggling for years to describe The Lord of the Rings. How do you actually describe the book you both love more than any other, and also consider the best book ever written from a more or less objective point of view?I recently dumped into the word sublime, which I’ve only heard used on a few occasions before. I knew what it meant, but not the exact definition. So I checked.- Of high spiritual, moral, or intellectual worth.- Not to be excelled; supreme.- Inspiring awe; impressive.- An ultimate example.And that is pretty much exactly how I would describe it. Sublime it is. I realised that I would never come closer to an actual description of The Lord of the Rings. This is to me not only the main pillar on which the fantasy genre stands, but the ultimate masterpiece of literature.I’ll use a far-fetched example to make my love for this book sound totally crazy put my love for this book in perspective: if I had to choose between reading this book once and having unlimited access to all the other books ever released, then I would choose this. No contest even.I am so very grateful to have been given the chance to come along on the journey of the Fellowship of the Ring. To visit so many wonderful places in a land of myths and magic. To meet so many fascinating men, elves, dwarves and other legendary peoples and creatures...Are there any negative things to mention? No. In my mind there are none at all, but I’ll say this: Tolkien’s characters are not the best I have encountered, and the storyline of this book is not perfect. That’s the closest you’ll ever come to witness me criticizing this wondrous gem, and the only things you’ll ever hear from me about it except for fanatical ravings and unsolicited praise.\nI sit beside the fire and thinkof people long agoand people who will see a worldthat I shall never know.But all the while I sit and thinkof times there were before,I listen for returning feetand voices at the door.\nIf perfection exists and is obtainable, then Tolkien’s worldbuilding is perfect. There is nothing in either fantasy or any other genre to match it. It certainly surpassed all the magical worlds that had come before it, and none created since that time have been able to surpass it in turn. Writers like Robert Jordan and George R.R. Martin have made their attempts, and now we’re talking about more of my all-time favourite fantasy worlds and series, but in my eyes, none of them have even come close.I have had tons of delightful experiences while venturing into magnificent worlds of fantasy, in Westeros and Narnia and so many others. But Middle-Earth is like a fictional home. I seem to have left behind parts of my heart and soul by the waterfalls of Rivendell, the ancient trees of Fangorn forest, the plains of Rohan and the marble walls of Minas Tirith. And I do not regret that for one second.Most of my standards for comparison also derive from this tome. I have yet to encounter a mentor character in fantasy who can compare to Gandalf, or a fictional love story that can compare to the tale of Aragorn and Arwen. I have yet to encounter a setting as detailed or writing as flawlessly eloquent as this. And those are only a few examples of aspects in which I consider The Lord of the Rings to be superior to all others.These musings can only begin to describe how much this book means to me. It sparked my passion for reading at a young age. It made me love the fantasy genre and all that came with it. It made me start creating worlds of my own, and in the end find one in particular that I liked so much I started writing stories set in it. Why, it even made me intrigued by poetry eventually. But I have yet to read anything by any famous poet that can match Tolkien’s utterly incredible poems.On my third and fourth and fifth reads of this book, I started looking beyond the immediately visible. And I found something more to admire: the man himself. John Ronald Reuel Tolkien went on to become my most important role model, and despite having been gone from this world for forty years, he’s been heavily influencing my personal opinions and choices for more than a decade. And not only literarily, but historically, politically and philosophically as well.This book is definitely the one single object that’s had the most impact on me, and it’s meant a lot more to me than one should think any object could be capable of. But then again it’s not really an object after all. It is so much more. A legend trapped in words on pieces of paper. A magical gateway to the most amazing world you’ll ever see.This is to me the apex of human creativity and imagination. The very best form of art a human mind can produce.There have been many books that I have cherished through the years, and I expect there will be many more to come. But The Lord of the Rings will always be the one I treasure the most of them all.It has changed me forever. As it once changed the world forever.\n\"I amar prestar aen, han mathon ne nen, han mathon ne chae a han noston ned 'wilith.\"\nSo that's all I have to say for now. I'm afraid this was not so much an actual review as simply a story about my experience with and passion for this book. If you've been patient enough to read to the very end, I thank you for your attention. I'll leave you with the most beautiful passage Tolkien ever wrote, and my favourite literary quote of all time..."}, {"Review": "Authors who inspire a movement are usually misunderstood, especially by those they have inspired, and Tolkien is no exception, but one of the biggest misconceptions about Tolkien is the idea that he is somehow an 'innovator of fantasy'. He did add a number of techniques to the repertoire of epic fantasy writers, and these have been dutifully followed by his many imitators, but for the most part, these techniques are little more than bad habits.Many have called Tolkien by such epithets as 'The Father of Fantasy', but anyone who makes this claim simply does not know of the depth and history of the fantasy genre. For those who are familiar with the great and influential fantastical authors, from Ovid and Ariosto to Eddison and Dunsany to R.E. Howard and Fritz Leiber, it is clear that, long before Tolkien, fantasy was already a complex, well-established, and even a respected literary genre.Eddison's work contains an invented world, a carefully-constructed (and well-researched) archaic language, a powerful and unearthly queen, and a central character who is conflicted and lost between the forces of nobility and darkness. Poul Anderson's \nThe Broken Sword\n, which came out the same year as The Fellowship of the Ring, has distant, haughty elves, deep-delving dwarves, a broken sword which must be reforged, an epic war between the armies of light and darkness, another central character trapped between those extremes, and an interweaving of Christian and Pagan worldviews.So, if these aspects are not unique to Tolkien, then what does set him apart? Though Dunsany, Eddison, and Anderson all present worlds where light and dark come into conflict, they present these conflicts with a subtle and often ironic touch, recognizing that morality is a dangerous thing to present in absolutes. Tolkien (or C.S. Lewis), on the other hand, has no problem in depicting evil as evil, good as good, and the only place they meet is in the temptation of an honest heart, as in Gollum's case--and even then, he is not like Eddison's Lord Gro or Anderson's Scafloc, characters who live under an alternative view of the world, but instead fluctuates between the highs and lows of Tolkien's dualistic morality.It is a dangerous message to make evil an external, irrational thing, to define it as 'the unknown that opposes us', because it invites the reader to overlay their own morality upon the world, which is precisely what most modern fantasy authors tend to do, following Tolkien's example. Whether it's Goodkind's Libertarianism or John Norman's sex slave fetish, its very easy to simply create a magical allegory to make one side 'right' and the other side 'wrong', and you never have to develop a dramatic narrative that actually explores the soundness of those ideas. Make the good guys dress in bright robes or silvery maile and the bad guys in black, spiky armor, and a lot of people will never notice that all the 'good guys' are White, upper class men, while all the 'bad guys' are 'brutish foreigners', and that both sides are killing each other and trying to rule their little corner of the world.In Tolkien's case, his moral view was a very specific evocation of the ideal of 'Merrie England', which is an attempt by certain stodgy old Tories (like Tolkien) to rewrite history so that the nobility were all good and righteous leaders, the farmers were all happy in their 'proper place' (working a simple patch of dirt), while both industrialized cultures and the 'primitives' who resided to the South and East were 'the enemy' bent on despoiling the 'natural beauty of England' (despite the fact that the isles had been flattened, deforested, and partitioned a thousand years before).Though Tom Bombadil remains as a strangely incoherent reminder of the moral and social complexity of the fantasy tradition upon which Tolkien draws, he did his best to scrub the rest clean, spending years of his life trying to fit Catholic philosophy more wholly into his Pagan adventure realm. But then, that's often how we think of Tolkien: bent over his desk, spending long hours researching, note-taking, compiling, and playing with language. Even those who admit that Tolkien demonstrates certain racist, sexist, and classicist leanings (as, indeed, do many great authors) still praise the complexity of his 'world building'.And any student of the great Epics, like the Norse Eddas, the Bible, or the Shahnameh can see what Tolkien is trying to achieve with his worldbuilding: those books presented grand stories, but were also about depicting a vast world of philosophy, history, myth, geography, morality and culture. They were encyclopedic texts, intended to instruct their people on everything important in life, and they are extraordinarily valuable to students of anthropology and history, because even the smallest detail can reveal something about the world which the book describes.So, Tolkien fills his books with troop movements, dull songs, lines of lineage, and references to his own made-up history, mythology, and language. He has numerous briefly-mentioned side characters and events because organic texts like the epics, which were formed slowly, over time and compiled from many sources often contained such digressions. He creates characters who have similar names--which is normally a stupid thing to do, as an author, because it is so confusing--but he’s trying to represent a hereditary tradition of prefixes and suffixes and shared names, which many great families of history had. So Tolkien certainly had a purpose in what he did, but was it a purpose that served the story he was trying to tell?Simply copying the form of reality is not what makes good art. Art is meaningful--it is directed. It is not just a list of details--everything within is carefully chosen by the author to make up a good story. The addition of detail is not the same as adding depth, especially since Tolkien’s world is not based on some outside system--it is whatever he says it is. It’s all arbitrary, which is why the only thing that grants a character, scene, or detail purpose is the meaning behind it. Without that meaning, then what Tolkien is doing is just a very elaborate thought exercise. Now, it’s certainly true that many people have been fascinated with studying it, but that’s equally true of many thought exercises, such as the rules and background of the Pokemon card game, or crossword puzzles.Ostensibly, Scrabble supposedly is a game for people who love words--and yet, top Scrabble players sit an memorize lists of words whose meaning they will never learn. Likewise, many literary fandom games become little more than word searches: find this reference, connect that name to this character--but which have no meaning or purpose outside of that. The point of literary criticism is always to lead us back to human thought and ideas, to looking at how we think and express ourselves. If a detail in a work cannot lead us back to ourselves, then it is no more than an arbitrary piece of chaff.The popularity of Tolkien’s work made it acceptable for other authors to do the same thing, to the point that whenever I hear a book lauded for the ‘depth of its world building’, I expect to find a mess of obsessive detailing, of piling on so many inconsequential facts and figures that the characters and stories get buried under the scree, as if the author secretly hopes that by spending most of the chapter describing the hero’s cuirass, we'll forget that he’s a bland archetype who only succeeds through happy coincidence and deus ex machina against an enemy with no internal structure or motivation.When Quiller-Couch said authors should ‘murder their darlings’, this is what he meant: just because you have hobbies and opinions does not mean you should fill your novel with them. Anything which does not materially contribute to the story, characters, and artistry of a work can safely be left out. Tolkien's embarrassment of detail also produced a huge inflation in the acceptable length of fantasy books, leading to the meandering, unending series that fill bookstore shelves today.Now, there are several notable critics who have lamented the unfortunate effect that Tolkien’s work has had on the genre, such as in Moorcock’s \nEpic Pooh\n and Mieville’s diatribe about every modern fantasy author being forced to come to terms with the old don's influence. I agree with their deconstructions, but for me, Tolkien isn’t some special author, some ‘fantasy granddad’ looming over all. He’s just a bump in the road, one author amongst many in a genre that stretches back thousands of years into our very ideas of myth and identity, and not one of the more interesting onesHis ideas weren’t unique, and while his approach may have been unusual, it was only because he spent a lifetime obsessively trying to make something artificial seem more natural, despite the fact that the point of fantasy (and fiction in general) is to explore the artificial, the human side of the equation, to look at the world through the biased lens of our eye and to represent some odd facet of the human condition. Unfortunately, Tolkien’s characters, structure, and morality are all too flat to suggest much, no matter how many faux-organic details he surrounds them with.My Fantasy Book Suggestions"}, {"Review": "The Fellowship of the Ring begins with the Shire and winds its way through the barren lands that lie on the way to Mordor. I tried to read this part of the book once, but DNF it then. Then I picked up the trilogy bound in one volume and went through it fairly steadily.I've read that Tolkien wasn't as original as first claimed. There is a book called The Broken Sword that has parallels with LotR. Nevertheless Tolkien take on traditional myths was unique and groundbreaking. The Eddas, the Welsh myths, and Norse myths all are the foundation for this great story.This was a reread and was a satisfactory one because I wanted to reach my favorite parts. I looked forward to read Tom Bombadil's part again. Did it. Then the Rivendell parts, ditto. Slowly I wound my way, sometimes following Sam and Frodo, sometimes Aragorn. Gandalf appears relatively scantily towards the third book. I had a lot of fun reading LoTR, and I've not yet deleted it from my Ereader because I'm tempted to reread it soon. Five well deserved stars, indeed."}, {"Review": "\nBulgarian review below/Ревюто на български е по-долу\nThe pilgrimage of Frodo, Sam and their fellows lasted for a year, and it happened so that it took me nearly as long to see them home to the Shire. Well, people say good things happen slowly, so I don’t regret the journey one bit.Something crosses my mind that Terry Pratchett has shared in ‘A Slip of the Keyboard‘. He was 12 or 13 when he read ‘The Lord of the Rings’ for the first time. His parents left him at some neighbors’ house to babysit their children while all the adults went visit somebody. To pass the time Terry (who as all boys wasn’t very keen on reading) got absorbed in the ‘LoTR’ and suddenly the Shire had spread out in his imagination and the edges of the shabby carpet turned in the Shire’s borders and beyond them adventures were awaiting. So, Terry Pratchett read all night long and for the whole next day too. He read the novel for 26 hours (with some small breaks, of course – the bladder of a 12-year-old is not a water-skin after all). In the years to come he continued to reread the book each year. This is how it goes, brilliant minds resonate in accord.When I was almost finished with the novel I realized that ‘The Lord of the Rings’ is actually an allegory of the human life. There is a spirit of idyll in the Shire, days are lazy and sometimes tinted with mischievousness, and Gandalf’s visits are sheer feasts – that looks very much like childhood perhaps. Then you step outside the hobbit hole and the limits of the known and you plunge into adventures – you had been yearning so much to lose those familiar faces for a while and see if some glorious song might be sung for you too. The journey starts jolly, one repast follows another (the food in the first part is indeed quite abundant – Tolkien himself says that ‘If more of us valued food and cheer and song above hoarded gold, it would be a merrier world’), you sing songs, admire everything new and your eyes are as big as pancakes as you try to perceive all novelties that happen to you – I suppose that’s the period of youth. After that though you slowly realize that you carry a truly heavy burden on your shoulders, that you have responsibilities and failure means too much, it means the world. Songs are noticeably fewer, you sing once in a blue moon and it’s only to give yourself courage and to remember the past when things used to be simple, and not to enjoy yourself. And like in life there are glimpses of hope, but also precipitous collapses in pitch-dark depths, you are sometimes alone among the multitude and sometimes there is a friend to lend you a helping hand, and you put one foot in front of the other and keep going because you know that nobody is going to wage that battle for you. And you rely on the flickering hope that one day you could sigh ‘I’m finally back’.There is some very sweet melancholy seeped through Tolkien’s world or at least I felt it that way. The verdure and meadows in the Shire, to fight for the world, but also for your tiny homeland, though it will never be the same, to do all you are capable of for what you know is good and right (view spoiler)[even if you won’t be there to enjoy it yourself…‘It must often be so, Sam, when things are in danger: someone has to give them up, lose them, so that others may keep them.’ (hide spoiler)]Choose a dauntless pony (let his name be Bill for example) or a proud steed as Shadowfax and ride through the Middle-earth. There be wonders.Who can say where the road goes?Where the day flows?\nOnly Time\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Около година продължи странстването на Фродо, Сам и техните (за)другари, така се случи, че кажи-речи толкова ми отне и на мен, за да ги изпратя обратно до Графството. Е, хубавите неща нали ставали бавно, та никак не съжалявам.Подсещам се нещо, което Тери Пратчет споделя в \nA Slip of the Keyboard\n. Бил на 12-13, когато прочел „Властелинът на пръстените“ за пръв път. Родителите му го оставили у някакви съседи да бави децата им, докато всички възрастни отишли някъде на гости. Тери (който като всяко хлапе от мъжки пол тогава хич не бил по четенето), уж да минава времето, се захласнал във „Властелина“ и изведнъж във въображението му вече се било ширнало Хобитово, а краищата на протъркания килим в стаята били границите на Графството, отвъд които чакали приключения. Та така, Тери Пратчет чел цяла нощ, а след това и през целия следващ ден. Прочел романа за 26 часа (с малки почивки, разбира се – все пак пикочният мехур на едно 12-годишно дете не е мях). След това в продължение на години го препрочитал по веднъж годишно. Така е то, умовете на гениалните хора резонират в съзвучие.Към края на романа осъзнах, че „Властелинът на пръстените“ е всъщност алегория на човешкия живот. В Графството витае дух на идилия, дните са изпълнени къде с леност, къде с някоя лудория, а идването на Гандалф е същински празник – нещо като детството може би. По-нататък прекрачваш прага на хòбитовата дупка и изобщо границите на познатото и се впускаш в приключения – ей, така си жадувал да се отърсиш от тези познати лица и да видиш може ли някоя и друга славна песен да се съчини и за теб. Пътуването започва бодро, още не си станал от трапезата и сядаш на нова (наистина в първата част хапването е доста на корем – ненапразно и самият Толкин твърди ‘If more of us valued food and cheer and song above hoarded gold, it would be a merrier world’), пееш песни, любуваш се на новите неща и очите ти са грамадни като палачинки в стремежа ти да обемеш всичкото това ново, което ти се случва – това ще да е периодът на младостта. По-нататък обаче постепенно осъзнаваш, че на плещите си носиш истински тежко бреме, че имаш отговорности, че провалът вече означава твърде много, означава всичко. Песните вече са осезаемо по-малко, пееш си от дъжд на вятър и то по-скоро за кураж и за да си спомниш миналото, когато нещата бяха простички, а не за да се веселиш. И тъй както в живота има моменти на надежда, но има и стремглави пропадания в непрогледни глъбини, понякога си сам сред гмежта, а понякога има приятел, който да ти подаде ръка, и правиш крачка след крачка, и продължаваш, защото знаеш, че тази битка е твоя и няма кой да я води вместо теб. И се осланяш на мъждукащото упование, че един ден ще можеш въздъхвайки да кажеш „Е, върнах се“.Някаква много сладка тъга е пропита в Толкиновия свят или поне аз така го усетих. Зеленината и ливадите на Графството, да се пребориш за света, но и за малкото си родно кътче, макар че никога вече няма да е същото, да направиш каквото е по силите ти за това, което знаеш, че е правилно (view spoiler)[, дори да не можеш да му се порадваш после самичък…„Често се налага да бъде тъй, Сам, когато над щастието натегне заплаха – някой трябва да се откаже от него, да го загуби, за да го запазят останалите.“ (hide spoiler)]Изберете си едно сърцато пони (да се казва примерно Бил) или пък горд жребец като Сенкогрив и препускайте из Средната земя. Очакват ви чудеса.Who can say where the road goes?Where the day flows?Only Time"}, {"Review": "One of the greatest trilogies of all time and certainly the measuring stick to which all subsequent fantasy-style writing is compared, The Lord of the Rings trilogy still stands at the top of the stack. Its realism, the characters and monsters, the storyline, the epic battles, and the quest motif are all drawn with incredible care by Tolkien in his chef d'oeuvre. My favorite was The Two Towers but all three are absolutely stunning. It has been a few decades since I read them so perhaps this year I will have to journey back to Middle Earth once again."}, {"Review": "I decided to read a one-book edition of the classic, just the way it was written. I will however split my discussion between three parts of it. I need to mention that I will not bother hiding any spoilers as I have trouble believing any modern person living in civilized enough parts of the world to have internet access has not read this one or at least has not seen the movies – which for all their faults were decent, but I am not talking about that abomination called the movie version of The Hobbit.For the very brief synopsis of the plot I will quote Brandon Sanderson’s brilliant description from his Alcatraz series. A furry-legged British guy had to throw his uncle’s ring into a crack in the ground. As I mentioned before I hope everybody and their brother are familiar with the plot, so the only purpose this description serves is pure amusement.My first time I read this I was quite young. The end of the book (I will refer to this work as a book, not a trilogy) gave me the worst book hangover I ever had before. Much later on I saw the movies and reread it. I matured and became more bitter and cynical. My initial rating of 5 stars still stands. This is a classic of epic fantasy against which all other epic fantasy works were judged up until now and will be judged in the foreseeing future.There is a reason countless carbon copies of this epic exist – of different quality. Terry Brooks’ Sword of Shannara comes to mind immediately. It is very much arguable whether it was different enough not to be called a blatant rip-off, but the next two parts of his trilogy were different enough. What would happen if you replace Frodo with a biggest whining asshole you can think of and leave everything else intact: a guy who loves speaking in bad poetry, the Council that gave birth to the Fellowship, and the freaking ring itself? You would get Thomas Covenant series by Stephen R. Donaldson; it gets recommended a lot and for some reason nobody is bothered by its similarities to The Lord of the Rings. These two are just the best-known examples.It would be very much unfair to call The Lord of the Rings the first work of fantasy. Lord Dunsany, Robert E. Howard, and others were writing what is considered fantasy today way before J.R.R. Tolkien. By the way while style of Lord Dunsany is a little hard to read in modern days, Howard’s Conan is still great. Tolkien was probably the best at world-building in fantasy rivalled only by Robert Jordan’s Wheel of Time and it took latter 15 huge books to do.To my complete surprise I found the book an easy read on my second time through. Even the dreaded endless poetry did not bother me too much and no, I did not skip over it. Tolkien’s writing style – when it does not slip into epic-ness in the third part – makes it a nice read.What follows is my criticism of some occasional flows in otherwise great classic epic fantasy book. I will split it into three parts to keep some semblance of organization.The Fellowship of the Ring.I was very curious to discover that Tolkien uses goblins and orcs interchangeably. In The Hobbit Bilbo found the fateful ring in Goblin’s caves. When this story was briefly retold in The Lord of the Rings, goblins became orcs. In modern fantasy these two races are very much distinct. I always imagine goblins to be green guys on a weak side, more like bothersome troublemakers while orcs are brutes with tusks and armed for a battle.Initially it took Frodo a while to get his behind moving and a because of this a lot of people complain about slow start. I was one of the complainers during my first read, but I found I like the slow-moving beginning the second time around. You will get a big picture of pastoral life in Shire to fully appreciate what would be lost to darkness.Tom Bombadil gets my award for being the most pointless character ever to grace a work of fantasy. This would be the only part where the movie did better than the original source: the former skipped his parts completely. To quote one of the person who commented on this and who said it much better than I could, “The end of the world is coming and we have a character happily singing songs about himself in his small corner of Middle Earth”. Add to this his annoying habit of speaking in bad poetry and my award is entirely justified.What the heck happened to Radagast? He was supposed to be a great wizard equal to both Saruman and Gandalf, however after unwittingly sending the latter to a trap he disappeared without a trace.In my humble opinion this is still the best third of the whole book.The Two Towers.Please correct me if I am wrong, but I think Tolkien created the first fantasy trilogy (if you consider his big book being split in three parts by the publisher). In this case he was also the guy who created the first Middle Book of a Trilogy Syndrome case. The idea is that the first book has to have an interesting beginning of a conflict and the last book has to have an exciting conclusion which leaves the second book with the boring job of building a bridge between the two. The Two Towers clearly shows this.I also do believe that the second part about Frodo and Sam being miserable can be made much shorter without any loss.I have the impression that while Tolkien tried to show the tragedy of a war, he still glorifies battles if they are fought for the just cause. Much later it was Glen Cook in his Black Company who showed that war is a really dirty business, no matter what side.The Return of the King.Once again the part about the misery of Frodo and Sam can be shortened, but not to the extent as in The Two Towers. It looks like the editors were asleep at their job as much at the time the book was written as they are now.Did anybody else had the impression that Gandalf the White was more useless overall than Gandalf the Grey?Did you notice that Sauron never ever makes a personal appearance? Tolkien made an excellent job of creating a menacing bad guy without showing him even once.This was also probably the first time an extremely annoying trope was used: take a pity of a bad guy and let him go only to have him backstab you later (Saruman). This one made an appearance countless times ever since and by now really overstayed its welcome.The last line of the book is brilliant and is as a perfect ending as it could possibly be. I only found one other fantasy series which came close to this perfection: the aforementioned Black Company by Glen Cook.This part is shorter as it contains numerous appendices, notes, etc. Reading them actually gave me a headache. They do contain some minimalistic info about the further fates of surviving characters. To make a long story short the mortal guys died with time. There, I saved you troubles of suffering through 200+ pages.I also realized that Middle Earth is not a nice place to live as wars were raging non-stop through its long history.In the conclusion I have a seemingly unrelated advice to my American friends. Do you have a tough choice in November between voting for a really bad person and an equally bad person? I will make it easy for you:"}, {"Review": "494.\tThe Lord of The Rings (The Lord of the Rings #1-3), J.R.R. (John Ronald Reuel) TolkienThe Lord of the Rings is an epic high fantasy novel written by English author and scholar J. R. R. Tolkien. The story began as a sequel to Tolkien's 1937 fantasy novel The Hobbit, but eventually developed into a much larger work. Written in stages between 1937 and 1949, The Lord of the Rings is one of the best-selling novels ever written, with over 150 million copies sold.The title of the novel refers to the story's main antagonist, the Dark Lord Sauron, who had in an earlier age created the One Ring to rule the other Rings of Power as the ultimate weapon in his campaign to conquer and rule all of Middle-earth. (Nineteen of these rings were made. These were grouped into three rings for the Elves, seven rings for the Dwarves, and nine rings for men. One additional ring, the One Ring, was forged by Sauron himself at Mount Doom.). From quiet beginnings in the Shire, a hobbit land not unlike the English countryside, the story ranges across Middle-earth, following the course of the War of the Ring through the eyes of its characters, not only the hobbits Frodo Baggins, Samwise \"Sam\" Gamgee, Meriadoc \"Merry\" Brandybuck and Peregrin \"Pippin\" Took, but also the hobbits' chief allies and travelling companions: the Men, Aragorn son of Arathorn, a Ranger of the North, and Boromir, a Captain of Gondor; Gimli son of Glóin, a Dwarf warrior; Legolas Greenleaf, an Elven prince; and Gandalf, a wizard.عنوانها: ارباب حلقه‌ ها؛ فرمانروای حلقه ها؛ سرور حلقه ها؛ خداوندگار حلقه ها؛ سالار انگشتریها؛ نویسنده: جی.آر.آر. تالکین؛ (نگاه) ادبیات انگلستان؛ تاریخ نخستین خوانش: یکی از روزهای ماه دسامبر سال 2002 میلادیعنوان: فرماندوای حلقه ها؛ نویسنده: جی.آر.آر. (جان رونالد روئر) تالکین؛ مترجم: رضا علیزاده؛ تهران، روزنه، 1381؛ سه کتاب در سه جلد؛ جلد نخست: یاران حلقه؛ جلد دوم: دو برج ؛ جلد سوم: بازگشت شاه؛ موضوع: داستانهای نویسندگان انگلیسی - سده 20 معنوان: خداوندگار حلقه ها؛ نویسنده: جی.آر.آر. (جان رونالد روئر) تالکین؛ مترجم: تبسم آتشین جان؛ تهران، حوض نقره، 1381؛ سه کتاب در شش جلد؛ جلد نخست: رهروان حلقه؛ عنوان: سالار انگشتریها؛ نویسنده: جی.آر.آر. (جان رونالد روئر) تالکین؛ مترجم: ماه منیر فتحی؛ تبریز، فروغ آزادی، 1381؛ سه کتاب؛ کتاب نخست: دوستی انگشتری؛ کتاب دوم: دوتا برج؛ کتاب سوم: بازگشت پادشاه؛رمانی به سبک خیال‌پردازی حماسی؛ به قلم جی. آر. آر. تالکین؛ نویسنده و زبان‌شناس انگلیسی ست. این مجموعه داستان؛ ادامه ی اثر پیشین تالکین، با عنوان هابیت است؛ که در همین ژانر نوشته شده بود. تالکین کتاب را طی دوازده سال؛ از سال 1937 میلادی تا سال 1949 میلادی که بیشتر آن در زمان جنگ جهانی دوم بوده، نگاشته است. اگرچه کتاب در بین خوانشگران، به شکل یک سه‌ گانه جا افتاده است، اما در ابتدا بنا بود، این اثر جلد نخستش کتاب سیلماریلیون باشد، که نویسنده به دلایل اقتصادی، تصمیم به حذف آن گرفت، و کتاب ارباب حلقه‌ ها را در سال 1954 میلادی تا سال 1955 میلادی در سه جلد منتشر کرد. داستان در سرزمینی خیالی به نام سرزمین میانی، که در زبان الفی به نام: آردا شناخته می‌شود؛ در جریان است. از شخصیت‌های معروف داستان می‌توان به: آراگورن، و سائورون، اشاره کرد. آراگورن پسر آراتورن، که از نژاد نومه نور است، وارث پادشاهی فراموش شده ی الندیل و ایزیلدور، در سرزمین میانه است. آراگورن پس از نابود شدن سائورون، به عنوان پادشاه اله سار تاج گذاری کرد، و صلح را به ارمغان آورد. ارباب تاریکی یا سائورون، شخصیت منفی و اصلی اثر، کسی ست که حلقه ی یکتای قدرت را برای کنترل نوزده حلقه ی دیگر؛ ساخته‌ ست؛ و برای همین است که «ارباب حلقه‌ ها» خوانده می‌شود. سائورون خود یکی از خدمت‌گزاران ارباب تاریکی پیشین - مورگوت (ملکور) - بوده، که از شخصیت‌های مهم کتاب دیگر تالکین - سیلماریلیون - است. کتاب سیلماریون سرآغازی بر تاریخ و چگونگی ساخت سرزمین میانی ست. سه گانه ی ارباب حلقه‌ ها در ایران؛ نخستین بار توسط رضا علیزاده ترجمه شد، و در سال 1382 هجری خورشیدی توسط انتشارات روزنه به چاپ رسید. هر سه کتاب دارای نقشه‌ هایی از سرزمین میانه هستند. همچنین در ابتدای کتاب اول، و در پایان کتاب سوم، مترجم اطلاعاتی درمورد داستان، و سرزمین میانه، و نژادهای ساکن آن، زبانشان، کتابتشان و... آورده‌ است. ا. شربیانی"}, {"Review": "I read Lord of the Rings first when I was about eleven or so, and then stayed up all night at a hip boy/girl party in the bathroom with Nathan O. ... talking about ents and elves and whether Tom Bombadil was God. Yes, I was a geeky child. However, all these years later, the story has stuck with me. First a warning: Don't read Tolkien if you don't appreciate true-omnicient-narrator-style epics. Tolkien isn't a master character builder: he leaves all that to the reader's imagination. The agony in the Aragorn/Arwen romance -- so blatant and operatic in the movies -- was a longing look on Strider's face at Rivendell, an odd comment from Bilbo, and a short no-nonsense Appendix. As with many of the themes in this work, the romance and deep character relationships must be picked from between the lines.And there is so much between the lines here. The world of Middle-earth lives, utterly lives. Instead of tugging on what-ifs, this fantasy forces readers to imagine. Tolkien's work is the fullest realization of literary world building ever penned.It is also sophisticated writing, drawing on older forms (epic, romance, tragedy). Tolkien doesn't waste time writing snappy dialogue: the story is too epic to dwindle to individual persons. However, voice shifts subtly depending on point of view: chapters dealing with hobbits contain much more dialogue and detail; chapters dealing with Rohirrim have a poetic rhythm reminiscent of extant Middle English works; chapters dealing with elves are magic and blurry and hard to wrap a mind around. These shifts in style, far from being a novice writer's oops, are intentional and serve as mass characterisation of races and groups. So, what Tolkien foregoes in terms of dialogue he replaces with style and action: a classic example of show not tell.Having just spouted all that praise, I have to admit that all the criticisms are true: the story does resound with Luddite anti-industrial metaphors, overt Christian themes of salvation and spirit, a structural decision to include songs that doesn't quite work, and fantasy tropes that are now cliche ... now that everyone else has copied them, that is. The thing to remember is that this book started the genre: everything fantasy, from Philip Pullman to George RR Martin, exists in the shadow of this opus.So, no, it isn't a popcorn read. Get over it. If you invest the time and spirit to read this work, you will be glad you did."}, {"Review": "Save time... watch the movies. This book can appeal only to a linguist. The underlying story is great, but it is buried under an avalance of horribly annoying songs and poems that do nothing to advance the story. They just take up space. I diligently read every last one, hoping that they held some deep meaning in relation to the story, but if there is one, it is so obscure that it serves no purpose. Also, the book is all about walking. Yes, I know they are on an epic quest, and there has to be soul-searching, etc., but the amount of detail regarding the walking is a snoozer! 45 pages of walking and 3 pages for a huge battle. AUGH! I know that this is a masterpiece, and I agree that the plot line is a beautiful tale of good and evil and power and corruption. However, reading this series was a drudgery. The only really good part that you miss in the movies is when the hobits return to the Shire in the last three chapters of The Return of the King. If you want a Tolkien fix, I'd reccommend The Hobbit."}, {"Review": "Lord of the Rings I have read LotR many times over the years, in fact it is I think the book I have read the most in this world, which i suppose makes it my favourite book, albeit closely followed by half a dozen others (shout if you want to know or take a gander at my favourites shelf).I have always enjoyed it, understatement, but for some reason this re-read is more special than ever. I had almost forgotten how much was different from the films, and despite having read LotR once before since the films, I seem to be getting more from the book this time than ever before.The Fellowship of The Ring 5 stars ⭐️As part of a buddy read, I have just completed the first book of the trilogy, and have given it 5 ⭐️. As anyone who actually reads my reviews will know, I very rarely need to use spoilers as I leave other people to read the book themselves, so you will find no or few spoilers in this review. The (first) book weaves an amazing tale with incredible characters in a well constructed world. The characters and situations make you smile, laugh and even cry as the journey begins, the Fellowship is put together and at the close of this book, so cruelly broken. Having somehow forgotten the differences to the film, I thoroughly enjoyed the differences, especially Tom Bombardil and the river daughter, and surprisingly I enjoyed all the poems, some brought tears to my eyes, is it the first time I have really read them ??February 2019 brings...The Two Towers "}, {"Review": "As I’ve mentioned, I am a huge fan of both fantasy in general and the films specifically. My first read through the series occurred during my high school years and, I’m sad to say, was not very enjoyable. I saw the movies before reading the series and I think this did much to set my expectations up for an entirely different type of story-telling. In the last few months my husband and I played through Lego Lord of the Rings and it got me to thinking that maybe now, after getting both a bachelor’s and master’s degree in English literature, I’d be ready to read through the series again with an open mind."}, {"Review": "If you're into stuff like this, you can read the full review.Christological Sacrifices: \"The Lord of the Rings Trilogy\" by TolkienIt is not really possible to re-read a book, just as it is not really possible to step into the same river twice. The next time, one's thinking is going to be entirely different. I have read \"LoTR\" half a dozen times. Each has been different. I think Heraclitus even said you couldn't step into the same river even once. I know what he's talking about. Every single time is a new time.I remember when I was seven being bored stiff reading and rereading the reading scheme books for my 'assessed reading age' at school. The problem was that I was being assessed by my ability at reading aloud and not allowed to progress until I had read each one to the teacher. I was already a silent reader of proper books from the Praça de Chile Library and could read the scheme books a dozen times before I was called."}, {"Review": "I became horrifically lazy towards the end of the LOTR re-read which was undertaken as part of my \"month of the kitten squisher\" and neglected to review the final two books which together make up The Return of the King. Not so much resting on my laurels as stretching out full length and having a big old snooze right on top of them. But you've all seen the film by now right? So no need to continue...Kidding, kidding. (and I've now put this review in the correct order so the newest bits are at the bottom)THE FELLOWSHIP OF THE RING: BOOK ONEFour hobbits, two men, one elf, one dwarf and a wizard. This would be the best line up ever for a reality television show. Frodo, Merry, Pip and Sam along with Aragorn, Boromir, Legolas, Gimli and Gandalf are the interspecies representatives that form the Fellowship of the Ring. A sort of United Nations of Middle Earth if you will, where the collective are supposed to protect and defend the freedom of all who dwell in Middle Earth and who are at threat from the growing darkness which is gradually creeping out of Mordor. There is no denying that this collection of six books (now widely published and referred to as a Trilogy) is an epic work. Tolkien sets out his stall early on in Book One with detailed descriptions, dense prose, background histories,poetry and a whole new language. There is a lot of word furniture but given the scope of the story and size of the metaphorical room, it needs to be heavily furnished in order to make it seem real or else hobbits, elves, dwarves and men would be tramping around in a cavernously empty room. Tolkien will not be rushed. He has an end game but with five more books to get through there is no point in putting all your Hobbits in one hole. The first book is slow paced and littered with mythology, poetry and song so if you were bracing yourself for a breathless dash from Hobbiton to Rivendell then you will be disappointed.And now, a word about the incessant singing. Hobbits like to eat and Hobbits like to sing. The descriptions of eating are fine, although they just made me hungry in turn. The singing is another matter. Much like an episode of Glee, there was far too much impromptu bursting into song and Hobbity jazz hands. You are on a serious mission Hobbits - act accordingly! With that in mind I didn't bother to read about 90% of the singing and so that made the reading of Book One a much speedier endeavour.THE FELLOWSHIP OF THE RING: BOOK TWOInspired by the hobbity singing - jazz hands optional (and to be sung to Stand by Your Man by Tammy Wynette)Sometimes its hard to be a hobbitGiving all your love to just one ringYou'll have bad times And Saruman will have good timesDoing evil things that you don't understandBut with the Fellowship you'll defeat himEven though he's hard to understandAnd though you fear himAnd are wary of himYou can beat himCause after all he's just a (Saru)manStand by your Sam (Wise Gamgee of the Shire)Give him two arms to cling toAnd a ring to bring tooWhen nights are cold and lonelyAnd you sleep by rick or stone or treeStand by your SamAnd tell Middle Earth you love himKeep giving all the love you canStand by your SamStand by your SamAnd show Middle Earth you love himKeep giving all the love you canStand by your Sam! THE TWO TOWERS: BOOK THREEBook three is the book where the hobbity singing, skipping and general happy-go-luckiness stops and war starts. War comes to Middle Earth preceded by the felling of great trees, the scorching of the earth, the poisoning of the waters and the birthing of a new race of fighting Uruk-hai. The eye of Sauron has turned its baleful crimson gaze from the orc-ugly workings of Mordor to the realms of men. If this was not bad enough, Saruman, powerful white wizard and most senior of Gandalf's order has decided that black is the new white and effectively changed teams. Apparently black is so much more timeless and the ultimate LBR (little black robe) is something that even wizards desire. But this book is not just the vehicle in which the hobbits travel to war... this is the book in which we are introduced to a whole host of new characters and LOTR species. Further detailed descriptions of the history and linguistic roots of both Ents and Elves are forthcoming. An even more refined version of the previous word furniture (think Louis XIVth not Ikea)is placed at strategic points around the room adding a further comfortable dimension to Middle Earth. It is this constant growth and development which, although fantastical has its routes in etymology which makes the fantasy world of Lord of the Rings much more acceptable, perhaps even believable than previous fantasy epics.  THE TWO TOWERS: BOOK FOUR Despite not believing that Hobbits would be very useful in a battle field scenario, Merry and Pippin prove their metal and generally kick Isengard butt in the final instalment of The Two Towers. Admittedly having some giant walking trees to ride around in makes them seem a good deal more invincible but generally you have to give them kudos for having disproportionately large balls, and not the scrying kind either. Isengard stands barren and torn asunder and Saruman is a prisoner in his own tower while the people of Rohan have made their stand against the fighting Uruk-hai at Helms Deep proving what most great generals already knew. It's not the number of men (or elves or dwarves) you have at your disposal, but how you deploy them that counts. Frodo and Sam are still toiling onwards with the fretful gollum at their heels. It was here that I began to get a little confused as the time scale is disproportionately short in relation to the number of pages employed in order to make the journey thus far. In fact it has taken me longer to read the book than it did for the whole journey to take place and I am no slouch on the page turning front.THE RETURN OF THE KING: BOOK FIVESo now the Fellowship is well and truly torn asunder and even all the squeaking hobbits have been effectively separated, albeit it for a short while. The funny thing about hobbits is that the less of them there are in close proximity to each other, the less annoying I find them. Book Five sees Middle Earth fighting wars on many fronts. Denethor is fighting his own inner battles as well as looking towards Mordor and wondering what the hell is about to be spewed forth into his realm, The Battle for the Hornburg is over but Rohan still have to make a stand against the Witch King of Agmar. He is taken care of utilising at bit of Tolkien-style \"girl power\" in the form of Eowyn who rides into battle and takes one of the hobbits along for ballast. Faramir meanwhile discovers there are many downsides to being an only son. Gandalf and Aragorn decide to play knock knock ginger at the Black Gate in the hopes that this will allow Sam and Frodo to nip in the back door.THE RETURN OF THE KING: BOOKS SIXOn the way to the top of Mount Doom, Shelob spins Frodo a yarn and leaves Sam carrying the one ring. Cheerfully the orcs are easily distracted by a nice bit of shiny, much like my good self and Sam rescues Frodo and returns the burdensome trinket to him. After this the journey continues with a very long trek to the Crack of Doom (imagine the worst Duke of Edinburgh Gold Award Challenge ever). Despite having a clear idea of the kind of trouble the ring is capable of getting everyone into (1000 pages has got to be long enough to get a clue), Frodo still battles with the idea of chucking it into the firy pit. Cheerfully Gollum steps up and takes care of this for him but not before taking a finger-snack for good measure. Beyond Mordor, Aragorn is crowned king and everyone is soppy as the inevitable man/elf love story reaches its final climax with graceful smiles and sheepish looks (in the film anyway). Back home in Hobbiton, not all has gone to plan and the shire is a shadow of its former self. Evil has also pervaded the shire but now that Bag Ends best known hobbit-warriors have returned it won't be there for long, oh no. Evil is expelled, Saruman is slain and Sam gets the girl.Then there is a lot of happily ever afters, just like it should be."}, {"Review": "\nWhenever my environment had failed to support or nourish me, I clutched at books…-Richard Wright, Black Boy\nIf you want a purely enraptured detailing all of and only of love provoked by these pages, look elsewhere. If you desire an analysis of the fundamental roots of fantasy and how this book fits in within the wider scope of the literary genre, it is not here. If you crave a complete and utter breakdown of all the faults this novel begets on the larger realm of reality, you will be unsatisfied. I have nothing that goes fully one way, or the other, or even some objective mixture of the three. Instead, I have a story. Perhaps you wish to read it.For better or for worse, I never found a home within the house and its mortal constituents that I was brought up in. Mind you, every sort of physical sustenance was assured, and there was never a lack for the more mercantile requirements of a modern upbringing. However, financial stability is no substitute for emotional well being, and my younger self found the latter only through those curiously tied together stacks of paper, often very weighty and filled with all manner of tiny squiggles and the occasional picture. The most powerful of these objects, the ones that granted the sort of comforting balance of the familiar and the novel, were the three battered and yellowing paperbacks of The Lord of the Rings. I have faint memories of my first devouring, but can still clearly recall my feeling of surprised gratification upon watching the 2001 live-action of The Fellowship of the Ring and finding it worthy of the book it sought to portray.I was ten years old at the time, and still had much to learn.For this book of my childhood, this book that formulated my love for literature that has only increased as the years go by, is not perfect. This book spoke as easily as it did to my younger self for reasons of both personal upbringing and dominant culture, the kind of English values and European sensibilities that I am descended from and sways the world in an obstinately oppressive manner to this day. It is not surprising, then, that this novel has proved to be so popular and so overwhelmingly powerful in is influence, to the point of it being credited with spawning the fantasy genre by the more fanatic of its upholders. An unlawful accreditation, to be sure, and a dangerously attractive one, to swallow wholesale the attributes utilized and commended by this one piece of work. A work that, through a combination of its monumental following and easy moralizing, promotes upon the world today a view of life that is vicious in its intolerance of all of those who did not fit within Tolkien's privileged sensibilities.Slowly but surely, I matured from a young child enamored with this single literary achievement into an adult for whom this one work, no matter how lengthy or detailed, is not enough. And somewhere along the way, I had to make a choice. Whether to hold fast to this one work in an everlasting fit of idolatrous sentiment, or to strike out on my own past this one set of pages in search of something more. Whether to reconcile to the work, or to reconcile the work to myself. For as much as the work is treacherous and blind to the wider realities, it was also the origin of my passion for the written word in all its esoteric and long winded forms. To deny that would be to not only deny the history of my self, but also to deny the history of the world entire, a world whose beginnings were not just, were not kind, were not welcoming to each and every soul brought into its plains of varied existence.And so, I love The Lord of the Rings. I love its valuing of the good and the righteous in the larger scheme of things, as well as its caring for the happy and peaceful lives of the small. I love the winding descriptions through hill and dale, over crag and cranny, the swift sailing across the mighty rivers and the painful treks across barren slag, a delighting in the natural world and all its tangible glory that I feel today's modern sense should not do without. I love the page after page of sights, and sounds, and most of all the strains of knowledge threading and shaping their way through every rock and field, the sheer amount of history that this world has seen, the ancient events that have trickled their way down and lead the insatiably wondrous journey for further erudition ever on. I love the fearful superstitions that give way to enlightened respect, the long bred enmities that slowly but surely are broken down into new-found bonds of mutual understanding, the persistent and rarely rewarded effort to restrain from killing when there is a chance of further life leading to something more.What I hate is when those who have read the book seek to impose the letter of the matter onto the experience of every reader, using the book as bigoted shield against the natural progression of time. What I hate is when those who profess to love the work have made such a mockery of loving it that the only humane response to such an outburst is to hate the work wholesale. What I loathe and utterly despise is the poisonous formation of sides when it comes this book and indeed any work of literature, a refusal to consider a book as a mix of both good and bad that can never be fully or easily reconciled in the mind of those insistent on thinking in terms of black and white. Indeed, much of what I hate in relation to this book can be applied to the world at large, still trenchant in fumbling antagonism when those who oppress wonder at the violence of the oppressed, again and again choosing shoddy half measures of solutions cloaked in lies and, worst of all, complete lack of interest in seeing past the lies.I can no longer go back home, to the first opening of these pages that birthed my confidence in finding a place in terms of literature and, indeed, the world at large. If I truly wish to say I love this book, I must reconcile this love to all of that I have learned, and lived, and measure by measure acknowledge the influence of my younger years and the wisdom I will gain in the future that has yet to come. I must come to terms with the fact that Tolkien, this author to whom I owe so much, would likely despise me, a member of that so called fairer sex that throughout these pages was constantly placed on a domestic and debilitated pedestal, a member who has the engraving of the One Ring tattooed upon her back. For he hated to see the image appropriated for wider use, and saw it as a symbol of evil that did not deserve to be venerated for the intricacy of its design or the connotations of its formation.To that I say, too bad. The author created this world out of a passionate love for language and all its myriad veins of influence in the cultures it births and the land it names, and its lengthy prose and detailed care set the stage for my confident desire to discover further works of literature, no matter how long in script or difficult in absorption. The author also created a seductive illusion of black and white, insidious eugenics and obstinate tradition, a full embracing of which would indeed grant much power in the realm where those who love the work congregate in great numbers and often in great ignorance. When Tolkien created the One Ring, and carved out its fiery script on the pages of his monumental tome, he created the true symbol of his beloved Middle Earth, one that may have been destroyed within the pages but lives on in the hearts who prefer a complex web of blindly formulaic undertakings to the true demands of creating a fair and just reality. However, he also called for applicability when it came to the reading of the work, preferring that readers find their own way through the pages in context with their own lives. And, finally, the book ends with the passing of the Age that fueled the pages, and the ending is coupled with the knowledge that the days of this story have ended, and for better or for worse will never come again.And so, I chose a more permanent reminder of the influence that this book has had on me, and do not claim that my interpretation has sway over any others. I simply ask that when reading this work, keep in mind all that has gone into it, as well what has yet to come. Most importantly, acknowledge the differing views and the inherent validity of each and every one, the admirable attributes that are worthy of conservation and the atrocious remnants that must be transformed but whose history of occurrence must never, ever, be forgotten. In short, use well the days.I cannot change the first steps I took in this world of written word that has shaped my life in so many ways, nor would I want to. This love of mine in no way resembles the clean cut symbol of a heart used in so many cards and printed doings, but the incontrovertible yet fragile pulsing of my heart that, for all its bloody ugliness, is my one and only source of living. And, in the effort of living on through many days of hope, and change, reconciliation upon transformation upon ever constant growing, I wouldn't give it up for the world.\nThe Road goes ever on and onOut from the door where it began.Now far ahead the Road has gone,Let others follow it who can!Let them a journey new begin,But I at last with weary feetWill turn towards the lighted inn,My evening-rest and sleep to meet.Still round the corner there may waitA new road or a secret gate;And though I oft have passed them by,A day will come at last when IShall take the hidden paths that runWest of the Moon, East of the Sun.\nHome is where the heart is. And, here, I shall ever return."}, {"Review": "Every reading journey has a beginning, even if that beginning comes across as lame as hell in the retelling. My beginning with this particular book occurred on a wedding anniversary date. I was a few cran and vodkas over the limit and had decided that a nice leisurely stroll through the bookstore would help clear my head before venturing on to our next destination, the grocery store. Yes, you read that right. My anniversary date celebration consisted of booze, books and groceries. I’m pretty sure if you google anniversary gifts by year for the modern working couple with children you will see this exact scenario listed under year sixteen. If it isn’t there I vote it should be because silver hollowware, who actually wants that?ANYWAYWhen I happened upon this ginormous book in all of its leather bound glory I knew that I had to possess it. I realized that buying it would force me to read it sooner than later and it was a book that had lived on my mental to-read list for a very long time. What I didn’t consider was the size of the book and how difficult it would be for me to lug it around everywhere I went. Sober me would have thought of this and went for the story broken out across three books instead of one. Tipsy me saw the fancy binding, smelled the pages and could care less about my future suffering. I saw my precious and nothing was going to stop me from making it my own, especially not commonsense.My reading stretched on for weeks on end and every day the book got heavier and more cumbersome (if you aren’t singing 7M3 right now then you can’t call yourself my friend). A few chapters in and I decided to get a tote to make my traveling easier and to protect my precious from rain, stains and torn pages. I was Frodo and the tote became my Sam. Without my durable new friend I would have been miserable and it would have taken me a hell of a lot longer to finish one of the best stories I have read in a while. I also wouldn’t have been able to enjoy the characters I had fallen hard for in all of the various locations I was able to visit because of it. Exciting locations such as the doctor’s waiting room and a hotel room in Texas, to name a few.Five stars to a book that taught me to appreciate epic journeys and all of the friends you might find along the way and zero stars to a specific edition of that same book that taught me not to visit the bookstore under the influence of alcohol. (Just kidding, the book is gorgeous and it makes a great new addition to my real bookshelf.)"}, {"Review": "Ima taj jedan pisac, Tolkin se zove, i on je napisao to neko delo... ...... Nema smisla puno pričati. Gospodar Prstenova je roman koji je zacementiran na svojoj poziciji klasika, i u žanru i van njega, i to sa valjanim razlogom. Iako jeste svakako malo lošije omatereo - nije više to ta griva kose, plus hoda malčice nakrivo pa mu džaba što je visok 2m - što se najviše ogleda u uštogljenom dijalogu, ovo je i dalje potpuno fascinantno štivo sa više tačaka gledišta, ali ona glavna, sa koje se vide sve ostale, svakako je svet. Jer Srednja Zemlja ima potporu bar koliko i ova naša (ako se pravimo da to nisu dve iste zemlje – kao što sam Tolkin reče, „Srednja Zemlja je ništa drugo do naša matična planeta – ali u drugoj eri mašte“), što je upravo ono što isparava sa stranice. I ono što toliko opija. Prvi put sam pročitao Gospodara u petom osnovne, dakle sa circa 20% razumevanja, pa iako nikad ikad nisam čitao ponovo već pročitane knjige (greota, kad ih je toliko različitih) još od doba dnevne konzumacije Hari Potera, ovu sam morao. I svašta sam novo otkrio. Elem, u crticama:- sećam se da mi se ranije nimalo nije dopadalo što su knjige podeljene po principu frodo+sem – ostali, ali sada mi je zapanjujuće lepo leglo; lepše je provoditi duže vreme sa jednim asortimanom likova, bez ’cik cak nabijam tenziju’ mahinacija, bar za ovu vrstu priče - mislim da se Tolkinu premalo počasti odaje kada je reč o karakterizaciji: Frodo je potpuno tragičan junak; Gandalf je neverovatna skladna kombinacija nespojivog - autoriteta i harizme; Teoden je ono što čini ljude dobrim; Meri i Pipin su šegačije sa dušom ispod one-liner-a; a Gimli možda ima i najveće srce – a svakako najviše voli (Galadriel+Gimli je ono što su svi hteli da vide, a ne Aragorn+Aruen); jedino što mi je Aragorn tu malo mršav, tojest nije mršav jer onda ne bi bio savršen, ali svakako mi se više dopada karakterizacija nevoljnog kralja (koja je u knjigama očito izvorno Frodova – nevoljnog junaka, dok je u filmovima karton koji se prenemaže i ima lik Ilajdže Vuda) nego savršenog kralja, ali što je tu je- takodje, Tolkin ume da izvuče emociju na skoro pa nimalo sentimentalan način, nešto što je izbledelo sa vremenom; danas je gotovo sve sentiš do bola - prava kulminacija trilogije je, sasvim zaslužno, povratak hobita u Okrug- razlika izmedju filmova i knjiga čini mi se da je u fokusu – gde se film fokusira na akciju, u knjizi je ona neretko nabijena u paragraf; Tolkin je više zainteresovan da oživi svet koji naseljavaju njegovi junaci na svaki mogući način i to nikad ne davi- vrlo me je iznenadila količina referenci na Silmarilion kojih se, sasvim logično s obzirom da onomad još nisam znao ni za postojanje istog kao knjige, nimalo ne sećam- ne znam šta više da kažem, ali evo još jedna crtica: knjiga se manjeviše završava tako što Gandalf ide da popuši koju lulu sa Bombadilom I tako. Jedno poglavlje u mom životu, ponovljeno. Može se reći i – zasluženo. 5"}, {"Review": "I was forced to read this book. Each member of my first book club had an opportunity to choose the book we read. When one of the members chose The Lord of the Rings I was not happy. Fantasy is not my genre! But I was a good book club member and read it anyway.I loved it! There were times when I did not want to sleep because I wanted to finish just one more page or chapter. Tolkien creates whole worlds, languages, species, and histories. It is epic in its scope. Somehow he manages to entertain, make you think, and visualize the world he describes. It taught me a lesson about being open to new things, because sometimes by being open you can be richly rewarded."}, {"Review": "My full review has been moved over to my website, and in its place I have left a defence of the novel itself. If you would like to read my review please click the following link: My review of J.R.R. Tolkien's, The Lord of the Rings.The Lord of the Rings was the book that created my love of literature when I first read it at the age of twelve. Certainly I was a precocious reader beforehand and The Chronicles of Narnia and The Hobbit have much to be thanked for also. However it was The Lord of the Rings that pushed me onto a path of epic fantasy and grand classics. Without it I would no doubt have avoided Ulysses and Crime and Punishment - works of equal importance. For in my eyes The Lord of the Rings is a great and versatile work. It has a riveting story - a story so compelling and so punctuated with themes that it demands a re-reading from me, time and time again. It has poetry and imagined history of the type that many aspire to recreate, and yet no one can. For there is only one Lord of the Rings and it does not share power with other aspiring fantasy works.To finish therefore, I will briefly attempt to answer the critics of this monumental work. Not in a manner that is in any way conclusive or exhaustive, but in a manner that satisfies my cravings. For I find there is much in The Lord of the Rings that is often overlooked nowadays - due in part to changing attitudes to fantasy, fiction, politics, history and the many Tolkien clones and fantasy movies available. The biggest criticisms of Tolkien can all be found in the one source, in Michael Moorcock's essay Epic Pooh. His essay begins with a fascinating quote by Clyde S. Kilby which begins: \"Why is the Rings being widely read today? At a time when perhaps the world was never more in need of authentic experience, this story seems to provide a pattern of it.\"The final statement of this quoted paragraph is exceptionally revealing however: \"For a century at least the world has been increasingly demythologized. But such a condition is apparently alien to the real nature of men. Now comes a writer such as John Ronald Reuel Tolkien and, as remythologizer, strangely warms our souls.\"This quote also brings us to the first criticism made by Moorcock (keeping in mind that Moorcock to me exemplifies the overall criticisms made by many about fantasy and The Lord of the Rings as part of that). He writes that: \"The sort of prose most often identified with \"high\" fantasy is the prose of the nursery-room. It is a lullaby; it is meant to soothe and console. It is mouth-music. It is frequently enjoyed not for its tensions but for its lack of tensions. It coddles; it makes friends with you; it tells you comforting lies.\"To Moorcock, Tolkien's work is both overly romanticised and escapist all at once. He links success with the fact that the novels appeal to what people want to read, not with what they should read. Yet to state such is to me a form of cold cynicism. I do not believe that comfort is what appeals to the reader solely however. There will always be a degree of this, yet I perceive that readers look for works which contain at their heart a story and characters that appeal to them. It is in these areas that success is grown. Interestingly Moorcock mentions Watership Down at the same time as discussing The Lord of the Rings and both books are strong because they have characters which touch the reader. They are not in any degree comforting, because they contain frightening ideas and realities within them. Yet what they do is to show the reader truths about inner strength and the ability to overcome darkness, tragedy and minor defeat. All of which can sound like idealism or naivety, yet fiction allows us to do such a thing - to perceive an idealistic view of what we can be.Moorcock writes on, however, and mentions that Tolkien uses his words \"seriously but without pleasure.\" Yet this misses much of what and how Tolkien uses words. Certainly one can see how on the outside it could be seen that Tolkien has a sort of unconscious humour and writes without pleasure, but a linguistical analysis of the words and names shows that deeper down, within the roots and origins of many words are humorous ideas. For instance hobbit comes from old english words meaning 'hole' and 'dweller'.Another of the criticisms levelled against Tolkien is the existence of \"ghastly verse\". Indeed, many people I know complain about the poetry in The Lord of the Rings as a childish distraction. Yet I find it one of the more appealing things about it. It conveys a sense of the work existing as a form of traditional storytelling and grants the tale a greater sense of organic development. And indeed, Tolkien's verse is hardly ghastly but has a rather melodic rhythm all it's own.Of course Moorcock's arguments against Tolkien's verse go further into other areas such as that the existence of what he calls 'allegory' ruin the artistry of the book. And yet, for all such claims, Tolkien's work is one of great artistry. An artistry of natural surroundings - hills, trees, rivers and all forms of beauty painted with words. That is not to say that Tolkien writes like some writers, but there is a simple elegance to his work, more often found in his descriptive power.\"Writers like Tolkien take you to the edge of the Abyss and point out the excellent tea-garden at the bottom, showing you the steps carved into the cliff and reminding you to be a bit careful because the hand-rails are a trifle shaky as you go down; they haven't got the approval yet to put a new one in.\"Of course, in the end Moorcock's writing comes off as nothing but a pretentious work that has nothing better to argue than 'it's all silly and poorly written.' It's rather subjective, though he makes the powerful argument as to whether we should consider such 'pulp fiction' among literary greats. I believe that it deserves a spot among them for its influence and what it achieves on the whole. For Tolkien's work is not one which performs according to the above quote. It does not coddle the reader as Moorcock says, nor does it glorify war. Instead it reveals the reality of darkness, power, depravity and doom. It shows us that where there is darkness we need not accept that darkness then, that we can choose to believe in the good that flourishes in the most unlikely places. In the tea garden at the bottom of the abyss - to use Moorcock's metaphor then...What I am essentially arguing is that superficially The Lord of the Rings is nothing more than a silly idea. A work of fairies and elves - a book for children, idealists and other times. Yet underneath such a story, as with all fairytales, is a sense of something greater. This something is to be found with a sense of wonder, exploration and a willingness to look beneath the surface. I believe this is why Tolkien loved his hobbit creations so much. Because in them is represented all that The Lord of the Rings is: an unassuming face, harbouring great inner quality."}, {"Review": "Out of the wreck rose the Black Rider, tall and threatening, towering above her. With a cry of hatred that stung the very ears like venom he let fall his mace. Her shield was shivered in many pieces, and her arm was broken; she stumbled to her knees. He bent over her like a cloud, and his eyes glittered; he raised his mace to kill.One of the best books ever. Stirred the embers of more imaginations than can be measured. Found a way to reach something vital but ineffable inside millions of different souls. Presented the world with Sauron, his Nazgûl, and the Balrog to tip the scales of evil; Gandalf, Galadriel, and the stalwart gentlehobbit Frodo to lend ballast to those of good; whereas, with Tom Bombadil, who really knows what trippy trail that earth-bound spirit is blazing: and who the can top all of that? It first spoke to me when my fantastic fifth grade teacher chose The Fellowship of the Ring for our classroom reading period, and I've never looked back.There are curiosities that abound within the trilogy, not least in that the opening chapters of The Fellowship of the Ring would not be out of place as a direct sequel to The Hobbit, whereas by the time we have reached Rivendell, the entire tone of the book has been altered: become more adult, more serious and darker, possessed of a sense of finality and portents of an end to wondrous things that comes to permeate the remainder of this questing original. By the time we get to the Scouring of the Shire at the close of the third book, it is understood that even the bucolic goodwill and perduring staidness of the Hobbit realm has been stirred, shaken, even broken in parts, and cannot go back to what it was. What's more, with every subsequent reading I found it more difficult to accept that the Nazgûl failed so miserably in their great and urgent task of taking back the Ring from Frodo, even with Strider/Aragorn in the picture; that these ferocious sorcerer-spectres were driven away—all nine at once, mind, which few men had ever proven able to withstand—with the Ring well within their grasp, well, it truly tests my suspension of disbelief. With that said, though, how many other parts of the story fail? Precious few, I think, particularly within the context of a transitional world linked to the ancient and primordial past only by the maintenance of Elvish magic, and that contingent upon the very survival of the One Ring that they would most wish to see utterly unmade. The trilogy represents a final outreach of the elder races ere the full and overwhelming dominion of Man; and the evil incarnate within such demi-gods as Morgoth and Sauron, its essence imbued within the very earth itself and permeating the susceptible souls of the new ruling race of free-choosing (and hence, free-damning) mortal (wo)men will in the future prove just as effective a corruptive and destructive force without the dominating presence of an avataric darkling lord to wield it from a centre of power. But what interests me these days, more than the well-known story itself, is trying to suss what constitutes the enduring spell that TLOTR casts upon its legion of readers, whether experienced hands or rookies new to its peculiar fantastic delights. Is it a yearning to escape a world of routine and rational technodemocracy where everything seems sullied by the pursuit of the dollar and tomorrow will be but a twin of today, which was sibling to its brethren of the day before? A world absent of miracles and beauty that stirs the very body to fealty? Where lawyers abound to clarify the legal implications of every action that falls outside of the commonplace or expected? Where the rich are not bound by a noblesse oblige to fight to protect those who labour on their behalf, but hire those selfsame workers to do the fighting for them? Where the powerful rules that uphold modern science can be replaced by naught but the mystical exertion of a rich spirit's will - a Nietzschean surmounting of the barriers to controlling the energies of a nature that, to us, seems distant and out of sync? Where things like honor and blood ties bound people together with a lasting surety and strength that would be incomprehensible in our modern fragmented neighborhoods, where you can wander through blocks of crammed apartments and dirty houses without meeting with a single smile or nodding acknowledgement? Where evil, though ever lurking to tempt men away from the path of truth, could be traced to its roots in the rebellious uprising of cosmogonic spirits, blackened godlings whose lusts for chaos and dominance seeped into the human psyche through a process of corrupting what, in its original nature, was pure and fulgent? Beats me - but it's got to be something, because Tolkien's trilogy is one of those rare books that, it seems, will never be in danger of being removed from the presses.In an irony-drenched and übersceptical postmodern civilization it must strike many as absurd that there exists an insatiable demand for this tripartite tale penned in the manner of an irascible, waddling county squire whose tropes and forms—slavishly reworked and rehashed in the reams of fantasy fiction that has been churned out since its initial publication—hearken back to the foundational mythologies of patriarchal oppression, class division, and romantic irrationality that it was both hoped and expected the postwar years would have superseded. I've read critiques from the likes of Moorcock - \nEpic Pooh\n - and, while able to understand why he dismisses it, simply cannot manage to summon any commiseration for the repugnance he feels. First and foremost, the tale grew out of the imaginative legends Tolkien had concocted as backdrop for his linguistic creations—and coming as he did from a proud and tradition-bound Roman-Catholic background; and pursuing as he did his studies in the philological field of Anglo-Saxon language and literature; and enjoying as he did various ancient and medieval mythologies and the fantastic weavings of influential forbears such as Dunsany, MacDonald, and Eddison; well, can there be any surprise that his brilliant questing trilogy evoked calls to Welsh faeries, Norse dragons, Scots trolls, Finnish hunters, comfortable and sturdy Midland farms, Gaelic heroes, and a loving but distant God beyond a host of angels whose essence devolves downward? It is hard to fault the man for pursuing his own personal passions and visions and putting them into a textual form for which he expected, at best, a modest return—why not swing, rather, at a public that—from the very first printing—lapped it up with all the eagerness of a thirsty tribe wandered in from an exodus amidst a particularly sere desert?And therein lies the rub: it galls such as Moorcock that one generation after another yields en masse an avid affection and enthusiasm to what he considers a frivolous and archaic bit of stuffiness and prudery and dusty parochialism set to the service of an aulde England of division and oppression that it would be far better to have left behind. He wonders, as do others, at what can be hale about a tale that deftly avoids anything beyond the faintest intimations of sexuality and, for the most part, relegates women to a gender-specified subservience and passivity as Middle-Earth window-dressing; that appears to embrace the pernicious prejudice of the inherent superiority of white North European culture; that avoids any avowal of the economic, religious, or political structures and systems that must inevitably have been at play and working their damaging and divisive effects upon such a vast civilization; that fluffs and puffs with trite, sentimental songs and portentous magic and heavy-lidded memories the better to disguise the utter irrelevance and unseriousness of what is unfolding, the priggish and confining morality that puts everyone in their place—bowing to the gods and to one's social superiors—whilst upholding the aristocratic warrior as the virtuous ideal; that separates good and evil in a manner that provides a comforting and ready accounting for the myriad ills of the world, but which actually trivializes these ethical issues, especially in an age that witnessed the horrors of the holocaust and communist purges.How can this be? How can an enlightened and post-capitalist postwar society continue to be enthralled by an updated version of timeworn mythologies—the latest of which ripened during the Dark Ages—shaped with the hammer of mothballed and morbid uppercrust morality of the sort that harumphs conspicuously and comes bearing bow-ties? Perhaps for some of the reasons I listed at the start of this review. Escapist fare has always been popular, but there seems to be as much, if not more of a hunger for the fantastic the more the trappings of the latter fade from our view. Modern society is one bound to the clock, ofttimes divided and parceled out down to the very minute; one in which we spend hours every day idling in a car, riding an elevator, waiting in queues, sitting at a desk, pushing a cart, with productivity and efficiency forever on the increase and a sense of who we are, where we are going, why we are on that journey, what we are meant to accomplish along the way and how we are to achieve these goals—with the very knowledge of our mortality, the ephemeral nature of all our achievements, staring us full-on in the face even when we deign to look away—eludes our grasp like the mists wafted forth on a humid spring morning.To be taken away to an invented world wherein everything serves some manner of purpose and greater goods actually carry an immediate import and eternal consequence, where the enemy is implacable and can be neither appeased nor reasoned with but only defeated—Nazis in cloaks and armed with swords—and magic is suzerain over realms where twentieth-century science holds sway, where love is inflamed within the arterial passions of the romantic, perduring and encompassing though it progresses within tropes of courtship and calling interwoven with the streams of fate, where petty beings from the outliers of a world contested by mighty powers prove the enduring significance of the strength and fidelity of the individual will over seemingly stronger currents sourced within the misty recesses of time and bearing loftier lineages, where the freedoms cherished are not those currently stressed and promised by our political professionals and the bonds of honor hold straighter than those we perceive in our own lives, where those in power, though bowed beneath the weight of shadow-laden years, might yet endeavor to do what serves the world and not just their immediate self-interest; all of this must carry some powerful, primeval attraction that—combined with the aesthetic and geographical wonders of a travelogue, the eldritch presence of creatures and beings sown from human myth and fertilized by the author's potent demiurgical imagination, and the thrilling suspense of a chase/race to potentially the most apocalyptic of ends—finds a way to reach that part of the mind where such fantastic delights serve as satiating fare, and in which this popular escapism can be engirt with a morality now out of fashion but held necessary to burnish the imaginary with the gloss of both the good and the real—not to mention the fun."}, {"Review": " Il viaggio della vita Indescrivibile l'immersione in un mondo pulsante di vita e potenzialità di esistenze; di leggende che riverberano dal passato e si proiettano in epoche che mai vedremo né contempleremo neanche con la forza del pensiero.L'abbandono del proprio nido famigliare, porto sicuro che protegge dai tumultuosi mari dell'ignoto, dischiude un mondo in continua evoluzione che muore e rinasce nel perpetuare dei secoli.E si combatte il male con il poco che si ha, passo dopo passo e scelta dopo scelta, con la resistenza di chi non può e non deve scendere a compromessi; una lotta che logora nel profondo e si annida in noi, per ricordarci eternamente il prezzo della meta e l'importanza del percorso sostenuto per raggiungerla.Assodato che Tolkien stesso rifiutasse allegorie e metafore di qualunque tipologia (la letteratura, in sé, non cela necessariamente fini morali o necessità di critica), la rielaborazione profonda e stratificata della mitologia nordeuropea - in misura minore celtica e irlandese - diventa esercizio di riscrittura di una personale epica capace di plasmare un mondo a sé stante, esistente tanto quanto il nostro: genealogie capillari e ramificate, lingue e pronunce, susseguirsi di ere e una mitologia interna da cui la stessa storia attinge per mettere in moto la narrazione sono tutte caratteristiche che rendono \"Il signore degli anelli\" un'opera cardine della letteratura, non classificabile nella ristretta etichetta fantasy.Se, per mia personale inclinazione, sono oramai quasi tre anni che considero Il libro Malazan dei Caduti l'opera fantasy preferita per modernità di prosa e contenuti affrontati, serve onestà intellettuale nel riconoscere a Tolkien l'indubbia paternità di stilemi all'interno del genere e, aspetto ancora più importante, un metro di paragone forse definitivo nella rigorosità del worldbuilding.Pietra miliare."}], "Image": "https://images.gr-assets.com/books/1547450792l/33.jpg", "Desc": "One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind themIn ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins.From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings to him, but always he searched for the One Ring that would complete his dominion.When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom.The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider."}