{"Name": "Once a King", "Image": "https://images.gr-assets.com/books/1518448047l/37570601.jpg", "Reviews": [{"Review": "This is everything I love about YA fantasy! The story takes place after the events of Ever the Hunted and Ever the Brave, but you don't necessarily need to have read those first. (Obviously it would make this book more fun because a lot of familiar faces are back... but you could still follow and enjoy this story on its own!)The book description's well done, so I won't add much to that. The story's told through the split POVs of Lirra and Aodren, both of whom have unique personalities that totally come through. The writing is strong and engaging, the world is vivid, and even the side characters felt like real, endearing people. The plot has everything I want to see in a YA fantasy book, but then goes so much further with a really lovely, timely message in Aodren's vision for his kingdom's future. This is a more optimistic story about a group working together towards a greater good (instead of focusing on their own self-serving vengeance, etc), so I totally recommend it!Thank you to the publisher for sending me an ARC."}, {"Review": "Together, two unlikely allies will try to bring in a new world of peace and trust while righting the wrongs of the past. As the young king, Aodren and a young channeler, Lirra struggle with their emotions, the political machinations of the kingdom and the people’s fear of magic in any form, they will uncover who is behind the black market version of a magical healing potion. But will they be in time to save its victims?Told in two POVs, Erin Summerill takes us into another world in ONCE A KING where we can get lost in a story so well-told, we can forget this isn’t real. Wonderful characters, good, evil and misguided will take center stage in scenes that are vibrant and alive. The tentative friendship between Lirra and Aodren is so positive and so realistic, especially when their misunderstandings or misconceptions lead to personal enlightenment and trust.If you like characters that work against the odds for a brighter future and acceptance of all, this tale is sure to have you, hook, line and sinker! Definitely can be read as a standalone to this series, so newbies like me can sit back and never feel lost!I received a complimentary ARC edition from HMH Books for Young ReadersExpected publication: December 4th 2018 by HMH Books for Young ReadersSeries: A Clash of Kingdoms - Book 3Publisher: HMH Books for Young Readers (December 4, 2018)Publication Date: December 4, 2018Genre: Fantasy YAPrint Length: 464 pagesAvailable from: Amazon | Barnes & NobleFor Reviews, Giveaways, Fabulous Book News, follow: http://tometender.blogspot.com\n"}, {"Review": "2/12/18Cover reveal and synopsis has been shared, my friends! Can't say I'm in love with it but it is reminiscent of the original duology. Although I do like the bit on the cover that says,  \"One secret can corrupt a realm\" Also, my boy Aodren is in fact back! Along with Lirra, who I also liked from the original, so hopefully, this will be better than its predecessor. \nSidenote: I feel an Aodren and Lirra pairing coming on, and I'm game. ---OMG, is my dear Aodren finally going to get a story all his own? If so, then I am 100% in. He was the only character I fully enjoyed from the previous series."}, {"Review": "The nation of Malam has been divided for years as its people without magical abilities oppressed and harassed those who are magically gifted called Channelers. Now that there is a new king, the young King Aodren, the nation finds itself standing at a crossroads. King Aodren wants to reunite the people of his country, but cannot do so alone. His people, on the other hand, are still wary of one another. Luckily Aodren gets unexpected help from Lirra, a girl who has every reason to fear standing up for Malam but does so anyway. Once a King is the third book in the A Clash of Kingdoms series. For some reason, this was something I overlooked and I read this book without having read the previous two books. It turned out that you can do that easily. Other than a few remarks from the characters to the events in the previous book this book tells a solid story of its own. The main characters Aodren and Lirra are well written and feel natural because they are not without flaws. The supporting characters, on the other hand, left me with some questions. I think this is mostly because I indeed did not read the previous two books, but I think that especially Orli could do with a fourth book. The story itself might be a bit cliché. I mean, revolution, an evil villain who tries to prevent the revolution, and a romance are the main themes. Also, it was halfway through the book when I was sure who the villain was going to be, and this indeed proved to be the case. Yet, it was worth reading and I even shed a few tears at the end. I received a digital review copy of this book from Netgalley in exchange for an honest review. All opinions are entirely my own. My review is susceptible to changes in the final copy of this work. My rating for this book is 4 out of 5 stars. Highly admirable that the third book in a series does so well on its own! "}, {"Review": "I loved this book! Full review to comeUpdate: 12/5/18-\nFIVE STARS!\nYou know those books where you enjoyed them so much and then a sequel or spin off comes out and you think to yourself \"there's no way this can meet my expectations\"? Well that was me when I heard that the Clash of Kingdoms series was getting another book. I was both excited and nervous to read it. I'm not going to lie, I basically begged for an early copy of the book. Like I said, I loved the first 2 and couldn't wait to read ONCE A KING. Nerves and all! The publishers were gracious enough to send and advance copy in exchange for an honest review.\n\"If you want to bring about change, all you need to be is a voice. A voice loud enough to start a storm.\"\nAodren was one of my favorite characters in the Ever the Hunted/Brave books and I was thrilled to find out he would be getting his own story. ONCE A KING picks up shortly after the ending of Ever the Brave. Still adjusting to his new leadership role as king of Malam, Aodren has a lot to learn. All the kingdoms gather for The Tournament of Champions, hostility rises when the kingdom is plagued by a dangerous and sometimes deadly drug, created from magic, known as Sanguine. A drug that is supposed to have extraordinary healing properties. Aodren, requests the help of Lirra, the archtraitors daughter and a Channeler, who may have valuable information. I found the tension, witty banter and relationship between the new king and Lirra to be quite entertaining. Lirra holds a grudge against King Aodren for the sins of his father, while Aodren is simply trying to right all the wrongs done to her and others like her.\n\"There isn't one of us whose kingdom has a spotless history. My people's shame is merely more recent.\"\nONCE A KING is a story in a medieval setting, full of magic, suspense, action and political intrigue. The book is written through dual POV's which I always thinks adds depth to a novel. The pages are filled with Erin's fantastical storytelling and beautiful prose. There was enough mystery to keep me turning page after page, desperate for more. Easily one of my favorite reads this year and it left me with a terrible book hangover.\n\"Hate never listens to new laws\"\n"}, {"Review": "This was by far my favorite in the series. I know it’s technically a spin-off from the first two books, but it felt more like a final ending to the series. I think I also liked this a lot more because it was about my favorite character, Aodren. I loved him and I was glad to see him fight for his cause for peace. That and I liked that he had a love interest that wasn’t just one sided. He needs some love in his life, haha. Overall, I felt this was a good conclusion to the loose ends from the last book, Ever the Brave. I also loved reading about my favorite characters Aodren and Leif again. "}, {"Review": "I ADORED this book. How can one not fall with King Aodren and Lirra? They are both such great characters that I helplessly fell in love with. I SHIP THEM ALL THE WAY, OKAY? As someone who never agreed to Aodren being with the other character from Ever the Brave, I am super glad Erin Summerill had other plans for Aodren. BUT NOW I NEED MORE. I need more of Lirra and Aodren, it cannot possibly be the end!!! And I *think* there might be more so YAYYYYY.To keep it short and sweet: READ ONCE A KING. Don't pass up on this book, please! It's totally amazing and fun and swoony. I fangirled throughout the book and I know many will love it too. ♥♥♥Full review to come soon. I SWEAR. "}, {"Review": "Once a King by Erin Summerill leaves off where Ever the Brave left off. With King Aodren in control of the kingdom, he works to fight off the reputation his father left behind. Lirra, a channeler with the power to control the wind, finds her life entangled with King Aodren's. They must work together to forge a new path in a divided nation.Unfortunately I was woefully disappointed by this book. I really enjoyed Ever the Brave, but Once a King felt shallow and uninspired. I had a time engaging in the story, and I found myself clock-watching while reading it. The pacing was okay, but since the story felt so simple, I never got hooked.The story concept was interesting. I like the idea of channelers and the divided nation. Aodren had a lot to overcome to put to rest his father's legacy, and he puts a lot on the line to win the faith and loyalty of both sides.Lirra's role in the story and her job as an assistant to her father could have been developed further. It was an intriguing concept but lacked depth. I wanted to know more. I wanted more subterfuge, more mystery, more nefariousness. Her character could have been rich and interesting, but she came off as rather blah.The ending was fine. It was a typical fairytale ending. It wasn't a knockout ending, but it wasn't bad either. The characters in general were mediocre. I would label them as standard off-the-shelf characters. Nothing set them apart or made them unique. They were just kind of there.Now, if you've read the other two books in the trilogy, of course I'm going to recommend you read this one. I like closure, and I can't not read the last book in a trilogy if I've already read the first two. If you've never picked up this trilogy, my recommendation is on the fence. It's not bad, but there are other (more exciting!) young adult fantasy trilogies out there.Thank you to NetGalley for providing the Kindle version of this book in exchange for an honest review."}, {"Review": "*Source* Publisher*Genre* Young Adult, Fantasy*Rating* 3.5*Thoughts*Once A King, by author Erin Summerill, is the third installment in the authors Clash of Kingdoms series. For those who have not read Ever the Hunted, or Ever the Brave, this story actually takes place shortly after the end of the second book in the series. The story is told through the split narratives of Lirra Barrett and Malam King Aodren, both of whom have unique personalities that totally come through. The chemistry between Aodren and Lirra is electric. Readers will love their building tension and slow-burn romance.*Full Review @ Gizmos Review*https://gizmosreviews.blogspot.com/20..."}, {"Review": "4/5 Stars!I received Once a King as an e-galley from the publisher via NetGalley.I liked that the story of Once a King takes place so soon after the events of Ever the Hunted, yet does not include Britta. She is mentioned a couple times but isn't in the book. Which I think was a great idea to have her off on her own enjoying her happily ever after.At first I wasn't the biggest fan of Aodren but as the story progressed I started to like him more and more. I liked that even though he's a long he's fighting his own battles. And working on fixing the chasm of division with the people in Malam.I think the best part of Erin's writing is how well she makes sure even the side characters are humanized and that we actually feel for them, even if they have tiny parts.I do highly recommend you read Ever the Brave and Ever the Hunted first, and I would recommend this book."}, {"Review": "Set in the same world as the previous books in A Clash of Kingdoms series comes a new adventure featuring everyone’s favorite king! Get ready to swoon, scream, and cheer because King Aodren and Lirra are here to fight for both the people they love and readers’ hearts.\n\"I tell my boys that the dark is nothing to fret over. It's just the light wearing a thick cloak.\"\nOnce a King begins right where Ever the Brave left off, but don’t worry this is considered a standalone book. Having read the previous books in this series, it did make it easy for me to fall back into this world and even enjoy characters that get mentioned. I loved both King Aodren and Lirra from the previous books so I was stoked when I heard that this would be told through their POVs!\n\"If you want to bring about change, all you need to be is a voice. A voice loud enough to start a storm.\"\nLirra is confident, independent, and driven. She’s a Channeler (women who have influence over one energy it being land, air, fire, water, or spirit) who can control the wind. She has dreams of performing in this year’s jubilee during the summit where all the kingdoms come together to show off her glider invention. But unfortunately, her father who is Malam’s Archtraitor, is currently in the business of selling secrets and Lirra has a duty to help him with it. She is incredibly loyal to the people she loves so of course this causes conflict in her life.\n\"The man has flaws, but his appearance is definitely not one of them. His irritatingly perfect face may as well have been carved from an artist's marble.\"\nThen there’s King Aodren. My precious Aodren. He’s the youngest ruler and after the events from the previous books, he’s now left to unite the people of Malam. How can he get his people to accept Channelers after decades of being prejudice towards them? I loved reading from Aodren’s POV because it was touching how much he truly cares about all his people and how he only wants the best for Malam. He is such a pure character.King Aodren and Lirra’s lives eventually intertwine and with each other’s help they hope to fight for what they want in life and the people they love. Their chemistry is unreal, too. I was a little curious of how they would mesh when I first heard about Once a King, but the romance was perfection! It was honest, real, and the slowest burn.\n\"It feels like we are two damaged ships at sea amidst a swell threatening to sink us, when all we really need to survive is each other.\"\nThere is plenty of schemes, action (a lot of fun scenes once the summit begins), and magic! The plot was a lot more fun than previous books as well. Erin Summerill’s writing has grown since I first picked up Ever the Hunted. There are great description and the characters in this book were relatable. I love when an author’s writing can make me feel as if I’m on an adventure with friends and that’s exactly what Summerill did for me.Overall, I really enjoyed Once a King! Everything wraps up nicely, not too outrageously perfect but satisfying. I wish I could have spent more time with Aodren and Lirra! The message behind Aodren’s hope for the future of his kingdom was inspiring. I just loved it all. If you’re in the mood for a great fantasy story with fun characters then pick this book up.\n| review originally posted on Bookstacked |\n"}, {"Review": "MY THOUGHTS:I received this book in exchange for my honest review.A kingdom afraid of magic. People at odds. Peace is greatly desired. Although this book is set in a world visited twice before by the reader, and the characters are the same as the first and second book, this book reads well and can be thought as a standalone.A perfect book for people who like a happy ending after main characters struggle through challenges and despair. The author has a great way of telling stories and a strong voice used from cover to cover.Excellent world-building and perfect character arc development–well fleshed out and solid in understanding their goals and growth. The premise is one that has been done before with a few tiny differences, but it’s effective in smooth transitioning from one plot element to another. World-building is really great and I enjoyed learning more about it. Overall, this is a character driven plot."}, {"Review": "A Clash of Kingdoms book (number 3).Aodren, the king of Malam, is trying to keep his kingdom together, but years of hate and prejudice against channelers (women with magic) are hard to overcome. He thinks a win at a tournament between kingdoms would give his people something to rally behind.Lirra is the daughter of the Archtraitor of Malam, once a noble, now a spy. Lirra helps her father with his business, but is upset when he keeps a secret from her... a secret about a new channeler oil.What I loved:💙💙💙1. Lirra is spunky, sneaky, and smart. She’s determined to find out everything about the new oil.2. Aodren is a young king who is trying to do the “right” thing which makes him sympathetic.3. The romance is predictable, but also delightful. 4. Strong female friendships with well-developed secondary characters.5. The mystery and the twists... who is creating/distributing the oil and why? An immersive new adventure in a great series! "}, {"Review": "Although they are calling this the third in the series it is really a stand alone set in the same world as the Ever the Hunted books. Which was a good thing, because I had not read the other two books. Didn’t realize it was set in that world until I was ready to start it. So you can trust me when I say that you don’t need to have read the other books to enjoy this one. The book is told through the alternate viewpoints of Lirra and Aodren. They are both solid and likable characters. Lirra is a wind channeler and also a sort of spy with her father. She has to take a message to King Aodren and thus begins their adventure together. Lirra is a pretty strong female character who loves her family and her country. Aodren will do anything to help his country heal from their violent past and war. I like him a lot, he was a strong king, but always had his doubts that he was doing the right thing. He often talked about the loneliness of being the king, which I thought was an interesting take. The plot was a little bit mystery and a little bit adventure with a little romance thrown in. It was pretty fast paced and easy to read although a bit predictable. I could have used a bit more of an explanation about the Channelers and their magic system, it was not well explained, although I did figure out that it was elemental in nature. I know this is the third book, and all of that information was probably in the first two books, but because this is a stand alone it would have been nice to get a bit more info. The magic doesn’t play a huge role in the story, but it was important enough that I wanted to understand it better. Overall this was a very enjoyable read, and if you have read the other books and liked them then you will like this one too. And if you haven’t read the other ones, this one will still entertain you. https://elnadesbookchat.com/"}], "Genre": "Fantasy", "ID": "37570601", "Desc": ""}