{"Name": "Fire and Heist", "Image": "https://images.gr-assets.com/books/1521157827l/23510085.jpg", "Reviews": [{"Review": "This has been receiving somewhat middling reviews and I understand why - it's a book that sort of reads like a sendup of fantasy tropes and sort of reads like a book leaning into those tropes, and can’t quite figure out where it’s going. I, however, really enjoyed my experience reading this, and sped through it quickly. So let's just sum it up - this will be fun if:\n1) you genuinely enjoy reading fast-paced heist urban fantasy.\nWho doesn’t enjoy campy fantasy sometimes? Okay, yeah, maybe I need to be in a specific mood to enjoy this specific category. But I tend to really enjoy the fast, slump-breaking reading experience this type of book offers. A+ for that. \n2) you have spent a lot of time poking fun at cliche fantasy books that you really liked.\nThis book spends a decent amount of its time poking fun at itself. And guess what? It is fucking hilarious. The main character’s voice, in particular, is just glorious and sardonic and fun, and I absolutely love it. \n3) you enjoy pulpy you-kind-of-know-what's-happening but-you're-still-along-for-the-ride kind of books where all the characters are pretty likable.\nYou know Cassandra Clare? She’s popular because she gets you invested in the characters and then you’re so invested that you just enjoy the ride. There’s a cool lady friendship to root for feat. a total nerd girl and absolutely no dumb miscommunication. An exes plotline that you totally know the direction of but enjoy nonetheless. A strong family dynamic that is so easy to root for. I am not going to pretend this will be a book I find extremely memorable; however, I am going to totally lean into how much fun I had reading it and recommend it to anyone who finds the prior description somewhat intriguing. I laughed reading it!! It broke through my slump!! So I would recommend. Blog | Goodreads | Twitter | Instagram | Youtube"}, {"Review": "Fire and Heist by Sarah Beth Durst is a young adult fantasy read that is a standalone story. The author described her idea for this one as wanting to write Ocean's Eleven with Were-dragons so of course this odd description definitely got my curiosity aroused. It's safe to say when done too this doesn't really remind me of anything I've read before which for me is a good thing. Sky Hawkin is a teenage Wyvern, a human with the ability to shift into a dragon, although the Wyvern here on Earth have lost the ability to shift and can only conjure fire. Wyvern's also have a fetish for shiny expensive things, especially gold so how do they go about acquiring it you ask? By stealing of course. Sky's family however is on the outs in the Wyvern community after her mother went on a heist and didn't return. Obviously something went wrong but Sky's brothers and father refuse to do anything to find out what happened so Sky intends to plan her own heist to try to find her mother. Now, with a book about dragons I wasn't quite expecting to jump into what reads more YA contemporary with family drama but the story started a little on the funny side and piqued my curiosity regardless. As the book went along and I'm beginning to wonder if the world is basically ours with these supposed \"dragons\" that aren't more than humans without a lighter to create fire what was the point to including Wyverns but thankfully the story eventually got around to more dragon-ish things to satisfy my curiosity. In the end I found it a rather cute mostly contemporary with a dash of fantasy read and would suggest giving it a try. I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"Review": " Review posted on Fafa's Book Corner! Beware spoilers ahead!Trigger warning: Trauma regarding absent parent, mention of murder, blackmailing, imprisonment, mention of blood, abusive parent, and physical violence.Sky Hawkin's used to have it all. The perfect family, friends, and boyfriend. Until her mother disappeared. Now shunned by the wyvern society, Sky's family is dealing with the aftermath regarding her mother. Her father doesn't smile anymore. Her brothers ignore her. And the Hawkin's family refuses to speak about what happened.Much to Sky's surprise her ex-boyfriend Ryan gives her information regarding her mother. Sky decides to put her foot down and complete the mission her mother failed. With a rag-tag crew, Sky sets out for answers. After reading the author's previous works' I was highly anticipating this! I am happy to say that I enjoyed it! Fire and Heist is written in first person limited, following Sky. There are chapter numbers and one list.I had such a blast reading! So much fun but also had it's serious moments. I particularly enjoyed the play on history! The Hawkin's are distantly related to King Atahualpa and other historical figures.I absolutely loved the Hawkin's! They had such a great relationship, despite all they'd been through. Charles is the oldest. He had this tough guy attitude. Tuck and Liam are fraternal twins. And like most twins had a close relationship. Sky's the youngest and the baby of the family. Her father and brother's do their best to keep Sky out of everything. Which just makes Sky even more inclined to look for answers.There's a large focus on 'Before'. As in before the events of this book. When Sky and her family used to be happy, and when they actually had a place in society. After being shunned and dumped by her boyfriend, everyone else followed suit. Sky's wyvern friend's ditched her. No one wants to do business with the family. Naturally Sky is angry with all these people. Even when Ryan comes back in her life Sky still holds some resentment.The world building was excellent! There are a lot of rules within the wyvern society. Even regarding a person's first heist. Wyverns' history plays a huge role in the story. Most of it is nothing new. Though I felt that Durst did a good job making it unique.I really liked Sky! She was a great character. Realistic with her own insecurities. Also very mature which seems to be a thing with Durst's heroine's. I enjoyed reading about her character development and journey throughout the story.Gabriela is Sky's human friend. Now that Sky doesn't have any wyvern friends. She is Spanish and loves to do research. Also very self-assured, whilst some insecurities. The friendship between Sky and Gabriela was sweet! They really grew from their relationship with one-another.Maximus is a wyvern who can also use magic. His character was quite something. At first I didn't know how to feel about him. As the story continued I grew to appreciate his character. He's very dramatic which makes for a fun reading experience.Ryan's character surprised me. When I read the synopsis I figured the audience is supposed to like him. I did not except him to be helping Sky in her heist. Let alone encourage it. He was sweet and a total dork. I liked the romance between them. I thought they were cute together. It also didn't take away from the plot.The heist was so much fun! I really enjoyed reading about their practice. And the part each character had to play. Once all the twists came into play, there were a lot of genres explored. Such as some Sci-Fi elements. I didn't see anything coming! And enjoyed all the tibits of the world building explored.The main themes were forgiveness and power. I respected Sky when she said that she would forgive Ryan and the rest of her friends. It showed character growth. I thoroughly enjoyed the discussions about power. It was very interesting and thought provoking.Overall I really liked it! I highly recommend it."}, {"Review": "When I saw a mention that Durst had gotten the idea of writing a story that combined Ocean's 11 and wyverns, I couldn't sign up fast enough.And what fun it was!Sixteen-year-old Sky Hawkin is a normal teenager emotions-wise--her grief is quite real at the beginning, in which we learn that her beloved and feisty mother vanished, her family has been disgraced, her friends unfriended her with prejudice, and most hurtful at all, her boyfriend, who'd been her bestie since they were three, publicly dumped her.Sky is also a wyvern, in a family of wyverns. In wyvern society, you gain credit among the other wyverns by executing heists to build and expand your hoard. A wyvern youth isn't allowed to attend the council until they execute their first heist.Sky's dad is overprotective of her now, and extra paranoid. Her three older brothers are annoying and endearing by turns, the way older teenage brothers can be. He closes Sky in the more when she expresses her wish to find out where Mother is--and to execute a grand heist against the family who lead the pack in disgracing them.But Sky builds her team, meaning to go for it anyway . . .The first person voice is so much fun. I loved the characters--the brothers reminded me so much of my brothers when we were all younger, and I especially loved Sky's human friend, Gabriella. Sky learns about her unconscious prejudice against humans in a refreshingly non-preachy way, and the romantic relationship was lovely and lightly done.The worldbuilding disclosed plenty of surprises as well as interesting characters. I couldn't predict what would happen with the heist, furnishing a second half that accelerated the pace even more.This book is aimed more toward the younger end of YA--which is getting harder to find, it seems. There is romance, but no sex, only smooches. There is threat, but no horrific torture or blood and guts, the way many YA novels have been trending these days.In other words, it's more Oceans 11 than Game of Thrones--which I consider a strong plus. That plus vivid characterization and a wry, fun voice makes this one a book for the keeper shelf.Copy provided by NetGalley"}, {"Review": "*ARC received from Netgalley in exchange for an honest review.*Well. Oceans 11? A Heist? DRAGONS!?HAHAHAHAHAHAHAHAHAHAAHAHAHAWhat a letdown. We got teenagers, disappeared mothers, family dishonor, and among other things, just super simplistic high school drama crap. This read like the books I read in middle school/high school before I started to really get into reading. I did not feel any connection to the characters and I can tell you right now that I don't remember any of this book other than it's about \"dragons\" and this stupid heist.Sorry."}, {"Review": "I had really high hopes for this one, because the blurb makes it sound like it’s Heist Society with dragons. Sadly, that is not the case, and not just because there was a distinct lack of hot blond billionaire.16-year-old Sky Hawkins and her family are wyverns. Originally descended from dragons, they can’t actually transform anymore, but they can still breathe fire. And they still LOVE their gold. In the wyvern community, leading your first heist to steal something is a huge coming-of-age ritual. But you aren’t supposed to steal from humans – in this world, humans do know about wyverns’ existence and treat them like celebrities.Sky essentially used to have it all. She was the classic rich girl – popular, hot boyfriend, family with six cars each. But then her mother suddenly disappeared while on a heist. Now her friends aren’t talking to her, her boyfriend Ryan broke up with her and humiliated her in public, and her family is falling apart. In fact, the Hawkins are being shunned by the entire influential wyvern community. Sky can’t understand it, because stealing is an established and acceptable part of wyvern culture. So why are they being excluded? Is it because her mum got caught? Her family aren’t telling her anything, so she decides to go investigating for herself.Things get more complicated when she discovers that her mum was busy stealing from Sky’s ex, Ryan, at the time of her disappearance. Sky has to put together a crew, retrace her mum’s footsteps, and discover what happened.This is where the book lost me.I thought the members of her crew were awesome – props to the author for making them very three-dimensional. Sky has Gabriella, a human classmate who’s looking for more excitement in her life; Maximilian, a wizard with his own motivations; and Ryan, who swears he was forced to dump her by his dad but that he still loves her. Ryan’s house is guarded by top-notch security. I was expecting intricate details of how the crew would hack into the CCTV feed and loop it, defuse bombs, circumvent lasers and pressure-sensitive plates.Instead, I got stuff like ‘We cut the wires. The bomb was defused.’Um, excuse me??? You don’t get to do things like that! If you don’t know about bomb removal, research it!!! Read Heist Society!! This was a huge let-down. It felt far too easy for them to sneak into a highly guarded vault, even if they were magical beings.And then, at about the 50% percent mark, something happened which made me realise the book was never going to be about fun and exciting thefts in the first place. Durst’s real plotline is, basically, all about casting down authoritarian regimes. Which is all well and good, but not when the blurb promised me fun and exciting thefts.It was a HUGE struggle to finish this book. It didn’t help that Sky is pretty annoying: she uses Gabriella massively, basically only speaking to her when it’s convenient. In fact, at the beginning Sky was a real bitch to Gabriella. And Gabriella was the best, most relatable character in the whole book. She’s always felt sad at being excluded from thrilling adventures just because she’s human, she’s a loner desperate for friends, and all she wants is for her life to have excitement the way Sky’s does.The romance was thin as paper. I felt zero chemistry between Ryan and Sky. It didn’t help that Ryan is basically an omega hero, kowtowing to everyone. It felt like Sky was more in love with the idea of their romance – the whole childhood-friends-to-lovers trope.So yeah. This book disappointed me, but I managed to finish it (with much skimming) so it gets two stars.[Blog] - [Bookstagram]\n"}, {"Review": "this was a pretty good book, it just wasn’t for me ☹️"}, {"Review": "I received an ARC from NetGalley in exchange for an honest review.As a wyvern (think were-dragon), leading your first heist is a big deal - bigger than taking your first step and saying your first word. It's your first chance to really gain power and acceptance within your family and community. However, leading a life of crime isn't easy, and Sky learns the truth about her mother, who recently went missing, the real reason her boyfriend broke up with her, and a valuable jewel that could restore her family's standing. With her crew at her back, Sky knows what she has to do in order to successfully complete her heist along with getting her mother and boyfriend back. Then, she discovers an unbelievable secret about were-dragon society - something much more valuable and dangerous than treasure.I was so pleased when I found out I was approved for Fire and Heist on NetGalley because it sounded exactly like something I needed in my life. Basically, all I needed to hear was Ocean's Eleven with were-dragons and I was sold. I'm a sucker for a heist fantasy really. The novel does quite a bit of things well, particularly the first half. I liked getting to know Sky and her family as well as the planning of the heist. For the most part, the tone of the story is quite fun and fast with a lot of good twists to keep you turning the pages. However, when it comes to pulling off the heist we didn't get to see as much of it as I would have liked. I also would have preferred to get a bit of a better feel for the wider wyvern world. Plus, I wish the secondary characters were a little more fleshed out.Overall, Fire and Heist by Sarah Beth Durst is a fun, unique YA fantasy with just a dash of romance and plenty of dragons and a decent sense of humor. If you like Ocean's Eleven, White Cat by Holly Black, Artemis Fowl by Eoin Colfer, and Six of Crows by Leigh Bardugo, I have a feeling you'll also enjoy this new standalone novel. I have to admit, I wouldn't say no to seeing more stories set in this world. I'm going to have to read more of Durst's work soon - The Queen of Blood and The Lost are at the top of my list.Thanks again, NetGalley!"}, {"Review": "4.5 starsCan I just say that I was very pleasantly surprised by this novel? And by very pleasantly surprised I mean I was absolutely blown away by this!I just . . . did not expect this to be that great? Right from chapter 1 I was hit with something akin to awe.Because the voice in this book is so stellar. I still can't properly describe it, but know that I am IN LOVE with how genuine the voice sounds and how Sky felt so teenage and real and interesting.Straight from the beginning, Sky felt super relatable while still being an actually interesting person. This is a really weird comparison, but her voice draws on the good parts of those crazy Wattpad novels with manic MCs who are inordinately random, and mixes it with actual moderation.The voice was just really unique, and I can wholeheartedly say that I have never read a book with a similar voice before, and I think we need more distinct voices like Sky's. Not Sky's exact voice, but more teenage voices that are unique and not just blending into each other.So yeah. I'm cutting this short now and just saying that I loved Sky's voice so much don't you dare @ me saying she's immature. I could use up all my 500 words talking about her voice but I'm cutting it short at 220.Besides this, I mean, the concept is just really cool & fun & engaging. I love magical creatures, so a HEIST BOOKS feat. PEOPLE-DRAGONS (aka were-dragons aka wyverns) was so much fun.Heist books in general are so much fun, and anyone who likes those types of reads should pick this up! I thought it was paced really well, and the fact that this book didn't solely focus on the heist was honestly really nice? There's more to it than just \"finish the heist,\" but there's also other things happening!The fantasy aspect was also really fun and I loved how it was sort of a portal fantasy/contemporary fantasy (no spoilers though!) which made the whole wyvern thing even more interesting. Magical creature/human relations are always really interesting to read about, and Fire and Heist did a really good job explaining this!And the romance was adequately low-key! I mean, it wasn't about falling in love. It was about mending bridges, and I really liked that. There was a huge focus on family and social outcasts and friendship, and all of these themes were really enjoyable in the way that they made Fire and Heist stand out.I definitely think the themes were a huge part of what made this novel more than just a meh fantasy, and as a standalone, they really helped wrap things up nicely! Sky's relationship with her family was complex enough that I wanted to read about it, but not too much that I felt it was unresolved.Overall, Sarah Beth Durst is an author who I need to look more into, as Fire and Heist was a refreshingly fun read that I would definitely recommend to anyone looking for something entertaining yet outside of the norm!Thank you so much to Random House and Netgalley for providing me with a digital review copy in exchange for an honest review!Blog | Instagram | Twitter\n"}, {"Review": "Well, that was hella disappointing.So, I like heists. heist movies are amazing. Heist books are even better. And to me, no heist will ever top the one from Six of Crows. That has forever been cemented as the gold standard for heist story.Sadly, this book didn't even come close to getting on that level of awesome.The synopsis sounded amazing. A magical heist and dragons! If that's not a winning combo I don't know what is! I went into this expecting to be extremely entertained and fall in love with all these characters. Less than 50 pages in I already knew I was in for a big disappointment.My first issue was the writing style. Where Six of Crows was dark and edgy, this one seemed juvenile. And it's not to say that this one should have been like Six of Crows. This is its own novel and the author has her own style. It's just that the style read a little childish and like I couldn't quite take it seriously in dire situations. The charcters were also very childish. They didn't feel very believable as characters and weren't very compelling or even entertaining. There were also a lot of interactions between them that felt forced like the author was trying to trick us into thinking that they were becoming friends or that they were likable and it just came out as awkward.Another issue I had with this novel was the world building, or rather, the lack thereof. This is a world where humans know that dragons exist. What does this mean for humanity? For the power structure of mankind? What is the dragon society like? What are the rules? How is mankind just ok with dragons constantly conducting public high stakes heists? Lastly, I had issues with the actual heist. It was pretty anticlimactic. The heist part should be the tensest, most suspenseful part of any heist story.  It should keep you on your toes and surprise you. This heist sort of just...happened. There wasn't much else to it. I was surprised by how soon it was all over.  Even everything that came after the heist sort of just happened. It was pretty bland if I'm honest. Overall, did I like this novel? Not particularly. I didn't hate it. But, it sure wasn't the most entertaining book I've read this year. Do I recommend it? Again, not particularly. Although, despite this having only a 3.63 average on Goodreads (As of 12/26/18), all the top reviews are giving it 4 & 5 stars. I don't exactly know what that says about this book,  but who knows, you might like it."}, {"Review": "\n\nIt's not arrogant to know who you are.It's powerful.And I am powerful.\nOh my gosh, this book was SO fun! I found Durst's prose to be quirky and engaging - I laughed out loud more than once. I absolutely loved the concept, it was fantastic! MAGIC. HEISTS. WERE. DRAGONS. Yes, that's right. Weredragons!! How awesome is that?! I also loved that they were thieves of gold and hoarders of treasure by nature.I absolutely loved the sense of family that this book had going on. Sky had a close relationship with her brothers and father, and despite being told that her missing mother was a lost cause, she still fought tooth and nail to find out what happened to her. (view spoiler)[And I love that she finally found her and they were reunited as a family! Yay! (hide spoiler)]While I didn't care much for the romance between Sky and Ryan, I loooved Sky and Gabriela's friendship! Gabriela was fabulous and I related to her hardcore. She wanted adventure so bad, it was endearing!It's hard to talk about my favorite part without spoilers, so don't click the tag if you haven't read it! (view spoiler)[I really enjoyed seeing the home world of the dragons!! Also, I was thrilled that they could actually change into dragons (um, weredragon helloooo they'd better be able to)! I was pretty sad in the beginning when it was stated that they couldn't change *anymore*, but I was hoping that we would see it anyway. I wasn't disappointed! (hide spoiler)]There's not much else I can say about this book other than I had fun reading it! The only reason it didn't get 5 stars is it lacked that extra something for me to connect 100% to the characters. But it was a super quick and easy read, and I definitely recommend!This review was originally posted on Novel Heartbeat. To see a breakdown of my assessment, please visit the full review here."}, {"Review": "You can also read my review here: https://devouringbooks2017.wordpress....This book took two of my favorite things to read about, heists and a fantasy world, and put them in the same novel. I had pretty low expectations for this book, but it was actually really cool. Wyverns, or dragon shifters, were a really fun fantasy species to read about. They all steal and have a horde of treasures, so theft is part of the culture and looked upon highly if properly pulled off without getting caught. The characters, in my opinion, were the downfall of this novel. They were rather vanilla, boring and felt run-of-the-mill. They weren't bad, but they weren't anything special either. I had a hard time finding this book as interesting as it should've been because the characters were so dull.  The plot was what kept me reading. The author said she wanted to write Ocean's Eleven, but with dragons, and she did. The planning of the heist takes up a good portion of this novel, but the execution of it is glossed over. There is a fun fantasy twist that helped keep some of the excitement, but I think the planning of the heist should have been explained less and execution of the heist explained more. The tension and excitement are not brought for what should have been a very interesting part of the book.  It was okay overall, but a lot of things could have been done better. When I think of combining fantasy with thievery I think of Six of Crows, this came nowhere near the heights that novel reached. Fire and Heist could have been done way better, but it was still a fun fast read."}, {"Review": "This book was in my first ever fairyloot and first I was kinda scared, because what if I don't like it? Then I started it on Saturday night, because I wanted to read something light and fun. It also has only 300 pages and I could finish it in 1-2 days, so that's what I did. :)When I started it I only knew that it's about were-dragons and heist (I didn't want/need to know more). And now I think about it and it was just all I wanted. I escaped in this world and had an adventure. This book also had great characters and I loved the relationships between the main character and her family and friends. Although it was about dragons and heist, it also shows how important family and friendship is and that everything is possible if you believe in yourself."}, {"Review": "This review and others like it can be found on my blog, Vicariously & VoraciouslyARC Received from Netgalley for a fair review.Sky Hawkins is a wyvern - a human that can change into a dragon and her life has been turned completely upside down. Her mom has gone missing, her boyfriend has dumped her, and her family has been shunned from the wyvern community. Leading her first heist just might set everything straight and lead her to where her mother is. Through her planning and execution Sky unravels more secrets than she set out for.The Story-Dragons? Count me in, pretty much every time. I was super excited for shapeshifting dragons, especially from Sarah Beth Durst who delivered a fantasy that I have already loved (The Blood Queen). Unfortunately, this book was a huge let down for me. I loved the concept of this story - a young teen on her first heist starting her very own hoard, saving her missing mother, etc. But when it came to the actual story telling it felt quite bland. I was really hoping a lot more detail went into the actual heist planning and interactions between the characters, but it felt like a lot of this happened then this happened. Then half way through the paranormal contemporary turned into something completely different, and I was a bit thrown. I felt like a little more time could have been spent on the book and had it split into a duology, because the start of the second half of the book had a completely different vibe than the first. Thankfully it all came together at the end, so it somewhat redeemed itself.The World Building-I liked how the wyvern world was interlaced with the human world. I was just a little confused on the openly justified fact that they're constantly stealing form each other? I did like the idea of how the wyverns got there and what it meant about their life on earth. The security measures around their hoards were super fun and creative, but I really wish the heist itself didn't go by so fast. In the end, it didn't seem that secure at all.The Characters-In Sarah's previous adult fantasy novels I found her characters complicated and intriguing. However, I felt like in this novel they lacked any sort of depth. I don't think having a novel be classified as YA should mean that she should lose that part either. For the most part I thought that the characters themselves didn't really have much pizzaz or anything to make them memorable, let alone likable."}, {"Review": "A really cute stand alone YA fantasy, this is one you won’t want to miss. It’s got action, dragons, a hint of romance, and great characters. Sky is a wyvern and her mother is missing. Having three older brothers, Sky is used to fending for herself. She takes it on her own to lead her first heist, and plans on using what she steals as leverage for info on her mom. Little does she know the secrets and conspiracies she’s about to unravel. The highlight of this book is the relationship between Sky and her family. She’s got three older brothers who annoy her but are there when it counts, a dad who is missing his wife but still involved with his children. It’s refreshing to see family dynamics in YA fantasy, most of the time it’s an orphan who steals the show. There is some romance, it’s not great but it’s also not the point of the book. The point of the book is the heist, which is a lot of fun. This book is firmly young adult, the voice is young but not grating. It will be a great addition to school libraries. Oceans 11 with dragons. If that sounds like fun to you, this is a book you’ll want to check out. I received this book from the publisher through Netgalley and the opinions are my own. "}, {"Review": "I venture into YA when I'm in the right mood. But sometimes, I find myself almost in the right mood and whether I fall in or not will be determined by the book I pick up. With this book, it sucked me in and never let go. Sky is engaging right from the start and the alternate world fantasy setup was just present enough to be interesting and the story has great pacing and all the right details.And now I find myself without much more to say. The cover copy gives you enough to know what you're getting into. Durst delivers on the promises but adds a wonderful family with a broken dynamic trying to find their way back to, if not normal, then at least coming to terms with their new circumstances. I liked Sky a lot and sympathized with her desire to come into her own in a world that has been turned upside down. I love that she takes action rather than wallowing in her self-pity and I particularly love that she's strong enough to claim both her strengths and weaknesses.My only caution is that this is very much a YA story so some complexity is sacrificed for pacing and characterization is sometimes on the facile side of trope. I don't consider these bad traits and thought that Durst made it exactly what it needed to be. Which is why it's getting all of the five stars it deserves.A note about Romance and Chaste/Steamy: Sky starts the story heartbroken that the boy she loves rejected her along with all of the rest of wyvern society. The story works through that relationship but all of the falling in love is in the past. As such, this isn't a Romance but there is an exploration of love and caring about others. There's no steam (or references to sex at all), but there is some kissing so I'm tagging it \"Chaste\" but not \"Romance\" which is a little unusual."}, {"Review": "Check out more reviews @ Perspective of a Writer...In Sky Hawkins’s family, leading your first heist is a major milestone… It’s a chance to gain power and acceptance within your family, and within society. But stealing your first treasure can be complicated, especially when you’re a wyvern–a human capable of turning into a dragon. With a handpicked crew by her side, Sky knows she has everything she needs to complete her first heist, and get her boyfriend and mother back in the process. But then she uncovers a dark truth about were-dragon society–a truth more valuable and dangerous than gold or jewels could ever be.The short review...I can't believe how seriously I enjoyed this little gem!! It's not a perfect book by any means but dragon books meant for YA (and not middle grade) are quite rare so I was really hopeful that I would like this one. And I really did. I read it quickly because it is really exactly as advertised... A quick heist book except these are were-dragons that are going after the goods and not a pretentious group of somewhat young thieves.This is an alternate reality story where our world is our world except there are some differences, namely that there are dragons in human form who can't remember how to shift like there ancestors used to be able to do. I really enjoyed the little mini-history that was developed and the cute thief culture that was a part of being a were-dragon. It's not the most ethical of stories but Sky wasn't doing it for wealth so most will give her a pass. I enjoyed the twist even though I saw it coming... really if you are jonezing for a quick, fun dragon heist then this is your book!Cover & Title grade -> B+I was certainly drawn to the cover because dragon!! The title gave me pause because I'm not a fan of heist books as they are so predictable, but decided to give it a go anyway. And I find this quite an attractive cover despite it having little to do with the story. There was fire, a heist and dragons, but the museum like feel to the cover isn't really the vibe in the story. Though there is a sense of the ultra-wealthy and privileged to the Hawkin's family life.What did I enjoy in Fire and Heist so much that I could overlook its flaws?-The Hawkins Family!Yes, the Hawkins are extremely wealthy and read like privileged white people even though they were technically dragons. But GAHHHHH her brothers were so adorable and protective and like real brothers! She's the youngest so of course they treat her like older brothers do but I just loved the interactions between Sky, one on one and as a group. Her dad felt real, even if misguided. -Gabriela, the Unicorn obsessed!This girl... what a friend! We learn when she first noticed Sky, how she was there for Sky when Sky didn't even see her. She over came her fears to help Sky with her heist and I just loved what a research fiend she was!! And her obsession with magic was so adorable and I just wanted a friend just like Gabriela!! If you're going to lose all of your friends then this is the girl you want standing by.-The Heist Mess...This is no Six of Crows, as it is firmly written for YA and not for adult YA where adults pretend to be YA. That is okay though because this heist was still really good! I liked how Sky worked things out and got together a crew that could take care of each of the problems... Of course the heist only got fun when it all went to hell in a hand basket!As a Writer...So in the beginning I said this wasn't perfect. And it wasn't. You can see from my rating that nothing really reached sublime level... Actually I put it perfectly in my goodreads thought...\"Wow! This is a little corny, a bit predictable and a touch easy but very fun, different and full of dragons! Love the world building and the characters, especially her family. Everything is shallow in a way, but enjoyable.\"You may read a review that talk about the characters being rather shallow. And then you see above that that is what I liked most about the book. Let me explain. The characters are a touch shallow... i.e. there could have been a whole lot more interaction with them. Like many more scenes could have been developed that would have rounded out their characters a touch more. However for a 300 page book with 5 family members, an ex-boyfriend, his parents, a new girl friend, and a dragon wizard plus at least 3 more additional mysterious characters this is really great characterization! There was still quite a lot of plot in those same pages too! Quite a feat and I really applaud at how fleshed out I felt the characters all were.The only one that felt a little cookie cutter was her ex-boyfriend and really I still felt he had a little mini-arc and wasn't nearly as shallow as love interests tend to be. Sure this was a little predictable... but there would have needed to be a ton more pages (like almost double) written to feel more specific to itself and fully fleshed out.Fire and Heist is a fun, quick were-dragon heist story with a fun twist that even if you predict it will still be enjoyable. We meet tons of different characters, some dragons and some supernaturally obsessed but all equally good enough to go on this adventure with!⋆ ⋆ ⭐⭐⭐ Authenticity⋆ ⭐⭐⭐⭐ Writing Style⋆ ⭐⭐⭐⭐ Plot & Pacing⋆ ⭐⭐⭐⭐ World BuildingThanks to NetGalley and the publisher for providing me with a copy in exchange for an honest review. It has not influenced my opinions.______________________You can find this review and many others on my book blog @ Perspective of a Writer. See my special perspective at the bottom of my reviews under the typewriter...Please like this review if you enjoyed it! *bow* *bow* It helps me out a ton!!"}, {"Review": "I have received this ARC from NetGalley in exchange for an honest review. Okay, fire and heist had potential. I was so pumped to dive into this review but for the first half - I was so freaking bored. I wasn’t connecting to any of characters and I also didn’t care one bit about the drama either. Thankfully, it started to pick up after halfway through the book. Unfortunately, it was a little too late. In this book, you will meet Sky. She’s a wyvern, which is basically a dragon shifter. Sky was an okay character but I honestly couldn’t connect with her. I didn’t care about what happened to her or this heist anymore. Other than her, the other characters were also boring. Again, connected to no one in this book. Overall, it was an okay kind of book. I had high hopes before diving in and ended up being completely disappointed."}], "Genre": "Fantasy", "ID": "23510085", "Desc": ""}