{"Genre": "Fantasy", "ID": "68428", "Name": "The Final Empire", "Reviews": [{"Review": "I can't remember being this violently conflicted about a book in quite some time. There are some areas where it's just so well done, with the author absolutely nailing it, and then others where I found myself grinding my teeth in frustration. I'm going to abandon my usual practice of writing short, pithy reviews and just drunkenly ramble on a few things here. (Still no spoilers, though.) That OK with y'all?Language. About two and a half chapters into this book, I found myself asking, \"Why does this feel like a kids' fantasy book?\" It wasn't the subject material or the plot, both of which were clearly more sophisticated than Harry Potter and his ilk. While I would feel perfectly comfortable having a 12-year old read this PG13-violent and utterly sexless book, I don't feel as though it's necessarily written for tweens. Finally it occurred to me: it's the language. This book is one of the most simply written books I've ever read, using only the most basic vocabulary. That isn't a bad thing, as I'd rather read something direct and simple than something flowery and overwritten, but Sanderson's language is so simple here that it's almost as if he's drawing with the Crayola 16-set when other authors have the big 64. (One notable exception: having apparently become recently enamored of the word, he uses maladroitly at least three times. Maybe he was jamming some Weezer while he wrote.) I haven't read any of his other works (yet; Mistborn #2 is on deck), but I have to assume this simplicity is by conscious choice, and it's an interesting choice at that. I'm just not sure yet how I feel about it.One language choice that I am sure how I feel about is Sanderson's decision to have his characters speak good old American English. The narration is similarly plainspoken, with a fair amount of American slang thrown in, rather than the twee, faux-Elizabethan style of a lot of fantasy authors. I like the approach. One of the most time-honored fantasy tropes is having all the characters thee and thou each other, with a few ne'er did yon stars of Yomama glimmer so resplendently, my suzerain for good measure. And I can handle that stuff, having been weaned on Tolkien and everything that came after, but I found Sanderson's decision to move away from that convention refreshing. I interpreted it as Sanderson saying, \"The unspoken assumption here is that this book has been translated from whatever languages they speak on this made-up world, so why translate it to anything other than what is most understandable and comfortable for you to read? To couch this story in funky language is to insult your imagination by implying that you need that in order to realize you're reading a fantasy novel.\"Setting and Plot. The setting is a typical high fantasy world - feudal-style nobility and peasantry; shadowy, powerful priesthood; mysterious evil lord, etc. - with some odd, almost steampunk flourishes thrown in. There are wristwatches. Men's formal wear is described as something more like Victorian coat and tails than medieval garb. Magic in this world is fueled by elemental and alloyed metals, which are described rather exactly, using percentages. It's a unique and interesting blend.The basic plot is about as stock as it gets. If you're familiar with the Star Wars films, the Harry Potter or Percy Jackson books, Eragon, the Dragonriders of Pern trilogy, Dune, Ender's Game, or any one of about a million other works, please play along:Dear [kid with weird name], I know you are only a [farmer / orphan / urchin / child of a minor noble], and this will be hard for you to accept, but you [have Great Powers / are the Chosen One / insert name of funky power here]. You are the only one who can [save the world / save the universe / defeat the Empire / restore order to the Force / kill the Big Boss]. Luckily, even though you just learned your destiny fifteen minutes ago, you will make up for lost time by quickly becoming better than anyone in the history of ever at [Quidditch / dragon riding / sandworm riding / Allomancy]. Any questions?Needless to say, the book's plot could have been a ticket to Hack City, but it really isn't. Vin's growth and development are handled well.Exposition. This is a fantasy book for the video game generation. By that, I mean that the book follows the general path of a first person RPG:1) Introduction to the world and the main characters2) A few early levels whose only apparent purpose is to teach the player how to use the buttons3) Quests of increasing difficulty, with progressive reveals of the Big Plot4) Fight with the Main Boss, including the inevitable twist5) Denouement and teaser for the next installment.Not that that's a bad thing! But I was really surprised at the way Allomancy (the main \"magic\" in this world) was laid out. In the two towering fantasy/sci-fi works of the 20th century (The Lord of the Rings and Dune), the supernatural elements of the story operated behind a sort of curtain or screen. The One Ring in LotR and the spice Melange in Dune both held great, mysterious powers, but the specific effects and extent of those powers were seen only in fits and flashes, and never understood completely by the characters or the reader. In contrast, fairly early in this book, Kelsier takes Vin on a practice run where he explains how her powers work and what their advantages and limitations are, using plain language and real-world physics, and lets her fly and mess around and just generally exult in her magic. It left me, the reader, as well as Vin the character, feeling that even if we didn't understand this magic perfectly right now, we might at some point in the future, which was a very different feel.OK, after enough rambling about things I feel ambivalently about, let's wrap up with one big win and one big fail:WIN: Brandon Sanderson can write the hell out of an action scene. (And since the final quarter of this book is pretty much all action, playing directly into Sanderson's strengths, it kicks all kinds of ass.) The fights in this book are gut-wrenching without being overly gory, and the chases and sneaks are heart-stopping as well. Perfect combination of pace and detail. Amazing. Possibly the best I've ever read from an author in this genre, and if he's able to do that so effortlessly, so early in his career, it gives me hope that he can fix...FAIL: ...the dialogue. In spite of being favorably disposed due to the use of informal American English, I eventually found the dialogue here really clunky. Everyone is too wordy. Everyone says one sentence too many. Over and over again, I found myself going, \"Real people don't talk like this\" and especially, \"Real people who are supposed to be close friends don't talk anything like this to each other.\" Seriously, think of how you talk to your best friends in private, then compare it to this book. In addition, there was always that odd feeling of unneeded exposition, as if the characters were talking half to each other and half to the reader. It was unfortunate, especially in contrast to how slick and fast-moving and just plain awesome a lot of the other writing was.All in all, this was a fun, kinetic read...with a few holes in it. It builds, it explodes, and the ending is really good. If half-stars were allowed, this would have been a 3 1/2. Good stuff.Also, here are my (spoiler-free, suitable as previews) reviews of the second and third books in the series, if you enjoyed this one!"}, {"Review": "BOOKTALK HERE: https://www.youtube.com/watch?v=C-XEW...Just as I expected, this book was FANTASTIC. The story, the characters, the world, the magic system--I loved it all! It was a wonderful first book in a series--satisfying on its own, yet there's still plenty to explore in future books (which I will definitely be reading soon!)Really, the only somewhat negative thing I have to say is regarding all the hype. While I definitely think the praise is deserved, it did leave me with very very high expectations. Expectations that were met, but because I was anticipating awesomeness, it didn't blow me away as much as it could have. But again, this is a very minor gripe, and more about my reading experience than the actual book itself.I'll talk about the book more in a video soon, but for now I'll just say again, I LOVED IT. The story was beautifully constructed, the world was rich and believable, and the characters were likable and well developed. I can't wait to continue the series and see where it goes next!"}, {"Review": "Sometimes, I revisit a book I had loved ages ago, only to tell myself \"What the actual fuck was I thinking?! This book is crap!!!!! Oh young Khanh, you were so dumb :(\"Thankfully, this was absolutely NOT the case for this book. I appreciated it much more the second time around. It could be that it just took time for me to appreciate the book. Or maybe it just glows in comparison to all the crap I had been reading (2.5 average rating last year, baby!). Either way, I ain't complaining!First, the bad, because I'm that sort of person. Sanderson is a good writer, not a great one.  The world he has built is magical, his words are not. Sanderson's writing is simple, readable. Perhaps too simple. I appreciate the fact that there is no purple prose, but sometimes, a story is woven through the magic of words, and Sanderson's writing is simply too plain for me.On the other hand, damn, he's verbose. This is a huge-ass book, people. I mean, I get it. The book is tremendously grand in scope, the story is complex, and will only get more complicated as the series wears on, but I find myself wearying of reading, which is a sad thing for any reader to realize.Now, the good. First, LOW ON ROMANCE, BITCHES! CAN I GET A FUCK, YEAH? Sanderson, I feel, is so respectful to his female characters. They are strong, resourceful, independent. They can get by without a man. The women in his book have to earn their stripes. There's no getting by on beauty and flirtation here. Wit and cunning is a much safer bet than the size of a female character's tits.The world building is tremendous. The magic of Allomancy is just so fucking awesome, and so well-described. World building, the myth and magic surrounding any high fantasy is so crucial, and Sanderson did a tremendous job.Yes, it's a long-ass book, and the writing isn't as spectacular as some (Guy Gavriel Kay), but on the other hand, this book is eminently readable, with a limited amount of meandering (unlike Guy Gavriel Kay)."}, {"Review": "6/21 Re-reading...Thank the Lord Ruler I finally crawled out from whatever rock I was living under and finally decided to read this book. Because.It. Was. So. Fucking. Awesome.I have been telling myself for years that I should try and branch out from just romance, paranormal romance, UF romance, sci-fi alien smut and the occasional murder mystery or biography (not that there is a damn thing wrong with my beloved romance, but just to challenge myself to try something new) and attempt to tackle a straight high fantasy. Well, this book was my first true foray into that genre and all I can say is...***LOLZ. Jay kay, peeps, jay kay. Just making sure I live down to your expectations. *wink*In all sincerity though, this book was everything and I truly don't know why I waited so long to tackle this genre. Comic/Sci-Fi/Fantasy movies are my all time FAVORITE movie genres.And this book felt like I was locked in one of them.Like I was in a theater watching an epic fantasy film.Only BETTER.Because we ALL know the book is always better. Brandon Sanderson is now a front runner in the Val's Spirit Animal Games and I just want to sit across from him at a pub table and watch him breathe. His world building is so amazing, I can't even.I was enthralled from page one until page end.This is an older book and and I'm late to the fiesta, so I'll stop there; but long story short, I loved this thing so hard I might sleep with it under my pillow for a while. And the best part?There are now aisles of books at the bookstore that I feel have suddenly been opened to me. AISLES, people. So glad I tried something new.I feel so mature. Three cheers for Garth. \n\n\n\n"}, {"Review": "Allomancy. The mystical power held by the nobility, granted to them by the Lord Ruler some thousand years before as a reward for their loyalty. Readers have been urging me for years to pick up anything by Brandon Sanderson, and after browsing his books I knew that Mistborn would be the first world I wanted to enter. Opportunity arose, and I was able to read this along with two other Goodreads friends, which made for a much more exciting experience than if I had gone it alone. We were able to bounce ideas off of each other, chat about theories we had, and see where we were right and where we were completely wrong. The latter is where we mostly fell. ;)  I'm at a loss for words at how perfectly this book and I fit together; the only way I can think of explaining is that, upon finishing The Final Empire, I found myself questioning the validity of most of my previous 5 star reads. How could I possibly place them in the same category as this? I understand it won't be for everyone; the pacing is slow throughout a majority of the book and it's long by many readers' standards. I felt the hilarious banter between the characters relieved a bit of the slowness, but I also found that I loved the steady, detailed world building. The immaculate secondary detailing is what really set this apart from other adult fantasies I have read, and I can't wait to continue on and see where Sanderson takes us. I don't really have much else to say, as I've jumped on the bandwagon late in the game, so I thought I would close with my favorite (spoiler-free) quotes that I marked along the way.If men read these words, let them know that power is a heavy burden. Seek not to be bound by it's chains. \"Every action we take has consequences, Vin. I've found that in both Allomancy and life, the person who can best judge the consequences of their actions will be the most successful.\" The Hero of Ages shall be not a man, but a force. No nation may claim him, no woman shall keep him, and no king may slay him. He shall belong to none, not even himself. Belief isn't simply a thing for fair times and bright days, I think. What is belief-what is faith-if you don't continue in after failure? Buddy read with Bentley and Scrill ! 😍❤️"}, {"Review": "Reviewed by: Rabid ReadsI hate everyone.You: Everyone who?Me: Yes.You: Eh?Me: Leave me alone. I don't want to talk about it!You: *backs away slowly*Me: IT'S ALL YOUR FAULT. *sobs*Are you one of them? Are you? Did you rave about MISTBORN and convince me it was one of the BEST fantasy series ever? You can't believe I haven't already read it--I'm going to LOVE it. Hmm? DID YOU?!Then you, friend, are whom I hate.As for you, Mr. Sanderson . . . I TRUSTED YOU.I collected your clues and gathered your hints like freaking MANNA, and when you did-the-thing, I . . . panicked. But then I thought, no, no, this CANNOT be, he wouldn't do this, and I went back through all my meticulously collected clues and hints and found an explanation. A perfectly. Reasonable. Explanation.An explanation that made sense.An explanation that would keep my heart in one piece instead of the shattered, brittle thing it has since become.An explanation . . . I am forced to conclude . . . you deliberately planted . . . to foster FALSE HOPE.YOU are the Deepness, Mr. Sanderson. YOU are that which will destroy the world. And YOU will do it GLEEFULLY.I hate you most of all.I can't write the review that I want to . . . I can't talk about Sanderson's brilliance as he cultivated my doubt, and how that doubt made the loss so much worse: (view spoiler)[I DENIED HIM. MORE than three times. *changes name to Paul* *runs away to live like hermit in wilderness* *is generally miserable*  (hide spoiler)]Which is exactly what he intended. It was so masterfully done, it couldn't be an accident.Why does your manipulation make me admire you so?Probably b/c (thanks to you) I'm a shadow of myself. <------oh, look at that. You probably PLANNED THAT TOO.The world of the Mistborn is not a pleasant place.There's always a downtrodden servant class in a Sanderson series, but this world's version is particularly bleak.Ash falls like rain from the sky, supplying the skaa with a never-ending, yet thankless workload. They're beaten regularly, often resulting in their deaths. A pretty daughter is a curse rather than a blessing, b/c not only will the Master feel obliged to have his way with her, but when he gets bored, she'll be killed.Halfbreeds are to be avoided, you see.The nobility is sometimes blessed with magic. Magic which passes genetically to offspring, and we can't allow the peasants to gain that kind of power, can we?*twirls mustache*Enter Kelsier. *fireworks*In the city where corruption among the nobility chokes the air almost as much as the ashfall, some skaa thumb their noses at the system.They form street gangs and steal whatever they can from those who would enslave them, existing in a cutthroat world by embracing a cutthroat mentality.Most of the gangs are comprised of ordinary skaa, but a few are different, more organized crews than low-level thieves . . . They take bigger jobs, they are the royals of the petty crooks, they are the Mistings.And in a few extremely rare cases, they are the Mistborn.Not every halfbreed life is snuffed out before it can begin . . .And Kelsier is the greatest of them all.Among the common criminals, he is legend:\n“That’s where he got those scars, you know,” Disten said. “The ones on his arms. He got them at the Pits, from the rocks on a sheer wall he had to climb to escape.” Harmon snorted. “That’s not how he got them. He killed an Inquisitor while escaping—that’s where he got the scars.” “I heard he got them fighting one of the monsters that guard the Pits,” Ulef said. “He reached into its mouth and strangled it from the inside. The teeth scraped his arms.” Disten frowned. “How do you strangle someone from the inside?\"\nBut Kelsier was betrayed, and when he finally escaped the pits that claimed his wife, he was determined to be more than a crew leader. More than a thorn in the Lord Ruler's thigh or a bramble in his path.And when you think about it, as far as planning goes, there's not much difference between organizing a chancey heist and plotting to overthrow a corrupt ruler who thinks himself a god . . .One might even suggest that Kelsier is the perfect man to do it . . .Beyond his suitability for the task, there's something immensely likable about the image of this noble Fagin flipping a coin he keeps to anchor his Allomancy, the ability to metabolize and manipulate metals.And here's the thing about Sanderson: the man's a genius. Now that I've familiarized myself with him, I don't think I'll ever be able to stop reading his books. Even if I'm not thrilled about the execution, there is always incredible potential in his ideas.Take the concept for this series: what would happen if the hero meant to save the world . . . failed?SO. We have servant class con men with flash + an immortal tyrant = Revolution! We have a world in ruin one thousand years after the hero of prophecy failed to save it. Add to that Sanderson's trademark misdirection, and, well . . . Despite my brokenness in the aftermath, how could I not read it? How can you not? Highly recommended, but only with LOTS of cake (or something stronger) to drown your agony.PS - this changes nothing. I still hate all of you.Pre-review:Also, I HATE ALL OF YOU. BUDDY READ with my peeps in \nSanctum of Fantasy\n.It's supposed to start tomorrow, but:*waves at Robin*My other reviews for this series:\nThe Well of Ascension (Mistborn, #2)\n"}, {"Review": "I forgot that I did a re-read on audio of this a couple of months back! Thank you to my friends who out of the blue liked my old review and reminded me. I checked my Overdrive and the next one is going to come through soon for my re-read. 😊 I still feel the same about the book because it's freaking awesome, I'm just not sure about the audio. I don't think I will get it from Audible. It's okay I guess. Anyway, the old review is below and nothing has changed Old Reviewwww.melissa413readsalot.blogspot.comI'm sitting here in shock after reading this book. I have to admit that I cried, I didn't see that ending coming. Brandon Sanderson has done it again. This is only my second book I have read of his and they both have blown me away. I loved all of the \"good\" characters in the book. Each one of them have an endearing quality. My favorites being Kell, Vin and Sazed. It took me a little bit to understand the Allomancy, but it finally started to make sense and there is a little chart in the back of the book that helps out with that :) Kelsier (Kell) is a Mistborn and getting an army together to try to take down the Lord Ruler who is the ultimate jerk!! He finds Vin and brings her into his fold. She has no idea she is a Mistborn and she ends up being so much more than that! I love that he took her under his wing and taught her so many things. She caught on very quickly but this is because of what all she really is...no spoiler! Kell has such a wonderful team. I love them all. There are several that have powers themselves. I really think this story is great at having all of these characters with different things they can do. They all stand out very clearly and the friendship between this team is the best. The book is full of evil beings, strange beings, war, senseless torture and killings, and the good people trying to make a difference. I'm still at a loss for a lot of words because of what happens and the feelings that are put into the book. All I can say is I look forward to reading many more Sanderson books!!! Fin"}, {"Review": "The beginning of the trilogy that sparked my love for reading fantasy novels.It’s been exactly one year ten months since I first joined Goodreads or started reading The Final Empire, September 1st, 2016 to be exact. This is an extremely important book for me and the more I tried to explain why the harder it felt to come up with something other than saying the cliché phrase that “I absolutely love this book”. The reason on the significance of this trilogy for me will have to be postponed until I’m done with rereading “The Hero of Ages” because it will be much easier for me to explain why by talking about my life before and after finishing the trilogy. So yeah, that’s coming in a week or two but for now, as always, it’s all about my thoughts on the book and why The Final Empire—even upon reread—is an absolutely incredible start to a trilogy.Picture: The Final Empire by breath-artThe Final Empire is the first book in Brandon Sanderson’s highly acclaimed Mistborn trilogy. For a thousand years, the world has been ruled with an iron fist by the immortal emperor, Lord Ruler. The main plot of the book focused on a rebellion built around a heist led by Kelsier and his newly found apprentice, Vin to overthrow the Lord Ruler. I absolutely loved the story here. The first time I read this book, I found the plot to be thoroughly engaging, seriously relatable but at times humorous due to the characters camaraderie and banter; I was also completely fascinated by the world and magic system that Sanderson has created here. All of these are still true but there’s an additional superb quality that happened upon my reread: all the foreshadowing and hints are now laid bare for me to see with the gift of hindsight. The Final Empire on its own works perfectly as a standalone but trust me, it’s not. Everything you read here—even the mini details—played major parts for the upcoming books.\n\n\"Plots behind plots, plans behind plans. There was always another secret.”\n\nPicture: Kelsier and Vin by GisAlmeidaWhere do I even begin with the wonderful characterizations? Let’s start with my book girlfriend (this will most likely be the only time you see me use this term), Vin. I’ve read more than 200 books since the first time I started this trilogy and Vin—by the end of the trilogy—remain my favorite heroine of all time. This doesn’t mean that Vin is the only great character from the series; Kelsier, Sazed, Elend, and many more I can’t mention for now because their greatness won’t come to play until the third book. Some of you who’ve read it might think of Vin’s thoughts as being “emo” or if you’re in 9gag, “edgy” but think about it, with her past, can you blame her? I found Vin to be an amazing character here because she taught me that despite being betrayed and left behind countless times, it’s always okay and better to love and trust someone again than being alone. Kelsier taught me about justice and hope; that it’s not okay to stand still in the face of tyranny, oppression, and slavery.\n\n“Men rarely see their own actions as unjustified.”\n\nSazed taught me that it’s possible to have a different faith and yet still be respectful and kind towards each other’s belief.\n\n“Our belief is often strongest when it should be weakest. That is the nature of hope.”\n\nThere were plenty of things to learn from the characters in the book but for now, let me talk about one of the main highlights of the book and the trilogy itself, the magic system.The Final Empire introduced us to Allomancy and Feruchemy. I’ll be honest, coming from a heavy gaming and reading manga/anime background, I thought I would not encounter a magic system of high caliber that can be found in that two medium within the novel form. However, I was wrong. Allomancy is amazing and still by far my favorite magic system in the medium; even more than the one in Sanderson’s magnum opus: The Stormlight Archive. The intricacy of the magic system that Sanderson has created in Mistborn saga never ceased to amaze me and I’ve yet to encounter a more engaging, complex, and amazingly easy to understand magic system within any fantasy novels. Plus, the actions spawned from the magic system resulted in some vivid and fast-paced battle sequences. Don’t believe me? Try going to a forum and ask “what’s your favorite or the most intriguing magic systems you’ve ever read in fantasy?” I guarantee you that snow will fall in my country if someone doesn’t shout Mistborn; it’s just THAT good.This book was also my first encounter with Sanderson’s spectacular world-building skill along with his simple, vivid, and immersive prose. The world of Scadrial that’s clouded by ash and surrounded by mist was extremely atmospheric to read. There was also a lot of well-built mystery and lore within this book as Sanderson used the epigraph that can be found within the start of each chapter masterfully. I’ve heard a lot of criticisms from readers that Sanderson’s prose here are too simple for their liking and I do agree that not only this book, all his book contain simple prose. However, that’s actually one of the things that I do appreciate about his works. His writings never get in the way of the story and he’s still capable of telling a story of epic proportion with simplicity. Even though his prose is simple, this doesn’t mean that there isn’t any wisdom in it. In my opinion, all of his books contained a lot of wisdom easily applicable to our daily life. A few examples:\n\n“The right belief is like a good cloak, I think. If it fits you well, it keeps you warm and safe. The wrong fit however, can suffocate.”\n\nAnd this\n\n“You should try not to talk so much, friend. You'll sound far less stupid that way”\n\nAnd with that quote, I realized that it’s time for me to put an end to my review here. It’s safe to say that I still consider The Final Empire one of my favorite books and one of my favorite starts to a trilogy. My reread experience of this book has been better than I expected and I can’t wait to see how the rest of the trilogy holds up for me. Below here, just for fun, cringe, and nostalgia, is the first review I’ve ever written. Hopefully, I did a better job this time! :)You can find this and the rest of my reviews at Novel Notions------------------------My first review on Goodreads and I'm really happy it's this book that I chose. The book have an amazing world-building, great characters development and most of all, very intricate magic system and actions. This is coming from someone who've seen plenty of magics (not real of course) from 20 years of gaming and watching anime/movie/television series. The amount of details Sanderson put into each words (not to mention it's really simple and easy to understand) is insane.I will definitely read the rest of the trilogy straight after this and more works by him!"}, {"Review": "Oh my gosh. I have tears in my eyes. This was by far one of the best fantasy novels I've ever read. I don't even know how I'm going to function enough to give this a worthy review. Brandon Sanderson, you have rocked my world. Seriously, if you want to try a high fantasy but you want to avoid those long/boring/depressing series - give this a go. I'm just going to point out all the things that made this a great read for me - but I'm not going to go into too much detail. I read this book without knowing anything and I suggest others do the same! (Though, I did look at some fan art and HOLY CRAP it looks so cool omg. But beware of spoilers.) The World Building/Magic SystemThis book somehow managed to have the most extensive world building and the most creative magic system I've ever read about WHILE keeping me totally invested AND not bored the entire time. Don't get me wrong... there are slower parts and there is A LOT to this world - but Sanderson introduced it in such a way that it only made me feel for the characters the more as he revealed the world. My gosh, it is so well done and it felt real.  I'll admit, I'm a bit of a lazy reader. I was seriously worried I would be confused the entire time because there is a lot to remember about the magic BUT Sanderson does a great job of reminding you what every magical skill/burning metal does each time he brings it up. So please, don't feel overwhelmed as you start going through this. As long as you get the general idea, you'll be totally fine. The Characters (get ready for some ridiculous fangirling)Good gravy. I freaking adored the ENTIRE CAST. Vin is just previous. I was SO connected to her the entire time - I just adore her so much. She's realistic. No special snowflakes here. Kelsier is a flipping genius and I have no words because just... ugh. Also his relationship with Vin was so touching. Okay I'm getting emotional. ELEND. YASSS ugh. He was adorbs. He and Vin were just... I just.... ugh. I LOVE THEM SO MUCH. (My only complaint might be I wished we had spent more time with them alone - developing their relationship.) BUT I knew about him before I started the series so I was just dying for him and Vin to meet... and OMG his intro is the BEST EVER. Sazed. Holy frick man you are a badass. Marsh? Omigosh. NO WORDS.Don't get me started on the genius villainous tactics Sanderson used with the Lord Ruler. You guys, these characters feel so real that its scary. Sanderson is a master. THE PLOTOkay, so I've mentioned it before. It is kinda slow to start - but not a bad slow. There is the perfect amount of development, in my opinion. This is just a long book - and it needs to be with the amount of connection Sanderson is trying to draw. Just go into this expecting a high fantasy - it is NOT a light read. I don't want to say much about the plot other than it is just brilliant. One things pick up (and they do) - its pretty much non stop until the end. There are some crazy plot twists and I was pretty much freaking out the entire last third of this book. Honestly this first book could be a stand alone- I did not expect so many things to be resolved in this.. but it was SUCH a pleasant surprise. I'm still sitting here with my jaw open over the ending. This is one of the best endings I've ever read.OverallSo, all this to say- this was an easy five stars. Literal perfection if you're into high fantasy. The writing was perfection. Everything was so detailed and real. WHY HAS THIS NOT BEEN MADE INTO A MOVIE. My Blog ~ Instagram ~ Twitter ~ Etsy"}, {"Review": "4.5 stars. I kept stalling on reading this because so many people told me I'd love it. I was worried the hype would be a letdown, but nope... this was SO GOOD. The last half was AMAZING and feels like a new favorite book, buuuut I honestly didn't get into it until around 40%. There's a lot about Allomancy and I wasn't entirely sure that I cared just yet. Parts dragged for me but I kept reading because I loved the characters.But the last half of this book is so intense and heartbreaking and brilliant... aaahh I don't even know how to explain the scale of this plot and how amazing the worldbuilding is. I got super invested in everything and am very sad... but also love how the book broke my heart? Yes. I could say more, but I liked that I went into it without knowing anything. Basically the hype is real and everyone who's been pushing me to read a Brandon Sanderson book is right -- I'm definitely a fan."}, {"Review": "This was an odd one for me. I've seen an enormous number of opinions about Sanderson's books on the fantasy forums I hang out on, the great majority favourable. I was interested to see what it was that had sold so very many books and got such an incredibly high average score on Goodreads. The opening was strong and engaging. Then I started to falter. For most of the book I didn't think that I would be giving it 5*. I started to worry that I might have a legion of Sanderfans on my case :oI think I am too much of a scientist for the magic system not to jar against me. I liked the complexity, and the effects, and the ways it was used were cunning, clever, and ingenious. But the ingredients and the execution fill me with unanswered questions.And for much of the middle section I was struggling through all the balls and house politics, having a hard time caring.And the plans felt flimsy and dubious...***BUT***But, the last hundred and fifty pages were a huge payoff and I really liked all the twists and turns. Also the action scenes were great, and the tension was kept high, nobody felt safe, the reveals kept coming ... it was all really well done and I had a blast with it.I've heard it said that Sanderson's biggest strength is plotting, and yes, the plot unwound splendidly.The reading experience and writing put me in mind of Brent Weeks more than any other writer I know.A really fun read.Join my 3-emails-a-year newsletter #prizes...."}, {"Review": "It reminds me of Ocean's Eleven meets The Italian Job, but set in Mordor after Sauron has ruled for 1000 years or so. In many fantasy stories, a dark lord is rising and it is up to our heroes to defeat him before that happens. In this, the Dark Lord is already set in place as the status quo and the heroes have to motivate others to want a change.....Yet there is a noble class of The Lord Ruler's flunkies who will need to be scammed and robbed along the way, to finance this big revolt.....I love it...The pace, style, and grand-heist-scheme-in-a-fantasy-setting plot remind me of Michael J. Sullivan's The Crown Conspiracy while the characters and rags-to-revolutionary story make me think of The Name of the Wind by Patrick Rothfuss. Certainly a great blending, as both of these were recent 5-star reviews for me....Okay, now I've finished it. All I can say is WOW. Why did I wait so long to read this? I must read the other two books in the series very soon......."}, {"Review": "Brilliant.Absolutely brilliant.Re-reads are a tough decision. There is a high chance you won't find the book as good as you thought it was all those years ago, that you will be disappointed and left with a bitter taste in your mouth, that the glass tower that protects your relationship with said book will be shattered. Re-reads can be intimidating. But that was not the case with The Final Empire. Although it sounds improbable, I appreciated it even more the second time around.\nHe was supposed to save them.\nHe was the Hero to kill the mysterious force known as the Deepness. But instead of saving mankind, He became its greatest oppressor. The Lord Ruler founded the Final Empire, dividing the population between nobles and skaa. He created the Steel Inquisitors, terrifying beings that instill His will and kill with no reservations. He destroyed what was beautiful and pure.\nDust and ash were falling from the sky.\nFor a thousand years, His rule was firm. Any attempts at resistance were drowned in blood. The skaa were slaves, they were beaten, raped, murdered like animals, while the nobles fought their petty wars for power.\nThey came with the mist.\n Allomancy, the inherent ability that allows the Allomancer to burn specific metals, offering powers that can enhance physical and mental capacities, was considered a privilege belonging to nobility. But mistakes happen. Vin, the street rat, is one of them. Her life consisted of stealing and hiding, until she crossed paths with an elite group of outlaws who were hired by the Resistance with one purpose: overthrow the Final Empire. With arrogant and reckless Kelsier as their leader, this bizarre gang adopts Vin, showing her a world where friendship is a reality and not an illusion, where her opinion matters, where she matters. And Kelsier teaches her how to harvest her powers. How to be a \nMistborn.\n\n“There's always another secret.” \nThe Final Empire is an outstanding work of a master storyteller; in this epic saga of betrayal, intrigue, resistance and survival, Brandon Sanderson, like a Tineye, increases the physical senses: in filthy, dim-lit alleys, you smell the despair, you hear the moans, you see the wretchedness, while in majestic ballrooms, you smell the perfumed bodies, you hear the gossip, you see the extravagant beauty that ignores the suffering that unfolds right outside. Like a Rioter, he enflames emotions: fear, worry, disgust, bravery, love, hope, utter, devastating heartache. With the mists engulfing your body, and the ash covering your clothes, you become a part of this ingenious, widely imaginative and strangely emotional story, and you realize with awe and admiration that Brandon Sanderson is the Lord Ruler of Fantasy.\n“But you can't kill me, Lord Tyrant. I represent that one thing you've never been able to kill, no matter how hard you try. I am hope.”\nAlternating between the headquarters of the gang, the skaa slums and the luscious estates of the noble houses, the setting was dreary and colourful at the same time. There was a delicate balance between the two worlds, and just like Vin, you tiptoed around them both, without belonging to one of them exclusively. The storyline was full of plans, plots, schemes, secrets and blood; while Brandon Sanderson excelled at one of my favorite plot devices, the infiltrate-the-ranks-of-nobility one, I was also highly invested in Vin's training, the espionage and the murders, the success and failures of the rebels. I was there the whole time, rooting, cheering.Weeping.The depiction of the most intricate and creative magic system I have ever encountered was, as expected, meticulous; the rules and restrictions of Allomancy, the dreadful order of the Inquisitors, the origins of the Lord Ruler, while they seemed confusing, they were elaborately crafted. But even though one would expect that the magic system would be the scene stealer, there was another force to be reckoned: the characters and their dynamics.\n“Our best efforts were never even a mild annoyance to the Lord Ruler.”“Ah, but being an annoyance is something that I am very good at. In fact, I'm far more than just a 'mild' annoyance--people tell me I can be downright frustrating. Might as well use this talent for the cause of good, eh?” \nKelsier, Vin, Ham, Breeze, Marsh, Dockson, they fit together like the pieces of a puzzle. Each of them added something different to the team, they complemented each other, frustrated each other, doubted each other, but they were a family nonetheless; a funny, loud, devoted family. Kelsier and his genious-borderline-crazy-and-suicidal-plans was the glue that brought them together, the fuel that kept them going. His humor, his arrogance, his hatred, his recklessness and his deep belief that he could change the world when everyone else had failed, marked him as one of the most exceptional characters out there; the way he cracked Vin's walls, the way he taught her not only Allomancy but also how to trust people and care for them was heartwarming, infused with mirth and affection. Vin was also extraordinary, her development happened in so many levels, she was multi-layered and accepted the different aspects of herself, from the scared girl that was beaten every two nights she became a Mistborn, a lady, a friend and a daughter. And let us not forget how endearing Elend Venture was. I just want to keep him safe and cuddle him for the rest of eternity, he's so precious.\n“Our belief is often strongest when it should be weakest. That is the nature of hope.” \nDear reader, I can't recommend The Final Empire highly enough. Please, grab a copy and food supplies for a couple of days, turn off your phone, keep the tissues nearby, and let Kelsier and Vin guide you to the city of Luthadel. Don't be afraid of the mists; just let them in.You can find this review on BookNest!"}, {"Review": "Note to self: You are no longer allowed to bring books this good on family road trips. It makes you antisocial. You ignore the great views outside the car. You resent being torn away from the book to spend time with family, and when you are you babble incessantly about how awesome it is and how everyone would like it and how cool the magic is and how great the characters and on and on and on until your family is probably sick of you. And then, even after an eight-mile hike in the desert when you're covered in sweat and dirt, you let your sister have first shower so you'd have more reading time. You even considered skipping dinner to finish it! This is the kind of book that stays at home in future, where you can sit and read all day and not be bothered.And now for the rest of you - all the above is true. For the few days I was reading it, this book did its level best to take over my life. It was addicting. I craved it like chocolate, and not being able to read was hard to deal with.I would expect nothing less from the man chosen to finish the Wheel of Time, or from a contributor to Writing Excuses, the podcast that got me into podcasts. I went into Mistborn ready to be impressed, but that's not what happened. I wasn't impressed. I was wowed. Blown away. Astounded. Engrossed. Shocked. Thrilled. And filled with a sense of loss when it was over.This is not a good book, my friends.This is a great book.This is what fantasy needs.As far as the genre is concerned, this book - this series - this author - is the Hero of Ages.Thank goodness for Brandon Sanderson. Thank goodness for a writer with such a depth of imagination; for the wildly creative systems of magic he creates; for his vivid and haunting settings; for his masterful plotting and artful twists which are, always, \"surprising but inevitable\". Thank goodness for a male writer who makes his female main character strong, but not in a masculine way. Vin is seriously amazing. So is the rest of the cast - my one objection is that there aren't any other women in significant roles, but maybe that'll change in later books.And the writing! I know from Writing Excuses that Sanderson has never wanted to be anything but an author, and that he spent years working as a hotel clerk so he had time to write, and that he had completed numerous novels before he managed to sell one. It shows. The language is almost entirely flowing and clear, suffering only occasionally from an over-use of commas. (One after every 'but' is a bit much.) More authors should learn to write like this. More authors should practice writing the way he has.Normally I find more to say about books I like, but this time I'm too impressed. Sanderson has amazed me beyond anything I expected. I can't wait to read The Well Of Ascension."}, {"Review": "MOTHER. FUCKING. FANTASTIC. The writing, the story, the characters, the world, the magic, the battle scenes. All fantastic!_ A beautifully intricate plot that includes, that's right!... A heist! (A heist?) Anyway, if that alone isn’t a reason enough, I don’t know what is. 👌_ The most badass thief among thieves who’ll also, without a doubt, steal your heart along the way. A criminal mastermind who could pull off the impossible. *Gushing* *GUSHING* 😍_ An unlikely heroine who's aware of her weaknesses and doesn't, (for once) think she’s invincible. But is lethal all the same. _ A good variety of amazing and dynamic side characters. Seriously, INCREDIBLE. Breeze is a DELIGHT, guys!😍_ And last but certainly not least, it is filled with amazing character interactions. The dialogues are insane.👌This is a high fantasy of epic adventures with real-world issues and nothing will prepare you for the twists and turns. I went from this... To this...To this...To this......enjoy. 😈"}, {"Review": "This is an epic fantasy series and The Final Empire, the first book in the trilogy is, in itself, epic. A world oppressed by a dark ruler sees a thieving group take upon the mantels of heroes. This, along with the help of their mystical power, Alomancy, determines the fate of the Mistborn. If anything, Brandon Sanderson certainly knows how to write alarmingly cool books. Awesome magic system Alomancy allows the wielder to burn metals, inside themselves, enhancing their physical abilities such as strength and their senses. It also allows them to push and pull certain metals, which means they can fire bullets with a thought. Some can mask the power of others and some can detect the power. These are called Mistings, but each type has a specific name and there are eight varieties. Mistings have but one metal they can burn granting them a specific ability associated with the metal but, a Mistborn can burn all of them. These powers are thrown into a colourless world, ruled by a tyrannical Lord, and combine to create a plot full of revolution and injustice. The thieves which seem to be a group of pompous swindlers are headed by an individual with remarkable depth and heroism: Kelisar. Kelisar is a full Mistborn who takes under his wing Vin who he instantly recognises as a fellow Mistborn. Ok so some of this may seem confusing at first but there is a handy explanation at the back of the book labelling each misting and their respective power which becomes helpful to the reader though it does begin to sink in eventually. Trust me when I say that this system is only as complex as it needs to be. Lots of character development This is where the exceptional character develop begins. Vin grows from an unconfident street urchin to Kelisar’s protégé and eventually becomes one of the leaders of the rebellion against the Lord Ruler. We, as the reader, watch her grow as she takes her first steps into her new reality as her powers begin to strengthen and perhaps may even one day outshine Kelisar’s. I love to see characters grow across a novel, and Vin certainly does that. Moreover, the side characters of the novel also develop as their origins and depths of their powers are revealed. “There's always another secret.' -Kelsier”The plot of this may sound very generic at first glance, but I assure it most certainly isn’t. At the end of this novel Sanderson quite literally terns everything around, and you learn how the world and the reader has been deceived. This is a good thing to do in a novel because the reader is sat their thinking “I know how this will end.” Well, I will say he certainly doesn’t. The ending is a very action packed climatic sequence and despite many conflicts being resolved, it still leaves it’s self-open for a hopefully equally as enjoyable sequel. Overall, this is a highly original novel and is undeniably very cool.  The Mistborn Series1.  The Final Empire - A misty four stars2. The Well of Acsension- A suprising four stars3.  The Hero of Ages - An awesome four stars"}, {"Review": "This book was wonderful and fantastic and amazing! It’s one of the best fantasy books that I’ve read. I hope I can do this book justice with my review. So bear with me while I ramble away.The main character of the book is Vin, a street orphan who has never known friendship or trust, not even from her own family. She’s a member of a thieving crew in the criminal underworld of the empire. No one can be trusted and greed overrules any sort of loyalty. But her hesitancy of trusting others begins to tumble when she meets Kelsier…Ah, damn! Kelsier! He is one of the most amazing fantasy characters that I’ve read. He is a legend in the underworld and one of the greatest crew leaders in the capital of Luthadel. He can pull off any heist but was caught by the Lord Ruler and sent to the Pits of Hathsin.But he escapes and becomes ‘the Survivor of Hathsin’! He's ruthless because he is broken, but he's still caring, charismatic and fearless. He believes in his cause and wants to save his people from abuse, slavery and death. Basically, he's everything a true leader should be. *sigh*The story begins when Kelsier returns to Luthadel with a new plan to overthrow the Lord Ruler and he puts together a crew of criminal masterminds to accomplish it. The characters make this book epic! Every character has a significant role in the story and the heist. They are all important. Some of the secondary characters surprised me with their role in the final part of the book. I just didn't see it coming. Bravo Brandon Sanderson for surprising me with your plot twists!The world that Sanderson builds is well thought-out and complex. It’s a remarkably world and I’m excited to see where the series will take me. The magic system is just so cool and original!While reading the the last 150 pages of this book, here are a few thoughts that occurred.\"What just happened?!\"\"Really?\"\"Wow!\"\"Nooooooooo!!!!\"\"Where did he come from?!\"\"She's a badass!\"\"No way!! Him?!\"So yeah, lots of thoughts going in my head last night as I finished The Final Empire.As you can tell, the ending of the book blew me away.So in final rambling thoughts, this book was solid.Solid plot, solid writing and solid characters. So yeah, it’s solid. 😉And amazing. And fantastic. And all that I’d hoped for!Without a doubt, I’m glad I finally found you Brandon Sanderson."}, {"Review": "I gave it 5 stars the first time, I give it five stars again!New edited review to come soon!Yes it took me a while to finish this book, but university just takes so much out of you! But enough about me, let's talk about this gorgeous piece of work right here! I love love loved this book, like as in simply adored! Kelsier broke my heart one too many time when he died, but it was the good kind of heartbreak. The kind that makes you hold you chest and go like \"wow that is some powerful stuff right there\", and everything else that goes along with that. I do admit that at the beginning the use of allomancy tended to confuse me at times, but as the book progressed the believable conscripts made it like the most natural thing ever, like blinking per say. This book deserves every single one of those stars, and I can't wait to get my hands on the sequel. Elend and vin better get their happily ever after........ Fingers crossed."}, {"Review": "Never in my life have I ever felt an incredible amount of disappointment that this book gave me. I'm literally so fucking bitter and salty that I didn't enjoy this hyped as fuck book that no one has ever written a single negative review for.I'M SEETHING. I WANTED TO LOVE THIS ONE SO MUCH. But the amount of boredom and info dump I encountered in the beginning of this book ruined everything. (view spoiler)[And I predicted Kelsier's death?? Based off of everyone's reactions I knew he was going to die. So when that scene came I was NOT surprised. (hide spoiler)]Full review to come.----My FIRST Sanderson novel y'all!!!!! I was going to start off with Steelheart, but everyone says this is his best. Anyways, this book is incredibly hyped and if it disappoints I will cry. Okay. Bye.ALSO: a br with my hoes maram and salmon (who I'll tag later)"}, {"Review": "I want this to be my first summer read, The Love Interest certainly doesn't count. \nSPOILER ALERT!\nYou know, when a book leaves you feeling dead inside?No? Then you obviously haven't read The Final Empire!!\n “He smiled despite the grief he felt at the deaths of his men; he smiled because that was what he did. That was how he proved to the Lord Rulerand to himself that he wasn't beaten.” \n \n\"Survivor of Hathsin,\" it said.\"You promised me a fight.\"Kelsier flares his metals. \"I never said we were done.\" Then he smiled.\"\nBrandon Sanderson, you owe me a novella or an entire series about younger Kelsier, his wife, and Marsh would be very, very nice! I don't care what they do in it. I don't care if there is a love triangle or love at first sight, or it's simply just a cheese-ball. If anyone deserves any cheese, it's kell! You give him what he deserves!I'm just going to pretend it's standalone! Do you really expect me to read The Well of Ascension and The Hero of Ages after that ending? What's the point anymore? (view spoiler)[ TLR is dead, and so is Kelsier (hide spoiler)] They were the reason i loved this book so much. I understand there are other unholy things that are going to come to life, and crazy shit is going to go down but i kind of don't care. If it were the last book i would've been more than fine with the ending but IT'S NOT! IT's only the beginning. Why would Brandon Sanderson do this to us? Why??! I had this whole review planned out, all my neatly written notes, highlighted quotes i was going to use. But 50 pages before the book ended i ripped and threw them in the garbage. I'm having Rose and Jack moment right now, except I WON'T LET GO! I'll sit on that frozen water for the rest of my life and i will never let go! Maybe in a year or two Oh, don't mind me, i just might be a little dead inside.. but that's okay.. right? Now i'm gonna go and drown in my own misery, and YOU need to go and read this book so we can be miserable together."}, {"Review": "\"He shall defend their ways, yet shall violate them. He will be their savior, yet they shall call him heretic. His name shall be Discord, yet they shall love him for it.\"A thousand years ago, a young and noble hero arose from rural obscurity into being hailed by Terris priests as the prophesised Hero of Ages. The nations and armies of the world were united beneath his banner in an effort to challenge the Deepness, the mysterious force of darkness threatening to engulf the world. All hope was placed upon a final, daring strike towards the fabled Well of Ascension. But the dreams and hopes of the world were crushed, and the hero’s great mission failed spectacularly.Since then, the entire world has been ruled by the iron fist of the Lord Ruler and his Final Empire. Those few who supported him from the beginning became the Imperial noble families, their existence filled with opulence and extravagance. Everyone else became the skaa, slaves forced to work until they die. Every attempted rebellion has failed, and the oppressive regime grows stronger and stronger with each passing day.But finally, a new kind of rebellion is being planned. One of subterfuge and infiltration. Of the ultimate heist. Of criminal masterminds and allomancers, those able to use the magic of the metals…Characters”Wherever she is, she tries to be as small and unnoticeable as possible. So tense. Vin didn’t sit, she crouched. She didn’t walk, she prowled. Even when she was sitting in the open, she seemed to be trying to hide.”The main protagonist of the book is Vin, a street urchin who has never known neither friendship nor trust. Growing up with a delirious mother and an abusive brother, she has survived on the ash-filled streets only though a combination of luck and cunning. Vin’s point of view is a rather unusual one in the fantasy genre, and Vin herself is an unlikely heroine. In the beginning, she always tries to make herself seem as small and inconspicuous as possible and thinks everyone else will eventually betray her. A member of a thieving crew, Vin is a part of the dangerous criminal underworld of the empire, where no one can be trusted and where petty greed is everyone’s only motivation. But all that changes when one day she meets Kelsier…”That man isn’t human. He might not be a mistwraith, but he’s not skaa either. I’ve heard of him doing things. Things like only they can do. The ones that come out at night.”Kelsier is a legend in the underworld. Once the greatest crewleader in the capital of Luthadel, a man who could pull off any heist, he was eventually caught by the Lord Ruler himself and sent to the Pits of Hathsin, a definite death sentence. But as the only one ever to do so, Kelsier escaped from the Pits, earning the name ‘the Survivor of Hathsin’, and the idolising reverence of the skaa. The story begins when Kelsier returns to Luthadel after all these years, with a grand new plan and a crew of criminal masterminds to execute it.The characters definitely make up one of the greatest strengths of this book. During the course of the book, Kelsier himself became, in my eyes, one of the greatest fantasy characters ever. The same goes for the mysterious and dark Lord Ruler. But it seems like every single character is a significant part of the story. They’re all brilliantly constructed, and they’re all important. A seemingly minor character in one chapter can suddenly turn out to be a major player in another. Almost everyone has a dark and painful past, and everyone has a part to play.Setting”It’s called a flower.” Kelsier said. “They used to grow on plants before the Ascension. Descriptions of them appear in the old poems and stories – things that only Keepers and rebel sages know about anymore. Apparently, these plants were beautiful, and they had a pleasant smell.”The Final Empire is in more than one way a dystopian world. There are no green things growing. There are no flowers and no beautiful nature. Frequent volcanic eruptions cover the world in rains of ashes, causing the world to turn dark and grey. And the nights belong to the mists, making people fearful of going outside after dark. For the mistwraiths are roaming everywhere.The political aspect and the society of the Final Empire is reminiscent of an even more extreme version of France just prior to the revolution. The common folk are oppressed and treated as slaves by the nobility, who spend their time going to balls and festivities in their illustrious keeps. The regime rules with religious legitimacy, and in the beginning only the more privileged among the lowborn people speak of defiance and rebellion.Another exceedingly interesting part of the setting is the book’s magic system. Allomancy is the power to control different metals, and to control everything else through the use of different metals. The powers themselves are reminiscent of the Force powers of the Jedi, but the source of the power, swallowing and “burning” metals inside one’s body, is completely new where magic systems go, and provides a rather unique touch to this setting.Personal opinion”There is always another secret.”That one line seems to be the trademark of this book. For every bit of information being revealed to a character or to the reader, for every plan being set in motion, there is always another secret. When you think you’ve got it all sorted out, when the story is going towards a conclusion, yet more of those secrets are revealed. And even when the book ends, there are still secrets that have yet to be revealed.Mistborn: The Final Empire is certainly one of the best books I have read this year, and I would not be exaggerating if I should call it one of the best fantasy books of this century. Like any other book, it had its downsides, but those were few and insignificant enough to not have any impact on my opinion of the book as a whole.Sanderson’s writing is particularly impressive. Throughout the entirety of the book, he managed to fill me with all kinds of different emotions. He made me furious, he made me laugh and he surprised me. The book contains tons of twists and turns of the plot, most of which are predictable, but in such a way that they add to the overall quality of the book instead of making it boring. And of course, certain events and revelations are not predictable at all, especially nearing the end of the story.This is, for all intents and purposes, a four-star book. So you might wonder why I chose to give it five. And the reason for that is quite simply that I have a tendency of giving five-star ratings to books containing a special scene or detail that I consider to be… well, perfect is as good a word as any (I am apparently easily influenced that way). This book actually had two of those. But there is always another secret, and this must remain secret from those of you who have yet to read this. But you should know that these details alone are more than enough to make the book worth reading.(view spoiler)[The first one of those small details was the way each chapter began with a paragraph from the famous logbook. That insight into the mind of the Hero of Ages, the tale of his journey to the Well of Ascension and his thoughts about the old world in general, was just extraordinary. The way it was written, as a small taste of something better in a world consumed by evil, added something more to the main story that it could not have managed on its own.The second detail was the letter Kelsier left behind for Vin to read. When the reader is following the desperation of the remaining crewmember and is split between anger and grief after Kelsier’s brutal death, this letter arrives with lines like “Please don't be angry at me for abandoning you.” and “Farewell. I'll tell Mare about you. She always wanted a daughter.\" The scene where she read that was just exceptionally moving for me. (hide spoiler)]So, in the end, the only thing left to say is that this was something truly extraordinary. Mr. Sanderson himself has repeatedly stated that he has always wanted to avoid following in the footsteps of the fantasy authors that came before him and instead to create something new, and that is certainly an ambition that has been fulfilled with this book. There are, of course, some fantasy tropes and some character archetypes being used here, but overall this is something different entirely.I would not hesitate to recommend Mistborn to absolutely everyone. And ‘recommend’ here roughly translates to ‘hit people in the head with this book until they finally agree to read it’.And yes, Sanderson certainly has got himself a new fan."}, {"Review": "I am dead. I bought this book in January after hearing so much hype around it and I attempted to read this book at least 10 times since then. I got about 20 pages in each time before I got intimidated and put it on hold. FINALLY, I decided to pick it back up again and push through and oh my god I wish I had read this book sooner. It was incredible. I honestly have no words to even describe this amazing book. Just wow. The hype was so worth it for this one and I cannot wait to see what is in store in the coming books. This book guys, this damn book. Wow.I actually loved every single character in this book?! I'm shocked. There's always someone I don't like as much as the rest but I LOVED THEM ALL. Kelsier. Vin. Elend. Sazed. Breeze. Ham. Marsh. Dox. Spook. All of them are precious angels and I want to love them all. You can bet I'm going to the bookstore tomorrow buy every book Brandon Sanderson wrote because damn this book was amazing. Fantastic. Incredible. A+"}, {"Review": "Actual Rating: 4.5 StarsThis was my book club's pick of the month! I can't even believe this was so good. I mean I can, because it's Brandon Sanderson! But seriously... This was an excellent high fantasy novel. I'm going to try to put my feelings into words, but I find I have a harder time writing positive reviews vs. negative reviews. \nThe World/Magic System:\nThis novel takes place in a world devoid of most of its natural color. It's a ruthless empire that has built its foundation on the backs of an enslaved \"lesser\" race, the Skaa. The noble houses dance around each other in deadly games of power and wealth, pawns before the great god-like Lord Ruler. Allomancy was by far one of my favorite aspects of this world. It was so creative! A magic system where you ingest and \"burn\" different pure metals in order to gain unique abilities? THAT IS SO COOL! I cannot get over how distinctive Sanderson's worlds are, they always leave a huge impression on me. When I think back on them after closing the book, I just want to know more. I want to know all of the complexities behind these systems, every nook and cranny. They're just that fascinating. \nThe Characters:\nSo, one of my favorite literary situations is that of a band of rough, talented folks...thieves...miscreants...scammers... coming together to accomplish *the thing*. I think my love of this set up really began with The Thief Lord, which I read as a small child. Since then it's always appealed to me, and I honestly had no idea I would encounter it in this book. But it was so well done!Vin. A young member of a Skaa thieving crew, surviving the streets by brandishing her unique ability to bring \"luck\" to any given situation. Kelsier. An optimistic and cheerful leader with a dark, gruesome past. Breeze. A witty nobleman who's abandoned his title to participate in the dealings of the Skaa underworld. Sazed. A humble, kind-hearted scholar and Keeper who catalogs vast amounts of information so it is not lost to future generations. And these are only a couple of the unique characters present here. I loved the character interactions, I was deeply interested in their personal stories, and I took the trip with them wholeheartedly. \nThe Plot:\nI want to say that while I totally adored this book, the plot is not something I've never seen before in its simplest form.It's essentially an oppressed group seeking to topple a privileged group. In this case, the Skaa people vs. the nobility of the Final Empire. However, the way in which these characters relate to the plot is what made it so special. I love authors that write rich histories and weave intricate political webs. I love when characters must examine and debate and weigh the consequences of their actions. This book hits all of those high points!When I read Sanderson's books, I get the feeling of someone painting a picture for me. It's large strokes and small strokes, bits of information here and there that come together in the end to form a masterpiece. Every time I pick one up, I instantly get a sense of returning home and I'm already looking forward to the day I reread The Final Empire."}, {"Review": "Well, for starters, this was the best prologue of any book I've ever read. I have been neglecting this series (and author) for far too long, and after I read that prologue I was fiending for the actual story. Is fiending a word? I think it's slang. Now I'm answering my own questions in a review. Whatever, I like fiending and I'm keeping it! This story has two very predominate social classes in this book; The nobility and the slaves. The Lord Ruler is the \"God\" of this world, and his corrupt government is The Final Empire. The Final Empire is filled with \"Inquisitors\" which are men selected by The Lord Ruler and then remade into things that are more powerful and stronger than any normal man or woman. Plus, they have really creepy spikes going through their head, chest, and back. The Lord Ruler rents Skaa citizens out as slaves to the wealthy nobles, while the other prisoners are forced to work and die in his mines. The Lord Ruler is also very strict with the sexual reproduction of mixed classes/breeds, so most nobles will kill the Skaa women they've been intimate with shortly after. They are obviously being mistreated, and you soon find out that many are behind a rebellion that might actually stand a chance at doing something about this world's oppression.Oh, and the world is constantly raining ash (and mist at night), causing the world to be dark and rather lifeless. There is a frequent conversation about how the old world, before the Lord Ruler's rule, had actual flowers growing from upon the ground and on the fruits. The characters are in awe and disbelief over this. Nothing is green, everything is just grey.Brandon Sanderson's writing is simple and easy to understand, but you are thrown into a world with a very unique premise. I think he really paves his own path for fantasy, and stays away from regular fantasy tropes. I was a little overwhelmed by the allomantic skills until I was able to write most of them in my notes. What a unique concept though! Burning different elemental metals for different powers was so different, and I loved it. After you finished this book (I have the three ebook bind-up) they give you a neat little chart of the eight basic alloys and a little index of all the jobs. I was so sad I didn't know about this, or that it wasn't at the beginning! Each chapter begins with a paragraph that feels very significant, but a little out of place. I was so sure it was the main character's journal or diary at first, then I started thinking it was the Lord Ruler. It was such a wonderful little mystery! I can't applaud Brandon Sanderson enough. This minor detail was enough for me to not only want to continue on with this series, but to also branch out to some of his other works. This book is mostly centered on two nonconventional heroes; the first being Kelsier, who is the hero every world needs. He's selfless and always believes in doing the right thing. And not in the fake, over the top, eye-rolling way, but in an actual \"he's a good person\" way. He's a skaa, who is in charge of a thieving crew, but this heist (to overthrow the Lord Ruler) might be bigger than anyone expected. He is also famous in this world, for being the only person that has escaped the Lord Ruler's mines, the Pits of Hathsin. Kelsier might get a little discouraged throughout the book, but he never gives up. He shows what ultimate sacrifice truly is. He also proves to Vin that she won't always be abandoned. (view spoiler)[I was so fucking invested in Kelsier, his death completely broke me and my little black heart. Then the letter he left for Vin, “Farewell. I'll tell Mare about you. She always wanted a daughter.\" Please, stop cutting onions, whoever you are. (hide spoiler)]The next star of this book is Vin, who is one of the strongest female leads I've read about to date. She starts out as an abandoned little girl form that streets that somehow managed to survive, and then she meets Kelsier. Her growth was absolutely beautiful, and she eventually masters the \"I'm a badass who also likes to dress up\" role that Celaena in Throne of Glass fails so very hard at. There isn't much romance in this book, but I absolutely devoured the ball/party scenes with Vin and Eldon. I loved watching Vin develop from this scared and hurt child who just sat on the sidelines, into this brave and selfless girl who is becoming a strong woman. I liked and connected with Vin the entire book, but that very last line - it got to me. I started shedding all these tears, before I even realized how it made me feel. That one simple sentence was just so perfectly placed, and ended up being so powerful. “And realized that was all she had ever really wanted.”Vin and Kelsier are both mistborns that use all of the metals in the allomantic chart above. If you can only control one of the basic elements you are just a misting. Both are rare, but mistborns are incredibly rare, and both mostly come from high noble houses. These skills come in very handy in starting a rebellion, and we find out that some mistborns are more powerful than others from their bloodline. We also have mistwraiths, which end up playing a very substantial role among the rest. Besides Vin, my favorite character was Sazed. Sazed is sort of Vin's steward in this book. He helps get her ready for high society life, while teaching her proper etiquette. He is a Terrisman , who studies and memorizes religions from before the Lord Ruler, so he can one day teach the world all these awesome forgotten religions. Sazed also teaches us about a second magic system, Feruchemy. He was such a compelling character, who won me over so quickly! I feel like his character not only brought together all the puzzle pieces we were missing, but some of his lines like me in awe as well. “Belief isn’t simply a thing for fair times and bright days, I think. What is belief—what is faith—if you don’t continue in it after failure?”Since this is my first Brandon Sanderson book, I have no idea who Hoid is or his importance, but I'm guessing he's like a hidden Easter Egg. After I finished this book, I went to YouTube to listen to a couple discussion groups, and they were all freaking out about Chapter 19 and Hoid's appearance. In this chapter, Hoid gives some information to Kelsier that would be rather impressive for a common beggar to know. What I can piece together is that he is a world traveler that is from other Brandon Sanderson books, which doesn't really affect my reading experience, but I figured I'd add it to my review in case it has relevance for one of my followers. Plus, I love Easter Eggs in my books, video-games and movies, so kudos for Brandon Sanderson!The ending was so, so, so good. Everyone told me going into this series that they only get better, so I cannot wait to start the next, because this one surpassed all of my expectations (view spoiler)[I bet the deepness, that I think the Lord Ruler was keeping at bay with atium, and is now going to make a very deadly appearance  (hide spoiler)]. I can honestly say I'm  fiending for The Well of Ascension. Look at that, full circle, boom!Also, my friend Markus brought up, in his review, how Allomancy is like the Force powers of the Jedi and he completely blew my mind. I haven't seen any of my other friends make this parallel, so I just had to link his review and gush over how freakin' perfect of an assessment that is. Blog | Twitter | Tumblr | Instagram | Youtube | Twitch"}, {"Review": "No words really to review this book or explain to you where it stands on the scale of bookish epicness. And this is after reading it 4 times. This series will always hold a unique place in my heart. It was my first exposure to adult fantasy and the start of my bookish obsession (since before that I didn't read actively for a good 3 to 4 years! *shudders*) as well as fandoms since the Potter days. Not to mention that it's perfect from start to finish. I will love it till death do us part.  Previous review:  Reread: Feb 2016Well, it was perfect obviously. I've read this book 3 times now and I'm still blown away by how incredibly good this is. Everything about it for me was perfect. The characters, world building, plot, pacing, writing, all exquisitely done. This book, this trilogy is godsend. Sanderson is a genius. A mastermind. That is all."}], "Image": "https://images.gr-assets.com/books/1480717416l/68428.jpg", "Desc": "In a world where ash falls from the sky, and mist dominates the night, an evil cloaks the land and stifles all life. The future of the empire rests on the shoulders of a troublemaker and his young apprentice. Together, can they fill the world with color once more?In Brandon Sanderson's intriguing tale of love, loss, despair and hope, a new kind of magic enters the stage — Allomancy, a magic of the metals."}