{"Genre": "Fantasy", "ID": "34", "Name": "The Fellowship of the Ring", "Reviews": [{"Review": "Never have I been so sad to give a low rating to such a revered book. I'm so sorry. I can't tell you how sorry I am.Again, I'm so sorry, but I found this book unbelievably dull. I really am so, so sorry. I'm desperately sad about this. This series has been such a foundation for modern-day fantasy that I'm incredibly disappointed in myself for not liking this. I have always wanted to be a Tolkien fangirl. I've always wanted to learn Elvish and get completely offended à la Stephen Colbert but I can't. I just can't. I want so desperately to love Tolkien, but it just ain't happening. I've been trying this book for 17 years. Tolkien and I have a sad history. I've always been a book lover, when I was young, I would persist through any book, no matter how trying. The Hobbit was the first book that made me fall asleep. It's memorable to me because that's the first time, and only the second time it's ever happened. The other book that made me fall asleep? You guessed it. The Fellowship of the Ring. I tried The Fellowship in 10th grade. I couldn't get past Bilbo's birthday party. I tried it again almost 10 years ago when I was stuck in bed for several days due to, oh, a giant surgical wound in my neck. My doctor said I had to stay in bed for a few days. So, I reasoned, what better way than to resume my attempt at reading one of the greatest literary classics of all time than whole having no other option?Audiobook it was! I didn't last past Tom Bombadil before I decided, fuck this, I'm going to head to the gym with a bloody bandage on my neck. True story. I got a lot of really weird looks. My doctor gave me a prescription for Vicodin because he was concerned the pain would be too much to bear. Apparently, I didn't even need the Vicodin because that pedophile Tom Bombadil put me right to sleep.Seriously, were it not for the fact that it is written by Tolkien, I would have hated this book. It was so unbelievably dull. There were parts, that to a Tolkien amateur like me, didn't have a whit of relevance or anything interesting to add to the plot (namely, say, the first 700 pages of the book). Seriously, what the fuck is up with the farmer and Tom Bombadil?The plot was all sorts of disjointed. Some parts just didn't make any sense. Tolkien is a linguist at heart, and it shows, because all the famous quotes we know from him are just sound bytes. In context, sometimes they don't really make any sense. All the poems and songs are in there to sound pretty, and frankly, they bored the fuck out of me.For instance, in the middle of a serious dinner party where the company is just trying to decide what to do about the ring (surely a simple task), all of a sudden little Frodo stands up and solemnly announces.\nAll that is gold does not glitter,Not all those who wander are lost;The old that is strong does not wither,Deep roots are not reached by the frost.From the ashes a fire shall be woken,A light from the shadows shall spring;Renewed shall be blade that was broken,The crownless again shall be king\nI was like what the fuck, man?! Where did that come from? It makes absolutely no sense in the context of the scene. Oh, sure, it's an inside thing on how Aragorn was the secret king, but nobody knew that! Everyone, elf, hobbit, dwarf, (and me) would have thought he was completely high on some elven grass.Let me make this clear: I do not, for an instance, doubt Tolkien's literary value. I think he has been an inspiration to generations of writers, artists, hell, gamers. My beloved World of Warcraft game featured elves, pretty much every fantasy book we have these days have been inspired in one way or another by Tolkien. Again, he was an amazing linguist, his work developing the Elvish tongue, among others, as well as his efforts in developing the rich, fantastic history of the world within his books is not to be disregarded by any means.But again, he is a linguist. He is a scholar. He may be the most brilliant one of those in the world, an inspiration to generations, but for me, personally, his writing is not to my tastes.But damn, the movies were amazing!"}, {"Review": "Authors who inspire a movement are usually misunderstood, especially by those they have inspired, and Tolkien is no exception, but one of the biggest misconceptions about Tolkien is the idea that he is somehow an 'innovator of fantasy'. He did add a number of techniques to the repertoire of epic fantasy writers, and these have been dutifully followed by his many imitators, but for the most part, these techniques are little more than bad habits.Many have called Tolkien by such epithets as 'The Father of Fantasy', but anyone who makes this claim simply does not know of the depth and history of the fantasy genre. For those who are familiar with the great and influential fantastical authors, from Ovid and Ariosto to Eddison and Dunsany to R.E. Howard and Fritz Leiber, it is clear that, long before Tolkien, fantasy was already a complex, well-established, and even a respected literary genre.Eddison's work contains an invented world, a carefully-constructed (and well-researched) archaic language, a powerful and unearthly queen, and a central character who is conflicted and lost between the forces of nobility and darkness. Poul Anderson's \nThe Broken Sword\n, which came out the same year as The Fellowship of the Ring, has distant, haughty elves, deep-delving dwarves, a broken sword which must be reforged, an epic war between the armies of light and darkness, another central character trapped between those extremes, and an interweaving of Christian and Pagan worldviews.So, if these aspects are not unique to Tolkien, then what does set him apart? Though Dunsany, Eddison, and Anderson all present worlds where light and dark come into conflict, they present these conflicts with a subtle and often ironic touch, recognizing that morality is a dangerous thing to present in absolutes. Tolkien (or C.S. Lewis), on the other hand, has no problem in depicting evil as evil, good as good, and the only place they meet is in the temptation of an honest heart, as in Gollum's case--and even then, he is not like Eddison's Lord Gro or Anderson's Scafloc, characters who live under an alternative view of the world, but instead fluctuates between the highs and lows of Tolkien's dualistic morality.It is a dangerous message to make evil an external, irrational thing, to define it as 'the unknown that opposes us', because it invites the reader to overlay their own morality upon the world, which is precisely what most modern fantasy authors tend to do, following Tolkien's example. Whether it's Goodkind's Libertarianism or John Norman's sex slave fetish, its very easy to simply create a magical allegory to make one side 'right' and the other side 'wrong', and you never have to develop a dramatic narrative that actually explores the soundness of those ideas. Make the good guys dress in bright robes or silvery maile and the bad guys in black, spiky armor, and a lot of people will never notice that all the 'good guys' are White, upper class men, while all the 'bad guys' are 'brutish foreigners', and that both sides are killing each other and trying to rule their little corner of the world.In Tolkien's case, his moral view was a very specific evocation of the ideal of 'Merrie England', which is an attempt by certain stodgy old Tories (like Tolkien) to rewrite history so that the nobility were all good and righteous leaders, the farmers were all happy in their 'proper place' (working a simple patch of dirt), while both industrialized cultures and the 'primitives' who resided to the South and East were 'the enemy' bent on despoiling the 'natural beauty of England' (despite the fact that the isles had been flattened, deforested, and partitioned a thousand years before).Though Tom Bombadil remains as a strangely incoherent reminder of the moral and social complexity of the fantasy tradition upon which Tolkien draws, he did his best to scrub the rest clean, spending years of his life trying to fit Catholic philosophy more wholly into his Pagan adventure realm. But then, that's often how we think of Tolkien: bent over his desk, spending long hours researching, note-taking, compiling, and playing with language. Even those who admit that Tolkien demonstrates certain racist, sexist, and classicist leanings (as, indeed, do many great authors) still praise the complexity of his 'world building'.And any student of the great Epics, like the Norse Eddas, the Bible, or the Shahnameh can see what Tolkien is trying to achieve with his worldbuilding: those books presented grand stories, but were also about depicting a vast world of philosophy, history, myth, geography, morality and culture. They were encyclopedic texts, intended to instruct their people on everything important in life, and they are extraordinarily valuable to students of anthropology and history, because even the smallest detail can reveal something about the world which the book describes.So, Tolkien fills his books with troop movements, dull songs, lines of lineage, and references to his own made-up history, mythology, and language. He has numerous briefly-mentioned side characters and events because organic texts like the epics, which were formed slowly, over time and compiled from many sources often contained such digressions. He creates characters who have similar names--which is normally a stupid thing to do, as an author, because it is so confusing--but he’s trying to represent a hereditary tradition of prefixes and suffixes and shared names, which many great families of history had. So Tolkien certainly had a purpose in what he did, but was it a purpose that served the story he was trying to tell?Simply copying the form of reality is not what makes good art. Art is meaningful--it is directed. It is not just a list of details--everything within is carefully chosen by the author to make up a good story. The addition of detail is not the same as adding depth, especially since Tolkien’s world is not based on some outside system--it is whatever he says it is. It’s all arbitrary, which is why the only thing that grants a character, scene, or detail purpose is the meaning behind it. Without that meaning, then what Tolkien is doing is just a very elaborate thought exercise. Now, it’s certainly true that many people have been fascinated with studying it, but that’s equally true of many thought exercises, such as the rules and background of the Pokemon card game, or crossword puzzles.Ostensibly, Scrabble supposedly is a game for people who love words--and yet, top Scrabble players sit an memorize lists of words whose meaning they will never learn. Likewise, many literary fandom games become little more than word searches: find this reference, connect that name to this character--but which have no meaning or purpose outside of that. The point of literary criticism is always to lead us back to human thought and ideas, to looking at how we think and express ourselves. If a detail in a work cannot lead us back to ourselves, then it is no more than an arbitrary piece of chaff.The popularity of Tolkien’s work made it acceptable for other authors to do the same thing, to the point that whenever I hear a book lauded for the ‘depth of its world building’, I expect to find a mess of obsessive detailing, of piling on so many inconsequential facts and figures that the characters and stories get buried under the scree, as if the author secretly hopes that by spending most of the chapter describing the hero’s cuirass, we'll forget that he’s a bland archetype who only succeeds through happy coincidence and deus ex machina against an enemy with no internal structure or motivation.When Quiller-Couch said authors should ‘murder their darlings’, this is what he meant: just because you have hobbies and opinions does not mean you should fill your novel with them. Anything which does not materially contribute to the story, characters, and artistry of a work can safely be left out. Tolkien's embarrassment of detail also produced a huge inflation in the acceptable length of fantasy books, leading to the meandering, unending series that fill bookstore shelves today.Now, there are several notable critics who have lamented the unfortunate effect that Tolkien’s work has had on the genre, such as in Moorcock’s \nEpic Pooh\n and Mieville’s diatribe about every modern fantasy author being forced to come to terms with the old don's influence. I agree with their deconstructions, but for me, Tolkien isn’t some special author, some ‘fantasy granddad’ looming over all. He’s just a bump in the road, one author amongst many in a genre that stretches back thousands of years into our very ideas of myth and identity, and not one of the more interesting onesHis ideas weren’t unique, and while his approach may have been unusual, it was only because he spent a lifetime trying obsessively to make something artificial seem more natural, despite the fact that the point of fantasy (and fiction in general) is to explore the artificial, the human side of the equation, to look at the world through the biased lens of our eye and to represent some odd facet of the human condition. Unfortunately, Tolkien’s characters, structure, and morality are all too flat to suggest much, no matter how many faux-organic details he surrounds them with.My Fantasy Book Suggestions"}, {"Review": "I’m not going to write a normal review; it’s almost impossible for a fantasy fan to do so in this case. Instead I’m going to give you a series of ten points to explain exactly why I love this particular book. Take from it what you will. There will be spoilers. Here goes:  1. The wizards! \"“Do not meddle in the affairs of wizards, for they are subtle and quick to anger.” Now I do love wizards. Who doesn’t? The wisdom of Gandalf is unmatched. He is, in effect, the leader of the forces of light. He is the commander in chief, the battle general and the tactician. He organises everything. From Aragorn’s coming, to the hobbits bearing the ring, Gandalf is behind it all. He has walked middle earth for thousands of years. He has seen it all. And he understands the perilous nature of the quest better than most. He is the grand optimist, the man who sees the best in people. He should have been the leader of the Isatri. He was the most pure. He is nothing like the changeable leader of his order. Contrastingly, Saruman is the realist. He is neither light nor dark, but a being who can adapt to the circumstance. He saw only defeat for man, so he turned his cloak and helped to usher in the doom of middle earth. His mind was poisoned by the palantir, Sauron fed of his ambition and bent him to his will. Something Saruman didn’t fully conceive. He considered himself the equal of Sauron. In reality, if Sauron had regained the ring, he would have crushed Saruman like a bug. And if Saruman had gained the ring first, things would have become much different. It would have been a war between the two, one that would have unforeseen circumstances. 2. A desperate quest The quest itself, the sending of just nine people to destroy the conduit of darkness, speaks of desperation. The elves are not what they once were in the first age. Their power has diminished: their people are leaving these lands. They do not have the power to stand against the tide. The Dwarves are shattered and broken. Their leadership in Erabor has their own problems to deal with. They, too, face invasion. And men, men, are weak. Well at least according to Elrond. So sending of a small party of mighty heroes, and a few untested hobbits, is a back door attempt of destroying the evil that infests middle earth. And I love it. Have you ever read about a quest so unlikely and so improbable? “I will take the Ring\", he said, \"though I do not know the way.” 3. A Hidden KingOther than the obvious wizard, the agile elvish prince, the stalwart dwarf lord, the fellowship has a secret weapon. Aragorn, the heir to Isildur, has finally come forth. “All that is gold does not glitter,Not all those who wander are lost;The old that is strong does not wither,Deep roots are not reached by the frost.From the ashes a fire shall be woken,A light from the shadows shall spring;Renewed shall be blade that was broken,The crownless again shall be king.”He alone has the power to unite the failing world of men. Only he can save the white tree of Gondor and insure that men do not fall into darkness. And the darkness, it genuinely fears him. He is the last hope of men: he is their salvation. His ancient ancestor Isildur struck the ring from the hand of evil; thus, Sauron fears his coming. However, he is more powerful than Isildur. He has lived amongst the elves, and he has learnt how his ancestor failed to crush the darkness in his vain weakness. Aragorn will not make the same mistake. He will do better. 4.Loyalty The party itself, the Fellowship of the Ring, are bound together with a mutual goal. But it’s more than that; they are dependent on each other. Each has skills the others could never possess. And each brings with him the hope of a people. Simply put, these heroes cannot fail. Middle earth depends on them. They are the best of their races, the most representative of their cultures, and their participation speaks of a will to conquer the shadow that approaches. It speaks of commitment. 5.Finding your courageNot all the party have been fully tested. With them travel four young hobbits, the most unlikely of companions for such a journey. They are the overlooked, the forgotten about, the race that is casually discarded and considered insignificant in the wider world. And perhaps this has been the downfall of society in middle earth previously. The forces of darkness exploit everything they can get their hands on, from giant spiders to rampaging trolls, from dragons to orcs, from men of the east to the undead, Sauron tries to wield it all. This is something the forces of good have not fully considered until recently. Within the bosom of the hobbit beats a strong heart of fortitude and resilience. “My dear Frodo!’ exclaimed Gandalf. ‘Hobbits really are amazing creatures, as I have said before. You can learn all that there is to know about their ways in a month, and yet after a hundred years they can still surprise you at a pinch.” They carry with them the key to destroying the dark. Bilbo showed them how he could resist the ring. The hobbits are an almost incorruptible race, and because of this they are Sauron’s doom. It is something he has overlooked. “It would be the death of you to come with me, Sam,\" said Frodo, \"and I could not have borne that.\"\"Not as certain as being left behind,\" said Sam.\"But I am going to Mordor.\"\"I know that well enough, Mr. Frodo. Of course you are. And I'm coming with you.” 6.The Rich History Middle earth didn’t pop up overnight. This word has been around for thousands of years. Such can be seen from the ruined statues and monuments that dot the landscape, to mentions of historic battles and finally to kings long since departed. This is a world that has seen a lot. This moment in the third age, which is arguable the most important series of events this world will ever see, is merely the surface. Go read  The Silmarillion. Go see how old and beautiful this world is. I could lose myself in Middle-earth. And this book carries with it all the baggage of what came before. It’s extraordinary. 7.The Diverse Languages and RacesAnd with this history comes the language of the people. The elves, the men, the dwarves and Sauron’s creatures of darkness all come with their own developed languages. This isn’t some random phrases stuck in the book, which you may see with other fantasy novels, but actually fully developed languages. They have their own grammatical forms, syntax styles and sound qualities that reflect the speaker. The languages are real. Naturally, the elvish language is a personal favourite of mine: 8.The Power of RedemptionIt is easy to judge Boromir of Gondor. He tried to take the ring from Frodo, though for all his misguidedness, he was trying to do right by his people. He naively believed, due to his farther Denethor, that the ring could be wielded against the evil. So when a young hobbit is trying to destroy his people’s supposed salvation, he strikes.Until that moment he doesn’t fully understand the evil it holds, until his desire for it twists his heart and turns him violent. But, afterwards, after he sees what he has become, his willpower does prevail: he understands. He later dies defending the Fellowship of the Ring, a bloody end, but one that saves his honour. 9. The Forces of Darkness  One evil binds them all. Sauron tried to make himself the ultimate tyrant, and claim dominion over all lands: he wanted to be the de facto ruler of middle earth. He failed. Those that followed his initial claim are forever left in the dark. Their souls are black, their hearts corrupt: their bodies no more. The Nazgul have become the living dead; they are complex figure, driven by hate and a will no longer their own. These men have become something else. Do they wish to rest? I do not know. Do they wish to carry out their master’s work or are they driven by his domination? I do not know. Orcs are mere tools for the darkness, the Nazgul are something much darker. They are the perfect harbingers of their lord. 10. The Elves  The elves are my favourite part of middle earth. I should have been born an elf. I would love to spend a few years in Rivendell, especially in Elrond’s library relaxing by the waterfalls reading the histories of middle earth. Doesn’t that just sound like so much fun? The best thing about reading fantasy like this is the pure escapism it provides, the worse thing is realising how shit the “real world” is in comparison. To quote another fine author of fantasy, and to conclude this review, I will simply repeat these words: \n\n\"They can keep their heaven. When I die, I’d sooner go to middle Earth.\"\n\n"}, {"Review": "A review of Lord of the Rings: Fellowship of the Ring, by SauronHello. You may remember me as the title character of the Lord of Rings. I go by a lot of names: Dark Lord of Mordor, Sorcerer, Red Eye, Dark Power, Lord of Barad-dûr, Ring-maker and Base Master of Treachery (I use that one in my band). I actually object to Tolkien's chosen name of Sauron, which I understand originates from an adjective that means \"foul, putrid\" in his crappy invented language. What can I say, the showers in Mordor are sketchy at best. On weekends, my poker buddies call me Sauron the Destroyer of Nacho Platters. Because Tolkien intentionally failed to give a proper description of me in his books, allow me to give you an idea. I have a bit of a dark look. My quest for world domination having been thwarted, I watch a lot of TV these days. My body is roughly equivalent to the \"The Situation\" on Jersey Shore. Oh, no I don't watch that, but the Witch-king of Angmar is obsessed. He won't shut up about Snowcone or some bimbo on that show. I'm missing a finger, which while preventing me from raining down carnage on Middle Earth, allows me to collect decent EI. Plus the best lawyer in Mordor got me covered under the dismemberment clause on my insurance, so I'm riding the double dip gravy train. Much has been written about my terrible Lidless Red Eye, blah blah blah. It freaked out that little twat Frodo pretty good. I'll have you know that conjunctivitis is no laughing matter. Having to keep it open 24/7 to look for hoodlums skulking around Mordor is murder on my hydration. The Nazgul have enough lift and aim to get up there to toss a bucket of Visine at it, but it's just temporary relief. Regardless, I'm still more of a looker than your precious King Elessar or Aragorn or whatever he's calling himself these days. He's never met a brooding look he didn't like. Buy a razor. Get a real job.Someone sent me Peter Jackson's movies in the mail. The package had no return address but it was postmarked \"Hobbiton\", where ever the hell that is. As I watch these movies over and over (I never even finished the books) I was reminded of all my mistakes...Perhaps a ring was not a good choice. Some buddies have suggested that maybe I shouldn't have tied all of my terrible powers to something as easy to misplace as the One Ring. In retrospect, I should have forged The One Gas Station Bathroom Key Chain of Power. It would have been a lot harder to tief. I even could have pimped it out by making it from an Ent branch or Saruman's foot, for all the good that old fart did me. Maybe a ring would have been just fine if it had been a toe ring. Then it wouldn't glow in the dark like a target for every freaking Man on the battlefield. I heard that the guy who beat me was named \"Isildur\"!!?? WTF. Maybe I could have worn tougher gloves, I don't know. Perhaps the door to the Fires of Mount Doom should have had a better lock. ADT could have hooked me up with motion detectors but I hear that even cats can set those off. They claim they can calibrate them but I'm not so sure. The Uruk-hai are always jumping up on the table, so they would set it off for sure. Maybe just the alarm that goes off if something hits the lava, like pool alarms for kid. Although I guess it would have been too late by then. \"My preccciioouussss!\". Learn some balance a-hole.Frodo. That little prick. I'd rather not discuss how my quest for utter dominion was defeated by something I could poop out unnoticed.I'm getting off track. I'm supposed to discuss the events of the first book, the Fellowship of the Ring. Good times! I was on a comeback! Then the withered up senior citizen Gandalf had to go to the library and do a little research and figure out that my Ring was not some cracker jack prize. My Ringwraiths tried to track down the Ring but apparently taking it away from children was too difficult. If I had put the Nazgûl on fell beasts rather than bloody horses from the start I might have tracked down Frodo (prick) and his three buddies in the bloody woods. Don't horses have a good sense of smell!? Anyways, the fell beasts would have at least avoided drowning in a river. Sweet Mary. Then those Elves suggest a damn \"fellowship\". Could you have come up with a lamer group name?? Why not call it the \"Loose Association of People Who Share Common Beliefs or Activities…of the Ring\". That Balrog almost did me the biggest favour, he was always one of my peeps. \"You shall not pass!!\" What a line Gandy! How cow. I heard that one took like 15 takes because Pippin kept making everyone laugh by adding in the word \"gas\". Fool of a Took!Anyways, by the end of the Fellowship of the Ring, I still had a fighting chance. Great book. Anyways, The Two Towers won't be as fun to review. Sh*t hits the fan. (A note from Sauron's agent: full credit for the idea of this review goes to Kemper and his awesome review of Drood)"}, {"Review": "I wasn't really \"cool\" back in high school. I never made out with girls under the bleachers, or smoked under the bleachers, or did any of the other things under the bleachers that - I am lead to believe - the popular kids did. Instead, I maintained a low profile and waited for the teenage years - that wilderness of strangled thinking - to end.In high school, as today, I harbored geekish obsessions, had a wandering imagination, and nurtured an appreciation for minutiate. In other words, I should have been J.R.R. Tolkien's core audience. For whatever reason - perhaps intuition that I didn't need to dig my social hole any deeper - I never read The Lord of the Rings when most people first come upon The Lord of the Rings. Actually, I was barely cognizant of LOTR until college, when the movies were released. I absolutely loved Peter Jackson's film trilogy. During law school, I left a legal writing final halfway through in order to see Return of the King on opening day. Despite this, I never desired to read the source material. From talking to my friends, who were Tolkien enthusiasts (\"nerds\"), I assumed I wouldn't like the books. They seemed too talky, dense, and plodding. Finally, one fair summer night on my patio, my friend Jon and I were drinking beer and talking about The Lord of the Rings and how it was funny we could do this openly and still have significant others of the opposite sex. (I believe my wife was inside at the time, deciding what she would take in the divorce). Somehow, in a Miller Light and bratwurst haze, Jon got me to commit to giving LOTR a try. Then, I did a keg stand with Jon's homemade beer. This is how I read. Now, having finished Fellowship of the Ring, I have new appreciation for what Peter Jackson accomplished. Yeah, he made it into an action film, but that's the medium of film; there needs to be action. He did a fine job of taking Tolkien's essence and goosing it. (Sometimes he goosed the action too much, but we can discuss Legolas surfing on his shield at Helm's Deep another day). It was this love of the film that, interestingly, made me hesitant to read the books. Folks who love Tolkien love Tolkien with a vengeance. If it isn't obvious already, I don't have that underlying feeling. I understand, theoretically, Tolkien's achievement, but I'm not going to pretend to know all the references - religious, mythic, and linguistic - used as ingredients. What I do know is that, at its heart, LOTR is an archetypal hero's journey. It begins with an orphan of average abilities, who has a task thrust upon him. This forces the hero to leave home and enter the wider world. In the world he must pass tests, learn lessons, and eventually accomplish his task. Once that is done, the hero can return home; however, he is forever changed, and the home to which he returns is different.The hero in LOTR is Frodo Baggins, a hobbit. Now, a hobbit is - well, they're short, but they're not dwarves. That's the important thing to remember. Hobbits are like pot-smoking liberal arts majors. They like to hang around, eat, smoke, drink, and talk. Frodo's uncle, Bilbo, is a rare hobbit who has gone out and had adventures. He also has a magic ring, which he gives to Frodo. This ring...well it's evil. I could explain more, and Tolkien certainly does, but suffice it to say the ring is a Macguffin. It's like Marcellus Wallace's suitcase in Pulp Fiction: it drives the plot, and that's all you need to know. (This being Tolkien, though, you are certainly able to learn much, much, much more). Bilbo and Frodo's friend, the wizard Gandalf, tells Frodo that he must take the ring to the Cracks of Doom to destroy it, lest the Dark Shadow Sauron get his figurative hands upon it. With this, the journey starts. Frodo is joined by three other hobbits: Sam (the loyal one); Pippin (the scared one); and Merry (the one portrayed by Lost's Dominic Monaghan). After some brushes with the Nine Riders/the Nazgul/the Ring Wraiths (Tolkien has a very Russian way of making up a name, and then making up two or three or four synonyms, which makes things a little confusing), the hobbits meet up with Aragorn/Strider who leads them to Rivendell, where the elves live under Elrond. There is a counsel, the Fellowship is joined by Boromir (a man), Legolas (an elf) and Gimli (a dwarf). It all sounds like the set-up for a very complicated joke. But rest assured, the fate of Middle-Earth is at stake. (Though that does not stop the characters from stopping repeatedly for long meals; apparently, the Fellowship is comprised of foodies and gourmands). It's important to note what this book is not: it is not an action-packed adventure. Mostly, it is people walking through this make-believe world, talking about the past, and worrying about the future. There is a battle in the mountains of Moria that lasts for two pages; other than that, there are only scattered paragraphs when people are running, swords are unsheathed, and the stakes are raised. If swords and arrows are what you seek, just stick to the films. Moreover, you aren't going to find complex characterizations. The good guys are varing shades of good, and the bad guys are really bad. About the only conflicted characters are Boromir, who is conflicted for five sentences or so, and Gollum, the strung-out ring-addict. So what is the book? Well, it's a place you visit. Anyone who knows me knows that I am a Nyquill connoisseur (or addict, take your pick). I often need something to calm my overactive mind before I can get to sleep. Instead of the Quill, for the past weeks, I used Fellowship. This is a compliment. Tolkien's world is so immersive, so fully realized - with its varied races, songs, languages, and lore - that whenever you open the covers it's a sublime escape. You are in an ancient land filled with a rich and ancient history, and a wonderfully described topography. Sure, the shadow of war hangs over Middle-Earth, but there is no tension. If you feel like Frodo is in mortal danger, and might not accomplish his task, you're probably six years old and having the story read aloud. Reading Fellowship was simply comforting. I wouldn't mind a kindly wizard giving me sage advice: Many that live deserve death. And some that die deserve life. Can you give it to them? Then do not be too eager to deal out death in judgment. For even the very wise cannot see all ends.And I also wouldn't mind going on a little hike through the forest, and maybe hanging out with some elves:Away high in the East swung Remmirath, the Netted Stars, and slowly above the mists red Borgil rose, glowing like a jewel of fire. Then by some shift of airs all the mist was drawn away like a veil, and there leaned up, as he climbed over the rim of the world, the Swordsman of the Sky, Menelvagor with his shining belt. The Elves burst into song. Suddenly, under teh trees a fire sprang with light. 'Come!' the Elves called to the hobbits. 'Come! Now is the time for speech and merriment!'...At the south end of the greensward there was an opening. There the greenfloor ran on into the wood, and formed a wide space like a hall, roofed by the boughs of trees. Their great trunks ran like pillars down each side. In the middle there was a wood-fire blazing, and upon the tree-pillars torches with lights of gold and silver were burning steadily. The Elves sat round the fire upon the grass or upon the sawn rings of old trunks. Some went to and fro bearing cups and pouring drink; others brought food on heaped plates and dishes.Frodo's journey is secondary to Tolkien's creation of Middle-Earth. And the genius of Middle-Earth is that it goes beyond the pages. With its allusions to a long history filled with famous leaders and famous events and famous battles, your imagination is ignited. Upon finishing the first book, I saw how LOTR became a place of refuge for the outcasts and iconoclasts of our world. Like comic books, it is a place of escape, where the everyday order is turned upside down: the stakes are high, the heroes short, the beer is plentiful, and girls a distant afterthought. "}, {"Review": "494.\tThe Fellowship of the Ring (The Lord of The Rings, #1), J.R.R. (John Ronald Reuel) TolkienThe Fellowship of the Ring is the first of three volumes of the epic novel The Lord of the Rings by the English author J. R. R. Tolkien. It is followed by The Two Towers and The Return of the King. ارباب حلقه‌ ها - جی.آر.آر. تالکین (نگاه، روزنه، ...) جلد نخست یاران حلقهعنوانها: خداوندگار حلقه ها؛ فرمانروای حلقه ها؛ ارباب حلقه ها؛ سالار انگشتریها؛ نویسنده: جی.آر.آر. تالکین؛ تاریخ نخستین خوانش: ماه ژونئ سال 2002 میلادیعنوان: خداوندگار حلقه ها؛ نویسنده: نویسنده: جی.آر.آر. تالکین؛ مترجم: تبسم آتشین جان؛ تهران، حوض نقره، 1381، در شش جلد؛ عنوان جلد نخست: رهروان حلقه ها؛ شابک: 9649305491؛ موضوع: داستانهای نویسندگان انگلیسی -سده 20 معنوان: سالار انگشتریها؛ نویسنده: نویسنده: جی.آر.آر. تالکین؛ مترجم: ماه منیر فتحی؛ تبریز، فروغ آزادی، 1381، در سه جلد؛ عنوان جلد نخست: دوستی انگشتری؛ جلد دوم: دوتا برج؛ جلد سوم: بازگشت پادشاه؛ شابک دوره: ایکس - 964697130؛ عنوان: فرمانروای حلقه ها؛ نویسنده: نویسنده: جی.آر.آر. تالکین؛ مترجم: رضا علیزاده؛ تهران، روزنه 1381؛ در سه جلد؛ عنوان دیگر: ارباب حلقه ها؛بخش نخست: یاران حلقه؛ بخش دوم: دو برج؛ بخش سوم: بازگشت شاه؛ چاپ ششم 1391؛ شابک: جلد نخست: 9789643343224؛ عنوان: ارباب حلقه ها؛ نویسنده: نویسنده: جی.آر.آر. تالکین؛ مترجم: پرویز امینی؛ تهران، دنیای نو، 1382؛ در شش جلد؛ شابک: 9646564992؛کتاب حاضر بخش نخست از مجموعه سه گانه «ارباب حلقه ها» ست. در این کتاب «فرودو بگینز» هابیت جوانی ست که به همراهی یارانی از اقوام دیگر سرزمینهای افسانه ای هابیتها؛ سفرش را برای نابودی حلقه شیطانی آغاز میکند. فیلمی خیال‌پردازانه و حماسی نیز به کارگردانی پیتر جکسون؛ بر اساس جلد نخست رمان ارباب حلقه‌ ها به قلم جی.آر.آر. تالکین ساخته شده است. یاران حلقه بخش نخست سه‌ گانه ی سینمایی ارباب حلقه‌ ها به شمار می‌رود، که دنباله‌ های آن شامل: «ارباب حلقه‌ ها: دو برج»؛ و «ارباب حلقه‌ ها: بازگشت پادشاه»؛ می‌شوند. این فیلم توسط نیولاین سینما در 19 دسامبر 2001 میلادی در ایالات متحده نمایش داده شد، و یکی از موفقیت‌های باکس آفیس با درآمد 871 میلیون دلار در سراسر جهان محسوب می‌شود. فیلم همچنین برنده ی چهار جایزه اسکار شد. ارباب حلقه‌ ها: یاران حلقه؛ آغازی بود بر طوفانی که جکسون با سه‌ گانه ی ارباب حلقه‌ ها در جهان سینما آغاز کرد، طوفانی که پس از ده سال همچنان قابل بحث است؛ که او چطور به عنوان یک کارگردان تازه‌ کار، این چنین حماسه ی بی‌نظیری را پدید آورد. فیلم در دوازده رشته در اسکار نامزد شد؛ و در چهار رشته پیروز شد. جکسون با این فیلم آغازگر سبک فانتزی معناگرا شناخته می‌شودعنوان فیلم: ارباب حلقه‌ ها: یاران حلقه؛ کارگردان: پیتر جکسون؛ تهیه‌ کننده: پیتر جکسون؛ باری ام آزبرن؛ تیم سندرز؛ فرن والش؛ جیمی سلکرک؛ نویسنده: فرن والش؛ فیلیپا بوینس؛ پیتر جکسون؛ براساس کتاب: ارباب حلقه‌ ها: یاران حلقه؛ اثر: جی. آر. آر. تالکین؛ بازیگران: الیجاه وود؛ ایان مک‌کلن؛ ویگو مورتنسن؛ لیو تایلر؛ شان آستین؛ کیت بلانشت؛ اورلاندو بلوم؛ جان ریس-دیویس؛ بیلی بوید؛ شان بین؛ هوگو ویوینگ؛ کریستوفر لی؛ دامینیک مانهن؛ موسیقی: هاوارد شور؛ فیلم‌برداری: اندرو لزنی؛ تدوین: جان گیلبرت؛ توزیع‌کننده: نیو لاین سینما؛ تاریخ‌های انتشار در بریتانیا و آمریکای شمالی: 19 دسامبر 2001؛ زلاند نو: 20 دسامبر 2001؛ استرالیا: 26 دسامبر 2001؛ مدت زمان نسخهٔ سینمایی: 178 دقیقه؛ نسخهٔ طولانی‌تر: 208 دقیقه؛ نسخهٔ کامل: 235 دقیقه؛ کشور: نیوزیلند؛ ایالات متحده آمریکا؛ زبان: انگلیسی؛ هزینهٔ فیلم: 93 میلیون دلار؛ فروش گیشه: 871.5 میلیون دلار؛ا. شربیانی"}, {"Review": "\nThe Journey begins!!!\n\nTHE EVOLUTION OF A RING’S STORY\n\nCourage is found in unlikely places.\nWhat started up as an adventure oriented for children turned into an epic fantasy......THE epic fantasy book, anything else in the genre after this, born here, any other author writing in this field, began here, and even impacted in many other genres and formats.Certainly, in The Hobbit, there are dangers, there is death, so thinking about it as a children’s tale is a much debated issue, but it’s clear that Tolkien’s intention was to present a light-hearted adventure. \nEven the smallest person can change the course of the future.\nHowever, due some communication’s troubles between Tolkien and the publishing house, making him to think that they weren’t enjoying the proposed sequel to The Hobbit, the story got bigger, larger, darker......and redefined the conception of epic fantasy in literarure.Even Tolkien needed to re-write the chapter in The Hobbit involving Bilbo, Gollum and the One Ring, since the story known as The Lord of the Rings became something that even the very Tolkien didn’t foreseen before.So, what began as a small hobbit living in a hole that found a tiny ring in his journey, turned into a visceral war involving the whole Middle-Earth.\nMY THEORY ABOUT THE RING\n\n For nothing is evil in the beginning.\nI have a theory about the One Ring. And don’t worry, it’s not a spoiler.As I quoted (in this part of the review) Tolkien, may nothing is evil in the beginning, not even Sauron was evil in his own beginning, but......there is one thing in the Middle-Earth that it was evil since its own beginning......the One Ring!The One Ring was evil in its own beginning.The One Ring was in the hand of Sauron, then it passed to Isildur, a man, but it was soon lost and ended in the hands of Déagol, a hobbit, to fall right away in the possession of Sméagol, another hobbit, having it for so many time that Sméagol lost his own identity turning to be Gollum, scary, nasty, treacherous and dangerous but still a hobbit, then enter Bilbo, yet another hobbit, and finally gets into the picture, Frodo, yes, another hobbit.Do you see the pattern? (Because to me it wasn’t that hard!)Hobbit, hobbit, hobbit, hobbit.It’s said that people (all kind of people: Elves, Dwarves, Men, etc...) are obsessed with the One Ring.But to me, it’s clear that the One Ring is “obsessed” with the Hobbits!!!Sauron may be the Lord of the Rings, but it has been stated that the One Ring has a mind-like on its own. It’s not like a Green Lantern’s Power Ring able to talk and having a computer-like library to access inside, even the feature to fly on its own to search the next suitable user. The One Ring can’t talk, can’t move or fly on its own, but still is a magic ring alright (or “alwrong” since it’s unquestionable wicked (hey! No only Tolkien can invent words!) and it’s clear that its purpose is to bind all people into darkness, into evil.Sauron may have plans for the One Ring, but it’s likely that the One Ring has its own plans, its own designs, not to rebel, not to stand against its master, but to fulfill its basic purpose since it may notice a small flaw in Sauron’s plans.Sauron wants to turn into evil the whole Middle-Earth’s population: Elves are wise and powerful but still they have already fell into darkness in some numbers (no wonder why they’re starting an exodus from the Middle-Earth). Dwarves are greedy and violent, they’re easy targets for darkness. Men? Don’t make me laugh! We are the most susceptible species for darkness of all, nothing to worry about for the One Ring.However, Sauron didn’t even know the existence (for not saying clearly not knowing the location) of the Shire. Therefore, it’s evident that the hobbits aren’t in the plans of Sauron. You can say that it’s because he didn’t know about them or simply because he didn’t consider them worthy to send any troops there.But the One Ring knows. In some way, it knows about the Hobbits.And the One Ring has \nONE\n purpose...\nOne Ring to rule them all, One Ring to find them, One Ring to bring them all, and in the darkness bind them.\nThe One Ring is thorough about its purpose. It is obsessed about its one single purpose in the Middle-Earth. It has to bind ALL people into darkness, into evil. Not matter how tactically valuable or how ridiculous irrelevant. The One Ring isn’t in position to question the one single purpose that it was imprinted downright on its metal, its whole body, its entire “soul”.\nAll that is gold does not glitter, not all those who wander are lost; the old that is strong does not wither, deep roots are not reached by the frost.\nYou may think that the One Ring was lost, that it was wandering, but no......the One Ring was precisely where it wants to be! It found the Hobbits!Yes, the Hobbits in a quick glance, they aren’t something to be worry about when you’re planning to dominate Middle-Earth. Clearly, it was Sauron’s point of view. You can’t blame him. I don’t think any military leader in his position would consider relevant to invest time and effort with the Shire.BUT the One Ring thinks otherwise.If the other races have to fall into darkness, into evil, then the Hobbits must be as well.The Shire is an oasis of peace, of light, of goodwill, of laughing, of dancing, of enjoying the basic pleasures of a more simple life......and the One Ring can’t tolerate that!!! It’s revolted by the very existence of such a good place inhabited by such merry species. Everybody, everywhere and everything must fall into its dark bind, into evil!!!If Hobbits fall into darkness, into evil, then and only then, Sauron’s plans would be truly accomplished and the One Ring’s purpose, fulfilled.\nRING ANY BELLS?\n\nBooks ought to have good endings.\nI am not a rookie with The Lords of the Rings since I watched all the movies, but certainly I knew that eventually I will read the books. While I am aware of what would happen here and in the next books, I still enjoyed plenty enough the reading, since I was able to notice the “little differences” here and there, between the original writing and the modern film adaptations. Some time ago, I read The Hobbit and now I have read the first book, Fellowship of the Ring, but an important thing to have in mind is that hardly it’s a “first” book per se, but the first part of one single book titled: The Lord of the Rings, since I can’t blame other readers if they weren’t satisfied with the development made in this first part.Characters took an “eternity” to begin a journey, to take a decision, to do anything. The few action moments are overly seldom spread and too quick developed, so you don’t get a real sense of being reading something in the epic fantasy genre. Even some scenes aren’t presented in “real time” but they are told after the things happened, stealing almost all thrill from them. Some random characters without any real utility in the story. An overwhelming telling of the vast background history of the Middle-Earth. And “finally”, you won’t get an ending here, this isn’t really a whole book, but the first part of a novel.So, if you can have all that in mind, knowing that you will have to read other two parts to get the whole story, and trusting that you will get ample amounts of actions later, maybe, just maybe, you would be forgiving enough to enjoy the wonderful writing using words in such clever way, along with the majesty of the expansion of such rich literary universe.Keep up, my fellow readers! The journey is just beginning!"}, {"Review": "Raise your hand if you remember the awesome book fairs or Scholastic book order forms from back when you were a kid? Well, in middle school I picked up this sweet read in a box set with the rest of the trilogy and The Hobbit. Unfortunately, while I have always been enthusiastic about reading, I did not find the motivation to complete it for almost 15 years.In the early 90s I read the Hobbit. Then I followed it up by starting this one but lost interest shortly after Tom Bombadil. Tolkien is great, but can be a bit much for a middle schooler. Even when I finally did finish it around 2001 (just in time for the movie), it was still a bit of a labor of love.In the end, though - no doubt, 5 stars all the way! This is a classic! This is one of the grandfather's of high fantasy - I doubt you can find a single fantasy author that was not influenced by this book/series. Even if you find some of the parts slow, battle your way through, I guarantee you won't regret it!"}, {"Review": "Give me a few friends,a stretch of pleasant hills and an ominous wood.Let us romp in the remnants of innocence,free of the fear coursing through the veins of the greater world.Give me the first half dozen chapters of The Fellowship of the Ring and I will gladly make a little heaven on earth out of it.After finishing The Hobbit as a young boy, I needed something else, something a little more mature to meet my growing needs. Lucky for me, Tolkien had done just that in the form of his epic trilogy The Lord of the Rings. Fellowship..., the first book in the trilogy, is my favorite of the three. I fell in love with the four little friends striking out on their own, having adventures and misadventures that, within the context of the beginning of this first book, haven't yet taken on the worldly importance they will later on. My two favorite chapters are \"The Old Forest\" and \"Fog on the Barrow-Downs\" and it's probably because both contain a genuinely scary, Halloween-when-you-still-believe-in-boogiemen atmosphere. In fact, atmosphere is a particularly operative term here. Tolkien made me feel the suffocation of the ancient forest with it's mysterious gnarled trees. The ghosty fog upon the eerie downs evoked apparitions, the stuff of nightmare. The challenges and foes the four little hobbits face in these chapters are not on a grand scale - they're not even germane to the book's overall plot - but jeez louise, there's some scary-ass moments in there. Watching the boys handle these situations is just good, fun adventure material.Frodo, Sam, Merry, and Pippin skip along having a merry old time, stumbling into relatively minor troubles, all the while clueless that they possess the world's most powerful evil magic. I love that innocence. It reminds me of past days when my friends and I would grab stick-swords and hike through the woods, slashing at the trees that had become our goblin and ogre enemies. I could relate to the sense of foreboding Frodo and friends felt when finding themselves lost in a cold, eerie hallow with a creeping mist swirling about them. Growing up in the country, I knew exactly what it was like to run afoul of a truculent farmer and his vicious dogs. I could relate entirely to the first half of the first book, before the lords and wizards entered and it all became alien. Enjoyable as the journey to Mordor was, nothing could compare, no, nothing could even come close to touching my heart the way those first few chapters did.However, we must all eventually move on from the safety of home. (More review to come!)Appendixy type reviews of Fellowship…-related items:Peter Jackson's film version: I waited sooooo long for this. It was like waiting for the Red Sox to finally win the World Series. And when it finally happened, boy was it sweet! Back in the mid-to-late 90s I was working in Hollywood and so I would get the lowdown on what movies were in production and even pre-production. It must have been about '96 or '97 when I heard there was an interest in making a film version of The Lord of the Rings. I promptly went SQUEEEEE!!! and wet myself. Then I heard Jackson was the one who'd potentially be directing it. My glee was tempered. I'd seen and much admired his haunting Heavenly Creatures, but I also new him as more of a Heavy Metal Magazine, comic gore, sci-fi kinda guy, and I feared such a person getting their sticky mitts all over my precious. But anyway, so now recall that this was '97ish and that the first installment didn't come out until 2001. That is a loooong time to wait for something you want in the worst way. I'd grown up watching Ralph Bakshi's partially finished version and longed for a completed one. And now it was coming, but it was being delivered by an unreliable messenger. Tingling with mixed nerves, I sat in the theater waiting for Fellowship to begin, my heart still somber after 9/11. I wanted to feel good again. I really wanted this to be good. Cate Blanchett's androgynously husky voice rumbled through the darkness….\"ooooh, this is going to be good\" muttered my soul. And it was. From start to finish, I love this movie. Certainly it has its faults. I felt like Jackson, with all the money and technology at his disposal, still managed to make a scene or two here and there look like it was shot on a VHS camcorder. I'll never be completely happy with the casting. Some of the scenes that were cut from the book were my favorite (the Old Forest deletion is a crying shame) and that's unfortunate, but expected. All in all, my complaints are far outweighed by the laurels I could lay upon this…considering the grand scope, let's call it, this achievement."}, {"Review": "This book did nothing but put me to sleep and sink me in a slump. Like, I’ve never EVER fallen asleep while reading a book (except for maybe, Catching Fire, but I was dead sick at the time). But the best part? It actually started getting interesting after the 95% mark, and by the end, I was even looking forward to reading the next book. How. The. Heck!!\nThis is all you need to know about the plot\n - A ring with exceptional powers, handed over to a young Hobbit as an heirloom. A Dark Lord seeking the ring. The Hobbit on the run with a few friends.Walk. Walk. Walk. Walk.Eat. Sleep. Complain.Walk. Walk. Walk. Walk.Reach destination one. Set off with a few more companions.Walk. Walk. Walk. Walk.Eat. Sleep. Complain. Fight.Walk. Walk. Walk. Walk.Reach destination two. Feast. Rest. Set off again.Walk. Walk. Walk. Walk. Row. Row. Row. Row.Promise of more walking. The End.In other words, more than half of this book constitutes of walking, wherein Mr. Tolkien utilizes the time to describe every single detail about the surrounding trees, the beauty of day and night sky, the shape of trees, the sharpness of the blades of grass, and the impending doom. You see what I’m trying to say?There is a wide array of characters with funny names, popping here and there, belonging to different species of the fictional world of Middle-Earth. There are wizards, hobbits, elves, dwarves, giants, trolls, orcs – all kinds of them and yet after 500 pages, I still can’t distinguish one from the other. Wizards are supposedly magicians, but what kind of magic do they perform? Hobbits are supposedly bigger than dwarves, but like, what’s the deal? Instead of describing everything else, Tolkien could have tried to describe his creatures and their history a bit better, tried to give his readers something to imagine. While others say his world-building is amazing, I couldn’t get it at all. And the history lessons, when it came, was like information dump and went straight over my head. It was easy to fall asleep - after all, who ever listened to history classes?With so many characters to keep up with, I could only get hold of our main ones – Frodo, Bilbo, Gandalf, Sam, Pippin, Aragorn, Merry. Sam might be my favorite and his undisputed loyalty to his master is what I loved the most. Honestly, everyone else was rather unlikable and their voices sounded the same – too cheery, unnecessarily excited, always uttering sentences that end with an exclamation mark. Like, this is how it is when a character speaks – \n “Long have I desired to look upon the likeness of Isildur and Anarion, my sire of old. Under their shadow Elessar, the Elfstone son of Arathorn of the House of Valandil Isildur’s son, heir of Elendil, has naught to dread!”\n¯\\_(ツ)_/¯Point is, I think the whole trilogy could’ve been shortened to just this book and Tolkien could have saved a lot many tress if he just told the story at once, instead of having us go through so much useless babbling over nothing. By the end, nothing of significance had happened, except that our characters are ready to walk more. But the oncoming adventure promised to be more exciting and dangerous So I’m up for it! ------ ** ------ ** ------ ** ------ ** ------\nInitial review - \nFor the past few months, I've been trying to pen down a complex book on unsolicited relationships, which has barely progressed a page, meanwhile Tolkien has managed to fill up over 500 pages with detailed, rich, long descriptive sentences on WALKING.Yeah.That was 12 hours of my life I'm never getting back. 〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️Buddy read with my childhood friend Pippin aka Jen, my closest companion Sam aka Bhavik, my distant pal Aragorn aka RustyAs for me, I'm Frodo, reading a book about my own adventures.Also shoutout to the guy who left us midway and went off on his own Merry aka Fares"}, {"Review": "Tonight on Anderson Cooper 360, we find ourselves in Murfreesboro, Tennessee and at The Green Dragon Public House and Brewery, a Tolkien inspired pub. Our special guest tonight is none other than THE Hobbit, Mr. Bilbo Baggins, formerly of the Shire. We’ll have a moment to get to know the individual that has meant so much to generations of literary fans and then to a new generation of movie going fans in this last decade. Bilbo, how are you tonight?Bilbo Baggins: I’m well; thank you, Anderson, and how about yourself?Anderson Cooper: I’m fine, thanks. Tell me, what was it like working with Peter Jackson?BB: What’s not to like? He’s a consummate professional, with great attention to detail and a heart for our story.AC: How was he different than working with J.R.R Tolkien?BB: Ronald was a wonder, a finer man this world has never known. He was sensitive, but not in the way this generation uses the term; he was a real man, he could chop wood and build a fire, but he had in mind the celestial, he was a Godly man. Peter is more worldly, but spiritual in his own way.AC: Was Hollywood different than England in the 1950s?BB: My word, yes! But mostly in the scale of things, not so much the substance. When Ronald first published our story in your time of 1954, there was some fuss and attention but nowadays there is another level of fame and fortune altogether, I cannot wrap my mind around it! I wanted to pay for a breakfast of some eggs and sausages and the innkeeper said, “your money is no good here, Master Hobbit” but I’ve never had so much coin as I have now and no one will take it! The world has gone topsy-turvy.AC: And your nemesis, Sauron, how has he changed over the years?BB: Well! Now there is a query, yes sir! Let me just say that he was a pain the arse in the distant past and remains so today. His kind will always be a ticklish spot on the mattress if you get my meaning; I was not at all surprised to see him get involved with your politics.AC: What about that, Bilbo – is it alright if I call you Bilbo?BB: Please do.AC: Thank you, what about Sauron’s entry into local politics?BB: Let me speak candidly, Anderson, Sauron is a self-serving lot. His foray into your politics is all about what is best for him.AC: Were you surprised that he has adapted so well to our political climate?BB: Not at all! Oh my goodness, no! He was made for the arena, as your Mr. Nixon would say.AC: Bilbo, has fame changed you at all?BB: Anderson, I’d like to think not, but maybe in some small ways.AC: Example.BB: Fair enough, I like to get the top of my feet waxed. Back in the Shire, forget about it, but around here, it’s just a matter of getting it done and who to do it.AC: The top of you feet waxed?BB: A mild vanity, I assure you, a simple pleasure for me to preen and pleasure.AC: Well deserved, I’m sure.BB: Well, there are the simple ways to be enjoyed.AC: Bilbo, what would you like to convey to our audience before we sign off?BB: Thank you, Anderson. I’d just like to say to our audience, to our fans, both of the books and the more recent films, I think our story is about decency and doing what is right. It’s not always about slaying dragons or defeating an evil tyrant – more often it is the small things – paying a fair wage to your gardener or the village grocer, and observing the common courtesies. If we can win the small battles at home, then the larger wars will take care of themselves.AC: Thank you, Bilbo, it has been a pleasure.BB: The pleasure is all mine, Anderson, and won’t you enjoy some fine craft ales while we’re here?AC: Why not? Thanks again to Mr. Bilbo Baggins, this is Anderson Cooper reporting from Murfreesboro, Tennessee with the Hobbit, Bilbo Baggins. Take care, America.2015 reread: My first impressions after rereading this wonderful story is that at its heart it is a travel book, from the departure from the Shire , through Bree, and all the way along the dangerous paths, down through Moria and visiting Lorien this is a story about a journey.This also made me even more appreciate the fine work of director Peter Jackson and his crew for a magnificent job filming Tolkien’s great vision. However, I do miss the exclusion of Tom Bombadil from the films as he is a testament to how, as good as the films are, lacking they are when it comes to the fullness of Tolkien’s story, the films are martial and about armed conflict. Jackson must sell tickets, I understand that. But Bombadil, poetry and song are also an integral part of Tolkien’s Lord of the Rings and part of this template for high fantasy.One thing Jackson got right was the importance of Sam Gamgee, his simple straightforward approach to life perhaps mirrored Tolkien’s own English countryside manner.Finally, the scene between Boromir and Frodo is classic in literature. Well done, Professor Tolkien."}, {"Review": "Tolkein's masterpiece is notable primarily for its historical significance. He basically invented the fantasy genre, and because of that all fantasy readers owe him a debt of gratitude. Many things in his books will seem somewhat cliche nowadays, but that's because they have been used so often since he wrote this book - almost all of them were original when this book was written.That said, Tolkein is not a terribly good writer. He tends to go on in excruciating detail about trivial concepts. Parts of the book, such as Ent poetry, are downright painful to read. And his leaf by leaf descriptions of forests can get fairly trivial. Since he wrote this series, several other fantasy writers have basically stolen the story and rewritten it with higher quality prose. Terry Brooks Shannara series, for example, is more or less identical in plot and characters, but Brooks is a notably better writer. So depending on whether you prefer the authentic text, or the better written text, you should choose accordingly. The notion of heroism in Tolkein is particularly worth noting. It is, so far as I can tell, the first set of novels that defines heroism entirely by internal features. The protagonist has no ability to fight, or to use magic, or basically do anything except to doing his best to do the right thing. This conception of heroism, which is what is what most people think of nowadays, is quite different than it was historically conceived (where heroism was synonymous with strength or ability, sometimes in conjunction with morality, but sometimes not). So, in this way, like so many others, Tolkein has had tremendous effect on popular culture."}, {"Review": "4+ out of 5 stars to The Fellowship of the Ring, J.R.R. Tolkien's first novel in the \"Lord of the Rings\" trilogy, later made into a billion dollar movie franchise. I count myself lucky to have been able to read this book before it became a movie, though I loved the movie, too.\n\nWhy This Book\n\nI was 13 years old when I stumbled upon this book while a friend was reading it. He was a major video gamer, fantasy sports leaguer and avid reader of science fiction. Though we were good friends, I had different hobbies. He was about a third of the way into the book, talking about Bilbo, Frodo and Gandalf... and I think my response was something like... \"but what about the lions, bears and tigers... oh my!\" He knocked me off his bed and laughed at me, which made me curious about the book. He lent it to me once he finished it, and I ran through the trilogy quicker than a trip to Mordor.\n\nOverview of Story\n\nIt would take an entire chapter to summarize the book, so I'll try to keep it simple. It takes place in Middle Earth, a huge land full of different types of people: Men, Elves, Dwarves, Hobbits, Wizards, Orcs and a whole lot more. As you'd expect, lots of re-alignment between groups over the centuries occurs during epic battles between the good and the evil. A long time ago, a ring was forged, unbreakable, except to be destroyed in Mordor. People have hunted the ring for years, to use its power, but it was rarely ever found. Bilbo Baggins, an elderly hobbit, comes across it one day. And its dark forces take over his mind, willing him to run away with it. But Gandalf the Wizard convinces him to give it up, and the ring falls to Bilbo's young cousin, Frodo, to throw into the fire hell of Mordor. He cannot escape the journey, but along the path, he is protected by Gandalf and many other friends. He has epic battles and at the end of this book, he's come upon one of his first major stops to seek protection, but is forced to flee with new best friend, Sam, for Mordor. And it's to be continued...\n\nApproach & Style\n\nIt's a fantasy story, so the language is thrilling and beautiful, dynamic and ethereal. Tolkien's created a world where anything can happen, and one where readers have little history to know what's real and not real.The book follows Frodo on his path as the primary character, and you see much through his eyes. It is in third person omniscient, meaning you do see most everyone's thoughts.\n\nStrengths\n\nThe creativity. The imagination. The fortitude. The lessons. The moral code. The honor among friends. The fear of a foe. The power of a wizard. Struggles to survive. The book has it all, even a little romance. And death. :(One of the original masterpieces in this genre, it set the bar for everything to come. It was published mid-20th century, when books simply didn't exist in trilogies. There were a few, and some were decently written, but this is the beginning of a cult phenomenon. As much as I love Harry Potter, and I imagine I will love Game of Thrones, they were not the first. But Middle Earth is an epic journey across a vast time period and a vast land. Written more for an older young adult crowd, it has fans everywhere from ten to a hundred. \n\nOpen Questions & Concerns\n\nIt's a lot to taken in and will completely absorb its readers... when's the right age to ensure its ideals are properly understood. Why is it acceptable to kill someone in protection of the ring? How do you handle fear on a journey you must go on? Should it be used in schools? There are so many lessons, ideas and themes to ingest. Is it a pleasure read or something to teach? I see both sides.Should I re-read it? YES!\n\nFinal Thoughts\n\nYou cannot help but be immersed in this story. If you're not a fan of fantasy, this is NOT the book to start with. There are probably 100 characters to keep track of, each with a unique set of powers or goals. If you are going to take it on, you need to invest in the entire world... up next at some point will be The Hobbit, as it's another clever place to lose oneself in...\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by.[polldaddy poll=9719251]"}, {"Review": "“All that is gold does not glitter,Not all those who wander are lost;The old that is strong does not wither,Deep roots are not reached by the frost.From the ashes a fire shall be woken,A light from the shadows shall spring;Renewed shall be blade that was broken,The crownless again shall be king.” This review is going to be more about my experience with this book rather than about the book itself . Everyone knows the story . And there already has been said much about it . So I don't need repeat it . The Fellowship of the Ring kind of a bittersweet novel . For about 40% of the book almost put me to sleep . But the beginning and the ending were really fun . That being said , this book is best as it is .It would be really difficult for me to talk about this book so I'd rather write the review in two categories . What worked for me and what didn't . Pros :⭐ The characters . I loved almost every character in the novel . Apart from the hobbits , Gandalf was definitely my favorite character . ⭐ The plot . Good vs Evil . It's still my favorite theme for any novel .“The road must be trod, but it will be very hard. And neither strength nor wisdom will carry us far upon it. This quest may be attempted by the weak with as much hope as the strong. Yet it is oft the course of deeds that move the wheels of the world: Small hands do them because they must, while the eyes of the great are elsewhere.” ⭐ The Setting . Ah!! How I wish I lived in Middle-Earth with all those hobbits and elves and dwarves ?! Tolkein's world has endured more than half a century . And that's saying something . “Many that live deserve death. And some that die deserve life. Can you give it to them? Then do not be too eager to deal out death in judgement.” ⭐ The Quotes . Sounds weird?! Maybe . But I like quotes . And Tolkein has set a benchmark in writing great quotes .(not comparing to Shakespeare)Cons⭐ The plot was soooo slow . Maybe this book was meant to be a slow burn adventure . But I've been spoiled . Fast paced novels and character driven tight plots have made me lazy . Half the time Tolkein was describing the trees , or the birds or the winds . These descriptions were a welcome relief at first . But then it was too much too soon . Tolkein's writing is fairly simple . Though a bit out of fashion it's easy to understand . And lastly , I would say , this book/series is important . I mean this book almost single handedly brought the fantasy genre into mainstream . You'd have to give that guy at least that . And thus , I respect the slowness of the book . It's appropriate for the novel . Even I'm saying this . Fans of fantasy literature should read Lord Of The Rings at least once in their life . And a special shoutout to Frodo , Sam , Merry and  Pippin  for reading this with me . It was really fun guys how we bonded together while reading this book ."}, {"Review": "One does not simply review the LOTR!!Yet here I am, trying to do so. In the words of Sam-the-wise Gamgee, I can sum up my review. “Oh, that doesn’t do them justice by a long road.”This was a BR with The one who DNF’d it and The one who didn't like it. Non believers, I tell you! I have taken my own sweet time with this book, relishing each of its pages and words and watching the movie as I read the book. It has been a great time! \n“Is it not a strange fate that we should suffer so much fear and doubt for so small a thing?”\n It is Bilbo Baggins’ eleventy first (111th) birthday. All of the Shire is invited to celebrate the event of a queer hobbit who is rumored to have immense treasures accumulated from his adventurous journey so long ago. For Bilbo though, there has always been one treasure. A golden shiny ring. All of the shire is present for Bilbo’s big day but little do they know that he has something planned. \n ‘I wish to make an ANNOUNCEMENT.’ He spoke this last word so loudly and suddenly that everyone sat up who still could. ‘I don’t know half of you half as well as I should like; and I like less than half of you half as well as you deserve. I regret to announce that – though, eleventy-one years is far too short a time to spend among you – this is the END. I am going. I am leaving NOW. GOOD-BYE!’ \n And away he goes, on his last journey to find peace, bestowing (forced by Gandalf) his treasured ring to his younger cousin Frodo.For many years life goes on for Frodo as it should, with his friends Pippin and Merry and not to forget Sam. Until one day the wizard Gandalf pays him a visit and tells him the secret of his heirloom. That what he carries is no ordinary ring but THE ONE RING. \n‘One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them.’\n Poor Frodo. Who never wanted to be put in such a situation. Frodo, who led a simple and peaceful life. \n ‘I wish it need not have happened in my time,’ said Frodo. ‘So do I,’ said Gandalf, ‘and so do all who live to see such times. But that is not for them to decide. All we have to decide is what to do with the time that is given us.'\n Now Frodo must flee, carrying the evil ring, to the land of the elves, Rivendell, for he is being hunted by a deadly foe. And who shall accompany him but his friends Merry and Pippin and always Sam, my dear Sam. \"It’s a dangerous business, going out of your door. You step into the Road, and if you don’t keep your feet, there is no knowing where you might be swept off to.\"Through many a great peril, the four little hobbits reach the land of elves where all of middle earth must decide the fate of the ring in a secret council. \n‘We must take a hard road, a road unforeseen. There lies our hope, if hope it be. To walk into peril – to Mordor. We must send the Ring to the Fire.’\n The hearts of Men, Dwarves, Wizards and even Elves are found wanting for courage to undertake the task that must be accomplished when Frodo steps up to the dangerous task. It must be true what they say. ‘Courage is found in unlikely places.’\n ‘I will take the Ring, though I do not know the way’ said Frodo. ‘My dear Frodo!’ exclaimed Gandalf. ‘Hobbits really are amazing creatures. You can learn all that there is to know about their ways in a month, and yet after a hundred years they can still surprise you.’\n Frodo is appointed the ring bearer, the one who shall carry the burden that none else are willing to. He should carry the heavy burden. \n‘But you won’t send him off alone surely, Master?’ cried Sam, unable to contain himself any longer, and jumping up from the corner where he had been quietly sitting on the floor. ‘No indeed!’ said Elrond, turning towards him with a smile. ‘You at least shall go with him. It is hardly possible to separate you from him, even when he is summoned to a secret council and you are not.’\n And how can Merry and Pippin be far behind Frodo and Sam? \n ‘That’s what I meant,’ said Pippin. ‘We hobbits ought to stick together, and we will. I shall go, unless they chain me up. There must be someone with intelligence in the party.’ ‘Then you certainly will not be chosen, Peregrin Took!’ said Gandalf\n The fellowship is formed that shall accompany and guide the ring bearer.A Man: Boromir of Gondor, Son of Denethor.A Dwarf: Gimli, son of Gloin.A King in exile: Aragorn, son of ArathornAn Elf: Legolas, son of Thranduil.A wizard: Gandalf the GreyFour hobbits: Frodo, Merry, Pippin and of course, Sam!So begins the journey of the fellowship of these nine that holds the future of all those who live in the middle earth. Together they must brave so much to reach where they want to reach. But what binds them together? Naught but friendship and loyalty. And yet the evil of the ring shall lead to the breaking of this fellowship and still Frodo must go on, alone. But how can Sam ever leave his side? \n‘Of all the confounded nuisances you are the worst, Sam!’ ‘Oh, Mr. Frodo, that’s hard!’ said Sam\n No. Sam wont. He shall keep him company through thick and thin.I have just read a book from a madman. “No great mind has ever existed without a touch of madness.”  Often have I heard and read this quote. But never did it actually take. Why would it? I never met any greats. I never read any greats.I picked this book mostly on a whim. No reason why I would read a book whose story I know word for word through the movies that I have watched countless times. No real reason why would I read 500 pages to get to an end I already know. Except for one reason. The writing. To experience a great man. To read from the father or Fantasy. \n“That was an eye-opener, and no mistake!”\n What makes for a good book, I often ask myself. And always I answer that having a story is the easy part. It’s the easiest thing. Each one of us has a story or few inside our heads and hearts. Whether or not we tell them is a different matter but we all have stories, regardless. So that’s the easy part. The hard part is to tell it. To pen it down in a way that someone would want to keep reading. That’s the hard part but manageable. Many can do it. But there is still the hardest part left that not all can pull off.The toughest part is to create a believable setting, to create a world and then to populate it. To give it a feel. Make it into something that a reader can see in their mind’s eye, can almost touch it and practically taste it. I consider this the toughest part and that’s what makes for great Authors and Storytellers. But a madman genius should be able to pull it off, right? So, is Tolkien that person? Of course he is. He doesn’t need my nod to be the genius that the world knows him to be. This is one the finest writing I have ever encountered and quite frankly it borders on madness. \n‘I feel as if I was inside a song’\n There is such a rich feeling in the book! So much work has gone into shaping up this world that we love in LOTRs collectively. This guy, he not only created a world and populated it, he actually gave it a history. The world of middle earth wasn’t just formed overnight and a great adventure commenced in it. No. There is so much in the books that points to the fact that this world has been around for a very long time and has a history. So much history. Languages and poems and stories and back stories and different realms and beasts and the evil and even their history. I could feel everything mentioned in the book. I do not have any better word to describe it other than saying it is a VERY rich piece of writing. The best one I have tasted so far. There are poems and songs in the book and as annoying as they become at times, I cannot deny that they are beautifully done. This is a book from a master, one who was at the top of his game. No one takes that away from him. This book is simply a masterpiece in terms of writing. Yet, I’d lying if I didn’t say a few things bugged me. The dialogues in most places are not upto the mark. Infact, at a few places, a few of them feel funny in a dangerous setting and sometimes simply aloof. A lot of what could have been part of the narrative is put in as a monologue from a character when they are alone. The characters are not all that well shaped up and the only characters that I liked in the book were Gandalf and Sam. The most disappointing of the lot was Legolas. As amazing this book is, there is not one doubt in my mind that the movie, as wildly different from the book it turned out, it was FAR, FAR better and Peter Jackson created magic. And all the difference in the movie are for the better and it further goes to show how much effort was put into adapting these books. This book though, the whole story is amazing but the thing that adds to the whole charm, for me, has always been the bond of Sam and Frodo. The camaraderie and the love that Sam has for Frodo. It’s something beautifully done. And it’s only just the beginning, laddies! Needless to say that I will be seeing this series through because, One simply does not skip such amazing books! Sorry, couldn’t help it. :P I shall return soon. To see Boromir redeem himself. To see Gandalf find his way back to Aragorn and to meet the horse lords of Rohan! But mostly, I shall return to accompany Frodo on his journey and for my dear Sam. \n“But I’m glad, Sam. I cannot tell you how glad. Come along! It is plain that we were meant to go together. We will go, and may the others find a safe road! Strider will look after them. I don’t suppose we shall see them again.”“Yet we may, Mr. Frodo. We may.” said Sam.\n"}, {"Review": "My education as a young German continues. I have been able to read children's books easily for some time, but books for grown-ups are still challenging. I thought that reading The Lord of the Rings in translation might be helpful, since for me it's intermediate between children's literature and adult literature. The vocabulary and grammar are more like adult literature; but the writing is concrete and straightforward as children's literature tends to be, with little of the abstractions, generalisations and complicated narrative structures that characterise adult fiction. I think it's worked well, and I could positively feel the book stretching my vocabulary. But most importantly, it's increased my appreciation for the poetics of the language. The text was many times able to reach me emotionally, and I could recapture the magical effect it had on me when I first read it at age ten: the comic interlude in Bree, the horror of the Barrow-wight and the Balrog, the glimpses of the vast shadowy history of the First Age.The part that affected me most was the sequence in Lórien, which, to my surprise, moved me to tears. I couldn't quite understand why, but when I looked through some of the other reviews it became clearer. Readers of my generation were able to enter the enchanted world of Middle Earth and make it part of our own reality. But now I glance at Khanh's review, which has attracted 500 votes and a depressing number of positive comments, and see that for many people it is no longer possible. They understand nothing. The Elves have departed over the Sea, and left only a nostalgic memory behind them. It is desperately sad, and it is just this ineluctable tragedy of the passing of time that Tolkien captures so perfectly.\nAi! laurië lantar lassi súrinen, Yéni únótimë ve rámar aldaron! Yéni ve lintë yuldar avánier mi oromardi lissë-miruvóreva Andúnë pella, Vardo tellumar nu luini yassen tintilar i eleniómaryo airetári-lírinen.Sí man i yulma nin enquantuva? An sí Tintallë Varda Oiolossëo ve fanyar máryat Elentári ortanë ar ilyë tier undulávë lumbulë ar sindanóriello caita mornië i falmalinnar imbë met, ar hísië untúpa Calaciryo míri oialë.Sí vanwa ná, Rómello vanwa, Valimar! Namárië! Nai hiruvalyë Valimar! Nai elyë hiruva! Namárië!\n'Ah! like gold fall the leaves in the wind, long years numberless as the wings of trees! The long years have passed like swift draughts of the sweet mead in lofty halls beyond the West, beneath the blue vaults of Varda wherein the stars tremble in the song of her voice, holy and queenly. Who now shall refill the cup for me? For now the Kindler, Varda, the Queen of the Stars, from Mount Everwhite has uplifted her hands like clouds, and all paths are drowned deep in shadow; and out of a grey country darkness lies on the foaming waves between us, and mist covers the jewels of Calacirya for ever. Now lost, lost to those from the East is Valimar! Farewell! Maybe thou shalt find Valimar. Maybe even thou shalt find it. Farewell!'Varda is the name of that Lady whom the Elves in these lands of exile name Elbereth."}, {"Review": "I am going to say 4.5 stars. In the beginning I thought it was a little dull. It was making me weary and sleepy reading it. I actually stopped in the middle of chapters because I couldn't read anymore. I hate that! I kept moving, though. I am determined to finish this trilogy. I should have known this book would have taken me longer to read than expected. The movies took me nine days to finish. Don't judge. I was pregnant during that time and very sleepy. I am very glad I kept going, because the last half of the book was amazing. My heart still hurts for the company. The book was written very well. It was beautiful. The world that Tolkien created amazes me. The scenery was so beautiful that the imagery I thought up stung my eyes. How did he come up with the places and people? How/where did he get the imagery? It was so detailed that it simply baffles me. I can't even describe a place that is real, let alone imagine a whole tree city. I could imagine all the scenes. All the travels. Sometimes it was information overload, but it was great. Even in the first half of the book there was that looming evil presence of the Riders that kept me enticed to know what happened. Sometimes I looked over my shoulder to see if I was being watched. You can't get any better than that.So, I don't think I can trust shadows anymore. Thanks Tolkien! Can't wait to start the next part of the journey. "}, {"Review": "Where would the fantasy genre be without Tolkien? He gave us the first deeply developed fantasy world, and character and plot tropes that are still go-tos for fantasy writers. Are these tropes now overused? Yes, as are tropes in other genres. As King Solomon said, “There’s nothing new under the sun.” We are constantly reusing the ideas of others while trying to improve upon them and make them our own. And we have Tolkien to thank for many of those ideas. I respect him and the Middle-Earth he created immensely.All that being said, I have always struggled with The Lord of the Rings. There’s something about Tolkien’s style of writing (excepting his style in The Hobbit, which is radically different and more easily accessible, in my opinion) that bogs me down instead of sucking me in. His scenery is beautiful, his characters interesting, his plot intriguing. I should be engrossed, but I’m not. It’s a classic of the genre, and one that I hate I can’t seem to get through. I know this is blasphemy, but I think that Peter Jackson’s movies did a better job of presenting Tolkien’s story and engaging an audience than Tolkien managed himself.This is my second reading of The Fellowship of the Ring. It was just as difficult as the first reading. There were sections that were wonderful, but those were sprinkled throughout sections that I had to trudge through. A couple of things that the book has over the movie: First, Frodo is so much cooler. He’s not whiny and helpless, as he’s portrayed by Elijah Wood. In the novel, Frodo is funny and sturdy and dependable. Not as dependable as Sam, perhaps, but he isn’t the burden the film makes him out to be. Second, the book has Tom Bombadil! He’s one of the most interesting, mysterious characters in fiction, and I hate that he was cut from the films. But other than those two aspects, I have to admit that I really enjoyed the movie more. I give this book four stars simply because I respect so much the legacy it left behind."}, {"Review": "Read the review by Doc Opp; I think he covers it quite nicely. He explains how Tolkien was the forefather of fantasy writing, and why that makes his books important. He also shares his opinion that the historical importance sort of causes people to overlook that Tolkien couldn't write worth beans.Opp posits that perhaps it has something to do with the concept of heroism being different in Tolkien's days than it is now. I'm not sure I agree with that. I mean I agree that his characters are a study in perserverance without being able to really fight or do anything but perservere, I just don't know that I buy that it's a sign of the times. I think Tolkien was just boring.I don't disagree, also, that the Shannara series is essentially the same storyline with a better writer at the helm.My venom towards Tolkien is greater than Opp's perhaps because we read for different reasons. I have very little patience with writers who have great ideas or imaginations when it comes to the physical world, but can't get inside the head of a person to save their lives and thus can't tell a story. This sort of writer is often found in sci-fi/fantasy, because the genre is geared to reward the most innovative and plausible inventing of a future or past timescape.If guys like Opp were always doing the commentating I might not hate Tolkien with such a passion, but unfortunately the world is filled with people who don't read sci-fi but who recalled their lit teacher spoke Tolkien's name once and probably said something about how he was the father of modern fantasy, and those people went on to shout Tolkien's name from the rooftops to the extent that a movie even got made out of it. Now the movie I could actually stomach (a little) because Hollywood realized they couldn't completely bore the pants off of people and still make money. But I digress.I cannot conceive of any reason one would read these novels unless they were forced e.g. for a class. And even then, it'd better be a history class and not a writing class, unless the objective was to teach how not to write. There's no pace, no character development, the focus shifts between groups of characters ala Robert Jordan without any of Jordan's redeeming qualities (although Jordan certainly has faults as well).The most compelling reason to read these novels is so that you can rip someone a new one when they bring up Tolkien by making a point by point case where you describe all the things he does wrong.Let me put it this way, I have read some of the most God-awful books in my time. I mean when I was younger I would read a phone book if it was handy. But I could not finish the Fellowship of the Rings.Comparing Tolkien to Asimov is just...I mean that's like comparing me to Asimov. I have an imagination and so does Asimov, comparison ended. Asimov came up with a plausible future that was interesting, and then he wrote characters within that adventure that were compelling. Caves of Steel is brilliant because whatshisface the detective is sort of an everyman and Asimov deals with things such as embarrassment because your Dad's job doesn't rate you high enough to eat at the right hydroponics diner. I'm mangling things, but you get the point. Asimov may have been the best ever at having really cool ideas and not wasting them by forgetting to write about people.I hate Tolkien, I blame him for his vacuous and enraging fan base, I blame him for every author that followed him that spent 5 hours describing a blade of grass, I hate him for taking a genre that I like and making me want to vomit on it, even if he was the first. It makes me want to burn my entire fantasy bookshelf down to the ground.That's my review."}, {"Review": "Review to come when I can recover. I hope that my fellow Frodo, Sam and Aragorn will continue onto Two Towers with me! It's re-read and buddy read as of 1 July with the lovely:Fuzaila/FrodoBhavik/SamFares/MerryRusty Grey/Aragorn/Bill the PonyAnd me, Pippin. Because I'm a ditz. Don't worry Fuzaila, book Frodo is awesome :)I've decided we're all Hobbits since there are four of us. I love the diversity of our read - two African and three Indian readers :DObviously. The best book in the universe deserves as much."}, {"Review": "This was long overdue and I am so happy to have finally read the first book. Finishing Books 2 and 3 will be among my early goals of 2018. I can't say enough about how much I loved this book. It's always fun to read about a character who is on the move. The constant action, even if it's as repetitive as avoiding a trail and walking through the woods for two days, kept the narration grounded, which was important in painting a picture of how vast middle earth was.I love the movies in their own right, but I think I prefer Frodo in the books over the movies. Nothing against the direction Peter Jackson took it, I just thought Frodo came across as far more mature and wise in the book. We had the benefit of hearing his internal dialogue, rationalizing his decisions. I know there is not much I can add to reviews that haven't been said already. This is one of the most read books of all time for a reason though and I'm glad to finally see first hand what that reason is; they are as good as people say they are (or at least the first one is)"}, {"Review": "(Update: Want to read the complete review? Visit the article in Counterpunch!)I'll admit this: the only reason why I read the LOTR Trilogy was because I was jealous. The year: 1972. It was a time of ridiculously insane fashion: hot pants, maxi-coats (and pads) and rough-woven cotton shirts, so scratchy they felt like the sartorial equivalent of surgical gauze with chunks of wood stuck between the weave. It was not for the faint-hearted.And of course, who was the most faint-hearted? Me. I was entering a new high school in a new town in a country I hadn't live in since I was eight. And since I didn't fit in (or so I thought) I was desperate for a new identity. Since my sister had squatter's rights on the cute/adorable/PYT persona, I was left with the one that I later discovered would make high school life a living hell: The Smart One.The only problem was, I wasn't that smart. Sure, I could work in references to Betty Friedan with only the vaguest notion about who she was, but when you're surrounded with a peer group who thinks the face of feminism is Marlo Thomas, it was easy, except for the one person who was the true intellectual: Colleen. Colleen represented everything I wasn't: a polite, wise-beyond-her-years semi-adolescent with perfect skin and hair, who sported a near genius-level intellect. Think of an Asian Susan Dey with actual musical talent and the potential to enter Berkeley at fifteen. And it didn't help to have a mother whose daily mantra was \"why can't you be like Colleen?\"So I was in love/hate over Colleen. If Colleen wore culottes, I wore culottes, only mine were eight sizes larger. If Colleen cut her bangs, so did I. The problem was, she had straight Japanese hair that tumbled dutifully back into place whenever she tossed her sylph-like neck. Me? Picture the hair of a young, chubby and half-Japanese Phyllis Diller but without the wigline.But the one thing that stood out most about Colleen was her and her equally intellectually superior friends' obsession with LOTR. She told me stories of their endless discussions of Middle Earth, Gandolf and the rest of the lot. Images of Colleen and her friends, looking semi-elvish, slipping from class to class, dodging dull students, dogged me in English class. They were ninth-grade gods. It wasn't until Colleen told me they left an inside joke about their instructor on the blackboard in *Elvish* in one of their gifted classes that I decided to take action: I got on my bike, went to the local K-Mart and bought the Trilogy. I started out strong: the hobbits I was comfortable with. Then came the Elves. Then the dwarfs, the Orcs, the whatevers. After the parade of names like Bombadil, Elendil, Everclear, I had the horrible realization that I was hopelessly lost. And it wasn't going to be easy to find my way back.But I was undeterred. I sloughed my way through Fellowship, then Two Towers and Return. I played little tricks to keep me interested: pretending I was one of the plucky hobbits, fantasizing myself as an Elven goddess--anything to keep me reading. It must have worked because I finished the damned set. But my plan didn't work. I was still me: I couldn't muster witticisms about Boromir to clueless classmates. I was still plump and my hair was as unruly as ever. Worse, my mother not only kept comparing me to Colleen, she started pulling out photos to illustrate her point. I shoved the books on the top shelf and tried not to think about being a Smart Kid ever again.But it was too late. I knew enough to be dangerous. I realized that even if I didn't like the books, I was familiar enough to make knowing comments about them to the right (i.e., AP-bound) clique. So I was accepted. Kinda.I still have the books. They're still sitting on my bookshelf, surviving countless moves and weedings. Still can't remember who Arwen is, though. "}, {"Review": "\n\n“Not all those who wander are lost.”\n\nI expect that that if anyone thinks or says the word\nfantasy,\n the first thing that comes to mind is \nTolkien\n and The Lord of the Rings right along with it. I relish a good fantasy, but after watching and loving the movies, I was reluctant to read the book. Perhaps pure stubbornness on my part, biased by a crooked idea that the book couldn’t be as good. I was so wrong!I loved everything about The Fellowship of the Ring. \n\n J.R.R. Tolkien\n\n's book is not an action or even an adventure story (Peter Jackson made it an action-packed movies, and it couldn’t have been different or better). It’s much more, or not it at all. It’s a road trip of the hero Frodo Baggins and his out of this world companions: his three Hobbit friends, the wizard Gandalf, Aragorn/Strider, the elf Legolas, the dwarf Gimli and the anguished man Boromir. Of course, there is Sauron (or the allusion of him through his minions), the Nine Riders or Nazguls and the \nRing!\nAs you go along with Frodo and his comrades on their meanderings (that I didn't feel were hurried, but seemed kind of languid!), you live in a make-believe world hearing of its past and worrying about a likely dreadful future. But there are also songs and poems: \n\n“All that is gold does not glitter,Not all those who wander are lost;The old that is strong does not wither,Deep roots are not reached by the frost.From the ashes a fire shall be woken,A light from the shadows shall spring;Renewed shall be blade that was broken,The crownless again shall be king.”\n\nFurther incredible characters only enrich the overall great feeling that reaches you of \nMiddle-Earth\n. It’s a place of escape, it’s even more for me: it’s a paramount experience.\n\n“I wish it need not have happened in my time,\" said Frodo.\"So do I,\" said Gandalf, \"and so do all who live to see such times. But that is not for them to decide. All we have to decide is what to do with the time that is given us.” \n\nSimply marvelous!"}, {"Review": "من از سیزده چهارده سالگی رؤیای ارباب حلقه ها را داشتم. اولین بار بخش های پراکنده ای از فیلمش را در تلویزیون دیدم: موجوداتی کوتوله ساکن روستایی زیبا، با جادوگری پیر که آتش بازی راه می اندازد، و حلقه ای شیطانی که آرامش دنیای داستان را بر هم می زند، و سواران تاریک، و چشم آتشینی که همواره ناظر است.هر چند هیچ وقت نتوانستم تمام سه گانه را ببینم، ولی همین عناصر به قدری تخیل نوجوانانه ام را تهییج کرد، که همیشه سر در آوردن از ماجرای کامل کوتوله ها و حلقه ی شیطانی، یکی از حسرت هایم باقی ماند.گذشت تا این که در دوره ی دبیرستان، یکی از رفقایم کتاب را می خواند و با هم راجع به آن صحبت می کردیم. صحبت که نمی کردیم. بیشتر او تعریف می کرد و من مجذوب و مجذوب تر می شدم. کتاب دم دستم بود، و من هم خوره ی کتاب بودم، نمی دانم، نمی دانم چرا هیچ وقت کتاب را از او نگرفتم تا بخوانم. شده از کارهایی که در کودکی کرده اید تعجب کنید که آخر چرا من این کار را کردم؟؟قطعاً قطعاً اگر همان موقع فیلم را می دیدم یا داستانش را می خواندم، \"ارباب حلقه ها\" در کنار \"هری پاتر\" تبدیل می شد به غنی ترین خاطره ی نوجوانی ام. حتی در این سن، مثل کاشفان سرزمین های ناشناخته، ذوق می کردم از یافتن فلان منطقه و ارتباطش با فلان رود، روی نقشه ی \"خطّه ی میانه\"، یا کسب اطلاع از تواریخ و اسطوره های اقوام مختلف و تطبیق تمام این یافته ها، با وقایع داستان."}, {"Review": "The world is indeed full of peril, and in it there are many dark places; but still there is much that is fair, and though in all lands love is now mingled with grief, it grows perhaps the greater.\"W-O-W! I'm completely blown away..This is the kind of story the word epic seems to have been invented for. J.R.R Tolkien didn't just make up Middle- Earth,he infused every aspect of it with life. The great depth of work Tolkien put into producing his creation involved inventing landscapes, languages, beasts and beings that have influenced many other fantasy worlds.  Nothing quite like this had ever been done in literature before! It is undoubtedly a spectacular fantasy tale, one that will continue to live on through the ages. 5 stars out of 5 from me - Tolkien is a genius.."}], "Image": "https://images.gr-assets.com/books/1298411339l/34.jpg", "Desc": "Alternate Cover Edition ISBN 0618260269 (copyright page ISBN is 0618346252 - different from back cover)One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkeness bind themIn ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell into the hands of Bilbo Baggins, as told in The Hobbit.In a sleepy village in the Shire, young Frodo Baggins finds himself faced with an immense task, as his elderly cousin Bilbo entrusts the Ring to his care. Frodo must leave his home and make a perilous journey across Middle-earth to the Cracks of Doom, there to destroy the Ring and foil the Dark Lord in his evil purpose.--back cover"}