{"Name": "The Fork, the Witch, and the Worm: Eragon", "Image": "https://images.gr-assets.com/books/1539186315l/26152839.jpg", "Reviews": [{"Review": "\"Does the eagle worry about the length of the day? Does the bear or the deer or the fish in the sea? No. So why should you?\"This new instalment from the world of Eragon and Saphira was more than I hoped it would be. Initially, I had my doubts that a few short stories would do the trick – that they would be able to transport me back into this world. But to my great surprise, it was the perfect book for several reasons. Of course, it’s wonderful to see what happens to Eragon and his people – and dragon – after he left Alagaësia. We get smaller and bigger glimpses of familiar characters; sometimes they are only mentioned in a sentence or two, but some of them even appear in one of the stories. The best thing about this book, however, is one very special and intriguing novella…The book is divided up into three parts as the title suggests. Each part contains three chapters. Chapters one and three are always told from Eragon’s point of view and serve as frames for chapter two. The Witch, Part II, chapter two was written by Christopher Paolini’s sister Angela who was the inspiration for the character with the same name that also happens to be at the centre of said chapter. I must admit that it was my least favourite story out of the three. It did not really catch my interest. I loved the story in Part I, though, but my favourite remains the one from Part III, The Worm of Kulkaras. I don’t think that I have ever absorbed one of Paolini’s stories quite like this.I utterly forgot about my surroundings, and for a few moments, the events from the book became more real than reality itself. It was a powerful story about revenge, empowerment, and the nature of things. It is told from the point of view of an Urgal woman who swears to kill the dragon that killed her father and destroyed her village. The more I think about it, the more genius it becomes. But I don’t want to take away too much, so you should make sure to read it yourself.Since this is only Volume I, I expect that one or two more books with novellas will follow. I expect that the next one will be told from Arya’s POV, but I might have to sit and wait patiently to find out. After reading this book, though, this might be easier said than done.Thank you to EDPR for providing me with a free copy in return for an honest review.Find more of my books on Instagram"}, {"Review": "I have come home.Just look at this beauty:What a blast of fresh air this has been; I had forgotten what it felt like to devour a book so pure in its storytelling that you lose track of time. I feel like a reader again, if that is even possible.I read Eragon back in high school. I remember that time clearly. We had chatted about Saphira, Brom, Nasuada, Galbatorix in between classes, a discussion filled with starry-eyed wonder for our new favorite series after Harry Potter. And what a joy it is to relive those moments through a book that doesn’t disappoint, as most sequels do. I have never been gladder to be a reader, to be a lover of books, as I do now, because what is life without delving into tales of dragons and magic? The first thing I would like to mention is that do not hesitate to read the book after seeing it’s a compilation of short stories – truth be told, I did have my inhibitions because after all, Paolini’s customary 500+ paged books are why we have grown to love the author. But where the small book could have left my thirst unquenched, I find myself simply wanting more, having grown more fond, rather than less, of the characters I first started loving in Eragon. Tales from Alagaesia is split into three stories. We start with a prologue detailing Eragon’s work since he has left for the island housing the many dragon eggs. The valley has undergone extreme construction, and Eragon realizes there is much work to be done still, although that has him in low spirits owing to his thirst for knowing and attaining everything at once. Underlining his concerns is the still open wound from having left everything, including the woman he loved, behind to serve the greater purpose, as he sees it.  The Fork Straight up a nod to one of the main characters from The Inheritance Cycle (and whom everyone either pities or hates, depending on how they see him – I for one grew to love him because he did go through a lot of shit) The Fork is about Murtagh’s encounter with foes in a drab inn in a small town. There he meets Essie, a small girl considering leaving her town for good following bullying at the hands of the town’s more privileged kids. Told from the perspective of the Eldunari to cheer up Eragon’s spirits, the story serves to teach a few lessons, not least of which is one we all must remember:  Sometimes you have to stand and fight. Sometimes running away is not an option.  Although the story doesn’t offer many details about Murtagh’s life following the great war with Galbatorix, it is evident he is still an outcast and would need to overcome a lot of his fears in the coming years to find true happiness.  The Witch A first, I think, in Paolini’s works as this one was written by his sister, Angela, the woman after whom our beloved witch Angela is named in the books. Eragon and Saphira are visited by Angela and Solembum (ah, how I missed that cat), accompanied, unexpectedly by Elva, the child Eragon “blessed”. We discover Angela has been writing a biography, and she asks Eragon to read the handful of chapters she has completed, some of which detail how Elva came to be with the witch, having previously been housed [or imprisoned, depends on how you see it] in Nasuada’s castle. The story sure made me hope Paolini actually writes a biography for Angela as I would love to know what quests she had gone on before meeting Eragon in the first book. The Worm Much longer than the other two stories, this one turned out to be my favorite. A normal day in the valley ends disastrously following a grave tragedy. Everyone, the elves, the urgals, the dwarves and Eragon and Saphira, are overcome with despair. Amidst the melancholic gathering, Eragon asks the Urgal leader to tell him a tale to cheer him up. And we find ourselves in a land centuries old, where an Urgal clan is attacked by Vermund, a great, black worm of a dragon who wreaks havoc on an entire village. Ilgra, a young female Urgal, watched the creature devour her father, a mighty leader. Thereupon she vows revenge and bids her time as following a lengthy feast, the dragon perches itself atop the highest mountain and falls into a deep slumber, till when it will get hungry again and return to hunt and scrounge for food. Ilgra embarks on a mission to train herself, so as to become strong enough to defeat the mighty beast. We see her first becoming one of the Anointed (Kull – as mentioned in The Inheritance Cycle) then trying to attack the dragon herself then challenging a shaman to teach her magic so she could fight the dragon using unseen forces. As each of her efforts wears her down, she refuses to lose hope, using her deceased father’s horn as a source of motivation. The story’s ending was the book’s peak for me, as we learn how not every quest can go as you planned. To see how Ilgra fared in her self-imposed mission to singlehandedly fight a dragon, I leave you the task to read the book yourself. As the story ended, I found myself once again inspired by the unique way Paolini draws his characters. Who knew an Urgal, a beast of a race we learned to hate in the first few books, could be a source of inspiration?   But there were still things in life he could not overcome – things that no one could. It was a sobering thought. When Eragon was younger, the knowledge would have bothered him. now, though, he understood the wisdom of acceptance.  As the story drew to an end, Eragon wondered anew why he put so much pressure on himself to always win. And just then his companions delivered a piece of happy news, a note on which the novel ends, leaving you hoping Paolini would pick up his pen soon.To conclude, I didn’t know I needed the warmth of Saphira’s character, the strength from the Urgal’s way of living, the resilience with which Eragon has persevered, the quirkiness of Angela and the might yet beauty of all dragons until I picked up this book. I sorely craved the happiness one gets from reading a satisfying novel. I have always been, and I always will be, a true fan of Paolini’s works and I hope to heaven we get a series based on Eragon’s story (not the garbage movie they churned out years ago) to sate my hunger at least a bit until Paolini releases another book.   “Books should go where they will be most appreciated, and not sit unread, gathering dust on a forgotten shelf, don't you agree?” ― Christopher Paolini  "}, {"Review": "Eragon will ALWAYS have a special place in my heart for me. Back in 2006 when I was 15 and being in my sophomore year of High School, I had to take a reading test that was required for all Sophomores for the English classes and if we passed a certain grade level, then we didn't have to take this reading class that lasted one semester. Well, I got a 3rd grade reading level and I HAD to take this class and drop one other. I did used to love reading considering I was born in '91 so which means Junie B. Jones, Magic Treehouse (the originals), Adventures of Bailey's School Kids, Illustrated classics. And one time I just lost it all my years in Junior high school.So what does Eragon have to do with all of this? Well, not only did this class have some program that Scholastic had, but after those of us in this class was done in the computer lab with this program, we had to have a book to read for the duration of the class and since I didn't like reading anymore at the time and lost the love of it, I NEEDED a book bad. So I asked some friends what book I should read and didn't care what it was. The majority said Eragon. I wasn't a fan of dragons or anything but I knew it was something. So I think I was either borrowing it from a friend or using the school's library copy--I can't remember--I was bored for a while. Up until one moment I can't remember what it was, but it sparked something and from then I couldn't put it down. So here's the thing: I didn't like the whole dragons, high fantasy, made up language etc, BUT I LOVED this story, I loved the characters and I did love the world and the rest is history.So for me, it was actually Eragon that really got me back into the love of reading and although I haven't read or gotten much into high fantasy, Eragon is my BIGGEST exception for my excitement because after all like I said, it got me back into reading. So with this book I actually meant to drag this out and wait a few days to finish because it was going so quickly and I didn't want to leave. So dragging it was actually the best thing I did. And I'm still sad it's over *crying internally* BUT BOOK 5 AAAAHHH!!!! *heart eyes* And if I could this book would be rated infinite stars if I could. So my excitement to read these three short stories (now almost 28) or should I say set ups for an actual 5th book (*eek*) I LOVED them and I loved seeing familiar faces again. But most of all it felt good to be back \"home\" in Alagaesia with my favorite dragon rider and dragon. Oh and my favorite witch and herbalist Angela! :D If you get a chance READ THESE BOOKS and if you have read them then put THE FORK, THE WITCH AND THE WORM on your list ASAP and read it ASAP!"}, {"Review": "So good to be back in Alagaësia! Didn’t realized how much I missed this universe until I delved into the pages.There are three stories within, separate events but connected in between. The Fork is the lovely story of a little girl and how Tornac (view spoiler)[meaning Murtagh (hide spoiler)] helped her, in The Witch we learn (or at least we think we do) some new things about Angela and Elva and The Worm is the legend of brave Ilgra and her quest against Vêrmund, the dragon of terror, legend told by one of the Urgals.The end brings a surprising news which I hope will be developed in a future tale.I’m so glad that there is much to tell from Alagaësia and that our heroes continue their stories. Had this little book would have been tenfold bigger, I wouldn’t have complained at all."}, {"Review": "“Às vezes sonhava em embainhar a sua espada, Brisingr, pegar em Saphira e pôr-se a caminho à procura de uma aventura. Não passava contudo disso mesmo: um sonho. Não podia deixar os dragões News os Cavaleiros entregues à sua sorte.”*“At times he dreamed of strapping on his sword, Brisingr, getting on Saphira, and setting out to see what adventure they could find. It was just that, though: a dream. They couldn’t leave the dragons or the Riders to fend for themselves.”- Eragon* * *“Às vezes é preciso uma pessoa erguer-se e lutar. Às vezes fugir não é uma opção.”*“Sometimes, you have to stand and fight. Sometimes running away isn’t an option.”- Murtagh"}, {"Review": "I was in Middle School when Christopher Paolini's Eragon first came into the world. When I read it, I remember crying when I finished because I had never read such a good book and there wasn't more...yet.Now the Inheritance Cycle is complete, with four books in the series: Eragon, Eldest, Brisingr, and Inheritance. The end, right? There has been numerous contemplation and even valid assurance by the author that there will be more stories in the world of Alagaesia, and finally, after seven long years of waiting, we get a tiny snippet of what Eragon is doing after the defeat of Galbatorix in these short stories in the given series name Tales From Alagaesia, Volume 1: Eragon. VOLUME ONE, which means there are more to come. After reading the afterward in the collection, I am glad that Christopher Paolini has found joy in returning to writing in Eragon's world.Each short story features Eragon as he is aiming to make a new haven and place for the next generation of Dragon Riders, and some of the business that goes along with that, such as paper work, physical labor, consoling the Eldunari, and entertaining unexpected guests.The Fork, Individual Rating: 5/5I don't want to spoil this one, but it was a 4/5 until the end, when the true identity of the character in this story is revealed (only to be my personal favorite character in the series). This was interesting because Eragon is sheltered away from Alagaesia with his own new set of problems, but Saphira insists that he rest. Glaedr, among other Eldunari, show that there are many others who have their own troubles, and that there is more going on in Alagaesia than Eragon can fathom with his own work load.The Eldunari show him a man who encounters a little girl at a pub, a girl who seems to run away from her troubles rather than confront them. This man has an oddly (enchanted?) fork, given the title of the story. There are a number of lessons to learn from the tale within the tale, as well as potential set up for one of the biggest characters of the series, aside from Eragon, for future adventures.The Witch, Individual Rating: 4.5/5Angela the herbalist visits Eragon with Elva in tow. She wants him to read the random chapters she has written as part of a memoir of her life. The middle portion of this story is written by Christopher's sister, Angela, in which the character is named after. The voice is very fitting to the universe, and I'd say she has done a job well done. While I found the beginning portion of the memoir a bit boring, once Elva was brought in, the pacing and excitement vastly piqued. This story adds intrigue to the possible future Elva might have, and shows her potential as a leading part of future tales of Alagaesia.The Worm, Individual Rating: 4.5/5This story starts off with a death that Eragon can do nothing about. One of the Urgals decides to tell the story of Ilgra and Vermund, or \"The Worm of Kulkaras.\" The story is meant to show Eragon that sometimes, no matter what you do or how hard you try, there are some things you just cant change and must accept as is. In the story, Ilgra is an Urgal whose tribe has been overshadowed by a great dragon, Vermund, who kills her people and their livestock whenever he so chooses. Numerous attempts to defeat the beast fall in utter failure. The lore of this story is somewhat interesting, and I like how it shows a bit of history with the Urgals, but the prose is a bit more dry than I would like, which made this story take a bit longer and I needed a slight motivational push to finish. The reason for the higher rating is not only the Urgal history, but the end with events in Eragon's new Rider haven has massive promise to the future of the series, and I really can't wait to see where all these stories lead to in future and how they might tie in to each other or to book five!"}, {"Review": "This is exactly what happens when a book just transports you to a new world and completely takes over you. I finished this book in less then a day (yes it is shorter then 300 pages but I have also been crazy busy). Being back in this world was such a treat and a joy. Christopher Paolini can write everything in the world of Alagaesia and I will throw money at him!! I needed this like I needed air. Not only was this little collection perfect it was also a great foundation for what will be the true continuation of the Inheritance Cycle. Paolini laid down some vague yet interesting plot threads and I am here for it. Was this a review or just an absolute gush, I don't care either way just know that this was everything my Eragon heart needed and I am waiting patiently for the next one!! "}, {"Review": "This was one of my most anticipated reads of 2019 and so it's super exciting to me that this was the first book I finished this year! If you watched my announcement video for the book, you'll know that I was cautiously optimistic - and overall my feelings on this are pretty positive!The Inheritance Cycle is so, so important to me as a reader. Eragon has been a favourite of mine from an extremely young age; the series overall was highly formative in my years as an early reader, and I just adore these books. As a result, when The Fork, The Witch and The Worm was announced, I was a little concerned. Recently, several authors I adore and respect have added new material to series which were supposedly complete, and I've honestly been let down by some of these new additions. I'm pleased to say that this book did not continue that trend - I had my reservations about some aspects, but for the most part, I enjoyed it! I'm going to discuss each short story in its own merit, and then my feelings on the book overall.The Fork: (A Fork in The Road)I have to be honest that I wasn't totally sold on this one. The child narrator wasn't my favourite; the voice, whilst accurate, just wasn't my cup of tea. I'm not a huge fan of young characters like this - whilst I respect the technique that writers use to embody a child's speech and thought processes in this way, it's just something I don't personally enjoy. However, there were definitely aspects of this that I liked - the ending of this story was stellar. (view spoiler)[When \"Tornac\" actually turned out to be Murtagh - oof! That was unexpected and I loved it. Honestly the contrast between how much I enjoyed Murtagh's few pages of narration in comparison to Essie's was huge - which means that if we get a longer story from Murtagh's POV I am so here for it! (hide spoiler)] Overall I found this to be personally a bit of a wobbly start but there were definitely parts of it that I enjoyed! The WitchThe idea behind this section of the story - Angela telling pieces of her own story - was intriguing. Unfortunately I'm one of those people who quite likes unsolved mysteries. Fandom as a whole always seems rabid for more information on mysterious characters, whereas I'm happy to let certain unanswered questions just sit there. If you've ever heard my thoughts on the Saracen Rue debate in the Skulduggery Pleasant fandom, you'll find I have similar feelings towards Angela - the unknowable aspects of her character are what makes her charming. As such, I liked that this stayed in keeping with Angela's tendency to reveal little, because we didn't learn very much about her at all here. I also loved the discussion of Elva and the way she was described; that rang perfectly true with the Elva we all know and love (and hate, a little - but isn't that rather the point of her?) so there were definitely pieces of the story that I found interesting. Unfortunately, I didn't really connect with Angela Paolini's writing. I think it was largely to do with the fact that, although the character is based on her, at the end of the day book Angela is a figment of Christopher's imagination and, inevitably, real Angela is seeing her through a different lens. As such it didn't entirely capture the way I personally read Angela; to me, it felt like reading about a different character. There were definitely certain quotes that made me go 'yep, that's Angela' - which is in keeping with things Christopher has said previously about how he would get stuck and ask his sister what Angela would say, then put that in the book - but perhaps because we've really had so very little from her, it was strange to read quite a large amount of prose from her perspective. Overall I felt a little dissatisfied with this section of the book, but there were things in it that I found interesting.The Worm: (The Worm of Kulkuras)This was the story that did it for me. I am fascinated by the Urgals and going more in-depth, actually seeing from the POV of an Urgal is something I've wanted from this series for a long time. If Book 5 isn't about the first Urgal dragon rider then I will have things to say, let me tell you. This was apparently the first story Christopher wrote for this collection and it is, in my opinion, the best and most polished of all of them. It rings the most true, to me, with the original series; it feels heartfelt, sad and action-packed, and has some really interesting callbacks to certain aspects of the other books. (view spoiler)[Not sure if naming the dragon Vermund was supposed to remind us of the Grimstborith of Durgrimst Az Sweldn Rak Anhuin?? I swear his name was Vermund. Dragon!Vermund really reminded me of Shruikan, with his total apathy, which was sad. I lowkey wanted Ilgra to become his rider but I knew that wouldn't happen. (hide spoiler)] It took me a little while to get into this one but suddenly I was hooked, and I enjoyed it so much. It was a wild ride; Ilgra was a great character and I really felt for her. (Can I just say I appreciate how female characters were at the forefront here? There sure were a lot of men in the original cycle and I like how many great women were given the spotlight in this book.) This was the story that made me finish the book nodding, with a warm glow in my stomach, thinking, \"Yes. That's Eragon. That's the series I love.\" It was a fantastic note to end on and I'm very glad it was the final story in the book. All that's really left to comment on is the interlocking middle parts of the stories - the small snippets of what Eragon and Saphira were up to in between. I personally liked that these parts were kept concise. I sense that some will disagree, but with this kind of extra material I'm always torn between my desire for more and my fear that the new stuff will taint my perception of the original. As a result I'm very glad that the author erred on the side of 'less is more.' I felt that some of the scenes were a little bit weak, perhaps because there wasn't really much of a driving plot - they were very much filler material. However, they did their job well, and I felt that by the end, Christopher had hit his stride with the characters and they came alive again. I loved that we ended on a hopeful note and also that there were no huge plot points that altered the end of the series. We're still left with this optimistic idea of what happens next, rather than everything being upturned and changing the satisfying conclusion we had in Inheritance. In conclusion: I liked this book. I'm left with a sense of relief after reading. I'm not going to pretend it's settled in my heart the same way the original books have, and it's definitely not a new favourite - but it was a decent return to the world of the Inheritance cycle, and I feel a lot less nervous now about any future content that we might gain from this series. If you made it to the end of this monster review, I congratulate you, because phew. I can't believe I just wrote all of this in one sitting. "}, {"Review": "I'm really struggling to give this book a rating. On the one hand I can't even describe what an emotional feeling it is to return to Alagaesia after all these years and be able to spend a few brief moments with the characters I've grown to love som much. To see how they are doing and find out about what they've been up to since after the end of Inheritance. On the other hand this being the first writing about Alagaesia since Inheritance came out years and years ago and the size and scope of the previous books I of course want to know EVERYTHING about EVERYONE - which this book sadly doesn't provide.The Fork, the Witch and the Worm feels more like a teaser than a proper book. We get to spend a few brief moments with some of the main characters from Inheritance although there's quite a few important ones that we don't get to see at all. Rather than giving lots of information and answers this book leaves you with questions and craving for more. Which I really hope will happen one day because the way it ended - there better be another one coming!A big chunk of this book is actually centered around new characters: one human girl and one Urgal young warrior. I have to say I absolutely loved the Urgal legend which was beautiful, interesting and captivating.I also savoured the precious moments between Eragon and Saphira and it was great to share in their special connection once again. And Murtagh <3That said I really, really need a proper book 5 please - a LONG one where I get to read about ALL the characters and find out about EVERYTHING that has happened since after Inheritance. Pretty please"}, {"Review": "I'm struggling with a rating on this one because I have no idea what to rate it. This book was not at all what I expected, but then again, I went into this having zero idea what to expect, so it feels wrong to rate it low when it was a well written book even though it did not meet what I wanted.The Fork, the Witch, and the Worm was weird and fascinating. It feels like a companion novel along the lines of the Silmarillion or the Children of Hurin by Tolkien. It gives random information, extra worldbuilding, and legends from one of the species. It was bizarre that it was so short because a bunch happened but also it felt as though nothing happened.What I can say for sure: Angela is a Timelord and I will fight anyone who says otherwise. Eragon has grown. He's no longer a squish, and I'm so proud but also sad to see him grown. This sets up PERFECTLY for a fifth full-length novel. We have rumblings of dark magic and bad stuffs, hope for a future, Eragon building the new home of the Riders, and the various inhabitants of Alagaesia being forced to work together.The whole side story of Murtagh in the beginning was definitely bizarre. I'm not sure why it was set up the way it was with the Eldunari showing Murtagh's current whereabouts and actions to Eragon. It would have made more sense to do the whole story from Murtagh's viewpoint in the firstplace--don't get me wrong, I loved hearing from Eragon and listening to him talk about his life and Saphira and what was going on where he was. The scene change was simply off somehow.The second story was something else. I loved hearing from Angela again, and reading a whole chapter from the original Angela was really, really cool if 100% nonsensical in some ways. Elva's part in the new world is also fascinating and can grow into something really well-done if Paolini continues with it well. I did find it a bit odd/lazy to mention that Angela told Eragon about how she and Solembum met but not tell the reader. This is a question a lot of us have had. I came out of that story with more questions than answers for sure.The last story was a complete departure from the narrative, and while I enjoyed it, I found it difficult to stay focused when I wanted more Eragon and Murtagh. I wanted to know what those guys were doing, not what some Urgal legend from ye olden era was. But it was cool, don't get me wrong.And that leads me to the all-encompassing question: what do I think? Was this needed? Probably not. But Paolini is a fantasy writer--an adult-esque fantasy writer. He lives in this world and wants to share its history and odds-and-ends with us. This gave us that. It gave a window into various parts of the world without becoming a 700 page novel. It set up what might be the elusive book 5. It gave a little resolution about characters--not enough, if I'm honest.So I'm sitting on a 3.5/4 star rating."}, {"Review": "I read The Inheritance Cycle series a few years ago and absolutely loved it! I was engrossed in Eragon and Saphira (my favourite dragon)'s story from the start. It was so magical. Humans, dragons, elves and all the other creatures in this world created by Christopher Paolini had captivated the hearts of so many readers. Therefore, I was over the moon when I found out that Christopher Paolini was going to release a new book set in the same world of Alagaësia. I couldn't wait to start reading this new release.📚The Fork, The Witch and The Worm is divided into three volumes. Each volume is a novella which focuses on a side character or a tale from the Inheritance Cycle series. Our beloved Eragon and Saphira make appearances in each of the volume. It is just so amazing to be part of their journey again! At the same time we get more insights into Alagaësia and some of the characters from previous books. I don't want to give away too many details about the stories as I know the fans of this series have waited a long time for any new releases set in this world. I will just say that I love all three volumes. If I have to pick a favourite out of the three, I would say I love the third volume the most! It is full of actions, battles and conflicts. It has a great pace that draws the readers in; it is also full of dangerous events and adventures. I love it!📚I finished The Fork, The Witch and The Worm in one sitting. I was just so happy to be back in Eragon's world. It was so entertaining but full of adventures and hearts. It is full of magic; it is brilliant, charismatic and dazzling. For Inheritance Cycle fans, this is a must read. For others who haven't read this series yet, why not pick it up and experience the joy of reading these incredible stories yourself?📚The Fork, The Witch and The Worm by Christopher Paolini is published by Penguin Random House Children’s and is out now!"}, {"Review": "Not what I hoped for.I absolutely loved the Inheritance Cycle and when I heard about a new book coming out I was more than excited, but this didn't really meet my expectations. I'll break down each part.The Fork was an interesting story that started us off with Eragon and what he's up to now. It had a very nostalgic feeling and I loved that first chapter. The next part started to confuse me as we were introduced to another character, but it was worth the read as you meet a long time favorite. I won't spoil.The Witch. I think everyone knows who this is about. We get to see inside the mind of Angela a bit and get some updates on Elva, but I still felt Angela's ramblings were a bit like a filler. We all know about her personality, but I suppose it was nice to read.Now the worm. This was the most disappointing. I anticipated the chapter being about Saphira, Thorn, or even Firnen, but it was an old story told to Eragon from the viewpoint of an unknown character. Sure, the story was fine, but in a book like this I wanted to know about characters we already love, not characters from long ago to teach some lesson. Overall, it was okay at best. We get to see a little of Saphira and Eragon (and I mean a little), a glimpse of our favorite herbalist, elva, and another, that again I won't spoil. But what about everyone else?My final review? It was a tease. "}, {"Review": "I thought this was just a rumor. I read the first one when I was about nine or ten I think, around when it came out. Since then, it has been one of my favorite series ever. But waiting for two years for a book is the worst when you are little. When the third came out, I thought the pain of waiting was over because it was supposed to be a trilogy. I then had to wait for another three years for the next one. Now he does this to me. I am crossing my fingers that he does not take as long to write this one as he did the others, and I'm gritting my teeth in apprehension of the wait. But, that fear of waiting is definitely trumped by how happy I am to revisit this grand world of my childhood where I learned my love of dragons, magic, and lore. "}], "Genre": "Fantasy", "ID": "26152839", "Desc": ""}