{"Name": "The Darkest Captive", "Image": "https://images.gr-assets.com/books/1513269895l/37534683.jpg", "Reviews": [{"Review": "Galen:Demon of False Hope and Jealousy. Butterfly: Two of them actually that represent his two demons. On his chest.His curse: He perverted true hope, inciting fear—a twisted hope for the worst to happen. He was mistaken for a pure angel with his angelic face and his white wings, but he only gave distraction from the true purpose and unfulfilled gratitude for something that you want and most probably will never happen. Adding to that the jealousy part, Galen is the mot horrific, dangerous demon carrier.Legion or Honey or ((view spoiler)[Leila (hide spoiler)]): DemonSupernatural ability: Demonic defences like poisonous bite and claws.The things that I love mostly in this series are the out of the blue surprises and twists that I could never see coming. Take for example Legion. When we met her for the first time, she was a horrible little demon that Aeron met in Hell while he was tortured in “ The Darkest Pleasure”. She was an “it”,i.e. an ugly stupid thing of questionable sex who liked killing and torturing. Aeron should be disgusted by it, not feel protective feelings for it.“Massster used to call me Legion before he called me Ssstupid Idiot.” It moved one step closer, humming with giddiness. Grinning, fangs making another appearance. “Want to play?” Legion. Interesting. “One of a thousand what?” “Minionsss.” Another step.Servants of hell,Wrath supplied with disgust.Useless, disposable, unworthy. Eat him. Aeron drew his knees up to his chest, preparing to attack. “Stop.” Now why had he said that? He wanted the thing to approach. Wanted to feast on it. It obeyed, the pout returning to its lips. “But we friendsss now. Friendsss get to sssometimesss ssstand next to each other. I ssseen them do it.” He didn’t bother reiterating that they weren’t friends. “Why are you here, Legion?” Questions first, dinner second. Anticipation brightened those crimson eyes. “Me want to play. Will you play with me? Pleassse, pleassse, pleassse.”(From The Darkest Pleasure)I don't know about you, but my first thoughts about Legion is that it is sexless or a male demon. And the same thing thought all the Lords of the Underworld.“Settle down, boy,” Lucien told the little demon. “We only want the best for Aeron.” Legion hissed like a startled cat, the noise scraping at Reyes’s skin. “Me no boy. You think me a boy?” Everyone stopped, stared. Even Aeron. Reyes was the first to find his voice. “You’re a…girl?” A nod. “Me pretty.” “Yes, you are.” Reyes exchanged a glance with Lucien. “Beautiful.” Aeron had yet to recover from the shock.(From The Darkest Pleasure)SURPRISE! Yes, Legion is a girl demon. A girl who changed into a beautiful woman in order to protect Aaron and trap evil Galen in The Darkest Passion.“You’re beautiful,” she said, and he was. With his pale hair and pale blue eyes, with his flawless features and sensual mouth, he was every woman’s fantasy. But he’d helped destroy her Aeron’s life, and for that he would pay. “I want you.” Dead, but she didn’t add that part.He arched a brow. “Of course you do. You can’t help yourself. None of you can.” He almost sounded…upset by that. “Here’s a little news flash for you. No matter what I make you feel, hopeful for a future, a wedding, babies, you’re not going to get it from me.”(From The Darkest Passion)Well, he will get much more from her. She will become his obsession for many years and for many books. While she was spending her life in Hell suffering the consequences of the deal for her transformation, Galen was thinking about her.When she was saved from Hell by the Lords and she was the most broken girl in the world, Galen still wanted her. He made deals with his enemies in order to be close to her. So we reached finally this book, The Darkest Captive, where Galen and this obsession will finally meet and Legion will be ready to face him and see where this will go.Yeh! Lucky us, the fans :)Yes, I have been looking forward to reading their story and I have to admit that even if it was 1000 pages long, I would have read the book in one sitting. Unfortunately it was a bit shorter in comparison to the normal length of a Lords of the Underworld novel. But it is still okay. I didn’t mind at all, because the story of Galen and Legion has been expanded in several books already and because this book felt like a last chapter in their already fulfilling love story. So, yes I enjoyed the book. Mostly because it was about Galen and Legion and only them. No side secondary stories are included.The book starts with Galen trying to convince Legion to give him a chance. He basically uses in order to communicate with her the only way all lovers have been using through centuries. He write letters to her which he is not sure whether she can read them.Admit it. If we were characters in a (super hot) romance novel, you’d be the vulnerable babe in need of a protector, and I’d be the hardcore alpha villain everyone secretly yearns to tame. Spoiler alert: I’m willing to let you give the taming thing your best shot. Because I’m a giver.AndI don’t want you on your own.If you leave with me, you’ll get 24/7 care, and a huge benefits package. I can’t oversell that benefits package. Your safety, well-being, and satisfaction in a job well done will be my top priorities, I swear it.I want to protect you. I NEED to protect you. Please, let me.So, this is the book where the series’ biggest villain and the series’ most tortured girl will find their HEA.The book is must-read if you're a series fan. If you are new in the series, the book still includes enough details of this world and you can easily connect to the story.I loved the book! It gives a deeper understanding of the complex characters of Galen and Legion. Galen will have his redemption and Legion will have her lover and saviour .(view spoiler)[BEFORE PUBLICATION -----------------------------14th of DecemberBook cover has just been revealed.--------------------------------------------Lucky us! Two books of LoTUs will be published in 2018.This second book is about Galen and Legion and it will be published from 1001 Dark Nights.I was looking forward to Gallen's story for many years now. We all knew that he will end up with demon Legion.I only hope that it will not be a short length story, since I know that 1001 Dark Nights usually publish short length books. I believe Galen deserves a full length book.Anyway, this will be good ;)  (hide spoiler)]"}, {"Review": "4 STARS\n\nGalen might have been created for war, but he lived for Leila.\n\nYears. YEARS I've been waiting for Galen and Legion's story. It's been the most torturously painful foreplay right after William (and now Hades). What I'm trying to tell you here, is that I NEEDED their book. And while I was definitely disappointed we wouldn't be getting a full novel for them, the novella was still satisfying enough to appease this reader. \n\nShe had the face of an angel and the body of a porn star, and he wanted to pray and sin at the same time.\n\nThe nice thing about this novella, is that readers that are new to the series can enjoy it as well. But if you're like me and have read the entire series, than you'll certainly have a different sort of appreciation to Legion and Galen's journey.Admittedly, I struggled with Legion as a character after Aeron's book. I mean, an almost childlike demon turned beautiful seductress? I wasn't sure if I bought into it. But she's won me over with her strength and perseverance throughout the series. Her do anything for those she love attitude is what got her on Galen's radar and I couldn't wait to see how it all concludes.Galen has been THE baddie for the first half of this series. And if there's anything I love, it's a good redemption story. After a sizzling encounter that was only supposed to be a means to an end, it ended up changing the course of things for both Galen and Legion. Legion has been trying to heal her mind after the torture she endured in hell. And Galen has been obsessed with finding and finally wooing her back into his bed once and for all. I really loved Legion and Galen together. I did find myself wishing that it was more fleshed out into a full story, as it did feel a bit rushed at points. But at the same time, I still highly enjoyed it despite that quibble, so I can't complain much. Now if you'll excused me, I'm off to go rock myself in a corner until William's book finally comes out.ARC courtesy of author in exchange for an honest reviewFind me on:  "}, {"Review": "AFTER READING:SPOILERS AHEAD, BE WARNED!This novella was not enough for the two complex characters that were featured. Legion, a minor demon of Strife and Galen, Keeper of Jealousy & False Hope had so much unexplored background to them and because of it, The Darkest Captive felt rushed and unfinished. Storywise, can't say I understood anything about Cronus and his clones. That whole storyline seemed forced and unnecessary and all over the place.On the other hand, I liked Fox and everything about her. In the next novella called The Darkest Assassin, Fox and Bjorn will be featured. Once again, two complex characters and their story told via novella. I just hope that it will work out better than this one. AFTER DOING SOME THINKING...I am kind of interested if someone could explain me one thing. How is it possible that Legion and Galen, who were very important characters since they were introduced, have their story told in a novella while Baden, who was almost dead until his book and is super boring, got a full novel?AFTER THE PAIRING ANNOUCEMENT:GALEN & LEGION!How could I be so blind? Of course, this is their book (novella). Both Galen & Legion were captives in their own right. Legion was kidnapped by Lucifer while Galen was in a prison of sorts, that's where he met Keeley. Can't wait.BEFORE RELEASE:I guess this is going to be Siobhan's book.Who is gonna be her love interest? Please, let it not be William or Hades!"}, {"Review": "Finished. Liked it. Great addition to this series. But, I have to say I wish there was more passion in their romance. It was sweet but I definitely wanted more intensity rather than fun lovin light heartedness (lol it's usually the other way around for me. guess theres a first time for everything)12/3-AAAAAHHH HOLY SHIT YALL THIS COMES OUT TOMORROW IM SO EXCITED AHAHAHAHHEEEEEP THE RELEASE DATE IS GETTING CLOSER!!! OK EVERYONES FREAKING OUT ABOUT WILLIAM AND GILLY BUT HONESTLY THISSSSS IS WHAT IM HERE FORFUCK YEAH GALENFUCK YEAH LEGIONthis is the one ive been waiting for bruvsthe real fucking deal. I'm so ready for this I care more for it than William's lol"}, {"Review": "UPDATE: 14. KİTAP DA OLMADI BARİ BU WILLIAM OLSUN YALVARIYORUM BAK NOLUR AHAHAHĞĞĞUPDATE 2: NEDEN GENA NEDEN ÖNCE WİLLİAM'I YAZSAN OLMAZ MIYDI YANİ AĞĞHĞĞĞHĞtamam Galen'i okumak istiyorum ve Legion'ı Aeron'a bağlamadığın için bu yaptığın çok ponçik de BANA NE YAAAAAAAAAAO ZAMAN WİLLAM'A SPİN-OFF YAZSIN BA.NA.NE!BUNU ZATEN HEP SÖYLEDİM YİNE DİYOM.ŞEYTAN DİYO ÖLDÜR GENA'YI.NEDEN WİLLİAM VE GİLLY DEĞİL DELİRİCEM BOŞUNA MI ERİDİM BEN O KADAR BU İKİLİYİ OKURKEN YA :(UPDATE 3: NEDEN 14,5 OLDU BU KİTAP -_-zaten bir yıl fln var asdfadsf___________ben yedinci kitabı bitirmiş ve seri bitecek diye tırnaklarımı yerken kadın yeni kitap updateti yaptıkça yapıyor :D Allah 97317219723. kitabı görmeyi nasip etsin :D"}, {"Review": "\nLife didn’t have to be an endless parade of bad moments. After a storm, flowers bloomed.\nDespite been pissed these two didn't get a full novel, am glad I got something.And yes I jumped from book 11 to 14.5, yes am that weird. 😁😎This Galen's letter reminded me of the one Demitri sent to Rose when she left Russia.Third, I refuse to call you “Honey,” the name your friends are using. Babycakes, I’m not your friend, I’m your potential obsession. And, to be brutally honest about the matter, I’d rather call you Sugar Tits McGyna while having my wings ripped from my back (again) than refer to you as “Honey.” A name you like only because you hate the girl you used to be. News flash: I like the old Legion. (Leggie. Legs.)Despite the fact that I jumped two books it was still understandable given the fact it it was written as its own book, I loved that.Galen is a liar, betrayal and a jerk and he made no apologies for that, I love that the author didn't try to justify his past actions. His love and dedication to Legion is so admirable and I also got to know that he cares about someone else apart from himself.\nHe checked his reflection in the full-length mirror to search for flaws. Not a single one. The dark pin-striped suit made from the finest silk money could buy had cutouts for his wings, and the white button-up molded to his significant muscle mass. Dayum. He looked so good he had a crush on himself. His pale hair appeared wind-blown, but also perfect. Dare he mention the sparkle in his electric blues?\nLegion was still suffering from PTSD at the beginning of the book, but she got over that through Galen's help. She is now back to the sassy, tough demon she was, with a hot body."}, {"Review": "\n12/29/18 \n: First, let me start out by saying that I feel really bad about this review. Gena is an amazing author and definitely a favorite of mine, but this novella missed the mark, by far.I was skeptical about a Galen & Honey/Legion pairing to begin with (which admittedly may have clouded my judgement). We had a lot of back story on both characters, but they barely interacted together before they were instantly enamored with each other; and their first meeting didn’t really inspire “forever mate” feelings. The pairing felt very forced and rushed and didn’t make much sense. Personally, I’m not a fan of Galen’s and would have preferred he remained a villain and I liked Legion the demon much better before she became Legion/Honey/Leila.Also, something I've noticed in recent books is that all of Gena's characters (both female and male) are becoming very one-note. Sadly, I’ve noticed this across all of her series, too. In the earlier books, each character was multi-faceted and unique; now, it's like all the characters have basically adopted William's persona and, while I love him, I don't want all the characters to sound the same. We had Danika who went from scared captive to bad-ass heroine; sweet and innocent Olivia who gave up everything for what she believed was right; Haidee who was ruthlessly against all things Lord until gets to know them better and falls in love with one. Her initial heroines all had very distinct personalities, but now they kind of all mesh into the same flippant, sassy, cheeky (yes, I know those are all synonyms for the same thing and is kind of my point) one-dimensional character with a slightly different backstory. Even the men have all become irreverent jokesters; while I like that quality in a few, it certainly doesn’t suit each of their personalities. In future books, I’d like a little more attention placed on making each character unique.It seemed to me like there were a few inconsistencies with Fox’s character, but it’s been a while I will pass that off as misremembering. But where did this (view spoiler)[she’s a Gatekeeper and can open portals nonsense come from?! (hide spoiler)] She used to be a Hunter, right? I guess it’s time to re-read, lol. Oh, and how can William all of a sudden do the same?Now that I’ve complained a bunch, here are some things I liked about the story: The steamy scenes were really hot, not gonna lie- I think they were definitely an improvement over past books! I appreciated how Galen treated Legion/Honey/Leila (although, for goodness sakes- pick a name and stick to it!!!); how he helped build her up and empowered her, without letting her play the victim.All in all, unfortunately this was a disappointing story. William’s is next and I’m hoping things will turn around.\n9/27/18 \n: So, Galen and Honey/Legion... I honestly don't know how I feel about this. I figured they would always end up together, but I feel like we've had no build up whatsoever and SO MUCH left to be answered. They \"bumped\" into each other once, Galen becomes enamored and Honey/Legion is dragged to Hell and brutalized (we haven't even heard from her in several books, to my recollection). Galen was Undesirable #1 for +9 books and all of a sudden is all buddy-buddy with the Lords again? I am skeptical as to how Gena will manage to wrap all of this up in one novella, but am trying to keep an open mind.\n9/21/17 \n: Oooh, will this be Siobhan and Hades?! The title makes me think about how she's trapped in the mirror... :D"}, {"Review": "\n\"Galen the Magnificent died exactly as he'd lived: a heartbreaker.\"\nThe Darkest Captive wasn't everything I was hoping for but I enjoyed reading it. Could I have done without it? Yes and no. Yes because I didn't love it and I didn't really connect with the characters and no because it did bring something new to the table and opens up a new story arc for a specific character, plus we also get to revisit our old favorites, like William, Hades (both are mine and mine alone) and the other Lords and Ladies.\n\"There was William the Ever Randy, laughing as he sliced a man from nose to navel.\"\nI am a big fan of Gena and her one of a kind writing style, she never holds back on the violence, sex or humor and The Darkest Captive was no exception, but maybe, just maybe, it was too much in this case. I really liked the beginning of the story, getting reacquainted with both characters, Galen and Legion, but then the whole thing turned really cheesy once their relationship evolved into something more, I had to stop reading during some scenes because it was honestly cringeworthy.Galen was the big villain of this series for so long and I was expecting, I needed him to be badder, meaner. You can be in love and still be an asshole. Maybe it's just me and that's okay but I feel like he lost all his personality when he fell in love with Legion and that was a real downer for me. He was still a funny, not so humble guy but he became so...soft toward everyone else that I ended up losing my interest in him.The way Gena dealt with Legion was better. She's been through hell, literally, and at the start of the book she's hiding, alone and wants nothing to do with the outside world. Then Galen finally finds her and they have to run because bad people are after her. I liked being inside her head and seeing her deal with what happened to her in Hell. My only complaint is that since it's a novella (about 170 pages I think) things developed quite quickly and I do feel like her recovery was a little too fast.If you know anything about me, you know novellas aren't my thing because I like big books. I like when I have time to get to know the characters, connect with them in a way that feels real and believe in their love. So maybe that's also a reason why this book wasn't a big win for me, even though it's long for a novella, it's not your usual Gena's long and because of that, I did not have time to connect with Galen and Legion properly. Gena being Gena wrote this book in a way that I could not hate it, I liked the story as a whole because I got to see some of my favorite characters of hers and meet some cute new ones and also her warped sense of humor always makes my day. I did like Galen and Legion's relationship but it definitely was not my favorite. I do believe some of my favorite quotes are in this book though and I am glad I read The Darkest Captive because it gives Galen and Legion proper closure and makes me want to read the next one so bad but for this, I will have to wait a little longer.All in all, I think The Darkest Captive is a nice 'in between' book that gives you a little insight in the Lords' life, and prepares/makes you crave the next full length novel.\n\"Water sluiced over the butterflies, every ridge of strength, and into the golden happy trail that led to his massive erection. Magnificent beast.\"\n"}, {"Review": "Hi, Hello. Thanks for reading my review.Its not new news that I LOVE Gena Showalter's Lords of the Underworld. This is the newest edition to the series at 14.5 and MAN oh MAN I wasn't expecting to love this as much as I did. Because well it is Galen, but I was won over from the very beginning.This book has everything that I love in a Lords story, and I cant praise it enough.Legion and Galen are two of the most unlikely couples I thought we would be reading about, but they are so good, I loved both of them individually and together. I loved how there story was told, and I love how it was fast paced and you got the drift of things. I was confused at start because I wasn't expecting to love Galen, who we are meant to hate.I love how we see ALL the lords interact, forgive and move on.To be honest I was quite captivated with the hole story, I am up to date with the series and this one fits perfectly in the mix, I am so curious to see what happens now, I want to know more about William!Galen is different to the other lords, where they are all possessed by one demon he is possessed by two, False Hope and Jealousy. Legion is funny she finds herself again and it is wondrous, I really have always liked her as a character in this serious.I am left with so many questions for the future and I cant wait!PNR BOOK LOVER REVIEWS"}, {"Review": "I don't want to say much about this one; its part of a series in which I have only read the first book. I plan to read others someday but not now; for some reason I gave in and read this one. I have no idea what the MC's have done in previous books; the many ways they may have behaved badly. I think H may have been the villain in earlier books ...But it was a fun read; quick story, great H based on his interactions with the h; very nice, kind and heroic towards her.h is smart and demanding; once she recovers from her traumas, she is bad-ass.Worth a read ....In this genre and series, I love how very bad and wicked the H and h can be ... "}, {"Review": "I received an e-ARC in exchange for an honest review. Review and blog tour can be found on *Milky Way of Books*Ah Galen, the most horrible character of all finally gets his own book! Even since the fourth book I've been waiting for this story! And despite some tiny arguments about the characters, I admit that I enjoyed Honey/Legion and how she and Galen finally became a couple.Paire with amazing battle scenes, a fortress and the cameo appearances from the other Lords I have finally recovered from my book slump. Also, I do believe that we are going to get more books in the spin-off series about the Angels."}, {"Review": "✦Blog Tour, Review & Excerpt: THE DARKEST CAPTIVE (Lords of the Underworld Novella) by Gena Showalter https://wp.me/p3d0RZ-aXdPublication Date: December 4, 2018Genre: Paranormal RomanceReviewed by: Reading in Pajamas/ CoriRated 4.5 StarsGalen and Legion ended up being perfect for each other. I loved their story! It was sexy, fun, emotional and passionate. Galen has been the villain throughout the series, but he grew on me some in this novella and I enjoyed his interactions with the Lords. I recommend reading the series in order to fully enjoy the series storyline. I highly recommend this series for paranormal romance lovers. Gena Showalter is one of the Queens of paranormal romance and always delivers a great story.*Review copy provided by Inkslinger in exchange for an honest review.~*~*~*~Kindle $2.99 http://amzn.to/2CZOY5E ✿LORDS OF THE UNDERWORLD SERIES BY GENA SHOWALTER✿Amazon Series Link http://amzn.to/2yzQLQF ✦THE DARKEST FIRE (this is a bonus story and you don't have to read it to understand the series or the characters) ➢ Kindle http://amzn.to/2yElhGz✦THE DARKEST NIGHT - Maddox (Violence) ➢ Kindle http://amzn.to/2iX58HF ✦THE DARKEST KISS - Lucien (Death) ➢ Kindle http://amzn.to/2gVyKSC✦THE DARKEST PLEASURE - Reyes (Pain) ➢ Kindle http://amzn.to/2yzrlCC✦THE DARKEST PRISON (Novella) - Atlas and Nike (another bonus story) ➢ Kindle http://amzn.to/2xccs5b✦THE DARKEST WHISPER - Sabin (Doubt) ➢ Kindle http://amzn.to/2xW3MUY✦THE DARKEST ANGEL - Lysander and Bianka ➢ Kindle http://amzn.to/2gXVBNz✦INTO THE DARK - a compendium of The Darkest Fire and The Darkest Prison printed inside, plus the original The Darkest Facts ➢ Kindle http://amzn.to/2zseQFt✦THE DARKEST PASSION - Aeron (Wrath) ➢ Kindle http://amzn.to/2yyIGLW✦THE DARKEST LIE - Gideon (Lies) ➢ Kindle http://amzn.to/2xcwA7l✦THE DARKEST SECRET - Amun (Secrets) ➢ Kindle http://amzn.to/2gWHcRr✦THE DARKEST SURRENDER - Strider (Defeat) ➢ Kindle http://amzn.to/2gWhCw4✦THE DARKEST SEDUCTION - Paris (Promiscuity) ➢ Kindle http://amzn.to/2gWstpW✦THE DARKEST CRAVING - Kane (Disaster) ➢ Kindle http://amzn.to/2xcNl2a✦THE DARKEST TOUCH - Torin (Disease) ➢ Review 5 Stars http://wp.me/p3d0RZ-1Fm | Kindle http://amzn.to/2zqzWnO✦THE DARKEST TORMENT - Baden (Distrust) ➢ Review 5 Stars http://wp.me/p3d0RZ-759 | Kindle http://amzn.to/2lH2Mxp ✦THE DARKEST PROMISE - Cameo (Misery) ➢ Review 5 Stars http://wp.me/p3d0RZ-90y | Kindle http://amzn.to/2rymHCb✦THE DARKEST WARRIOR - Puck & Gillian ➢ Review 5 Stars https://wp.me/p3d0RZ-aMP | Kindle http://amzn.to/2BQXRz8 ✦THE DARKEST CAPTIVE (1001 Dark Nights Novella) - Galen & Legion (Releasing 12/04/18) ➢ Kindle $2.99 http://amzn.to/2CZOY5E ~*~*~*~✿GODS OF WAR SERIES BY GENA SHOWALTER✿✦SHADOW AND ICE ➢ Review 5 Stars https://wp.me/p3d0RZ-aV3 | Kindle $6.99 http://amzn.to/2oJw52g"}, {"Review": "Jess~Galen and Legion get a story!!! Oh, yes please. For those who have not followed the Lords of the Underworld story line cannot understand the excitement I am sure all of the fans felt for this story to come to pass. While the 1001 Nights books are meant to be a standalone, I real feel that knowing the backstory adds to the enjoyment of this book. Legion is a demon who spent some time in hell, literally. A place where horrible things were done to her and now she is back but not really back. Still a captive and not quite the same person she was before she was put there. Legion aka Honey aka Leila has an uphill battle to come out of her shell and once again be the bold and deadly being she once was.Galen is the keeper of Jealousy and False Hope, he was also once the enemy to the Lords and has a complicated history with them. But one taste of Legion is not enough. So through entertaining letters and then a battle only fit for Lords book, he gets her, sort of. At least until more complications weave their way in to the situation.Funny is a dark way, sexy and complex, this was a novella that I have been waiting for. I wished it had been an actual book-book because there were things that I felt were rushed. I have missed a couple of the lords books so I do have some catching up to do and this just made me more excited for them."}, {"Review": " \"Galen might have been created for war, but he lived for Leila.\"I have been waiting YEARS for Galen and Legion's story. As well as for the Mighty HADES and beloved William. I couldn't wait to sink my teeth into this novella, even though I was slightly disapointed that this wasn't a full novel. It was definitely enjoyable. This could be read as a stand-alone but reading the entire series gives you a bigger depth and appreciation to Galen and Legion's long painful journey. In previous books I had a hard time finding sympathy for Legion. She acted as a child but was a seductress of many beings..... But with The Darkest Captive, she proved me wrong. She showed me courage.... strength.... and above all... doing whatever it took to protect the people she loves. Galen was the big bad wolf in the Lords of the Underworld franchise. I expected him to be meaner... more cruel...but I felt he lost that after meeting Legion. I wish he was more of a villain. But still he made me laugh my ass off a few times. I didn't expect Legion and Galen to get together, but the oozing sexual chemistry and the genuine love between the characters made me swooon. Gena Showalter once again creates a story that was truly mesmerizing to the core! And I can't wait for the next epic adventure. "}, {"Review": "This is the first book I have read in this series and it has made me want to read the whole series because holy hell even though it was a novella it was ONE HELL OF A NOVELLA! I got to see who Galen and Legion were and the story behind them. It is a haunting and dark story but it was one hell of a story that needed to be told.Legion poor Legion she has been through hell and back and that is literal because she is in hell where she is tortured and abused. then she gets out of hell ready to start a new life but she is scared because she is not sure she can move on from what she has endured. Then she sees Galen and things start to change for her.Galen is determined to get Legion back. That one night was not enough for him. He needs her always and will stop at nothing to get her back. He is determined to make her realize that they belong together. Can Galen get Legion to see that they belong together or will Legion run away and deny herself what she feels? "}, {"Review": "Original reviewThis book was provided by the author through InkSlinger PR in exchange for an honest review. Thank you Gena Showalter and InkSlinger PR!The Darkest Captive tells the story of Galen and Legion. Galen’s been attracted to Legion for such a long time and now that she’s free, Galen hopes to make Legion fall for him.It was so nice to finally come back to the Lords of the Underworld series. I really missed this world because I only read the first three books a few years back. I only read those 3 books because back then I only read Dutch books and they only translated the first 3 books, at least the paperback editions. I was a bit scared to read The Darkest Captive because it’s often hard to read a series when you’re used to reading it in Dutch. I did, however, enjoy reading The Darkest Captive in English and I’m looking forward to reading all the other books in English!Now back to The Darkest Captive. I only read the first 3 books, so I don’t know every character of everything that happened, and that wasn’t a problem at all. Like mentioned in the synopsis, every 1001 Dark Nights novella is meant to be a standalone but it’s also a bonus for those who read the other books. I really liked this novella because it was so short, but also so fast paced. The story was amazing and I couldn’t get enough of Galen!Galen and Legion are amazing characters. It’s not always easy to see character development in novellas because they’re meant to be short. Sometimes novellas can be really predictive or just not well written because they have to be short. The Darkest Captive was such a good novella, Galen and Legion are so funny and I just love them!Lords of the Underworld is such an amazing Paranormal Romance series and I love that every book focuses on a different lord and his mate, and I think that this series is so original. I love Gena Showalter’s books and I cannot wait to read the other books in the Lords of the Underworld series! "}, {"Review": "Reviewed for Romancing the Readers Blog: https://romancingthereaders.blogspot....From the first sentence I was hooked on this book. I just wanted, no, needed to know more. Because this is a novella it really needed to suck me in from almost page one to keep me going and it did just that. I've been reading and enjoying Gena Showalter's Lords of the Underworld series for a long while now. I really enjoy her characters and want to know what's going on in their lives. They always make me tear up a little then smile. Complicated people! Like I mentioned The Darkest Captive is a novella. It packs a ton in it's short page count. I wasn't sure how happy I was that they are only getting a novella. I felt at first that they needed a full size story to go along with all we've seen them suffer or cause others to suffer. These two a very complex characters that I didn't think would be able to fit in only 125 pages. But it worked. These two show how you really need to read series in order to fully understand or appreciate characters. Doesn't mean you won't like this book but I think if you read the whole series you'll not just like it, you'll love it. I wasn't ever sure that Galen had a heart or could really care about someone else. All I can say is sigh! Totally enjoyed this one and so happy I read it. It's fast paced and just plain fun to read. I'd love to tell you more but feel you really need to read it for yourself and learn everything first hand. This is a much for fans of her Lords of the Underworld series and for those who enjoy paranormal you really need to try this series. Follow me on:https://www.facebook.com/RomancingThe...https://twitter.com/Romancingreader"}, {"Review": "This book should have been a full lenght novel.But even then i don't know if it could have been any better.Of course, everything is convulted, confusing and rushed to ridiculous extremes. Legion gets over her trauma in like a pair of pages, Galen acts like a twelve years old, lovestruck fool during the entire novella, the whole plot is messed up with the Cronus-clones bullshit and there are also new characters that speak like everyone elses does, like this series need new lore besides everything else that's already happening.Meh. I read this so i could give Legion a closure and i did. I'm now officially over with this series. I couldn't care less about Fox ad the angel what'shisface, especially since they are only getting a novella as well.  Sorry about the spelling mistakes."}, {"Review": "I received this book for free from Tour Group in exchange for an honest review. This does not affect my opinion of the book or the content of my review.The Darkest Captive is book 14.5 in the Lords of the Underworld series by Gena Showalter. We are brought this tale from the 1001 Darkest Nights collection.Galen has been in and out throughout the series. He's done a lot of bad things. His character is extremely, over the top self-centered, which I loved. He was so funny when referring to himself. His letters to Legion before she was rescued were hilarious. I loved his approach to winning her heart. The Darkest Captive really made me fall in love with Galen!Legion has been through so much. I still see her childlike in a way despite the horrible things that have happened to her. Galen is determined to bring back that joyous, outgoing Legion. He wants to banish her nightmares and fear. Galen is determined to kill everything and everyone who has made her suffer. Even if it means drawing demon heads on letters!The road to our HEA with Galen and Legion had many pieces that needed to fit together. The two made me laugh in more than one situation and that is what I expect from this series. The personalities and attitudes of all of the characters never fail to make me smile. Legion had objectives beyond just getting revenge. She was determined to bring Galen back into the fold and reunited with his daughter. She had great intentions. Everything that did come together for her had me closing the book with a smile and even more holiday cheer. (This isn't a holiday book, but it gave me the spirit!)The Darkest Captive was a really fun read. Even with all the personal stuff the characters go through, we still get a good dose of action that is essential to a LoTU book. All the makings of a favorite! Let me share an excerpt! Excerpt \nShocked to the bone, Legion performed a slow-mo 360. Galen’s kitchen had been transformed into an Arabian Nights paradise. Flickering candles filled the entire room. Multi-colored scarves cascaded from the ceiling, intermixing with strings of beads. A coffee table had replaced the kitchen table, jewel-toned pillows acting as chairs. Covered platters dominated the table’s surface, a gem-encrusted genie lamp the centerpiece.Your wish is my command…The scent of corn dogs, chili cheese fries, and cotton candy saturated the air, and her mouth watered.As Galen stepped past a sheer purple curtain, electric pulses awakened every nerve in her body. He looked her over. “You are stunning, Leila.”His husky timbre sent shivers rushing down her spine. And when he looked her over a second time, taking in the frilly dress with a cinched-in waist and mid-thigh tulle skirt paired with ballet flats, his irises heated—and so did her blood.Galen wore a dark, perfectly tailored suit, the polished veneer only enhancing the savagery of his soul. Awareness of him eclipsed her fears, and it was nice. Better than nice. Wonderful! For a moment, she felt like the old Legion again.“I’m guessing I am stunning, too?” he prompted.Did she detect a thrum of uncertainty? How adorable. The saucy, ultra-confident Galen cared about her opinion. Meaning she had power over him. How delicious.“You are,” she admitted. “I think you’ve hijacked my thoughts.” And she was glad for it. Once, she’d made a deal with the devil because she’d dreamed of falling in love, being loved in return, and discovering why humans were so obsessed with getting naked and rolling around in bed. Here, now, she realized a part of her still yearned for those things, despite everything that had happened. Fear had put her life on pause long enough. She deserved pleasure.If she wanted better, she had to fight for it. Had she picked the right man for the job, though? Someone who would be patient with her, who would ease her back to life, and give as much as he took?Time would reveal the truth, one way or another, but her hopes were high. Galen was strong. He would cross any line to get what he wanted, and for some reason, what he wanted most was a chance to keep her safe.Unless he decided to bed her, even if she said no. \n \n\n\n\n\nThis review was originally posted on Rantings of a Reading Addict\n"}], "Genre": "Fantasy", "ID": "37534683", "Desc": ""}