{"Genre": "Fantasy", "ID": "45978", "Name": "Eldest", "Reviews": [{"Review": "Honestly, this book fueled 90% of my \ndragon-obsession \nover middle school. (How obsessed you ask? Tshirts, posters, movies, figurines - if you could slap a dragon on it, I bought it (really not kidding)). This series will always hold a special place in my heart.  \n Eragon, having survived the great battle, is saddled with a completely unexpected consequence - the Shade's Curse.  He and Saphira are sent to the hidden lands of the elves, Ellesmera, to learn the secrets of the Dragon Riders.  But his training is not easy - the magic is challenging and literally one wrong move could trigger the Shade's curse. \nAt that instant, Eragon's back ruptured in an explosion of agony so intense he experienced it with all five senses...and above all the feeling that Durza had just laid open his back.\nMeanwhile, Rowan (Eragon's coursin) is dealing with a horrible situation of his own. The Ra'zac have returned to their hometown, Caraval, to terrorize the locals in the hopes of luring Eragon back. Eragon remains completely unaware as he trains in Ellesmera - leaving Rowan to find a way to save the entire town and track down Katrina (the love of his life) who was stolen by the Ra'zac.As much as I try to be objective about these novels - I can't. They're so entwined with my past that I simply can't rate them anything below 5 stars.Dragons were my middle school \"thing\" - I drew them, I wrote about them and I read about them constantly. Unsurprisingly, this series spoke to me and it still does.Every time I reread this series, I find something new to adore - whether it be a new appreciation of Rowan's strength of character or amusement regarding Angela the witch's quirkiness: \nI suppose I won’t see you for a while, so farewell, best of luck, avoid roasted cabbage, don’t eat earwax, and look on the bright side of life!  Loved this one the first time through and every time I read it, I love it even more. Audiobook CommentsSomeone give this poor narrator a throat lozenge because, my god, the voices Gerard Doyle used for the dragons must've caused permanent damage. (it sounded like a congested yoda)Blog | Instagram | Twitter"}, {"Review": "\"Is it better than Eragon??\"Lots of people have asked me if I liked Eldest better or thought it was a better book. Yes and no. The writing was more coherent and sounded less inexperienced, and some of the perspective changes made it easier to read. But if a writer doesn't get better on his second book or as he gets older, he's kind of a jerk, eh? But Chris was quite a bit more aware this time that he had an audience, that his book's arrival was being anticipated with bitten nails, whining, and drool. He therefore did even more of that language dress-up and song-and-dance, more of that irritating demonstration of his belief that the words themselves should be the art rather than the art being the story they describe.Paolini appears to be convinced that talking in pseudo-archaic language is grand and epic rather than HOKEY AS HELL. In talking about the novel's inconsistency with place names: Chris claims that all of Alagaësia's different areas are sorta mix-n-match because all the places were settled by different races. Umm . . . in real life, usually if that is the case then each race or culture has a name for each area, and depending on which language the map is in, you will see different names. \"While this is of great historical interest,\" he writes, \"practically it often leads to confusion as to the correct pronunciation. Unfortunately, there are no set rules for the neophyte. The enthusiast is encouraged to study the source languages in order to master their true intricacies.\" The source languages? The ones that are in your head?? No one is convinced by this ramble that there is actually an alternate world where these languages are spoken. Odd how instead of doing his homework, Paolini makes up an excuse for why homework is not necessary in this instance.And then he says this: \"One more volume to go and we shall reach the end of this tale. One more manuscript of heartache, ecstasy, and perseverance. . . . One more codex of dreams.\" I'm going to die. Codex of dreams?? \"Stay with me, if it please you, and let us see where this winding path will carry us, both in this world and in Alagaësia.\"I'll tell you where it's going to lead us. Read The Hero's Journey, go watch Star Wars, study some Lord of the Rings and some obscure mythology, steal some words from ancient languages and pretend they're magic words, and read Story by Robert McKee and The Writer's Handbook, and then write a book ganking one or two aspects from all the other high fantasy you've read and liked. That's the formula. It should work for you too.Instead of saying Murtagh and the Twins are \"dead,\" the narration \"sneakily\" refers to them as \"gone.\" That way, after the characters have lamented their kidnapping and apparent death, Paolini can rejoice in the fact that he tricked us into thinking they were dead, but then point and laugh when they reappear on the battlefield and say \"HA, see I never SAID they were dead!\" We know you didn't. As soon as they found no bodies, we knew they were coming back. This was not a surprise.Saphira's magic powers. It's been said throughout the books so far that magic comes from dragons and whatnot, but that Saphira and other dragons don't really use it the same as elves and humans do. It's pointed out several times that the \"rules\" for dragons performing magic are not set--I suppose that's so that whatever Saphira wants to do, she can do, period. Also, Saphira was the one who broke the Star Rose and pissed everyone off. But if she heals it, she'll be honored for \"uncounted generations.\" Does this bother anyone else? I would think that the dwarves would pretty much reluctantly agree to tolerate her presence if she undid the damage she did and maybe kissed up to them for a few thousand years. I somehow doubt that she'd suddenly be a hero just because she's willing to clean up her own mess.I think my BIGGEST problem is with the incoherent magic system. A lot of people have either said this book is NOT predictable--which tells me they probably have never read another high fantasy book--or they make up a bunch of excuses why it's okay to be predictable because this is a basic story type. Sure, by all means, excuse it for all its faults because it is a hero \"type\" story. Which of course means that he should do the same things in the same order as every hero of myth and fantasy from Odysseus to Luke Skywalker.A book should not be so based on a story \"type\" that it feels like it is following a template; every \"revelation\" in this book is more of a confirmation of a suspicion than an actual surprise. BAD WRITING: NARRATION- \"For gray-eyed Destiny now weaves apace, the first resounding note of war echoes across the land.\" Or you could try to be a little more vague, please. And I think this needs to sound a little more like bad teenage poetry. No, really. Is there anything to be understood from calling Destiny \"gray-eyed\"? Do these words actually mean anything? If not, then why were they chosen?- First line: \"The songs of the dead are the lamentations of the living.\" Eragon's walking along through a battlefield thinking this. Unless I really don't understand something, this sentence is an attempt to write romantically but actually does not say anything. - Eragon's tear was described as \"A small, glistening dome.\" I think I have discovered something. Christopher Paolini has never actually seen a tear before. And the trend continues in this book for there to be a single tear. Doesn't anyone actually cry, with buckets of tears and snot pouring out of their noses? I wanna see boogers and red eyes and wet cheeks and actual SORROW. Not a single tear. That's nothing but a mockery of sadness.  - Completely ridiculous simile: \"Slippers flashing beneath her dress, like mice darting from a hole.\" First of all, why would you compare someone's feet to MICE? - \"The dawnless morning. . . . \" Should I even say? Yes, I should. HOW IS IT MORNING IF THERE WAS NO DAWN? Why does he think this sounds cool? He is so obsessed with making things sound cool that he doesn't even think to himself, \"Wait, this makes no sense. How is it a 'dawnless' morning?\" - \"He closed his eyes and sank into the warm dusk that separates consciousness and sleep, where reality bends and sways to the winds of thought, and where creativity blossoms in its freedom from boundaries and all things are possible.\" I don't know. Don't you just want to, I don't know . . . DIE right now?- Can you visualize this scene? \"Katrina screamed again and jumped on the men, biting and clawing furiously. Her sharp nails furrowed their faces, drawing streams of blood that blinded the cursing soldiers.\" I cannot see this. At all. One woman--who might be somewhat tough but is not superhuman--is somehow biting and clawing . . . several men at once . . . to the point that they are all blinded by the blood that runs from the scratches she has caused. Oh, and they respond by standing there cursing, not, say, immobilizing her. I don't mean to be sexist, but surely it would take no more than two men to subdue a woman who is fighting with her frickin' fingernails. CP, the idea is to try to actually visualize this happening, and then THROW OUT SCENES THAT ARE STUPID.- \"Bright as a flaming sun.\" Call me weird, but are there any suns that aren't, oh, in flames? Could we have some similes here that don't forget that they are for description above and beyond sounding cool?- \"Hair as black as a forgotten pool.\" Being forgotten does not make water black. I bet there's tons of pools around that have been forgotten and nevertheless are not black. What exactly does this simile mean?- \"Silent as the night.\" Ever been in the night, Chris? It's pretty quiet in your room with your earplugs in, I guess. This is silly. I won't even go on with this one.- As the book winds up to make its climax, there are all kinds of REALLY dramatic sentences that are so silly they just make me cringe. \"Shall we dance, friend of my heart?\" \"That is the sound of our destiny.\" There is a time and a place for drama. But asking \"shall we dance?\" upon going into battle is one of the goofiest things I've heard in my life. This makes me wonder whether CP watches the movies that would be shown on MST3K and thinks the dialogue is smooth.The parts that he's making \"colorful\" with zesty little words like \"proclaimed\" and \"apologized\" and \"expectorated\" are not the parts of the story that NEED to be colorful. They are middle school English attempts to make writing varied. What needs to be colorful is the storytelling, the descriptions, the dialogue. Not the permutations of \"said.\" It's misplaced. That's why editors and publishers look at that as the hallmark of the amateur writer. Because it indicates a basic misunderstanding of the whole point of language. His problem is that he concentrates so much on making his prose elegant that he doesn't understand that prose's job is to be elegant enough to be invisible.A quote from Paolini: \"In my writing, I strive for a lyrical beauty somewhere between Tolkien at his best and Seamus Heaney’s translation of Beowulf.\"Well . . . I suppose we can give him an A for effort. We definitely see the trying.- And last but not least: The overused, horrific \"you should be hit on the head by a troupe of 100 literature professors if you do this\" literary device: HAVING THE VILLAIN EXPLAIN EVERYTHING IN THE END. And the fact that it was written in such a way that the author obviously thought having these characters charge in as the main villains of the story when everyone thought they were dead just adds insult to injury. This sort of writing just insults my intelligence. If you didn't see this coming or thought it was a revelation, please go find that aforementioned troupe of literature professors and let them hit you for a while. I'll join in."}, {"Review": "I hate Eragon, but I was intrigued to see if Paolini has improved, so I borrowed this book and attempted to read it.I hate Eragon. I hate Eldest even more.If Eragon is bad, it at least had a semblance of a traditional plot - the introduction, the buildup, the climax, and the teaser for the next chapter of the journey. Eldest started off with a flat summary, then it went straight into a continuation from the previous story, and around 600 pages of exposition full of step-by-step miniscule details that have no bearing towards the plot at all, before finally going to a faux-climax again. The faux-climax battle of dragons comes out of the blue, as there was a sadly sparse attempt of interweaving it with the bulk of the book. I rather thought the 600 page could be edited out to just 10 pages, and it might've made the book a bit better and much more bearable for the readers. So how did I bear reading the book? I didn't. I skimmed through the book, saving myself from the complete painful experience, yet still scarred enough to warn other people against reading it. The 600 page in short: emo angsting, super!protagonist transformation, excessive hero worship, and fumbly teenage crushing. God only knows what Paolini's last chapter will be like. All I know is that if this is what people call good writing, I, like many others, fear for humanity.NOTE: If you're an Eragon fangirl huffing and puffing about my review being mean, save your energy. I'll just ignore and delete your comment. Why? Because I can. This is my review of the said book and it won't change just because you're twisting your knickers over it. If you don't like it, move along, find a review you like, hug each other and sing kumbaya together over a Saphira spit roast. "}, {"Review": "Do Elves have pubic hair? Are Orc marriages performed with ceremonies? What is the life cycle of the giant birds the Nazgul ride? If questions like these have haunted you ever since you delved into the world of fantasy, look no further for your answers!Eldest continues the saga started in Eragon by sending our plucky hero into the land of the Elves in order to complete his training as a Rider. There, we learn absolutely everything you (n)ever wanted to know about the Elves (think of it as though the Lord of the Rings treated the different races not as allegories, but as Star Trek races, with their own anthropologies). Alas, all the training is worthless in changing Eragon. They then must ask the hot, female, identical twin Elves to stand naked back to back and jiggle so as to make the dragon tattoo running over their bodies release the \"spirit of the dragon\". This, it seems, triggers the desired transformation (Freudian minds, insert your own joke here).Meanwhile, back on the farm, Eragon's cousin Roran comes into his own by mowing down opposition to lead his people to freedom (he even counts them as he goes along, i.e. \"And now I've killed five men\"). His story aligns with Eragon's just in time for him to destroy in one page of action a threat bloated out to be important in the previous 500. I can't wait for book three; do you think we'll find out the literacy rates for Dwarf children?"}, {"Review": "\n“The world is stretched thin, Eragon. Soon it will snap and madness will burst forth. What you feel is what we dragons feel and what the elves feel—the inexorable march of grim fate as the end of our age approaches. Weep for those who will die in the chaos that shall consume Alagaësia. And hope that we may win a brighter future by the strength of your sword and shield and my fangs and talons.”\n Well that was some ride! Amazing! First off thanks to my BR partners, Her Purpleness and Her Pinkyness, who not only kept me company but also greeted and treated me with such amazing warmth! I felt so welcomed. Thank you, ladies!!I don’t think I can review this book effectively. Mostly bcz I read it on the go and in small bits and pieces. The impact was somewhat lost on me (thanks to RL shit)! I’ll still try. When I last read this series in 2013, I wasn't reading. Not really. I was burying myself in anything that could save me from what afflicted me at that point of time. This series saved me by not just keeping me sane when I probably would have lost myself, it also became close to my heart for some reason, a reason that I lost with time and as I healed. When I set out to re-read this series, I wanted more than anything to find that reason, that connection, which made this series special for me, not to mention that it made me a reader. \n“Things that change and are lost, that is what’s worth preserving.”\n I found that reason in this book. It is a deep bond that I share with Eragon. Something that has been captured well by Paolini. That Eragon went through it and still stood strong, it gave me hope and will to keep fighting and pushing when I needed it the most. It may sound childish, drawing strength or inspiration from this series or this character but that’s the truth. I will forever cherish this series for some very deeply personal reasons. Eragon will always be a brother, Saphira the greatest friend, Arya my love, Murtagh will be the embodiment of all my betrayals and Galbatorix will be the ultimate foe!Given that I am super biased towards this series, I’ll keep this review short and as impartial as possible. Here goes:After the battle of Farthen Dur is done and dusted, scarred as he is, Eragon wakes up to all the devastation around, and yet, he along with Varden must suffer another blow! The setback that charges up the political maneuvering, one where we see Eragon and Saphira grow a touch through their decision making. The battle that has ended brought but a small taste of what is to come and the inevitable war that looms. And if he hopes to survive the war, he must be instructed in the ways of the Dragon Riders. Eragon and Saphira must travel to the land of the Elves, Ellesmera, for there is much they need to know and understand but not enough time. While Eragon deals with his troubles, Roran has his own share and along with all of Carvahall, they must deal with their problems to make a stand or be obliterated at the hands of the Ra’zac or worse, sold into slavery. And that cannot stand. So they must abandon all they own and know, their homes and lands, and make hard decisions, to fight and even kill! \n“Roran had never expected or wanted to kill, and yet he had taken more lives than anyone else in Carvahall. It felt as if his brow was marked with blood.”\n Tbh, there isn’t much ‘keeps-you-on-the-edge-of-your-seat’ stuff happening in this book except for the battle sequence towards the end. This book is mostly character central. There are so many characters that come up so strongly in the book.Nasuada, who takes over the Varden and she is a great character that you wanna root for. She is strong and has potential. And yet, not unkind.Roran, who goes through hell to come out a changed and hard man, one who would do anything to achieve his goals. Arya, who is still much of a mystery, her character is very nicely done, I love her strength and resolve.But the highlight has to be Eragon and Saphira! They both grow and learn so much more and they come even closer, if that’s possible. I love their interactions, their elating and their despairing moments. They have such range from squabbles like siblings to jealously like lovers and advice and concern like parents. I really, really love how Saphira refers to Eragon as ‘little one’ in places and thus adding extra charm! Their bond and interactions are not to be missed. \n“Shall we dance, friend of my heart? We shall, little one.”\n  The final battle sequence is somewhat short, I felt. And could have been more intense than it was but that’s a minor complaint. The writing overall is pretty great and so is the storyline. The twist at the end of the book is a nice one too! I knew it since I am re-reading but otherwise it’s pretty awesomely done and it is also nice to see Eragon being put down. \n“Eragon closed his eyes, tears leaking from under the lids. They had won, but he had lost.”\n It’s a great book in its own right! Even if it draws on Tolkien, which I still don’t see or feel btw, it lacks nowhere! It holds its own just fine! Making comparisons as desperate as Eragon = Aragorn or Arya = Arwen is kinda off putting to me. In my opinion, Paolini did a great job of writing and creating The Inheritance Cycle and comparing him to Tolkien is an insult to both authors.I can say that I loved the book thoroughly! The pacing of the book is fab and it keeps you hooked. Not much happens in the book except for a lot of buildup and some major character building and yet, so much happens! This book serves as a proper launch pad for the next book, which I trust to be a cracker bcz more battles and skirmishes are on the way for the swords are drawn and the armies march. Allies have been called upon and some unexpected support has been found. Now everyone must declare themselves and must fight to be rid of tyranny!\n“Is it time to fight, Eragon? asked Saphira, an odd note of formality in her voice. He knew what she meant: Was it time to challenge the Empire head-on, time to kill and rampage to the limit of their considerable abilities, time to unleash every ounce of their rage until Galbatorix lay dead before them? Was it time to commit themselves to a campaign that could take decades to resolve? It is time. said Eragon”\n I will be back soon, Eragon & Saphira! Until then, fair winds!"}, {"Review": "And the adventure continueeees!!!Now let me tell you (gosh, I feel like a mother or father here about to teach their children :)): if you are an YA lover or a high fantasy lover you will like this one a lot. I know there's been a lot of talk regarding what should or shouldn't be included in the YA genre, but I think this fits there. Granted, in my opinion, this genre is made of two classes: the old YA and the new YA. And even if some may get upset, the old YA is much much much better than this new stuff, that seems to believe the only way to make a story good is through lovey-dovey stuff...Eldest doesn't have a lot of romance and it does not need it. And that is because the writing is excellent! The story is excellent! And Paolini brings his characters to full development. That is a lot to be accomplished in one book and it is also the reason why Eldest is my favorite entry in the series.I so wish a movie studios would decide to adapt this series, but with care this time. It would end a fantasy classic if done right, because it is much to be liked here!As a particular note, I really love the magic system here. The politics are also very interesting, without it turning into another Game of Thrones. And the culture and language of the different races is nicely explored. It isn't Tolkien level of commitment, but then again, no author came even close to that. I really hope people decide to give more attention to this series! They wouldn't be disappointed."}, {"Review": "Ok thank you for continuing on from my Eragon review. Now remember step one from the last review yea ok we'll call it Step 5: Go to the store and buy Eldest...Ok now follow these steps. Step 6: I hope you've learned from your previous mistakes and set nonperishable snack foods withing reach as to keep reading while eating. Now get an empty 2 littter bottle don't worry..you'll figure it out. Finally get a drink that is pretty good a room temperature or if you just really like cold drinks be sure to get a cooler and a bag of ice. Make sure you've got a bottle of No-Doze handy Step 7: Now call all of your friends and family and tell them that you will not be answering your phone for at least the next 20 hours or so. Step 8: Turn phone off and or yank from wall and place a note on your door saying that your are ill and very contagious not to disturb unless world is coming to and end ...and even then you might want to consider waiting another day. Step 9: Turn on the light above your head even if it is daylight outside trust me that could become a pesky motion when you have to get up to do it later. You'll probably be right at the part where Eragon discovers...oh sorry bout gave it away there. Step 10: find the most comfortable place where all of the essentials can be within arms reach and bring a blanket incase you get cold, matter of fact turn the air on and get the blanket cause you don't want to be to hot...this book is intense. Step 11: Begin reading book.....wait for it....now. Step 12: OH MY GOD I KNOW!!!!!! Now you have to wait for the 3rd book just like the rest of us lol. Review to be continued aout 24 hours after the release of 3rd book."}, {"Review": "Eldest (The Inheritance Cycle #2), Christopher Paolini Eldest is the second novel in the Inheritance Cycle by Christopher Paolini and the sequel to Eragon. Eldest was first published in hardcover on August 23, 2005, and was released in paperback in September 2006. Eldest begins following several important events in Eragon. The story is the continued adventures of Eragon and his dragon Saphira, centering on their journey to the realm of the Elves in order to further Eragon's training as a Dragon Rider. Other plots in the story focus on Roran, Eragon's cousin, who leads the inhabitants of Carvahall to Surda to join the Varden, and Nasuada as she takes on her father's role as leader of the Varden. Eldest ends at the Battle of the Burning Plains, where Eragon faces a new Dragon Rider, Murtagh, and a new dragon, Thorn. ...تاریخ نخستین خوانش: سال 2008 میلادیعنوان: الدست: نویسنده: کریستوفر پائولینی؛ مترجم: مهناز ولی؛ تهران، زهره، 1386؛ در دو جلد؛ شابک: دوره: 9789642981007؛عنوان: الدست: نویسنده: کریستوفر پائولینی؛ مترجم: محمد نورالهی؛ تهران، بهنام لیوسا، 1386؛ در دو جلد؛ شابک: دوره: 9789645668407؛از سه گانه میراث + یکدومین کتاب از مجموعه ی چهارگانه ی وراثت، از سری رمان فانتزی، و حماسی وراثت، بنوشته ی «کریستوفر پائولینی» است، که نخستین بار، در سال 2005 (میلادی) به چاپ رسید. اراگون اکنون باید سفر خویش را، از فاردن دور و شهر ترونجهیم (پایتخت کوتوله ها)، به سوی الزمیرا (پایتخت اِلف ها)آغاز کند. او با فهمیدن رازی بزرگ، که حتی بیشتر «الف»ها نیز نمیدانند، آموزشهایش را ادامه میدهد و.... ا. شربیانی"}, {"Review": "4.5 stars!Truly, I have nothing bad to say about this book. I liked every moment, was engaged, kept finding myself excited about the story. It did many fantasy elements well. I enjoyed the training portions, the shocking revelations, the magic system, seeing young love through a male protagonist's POV, and the fact that injury and disability in heroes during wartime was something that was represented. And DRAGONS. The dragon/rider relationship is my favorite part of this series.Even though I enjoyed everything about this book, there's something holding me back from 5 stars. I still can't say this is a favorite series, but after being unimpressed with book 1, I was delighted to enjoy this one so much and am eager to continue the series!"}, {"Review": "To say that Paolini's follow-up to Eragon is a disappointment is something like saying that George Lucas' Howard the Duck isn't quite as spectacular a film as Star Wars. It took me NINE MONTHS to force my way through this drivel-saturated sequel, and turning each page required an act of will.WARNING: Spoilers below.If Eragon is Tolkien fanfiction, Eldest reads like the world's longest Mary Sue story. In between soapboxing about religion and veganism, Eragon proves that you CAN have a character who is whinier and more obnoxious than Anakin Skywalker in Episode II (to continue the Star Wars metaphor). He spends much of the book moping about his injured back and his unrequited love (a relationship which I find completely baseless and implausible) until, presto, deus ex dragon! -- the whiny brat is MAGICALLY transformed into a perfect and incredibly handsome specimen of Rider, whisking away not only his scars and physical infirmities, but also any sympathy the reader may have felt for him.The big twist ending of the book is hardly a surprise (honestly, I pegged Murtagh's true identity within a few pages of his character's introduction in Eragon -- was there anyone who DIDN'T see this coming?). By the end of the final battle, I was rooting for a real twist: That someone would put Eragon out of his misery and elevate some other, more interesting character to the title role.After reading Eldest, I don't know if I'll bother with the third book in the series. I'm usually a completist where trilogies are concerned, but this may be the exception."}, {"Review": "“Live in the present, remember the past, and fear not the future, for it doesn't exist and never shall. There is only now.”Eldest was overall better than Eragon. Especially because most of this book took place in Du Weldenvarden, the place where the Elves live and where Eragon receives his training. Here, I didn't have to worry about impending doom, death and traitors at every corner.The annoying part, however, was Roran's chapters. Honestly, who cares about Eragon 2.0 minus dragon and superpowers? Not me.Reading this roughly a decade (bloody hell, I'm old) after I first picked up these books, shows me how far I've come and how much I've learnt when it comes to my views on literature. I was definitely easier to impress when I was in my early teens - I guess we all were. Nevertheless, the writing and mostly the talks about pride, honour and noble-mindedness made me roll my eyes a lot. The way these notions are expressed in the book seems juvenile and exaggerated. Everything in this book has a touch of melodrama, hence plot and characters lose their authenticity.Anyway, I'm looking forward to reading Brisingr. Or rather, to rereading it. Since I'm not able to recall a single thing that happened after book 2, this will probably (hopefully) hold the one or other surprise for me.Find more of my books on Instagram"}, {"Review": "I was very pleasantly surprised - Eldest laughs in the face of the so-called sophomore-slump curse.While I liked Eragon enough to give it five stars despite the weird feeling that it was a mediation between Lord of the Rings and Harry Potter, it was kind of slim in several places, character- and plot-wise. Not so in Eldest. Finally, some real meat to the relationships between characters, the government of Alagaesia, and the drive toward battle. My empathy was tested every time I was irritated over Eragon's infatuation with Arya, and I whispered along every time someone cast a spell in the ancient language. Finally getting to see Ellesmera, the land of the elves, I sympathized with Eragon as he found his niche there and then felt torn when it came time for him to leave.I can't wait for book 3."}, {"Review": "This second installment in the Inheritance Cycle was extremely surprising for me. I find it hard to be surprised by most book endings, and this one had a twist that I was not looking for, so when it jumped out at me, I was almost knocked out of my chair with shock. This book goes much deeper into the world of Alagaesia, its myths and history, and the characters become much more complex. I felt for Eragon as his attempts at romance are spurned, and watched carefully as his bond with Saphira deepened. The arrival of the new dragon and his master was not completely unexpected, but up-ed the tension in the book to a necessary degree. Eragon must once again leave the safety he thought he had found behind and lead a rebellion to freedom. I was surprised, but happy to find that this was not a quaint little fight, and that this world was real, one where the bad guys don't play fair, and they go after the people Eragon most wants to protect in order to get to him. The book is chalk full of emotion and disappointed hopes. It makes for a great sequel and leaves you straining on your tip-toes for the next book in the series."}, {"Review": "Eldest, the second book in the inheritance trilogy by Christopher Paolini is disappointing largely because it's a long book in which very little happens. The narrative through most of the book switches back and forth between Eragon and Roran. Eragon is traveling across Alagaesia and eventually begins training as a dragon rider. As a result we get long swaths of exposition explaining every detail of Alagaesia and the philosophy of dragon riders. It's common in fat fantasies like the inheritance trilogy for the minute details of a meticulously constructed world to take center stage. As long as these details are balanced with a well paced plot, this is perfectly reasonable for the genre. The problem is that the only interesting plot developments in Eragon's story happen at the very beginning and the very end. Roran spends most of the book trying to save the people of Carvahall who have drawn the attention and the wrath of the empire. This thread provides all of the narrative tension through most of the novel. I found myself looking forward to the Roran chapters and dreading the Eragon chapters.Paolini is essentially rewriting Star Wars in a Lord of the Rings setting. You can say all you want about Joseph Campbell and the universality of myth, but it sure seems like Paolini rewatched The Empire Strikes Back whenever he had writer's block. Still, Eldest does have moments of brilliant originality. Particularly memorable is the character Elva to whom Eragon offers a blessing intended to make her shielded from misfortune. A mistake from the young magic user turns the blessing into a curse and Elva becomes a shield for misfortune instead. Elva absorbs the pain and suffering of others causing her to age prematurely. The character is creepy and disturbing. She also presents Eragon with his most interesting moral conundrum as he is responsible for her state. While we expect Eragon to kill Galbatorix in the end, it's unclear to me how the storyline with Elva will wrap up. I have a feeling that it will be an unrealistically happy ending, but maybe I'll be surprised."}, {"Review": "Alright. Eragon was a great book. I mean GREAT. There was suspense, action, and a possible romance.But this book just completely screwed everything up with the boring dialogue and the action less pages.Yes, this is a very unpopular opinion, so no hate, ok?? :)So as a person who was obsessed with this series at the time, I fortunately finished the book. Unfortunately, what exactly was this book about??1.Eragon was a hopeless, romantic ditz that kept running after Arya. Like, dude, nobody wants to read hundreds of pages of you getting head over heels over a girl who has told you multiple times that she isn't interested.2.NOTHING happened. Was it just me or did this book feel like a waste of time and energy??! Besides spending his time thinking about Arya's face, what more is there??!Hmmm, go figure!But would I reread this though??Yes, because there were good parts in this book that are worth talking over. So, all in all, if I get through my tbr pile, maybe I will try this again. :)"}, {"Review": "Και ολοκληρώνοντας αυτό το βιβλίο έφτασα στα μισά της διαδρομής, 2 βιβλία τέλος, μένουν άλλα δύο.Και τι διαδρομή, γονατιστός πάω, λες και πάω προσκύνημα στην Παναγιά της Τήνου. Πολλή ανηφόρα. . . Τέλειωσα έτσι το πρώτο μισό, το γνωστό, τώρα μένει το άλλο μισό, το άγνωστο, το αχαρτογράφητο.Νταξ, το τρίτο βιβλίο το διάβασα, αλλά όταν κυκλοφορούσαν δεινόσαυροι στη γη και έτσι δε θυμάμαι τίποτα, μόνο ότι κάποιος σημαντικός χαρακτήρας πάει στα θυμαράκια ή όπου αλλού πάνε ξωτικά/νάνοι κλπ.Το 4ο ούτε καν το άγγιξα. Γι' αυτό άλλωστε τα πήρα όλα απ' την αρχή λες και θα δώσω πανελλήνιες.Υπάρχει βελτίωση στη γραφή, στην ιστορία. . .Ο δε Έραγκον θέλει τα χαστούκια του. Ερωτεύεται μια ξωτικιά εκατόν τόσο χρονών, θέλει να δείξει ότι ντε και καλά είναι άντρας με τα όλα του, μπρατσαράς, προικισμένος, γκόμενος, και μ' ένα δράκο να. . .Εν τω μεταξύ ένας ρόκολος (νιάνιαρο στην κυπριακήν) είναι, 16 κάτι χρονών και ακούγεται λες και είναι τριαντάρης. Το κομμάτι της εκπαίδευσης του στην χώρα των ξωτικών με τον Γιόντα.... εε.... τον Όρομις, ένα ξωτικό ερημίτη που είναι χορτοφάγος και άθεος - ίσως και βουδιστής.Ήταν ένα κομμάτι που βαρέθηκα. Ήθελα να κουτουλάω το κεφάλι μου στον τοίχο, αλλά φρεσκοβαμμένοι είναι, κρίμα δεν είναι;Μετά την εκπαίδευση των 400 τόσων σελίδων η ανηφόρα έγινε κατηφόρα και διαβάστηκε γρήγορα απολαυστικά και ωραία.Και αυτό το βιβλίο τελειώνει με γκρεμοκρεμάστρα... το cliffhanger κάλε, και τώρα θα περιμένω να δω τη συνέχεια της ιστορίας, τέλη Μαρτίου όταν θα ετοιμαζόμαστε να σουβλίσουμε το αρνί.Έτσι μ' αυτή την κατάληξη η αναγνωστική απόλαυση αυξήθηκε, όπως και ηΒαθμολογία: 7/10\n\nκαλό μήνα\n\n"}, {"Review": "Remember what I said about the first book in this series? How it shows promise, is an interesting take, blah blah? Yeah, forget it all. This was one of the biggest disappointments I've ever read. All of the promise and interest in the first story disappeared into a foul-smelling vapor within the first 2 chapters. The author has obviously forgotten the character parameters he set for his own characters, namely Eragon. This story takes place at most 6-9 months after the end of the first book, in which Eragon was a very young teenager. He behaves and speaks as though he is a seasoned warrior of 30-35, complete with a sexual attraction to a woman hundreds of years older than himself! I realize this is a fantasy novel, but you've got to have believable interactions and relationships between your pre-set character traits. Not to mention the copious pages of made-up language was beyond tiresome. Good for you, Mr. Paolini. You can create a language just like your hero, Tolkein! We get it. Get on with it. Or rather, please don't. We've all seen Star Wars, Harry Potter, and Lord of the Rings. We already know how it will end. "}, {"Review": "This is crap. Paolini ditched almost all of Eragon's potential, spending his time in the land of elves who are smarter, more gorgeous, wiser, stronger, faster, longer-lived, better at magic, more hygenic, more tasteful, better at art, music, metalworking, and just generally better in every way than those poor, lowly humans. And. . .every man jack and woman girl of them is an atheist vegetarian! Yes, Paolini takes some clumsy but pervasive swipes against religion, demonstrating that he really doesn't know what the heck he's talking about.The fight scenes were all pretty bad too--most of them completely implausible. The Ra'zac should _ownz_ Roran! They're bird assassins from before the dawn of man, and he's a peasant with a hammer!I _did_ really like Nar Gazvog. And the dwarves were still pretty cool. I'll read the next book for the sake of Urgals, Shruikan (the evil black dragon), and to hopefully see Arya bite the dust. But I'm going to keep my expectations low."}, {"Review": "This full review can be viewed on my blog along with others at: shesgoingbookcrazy.comBuddy read with Maks \n\nUnderstanding begets empathy and compassion, even for the meanest beggar in the meanest city of Alagaësia.\n\nThe battle against Galbatorix' army in the dwarvan mountain realm was only the cusp of the war looming ahead. Now that Eragon and Saphira's presence is becoming known across Alagaësia, enemies arise at every turn.Strategy, politics, and duty threaten to delay Eragon's much needed journey to the northern region of the elves to train. As the first dragon rider in years, he has much to learn for the him impending meeting with the evil king himself. Roran, Eragon's cousin, finds himself in charge of the small village of Carvahall. Since Eragon's mysterious disappearance, the Ra'zac lurk around its borders, requesting the villagers to turn Roran over to them as he is now a fugitive to the empire. With this town, friends, and future family's lives on the line, Roran must utilize offensive tactics to defend those he holds dear. Time is of the essence, and each player has a vital part to play in this complex plot of treachery, suspense, intrigue, and magic. ------------------------I was instantly reminded why this book is my least favorite in the series. The pacing is so slow throughout the first half of the book, and very gradually increases. Then the climax comes at the end and throws me off guard, every time with its unparalleled element of surprise.  Eragon battles with himself throughout this entire book. Now at the awkward stage in his life where he transitions into a man, he battles with his growing feelings for Arya, insecurities, and immaturity. It's painful to watch him grapple with trying to understand why Arya and himself are not an appropriate fit, and I genuinely felt sorry for him. But there were times when I couldn't help think (and wish) that he'd just move on. Ironically enough, Saphira goes through a similar scenario, when she confronts the reality that she is the last surviving female dragon in Alagaësia. Out of desperation to rebuild her race, she too, makes foolish choices that have their consequences. Even though some of these characters' deliberations could be annoying necessary, I appreciated how it allowed the characters to show their age, experience, and understanding, which later on shows how much they have grown and matured throughout this series. \n\nHe welcomed those limitations, for if he were perfect, what would be left for him to accomplish?\n\nMost of use can agree that there are definite parallels between The Inheritance Cycle, and The Lord of the Rings. These similarities are especially obvious in  Eldest. When Islanzadi is confronted about keeping Gleadr's existence a secret, she states, \"I am diminished.\" It sounds almost exactly like the scene from LOTR when Galadriel says, \"I will diminish, and go into the West...\" (I think we all remember the scene from the movie.The fact that Eragon spends so much time in Du Weldenvarden makes it impossible to not point out just how similar it is to Lothlórien. The universally established fact that elves possess strong ties to nature works against this series, as it handcuffs its creativity in ways. However, there are a few tell-tale differences (view spoiler)[ including the fact that the city was created to house dragons and their riders while they resided there. (hide spoiler)]For all of the points in this book that dissuade me, there are points equally as important, notable, and genuinely wise, and say a lot about how skilled Paolini truly is as an author. #1 Nasuada is a gem and shines brighter than all characters in this book. Although she is young, she is extremely capable. She has several opportunities to \"show her age\" and react before thinking. Alas, she doesn't. It just shows that youth are just as capable of leadership as adults. Not only that, her tremendous ability at looking at situations from all angles only aids her in her station. #2 I appreciate Paolini's approach on prejudice, and how common, and hindering it is. This is most obviously depicted towards the Urguals, (view spoiler)[ when a group of Kull arrive to offer their services to fight against Galbatorix because he lied to them. (hide spoiler)] #3 I also appreciate how Paolini holds his characters accountable for their actions. Every action has a reaction, and a consequence. And these characters are faced with the products of their own doing many times over. This book has great potential in teaching great lessons to its readers, which makes it a solid read, and addition to this series. Vulgarity: Only in dwarvish.Sexual content: None, other that discussing the future existence of the dragon race.Violence: Moderate, battles occur several times. But there isn't an overabundance of gore. 3.5 stars.  "}, {"Review": "The writings of Eragon are the lamentations of readers...NOTE: I listened to this on audiobook, so espect to find the names and places probably hideously misspelled. I would make an effort to correct the spelling if I cared.Eragon and the Vardan have defeated Galbatorix’s forces at Farthen Dur. But Eragon’s journey has only begun. He must now travel to Ellesmera to learn the ways of the dragon riders from the Elves. Meanwhile, his cousin, Roran, must defend his home of Carvahall from the Raz’ac.But you might recognize it better as:Luke Skywalker and the Rebel Alliance have defeated the Empire's Death Star. But Luke's journey has only begun. He must now travel to Dagobah to learn the ways of the Jedi from the last remaining Jedi Master, a crazy old alien, Yoda. Meanwhile, Leia must defend the Millennium Falcon from Darth Vader and retrieve Han, her true love, from his clutches.I strove hard and long to find something admirable, enjoyable about this book. After much head-scratching I have one thing: Oromis teaching Eragon magic. Don't ask me why those parts interested me, but they did (few and far between though they be). Oh, no, wait, I have another favorite part: Vanna (White?) the Elf smack Eragon around. God, that almost makes the book worth reading. Well, not really...Other than these two very teeny, tiny blips on the Eldest radar, I found the “story” painful to listen to, hour after agonizing hour. I must be an ascetic, for mustering through almost 24 hours of this mess. Actually, I probably listened to less, as I tended to wander off mentally only to return and find that absolutely nothing had happened! It’s sad, when you’re reading a novel only to learn that half of what you are reading isn’t even important to the story. It’s either a big, red warning sign that the author is writing piles and piles of fluff or that the editor fell asleep while editing the draft. In Eldest's case, I believe it was both.As we saw in Eragon, the characters in Eldest are terrible, starting with Eragon, our loosely-defined \"hero\" and a pitifully concealed variant of Aragorn/Luke Skywalker. (NOTE: Be prepared for copious comparison to LOTR and Star Wars, as Paolini loved both so much, he decided to write a fanfic about them hooking up and having babies. Eragon and Eldest are those \"babies.) Unlike either Aragorn or Luke, he is the most boring, bland, uninteresting, emotionless, stupid, insipid (yes, I can use big words too!) protagonists I’ve ever read. Eragon never feels anything, he just cries out in anger or pain. The audience never feels any of his anger or pain, we are just told he has it. We suffer through his never-ending descriptions of descriptions of descriptions of everything around him, told with wide-eyed awe that made me wonder if this guy had been locked in a box as a child. We grimace as he stumbles over wooing Arya. We wince as things that are obvious, such as whether the Twins are traitors (they are, it’s not a secret, you could tell in Eragon), are completely beyond him. We are belabored with reading him study such anachronistic subjects like electricity, magnetism, modern physics (Gravity!), and microbiology (milk spoils because of tiny organisms). I suppose if this novel had been established as a steampunk novel like The Golden Compass, this could have worked, but as it stands, this only shows how “enlightened” the Elves and Eragon are, to be studying these odd subjects (Medieval Elves know about microorganisms that spoil milk? People don’t think electricity and magnetism are magic?). My head spent most of these sessions impacting a desk. I have the bruises as proof. And when Eragon becomes an Elf in the most contrived manner…I am still recovering from that one.Then we have Arwen—I mean, Arya. We learn here that she is—GASP!—a princess. Really, did no one see that coming? About the only other plot twist they could throw at us is if she is Eragon's sister. She is the most distant, cold, uninviting character (not Elf, not female, not protagonist, character) I’ve ever encountered. How are we supposed to want Eragon to fall in love with her when I’ve seen granite with more personality?! How are we supposed to think she is so much better than dwarves when she is the one to start a fight with a dwarf about religion (she barges into their temple and begins to tell them how stupid they are to believe in gods with no provocation)? Why are we supposed to feel anything when she reunites with her mother, Queen Iszlanzardi? And what the heck was the beef between them anyway? Why bother to bring it up if there isn’t even going to be a fight or a growth or a purpose to the difference of opinion?Then we have the poor forsaken Gimli-clone that accompanies Eragon. He is almost completely forgotten in the book, so much so that the author at one point finally remembers him and has Eragon comment on it. Why is he even in this book? What does he contribute to the story? Oh, right, can't knock a story when there really isn't one.Then we have all the characters that are basically carbon-copies of Star Wars and LOTR. Eragon is Luke with Aragorn’s name, Arya is Arwen/Leia, Murtagh is Han, Galbatorix is the Emperor/Darth Vader, Morzan is Darth Vader, Brom is Obi-Wan, Nasuada is Eowyn, Ajihad is Theoden, the Twins are Wormtongue, Orik is Chewbacca, Oromis is Yoda, Roran is Leia, Katrina is Han Solo…about the only character that could possibly be considered his own is Angela, but even she is supposedly based off his sister. That doesn’t even include the Dwarves, Elves and Orcs (called Urgals) from Lord of the Rings. In the hands of a good author, this could be done decently, so that the characters pay homage to Star Wars and Lord of the Rings without being half-@ssed rip offs, but Paolini is far from a good author.Worse than the characters, which I could at least stand in Eragon (I’ll admit, Brom was my favorite and it was shame when he died), the story is hideously, mind-numbingly boring. Absolutely nothing happens throughout the book! It’s all a long, boring retelling of journeys: one of Eragon’s and another of Roran’s.Eragon is sent to Dagobah to learn the ways of the Jedi under the tutelage of Yoda, the Last Jedi.Oops, I meant Eragon is sent to Ellesmera to learn the ways of the Dragon Riders under the tutelage of Oromis, the actual last Dragon Rider. It's so easy to make that mistake, since not only did Paolini steal SW characters, but also stole the entire plot of The Empire Strikes Back.Now, I realize that Eragon's plot was pretty much identical to A New Hope. But I could at least ignore the similarities by yelling profanities at the offending sections or getting lost in the fast pace of the novel. Eldest doesn't even bother to disguise the plot, preferring to spend pages upon pages on nothing. It lingers too long in Farthen Dur, too long on the journey to Ellesmera, so that Eragon doesn't even reach it until around Chapter 27 (which might not sound like much since the book is a freakin' 77 chapter doorstopper, but when you are listening to it hour after agonising hour, it is forever). So what happens in those 27 chapters? Well, if you guessed fighting battles, intense chase scenes, or standoffs with the bad guys, go to the corner and sit there and think about what you just did!! No, Paolini fills his \"epic\" fantasy with each agonizing step of the journey. I wouldn’t be surprised if Paolini detailed each day of the journey. Every stop is given in excruciating detail. Every race Eragon meets gives him long, boring lectures about their culture, their language, their religion, their clothes…anything and everything to pad this story out. Every trip down a river, every haul up a hill is recounted, every time they sent up camp...be prepared for a nap, folks!Even when we finally get to Ellesmera, the story doesn’t pick up. Instead, we trudge through Eragon’s thoughts about ants (THRILLS!), Oromis’ mind-boggling lessons on morality and ethics (CHILLS!), and Paolini’s barely concealed opinions on religion, veganism, and marriage (may I climb out the window SILLS?). No wonder my favorite part was where Vanna whips Eragon. That's the only scene where anything happens!The second “story” is Roran’s story of what happened in Carvahall. Wasn't that the guy who scooted off at the beginning of Eragon to try to make money to marry that chick? So...why is he here? Why was he ignored all through Eragon but now his story is important? Roran leads his people, Moses-like, out of Carvahall to the South to the safety of the Vardan. I have loads of insults for the stupidity of the townfolk, leaving their village at the whim of one man, to the clichéd motivational speech Roran gives, to yet another damsel-in-distress (women in these novels are just terrible, they can’t keep themselves from being kidnapped for the life of them), to another horrible, awkward romance, to the complete misunderstanding of how the world works, but I really don’t care enough about this part to dredge them up. Insert your own witticisms here.By the way, has anyone noticed that there is little explanation to why the Empire is bad? Okay, so we have the Raz’ac killing the folks of Carvahall, but that is only because of Eragon/Roran, and only because the dragon egg was stolen from Galbatorix. Last time I checked, thieves were punishable by law. If someone had stolen something from Eragon, he darn well would have gotten a horse and rode off to beat that thief's @ss...why wouldn't the government do something similar? If given the mind, one could reason that the Vardan are the enemies, for stealing, for being terrorists, and for being traitors to the government (and with how corrupt the Council are, an odd bit of realism in this stereotypical fantasy, it’s not a hard thought to wrap your head around). If you are going to make bad guys, you show them being bad guys. You show Galbatorix and Morzan killing people, oppressing people, stealing for no reason, burning down rows of pretty blue flowers, etc., not just tell the audience they are bad and expect us to root for Eragon and the Vardan.Now we get to the fun part: the writing style. Oh, God Almighty, the writing style. Paolini is very aware he’s trying to write an epic, because it sounds just like an epic should. Well, a quick glance shows it sounding like an epic should. If you read with any modicum of attention, you'll see that it reads like the worst LOTR fanfiction on the internet. Too much time is spent on needless descriptions (Oh, yes, let’s describe each of the Dwarves gods and goddesses!), padded wording, and clichéd phrases. Some of the worst passages I’ve found include:“Slippers flashing beneath her dress, like mice darting from a hole.” WORST. DESCRIPTION. EVER. Mice now dart out of a hole, back into the hole, and out of the hole, all in quick rapid succession? Was this really the best way to describe...what is Paolini describing???“Eragon surreptitiously watched the Elf, curious to what he looked like without his clothes.” Uh, and why is Eragon hitting on Arya and pouting when he fails disastrously?“Eragon savored the epics as he might a well-cooked meal.” Who said you couldn’t eat what you read?“Anxiety ran through his voice like a taut bow string.” Run, Anxiety, run! Get away from the bad simile!“gyrating walls of ebony water” No, I would say “purple”, as in “purple prose”.And then, of course, as I’ve briefly touched on earlier, Paolini breaks some of the author’s Golden Rules. “Show, don’t tell”. “Good prose should be invisible”. “Don’t lose the pacing by trying to describe your setting”. “The word ‘said’ is your best friend in dialogue.” And so on.And now, I get into the audiobook. Most of the time, I don’t bother to comment, as the narrators do a good job at narrating. But I absolutely hated one thing about this narrator: his voices. They weren’t bad, even if the women were nearly impossible to tell apart from the men, but the absolute low point was the dragons. For the dragons, the narrator growled in a low, deep, raspy voice. This wasn’t bad for a short sentence here and there, but for long, long, long passages (which Paolini writes a lot of), it was so bad, I was very close to skipping over the section, just to stop listening to the horrible voice.If you are interested in reading a cross-over fan fiction of Star Wars and Lord of the Rings, I recommend you go to fan-fiction.net. If you want to read horrible characters, unending descriptions, bad romance, and a thin as plastic wrap plot stretched over 71 chapters that reads like Star Wars with characters and settings from Lord of the Rings, read Eldest. If you didn’t like Eragon, Eldest will only make you madder."}, {"Review": "“Eldest Book Review”\tThe book Eldest by Christopher Paolini is a book about a dragon and his rider. The two, intertwined by the magic of thought, journey through the land to Ellemera to study the arts of magic as he prepares to face off against the belligerent tyrant Galbatorix.\tThe book had many interesting twists and turns. Eragon, the rider, has always thought to be the last rider, excluding the king and his evil riders, know as the foresworn. But suddenly, Ormoris, an Elvin rider appears to teach Eragon what it means to be a rider. Also, as the story proceeds, Eragon begins to fall in love with Arya, but she discovers his feelings for her in the most interesting of ways. She found out from a stone tablet that he had “imagines” up. And in the end, Eragon finds a man that was his brother, and also, his father was revealed to him. A man he could not be proud of and a man killed my one of his former mentors.\tAlthough the story had a brilliant plot and a fascinating story, the story went far too slow. It took Eragon 300 pages to travel to Ellemera and learn magic, and 300 for his cousin, Roran, to escape the Ra’zaac and flee to Surda. Leaving only the remaining 60 pages to the great battle and Roran’s and Eragon’s reunion. It’s a good think to put details in his story, but he had too much detail, to the point where he could spend a paragraph or two just talking about what a character does or what he looked like, which I found could be irritating and annoying at some times.\t\tDespite the overloading of details, the story was an enjoyable read and hooks readers to read the next book with a sudden stop to the story in a very dramatic place. And the magics and the spells used seemed very believable. In other words, they weren’t just randomly made up words. The works were cleverly disguised in a different language. Anyone who enjoys fiction or scientific fiction, or stories from the past would enjoy this book greatly. "}, {"Review": "I was half expecting Eldest to be an improvement for Paolini, but what I expect never seems to be what I get. Eldest was lengthy; too lengthy. What were easily 500 pages of adjective oriented action would have been fine at 30 pages tops. It seems as if Paolini is still aiming his novels towards the pre-teen to teen audience, something that paid off for him after making Eragon. It's a shame that strategy worked again. Besides the one or two exciting twists and turns, the plot did not impress. There are two words to sum it up: long, and predictable. It begins with a stretched and dry account of Eragon's journey to the elf capital of Ellesméra, on the way encountering various linear characters and scenarios. This was no doubt the worst part of the book, for not a trace of excitement surfaces for over a bulging 150 pages.These two pitfalls together create a novel twice as difficult to read, and twice as easy to give one star."}, {"Review": "Took me a while to notice that I haven't added this book yet. And overall it wasn't that bad. There were some major twists in it, especially towards the end. And I did love when Eragon was with the elves, though some chapters were too long and boring. Also, I didn't really like the chapters with Eragon's cousin. He's not my favourite character of the books and he kind of irritates me, especially when he blamed Eragon for everything. So, I didn't like his chapters. Plus, there weren't many battles in this one, but, all in all, it was enjoyable."}], "Image": "https://images.gr-assets.com/books/1387119654l/45978.jpg", "Desc": "Darkness falls…despair abounds…evil reigns…Eragon and his dragon, Saphira, have just saved the rebel state from destruction by the mighty forces of King Galbatorix, cruel ruler of the Empire. Now Eragon must travel to Ellesmera, land of the elves, for further training in the skills of the Dragon Rider. Ages 12+.Darkness falls…despair abounds…evil reigns…Eragon and his dragon, Saphira, have just saved the rebel state from destruction by the mighty forces of King Galbatorix, cruel ruler of the Empire. Now Eragon must travel to Ellesmera, land of the elves, for further training in the skills of the Dragon Rider: magic and swordsmanship. Soon he is on the journey of a lifetime, his eyes open to awe-inspring new places and people, his days filled with fresh adventure. But chaos and betrayal plague him at every turn, and nothing is what it seems. Before long, Eragon doesn't know whom he can trust.Meanwhile, his cousin Roran must fight a new battle–one that might put Eragon in even graver danger.Will the king's dark hand strangle all resistance? Eragon may not escape with even his life. . . ."}