{"Genre": "Fantasy", "ID": "16096824", "Name": "A Court of Thorns and Roses", "Reviews": [{"Review": "Clearly I'm in the minority here. DNF at 30% because I just got fed up with things moving at a snail's pace and NOT MAKING SENSE AT ALL. This was one of the most uncompelling versions of Beauty and the Beast that I have ever read. The writing is nothing outstanding, there was nothing that moved me. I felt Cruel Beauty among other B&B retellings I've read this year and last have done a far superior job at moving me emotionally.Look, I'm sure by the end of the book, all the things tie together and everything's just dandy and things will make sense, and I'd be like \"ooooooh, so that's why ____.\" Me, I don't care. Ain't nobody got time for that. I have so many questions and I'm just fed up. This is not a retelling of Beauty and the Beast. This is a book about a girl who gets to live an easy life with a guy who's implied to be a gorgeous Fae underneath his mask.The original story makes sense: here's roughly how it goes. Handsome prince is cursed to be ugly unless he gets a chick to fall for him. Flash forward, there's Belle's dad. Belle's dad wanders into Beast's castle and touches his stuff. Beast doesn't like the fact that Belle's dad touched his stuff. Beast is going to kill Belle's dad unless he gets Beast some pussy. Belle's valiantly steps in to save dad, Beast is as nice to her as much as a hairy ugly, self-conscious, socially ostracized monster can be. Belle is treated like a princess because Beast really, really fucking needs her to save him and his people before the curse runs out!There's a reason Belle is treated like the queen! Things make sense! They have to learn to trust one another. Things are slowly developed an built over time. There is a hideous beast who is scarred emotionally, and a beauty who needs to look past the exterior. There is a point. Not so with this book. Things are far, far too easy with this book.Now here's this version of Beauty and the Beast, a retelling that tries to be bad-ass and fails completely, from the little that I have read.There's Feyre who has a pretty crappy life with an absentminded, worthless, spineless dad, and two of the most bitchy, ungrateful sisters in the entire world. She slaves for them, she hunts food for them, she works her ass off for them. Without her, their family would starve. They don't care. I feel some pity for her, but she acts like so much of a martyr that there's only so much I can take.While hunting one day, Feyre kills a wolf, well, surprise, surprise, that wolf turns out to be a Fae in disguise. In return for this kill, Feyre is taken by a wolf (who's a Fae in disguise) away from her family.\n“What is the payment the Treaty requires?”His eyes didn’t leave my face as he said, “A life for a life. Any unprovoked attacks on faerie-kind by humans are to be paid only by a human life in exchange.”\nA life for a life! Oh, no! Is she going to die?! That's what a life for a life means, right? WRONG. Feyre is taken off to magical Fairyland to live in luxury for the rest of her life while her family is taken care of back in their little village.\n“Some would say it’s unwise to insult a Fae in his home,” Tamlin ground out. “Some would say you should be grateful for me finding you before another one of my kind came to claim the debt, for sparing your life and then offering you the chance to live in comfort.”\nSo what?! Why?! This makes no sense at all. Feyre kills one of their kind. A beloved brother. In exchange, there is absolutely no punishment whatsoever. She gets to live in a fantastically fabulous castle, waited on by servants. She gets beautiful clothes and delicious food.\nAnother useless answer. I dug into my breakfast, savoring each rich sip of tea, and she slipped into the bathing chamber. When I was done eating and bathing, I refused Alis’s offer and dressed myself in another exquisite tunic—this one of purple so deep it could have been black.\nClearly there is some kind of a setup involving The Treaty, since there seems to be a lot of secrecy between the Fae...but wait, whatever information she wants, the Fae reveals...they're revealing their own weakness to Feyre, who is constantly plotting her own escape. It doesn't make any sense!\n “There is … a sickness in these lands. Across Prythian. There has been for almost fifty years now. It is why this house and these lands are so empty: most have left. The blight spreads slowly, but it has made magic act … strangely. My own powers are diminished due to it. These masks”—he tapped on his—“are the result of a surge of it that occurred during a masquerade forty-nine years ago. Even now, we can’t remove them.”\nOver and over and over, the Fae reveal their secrets to her, including one that might help her escape.\n“So there are faeries who will actually answer any question if you trap them?” Maybe they’d know how to free me from the Treaty’s terms.“Yes,” he said tightly. “The Suriel. But they’re old and wicked, and not worth the danger of going out to find them.\nAnd then pretty much the next chapter, she goes out AND IMMEDIATELY FINDS THESE MYSTERIOUS CREATURES. WHAT THE FUCK.I do not like it when things come so easily to a main character, and everything comes easily to Feyre. There is no consequence whatsoever to her actions. There is no punishment to her deed of killing. The Fae are supposed to hate her...it doesn't feel like it, because she is \"inconsequential.\" In fact, they're more of her playmates than her wardens. The Fae seem to have no other things to do besides play with her and hunt with her.\n“My morning work was postponed,” he said. Indeed, his usual tunic was off, the baldric gone, and the sleeves of his white shirt had been rolled up to the elbows to reveal tanned forearms corded with muscle. “If you want a ride across the grounds—if you’re interested in your new … residence, I can take you.”\nAnd teach her how to read and write...because Feyre cannot read or write, an ironic twist to the Disney Belle's love for reading.\n“I could help you write to them, if that’s why you’re in here.”\nFeyre is irreverent, ungrateful and insulting to her wardens...in a way that gets her no punishment whatsoever.\n“Do you ever stop being such a prick?” I snapped back.Dead—really, truly, I should have been dead for that.But Lucien grinned at me. “Much better.”\nAs I said, I'm sure this book improves in the end, but from what I've read, this book makes no sense, the writing is emotionless, the characters are flat, the main character unrealistic, and I do not care to continue."}, {"Review": "INITIAL REACTION: WILL UPDATE WITH REVIEW LATER BUT KNOW I LOVED THIS. IT KILLED ME AND BROUGHT ME BACK TO LIFE Y'ALL.\nA REVIEW IN GIFs\n:Me when I received the book:\nWhen I started reading:\nWhen Feyre was introduced:\nWhen Tamlin as introduced:\nFEYLIN/TAMEY:\nLITERALLY ME WHENEVER THEY SPOKE TO/LOOKED AT EACH OTHER:\nTHE PLOT WAS BASICALLY EVERYTHING I WANTED IT WAS...\nTHEN THERE'S CHAPTER 27!!! AND I DIED SEVERAL TIMES\n\n\nAmarantha,\nAlso Rhysand:\n(more like get off my SHIP, am I right??)Feyre's character development was ON POINT:\nBASICALLY THIS WAS ME AFTER READING IT:\n\n\n\n\n"}, {"Review": "2 1/2 stars. Maybe my rating comes as a surprise or even - if you care - a disappointment, but let me assure you: no one is more surprised or disappointed than I am. I've had this book on my TBR ever since it appeared on Goodreads without a title, cover or description. I started reading it as soon as it became available and the array of positive reviews from my friends and strangers alike made me feel sure I would love it. But I didn't. It is possible I expected all the wrong things from A Court of Thorns and Roses, and maybe my review can prevent others from doing the same.Here's what I expected: an intricate fantasy world, supernatural politics and alliances, fast-paced action, a sensual romance - perhaps similar to Cruel Beauty and other Beauty and the Beast retellings, and a flawed but likable heroine.But this book is, if you ask me, nothing more or less than softcore erotica. Which is fine, if that's what you're looking for. I personally thought that the fantasy aspect felt like trimmings around a story that was all about a romance between Feyre (the narrator) and Tamlin (a High Lord of the Fae). There are some titillating scenes where Tamlin bites Feyre's neck and they have sex - undoubtedly the best bits of the book and I won't pretend I didn't feel a little hot under the collar myself. But the \"ancient wicked shadow\" promised in the blurb is only really a source of more romantic angst for Feyre and Tamlin.However, I *do* like a good romance as much as anyone, so there are other reasons this book didn't quite work for me. In order to express what I mean, I'm going to compare A Court of Thorns and Roses to Cruel Beauty, which is, in my opinion, a better book. In CB, I felt the chemistry between Nyx and Ignifex as soon as their loaded banter started to fill the pages. They were sexy together, Ignifex was an evil ruler (which was a real problem for their relationship) with blood-red eyes, and the supernatural part of the book was creepy, weird and completely unique. Despite enjoying the actual non-PG scenes in A Court of Thorns and Roses, I never felt any real chemistry between Feyre and Tamlin or any realistic challenge to their relationship.What makes Beauty and the Beast such a compelling romance? One that demands to be told over and over again in so many different ways? I'll tell you what it is: it's the obstacles, the challenges, the improbability... how can a young woman come to love an ugly beast? We ask. I'll prove it's possible! The author replies. That's why readers fall in love with the beast again and again, even when he is furry and has horns like the Disney version. I loved the Disney beast. (view spoiler)[And that badass fox in Robin Hood so it's possible I have issues. (hide spoiler)]Tamlin is not a beast.“Even as he bit out the words, I couldn’t ignore the sheer male beauty of that strong jaw, the richness of his golden-tan skin.” Oh my, how could a poor young woman ever love a pretty-faced, golden-haired, completely not evil Fae prince? How weird.Maas is a good writer and the beginning - before Feyre is taken to the Fae world - made me believe a great book was on the way. When Maas writes action, she writes action really well. But there was far too little of it in this book. It came in behind the descriptions of beautiful Fae men and the Fae palace. In short: It just wasn't nasty enough. In truth, this felt more like an extended Cinderella retelling than what it was supposed to be. A girl lives in poverty and looks after her rather annoying sisters until one day she is swept up by a prince who takes her to his beautiful palace (after about three chapters). I just find it hard to recommend this when I think Cruel Beauty is similar and yet so much better.Blog | Facebook | Twitter | Instagram | Tumblr"}, {"Review": "A richly imagined fairy tale retelling of Beauty and the Beast!If you’re a lover of retellings mingling romance, danger, faerie mystical creatures and a heroine that shows a significant deal of courage throughout, then this is one title you will not want to miss out and will very likely considerably enjoy.The world-building is inventive and detailed. The different Courts of faeries are an element that adds great originality to this story. At first, A Court of Thorns and Roses might appear similar to plenty of fantasy books already written out there but, the further you read, the more you come to descry its ingenious lines shaping the well-known classic sprinkled with beautiful themes and… sensuality.What was missing for me was action. I wanted more of it, as well as some adventure and deadly dangerous situations, which we do get, in the first chapters, but otherwise not until a good part of the novel. The pacing is quite slow, for the author chose to take her time building the relationship between Feyre, Tamlin, Lucien and even Alis, a servant. Surprisingly, there weren’t as many characters as I expected. The world-building being focused on distinct Courts principally ruled by High Lords and dwelt by lesser faeries, I thought, deceptively so, that we were going to be introduced to so many of them!I have to say that Sarah J. Maas’ writing is compelling. While she could have moderated her descriptions of paintings, for there were many of them and relatively long ones, even those didn’t bore me. Feyre, the heroine, is both a huntress and painter. Never have I seen this mix of skills before in one person. Her strength won’t go unnoticed and neither will her dauntlessness. There were moments in the story when I felt the need to growl at her, for her difficulty to obey orders – even if for her own protection – was bewildering!It’s true what they say, Tamlin will make you swoon… *wink*Recommended to fans of Cruel Beauty, East and Beauty.--------------------------2016/06/29: Rating upped to 5 stars after second read.--------------------------Well, well, what do we have here?Original, amazingly looking cover? Check!‘‘Tamlin—one of the lethal, immortal faeries who once ruled their world.’’Fairies? Check!‘‘treacherous magical land she only knows about from legends’’Magic + alternative world + some mystery perhaps? Check!‘‘her feelings for Tamlin transform from icy hostility into a fiery passion’’Love/hate relationship that, because it’s Sarah J. Maas, will blow our mind? Check!‘‘But an ancient, wicked shadow over the faerie lands is growing, and Feyre must find a way to stop it ... or doom Tamlin—and his world—forever.’’DANGER. Brave heroine? CHECK CHECK CHECK!Basically, it has everything to look for in a fantasy.Please, do not disappoint."}, {"Review": "This book is the result of Bella Swan being thrown into a fantasy world and trying to be Katniss Everdeen. She did not succeed. OK MORE REVIEW:I genuinely really enjoyed some aspects of this book, but I couldn't stand Feyre, or Tamlin... or anybody really, except for Lucien. I feel like Lucien was the only character who had an interesting back story, and he was just a much better presence than either of the main characters.BUT THE INSTALOVE. THE INSTALOVE, GUYS. IT KILLS ME. Also verrrrry problematic scenes, like when it was Feyre's fault for almost getting raped? can you not? \"GO BACK TO YOUR ROOM FEYRE BEFORE I DO SOMETHING BAD TO YOU\" wow whoa really not cool.On top of all that, I just found the plot to be incredibly boring. I started getting interested around the 200-page mark, but then it all just went back to being uninteresting again. I know in a status update I said that the book was slow, but what I should have said is that it was boring, because there is a huge difference. A book can be fast-paced and still be boring, and vice versa. I LOVE SLOW-PACED BOOKS. Have you seen how much I loved The Name of the Wind and the Game of Thrones books? THOSE ARE SLOW. BUT NOT BORING. THIS WAS BORING.That's how I felt anyway, it's my opinion. If you weren't bored by this book, that's awesome. However, I will never lie to you about my opinion. So here we are."}, {"Review": "4.5 stars Tamlin is going to set your loins aflame. Phew! My cheeks are still flushed. I'm also fairly confident this book is going to help change the face of new adult fiction. How awesome to see gifted writers shaping non-contemporary stories that have the coming of age/youthful perspective and vibe of YA books and combine that with the freedom that writing for an older target audience affords them. If you liked the mood and romance of (the excellent) CRUEL BEAUTY but perhaps mourned the missed opportunities of such a seductive premise, ACOTAR more than satisfies. (view spoiler)[ BITE MY NECK SOME MORE, SIR.  (hide spoiler)]Plus stunning action and gorgeous imagery and interesting characters, including a fascinating anti-hero I'm looking forward to learning more about. Serious Darkling vibes, my friends. Maybe more of a review closer to release. If I can calm my racing pulse before then. "}, {"Review": "This was so much better the second time around. I found I wasn't so concerned about rushing through to get to the next book; since I already knew what happens I was able to savor the details and carve out a tiny piece of my heart for Tam Tam (but not really because duh). On to the next one!3.5 STARS I am 100% embarrassed by how much I loved this book. Everything in the Humphrey household is going awry so it was wonderful being able to escape in Feyre's exciting problems and leave my own behind. There is nothing of substance to the book; it is fluffy, cheesy, and has been done multiple times over before, yet somehow I STILL was completely sucked in and couldn't put it down. I ate it up like candy and am looking forward to picking up ACOMAF. Holy cow I fell for Rhys so hard and WHY DO I ALWAYS LIKE THE ONE THAT THE GIRL NEVER PICKS?!?!?!?! I found myself utterly bored and despising the scenes with Feyre's father and sisters. I know they were necessary, but I almost put the book down as a DNF early on bc I could hardly get through those scenes. Not sure what else I can add that hasn't been said already a million times over, but this is a reheated \"Beauty and the Beast\" with side dishes of Cinderella and Twilight. (I'm still thinking about Thanksgiving food-sorry guys). I might hold off on the next book until a little closer to May so I'm not left hanging. My inner teenage fangirl is looking forward to gobbling up more delicious fluff."}, {"Review": "2.5 StarsOnce again, I find myself the odd man out when it comes to a massively popular book...I went into this really excited and and really wanting to love this thing. After seeing this book and its successors paint my feed with its courts and thorns and wings and ruin, I knew there was a lot of hype surrounding this series in general.And this first installment just didn't live up to it for me, sadly. There, there, Court Thornians...Quite frankly, the first 60% of this book dragged like a U-Haul trailer with no wheels. Nothing really happened and the things that did didn't even make sense until after the book was over. And I'm just not a fan of that. I like to enjoy books while I'm reading them, not only for the last 25-35% when everything that was murky throughout the whole book becomes clear. I also found myself WAY more interested in Rhysand than the actual love interest, Tamlin. Whoops!THAT SAID.I did enjoy the writing and the ending.And while those things aren't enough to prompt me to rate this thing any higher, I AM going to read the second book. I trust my peeps and all of you are saying that, while the first book drags, the second book is \"OMG amazeballs.\" And I have faith in ya'll.Plus, I am getting it free from the library, so why not, no?\n\n\n\n"}, {"Review": "I cannot remember ever being this conflicted over a book. There are parts of A Court of Thorns and Roses I really loved, but a lot of parts I really hated. I went into this book fully expecting to love it. Beauty and the Beast is one of my favorite fairy tales, and I was interested to see how SJM made the story her own. First off, my biggest problem with this story was Feyre as a character. I have never been so irritated. Her character development and personality, for the most part, didn't make sense to me. She was the caretaker of her entire family for years, supposedly a hunter with a strong survival instinct. And yet, she proceeded to make the stupidest decisions and put herself in danger time and time again. I didn't get the sense that she did this out of bravery, but more out of stupidity. It didn't mesh with what her character was supposed to be. Examples of these idiotic choices: (view spoiler)[ 1. Repeatedly plotting to escape into a faerie land that she knew to be deadly, when she was asleep on the way to the manor and obviously wouldn't know her way back to the mortal lands 2. Running after the illusion of her CRIPPLED father at NIGHT, when she has been told and witnessed how deceptive fae can be3. Trapping a Suriel with little more than a snare, in the deadly part of the forest, after she has been told, and AGAIN, SEEN how dangerous these creatures are4. Going to Fire Night after being told how dangerous it is, not leaving after being almost raped by 3 faeries, and then proceeding to leave her room AGAIN afterwards5. Drinking the faerie wine at the Solstice, even after Lucien of all people warned her not to 6. Leaving the manor when the Suriel flat out TOLD her not to and that she would be safe with Tamlin, and deciding to not mention that to ANYONE before he forced her to leave (hide spoiler)]In addition to all of these idiotic choices, she also is incredibly inconsistent. She'll go from hating Fae to sympathizing with them to loving them back to fearing them at the drop of a hat. These inconsistencies are probably the most irritating, as there are scenes that I absolutely adore with Feyre, but then she goes back to doing the next pain in the ass thing on the next page. I also found her relationship with Tamlin to be problematic. Yes, I do enjoy problematic things (especially ships from time to time) but there were a lot of things I couldn't excuse with them. Again, more inconsistencies in characters' behavior. Tamlin's hot and cold behavior was eventually explained, but not until 70% of the way through the book. It was too little too late. Also, (view spoiler)[ I found the Fire Night scene to be a problem for me. I do enjoy volatile relationships and bad boy characters. But only when we are told from the beginning that one of the characters is \"bad\". Tamlin we are led to believe is a saint, then he bites her and gets possessive, but all is forgiven the next morning. Because he's a \"nice guy.\" No. (hide spoiler)]The world building I found to be lackluster in a lot of ways. While I really enjoyed the wide variety of Fae creatures we got to see, I thought that a lot of the back story was revealed in a lazy way. Instead of having Feyre figure anything out for herself, important things are told to her through long monologues from a number of characters throughout the book. This happens numerous times. Additionally, few side characters have any development and most felt like blank slates. With that being said, the ones that were developed I adored. Lucien and Rhys saved the book for me in a lot of ways. I found them both to be complex and interesting characters. The last 10-15% of the book saved it for me. I found the plot to finally be interesting, and I found Feyre's decisions in those chapters to actually make sense. A lot of things were set up for future books that have me very intrigued, and I'm looking forward to the rest of the series. Many things that I disliked in this book, may in fact be remedied due to some of the occurrences in this last small section of the book. Overall, I was disappointed by this first installment. While there were elements I really enjoyed, they didn't make up for the elements I didn't. I'm hoping future installments will prove to be better. I will also be doing a full video review and spoiler-filled discussion on my channel in the future if you want to know more of my thoughts. "}, {"Review": "SARAH J MAAS DOES IT AGAIN!!!! KNOCKED MY FREAKING SOCKS OFF AND WITH A STORY RE-TELLING?!!!!I hate story re-tellings!!! I hate them but this, this master piece is no Beauty and the Beast. I'm just gonna jump right into everything and just a little warning: I'm so sorry if this seems like I'm frantically flapping around on my keyboard, but I'm just that excited. I was so worried that this book would have a plot too close to Throne of Glass and that the characters would also bare that same fate... But thank the literary gods above that didn't happen. Yes, Maas still gives us swoon worthy gents and a strong leading fem, but they are not at all like the cast of ToG. Our leading lass is Feyre, and man oh man did I love her. I loved that though she is strong she isn't doing it for herself or because that's who she is, she's doing to because it's what needs to be done. This is what made her character for me. She does everything for everyone and expects nothing in return. Her character starts as a strong huntress and turns into something more. She has the head strong will of a warrior and the heart of an artist. I loved that Maas gave her so much depth and let us get so deep into her brain that her feelings become your feelings. As for Feyre's love interested she gives us the heart twist-swoon worthy-deep-thoughtful-man candy that is Tamlin. Oh Tamlin will have you weak in the knees and have your loins aflame (seriously blushed so much during this book). He literately has so much weight on his shoulders and still stands tall. He is willing to give up everything to make sure shes okay. I kid y'all not I never ever use the word \"ship\" for couples, but as they say there's a first for everything and.... I SHIP THEM!!! I SHIP THEM SO HARD! YOU SEE THAT SPOT OVER THERE IN THE DISTANCE THAT IS THEIR SHIP AND IT IS SAILING!!! \n\nCan't stress enough how much I loved their relationship. I love that this book is based around it and its growth. They have such a push and pull. I love that one has everything and one is holding on to anything. How they play off each other is so well written. Also had my brain rocked by how Maas stepped up her sexy game in this book... Because its like a sauna in there! Whoosh so good! *Round of applause* .The sub characters like the rest of the story are so well done. Lucien, Tam's best friend, has got to be one of my favorites in this book. His loyalty won me over. Plus he isn't so bad on the eyes if ya get what I mean... At one point I even remember saying \"I don't know who I like more Teen Wolf or the Sexy Fox with one eye\"... Yeah, Maas makes having one eye even sound hot! The evil Queen in this book was the perfect amount of mystery and you will hate her. And then there's Rhysand... There's not much I'll say about him, but what I will say is that even when Maas gives you characters you're suppose to hate you still end up falling in love with them.“Be glad of your human heart, Feyre. Pity those who don’t feel anything at all.” The plot and world building in this book are so beyond what a lot of other authors would have given us. There are so many vivid details, so many beautifully painted scenes, and so many perfectly peeled layers. I was never once left to question what the world looked like (or characters), and I was thankful for this. Sometimes I do like to fill in the holes with my own ideas but not when it comes to high fantasy reads like this one. The plot is action packed. We have this heavy start to the book, a world building middle, and a jam slammed action packed ending. Because let me tell you when everything comes together and everything is slowly shown you will be tossing your book in the air or punching your kindles in their faces... You will freak out! It's like the end scene to Inception where that heavy DOM DOM music starts playing and the dream is collapsing and everything just falls together for this epic ending! Even the things you know are coming will still rock you to your bones. Maas gives you this heart filled, gut wrenching, wtf ending that I myself couldn't of been happier about. I ate this story up!!!! The plot is just as strong as the characters, and I'm so glad this wasn't a let down. Maas perfectly blends both the YA and NA worlds into this one book. This is a book that will make your heart race and make you want to lose those precise few hours of sleep just to snag a few more chapters... And it'll be worth it too!A Court of Thorns and Roses was the tits. Read this review and others over on my blogBetween the sheets & covers blog Between the sheets & covers blog Between the sheets & covers blog Originally read April 2015 Re-read April 2016"}, {"Review": "\n\nThe first half sucks but keep readingThere's no way around it. From page 1 to about 200, Feyre is an  annoying, blindingly stupid and obstinate main character. I nearly put this book down half a dozen times (it was like reading Red Queen). BUT, midway through the book, things turned around magnificently. And I cannot wait to read the sequel.  Feyre is hunting in the middle of the woods to keep her useless starving family alive (Hunger Games, anyone?). A chance encounter with a wolf - who wasn't entirely a wolf - leaves Feyre on the wrong end of an ancient treaty. She is forced to go to the fairy realm to live out the remaining years of her human life - no friends, no family and no freedom. \n“Has anyone ever taken care of you?” he asked quietly.“No.” I’d long since stopped feeling sorry for myself about it.\nAt first, she cannot think of anything but escape. Slowly (but surely), she is swept into the fairy realm - in its magic & intrigue, in its danger & hopelessness, and in its wonder & glory. \n“Spring, Summer, Autumn, Winter, Dawn, Day, and Night,” it mused, as if I hadn’t even answered. “The seven Courts of Prythian, each ruled by a High Lord, all of them deadly in their own way. They are not merely powerful—they are Power.”\nFeyre lands in the Spring court - which is under a masquerade curse for nearly fifty years. The court is being attacked by all manner of terrible creatures and there is a blight upon the land . This blight will soon cross to the human realm - threatening everyone Feyre holds dear.This was interesting but not compelling. Until that 50% mark. Suddenly, all the plot holes, nonsensical actions of her fairy captors (Tamlin and Lucien) and Feyre's complete idiocy flipped on their heads. Everything makes sense now.  (Okay, Feyre's still a bit of an idiot, but at least not glaringly so). I literally could not put this down.Though, and maybe it's just me, but the Tamlin-Feyre arc felt a bit rushed/forced. Her constant love declarations really had me questioning their relationship. But then again, I had a friend who accidentally spilled the beans on that one. Without giving any spoilers, I sure hope book 2 does a complete character shift on you-know-who (NOT voldemort) because I am not pleased with the way the love interest was hinted at during the end of the book. (He's such a jerk!)Overall, I am amazed by how much effort Sarah J. Maas put into constructing this story. I'm this close || to rereading the book solely to better appreciate all those little clues that I must have passed over. So, if you pick this up and just aren't feeling it - \n\nkeep reading\n\n - trust me. The Finer Books Club - 2018 Reading Challenge: A book recommended by a friendBlog | Instagram | Twitter"}, {"Review": "4.8/5 Stars ⭐️ ⭐️ ⭐️ ⭐️ ⭐️“Don't feel bad for one moment about doing what brings you joy.” I'm speechless. What am I supposed to say after this? Am I supposed to write a coherent review with vital points as to why this book WAS FUCKING AMAZING??? I CAN'T EVEN TALK RIGHT NOW I'M SPEECHLESS. I WANT THE SECOND BOOK IN MY HANDS BUT MY ORDER STILL HASN'T COME. I'M READY TO GO TO FUCKING ENGLAND MYSELF AND PURCHASE IT. KIDS I'M LITERALLY DYING HERE. The Beauty and the Beast-esque fantasy drama tells the story of Feyre, who finds herself entwined with faeries after unknowingly killing one. When the 19-year-old huntress kills a wolf in the woods, a beast-like creature arrives to demand retribution for it. Dragged to a treacherous magical land she only knows about from legends, Feyre discovers that her captor is not an animal, but Tamlin, one of the lethal, immortal faeries who once ruled their world. Feyre must find a way to stop it or doom Tamlin and his world forever.I'm not a fantasy fan. I love fantasy in film and tv but not in books. I picked up this book cause I wanted to use it for my thesis for uni (don't even ask) and now after I graduated I decided to give it a go. My favorite genres to read are historical fiction and contemporary, and fantasy falls on a very different category. But the fantasy in this book man... it gripped me tight and didn't let me go.First I started off this book a bit confused. The language confused me a bit, the terms, all the information. I'm reading books in English while my native language is Greek so fantasy fell a bit harsh on me. As I said, I'm not a fantasy fan, and with fantasy comes many weird words and shit like that. But I kept going and after a while I got used to everything and started to enjoy the plot and the characters. I enjoyed very much the factor that there weren't many characters in this book. I don't like when a book is crowded with characters, it doesn't give me the space to love them all. This book succeeded in making all the characters lovable for me... even Rhysand. I fucking love Rhysand man. Unexpected feelings happening.The world Sarah J. Maas created is so rich and dark and gloomy but also happy and hopeful and full of light, I truly enjoyed reading about it. I always get bored, to be honest, with descriptions and politics of different worlds but this one excited me. Even the fucking politics were exciting. I want to delve more into this world wHEN MY FUCKING BOOK ARRIVES.Now to the juicy shit... the romance. Holy fucking shit. I ship these two so hard I can't even breathe. When he sent her away I wanted to scream! He gave her a good fucking and left her hanging. Why am I laughing at this? But honestly, the romance was amazing. At first, I felt like the entire book was only gonna be about the romance and I didn't quite enjoy that but after all the revelations and the twists in the plot, the romance was used wisely. And I didn't expect that, because I have heard lots of things about this book. And now we have Rhysand... this dark, handsome motherfucker who has a gloomy past. This will become a triangle, I can feel it in my bones. But I'm here for it, for some reason. I love the heat Maas's romances convey in me.To sum it all up, this book took me a while to get into but it was all worth it. Maybe after this book I will start reading more fantasy. Maybe. Maybe not. As I'm waiting for the sequel to arrive, I will drawn my sorrow into crying about how amazing this first book was. Or maybe reread some parts. Maybe. Anyway, till the next one K BYE!!!"}, {"Review": "UPDATE: $1.99 on Kindle US today 12/23/18This was a re-read on Audible. It's my favorite new thing, to re-read books either through Audible or Overdrive. I must say this was better the second time around but ye gods, I thought I was going to gag a maggot with all the lovey dovey and sex with Tamlin. I mean after falling in love with Rhys I can't even people. And also, who could have sex with some old beast after he had that ritual thing with someone else. Ewwww! I know it's some THING but I don't give a rats arse! Anyhoo, on to the next! Mel ❤️*****Old Review*****I had a love/hate relationship with this book. I loved it so much in the beginning, then I felt a little off with it for a bit, but the end took me right back to loving it. I think this is a very unique take on Beauty and the Beast. I loved Tamlin, but I wonder! There were times that Feyre got on my last nerves and I wanted to smack her, but it happens. She did great over all. I loved some of the characters in the book. There is Lucien, who I hope to learn more about in the next book. Alis, who is Feyre's sort of maiden when she comes to the manor. And I actually liked Rhysand in the end. He's a bad guy of sorts but I won't give that spoiler away. I just want more of him! I loved the scenery I pictured in the book from the descriptions. It seems like a beautiful place to live, or is it? There is all sorts of bad stuff going on, bad monsters, curses, killings, you know, the normal stuff! I'm not sure where the next book is going to take us, but there was something a little weird happen at the end and I'm hoping that is explained. This is not a HUGE action book, but I think it's coming! I can't wait!! Mel ❤️"}, {"Review": "5/3/18 - ON SALE for $2.99:https://amzn.to/2HNCfG34/17/18: Maybe it’s b/c I listened to it—the narrator was fantastic—but Feyre was a lot less irritating this time around. Then there’s the fact that I already knew (view spoiler)[Tamlin is NOT a good guy. (hide spoiler)] I took almost sadistic pleasure in cataloguing all the signs, and, MAN ALIVE, there were a lot of them.And all of that is why I’m raising my original 3.5 star rating to a full 4.0 stars. #idowhatiwant4/16/18: REREAD. B/c finally going to finish #3 in preparation for ACOFAS (which is less than 300 pages, FYI). 😱Reviewed by: Rabid ReadsWhere to begin . . . A COURT OF THORNS AND ROSES was and wasn’t exactly what I was expecting. I knew it was going to be a sort of Beauty and the Beast meets Tamlin mashup . . . but I didn’t really think about what that might mean.When I think of retellings, especially fairy tale retellings, I think of the Brothers Grimm and Hans Christian Anderson. I think of folk stories and mythologies that have no author to speak of, b/c they’re part of an oral tradition that no single person can lay claim to. What I do not think of is Disney. Disney is the end product of a retelling. It’s not whence the retelling came. So . . . in my mind . . . a retelling of anything Disney . . . is a retelling of a retelling. And while the Beauty and the Beast portion of our story wasn't entirely Disney, it was significantly Disney.So here's the deal: I liked this book. I really did, and cumulatively I have zero apprehensions about recommending it to fellow lovers of fantasy and fairy tale retellings . . . BUT. I also had a lot of tiny issues that combined to be less tiny, in addition to an issue that by itself wasn't tiny at all . . . So. Tiny things (the \"she\"s and \"her\"s are b/c we didn't get a name for a long, long time):1. The masks that Tamlin and all the members of his house have stuck to their faces . . . I thought they were both unnecessary and . . . a little bit silly.We're told that they're the result of her lashing out in anger . . . okaaaaay . . . hmm . . . Was there seriously no one else who thought, \"Oh no! Not masks, anything but masks!\"? That's the silly part. The unnecessary part is that Tamlin has a beast form. If she was really concerned about making it more difficult for him to do-the-thing, maybe it's just me, but in a retelling of Beauty and the freaking Beast, wouldn't it make more sense to, oh, I don't know, trap him as a BEAST? 2. As much as it pains me to say it, there was a some redundancy (and this is actually three separate tiny things):In the beginning, if Feyre wasn't trying to escape, b/c, yes, we know, she made a promise, she was blithely walking into traps that the teensiest bit of foresight could have prevented. In the aftermath of her inevitable rescues, her reaction was always some variation of, \"I'm a stupid, insignificant peasant, and I'm even more stupid and peasant-like for forgetting that I'm a stupid, insignificant peasant.\" And I have a lot of sympathy for Feyre, I really do. Not being able to do-the-thing would give me a complex too. But that complex was made an issue too frequently, and the resulting tantrums got tiresome.When Tamlin feels compelled to premeditatedly say, \"Before you start yelling . . .,\" it's a problem.Not-so-tiny thing:Just to be safe, I'm spoiler tagging this. It's not much of a spoiler, but it is a piece of information that isn't revealed until you're well into the book:(view spoiler)[Having fae that can lie is like having vampires that don't drink blood or werewolves that don't change on the full moon.If you don't see the problem with that, then this won't bother you, but guys . . . we're talking about my FAEvorite group of supernaturals. There are reasons I prefer Fae above all others, and one of the biggest is that THEY CANNOT LIE. It's a double-edged sword. On the one hand, if you can force them to speak in a way that leaves no room for misinterpretation, then you can take comfort in the truth. On the other hand, can you ever be absolutely sure you've outwitted a fae?It's tricksy and uncertain and leaves immeasurable room for a clever author to mislead and beguile you, and I LOVE it.And so . . . words cannot express my intractability on the subject of fae being able to lie. (hide spoiler)]So not a perfect book. But I still liked it. If you think beast-form is smelly with poor table manners and masks are an excellent alternative, or that my idea of redundancy is really determination, then you will more than like this book. I can't imagine that many people are as hardcore about FAE as I am, so I'm not even going to pretend that might be an issue for you, and I have no one to blame but myself for going into it with preconceived notions about what it means to be a \"retelling.\" And despite those notions, there was a lot of legitimate Fae lore. Then there's--what for me was--the book's crowning glory: Feyre's relationship with her family. You will be shocked with how everything eventually plays out, and I'm talking about the good kind of shock. The kind of shock that fills you so full of warmth that you're half convinced you glow with it.ALSO no cliffhanger. So. Time to find out for yourself. A COURT OF THORNS AND ROSES is a fantastical (re)retelling of a beloved classic and an older, lesser known folktale from the British Isles, combining both into something completely new. With a tortured hero trying to protect his people from an evil would-be queen, Evil Queen's enforcer whose real intent is as easy to discern as a path back to civilization in a dark, unfamiliar forest, and the girl who shines like a beacon and may just save them all, this is a book that will appeal to a broad demographic. Recommended.My other reviews for this series:\nA Court of Mist and Fury (A Court of Thorns and Roses, #2)\n\nUntitled (A Court of Thorns and Roses, #3)\n"}, {"Review": "Well, I wasn't expecting for this book to hurt like a bitch again, but it did. Even though, I was aware of what was to come, my heart bled for Feyre. Those scenes that took place Under the Mountain were written ridiculously well and massive props to Queen Maas for captivating and writing about Feyre's struggles, internal dialogue and despair like that. I felt every word, every emotion. Despite it being my least favourite in the series, I love this book. I'm utter and complete trash for anything Sarah J Maas. -------------------------------First read: May 2015Second read: May 2016Third read: April 2017Fourth read: February 2018"}, {"Review": "Incredibly rough start. The first chapter is one of the most annoying I've ever read. Despite the compelling subject matter, I really struggled with it, because it was filled with passive and fragmented sentences. In three paragraphs alone, five sentences start with, \"But\". It drove me crazy, and is why it took me three attempts to finally get into this book. BUT(view spoiler)[ see what I did there??? (hide spoiler)] once I did, whoa. Sure, there were some problematic themes, a few over-used tropes, and some lingering issues with the writing (or really, I guess that would be editing), but overall, I REALLY ENJOYED IT. And doesn't that just say everything? Plus, I am such a sucker for a good Beauty & the Beast retelling.Blog | Facebook | Twitter | Instagram | Pinterest"}, {"Review": "Reread May 2026 -- still just as amazing as the first time!Wow. So I expected to at least LIKE this book because it was written by one of my favorite authors... But I never expected to love it. I mean obviously I was hoping it would be awesome, but Sarah J. Maas has already created an incredible series that I'm so in love with, and I can't expect that she would have it in her to create TWO insanely, amazing series. I'm so impressed with her right now... Seriously... Soooo amazing. It's one of those books where now that I've finished it, I just want to go back and start rereading it because I want to stay in this world a little longer (and since the next book won't be out for a while..) I highly, highly recommend this book if you love fantasy. IF I had to choose. The Throne of Glass series is still my favorite I think, but who knows. This is just the first book, and that series has three books out. I can't really decide. I just know both were fantastic... I definitely want to do a full book discussion!!"}, {"Review": "Prepare to see what I felt like during the reading of this book...............................................................\n(The original gif of the fat guy with boobs flopping in slow motion won't load. Thanks GR)This shit reads slowwwwwlyyyyy. Not much happens in the entire first 2/3 of this whole book.You have Feyre who is feeding her dad and her two evil stepsisters. Oh wait, this is Beauty and the Beast not Cinderella. Anyways, her dad is pretty much spineless after losing his money and the two sisters aren't going to stoop to actually feeding themselves so they all three look for the family's youngest to feed them. Feyre. The family is starving so she goes into the dark and scary woods to hunt. She sees a deer! Then a wolf! She kills them both.\nTurns out the wolf is Fae and a big bad guy shows up demanding a life for a life. He takes Feyre to live with him in his lands. He turns from the monster to a fae that has a mask on due to an curse/plague/some shit. I lost interest at this point. I do know you can eat fae food. After all those books that said you can't.\nOf course, there is a curse. I don't want to go spoilery but use your imagination. It is not hard to figure out.\nThen finally we get to some action. Bad evil woman has the land under her spell. Feyre has to save the day by either a riddle or completing three tasks. I like evil woman.\nEvil woman saved the book from a one star just because she was a horny bitch. Yay!"}, {"Review": "4.5 STARS\n\"I love you,\" I said, and stabbed him.\n They say fairytales are forever, endless stories woven with magic. But sometimes, although you hold dear those innocent depictions of love and courage from childhood memories, your mind desires a new outlook on those tales. Case in point, A Court of Thorns and Roses by the ever-brilliant Sarah J. Maas, manages to dress the wonderful key-elements of Beauty and the Beast into a mesmerizing journey with threads of smart originality, enthralling fantasy and quite sexy times. You cannot imagine my frustration that I couldn't read ACoTaR the second it came out (goddamn you, school) but I'm glad I chose not to fragment it into 20 pages reads so I could devour it now in one sitting. It was SO worth it. *happy dance* I'm not going to explain the plot since I'm late to the party anyway, but I will say this: Beauty and the Beast? Check. Badass, funky and incredibly courageous heroine? Check. Lush settings and well-developed world-building? Cheeeeck. Swoon worthy love interest? Double check. Toe-curling, sigh-inducing and heart-breaking romance? Oh, check. Fae, nightmarish creatures and magic? Check check check. I'm telling you, it had everything a good novel should have and then some! It's SJM after all. \nMeet Feyre, local girl that took a turn down poverty lane when her father lost all the family's fortune and that was bound to a deathbed oath made to her mother about protecting said-father and two elder sisters. She's a huntress and one hunt gone wrong had her trapped forever in the Spring Court of Prythian, the magical land of Fae that completes the universe. \nI unconsciously compared her to Celaena and I realized that they're very different. Feyre surprised me by being colder, not in Celaena's calculated way, but simply in her demeanor and perspective of life. I loved the fact that she found sanctuary in art and I also appreciated the clever ideas which she came up with. There were a couple of times when she acted infuriatingly childish that had me rolling my eyes to the moon and back (Great Rite, anyone?) but, besides those rare occasions, she constantly had my respect for her determination, not to mention her courage that speaks for itself through the obstacles she had to battle in order to obtain her happiness. \nLet's talk boys. Tamlin, Rhysand and Lucien. Don't worry, this time there's no \"harem of men\" like in ToG (not that I'm complaining) -- yet -- but the central piece of the whole book is the love unraveling between Feyre and Tamlin. They're cute and sexy as hell, I'll grant them that. Tamlin is quite the charming, protective alpha-male and he'll win you over pretty easily. I loved the stages of their relationship's evolvement, with awkward stages, fights, lust and a sort of hunger for each other that drives them both, but honestly I never felt really invested in their \"love\". I always saw it more like an infatuation. \nWhich brings me to Rhysand -- basically the epitome of my dark-haired, blue-eyes and dangerous fetish who I couldn't help than fall for thanks to his mysterious allure and sarcastic personality. I loved the fact that him and Feyre are in the early stages of a friendship and, maybe, of a future romance. Regardless of that, Rhys is my newest fictional bae and I wanna find out everything about him. I think I found my replacement for The Darkling! *puts wax figure next to those of Dorian, Will, Alexander, Ash* *pets them all* \nAaand here's the problem actually: if Sarah does indeed decide to develop a love triangle in the next installment, the love on which the events in ACoTaR unfolded won't feel as solid as it's supposed to be. I, personally, would feel deceived. Anyway, it would be interesting to see how it would affect the dynamic between Tam and Rhys, not to mention Tam and Feyre, especially if the mating concept is brought to surface. Oh, the horror!\n\"Be glad of your human heart, Feyre. Pity those who don't feel anything at all.\"\nOh, I almost forgot about Lucien! Didn't entirely love him, but I ended up liking him by the end. However, I was glad he offered some humor, because the other characters barely cracked a joke (and I do love humor, thank you very much). \nFew secondary characters grabbed my attention and I hope that will change, but Alis and Nesta proved to be peculiar and surprising pillars to Feyre's strength. Girl power FTW! Also, I'd love to see something happening between Nesta and Lucien. And one more thing -- Levana should be introduced to the high and mighty bitch of ACoTaR, Amarantha. I have a feeling they'd be BFFs. \nAn aspect that was a real winner was the world-building. I was completely enraptured by the Fae's history, customs and lush settings and I seriously hope they will be further exploited in the next books, because they're a golden mine. Another element I appreciated was the closure this volume offered (finally no cliffhanger!!!) and the few loose ends that will probably make up the plotline for the sequel. As for that, my wish for Sarah to continue the retellings trend in the next books is overwhelming, seeing that the Hades and Persephone myth is a true option. Asdfghjkl the possibilities! \nI have to admit that I had my doubts. Some regarding the utterly horrifying possibility of not liking a SJM book, since it was the first book that had no connection with the Throne of Glass series, and others about it simply not reaching my sky-scraping expectations. But rest assured, Mass killed them all with her badass writing and, naturally, ACoTaR became one of my new all time favorites. Sure, it had its flaws and a certain level of predictability here and there, but if those are the only things that stand in front of an enjoyable reading experience, I am able to overlook them. All in all, I consider this book epically good. Not brilliant and definitely nowhere near the sheer complexity and stakes of the Throne of Glass books, but really good nonetheless. Somehow light and gripping at the same time, with a pace that has you both enjoying every word and anticipating the next thrill, ACoTaR was a magical reprieve from the boring reality, mixing classical and well-known features with amazing and unexpected parts. I loved everything about it and now I'm left counting the days till the sequel, because I'm sure this glorious combination of romance and wickedness was just the tip of the iceberg. What's to come is certainly kickass. \nENJOY! <3 "}, {"Review": "I don't mean to offend anyone by this, please don't take it seriously. I'm not using spoiler tag because i haven't read the book (not going to either), i'm just guessing here. So please correct me if i'm wrong about any of this.Oh, yayy, would you look at that! Another book by Sarah J Mass, i wonder what it's about. Surely not about a \"badass\" young girl who falls in love with some jackass, both deny it till the very end. There also can't be any sprinkle of true love or meant to be, or soulmate crap. And there won't be another asshole *cough Rowan* who shows up in the middle of the book, treats our snowflake like shit because secretly he too is in love with her. At the end the snowflake and the jackass breakup for some really dumb reason, that probably doesn't even need to make sense, so Rhys (the asshole) could get with the MC in the next book. They will pretend the first book never even happened, really high chance the snowflake will hate Tamlin (Chaol Westfall) and the asshole will have some really pathetic excuse to be well, an asshole. Sarah might even throw some tortured past and blah blah blah. Oh, don't you worry, if you don't like the asshole or the jackass, there will be a new bitch in the 3rd book, who will be falling head over heels in love with the snowflake. I mean, it's written by Sarah J Mass, so every single man in the story has to be in love with the MC! It's like her only rule. Am i right, or am i right?"}, {"Review": "Edit 05/02 : So. GUYS. A Court of Mist and Fury comes out tomorrow and the drama is starting to give me a headache. I will read this book, even though I do agree and think that Sarah J. Maas feeds us love triangles as if they were cookies. This said, I will not be angry if Tamlin and Feyre split up, because ↓↓↓ (review is self-explanatory). I will not be upset if Rhysand owns the show because ↓↓↓ (again, review self-explanatory). Oh, no. If that happens, I WILL BE HAPPY. I am so very (not) sorry about that. It will probably only last a book anyway XDORIGINAL REVIEW : February 2016In dedication to my friend Chelsea who saw my rating coming a mile away (you know me way too well), here are little lyrics that show pretty well how I feel about this book in the end : You are out of my mind, you aren't seeing my side,You waste all this time trying to get to me,But you are out of my miiiiiiiiiiiiiiiiiiiiiiiiindI'll probably write a real review later, but for now I shall just run through a few of the explanations for my rating : ✘ 0 star for the BLEH - at best - romance between Mr Golden and Mrs Painter who stays at home because DUH, woman's place, you know. \"No, I don't want you to live somewhere else. I want you here, where I can look after you - where I can come home and know you're here, painting and safe.\"Wonderful. Just wonderful. Before you object - I know, I know, he's kind of right at this point but I still resent the author for making her character deserving this kind of destiny. Icing on the cake, we get to savor marvelous thoughts as, \"it was the happiest moment of my life\" when they kiss. I mean, wow. Way to go, masked pup! You naughty boy. Too bad I didn't feel any chemistry between them.\"He was exactly how I dreamed he would be\" - Oh my GOSH, someone tells me where I can puke.✘ 0 star for the absolute lack of any plot before the last quarter (and I'm generous) - except if you count living in a castle as a plot. I do, actually. In Harlequin romances. Which are good enough, I guess, when you actually choose to read them and aren't mislead into thinking that you're reading fantasy. Forget the rules, forget the world, and feel the loooooooooove. Not. ✘ 0 star for implying AGAIN that the only reason women choose to fight is for their families. Look, I love my siblings as much as the next person, but I'm getting so fucking tired to see Katniss pale shadows everywhere. If you don't understand why it annoys me, you wouldn't have get why people were pissed last week when the French President reorganized the ministries and blended family, children's rights and women's rights together. Why not add cleaning and cooking, I wonder. See, I loved Katniss, but the pattern is getting old. What it tells us is that men fight because they're warriors, chiefs, or want power, whereas women only do it because they have to. They don't want power. Nah. If they had a say in this, they'd stay at home. That annoys me. While I personally believe that protecting your family is a great cause - of course - I would very much enjoy to see other patterns being used.✘ 2 stars for Rhysand, because really, he was the only one to wake my interest. What can I say, I'll always prefer cunning to boring instalove. Lucidity to blind puppy love. Wickedness to white knight. If I read the sequel, it will be solely in the hope that somehow Feyre becomes as bad as him. Not that he's that evil. I mean, of course the guy's strikingly beautiful too, because why the fuck not? Harlequin romance, I said! Yet I still owe him my only smiles in this, and his character seems waaaay more appealing than the tamed golden beast. *shrughs*What? They bored me to death with their moonlight fantasies. For more of my reviews, please visit:\n\n\n____________________I love my friends, I swear I do. Tell me what I'm supposed to do with this, though : ... with the perfect equality between 5s and 2s.GAH. The average of doom. I'm not thanking you. Sigh. I need to see it for myself now, needn't I? Oh, well. Let's tackle another book sleeping in my kindle for months."}], "Image": "https://images.gr-assets.com/books/1546406962l/16096824.jpg", "Desc": "Feyre's survival rests upon her ability to hunt and kill – the forest where she lives is a cold, bleak place in the long winter months. So when she spots a deer in the forest being pursued by a wolf, she cannot resist fighting it for the flesh. But to do so, she must kill the predator and killing something so precious comes at a price ...Dragged to a magical kingdom for the murder of a faerie, Feyre discovers that her captor, his face obscured by a jewelled mask, is hiding far more than his piercing green eyes would suggest. Feyre's presence at the court is closely guarded, and as she begins to learn why, her feelings for him turn from hostility to passion and the faerie lands become an even more dangerous place. Feyre must fight to break an ancient curse, or she will lose him forever."}