{"Genre": "Fantasy", "ID": "5", "Name": "Harry Potter and the Prisoner of Azkaban", "Reviews": [{"Review": "re-read in February 2016Harry is getting his sass on. I love it. Re-Read in December 2014 for Harry Christmas to YouOH MAN. THIS BOOK IS SO MY FAVORITE.The phone conversation at the beginning between Ron and Uncle Vernon was PRICELESS. I wish so much that that scene had been in the movie.I was so into reading this book that I failed to take notes, so I don't have many specifics to add except that I love how Crookshanks was basically Sirius's secret agent spy cat friend and I LOVE THAT.Also, this book demonstrated some very REAL aspects of school. For example, Hermione took on too much work, and she gradually started to go crazy (and consequently distanced herself from her friends, became more moody, and then finally just bitch-slapped Malfoy). I also found Oliver Wood to be hilarious in this book for similar reasons: this was his last year at Hogwarts, and he wanted nothing more than to win the Quidditch Cup so he could have some sort of glory at Hogwarts, and he became so consumed by it (as I'm sure lots of people on sports teams do). The way he was so emotionally invested really cracked me up but also felt so real. Side note: CEDRIC IS SO DAMN NICE. when he realized that Harry fell off his broom during the Quidditch game and Hufflepuff won he called for a rematch, which says a lot about him, and it just makes what happens in the next book that much worse.But of course, all of the Marauders stuff made my inner fangirl go nuts because it has to be my favorite Harry Potter storyline. (I mean, I didn't name my YouTube channel after them or anything...)Also time travel."}, {"Review": "I last read this book when I was 14 years old, given that I'm almost 32 now, I have a whole new perspective on it. Despite the fact that I gave this book 5 stars previously, I have to admit that it didn't grow on me until this, my second read. Confession time: I didn't like Remus or Sirius.*Khanh ducks as rotten fruit and eggs are thrown her way*OK, OK, I'M SORRY! I've since changed my mind! Notice that I used the past tense.Obviously, there will be spoilers for the book below, for the 1.5 of you who haven't read this yet.I can't even recall why this book wasn't memorable to me. All I remembered was that Sirius - and what happened to him - was terrible, but he's like meh to me; I just never connected with him as a character. Remus was a werewolf and I've never liked werewolves. The Marauders in general were just a bunch of rowdy teenaged boys, and having been the target for teasing from rowdy, rude teenaged boys in my youth, I just didn't care for the way they were portrayed. And I was right, somewhat, James, et al weren't perfect. They bullied Snape, they were little shitheads. Yes, eventually they became productive, admirable members of society, but I just didn't like them at first.I guess this is one of those books that just takes time to grow on you.This is the last Harry Potter book in which Harry is a child. Before his life - and this series - was visited by the spectre of death. I'm not talking about the long-ago deaths of James and Lily, of course Harry has experienced deaths before, but it was distant. I'm talking about the future deaths where Harry lost people he actually remembered, and respected, and loved. That's what I mean when I say that this is the last book in which Harry is a child, because as hard as his life was until now, he still had his innocence.Children believe that their heroes are unerring. One of the rites of passage to adulthood is the realization that heroes fall, like everyone else.\nHarry stared up into the grave face and felt as though the ground beneath him was falling sharply away. He had grown used to the idea that Dumbledore could solve anything. He had expected Dumbledore to pull some amazing solution out of the air. But no … their last hope was gone.\nI know that everyone loves Sirius, but for some reason, he didn't click for me when I was 14. This time around, I could understand his character more. I could relate to his desperation, his frustration, and the hope that kept him alive all those excruciating years in Azkaban.\n‘I don’t know how I did it,’ he said slowly. ‘I think the only reason I never lost my mind is that I knew I was innocent. That wasn’t a happy thought, so the Dementors couldn’t suck it out of me … but it kept me sane.\nI think for me, it took maturity and the experience of loss and frustration, well, life itself, in order to appreciate the hardship that Harry and Sirius and Remus went through. Previously, this was a magical Cinderella-like tale about a boy in a room under the stairs. With this book, the story became twisted, and it became something more.Read this review and more @ The Book Eaters"}, {"Review": "It's a rainy Sunday. It's colder than it should be this time of the year, so I'm drinking a delicious cup of coffee and I'm browsing my Goodreads shelves only to realise that I haven't written a Harry Potter review. Not a single one. So, I decided to start with the first Harry Potter book I ever read, the one that took me to Hogwarts School of Witchcraft and Wizardry, and made me believe that magic is something tangible.\n\n“I solemnly swear that I am up to no good.” \n\nI was 16 years old, and I had just started my english classes in order to pass my Proficiency examinations. My teacher told me that the best way to delve into a foreign language and familiarize with it is to read books written in it, so she gave me the third instalment of Harry Potter. (Little did she know that she unleashed a beast who now reads almost exclusively in english). Before I tell you about my experience, I need to make a confession. It was my choice to stay away from J.K. Rowling's books until that moment. I wanted to swim against the current, and I thought that Harry Potter was too \"mainstream\" for my taste. And the foolish little me was proud of this decision. But when my teacher gave me this old, used copy, something inside me cracked. I knew the basics about the story, about the orphan kid who goes to a school for wizards and fights the ugly, evil dude who doesn't have a nose. But page by page, I came to understand with awe that the wizard who finds trouble even when he doesn't want to offers more than that; he opened a portal to a world where I longed to be fervently. I stayed up late at night, with a faint light just enough to make out the sentences, and I cheered for Gryffindor's Quidditch team, I flied with Firebolt and I kept wondering what my patronus would be (according to Pottermore it's a brown mastiff, which is oddly fitting). I casted spells (but never Avada Kedavra, you shouldn't play with this shit) and tasted butterbeer in Hogsmeade, and just like that, my life had changed irrevocably. I was a Potterhead. And I was proud of that. (my mum wasn't though, especially when I asked for a wand).\n\n“Happiness can be found, even in the darkest of times, if one only remembers to turn on the light.”\n\nThere is a reason why J.K. Rowling is the fairy god-mother to millions of children (and adults) worldwide. Friendship, love, hope, they're present in her books even in the most desperate times, when Evil seems undefeatable, when no escape is visible. She encourages and empowers, shows that everything is possible, that strength and courage can be found within, when you have someone to hold your hand. Harry was a kid who was deprived of love yet he was capable of loving, it took him years but he finally found a place to belong, to feel safe and cared. Ron, with his witty lines and his constant presence, Hermione, my personal favorite, with her intelligence and compassion, they managed to enchant my prejudiced heart, and even now, years later, I'm still under their spell. I think I will always be.\n\n“Don't let the muggles get you down.”\n\nI'm still waiting for my Hogwarts letter, and secretly hope that Dobby is the one to blame. I still caress with affection the spines of my Harry Potter books (meanwhile I bought them all and finished the entire series in a week and a half) and laugh at Harry Potter jokes. And I know, and it's imprinted in my soul, that I'll never be a muggle again."}, {"Review": "ENGLISH (Harry Potter and the Prisoner of Azkaban) / ITALIANO«Harry Potter was a highly unusual boy in many ways.For one thing, he hated the summer holidays more than any other time of year. For another, he really wanted to do his homework but was forced to do it in secret, in the dead of night. And he also happened to be a wizard»Sirius Black's escape from Azkaban prison is on every wizard's lips. Not even the dreaded guards of the prison, the Dementors, managed to keep in a cage the wicked wizard, who probably want to meet again his master, Voldemort. But to do that, firstly he must kill Harry Potter, the only one capable to stand up to Voldemort... Meanwhile, the new school year is about to start at Hogwarts School of Witchcraft and Wizardry, and Harry, Ron and hermione will become acquainted with two new professors...Compared to the previous, the third volume of the series is the one that is richer in twists and turns. I'm reading the saga of Harry Potter to my daughter, when in the evening she goes to bed, and in this \"Harry Potter and the Prisoner of Azkaban\" a little tragedy happened. When we got to \"The kiss of the dementor\" chapter, just hearing the title my daughter (6 years old) was so upset by what it might happen that she required that I read that chapter alone, and just then telling her what was going on by omitting the scary details. Apart from this hiccup, the reading was neat and clean. It is evident that the playful and carefree tones of the first two adventures give way to dark colors. After all harry is growing up, and its way of seeing things is supposed to change as well. Rowling takes us in the maturation process of the most famous little wizard of the world using the same plot device of the previous volumes: the teachings of Headmaster Dumbledore, the clashes with Malfoy, the bickering with Hermione, the conflicts with Professor Snape. I do not know if in the near future I will continue to read to my daughter the Harry Potter saga, or if I will wait she grows enough to read it alone to avoid upsetting her again. Never mind. I will go on because now it is not possible for me to stop reading, with the pleasant awareness that there is no healthier addiction of this one. \"Get high\" yourself too.Vote: 10\n«Harry Potter era un ragazzo insolito sotto molti punti di vista. Prima di tutto, odiava le vacanze estive più di qualunque altro periodo dell'anno. Poi voleva davvero fare i compiti, ma era costretto a studiare di nascosto, nel cuore della notte. E per giunta era un mago»La fuga di Sirius Black dalla prigione di Azkaban è sulla bocca di tutti i maghi. Nemmeno i temuti guardiani del carcere, i Dissennatori, sono riusciti a tenere in gabbia il malvagio stregone, che si dice voglia riunirsi al suo padrone, Voldemort. Per farlo però dovrà prima eliminare Harry Potter, l'unico che fino ad ora è stato in grado di tenere testa a Voldemort... Nel frattempo, alla scuola di magia e stregoneria di Hogwarts sta per cominciare il nuovo anno scolastico, ed Harry, Ron ed Hermione faranno la conoscenza di due nuovi professori...Rispetto ai due precedenti, il terzo volume della serie è quello più ricco di colpi di scena, e di conseguenza quello con il ritmo più serrato. Sto leggendo la saga di Harry Potter a mia figlia quando la sera va a letto, ed in questo \"Harry Potter e il Prigioniero di Azkaban\" è successa una piccola tragedia. Arrivati al capitolo \"il bacio del dissennatore\", al solo sentire il titolo mia figlia (6 anni) è rimasta così turbata da quello che sarebbe potuto accadere che ha preteso che lo leggessi io da solo, e che le raccontassi quello che succedeva omettendo i particolari spaventosi. A parte questo intoppo, la lettura è continuata liscia. E' evidente che i toni giocosi e spensierati delle prime due avventure lasciano il posto a sfumature a tratti cupe e goticheggianti. D'altronde Harry sta crescendo, e si suppone che cambi anche il suo modo di vedere le cose. La Rowling ci accompagna nel processo di maturazione del maghetto più famoso del mondo utilizzando gli stessi espedienti narrativi usati negli altri volumi: gli insegnamenti di Silente, gli scontri con Malfoy, i battibecchi con Hermione, i conflitti con Piton. Non so se nell'immediato futuro continuerò a leggere a mia figlia la saga di Harry Potter, o se aspetterò che cresca abbastanza da essere in grado di leggerseli da sola per evitare adesso di turbarla. Non importa. Io andrò avanti perchè per me non è più possibile fermarmi, con la piacevole consapevolezza che non esiste dipendenza più salutare di questa. \"Drogatevi\" anche voi.Voto: 10"}, {"Review": "I'm just going to add a few gifs and pictures from my book. Harry Potter books will always be 5 star no matter how many times they are read. (Hermione forever!)I fell in love with S. Black in this book and I never looked back.I'm going to add some pictures from my book, although now, I wish I would have added more but it is what it is. . . maybe later I love these big illustrated coffee table editions of the books. It makes re-reading them an extremely fun experience. I just wish she would put them all out at once. I know, I know... I'm ready for the next though. Happy Reading! Mel ♥MY BLOG: Melissa Martin's Reading List"}, {"Review": "“Happiness can be found, even in the darkest of times, if one only remembers to turn on the light.”When I finished Harry Potter and the Prisoner of Azkaban for the first time, it immediately became my next favourite book. J. K. Rowling outdid herself, and wrote something even bigger and better than before. And she'll keep doing it for another 4 books.There's just nothing to criticise about book 3. Compared to the other books there's not a single scene that makes me uncomfortable, that I'd prefer to skip rather than experience it again. I particularly admire Hermione, our favourite genius witch. Keeping all those immense secrets, kicking butt, being the best student of her age, suffering Ron's sideswipes and punching Malfoy in the face can't ever be beaten. Hermione seriously managed her mischief.Find more of my books on Instagram"}, {"Review": "Since pretty much everyone I know has read these books, I figure reviewing them is pretty pointless. But with the new book coming out in a couple of weeks, I have to go through them beginning to end. To make the reviews more entertaining, I will be doing them in a variety of unexpected formats. For this review, I will be writing as Crookshanks fan fiction.Crookshanks swished his tail back and forth as he crept up the stairs to the boys' bedrooms. He knew the rat wasn't what it was pretending to be, but all of his attempts to alert the humans to this fact had failed. \"I don't know why I even bother,\" he muttered to himself. \"I could get along fine without any of them. Let the rat do whatever it is it's trying to do. So long as Girl keeps feeding me and scratching my belly, I'll - hello, what's this?\"He could smell the rat. Its scent was like nothing Crookshanks had ever smelled, and for all his time living in a magical pet shop, he'd smelled a lot. The rat did smell like a rat, yes, but there was also something else. Something... human. It was just like that big black dog he'd met on the grounds the other day. Every instinct in him had screamed to run away, but there was that smell. And even Crookshanks knew what they said about cats and curiosity. The dog had turned out to be more than just a dog, and it had convinced Crookshanks to help it. First order of business: retrieve a certain rat from the bedroom of the Red-Haired Boy.The Boy wasn't in, but the rat was. Crookshanks circled the bed a few times. This time, maybe, he would be able to get the damn thing. He tensed for a moment and then leapt onto the bed.By luck or skill, he was nearly on top of the thing when he landed. \"A-HA!\" he yowled. \"Gotcha!\" He pinned the rat under his sizable paw. \"Where you gonna run to now, ratty?\" he asked, sneering as best he could.The rat writhed in his grip. \"Please,\" it said. \"Just let me go. You don't know what will happen if you eat me, it would be a terrible mistake!\"\"A mistake, eh?\" the cat said. \"We'll see about that. I have a great big doggie friend who's just aching to get his jaws around you....\"He barely had time to finish his sentence when the rat went mad. It squealed and bit and slashed with its paws. And then, against all of Crookshanks' previous experience - it grew! It nearly threw the cat off the bed as it became much more massive - its legs lengthened and its arms stretched until it had reached a human size and shape. Crookshanks goggled. Of all the things he'd expected from this rat, this wasn't it. The human grabbed at him, but Crookshanks was too fast. He jumped off the bed and shimmied under the wardrobe, where he could see but not be seen.The human looked around, breathing heavily. He was pale and thin, and still looked ratty. \"Think, Peter, think,\" he said. \"Gotta get out of here, but...\" He stopped, glanced at the wardrobe, and grimaced. \"You may just have given me my way out, cat,\" he said. And then he bit the ball of his hand.Blood dripped out, leaving spreading red blotches on the sheets. \"They'll think it was you,\" he said. \"They'll leave me for dead and I'll be free to rejoin my Lord.\" He looked at the recently repaired curtains on Ron's bed. \"It's not safe here anymore.\" He sucked at the wound to stop the bloodflow and then went to the window. Perched on the windowsill, he looked over at Crookshanks' hiding place. \"If I were human,\" he said, \"the fall would kill me. But as a rat....\" His body rippled and twisted and shrank, and then there was an old grey rat on the sill. Crookshanks was pretty sure it winked at him before leaping off.After a minute or two, Crookshanks wriggled out from under the wardrobe, his thoughts dark. The Red-Haired Boy was going to be angry, and so was the Girl. But more importantly, the Dog was going to be furious. It was barely holding on to its sanity as it was. Crookshanks shook his head. This was going to get worse before it would get better..."}, {"Review": "This is my favourite book in the Harry Potter series! It marks a distinct change in tone and a maturation of the writing. As the characters grew older, the challenges they faced became more dark and intense. The plot became murkier especially in regard to Sirius and his involvement (or lack thereof) in the murders of Potter’s parents. It all just got so much better. I think this is a large part of Rowling’s success. She could have fell into a trap and continuously wrote books like the first two, but instead she moved her story forward and let it grow. And her readers rejoice. This is also the first time the real threat to Harry is realised. Sure, we’ve seen Voldemort on the back of Professor Quirrel’s head and we saw an early Tom Riddle in the form of Horcorux diary type thing, but the dementors were an entirely different level of danger. The entire story felt less comic and less feel-good, for the first time it seemed like Harry Potter could actually die if he didn’t find his courage and repel them with his power. He owed much to Lupin here, a character who becomes slightly overlooked as the series progresses, but a hugely pivotal one in the development of Harry. And, for me, that’s why this one is the best because eit is the one where Harry truly found his confidence. "}, {"Review": "Okay, I will admit it here, publicly, for the very first time: I've got a mad crush on Remus Lupin.How could I not have fallen hard for a man who, by day, has the vibe of a young Pablo Neruda, and by night strips down naked and takes on werewolf form? I mean, can you imagine having sex with this man?Well, I have. Several times. And, as a woman who read the entire Harry Potter series as an adult, rather than a child, I could not get over my joy when the series shifted from the wonderful, but somewhat saccharine, child-like storytelling in books 1 and 2 and took on a more mature feel.Please, don't get me wrong. I love the first two books in this series, but I love them for their magical quality, their appeal to children, and their overall introduction to this world.But The Prisoner of Azkaban, at least for me, marks the shift into adolescence and the less tidy endings.And, of course, the introduction of Sirius Black and Remus Lupin to the plot.I loved rereading this third book the past two weeks with my middle child, and I can not get over this new set of the illustrated series by Jim Kay. I mean. . . I'm not sure I can imagine a reading experience more sublime. Can you?My two absolute highlights from this novel are:When Remus Lupin turns to Hermione Granger and says, “You're the cleverest witch of your age I've ever met, Hermione.” It's a shift from everyone poking fun of Hermione for being a teacher's pet or a “nerd” and acknowledging her as a force to be reckoned with.And Jim Kay's illustration of Harry summoning his first real Patronus. . . my God, I turned the page, and goosebumps ran down the entire length of my body. Then I cried like a child. My daughter, who was sitting next to me, wasn't exactly surprised (she's been around for the last two years of this horror called perimenopause), but she was like, “Mom, pull it together.”I couldn't help it. Damn it, I think I'd run back into a burning building to grab this book.Remus!"}, {"Review": "Le sigh, so magical.So Buckbeak. So Hermione is a badass. FAVORITE moment in ever, people. But I digress. I've said it in both my reviews for the first and second HP books, but I'll say it again here...In fact, lemme just copy/paste what I said in review #1 to save us all some time (typing for me and possible link clicking for you):I have a confession to make. ***I have never read Harry Potter. Yes, yes, I know...this is akin to reader sacrilege.But I just had no interest in these books when they came out. I was too busy reading about men in kilts fucking the milkmaid. Therefore, my only experience with \"Hermione\" is the SNL skit where Lindsey Lohan shows Harry and that other scarfed dude her ginormous tatas. Well, what with everyone going ape shit over the newest installment, I figure I should probably find out what all this Hogwart's business is about. And since my friend's 9 year old demanded that I read his copy, I now have the paperback in my possession.I also never saw any of the movies when they came out and I have been watching them now only once I polish of the corresponding book. But, anyway, there you have it. Yes, this is my first time reading through the HP series, and no I'm not just claiming that to get attention. As you all know, I could give a fuck. But again, I digress. I absolutely see why these books are so loved and I am looking forward to the next one, brick that it is."}, {"Review": "عندما بدأت هذا الجزء كنت متخوفا من أن اجد أحداث مشابهة للجزئين السابقين..ولكني كنت مخطئاكلب اسود غريب يظهر لهاري وحده يسبب له الفزع، إنه نذير الشؤميبدأ هاري عامه الدراسي بأغرب الاحداث..ويقابله وزير السحر ويقدم إستثناء خاص لهاري غير متوقعمجرم وقاتل هارب من ازبكان..له ماض سئ مع عائله هاري بوتر..ينجح في التسلل للمدرسة ويسبب فزعا كبيرالم يستطع احد الامساك به برغم حراسة المدرسة بحراس أفظع من المجرمين نفسهم..يبثون الرعب في التلاميذ..بالاخص هاريمدرس الدفاع ضد السحر الأسود هذه المرة هو الأفضل..إلا إنه يختفي ويظهر في ظروف غامضة،وسناب يأخذ مكانه إحتياطيا..وإيضا يتصرف بغرابةهيرموني تشتري قط جديد..يتصرف بغرابة، ورون يكرهه خوفا علي فأره الذي يختفي...هيرموني نفسها تتصرف بغرابة هدية مميزة لهاري مجهولة المصدر..عرافة المدرسة تتنبأ بموت هاري بوتر الوشيك بسبب نذير الشؤمبيت مسكون..عواء الذئاب..هاجريد ينتظر حكم الاعدام لحيوانه المفضل بسبب مالفوياشخاص ميتون يظهرون في خريطة المدرسة كأنهم يتجولون في ردهاتها الأن..ولكن لا يمكن تتبعهم او رؤيتهممــجـرم هارب وحــراس رهيــبة عــــرافة ونــبوءة ونـذير شـؤمكـــــلــب، قـــــط وفـــــأرشيئا رهيبا بحق علي وشك الحدوثعندما قرأت الجزء الثاني –بعد ان كنت شاهدت الجزئين كفيلم سينمائي- شعرت ان \"وماذا بعد؟\" هل سندور في نفس الدائرة؟ندخل المدرسة...روح فولدمورت..نقضي عليها..مدرس الدفاع ضد السحر الأسود نتخلص منه بشكل او باخرتوقعت ان يكون الامر مملا لاحقا..بالرغم من اعجابي الشديد بالعالم والشخصيات الا ان حبكه الجزء الثاني –خاصا قبل معرفه سر الهوركروكس في الجزء السادس- كنت اشعر بخيوط رفيعه متشابهه في تسلسل الاحداث ونهايتهاليجئ الجزء الثالث اكبر,عمق اكثر للشخصيات..نظره اعمق لعالم السحر المخفي بين طيات عالمنا والاهم..احداث وحبكه مختلفه واقوي في تصاعدها وغرابتها وغموضها وحتي \"الرعب\" فيها عن الجزئين السابقين مجتمعينوفعلا اشعر ان الفصول الاخيره كانت بها كميه احداث تقلب مسار الروايه بالاخص\"كلب وقط وفأر\"وتتأكد فعلا ان جي كي رولينج بجعبتها الكثير لتقدمهبصعوبه شديده تحاملت علي نفسي لتقسيم قراءه الروايه علي 3 اجزاء وكنت احترق شوقا لمعرفه ما سيحدث بعد ذلك, وكيف ستكون الاجزاء القادمهالروايه اعمق بكثير جدا جدا من الفيلم وهذا احبطني..التغيير في \"نغمه\"الفيلم من الجزء الثالث بالمقارنه بين اول جزئين له مزايا وعيوب الا ان عيبه الرئيسي بالنسبه لي هو اختصار اجزاء من الروايه ,ربما لانها كانت اول مره اكون قد قرأت الروايه قبل الفيلم ولكني فعلا ارشح مشاهده الجزء الاول \"وربما الثاني\" قبل البدء في القراءه ثم قراءه السلسله كامله قبل مشاهده باقي الافلاممحمد العربي"}, {"Review": "Harry Potter for me is like warm apple pie and vanilla ice cream. It is the ultimate comfort read. This must have been at least the 10th time I've read it but I have lost track. The theme I can take out of this particular book especially after reading it all these times is hope. Harry largely naive for most of the first three books, meets Sirius for the first time and his world changes. For ever so briefly he thinks he can leave the Dursleys for good and live entirely in the wizarding world. Of course, we know what happens next ;). The last 100 pages of this book for me are my favorite 100 pages of the series aside maybe from the end of Deathly Hallows, especially because (in my opinion) I feel the movie most closely resembles the book. This is usually the time of year when I reread the septology, and I am looking forward to feeling magical again as though it's my first time reading these books. Like that slice of warm apple pie, I am comforted knowing that for a few hours I can enter Harry's world. "}, {"Review": "OKAY. This book was fantastic! I can't get over how everything just fell into place perfectly. Prisoner of Azkaban is my favorite of the series so far which is actually a surprise since Harry Potter and the Prisoner of Azkaban was my least favorite movie growing up.But reading and watching the movie truly is a different experience. Even though I've seen the movies repeatedly year after year, I was still on my toes while I was turning the pages of my book. It was like I was seeing all of this for the first time!I've really developed a deeper love, respect, and understanding for this series and the Wizarding world. I especially loved the fact that we actually got to learn about Remus Lupin and his backstory as a werewolf. I never would've learned any of this if I never decided to pick up these books.This series just gets better and better, and darker and darker. I can slowly see how Harry Potter is moving away from middle grade and into young adult. I'm really looking forward to how that shift becomes more prominent in the later books. Now next up is Harry Potter and the Goblet of Fire, which is my favorite movie of the series growing up! Let's see how this one will go!"}, {"Review": "I guess you can tell from my rating that this wasn't my all-time favorite HP installment, but I still thoroughly enjoyed it. I remember thinking that the movie was about a 3/5 star rating for me when I first saw it, but now that I've experienced the novel version, I can see how the ending in the book is so much more detailed and excellent than how they chose to portray the ending in the movie. Obviously I live for any appearance of the Weasley twins, and I was so excited to get to the book that features the marauder's map. \"I solemnly swear that I am up to no good!\" Another fun read and another step closer to making my way through the series for the first time. I'm really interested to get to The Goblet Of Fire, as it's my favorite movie in the series! Suspenseful Clues and Thrilling Reviews August Prompt-Banned Books (BR with Sam @CluesandReviews)"}, {"Review": "“Happiness can be found, even in the darkest of times, if one only remembers to turn on the light.”Third buddy read with my OTPMy god, this was gooooooooooood!. Up until now I’ve definitely enjoyed the books, but this had a darker side to the story which I really really enjoyed. I loved the fact that we got SO much more in this book. We find out more about James Potter along with; Lupin, Serius and Peter while at the school and the Marauder’s Map GIRL I LOVE IT.We get to see lots of magical aspects in this book, and learning about the Patronous, then well see Harry, Ron and Hermione grow as characters. We see mini breakdowns with Hermione, but I think it made her so likeable and human. The boggart and exams. I have serious serious love for Lupin. His whole back story literally had me sold. He is by far the best Defence Against the Dark Arts teacher! I need more Lupin and Serius PLEASE.What I liked?- The books fighting with each other in the cages, I mean how much more mythical do you need?- I’m sorry… but this book made me realise how much of a crazy cat lady I am… Crookshanks is by far my favourite animal! How smart?! And the bouncing around together, stealing certain things, screaming- I think things were so well put together and placed… it had me living!- Draco dressing up as a Dementor for the Quidditch, I can’t, it’s making me laugh just thinking about it again - In fact, Quidditch in general. It was so well done and built up, it had me on edge thinking what’s going to happen?! It was built up so well and the descriptions used made me feel like I was there watching it play out (not only that, but top commentary) -I’ve been moaning that the end section seems to happen so quickly… but this? FINALLY I got what I wanted!- Hagrid has my heart!What I didn’t like?- You know… I’m not really a fan of Snape, I just don’t understand why he acts like he does to Harry for something that James did?Overall… well, hmmm… bring on Harry Potter and the Goblet of Fire.Philosopher's Stone 4.5 StarsChamber of Secrets - 4 StarsPrisoner of Azkaban - 5 StarsGoblet of Fire - 4.5 StarsOrder of the Phoenix - 4.5 Stars"}, {"Review": "Harry Potter and the Prisoner of Azkaban (Harry Potter, #3), J.K. RowlingHarry Potter and the Prisoner of Azkaban is a fantasy novel written by British author J. K. Rowling and the third in the Harry Potter series. Harry Potter and the Prisoner of Azkaban was released in hardcover in the UK on 8 July 1999 and in the US on 8 September. The British paperback edition was released on 1 April 2000, while the US paperback was released 2 October 2001. The book follows Harry Potter, a young wizard, in his third year at Hogwarts School of Witchcraft and Wizardry. Along with friends Ronald Weasley and Hermione Granger, Harry investigates Sirius Black, an escaped prisoner from Azkaban who they believe is one of Lord Voldemort's old allies.تاریخ نخستین خوانش: در ماه نوامبر سال 2001 میلادی عنوان: هری پاتر و زندانی آزکابان - کتاب سوم؛ نویسنده: جی.کی. رولینگ؛ مترجم: ویدا اسلامیه؛ تهران، کتابسرای تندیس؛ 1379؛ در 496 ص؛ چاپ بیست و جهارم 1392؛ شابک: 9789645757012؛ موضوع: داستانهای خیال انگیز نویسندگان انگلیسی - قرن 20 مهری پاتر و زندانی آزکابان کتاب سوم از مجموعه رمان‌های هری پاتر، اثر جی.کی. رولینگ است. پس از اینکه عمه مارج وارد خانهٔ خاله ی هری پاتر می‌شود، با هری درگیری پیدا می‌کند، و هری ناخواسته باعث رخداد ناخوش‌آیندی می‌شود: عمه مارج باد شده و همانند بادکنکی به هوا می‌رود. هری از  اخظار و هشدار برای آنها که میخواهند کتاب یا فیلم را داغ داغ بخوانند و تماشا کنند، بهتر است ادامه ریویو را نخوانید. خانه فرار می‌کند، و منتظر اظهارنامه ی وزارت جادو می‌شود، زیرا انجام جادو برای افراد زیر هفده سال ممنوع است، و هری تنها سیزده سال سن دارد. اما او سرانجام می‌فهمد که سیریوس بلک، کسی بوده که پدر و مادرش را به ولدمورت فروخته؛ و اکنون از زندان فرار کرده، و حالا دنبال اوست و به همین دلیل وزارت برای او حکم اخراج نمی‌فرستد، تا بتواند در مدرسه هاگوارتز در امان باشد. هری همواره باید مواظب باشد تا مورد حمله ی سیریوس بلک قرار نگیرد. اما در پایان مشخص می‌شود که سیریوس بلک پدر خوانده ی اوست، و دوست صمیمی پدرش بوده و کسی که پدرش را به ولدمورت لو داده: پیتر پتی‌گرو بوده؛ که خود را به شکل موشی درآورده بوده؛ که همان موش از قضا موش خانگی رون ویزلی، بهترین دوست هری بوده‌ است. اما درست وقتی که همه چیز درست می‌شود، و سیریوس موش را به شکل عادی برمی‌گرداند، و همه امیدوار می‌شوند اعتراف او بی گناهی سیریوس را ثابت کند. اما همه چیز نقش بر آب شده، و پیتر پتی‌گرو باز هم فرار می‌کند. پس از اینکه سیریوس دوباره زندانی می‌شود؛ هری و هرمیون گرنجر، دوست صمیمی هری، به گذشته بازگشته، سیریوس را نجات می‌دهند. همچنین هری با موجوداتی به نام دیوانه‌ ساز مبارزه می‌کند. در نهایت سیریوس بلک به کمک ساعت زمان هرمیون گرینجر فرار میکند، و هری به مدرسه باز می‌گردد. آنگاه که این کتاب منتشر شد: تنها در آمریکا بیش از پنج میلیون جلد گالینگور، و میلیونها نسخه با جلد شمیز، به فروش رفت. والدین آمریکایی، با حیرت به خبرنگارها میگفتند: فرزندان آنها بازیهای کامپیوتری را کنار گذاشته، و کتابخوان شده اند. یادم میآید یک هفته نامه نوشته بود، هری پسرک دوازده ساله، ظرف کمتر از دو سه سال، رویاهای بسیاری از کودکان دنیا را تسخیر کرده است. ا. شربیاتی"}], "Image": "https://images.gr-assets.com/books/1499277281l/5.jpg", "Desc": "Harry Potter's third year at Hogwarts is full of new dangers. A convicted murderer, Sirius Black, has broken out of Azkaban prison, and it seems he's after Harry. Now Hogwarts is being patrolled by the dementors, the Azkaban guards who are hunting Sirius. But Harry can't imagine that Sirius or, for that matter, the evil Lord Voldemort could be more frightening than the dementors themselves, who have the terrible power to fill anyone they come across with aching loneliness and despair. Meanwhile, life continues as usual at Hogwarts. A top-of-the-line broom takes Harry's success at Quidditch, the sport of the Wizarding world, to new heights. A cute fourth-year student catches his eye. And he becomes close with the new Defense of the Dark Arts teacher, who was a childhood friend of his father. Yet despite the relative safety of life at Hogwarts and the best efforts of the dementors, the threat of Sirius Black grows ever closer. But if Harry has learned anything from his education in wizardry, it is that things are often not what they seem. Tragic revelations, heartwarming surprises, and high-stakes magical adventures await the boy wizard in this funny and poignant third installment of the beloved series.--scholastic.com"}