{"Genre": "Fantasy", "ID": "6", "Name": "Harry Potter and the Goblet of Fire", "Reviews": [{"Review": "This was the beginning of my addiction to POTter. I had previously experimented with and enjoyed POTter on 3 different occasions, but could easily have walked away and never touched the stuff again. Then, under some pressure from some POTterHEAD peers of mine, I tried the newest blend called the Goblet...and everything changed. As the warm, easy, potato chip prose crossed my blood-brain barrier, euphoria ensued. My inner child was smitten. I...was...hooked and I...was...happy. Ignore the so-called \"experts\" who say POTter is brain cell killing pap. Don’t listen to those jaded, book snobby squares. Most of them are wound so tight they wouldn’t know a good book if it sat on their face and wriggled. POTter makes you feel good. POTter makes you smile. POTter makes you joyous and giggly. Hell, POTter makes you want to use the word giggly. POTter is enjoyable and fun. That's enough for me. So what made  the Goblet so much more addicting than the rest of the POTter I had tried. Part of it was that I had already seen the movies (up through Order of the Phoenix) before I got my hands on genuine POTter. The first 3 were fun but I felt like I had already \"been there done that\" as they were pretty faithfully adaptated for the screen. Still enjoyable, but not enough to put the POTter monkey on my back. Then came the Goblet of POTter and it was a big, huge, tightly-rolled fatty at 750 pages. The cut, diluted movie strain couldn’t hope to be as potent as the primo original and the story was finally given the room to breathe and take on an epic feel. It was completely addictive. The world-building details started coming fast and furious and the characters were given considerably increased depth. Add that to Rowling’s breezy, “ear friendly” prose and I found myself spaced out for hours turning the pages and still hungering for more. It’s high praise indeed when I say that 750 pages did not contain a single dull, ploddy moment. This was fun and wonderful and a pleasure to experience. It deserves to be recognized for the iconic work that it is in the realm of YA fantasy. Is it popcorn? Certainly. Is it a joy to read? Definitely. Is it one I HIGHLY RECOMMEND to all lovers of feel good, comfort food? YES. 5.0 stars. Winner: Hugo Award for Best Science Fiction Novel (2001) Nominee: Locus Award for Best Fantasy Novel (2001) Nominee: Bram Stoker Award (YA) for Best Novel (2001)"}, {"Review": " Re-Read in December 2014 for Harry Christmas To You SO I HAVE A FEW NOTES ON THIS ONE:-at the beginning, Voldemort says to Wormtail, \"I will allow you to perform an essential task for me, one that many of my followers would give their right hands to perform...\" OMG J.K. ROWLING FORESHADOWS EVERYTHINGGGG-when the Weasley men come to Privet Drive through the Dursleys' fireplace is just.... priceless. Yet ANOTHER scene that I wish had made it into the movie.-We get to meet Bill in this book (way earlier than in the movies, I might add), and Mrs. Weasley is very disapproving of how Bill looks. I love that Bill stood up for himself and was like NOBODY GIVE AN F HOW I LOOK, AND NEITHER DO IIIIII. It was a nice thing to throw in there.-Dobby is also in this book more, and seeing how different he is was really fun.-Harry and Ron fighting made my heart hurt so much.-All of the drama at the Yule Ball just made me SQUEEE because it's so obvious that Ron and Hermione like each other and they just don't want to admit it and GAH. THE FEELS.-I also love how much Hermione stands up for what she believes in, which you can particularly see in this book. She wants justice for the house-elves, she won't let Ron get away with being an idiot (like when he says he just wants a pretty girl to go to the ball with), and she is especially confident in this book as well. Malfoy and many other people are constantly teasing her, but she is completely above it, and for that I admire her.-WHEN HARRY IS LISTENING TO HAGRID AND MADAME MAXIME AND HE SEES THE BEETLE? IMAGINE IF HE HAD JUST STEPPED ON IT? WOULDN'T THAT HAVE BEEN GREAT?-I completely forgot about the part where Harry sees Barty Crouch on the Marauders Map! He was so close to finding out something big, but then things got crazy and he didn't, but WHOA. SO CLOSE. -Cedric's death hit me a lot harder than it ever has before... He was such an amazing person, and I wish that he could have survived so him and Harry could have been buddies.-VOLDEMORT FORESHADOWS HORCRUXES IN THIS BOOK. TWO MORE BOOKS UNTIL HARRY ACTUALLY LEARNS THOUGH.ok so I think it's safe to say that this is one of my favorites in the series for sure. Probably in the top 3. "}, {"Review": "“Differences of habit and language are nothing at all if our aims are identical and our hearts are open.”There are so many chapters and characters and details that make this book special. Here are some of my favourites:1. S.P.E.W.2. Hermione in every scene ever3. The house elves and the kitchen scenes (I'm honestly so in love with the kitchens. Every time they tickle the pear in the portrait I get all excited)4. Durmstrang and Beauxbatons5. The Yule Ball and the fact that Harry thinks Hermione is a girl he's never seen before6. The fact that Ron has a huge crush on Krum while Hermione stays utterly unimpressed and as soon as Krum takes her to the ball the situation changes, Hermione likes Krum and Ron rips him (well, miniature him) apart7. Harry's fight with Ron. Not because I enjoy them fighting but because Jo perfectly captures the feeling of anger and frustration that I have everytime I'm in a similiar situation.8. The Wonky Feint. I'm still laughing.9. Rita Skeeter's reports. I love to hate her.10. Severus Snape cold bloodedly claiming he can't see a difference when Hermione's teeth are half a metre longer than usual. This incredible man.11. Molly Weasley being such a good mom to Harry. Got tears in my eyes just thinking about it.12. Hermione's triumph over a vicious beetle.Still, the book is not my favourite in the series, the reason being the horrible graveyard scene in the end. It's just a little too much to take for my poor Potter heart.Find more of my books on Instagram"}, {"Review": "English (Harry Potter and the Goblet of Fire) / Italiano«The villagers of Little Hangleton still called it “the Riddle House”, even though it had been many years since the Riddle family had lived there»Maybe this time I was out of line with the bedtime reading to my daughter, not so much for the size of the book, but for its darker content compared to the previous ones. Towards the end of this fourth book in the Harry Potter series, my little girl had difficulty falling asleep. I had to defuse the situation.The Quidditch World Cup is coming, and Harry, Ron and Hermione have the chance to watch the final round, before the start of the new school year. This time problems start even earlier than the end of the summer vacation, far from the walls of Hogwarts... Many pages, many events, the new Defense Against the Dark Arts teacher, the Triwizard Tournament, the tasks to face. There is always something to understand, some mystery to unveil. Great food for our \"potterian\" curiosity. But be warned, Dumbledore warns us:«Curiosity is not a sin. But we should exercise caution with our curiosity...»Caution... easy to say!Vote: 9«Gli abitanti di Little Hangleton la chiamavano ancora Casa Riddle, anche se erano passati tanti anni da quando i Riddle ci abitavano»Forse stavolta ho esagerato con la lettura serale per mia figlia. Non tanto per la mole, quanto per il contenuto, più cupo dei precedenti. Verso la fine di questo quarto libro della serie, la mia bambina aveva difficoltà ad addormentarsi. Ho dovuto sdrammatizzare non poco.La Coppa del Mondo di Quidditch è alle porte, ed Harry, Ron ed Hermione hanno la possibilità di vedere dal vivo la finale, prima dell'inizio del nuovo anno scolastico. Questa volta i problemi si presentano ancor prima della fine delle vacanze estive, lontano dalle mura di Hogwarts... Pagine dense di eventi e di nuove conoscenze, tra cui il nuovo insegnante di Difesa dalle Arti Oscure. E poi il Torneo Tremaghi, e le prove da affrontare. C'è sempre qualcosa da capire, qualche mistero da svelare. Ottimo cibo per la nostra \"potteriana\" curiosità. Attenzione però, Silente ci avverte:«La curiosità non è un peccato. Ma dovremmo andarci cauti, con la curiosità...»Cauti... è una parola!Voto: 9"}, {"Review": "Reread done for #AdamRereadsHP! GOBLET OF FIRE is definitely work and I could've done for a lot of cutting. One of the things I admire most about this series is the way J.K. Rowling can speed through a year in under 300 pages. And GOBLET is twice that length and it didn't always feel justified. I shouldn't complain because more time in this world is MORE TIME IN THIS WORLD, and it's all very realized, but the pacing still felt off. (I really, really could've done without the Quidditch World Cup.) When I first read this novel when I was 13 going on 14, I took a break for MONTHS. And the same thing happened during this reread as a 28-year-old. I think it was around the same part too. But once you get to the Third Task, it all picks up. This last fourth of the novel has always been my favorite. Voldemort's return! That scene with the Death Eaters! Harry vs. Voldemort! Moody isn't Moody! Rita Skeeter exposed! It's all wonderful. GOBLET isn't my favorite in the series, but it's still pretty damn magical. "}, {"Review": "4.5 stars I really don't think I need to tell y'all that I loved this because I've been raving about this series since the moment I started it back in January but for the sake of clarity - I love this.  I believe everyone (even people that have no attachment to it at all) has a Harry Potter story under their belt. Whether it be the story of their first time reading it or the time they convinced everyone in their family to dress up as the Weasley's or when their Potterhead teacher made them play Quidditch in gym class, everyone has some kind of HP story they whip out at dinner parties - this is mine. Back in my early teens, after a childhood of ignoring the wizarding craze under the guise of my idiot-self being too sophisticated for magic (yes, 8-year-old Grace was an asshole - that isn't the story) I was a camp counsellor. But I wasn't a counsellor at any ordinary camp, oh no, I was a counsellor at a theatre camp. Each year we would put on a different musical and the year I was 15 it was decided we would do a child-friendly, dumbed down version of the Goblet of Fire, complete with all your favourite musical numbers stolen straight from A Very Potter Musical. I played James Potter, helped countless kids memorize their lines, choreography and ten musical numbers and yet the only plot points I picked up of the entire musical was the Yule Ball and (view spoiler)[Cedric Diggory's death.  (hide spoiler)]The whole time I was reading this book - 5 years later - all I could think about was that musical and what I knew was coming because of it. I was worried the entire novel and utterly heartbroken once it actually happened - 5 years of build up to finally understanding what was happening in this book and I'd say It was 100% satisfying. This book is masterful; it is the book where everything changes and you feel it with every flip of the page. It maintained the classic spirit of books 1-3 while perfectly balancing the added stakes and darkness. Also, like every other installment the way everything that is revealed at the end answers all your questions and puts all the more new ones straight back into your head was just as satisfying as it was the first three books and it was perfection. I want to curse 8-year-old Grace for being an idiot and 15-year-old Grace for not paying attention at work because, boy oh boy, do I wish I read this series sooner."}, {"Review": "I remember the first time I read this……I’d just started a real crappy job that I came to hate. I’d dropped out of university after my first year because my degree in psychology was a terrible choice, I seemed to be making more enemies than friends through life, but none of that mattered because I was reading a great series of books. I had something to look forward to every day when I really needed it. The point is books are escapism and fantasy books particularly so. As I got my shit together, this book helped me move on and get through life as so many other books have since. As Harry, Ron and Hermione entered their fourth year of Hogwarts, arguably their most challenging and intense year yet, I checked my mail box to see if my invite had finally arrived. It hadn’t. It still hasn't.Maybe one day. "}, {"Review": "Reread in December 2017 for #HarryXmasToYouForever sad about Winky not being in the movie and Rita Skeeter’s whole story not making it in either, because she’s so awful but JUSTICE IS SERVEDReread in December 2015 for #HarryXmasToYouSeriously so many things I forgot because it's so different from book to movie! It's so good still though. I loved Dobby in this book.Reread in December 2014 for #HarryXmasToYouAgain, so great. Lots of things I forgot! Like Ludo Bagman as a character, the Weasley's coming to be Harry's family for the third task, and just how things actually happen in the book since it varies in the movie. Things start to get dark after this book!"}, {"Review": "Like I have already mentioned in my review of Harry Potter and the Prisoner of Azkaban, it is definitely noticeable that Rowling's writing style has improved massively compared to the first two books in the series. The amount of suspense and foreshadowing was incorporated very well and made the reading experience so much fun. I found myself constantly holding my breath towards the end, there were so many twists and turns! I have actually seen the movie version before, but I forgot much of it, so I was extremely surprised at some of the reveals. The build up towards those situations was just perfect!I loved that we got to see a bit more interaction between muggles and wizards in the beginning, as well as more scenes outside of Hogwarts. It was a nice change and helped bring a bit more realism to the story (it was nice to see that wizards and witches get excited over such a normal thing as a sport event, too!).One of my favorite things in the book was the portrayal of friendship. Harry, Ron and Hermione were depicted as normal teenagers, who sometimes just happen to fight over the stupidest little things. I feel like that really brought their friendship forward, in a way. I, in general, feel like there was a lot of progress and development in the book. I haven't read the following books yet, so I obviously can't say how much of what happened in this one will play a part later, but I still feel like I learned so many new things about the world this story takes place in and about the characters in it. And oh man, how much I just love those characters..."}, {"Review": "في سوريا والعراق ظهر قادة الدولة الإسلامية \"داعش\" يغزون مدنهما يخرجون من ليس منهم,من ليس \"إسلاميا\" مثلهم من بيوتهم ومدنهم… يقتلون وينحرون رأس من يقف أمامهم, من يختلف عنهم في الدين أو المذهب وحتي الرأي أحيانا..من ليس مثلهم لا يحق له العيش في الدول التي يفتحونها أو ينتووا فتحهاوعلي مقربة منهم ,مكانيا, في فلسطين هناك الصهاينة ,يتغلغلون بأراضيها يخرجون من ليس منهم, من ليس يهوديا صهيونيا من بيوتهم واراضيهم..يقتلون ويقصفون بيوت من يقف أمامهم ,من ليس صهيونيا أو يهوديا هو أقل منهم شئنا...هم الساميون أسما وصفا والباقي مجرد حقارة لا يحق لهم العيش في الأراضي التي يحتلوهاوعلي مقربة منهم,زمنيا, بأقل من قرنا من الزمان كان الفوهرر الالماني هتلر النازي يحاول بيد اليهود كلهم...فهو يراهم بشرا دمهم أقل أهمية من دماءه النازية الطاهرة...ويريد القضاء علي وجودهم في أوروبا كلها يقصف بيوتهم ومدنهم...ليفرض سيطرة الدماء النازية بأوروباوفي أرض أخري أبعد شيئا ما, وزمنا يعود حوالي 3 قرون الي الوراء...كان الرجل الأبيض يقتل الرجل الأحمر, يخرجه من بيوته واراضيه لأنه أقل منه...لأنه لا يعرف رب الرجل الأبيض وبالتالي لا يحق له العيش..في القارة التي اكتشفها الرجل الأبيض ...الرجل الأبيض الذي سيستعين لاحقا بالرجل الأسود لمساعدة في بناء قارة كاملة ولكنه ايضا يحتقره ويسئ معاملته, فالملونون ليسوا بنقاء الرجل الأبيض..فلا يحق لهم العيشونعود للأراضي المقدسة مرة أخري,وبضع قرون أخري للوراء..حيث الحملة الصليبية تقتل أي مخالف لهم في الدين والعقيدة لتطهر الأراضي المقدسة من \"الدنس\"...فهؤلاء الكفار من المسلمين واليهود لا مكان لهم بها, يجب تطهير القدس منهمالأمر قد يأخذ مننا قرون لحكي كل هذا...ولكن لننهي هذا الحديث بأقدم قصة موثقة ..في مصر الفرعونية حيث الفرعون يري هو وسحرته والفراعنة القدماء أنقي دماءا من بني إسرائيل ويعاملهم كالعبيد ليس لهم حق الحرية..إما عبيدا له او ليرحلوا عن البلاد,او يقتلواولكن ما دخل كل هذا بهاري بوتر؟ وبالأخص هذا الجزء؟حسنا لمعرفة الأجابة واكثر بمقال هذه كانت مقدمته، هوأخترنا لك 8 - الولد الذي واجهه العنصريةوهي أستكمال للمقال الأولأخترنا لك 7 - الولد الذي قام بأنقلاب في تاريخ الأدبأتمني أن يحوز علي أعجابكم أن شاء اللهمحمد العربيفي 25 نوفمبر 2014ساقوم بتفريغ المقالات هنا بشكل مختلف تباعا"}, {"Review": "Normally, I congratulate myself for finishing a 500 + page novel but after reading 734 pages of this book, my only reaction was “How could it already be over?”The more I read Harry Potter, the harder I fall in love with J.K. Rowling. I couldn’t grasp how she could make this most fantastic series with the most complex and most expertly planned out plot, you could tell she was so sure of the story the moment she started writing the first book. Her attention to detail is more than impressive and the diversity and the realness of her characters are just unbelievable. Every single character (even inanimate ones) is fully developed. I am just absolutely, completely, astonished! ONTO THE RANDOM STUFF Lol higlights1. George and Fred and their skiving snack boxes. These boys are just too funny. “Maybe Harry’s next task is to attack Percy while he’s in the shower.” 2. Professor Dumbledore and his twinkling eyes.3. Hagrid and Madam Maxine- a match made in er…the mountains?4. When is Vicky short for Viktor? When Ron’s jealous. Lol.5. “Herm-own-ninny” says Krum. (Bahahaha!)6. Socks that screamed loudly when they became too smelly-Harry’s sweetest gift to Dobby.^^7. Dobby calling Ron “Wheezy!”8. Super cute Pigwidgeon being called “Pig” (Bahaha!) Grrr inducing moments/characters 1. Fleur Delacour, I am not very fond of ze way you act although I find ze way you talk fab.2. Ron, you could really be an idiot sometimes. “Caught on, have you? Took you long enough.”3. Draco, you foul creature! Don’t worry, Harry. I’ll make you a personal badge I’d wear all the time saying Harry Potter is the best. Rub the badge and it’ll change into “Harry Potter is the bestest!”4. THAT RITA SKEETER!5. He who must not be named is officially back! *shivers*6. Harry, you could be a pain sometimes, you know? All the danger signs are there. Your dreams, your scar, your name out of the goblet. Why won’t you listen to Hermione? Woah moments 1. Harry against the Horntail: Way to go, Harry!2. The triwizard tournament of course3. Basically all the tasks! Harry is awesome! 50 points to Gryffindor for answering the Sphinx’ question. Hermione moments 1. Hermione, her big heart and brain for the SPEW, I mean S.P.E.W.2. ”So basically, you’re going to take the best-looking girl who’ll have you, even if she’s completely horrible?”3. Her relentless support to Harry.4. Hermione and the Yule Ball. Sherlock thought 1. I was almost sure it’s (view spoiler)[Mr. Bagman (hide spoiler)] who was the culprit. I was terribly wrong. I’m no Sherlock after all. Crying moments1. Ron and Harry made up. (I was positively howling right along with Hermione)2. J.K. Rowling says “let the killing of noble characters begin” (view spoiler)[ Cedrick!  (hide spoiler)] *wails*3. Harry and his big heart. (view spoiler)[ The twins really deserve the bag of galleons.  (hide spoiler)] Let me give you a Mrs. Weasley signature rib crushing hug. A few of the many things the movie got wrong or missed to include:1. Winky & Dobby & Mr. Bagman.2. Went on ruining the mystery of the story right from the beginning. Ugh!3. Rita Skeeter’s most well deserved punishment.^^ All thanks to Hermione.^^4. Wormtail being all smug.5. Hermione’s ball dress should have been periwinkle blue! P.S. Harry's first attempt at romance happened here so it makes perfect sense that I'm posting this review on Love Day. What's more perfect is I get to greet my smart and sexy French Friend, Anna a HAPPY BIRTHDAY! I hope you're having the best day, my awesome friend! I was going to read something else for you but I can't keep my hands off Harry Potter. I am positively hexed. Lol. "}, {"Review": "I'm apparently the crankiest person on earth, because this was my least favorite Potter book yet. (AZKABAN being my favorite!) It's mostly because:1. There is too much tournamenting for my taste. 2. I hate the house elves. :O3. The word \"quietly\" is egregiously overused. It loses its effectiveness because it appears so often.4. There are moments when Harry and Ron behave like stereotypical stupid boys (I know, I know, they're 14...doesn't mean I can't be annoyed with them.)The book gets an extra star because the last 10 chapters were very good, though, and I loved:1. that Hermione gets a makeover, but then matter-of-factly says it's too much trouble to straighten her hair every day.2. the creepy thing in the blanket 3. Cedric! Poor brave boy. (view spoiler)[WHY DID NO ONE TELL ME. (hide spoiler)]"}, {"Review": "Ummm.... it's Harry Potter? I'm incapable of a decent review or anything new to say. My rambling thoughts as I finish this:- Sooo much about Voldemort's planning makes more sense now. Movie's skipped a lot.-Speaking of Dobby is my favorite and I'll forever be mad he was written out of the movie - Barry Crouch Jr is still attractive, but I think it's only because David Tennant played him in the movie...-I'm still not over Cedric. So sweet. So kind. 💔- Cho is boring and I don't know what Harry sees in her- Does all this S.P.E.W stuff actually go anywhere? Because it feels a little random and completely unresolved. - Is Hermione's campaigning for house- elf rights supposed to be a good or misguided? Because even Hagrid disagreed with her? - Molly Weasley is who I aspire to be- I disliked movie Sirius, but like book-Sirius a lot more- More Remus Lupin please!- I still think Harry throwing that one challenge to \"save\" everyone was kind of dumb"}, {"Review": "\n\nBook Review\n\n4+ of 5 stars to Harry Potter and the Goblet of Fire, the 4th book in the \"Harry Potter\" young adult fantasy series, written in 2000 by J.K. Rowling. Although this one was close to a 5 for me, I think it's enough to give 1 book in the series a 5-rating, which means this one will stay at a 4. But I still loved and adored the characters, the setting, the story, the themes... all of it! Rather than go into a detailed review, as we've seen too many of them (always fun to read tho!), I'm just going to chat a little bit about the parts that I enjoyed the most.1. The selection of the 3 students to participate in the Tri-Wizard Tournament. It's scary to think the schools condone putting the kids at such risk, but then again, I suppose they'd stop it just before anyone died or was hurt irreparably. To imagine the goblet of fire choosing one from each school, and then Harry's name being cast as a fourth one... fantastic idea and approach. I felt the drama. And I loved having him put to the test mid-way thru the series... as he never seemed to be all that good of a student or a wizard!2. The introduction of new characters in this one is intense. I loved all the folks at the various stages of the competition. To see feelings emerge for one another, to know they were going thru the same unrequited love and anger we all go through as teenagers. Was a good experience -- I thought it was one of the more real aspects of the series.3. The imagination for all the tournaments and the dance... fantastic. I wanted to be there watching it all happen. I can only imagine how it felt to write those scenes... knowing it would propel the characters forward in a very different path by the end. And to see the drama of how it all turns out.I am feeling the need to re-read this series again soon...\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by. Note: All written content is my original creation and copyrighted to me, but the graphics and images were linked from other sites and belong to them. Many thanks to their original creators."}], "Image": "https://images.gr-assets.com/books/1361482611l/6.jpg", "Desc": "Harry Potter is midway through his training as a wizard and his coming of age. Harry wants to get away from the pernicious Dursleys and go to the International Quidditch Cup. He wants to find out about the mysterious event that's supposed to take place at Hogwarts this year, an event involving two other rival schools of magic, and a competition that hasn't happened for a hundred years. He wants to be a normal, fourteen-year-old wizard. But unfortunately for Harry Potter, he's not normal - even by wizarding standards. And in his case, different can be deadly. --back cover"}