{"Genre": "Fantasy", "ID": "119322", "Name": "The Golden Compass", "Reviews": [{"Review": "This novel is an absolute work of pure genius, and is in my top ten reads of all time. Before I go into the depths of character and plot, let me start by saying this book is up there with other fantasy hard hitters: by this I mean books like The Lord of the Rings and The Chronicles of Narnia: the books that define the genre. This is high praise indeed, and this novel is worthy of it. The protagonist of the book is Lyra, a young girl, who is parentless and seemingly friendless. She has grown up in an Oxford College and has developed a detachment to her guardians. She spends her days enjoying her youth and harassing those that turn out to be some of her greatest allies. For her, this book is a journey of self-discovery: a way of exploring the limits of her character and potential. Her adventure sees her befriend an armoured polar bear and become the wielder of the golden compass. This is initially described as a lie detector but it is apparent that the depths of its power have not been fully explored. \"It lay heavily in her hands,the crystal face gleaming, the brass body exquisitely machined. It was very much like a clock, or a compass, for there were hands pointing around the dial, but instead of the hours or the points of a compass there were several little pictures with extraordinary precision, as if on ivory with the slenderest sable brush. She turned the dial around to look at them all. There was an anchor; an hourglass surmounted by a skull; a bull, a beehive…..Thirty-six altogether and she couldn’t even guess what they meant.\"This book retains all the classic elements of fantasy: magic, mythical creatures and supernatural phenomena. The world Pullman has created is physically intertwined with our own; there are references to cities and countries in which his idea has been planted.Each human has a daemon that is essentially their soul. These take on the form of an animal that is representative of the person, for example someone who is enthusiastic and friendly has a colourful cat whereas as solider has a wolf or a hound. The author does very little to explain this. It is just thing “thing” that we are told about at the start but through the book but we begin to see the significance of it. The fact that children’s daemons change is a subtle hint how children can be influenced and have not found their identity where as adults are secure and confident. In this the author has created an air of mystery as we explore the true meaning of the bond as we read further. The plot is fantastic. The author manages to surprise the reader on several occasions as he drops several, massive plot turns. This sees the story go into unexpected directions. From the beginning of reading a book, you begin to predict what will happen. Some books are completely predictable and obvious in their direction; this one was not. I physically gasped at some moments as I found myself awed by the author’s storytelling; this is when several characters origins, in relation to Lyra are defined. The book begins as a simple rescue mission but ends as a story that is questioning the morals of all characters involved. The fate of the characters is destined in the mysteriousness of the northern lights; the gateway to beyond. This is one of those books that is applicable to all ages; it originally appears to be a children’s book, but it can be enjoyed by anyone. Much of the content in here touches on themes that most children would not comprehend fully, never mind be able to philosophise about. The author considers spirituality, religion, morals and the existence of the soul, amongst other things. Most children would not pick up on these references and understand the significance of them; however, they would still adore the book.The book can be seen as two separate entities existing at the same time; the first, and most obvious, is the one that appeals to children; the saving of innocents from despotic adults with lots of exciting characters. The second is on a deeper scale; the author explores the conflicting powers of science and religion, manipulation and morality in terms of actions being for a greater good. In this the author is a genius, he has wrote a book that can be both a children’s bed time read and an adult’s point of pondering."}, {"Review": "I don’t love the Beatles.*Ducks as he is castigated by the seething masses*I also don’t love green vegetables, punches to the face, or going to the dentist, though I don’t think those revelatory disclosures will elicit much in the way of rage-fueled attempts to slit my throat with the jagged edge of a broken CD (compact disc, kiddos—look it up). So, why risk a severed jugular on the day before I’m going to stuff myself so full of turkey that I’ll have a snood coming out of my ear? Well, because it’s the best way I can think of to articulate my feelings about The Golden Compass.I don’t LOVE the Beatles, but I recognize their skill and talent and appreciate them for the impact they had on popular music. There are Beatles songs that I enjoy. I think I might have a Beatles album on my iPod (though I’ve never actually played it on my iPod). But, I’m never going to suddenly say to myself, “Geez, I really need to hear a Beatles song RIGHT NOW” and rush off to listen to one. (Side note: I do occasionally get an urge to listen to Yesterday, but just the Boyz II Men version…so perhaps I’m not the most qualified judge of musical quality on the planet.)Is Philip Pullman a Beatles-level authorial entity? Well, no. But, he is a skilled writer with a gift for storytelling and world building. He’s a talented technician and stylist. But, I don’t love The Golden Compass. I appreciate that it’s a well-written and well-conceived story, but, as agents revel in saying to me when I pitch them, “I just didn’t connect with the material.” I can see why people (ahem, Kristin) love this series, and I certainly would not dissuade anyone who’s interested in reading it from giving it a go. It’s well done.Someone asked me, as I was finishing this, if I was going to check out the second book in the series, but I think I’ll Let It Be."}, {"Review": "the golden compass trilogy seems like a natural progression in christian literature. yes, it is christian literature, the same way the chronicles of narnia are. aslan is only a lion when the reader is about 10 or so in the united states. after a point, he unrepentantly becomes jesus. and the four children are like, the gospels or something. and the story is somewhat ruined then, because as an adult, you can't just shoehorn jesus into a lion outfit without snickering a little.pullman however, has solved this problem. i can't continue without utterly spoiling the story for everyone who hasn't read it, so consider yourselves warned...he made jesus into a little girl. even better, he made jesus into a little girl who doesn't even know she's jesus. now how's that for a new twist on the new testament? the part that's particularly brilliant about it, is that it actually worked. lyra is never really anything like christ... she just follows the path of his narrative. first, she has the absent father. lord asrael is desperately involved in his own ideas, so though he's not actually in heaven, he may as well be. wait a sec, isn't this just dogma again? sort of, except dogma is really more relevant to catholicism in particular, rather than scriptures. and instead of linda fiorentino who is kind of a mopey christ, we get a 10 year old girl. 10 year old girls are the best focal point for any story. i've been one for years.and this is a perfect choice, because she really never takes time to mope. she doesn't miss her faith or wrestle with it... she doesn't believe at all. and therein lies the genius of pullman's work, that has all the christians in a snit; she's also the antichrist.why would he do that?because the bible does. if you really take a look at the word antichrist, it does not mean \"evil\". khristos, from which christ is derived, means \"anointed\". so what does antichrist really mean? unanointed, or that which is against the anointed. there's a bunch of baggage on top of that meaning, which is how we got those omen movies, but at the heart of it, it just means smeared with fat. actually, it means recognized by the divine... but in ancient times, we did that by smearing the recognized thing with the fat of a sacrificed animal or person. and that, is why we celebrate the crucifixion. it was the point of christ's birth. as if it wasn't obvious enough, it's why he's referred to as the lamb.wow. so this is heavy... pullman has gone all the way back to the origins of the judeo-christian faith and said, this important guy, was just the carrier of this magical stuff that we're obsessed with, that we don't even use anymore. it's like we're infected or poisoned by this idea. we need an antidote. we need an antichrist, to show us how far we've wandered from the truth, which had nothing to do with trooping along after some guy.and this explains why christians are so antagonized by the books. they've been following the beast for years without recognizing it. the golden compass referred to in the book, is the bible we've all forgotten how to read. and in its stead, we've rallied around the church which claims to help us understand the symbols. but in reality, it is the beast referred to. the one which rose from rome, with many heads that change over time. so what really, is the golden compass about? it's about how to be human again. how to regain an understanding of the world, that doesn't rely on our fragile expectations for good and evil. all it requires, is that you give up everything, in order to discover what is important again. and i don't know how christians could have missed that primary message."}, {"Review": "I hadn't read this since elementary school and am so glad I took the time to come back to it! I don't know that it would be a full 5 stars if I just picked it up today, but we're going with 5 out of nostalgia. Lyra was one of my favorite characters as a kid and is still just as fierce & wonderful as I remember. Actually, I'm surprised by how well I remember the whole story. Maybe it's because the characters and world are so strong, or maybe it's because the movie follows the book SO well. Seriously, the movie is the same story all the way up until... that whole new ending it wrote to be kid-friendly and shut the story down. I don't know if I adored this book as a kid because of the polar bears and snowy world or if that's actually what led to my love for those types of settings, but it's completely gorgeous. Ok, wait... I'm starting to question the origins of a lot of things I love right now. I genuinely think this story started my obsession with Oxford, too. Anyways, the whole concept with Dust is so creative and I LOVE every single character. This is one of those stories any age can appreciate! I'm not sure how much Catholics would love the thinly-veiled comments on the Church here, but I still don't think it's too mature for kids."}, {"Review": "9/8/17:1. I cleared my rating. If that doesn't sufficiently refute the claim that I \"just wanted\" to give THE GOLDEN COMPASS 1.0 star, then you're irrational, and further discussion is pointless. 2. I am a BOOK REVIEW BLOGGER. That's what I do. If you want to make cracks about being a trophy wife, go right ahead, but to insinuate that I would \"skim\" a book to have the minimum knowledge required to give the appearance of having read it so that I can give it a bad review b/c reasons, is an attack on my character and work ethic. I'm not some conservative religious zealot who think books with magic are sending our children straight to hell. I don't have children. I'm not a Christian. I do, however, have four nephews, all under eight years old that I have already given HARRY POTTER and many, many other similar books, THE GOLDEN COMPASS not among them.3. In regards to my perceived lack of faith in a child's intelligence, I'm baffled that you think that's the only issue. \"Children aren't stupid. They have good instincts. Shame on you.\"Are you going to tell me that children also have excellent impulse control? That they're always rational? That they aren't capable of making bad decisions when overwrought? And am I also to assume that you all strictly adhered to the suggested age requirements on books? None of you were specifically informed that you read several grade levels ahead of your peers? This isn't the simple issue some of you are trying to make it. You MUST know I'm a advocate for free thought, for going against the grain, for individuality vs. hive mentality . . .I believe it's important to teach children to question, to think for themselves.BUT.I feel this book crosses a line for its intended audience. The two adults Lyra should be most dependent on are villains, and whether or not there are good role models among the secondary cast of characters, they are SECONDARY, ultimately insignificant roles as evidenced when dollface takes off on her own b/c her parents cannot be trusted, and she knows better than they do. The fact that it's true in her scenario is exactly what concerns me.You can draw a straight line through all the steps on the path to a child's inevitable conclusion that Adults are the Enemy, and to do good, to do right, you cannot trust or obey them.I think that's a very dangerous, potentially harmful thing to teach a child. You don't have to agree with me. In fact, the whole reason I'm writing this, years after I read the book, is b/c I didn't want to be that person who essentially outlines their own (possibly contradictory) review on someone else's post. B/c those people suck. FYI. <------read between the lines.I don't recommend this book for readers not in their teens. Yes, some children mature faster than others, and, especially, if the child in question is your own, you're the best judge of what is appropriate--I would never tell anyone what to do with their children. I am merely voicing a concern and suggesting that one might consider personally screening THE GOLDEN COMPASS before passing along to young, impressionable minds. This is my opinion. If you are violently opposed to it, I invite you to WRITE AND POST YOUR OWN REVIEW."}, {"Review": "Later....A friend said to me today that if you read this book properly, it should make you a better person. I'd just earlier in the day been thinking pretty much the same thing. When I asked S. in what way was he made better, he said he couldn't say, just that it had. Exactly. I think you have a sense as you read this book that Lyra's goodness has rubbed off on you, she's made you better in an entirely non-specific way.M. then said that she didn't think a book, to be special, necessarily had to have a moral impact, it could give you other terribly important things. For her to read the first Harry Potter was to be given back magic. And yes, an author, if he can return to you something you had lost and not even realised you had, has done something equally to be treasured.I have promised to read HP soon. I find it difficult to believe I'm going to get anything out of it, but, then, thus had I felt about Northern Lights.-------------------------------------------------I really didn’t want to read this. It’s fantasy, it has made-up words, it is a trilogy – WHY!!!!! Why can’t somebody write a fantasy book that stops at a decent time???? There is an explanation of how to pronounce ‘daemon’ before the book even starts and that’s enough to make my heart sink. So why am I reading it? Because I’ve been backed into a corner by a friend and I can’t figure out another way of getting out. Here it is then. A grumpy person reading a type of book they don’t want to read and are opening it up for all the wrong reasons.And then…straight away, within a page or two: what a heart-thumper, what a brilliant unputdownable ripsnorter. Impossible not to compare with Larsson’s books, and comes out so far ahead on all counts I don’t know if I’ll be able to read the last Girl-Tattoo book after all.This guy writes well, Larsson doesn’t. He has a plot that is worthy of the name for the entire book. When I wanted to stop reading the first Larsson after 140 pages and was told that it got good soon, well, honestly, I stuck with it and the advice was correct, but still. That’s a lot of wasted pages. Larsson’s female character is a pastiche of current fashion:(1)\tAnti-social(2)\tMetal in odd places(3)\tPunk rocker(4)\tShags girls, heterosexual male fantasy(5)\tShags much old men, ditto(6)\tBoob job(7)\tComputer whizzLarsson gets away with this, even though this amalgam feels fake. Lyra needs nothing. She is just a girl with nothing special about her at all and she is fabulous. Already I’m wondering if this series is going to get spoiled by her growing up and sex coming into play. One of the things this book demonstrates is how utterly irrelevant and tedious the sex is in books like Larsson’s. It is just there to titillate, it has no intrinsic purpose whatsoever.I’m gobsmacked by how much more believable this book is than Larsson’s. Daemons, talking bears, witches, universes coming out of universes – I’m half expecting a string theorist to pop into the story, but as long as that doesn’t happen I can’t imagine anything could spoil the rest of it. I’m trying to picture who wouldn’t enjoy this, and I’m coming up with a complete prune of a person. If I enjoy this, honestly, anybody would. And yes, ladies and gentlemen, I’m even going to give the rest of the series a go.--------------------Finished! The last forty pages or so, after the duel of the bears, lost me. Maybe because they weren't really about the story, they are about setting the scene for the next book...I don't know. But I have to say that after 350 pages where every sentence made my heart beat too fast, I feel rather churlish saying that."}, {"Review": "De alguna forma este libro empezó como una producción de Disney, en la segunda parte parecía más como de Nick o TNT y ya en la tercera parte ¡Wow! Esto se transformo en HBO. No sé si este libro debe calificarse como infantil, si bien es cierto que la protagonista Lyra nos va dando una perspectiva bastante inocente de su mundo, los temas que se tratan en el libro no lo son tanto, el centro de la historia es, al parecer, el misterio que existe del porque están robándose a los niños de todas partes, pero por debajo de eso hay mucho mas, de una manera sutil, se nota que existe una lucha de estos dos grandes titanes, la religión y la ciencia, y ambos buscan poseer la verdad, mostrando toda la crueldad de la que pueden ser capaces. El worldbuilding me encanto, con los Daimonions (en este mundo el alma no está dentro del cuerpo sino en el exterior y toma forma de animales), el aletiometro, los osos polares, los giptanos, el polvo y lo que más me gusto fueron las brujas…\nTú eres muy pequeña, Lyra, demasiado pequeña para entender estas cosas, pero a pesar de todo te lo explicaré y llegará el día en que lo entenderás: los hombres pasan delante de nuestros ojos como mariposas, como criaturas de una estación efímera. Los amamos, son valientes, orgullosos, guapos, inteligentes, y se mueren casi en seguida. Se mueren tan pronto que tenemos los corazones continuamente atormentados por la pena. Alumbramos a sus hijos, que si nacen hembras son brujas, y si no se convierten en seres humanos. Y después, en un abrir y cerrar de ojos, desaparecen, caen abatidos, mueren, los perdemos. Y lo mismo sucede con nuestros hijos. Cuando un niño va creciendo se figura que es inmortal. Pero su madre sabe que no lo es. Cada vez se hace más doloroso, hasta que finalmente se te parte el corazón. Puede ser que entonces Yambe—Akka venga a por ti. Yambe—Akka es más vieja que la tundra. Tal vez para ella las vidas de las brujas sean tan breves como lo son para nosotros las vidas de los hombres.\n…espero que estas sean profundizadas en los libros siguientes; los personajes son todos matizados de grises, ni buenos, ni malos, lo que hace la historia mucho más interesante y que el final sea tan impactante ¡Qué final! Me sorprende que en la película lo omitieran y cambiaran tanto... esperen dije sorprende… fue una película obviamente destrozaron lo que pudieron del libro. Y ahora se viene la serie de televisión, veremos que tal la hacen tengo malos presentimientos al respecto. En fin me encanto esta fantástica historia con sus toques épicos, de ciencia ficción y steampunk, es un inicio espectacular, y se ha convertido en una de mis trilogías favoritas Para mas de mis reseñas sobre los libros de La Materia Oscura pueden ver los siguientes enlaces:La Daga aquí EL Catalejo lacado aquí El Oxford de Lyra aquí"}, {"Review": "Hello friends! We're reading THE GOLDEN COMPASS together throughout the next few weeks as part of our goal to read more classic YA/MG books this year. Please join us if you can!-- Discussion on blog: February 28th-- Hashtag #tmgreadalong if you'd like to discuss as you read on Twitter.More details on the blog: http://www.themidnightgarden.net/2014...-------------------------------------------------------------------------------------My review:Wildly imaginative and thrilling, this complex and beautiful story follows brave, fierce Lyra Belacqua in her quest to save her childhood friend. The book is filled with dazzling adventure and marvelous inventiveness, as well as many scenes that will fill readers with utter horror and pity. There are witches, gypsies, daemons, and best of all--armored polar bears! The warrior bears have a spectacular battle scene towards the end that still shakes me to the core when I read it. There aren't words enough to describe what an important work of literature this is, not only for children, but also for thinking, feeling, dreaming adults as well."}, {"Review": "I really liked this book! I think it is easily among the best of the crop of Potter-era YA lit (even though it actually came out first!).The movie was just ok. I thought the lead kid did a good job playing Lyra, and Nicole Kidman made a very menacing Ann Coulter. But my very favorites were Daniel Craig as the zealot Lord Asriel and Eva Green as badass witch Serafina Pekkala. Serafina Pekkala is one of my favorite witches in literature: she's grounded in her connection to the earth, she's beautiful, she doesn't have to hover over the cauldron all day to perform her magic, she's immortal (more or less), she can fly and she has awesome archery skills. She is also tragically romantic, because she is cursed with watching the man she loves die, because he's mortal. Pathos! But I think that is in the second book.Speaking of which, I will say I did NOT like the second movie. It made no sense and did not follow the book at all! For one thing, they changed the name, which I do not get. Maybe it was the British name? (The first book/movie is called Northern Lights over there.) But I don't remember any casinos in the second book. And not only do they have Serafina and Asriel dressed all wrong, they have them get together!!! That does NOT happen in the books. And then Serafina DIES?! Also Lyra isn't even in it, hello?Facebook 30 Day Book Challenge Day 14: Book whose main character you want to marry. (Um, Serafina. Not Asriel. Just to be clear.)"}, {"Review": "I never added a review of this but I'm going to now. I'll admit that this one was a bit slow for me at parts (especially compared to the sequels) but what kept me reading was the fascination with the daemons. I liken them to the patronuses (patronii?) from the Harry Potter series in that they are the animal totem of a character, and can change until someone is \"set in their ways\". How many other people have held conversations about what their daemon or patronus animal is, and then changed it frequently?I'll also admit that I don't particularly care for Lyra. I find her too abrasive for my liking as she seems to always have a chip on her shoulder and wants to turn everything into a fight. The titular object (at least in the American version of the book) is an Alethiometer, a clock-like divination device that she can use.The character who I really liked (and thought we needed much more of) was Serafina Pekkala, Queen of the Witches. Not only was she boss with a bow, but she was always magical flying astride her cloud pine branch.All in all, 3 stars when compared to the sequels."}, {"Review": "This is a second reading of Pullman's classic, accomplished on vacation in a car, with the family, by listening to the 9 cd audio collection, with Phillip Pullman Himself reading the narration and beautifully, and a cast of fine actors taking various parts. The first of a trilogy entitled His Dark Materials, which is a great fantasy story supposedly appropriate for grade 6 (American schools) but is really all ages, and like Wrinkle in Time, has dimensions in it which you will discover at any age. It IS a kid's book, in so many ways, with a strong girl main character, Lyra, 11, who is set on freeing her friend and other children from the north, with the help of Gyptions, an armored polar bear, witches, a Texan aeronaut balloonist, among others. This first volume is wonderful fun, focused as it is on Lyra and adventure. Lyra is a pretty unforgettable young girl character, who really grows over the trilogy, and others also take the stage, but in this book she is up there front and center.The series is also a commentary on and critique of C. S. Lewis's The Lion, Witch and the Wardrobe series, which Pullman, an atheist, found as he finds all Christian materials, too simplistic about the nature of the universe. Pullman once commented that he finds it interesting that he is placed in the category of \"fantasy\" writer, which he thinks is evidence of the narrowness of vision that dominates the planet. In other words, Pullman sees the world as multiple, not binary, not just good and evil, Heaven and Hell; he thinks there are multiple worlds, and he thinks science/physics increasingly supports what many people know about the presence of multiple spiritual realms. Pullman is also widely castigated/denounced as critical of The Holy Roman Catholic Church, which seems to be true in my reading of this book, though I think he is critical of almost all religions that see the world narrowly and are bound up in a view of the world as comprised of Sinners and Saints. Pullman especially finds the notion of Original Sin, which is the very foundation of the Dutch Calvinist Reformed Church in which I grew up, reprehensible, certainly limiting as a foundation for life. I think the Catholic Church, seeing Pullman as an atheist and his work as an exclusively anticlerical tract, helped to crush the continuation of the fine film series, which only has one third of the story, this book, produced, though that film was tame compared to the book. But I think it is more about the nature of True Religion than anti-religion, and I think Pullman says as much himself.The series also owes a lot to Milton's Paradise Lost, which will become more evident as the series goes along, though you don't have to know that to appreciate the tales. Pullman loves Milton, and also argues with him, too. As with Warner Brothers cartoons, there's a kid level and an adult level on which you can appreciate the wonder of the tales. But it's not just a fantasy adventure! As with all great literature, it's about what is at stake in making meaning. It's a great classic.But enough about all that theology jazz! Lyra is the hero of this first volume (and ultimately of the whole series). She is a liar (Pullman pronounces her name Lie-rah), a storyteller, fantasist, without which she could literally not survive. We named our daughter after this main character, so you know I am a fan, though we pronounce the name Lee-rah (as in Lyrical)."}, {"Review": "Northern Lights = The Golden Compass (His Dark Materials, #1), Philip PullmanNorthern Lights (known as The Golden Compass in North America and some other countries) is the first book of \"His Dark Materials\" trilogy. Set in a parallel universe, it features the journey of Lyra Belacqua to the Arctic in search of her missing friend, Roger Parslow, and her imprisoned uncle, Lord Asriel, who has been conducting experiments with a mysterious substance known as \"Dust\". Northern Lights is a young-adult fantasy novel by Philip Pullman, published by Scholastic UK in 1995. تاریخ نخستین خوانش: روز دوم آگوست سال 2008 میلادیعنوان: نیروی اهریمنی اش - کتاب اول - سپیده ی شمالی در دو جلد؛ نویسنده: فلیپ پولمن؛ مترجم: فرزاد فرید؛ تهران، کتاب پنجره، 1384 تا 1385، در پنج جلد؛ شابک دوره پنج جلدی: 9647822146؛ چاپ سوم 1387؛ شابک دوره: 9789647822145؛ چاپ چهارم 1388؛ موضوع: داستانهای کودکان و نوجوانان از نویسندگان انگلیسی - سده 20 معنوان ک‍ت‍اب‌ نخست از مجموعه ی : «نیروی اهریمنیش» شامل دو جلد ب‍خ‍ش‌ اول‌ و دوم: س‍پ‍ی‍ده‌ ی‌ ش‍م‍ال‍ی‌؛ عنوان (جلد سوم) ک‍ت‍اب‌ دوم‌: خ‍ن‍ج‍ر ظری‍ف‌؛ و عنوان (دو جلد چهارم و پنجم) کتاب سوم: دورب‍ی‍ن‌ ک‍ه‍رب‍ای‍ی‌ است. نیروی اهریمنی‌ اش؛ عنوان مجموعه ای سه‌ گانه از داستانهای تخیلی ست، که: فیلیپ پولمن آنها را نگاشته است. کتاب‌ها به ترتیب: سپیده شمالی (1995 میلادی، در آمریکای شمالی، با عنوان: قطب نمای طلایی؛ منتشر شده)، خنجر ظریف (1997 میلادی) و دوربین کهربایی (2000 میلادی) نام دارند. داستان کتاب در مورد دو نوجوان به نام‌های: لایرا بلاکوا، و ویل پری است؛ که در دو دنیای موازی زندگی می‌کنند، و وارد ماجراهایی حماسی می‌شوند. کتاب سوم از مجموعهٔ نیروی اهریمنی‌ اش در سال 2001 میلادی برنده ی جایزه کتاب سال وایت برید در انگلستان شد، که یک جایزه ی معتبر ادبی به شمار می‌رود. روزنامه ی آبزرور از این مجموعه به عنوان یکصد رمان پرفروش دنیا یاد می‌کند. در کتاب نخست: لایرا به کمک دوستش که توسّط شفن ها دزدیده شده رفته، تا او را نجات دهد. ولی در انتها درمییابد که...؛ ا. شربیانی"}, {"Review": "fantastic. pullman introduces readers to his sophisticated world view slowly, and this first novel in the trilogy has an ideal narrative focal point in the mean little liar who is the protagonist. i have never seen lying in children portrayed so explicitly as a positive thing, and after this novel, i'm all for it! the settings are wonderfully strange and surreal yet rooted in an eventually understandable reality, and the supporting characters are oblique and enigmatic without being tiresome. the old concept of spirit animals is given a refreshing modern face-lift and, happily, no annoyingly new agey concepts bleed through. neither the writing nor the main character herself ever stoop to easy, sloppy sentiments."}, {"Review": "When a film was made of this book, they did the book a real disservice. This book is amazing. Lyra is the feisty protagonist, an inveterate liar, clever, passionate and loyal. She achieves the impossible, rescues an armoured bear, befriends the witches, and rescues children from a fate worse than death- literally. Pullman does a great job realising this alternate world where everyone has a daemon- like the other half of your soul - and these creatures stay with you through your life. As adults they take on a settled form, one which says something about your character, but as children, their form is still unsettled and changes when and as needed.Lord Asraiel and Mrs Coulter make perfect villains. This book does not really end but segues into the second book.This was a reread and I listened to it on audio. They did a fantastic job, I have to say, with different actors for all the voices.Recommended."}, {"Review": " I really like that the Iorek Byronison, the bear, is always referred to by full name. When I'm Bear King, I definitely want to be on a full-name-all-the-time basis. Then I will battle challengers to mortal combat, tearing through armor, swiping off heads with my massive paws, slicing open chests and devouring hearts. And as I gorge myself on bear blood, I will cry out \"Bears! Who is your King?\" And my name will roar from a thousand bear throats.it's going to be awesome.(My name has got that same elegant mysterious beauty. Like a sound you'd expect if you hit a fairy with a shoe.)9/14/07"}, {"Review": "This book was recommended to me somewhere in fandom as a children's book that is also interesting to adults. I admit that I wasn't particularly impressed with it, and I can't see it as something that I would give my kids to read. My main complaint is the \"means to an end\" style the author uses. A bit like in a computer game, our main character Lyra runs from one wise man to another in her quest to find some missing children. This is practical, because except for one scene in the beginning, she doesn't have to find out things herself, since the wise men will always tell her wat to do and what is going on in long, question-answer dialogues which will reveal the next part of the plot. Nothing is ever really set up to lead somewhere, unlike for example in Harry Potter where everything leads to something in the end, everything is happening in dialogue, which sounded so constructed and goal-oriented that it rarely ever convinced me.The narrator is probably supposed to be an all-knowing narrator (sorry, don't know the english term for that), but he slips into Lyra's POV with no pattern I could discover. And the fact that I even noticed this shows how disturbing it was. The protagonist is, well, I don't know why anyone writing children's book would invent an \"unimaginative\" (quote), lying, sometimes even hateful character like Lyra. I started to like her a bit more during the second half of the book, but mostly because I felt sorry for her. Then I discovered that she is supposed to be older than 11, when she makes herself younger by telling someone that she is eleven. Until the I had thought she was maybe 8 or 9. Shortly after that I stopped reading the book.P.S.: After having read numerous other reviews of this book, I feel the need to point out that I'm an atheist and that no, I didn't give this book a bad review because it \"offended my christianity\". In fact, I seem to be so much an atheist that I completely missed how the book could be controversial or offensive in that regard. I know it offended me by being a bad book sold with a lot of hype, but that's not Pullman's fault. However, I did read that Pullman called himself an agnostic somewhere, and that explains rather a lot to me. "}, {"Review": "It had been like 12 years since I read this book and I'd been meaning to re-read it for ages––so I finally got around to it, and I fell in love with it all over again. I was kind of surprised by how well I remembered the story/characters despite having not read it since I was 11 years old––apparently it's just that memorable!There's so much I love about The Golden Compass. The world-building is so vivid and fascinating; I feel so drawn into the settings, I love the dæmons, I love the armored bears, I love the witches. And I LOVE THE CHARACTERS. (Sorry I'm saying \"love\" so much, oops.) Lyra is awesome, and what I especially appreciate about her is that she's such a realistically flawed character. It's challenging to write a believable child protagonist, but I think Philip Pullman does it perfectly. Plus I love Pan and the strong bond he and Lyra share. And IOREK, HE'S SO BADASS, and the friendship between him and Lyra is also really sweet. Oh and I love Lee Scoresby .... and Serafina ..... I'm just going to stop now before I name all the characters. I only have a couple of minor complaints about this book upon re-reading it: one is that, even though for the most part I love the writing, the dialogue seems a little wooden and/or melodramatic at times. The other is that all the religion/anti-religion stuff seems sort of randomly thrown in at the end of the book, what with Lord Asriel's long-winded explanation of the Dust being a physical form of original sin and all. I feel like those themes went over my head as a kid, but reading it as an adult I'm like, \"....what.\" I remember that these things are explored more in the second and third books, but within the first book it seems a little rushed/forced. But anyway, I really enjoyed my re-read of this and I'm looking forward to reading the other two books in the trilogy! "}, {"Review": "After all the talk about Pullman's supposed anti-Catholicism or anti-Christianity or atheism or whatever one wants to label it, I approached The Golden Compass (known originally as Northern Lights) with an open mind and found something other than what I'd been told to expect. I found elements that questioned Christianity and Catholicism and the nature of God and its works, but I also found elements that questioned parental authority, the ethical and practical roles of Science, and the nature of good and evil. And it is this consistent questioning that I see as the message of Pullman's first book of \"His Dark Materials\" -- not any of those messages that were focused on during the movie's release. The notion that we should question everything, even if we are children -- or especially if we are children -- is one of the most important messages humankind can hear, and one of the hardest for us to learn or employ. Most people simply do not want to question. It takes work; it takes struggle; it takes strength, and far more strength than unquestioning faith or simple acceptance require.The fact that Lyra questions everything around her at all times is her salvation. And ours if we would only learn the lesson. Say what you like about Pullman's story, but regardless of your religion or politics or economics or taste he does something brave that needs to be respected -- he challenges us to think about everything. Even his book (with its flaws...and there are a couple).I understand that he can't maintain the amazing level of The Golden Compass, nee Northern Lights, in the books that follow, but I am compelled to read them to see for myself. I think Pullman would appreciate that. "}, {"Review": "The Golden Compass, by Philip Pullman, picks up where the Harry Potter series leaves off. As in Rowling's series, the hero of The Golden Compass--Lyra, a pre-teen girl in Oxford, England--is plucked from her mundane existence to become supremely important to the fate of the living world. However, unlike the Potter series, The Golden Compass, immerses us immediately in political, religious, and cultural conflict as well. While the central character is indeed a child, which lands this title in the children's section, the themes and conflicts in the novel are often very adult, the action sometimes gruesome, and characters' behaviors and motivations quite complex. The sophistication of the story will be lost over children's heads.Nonetheless, the action will sustain.For children, The Golden Compass is the story of Lyra Belacqua's adventure to the arctic to rescue her friend Roger, who has been kidnapped by adults who run experiments on children. The story is set loosely in our world and in the past, but in Pullman's revision, every human being has a \"daemon\" that is a physical manifestation of that person's soul in the form of an animal that is psychically, or perhaps spiritually, connected to the person. The experiments involve the investigation into and hideous manipulation of that connection. Along the way, Lyra meets talking bears, flying witches, and much, much more.For adults, the novel asks questions about the relationship between religion and science. It explores political coercion and subterfuge. It examines class differences. And, to a very real degree, I think, it focuses on adult obsession with innocence and experience--both in a religious context and in a childhood/adolescence/adulthood context.The result of all of this is a multi-layered novel. It's fun, but also thought-provoking--and potentially scandalous. Do I recommend it? Yes. Fun and thoughtful: a novel vision.Would I teach it? Hard to say. Likely not. It's a wonderful and intricate piece of writing--some of the passages are beautiful and the content generates many talking points--but much of it feels too overtly didactic.Lasting impression: This is another magnificently realized escapist fantasy like the Harry Potter series. And, from the very beginning it is laden with complex political and social intrigue the stuff of which appears in \"grown-up\" fiction."}, {"Review": "This book started off strong, but by the end of the story, I felt that Pullman had sacrificed logic and direction for drama and suspense. He did a good job of gradually making Lyra less of an ignorant brat and more of a noble little savage girl. Overall, I liked this book well enough to want to read the second one in the trilogy, but I had several problems with it:-There was no comic relief or even any funny moments in this book. It took itself extremely seriously and was rarely light-hearted or playful. It bothers me when epic stories get a little bit too in love with a sense of their own epicness.-Roger is supposedly the protagonist's best friend and her motivation for doing everything she does in at least half of the book, and his death is supposed to be some significant turning point...yet he's by far the dullest, least developed, and least important character in the book. He says maybe 20 sentences in the entire novel and his longest continuous presence in the book is when he's asleep in a balloon. Time for Lyra to get a better, more interesting, best friend, which I assume happens in book 2.-The alethiometer is pretty damn hokey. It sounds like something Neville's grandmother would have given him in the HP series. It doesn't tell the truth so much as do the dirty work of plot exposition for Pullman. \"What's so-and-so doing?\" And then we get several paragraphs of background information and future predictions. Um, isn't that the kind of information that characters are supposed to figure out by being smart or making friends or discovering things on their own? On the other hand, if the alethiometer is indeed something marvelous and great, then why didn't Lyra use it all the time? There were a couple of times when she was wondering about something or needed a crucial bit of information, but she either chose not to consult the alethiometer or forgot about it. I'm sure that was intentional on Pullman's part, because it was a way for him to show Lyra messing up or figuring something out on her own. But if I had an alethiometer at my disposal, I'd be using it all the time, and there was no good reason why Lyra shouldn't have done that, too.-Lord Asriel's great \"betrayal\" was completely obvious to anyone paying attention and wouldn't have been very surprising even if you weren't expecting it. The fact is, he never came across as a \"good guy\" to me from the very beginning, if for no other reason than that he was a bastard to Lyra from the very first chapter. He obviously didn't give a flip about his daughter, so why shouldn't he betray her to get what he needed to satiate his ambition? Lyra was stupid to ever trust him in the first place. I'm hoping she acquires a little bit deeper faculty of character judgment in the next book.Despite my criticisms, it was an enjoyable book overall, and it's quite refreshing to read a children's fantasy story that still upholds virtues like bravery and sacrifice without resorting to the ideals and symbolism of Christianity. Pullman's writing is what really sold this book to me. The plot itself is nothing special and falls into the cliches/archetypes that most fantasy falls into, but Pullman is obviously more expert at the writer's craft than most children's authors, or even most fantasy authors, for that matter."}, {"Review": "Read until 51% and then skim read the rest. This was SOOOO disappointing. I was looking forward to it so much because the premise sounded incredible and I was excited to hear Pullman's atheism woven into his work, but everything about this book was bland. It was so slow moving and the characters were all so unlikable, I was honestly shocked that I was reading the same book that everyone else loved? Maybe it's because it lacked the nostalgia that a lot of people have with the series because I never read it as a child? I honestly don't think I'll continue on with the series even though I want to know what happens, but I'd honestly prefer to read plot summaries online rather than slog my way through 2 more boring af books. Around the Year in 52 Books Challenge Notes:35. An award winning book"}, {"Review": "If you're into stuff like this, you can read the full review.My first Philip Pullman, and probably my last.When I read a book I don't like, I usually figure it's just not for me, and I have different tastes, blah, blah, and move on. Not this time. The novel \"deserves\" a few notes. Philip Pullman has awfully combined two of the greatest conundrums of modern science, dark matter and the nature of consciousness, into one very week element within his narrative, and has connected it with the transition from childhood to adolescence. After all this is a YA novel.Pullman's suggestion is that children are not fully self-conscious until adolescence. This premise is nonsense, even for a book. Pullman's claim is that these elements of consciousness start streaming into the children and their daemons settle into a fixed form. Uhm...Come again?You can read the rest of this review elsewhere."}], "Image": "https://images.gr-assets.com/books/1505766203l/119322.jpg", "Desc": "Lyra is rushing to the cold, far North, where witch clans and armored bears rule. North, where the Gobblers take the children they steal--including her friend Roger. North, where her fearsome uncle Asriel is trying to build a bridge to a parallel world.Can one small girl make a difference in such great and terrible endeavors? This is Lyra: a savage, a schemer, a liar, and as fierce and true a champion as Roger or Asriel could want--but what Lyra doesn't know is that to help one of them will be to betray the other."}