{"Genre": "Fantasy", "ID": "228665", "Name": "The Eye of the World", "Reviews": [{"Review": "The first series that showed it was possible to do an uninspired rewrite of Tolkien and make a mint was Shannara. After that the doors were flung wide, and the next to profit off the scheme was was Robert Jordan. Of course, I'm not suggesting it's bad to take inspiration from older authors--all authors do this, as Virgil did from Homer, and Milton from Virgil, and Byron from Milton. Tolkien himself drew on the Norse Eddas, Welsh myths, English fairy tales, and Blake's myth-making.But when a skilled author takes inspiration, they expand and change what came before, combining many influences to produce their own unique voice and vision. Jordan didn't have the knowledge of language, history, or culture to truly copy Tolkien's style, nor was he able to add a unique spin.The Eye of The World is a more accessible version of Tolkien, but Tolkien is already a simplified version of the Norse Sagas, meaning that Jordan felt a need to dumb-down the accessible, which doesn't leave his book with much personality.Jordan also takes influence from the Sword & Sorcery tradition, particularly R.E. Howard (Jordan even wrote and published some of his own Conan stories). However, unlike other authors of rollicking adventure Fantasy, like Leiber or Charles Saunders, Jordan kept Tolkien's plodding length. It is difficult to comprehend how an author could take such a simple, familiar story and stretch it out over so many pages.The hero is an orphan who looks different, he gets his father's magic sword, he goes on a quest with an old, wily mentor, gets attacked by evil (dark-skinned) mongoloids from the mysterious East, meets the princess by accident, becomes embroiled in an ancient prophecy, discovers a magic 'force' which controls fate (and the plot), &c., &c. Stop me if you've heard this one before. Like a lot of modern fantasy, the plot and characters are nothing new. If you've seen Star Wars, then you know it by heart. Every fantasy fan has read this same story again and again from countless authors--some, apparently on purpose. Of course, when this old story is told well, with slick pacing and vivid characters, we can forgive the cliches, or even enjoy them freshly, recognizing their universal appeal. But when an author is simply trotting out an old, tired story and doing nothing to make it shine anew, then the only appeal it can lay claim to is bland nostalgia.There's no reason for this sort of repetition: a new book should be more than just fanfic of an older, financially successful book. There are countless different influences out there, long before Tolkien or Howard ever touched pen to paper (many of which can be found in the link at the end of this review), so it's disappointing to see authors continually rehashing the same tedious cliches completely unchanged half a century later.Jordan's long-winded style can't even boast the wealth of meticulous details with which Tolkien filled his pages (often to the detriment of his story). It's clear that Jordan's trying to build a one of those massively detailed worlds so prevalent in pop fantasy, but it's not an interesting, original world--it's just another generic, pseudo-Medieval Europe without any of the genuinely interesting bits that made that time period unique. It's just modern characters with modern psychology swinging around magic swords in a Disneyland version of history.It might not be so bad if the lengthy asides were actually interesting, in and of themselves. If each little piece was amusing in its own right, we might forgive. If they gave us some odd bit of defamiliarization that caused us to look at our own, modern world in a new way, that would be something. Instead, we get dry, lengthy explanations of extraneous facts that we had no reason to be curious about in the first place.Some readers have pointed out that these facts show up in later books of the series, which is probably true, but then, what are they doing in this book? If Mary doesn't appear until book three, it is not useful or interesting to stop in the middle of book one and tell us she has blonde hair. Facts should not be evenly distributed throughout a series, they should be placed in close proximity to scenes that relate to them. That way they make sense to the reader and we have a reason to care about them. That's the difference between foreshadowing and a word search puzzle.If an author has to stop the story every few paragraphs to explain what's going on, then his writing is simply not working. The world should be revealed to us through characters, through their interactions, through small details of verisimilitude that are lovely or interesting on their own, and through scenes designed specifically to illustrate a point without losing focus and falling into lengthy digressions.But Jordan's characters are dull and shallow, his dialogue bland, and his plot (though it possesses many parts) lacks twists or turns. We are given an unending parade of new characters and lengthy asides, which masterfully suck all the drive, purpose, and life from an otherwise simplistic story. At half this length, the book would have been merely another two-star fantasy rehash. At a third the length, it might have started to show some pep--but Jordan had to stretch out his all-to-familiar story to doorstop proportions.In Tolkien, the first hundred pages takes place in quaint Hobbiton. This prelude prepares us for the rest of the book, allowing us to understand the strange world and characters and setting a mood. When the action takes us away, we find we have formed a certain attachment to the bucolic charm of Hobbiton (sickly-sweet as it may be). Finally, when we do depart, the world we meet is much grander in comparison. In Eye of the World, you spend the first hundred and fifty pages in a drab farming community, so that when the characters finally leave, it will seem like something is happening. This is only an illusion.Some of Jordan's fans have pointed to the 'Wheel of Time' aspect as his unique contribution to the genre--mixing Eastern philosophy and the idea of eternal recurrence in with his mock-feudal world, but it's the same thing that E.R. Eddison was doing in the 1920s, and which Michael Moorcock has been exploring and expanding on since the sixties. As such, I don't see it as some new twist that Jordan has added to fantasy, but as another bland rehash of an interesting idea some other author had decades before.Also, like most fantasy authors, Jordan seems to have a problem writing female characters. They are either whiny and snotty, or emasculating ice queens. They all speak in the exact same voice--and the joke in the writing community is that anyone who has met his wife know exactly where every one of his female characters comes from. I couldn't count on both hands the fantasy authors who seem to think 'strong woman' means 'insufferable, unapologetic shrew'. Then again, it isn't as if his male characters aren't any more interesting or fleshed-out, even if they do get a more flattering depiction.I've also been led to understand that later on in the series, we get a magical band of lipstick lesbians who 'go straight' when they grow up (and meet 'real men', like our heroes), plus a bunch of sex-fetish weirdness about punishment by naked public spanking. But I suppose that if Jordan resembles other genre writers in terms of plot, length, setting, and character, he might as well go all the way and throw in some of his own unprocessed sexual hangups.And as the series goes on, the many problems with pacing, plotting, and unfocused asides only grow worse. If Jordan can't keep everything straight in his opening book, how will he possibly deal when the story starts branching out (as stories inevitably do)? It is hardly surprising that such a tenuous grasp will inevitably slip away--as it has for so many other authors in pop fantasy, from Martin to Goodkind, who start off intending to write a trilogy and end up with ten books, each of which takes five years to write, and none of which even manage to finish the plot started in book I.So, take the plot of Star Wars, add the long-windedness of Tolkien, the piecemeal structure of Howard, the cosmology of Moorcock, add in a pinch of awkward sexual hangups, and you have yet another crap pop fantasy, ready to sell a million copies to folks who want nothing more than to read the same story over and over as written by a succession of chubby, bearded, awkward dudes. I'm sure a violent, breast-baring miniseries is already in preproduction.UPDATE: one might point to the endless repetition in modern literature as a sure sign that there is no God, no grand plan, and no purpose to the universe. A benevolent power would surely spare us the pain of such unending mediocrity.However, if there were some deity, and he had a sense of humor, then he would allow the uncreative authors to publish, to gain fame, win awards, and rake in the cash, until their series piled self-indulgently to the length of a minor encyclopedia. Then our clownish deity would let the author announce that he is finally approaching The End (for real this time!), only to perish on the cusp. Since this is precisely what happened to Jordan, I will have to keep an eye out for other signs of this humorous demiurge, possibly in the form of leper-curing banana peels and hagiographic fright wigs.My Fantasy Book Suggestions"}, {"Review": "Paternity leave reading for 3 a.m. crying jags. (Mine and hers.)---There, Brian. I read it. Are you happy?My friend Brian has been telling me to read The Wheel of Time for years. It always went like this: Brian: You should read The Wheel of Time. It's really good.Me: I've heard that it gets really, really bad. B: The first seven books are really outstanding.M: Yeah, I'm not going to read seven books without an ending.B: The first one is good but the second one is better.M: Mmm. I don't know.B: The first one stands alone really well! [Retrospective commentary: NO IT DOESN'T]M: OK, lemee borrow it.[Several months pass]M: Here is your book back.B: Oh, you read it?M: No.I really thought I was never, ever going to start this series. Everything I read about it screamed at me to run away. Tolkien pastiche. Incredibly long. Characters with stupid names. Lots of \"world-building.\" The main villain is called \"The Dark One.\" WTF, trollocs?I have nothing against multi-volume, word-bloated epic fantasy. Not really. (Well, kind of, but I am willing to give it the benefit of the doubt: George R.R. Martin, that one Brandon Sanderson book I liked). But even the people who like The Wheel of Time also seem to apologize for doing so or outright resent it for what it became in the draggy middle. So why do I want to start reading it? If someone told me a show about a mysterious island was really entertaining and interesting for a while there, but then totally peed the ending down its leg, and really, that's a PRETTY BIG DEAL for a mystery show, even one that is purportedly focused on a bunch of unlikeable assholes characters first, would I immediately run home and start watching that show on Netflix streaming? No, because I'm the idiot who watched it all along, assuming I wasn't wasting my time. I think I am getting off track.So, I wasn't going to read this. But then I was off work for a few weeks on paternity leave, and my daughter was waking up five times a night, and I was unable to sleep even though, at that point, I didn't really have much to offer that she was interested in, and I had a copy of The Eye of the World that I absorbed for a quarter somewhere, and I've always had a thing for the goofy cover art. So I picked it up at 2 a.m. and read the prologue. And it was pretty much what I expected, what with the stupid names and bad dialogue. But it was also kind of... fun. Of course, I also knew (based on reading a bunch of reviews and blogs about this book series I never planned to read) that the next 150 pages were going to be, in the tradition of Hobbiton (Chapter One: Concerning Ensuring Joel Will Never Read Past the First Section of This Book) horrifically boring. So I almost put it back down.Then I remembered that my brother had the book in his Audible account, and that my phone lets you listen to books at double speed, meaning I'd get through the 30-hour production in roughly 15. That sounded about right -- the auditory equivalent of skimming (except I actually got really good at listening that quickly; you just kind of have to get in the zone).And it was exactly as I'd been led to believe: clumsy, repetitious prose (a few times I had to make sure the audio track wasn't repeating as the same dialogue and phrasing was repeated over and over). Meandering pacing and haphazard plotting (nothing happens nothing happens SOMETHING HAPPENS same thing happens five more times nothing happens rushed climax cliffhanger). Bland heroes (though in their defense, they are stupid teenagers). Blatant Tolkien rip-offery (OH MY GOD THE DAGGER IS OBVIOUSLY CURSED YOU IDIOTS). And my favorite, the pauses for self-indulgent infodumps (the \"best\" one comes in one of the last chapters and throws in so many weird names and covers so much time I have absolutely no idea what happened and why it mattered enough to put the climax on hold). The unsatisfying ending (the last chapters are rushed, drop in a few villains out of the blue only to defeat them a few pages later via a magical object that isn't mentioned until page 650 even though it's the freaking title).But. Um. I kind of liked it. The world is pretty interesting. I like the way Robert Jordan sketches out the history (even some of the infodumps are fun!). I like his magic system, and the powerful women who are feared and respected for tapping into it. I don't strictly care about the hero's journey at its core, but the weight -- the epicness -- of it all... Once the big, lumbering thing gets moving, it really has momentum.So here's where the real test comes. Do I read the second book? No, I do not.Do I listen to the second book at chipmunk speed?I really kind of want to. But doing that will only make me want to read book three, and, like poor Rand al'Thor accidentally touching the tainted power of saidin (dammit, Brian, see what you did?), that way lies madness and death.Maybe if Josh has an extra Audible credit."}, {"Review": "Reviewed by: Rabid ReadsNOTICE: this reread is in preparation for finally biting the bullet and reading book 14. That means I HAVE NOT read book 14 yet. Please be mindful of this in the comments, both for me and for others who may or may not have progressed past this point in the series. Thank you.It's hard for me to review this book, and only this book, objectively, b/c:1. WoT is my favorite high fantasy series. Ever.2. I've read the first eight books seven or eight times, maybe more (*whispers* I honestly don't know how many times I've read them). DON'T JUDGE.The first time, I was nineteen. Ish. I read all of the available books, back-to-back, schoolwork be damned. Then I read them again. YES, really. And I loved them even more the second time. I thrive on detail, you see. And Robert Jordan was a master of details. I caught so many previously missed foreshadowings, clevernesses, nuances, etc. that had flown right over my head the first time. It was spectacular. Like when Thom, Mat, and Rand jumped aboard Bayle Domon's ship, and Thom spun a tale for the captain, explaining how they happened to come upon his ship with Trollocs (nasty man-beast things) on their heels:\nNow it just so happened that he had earlier learned the location of Aridhol from a map given him many years ago by a dying friend in Illian whose life he had once saved . . .\nB/c didn't know it at the time, but Domon is an . . . wait for it . . . Illianer. *tips hat*The whole series is FULL of things like that.Rand al'Thor, Mat Cauthon, and Perrin Aybara are three young men on the cusp of adulthood. They live in Emond's Field, where they have small village concerns and small village lives.But when the previously mentioned Trollocs:attack their village, it forces them to accept that such creatures of the Dark One are not mere stories made up to scare children. And when the two strangers who arrived just prior to the attack turn out to be an Aes Sedai (wielder of the One Power) and her Warder (warrior/protector), the manboys learn that a small village life is not in the cards for them (HA!) and are forced to leave their homes to protect their families from the Great Lord of the Dark's minions, who won't stop until all three are in their master's grasp.Jordan does an excellent job of keeping you guessing: which manboy is the Dark One after and why? Is it really just the one, or is it all of them? If it is all of them, are they all equally important, or do the degrees vary? WHAT DOES IT ALL MEAN?!B/c this is not a simple story. And one thing we do know is that Rand, Perrin, and Mat are ta'veren, and as such they unwittingly pull others into their quest: a so-much-more-than-a-simple gleeman whose past regrets dictate his future actions, a young Ogier whose curiosity and wanderlust led him to leave his peaceful stedding home to see the things he's spent his life reading about, Rand's sweetheart who refuses to be left behind and longs to become an Aes Sedai herself, and the village Wisdom who feels compelled to both protect the young people from Aes Sedai machinations and also to break through the Warder's walls. Among many others. Each and every one of them vital in their own way.Also vital are the multitudes of seemingly random observations and commentary that in reality are the foundations of awesomeness to come. THESE BOOKS . . . layers and layers and still more layers. It's truly incredible.And despite having read The Eye of the World so many times that I practically have it memorized, I have yet to grow immune to the very real and heartbreaking struggles that many of the characters face. Whether it's Rand's terrible journey from his farm in the Westwood to Emond's Field, dragging his injured father to safety, Loial's treesong to preserve a small part of his Treebrother's sanctuary in the Blight, or Nynaeve's yearning for a man bound to a never-ending battle that he cannot win . . . I still feel it. *rubs fist over heart* Deeply.And if you are unaffected by Moiraine's tale of the long fallen Manetheren:\n\"But some did not flee. First in a trickle, then a river, then a flood, men went, not to safety, but to join the army fighting for their land. Shepherds with bows, and farmers with pitchforks, and woodsmen with axes. Women went, too, shouldering what weapons they could find and marching side by side with their men. No one made that journey who did not know they would never return. But it was their land. It had been their fathers', and it would be their children's, and they went to pay the price for it. Not a step of ground was given up until it was soaked with blood.\"\nthen you have only a black, shriveled thing in your chest cavity. SO. As daunting as this series may be (and I will never deny that it is daunting) . . . if you are a lover of fantasy, and you haven't read Robert Jordan's Wheel of Time, you are doing yourself a major disservice. The Eye of the World has the best prologue I've ever read IN MY LIFE, so I challenge you to read it. It's just a prologue. And if you don't feel the need to see what happens next, then hey . . . all you're out is the 15 minutes it took you to read it. ALSO, no one is holding a gun to your head. There's no law that says once you start, you can't stop until THE END. Take your time. Enjoy it. Or don't. Whatever. But my recommendation is that you do. These are the books that spawned my love of reading fantastical things as a adult.My other reviews for this series:\nThe Great Hunt (Wheel of Time, #2) by Robert Jordan\n\nThe Dragon Reborn (Wheel of Time, #3) by Robert Jordan\n\nThe Shadow Rising (Wheel of Time, #4) by Robert Jordan\n\nThe Fires of Heaven (Wheel of Time, #5) by Robert Jordan\n\nLord of Chaos (Wheel of Time, #6) by Robert Jordan\n\nA Crown of Swords (Wheel of Time, #7) by Robert Jordan\n\nThe Path of Daggers (Wheel of Time, #8) by Robert Jordan\n\nWinter's Heart (Wheel of Time, #9) by Robert Jordan\n\nCrossroads of Twilight (Wheel of Time, #10) by Robert Jordan\n\nNew Spring (Wheel of Time, #0) by Robert Jordan\nHighlights:(view spoiler)[1. EPIC prologue from Age of Legends.2. List of Gleeman's Tales (b/c always trying to figure out who Mat and Perrin were:\" . . . the entire Aptarigine Cycle. Tales of Artur Paendrag Tanreall, Artur Hawkwing, Artur the High King, who once ruled all the lands from the Aiel Waste to the Aryth Ocean, and even beyond. Wondrous stories of strange people and strange lands, of the Green Man, of Warders and Trollocs, of Ogier and Aiel. The Thousand Tales of Anla, the Wise Counselor. ‘Jaem the Giant-Slayer.’ How Susa Tamed Jain Farstrider. ‘Mara and the Three Foolish Kings.'\"“Tell us about Lenn,” Egwene called. “How he flew to the moon in the belly of an eagle made of fire. Tell about his daughter Salya walking among the stars.”“Old stories, those,” Thom Merrilin said, and abruptly he was juggling three colored balls with each hand. “Stories from the Age before the Age of Legends, some say. Perhaps even older. But I have all stories, mind you now, of Ages that were and will be. Ages when men ruled the heavens and the stars, and Ages when man roamed as brother to the animals. Ages of wonder, and Ages of horror. Ages ended by fire raining from the skies, and Ages doomed by snow and ice covering land and sea. I have all stories, and I will tell all stories. Tales of Mosk the Giant, with his Lance of fire that could reach around the world, and his wars with Elsbet, the Queen of All. Tales of Materese the Healer, Mother of the Wondrous Ind.” The balls now danced between Thom’s hands in two intertwining circles. His voice was almost a chant, and he turned slowly as he spoke, as if surveying the onlookers to gauge his effect. “I will tell you of the end of the Age of Legends, of the Dragon, and his attempt to free the Dark One into the world of men. I will tell of the Time of Madness, when Aes Sedai shattered the world; of the Trolloc Wars, when men battled Trollocs for rule of the earth; of the War of the Hundred Years, when men battled men and the nations of our day were wrought. I will tell the adventures of men and women, rich and poor, great and small, proud and humble. The Siege of the Pillars of the Sky. ‘How Goodwife Karil Cured Her Husband of Snoring.’ King Darith and the Fall of the House of— ”3. Tam's \"fever talk.\" *wails*4. MANETHEREN.5. “The rose petal floats on water,” Lan recited softly. “The kingfisher flashes above the pond. Life and beauty swirl in the midst of death.” “Yes,” Agelmar said. “Yes. That one has always symbolized the whole of it to me, too.” The two men bowed their heads to one another.Poetry out of Lan? The man was an onion . . . 6. Lord of the Seven Towers.7. BEST SETTING DESCRIPTION EVER:Mile by mile the corruption of the Blight became more apparent. Leaves covered the trees in ever greater profusion, but stained and spotted with yellow and black, with livid red streaks like blood poisoning. Every leaf and creeper seemed bloated, ready to burst at a touch. Flowers hung on trees and weeds in a parody of spring, sickly pale and pulpy, waxen things that appeared to be rotting while Rand watched. When he breathed through his nose, the sweet stench of decay, heavy and thick, sickened him; when he tried breathing through his mouth, he almost gagged. The air tasted like a mouthful of spoiled meat. The horses’ hooves made a soft squishing as rotten-ripe things broke open under them. (hide spoiler)]Forsaken:(view spoiler)[1. “I am called Aginor,” the old one said. “And he is Balthamel.\"\"The seals weaken, Aes Sedai. Like Ishamael, we walk the world again, and soon the rest of us will come.\"(view spoiler)[Two down, eleven to go. (hide spoiler)] (hide spoiler)]Foresight:(view spoiler)[1. He had no choice but to go, but he would come back to Emond’s Field, however far or long this journey was.2. \"I whispered in Artur Hawkwing’s ear, and the length and breadth of the land Aes Sedai died. I whispered again, and the High King sent his armies across the Aryth Ocean, across the World Sea, and sealed two dooms. The doom of his dream of one land and one people, and a doom yet to come.\"3. “What do you see when you look at . . . the rest of us?” “All sorts of things,” Min said, with a grin as if she knew what he really wanted to ask. “The War . . . ah . . . Master Andra has seven ruined towers around his head, and a babe in a cradle holding a sword, and . . .” She shook her head. “Men like him—you understand?—always have so many images they crowd one another. The strongest images around the gleeman are a man—not him—juggling fire, and the White Tower, and that doesn’t make any sense at all for a man. The strongest things I see about the big, curly-haired fellow are a wolf, and a broken crown, and trees flowering all around him. And the other one—a red eagle, an eye on a balance scale, a dagger with a ruby, a horn, and a laughing face. There are other things, but you see what I mean. This time I can’t make up or down out of any of it.” She waited then, still grinning, until he finally cleared his throat and asked. “What about me?” Her grin stopped just short of outright laughter. “The same kind of things as the rest. A sword that isn’t a sword, a golden crown of laurel leaves, a beggar’s staff, you pouring water on sand, a bloody hand and a white-hot iron, three women standing over a funeral bier with you on it, black rock wet with blood—\" “All right,” he broke in uneasily. “You don’t have to list it all.” “Most of all, I see lightning around you, some striking at you, some coming out of you. I don’t know what any of it means, except for one thing. You and I will meet again.” She gave him a quizzical look, as if she did not understand that either.(view spoiler)[Lan: Malkier stuff. Thom: his nephew.Perrin: wolf = wolfbrother, or maybe Hopper if it's supposed to be a specific wolf. No idea about the broken crown, unless he's going to be the king of Manetheren, and trees flowering . . . *sobs* if you don't know what that's about, I'm not saying . . . Mat: red eagle = Manetheren, still no clue about the eye/balance scale thing (unless it comes up later, and I've forgotten. Which is entirely possible), dagger is dagger from Shadar Logoth, horn is Horn of Valere, and laughing face . . . probably related to his role as a \"trickster.\"Rand: Callandor, Crown of Swords(from Illian?), don't know/can't remember about the beggar's staff, water in the Waste, bloody hand and white hot iron . . . not sure, three women and funeral bier, etc., again, if you don't know, I'm not telling. (hide spoiler)]4. I believe in tradition, I do, but look what it got us last time. Luc dead in the Blight before he was ever anointed First Prince of the Sword, and Tigraine vanished—run off or dead—when it came time for her to take the throne.\"5. “I’ve just remembered something, Aes Sedai, something I have always wanted to ask an Aes Sedai if ever I met one, since you know many things and have great libraries in Tar Valon, and now I have, of course, and . . . may I?” “If you make it brief,” she said curtly. “Brief,” he said as though wondering what it meant. “Yes. Well. Brief. There was a man came to Stedding Shangtai a little time back. This was not unusual in itself, at the time, since a great many refugees had come to the Spine of the World fleeing what you humans call the Aiel War.” Rand grinned. A little time back; twenty years, near enough. “He was at the point of death, though there was no wound or mark on him. The Elders thought it might be something Aes Sedai had done”—Loial gave Moiraine an apologetic look—“since as soon as he was within the stedding he quickly got well. A few months. One night he left without a word to anyone, simply sneaked away when the moon was down.” He looked at Moiraine’s face and cleared his throat again. “Yes. Brief. Before he left, he told a curious tale which he said he meant to carry to Tar Valon. He said the Dark One intended to blind the Eye of the World, and slay the Great Serpent, kill time itself. The Elders said he was as sound in his mind as in his body, but that was what he said. What I have wanted to ask is, can the Dark One do such a thing? Kill time itself? And the Eye of the World? Can he blind the eye of the Great Serpent? What does it mean?”Jain Farstrider?? B/c this:\"Jain Farstrider, a hero,” he twisted the word to a sneer, “whom I painted like a fool and sent to the Ogier thinking he was free of me.\"6. Green Man:“A Wolfbrother! Do the old times truly walk again then?”“Strange clothes you wear, Child of the Dragon. Has the Wheel turned so far? Do the People of the Dragon return to the first Covenant? But you wear a sword. That is neither now nor then.” (hide spoiler)]Musings:(view spoiler)[1. Only, how did he tell his father that the man who had apparently vanished into air wore a cloak the wind did not touch?There are a LOT of turning points in this series. Probably thousands. But this one . . . even as early in the story as it is, knowing what we know about Tam (view spoiler)[that he fought in the Aiel War (hide spoiler)], how differently could things have gone if Rand had told him?2. “What could be worse than wolves killing sheep, and men?” Cenn Buie demanded. Others muttered in support.Oh, the naiveté . . . 3. The dead fell like autumn leaves . . . It's pretty; I like it.4. “From Saldaea, eh?” Elyas said when she was done. Perrin nodded. “That’s right. We thought about seeing Maradon first. I’d surely like to see the King. But the capital city would be the first place our fathers would look.”Saldaea has a QUEEN, you dolt.5. “We used to dig up bones in the Sand Hills,” Rand said slowly. “Strange bones. There was part of a fish—I think it was a fish—as big as this boat, once.\"Hmmm . . . if the Two Rivers is part of what was once Manetheren, why would part of it have been underneath a body of water so deep it could support the lives of fish as big as ships? Manetherendrelle means \"waters of the mountain home,\" after all . . .  (hide spoiler)]It makes me laugh:(view spoiler)[1. “We left notes,” Mat said. “For our families. They’ll find them in the morning. Rand, my mother thinks Tar Valon is the next thing to Shayol Ghul.” He gave a little laugh to show he did not share her opinion. It was not very convincing.2. Thom grimaced. “The fall of the Stone will be one of the major proofs that the Dragon has been reborn. May the Stone stand till I am dust.”3. Nynaeve pushed at Lan’s arm again; it still did not move, and she decided to ignore it.4. When he asked, not thinking, for “The Tinker Has My Pots,” they fell all over themselves laughing. (hide spoiler)]"}, {"Review": "Re-read with some wonderful friends over at Fantasy Buddy Reads and it's still 5 stars!MY BLOG: Melissa Martin's Reading ListThat was an amazing little journey. I'm going to give it my all to make this a good enough review, but I kinda doubt it because this book is too great for my measly little words :-)WELCOME TO THE WORLD KNOWN AS THE WHEEL OF TIMESince I'm not good at explaining certain things, I'm so glad the author put a glossary in the back of the book so I can sound all smart when I tell you what things are! BOOK GLOSSARY DESCRIPTION OF WHEEL OF TIMETime is a wheel with seven spokes, each spoke of an age. As the Wheel turns, the Ages come and go, leaving memories that fade in legend, then to myth, and are forgotten by the time that Age comes again. The Pattern of an Age is slightly different each time an Age comes, and each time it is subject to greater change, but each time it is the same Age.Here is an eeny meeny map that shows the lands our travelers cross in the book. The story starts out with Rand and his father Tam traveling to the village to sell some things. When they get back home they are attacked by Trollocs and Rand's father is injured very badly. Rand manages to get Tam back to the village to try to find a healer. --->backtrack When Rand went to down he was hanging out with his friends Mat and Perrin and all three of them had been seeing this dark figure on a horse that no one else sees. Also a woman named Moiraine and man named Lan had shown up, oh and a gleeman named Thom. There a whole bunch of stuff going on with this but I can't get into it. Anyway, back to the attack, when Rand gets back to the village the town healer, Nynaeve says she can't help him and he is just going to die..BUT.. Moiraine helps him and he will live. Moiraine is my favorite character and she's an Aes Sedai, which is (going to refer to glossary again)Aes Sedai: Wielders of the One Power. Since the Time of Madness, all surviving Aes Sedai are women. Widely distrusted and feared, even hated, they are blamed by many for the Breaking of the World, and are generally thought to meddle in the affairs of nations. At the same time, few rulers will be without an Aes Sedai advisor, even in lands where the existence of such a connection must be kept secret.Don't let that fool you because in this book Moiraine is bad to the bone with her powers but she's a good person so they can suck it! She is traveling with Lan and he is a Warder, I love him too :-) Another glossary definition below ↓Warder: A warrior bonded to an Aes Sedai. The bonding is a thing of the One Power, and by it he gains such gifts as quick healing, the ability to go long periods without food, water, or rest, and the ability to sense the taint of the Dark One at a distance. So long as a Warder lives, the Aes Sedai to whom he is bonded knows he is alive no matter how far away he is, and when he dies she will know the moment and manner of his death.There is a little more to it than that but you the idea. So, Moiraine and Lan know that the boys are being targeted by the Dark One who is sending the Trollocs and the Myrddraal (who controls the Trollocs) after them to bring them to him. It's a whole big thing that starts this journey. Moiraine and Lan decide they need to try to get the boys to a safe haven which will take a long time to get to and will be dangerous. So they get Rand, Matt, Perrin to go on this journey and a friend of the boys named Egwene decides she wants to go and so does the Gleeman, Thom. So they all get the hell out of there at night before the Trollocs show back up! At some point they all get split up and we get to read about their different adventures, oh and Nynaeve shows up to go with them. My favorite is about Perrin and Egwene because they run into a character named Elyas and he talks to wolves and is friends with wolves, they help each other out and I love it. Although, one part made me want to hunk smash someone, but I digress....This whole world is written so beautifully, I felt like I was there, mostly the parts when they were in the woods or traveling at night, I could picture every little thing the author said down to a T. I probably would have missed these wonderful books if it wasn't for friends on Goodreads, I'm so glad I get to find more books like this and many others because there are so many different kinds of worlds out there to find, hidden out there for us to grasp and love. The funny thing is, my best friend has had these books forever and never told me! I tore him a new one let me tell you. Not really. LoL I would like to think anyone that loves fantasy books would love these books. Now that being said, I have only read the first one so I don't know how the next 13 are going to be, I can only hope they are as good as this one. This book has a whole world of things going on, towns, different kinds of people, adventures, quests people are going on, it's just so much fun and there are some deaths... You could get lost in this book while traveling with each character. I also loved that the author gave all of the horses names and they weren't just random things in the book. Bela being my favorite of course and you will know why when you read the book. If your waiting to read this book, just go ahead and take the chance and try it out!"}, {"Review": "Robert Jordan copied Tolkien but, I just don’t care. What I mean is that his writing shouldn’t be judged on this single fact. Yes, Jordan has borrowed aspects of Tolkien’s middle earth; yes, he has blatantly reworked many aspects, but he has also infused it with a few of his own original ideas. The result is a fantasy universe that resembles Tolkien’s and, in some ways, transcends it.  Not completely original, but completely brilliant I found that Jordan’s world wasn’t as obvious as Tolkien’s. It is not a blatant light verses dark mission. There are characters that are evidently pure, but there are also those whose motives are not entirely clear. Well, at least not in the beginning. Don’t get me wrong I do, of course, prefer Tolkien’s writings; however, some of the characters in the Wheel of Time are more complex and are not entirely obvious in their convictions at the start of the series. For example the Gleeman has a very minor part at the start of the book, but towards the middle we realise that there is much more depth to him. He no doubt has a part that will be revealed in later books. The same is true of Lan and Moraine because their intentions are veiled at the beginning. “She’s not for you, nor you for her; at least, not in the way you both want.”Indeed, Moraine and Lan take the boys away from the village. Rand, Mat and Perrin are forced to go along with them for their own safety. They do not know who this mysterious figure is or the inner working of her stoic guard Lan. Their so called saviour is an Aes Sedai, which are a group that are renowned for doing thing for their own secret motives. Their actions may appear benevolent, though often there is a hidden reason behind them. So, it is not entirely clear, in the beginning, if the boys are being rescued, used or a little of both. Their rescuers are shunned, hated and feared by most people; thus, the reader is left to decide whether to judge them on their actions or their reputation.  A story of growth and perfect fantasy Rand is the dragon reborn; he is essentially the chosen one of this fantasy universe. The three boys are unsure which of them is being hunted by the minions of the Dark One, but it is clear to the reader, and to Rand himself that it is, in fact, Rand the enemy is after. In spite of this, each of the boys overcomes a massive personal obstacle. Mat is almost lost forever when he takes a dagger of extraordinary evil. Perrin conquers his fear and discovers the kin of his soul: the wolf. Rand begins to accept his destiny and realise that it is completely unavoidable and definitive: it has happened before and will happen again. “You cannot escape so easily, Dragon. It is not done between us. It will not be done until the end of time.”The characters have come a long way in this novel, and I do look forward to seeing how far this series will take them. Rand is just becoming a man, but his youth is very much on the surface. I don’t think he is quite ready yet. The world is a dangerous place; it is full of warring factions and evil doers; it is full of thieves and backstabbers; it is full of mysterious, and blood thirsty, creatures that have their own dark desires. It is a world full of strange magic that is just waiting to be harnessed. For me, it is everything I want in high fantasy.  An inspiration  This book is not rich in originality; it is not a pioneer for its genre, but what it is, is a highly entertaining adventure. This may be another story of evil trying to conquer all; it may be a story we have seen many times before, and since, but it is still incredibly exciting to read. The plot is incredibly immersive and is just a pleasure to read. I don’t care if this isn’t completely original because I enjoyed it regardless. So I’ve spoken a lot about the comparisons with Tolkien, but Jordan’s work has also clearly inspired other writers. They have used element of his magic system and some of his fantasy ideas. Is their writing bad because of this? No, it’s not. It just means that they took an idea that was good and reworked it for themselves; it means that they, like Jordan, were amongst the first to reuse an idea before it became too overworked and boring, lucky for them really, and lucky for us because we get to read great high fantasy more than once. I enjoyed this book a lot, and I promise in my review for the rest of the series not to mention the name Tolkien. I just had to get that mighty obstacle out of the way. This book reminds why fantasy fiction is, and will always remain, my favourite genre. The Wheel of Time1. Eye of the World- An unoriginal five stars 2. The Great Hunt-  A reluctant three stars3. The Dragon Reborn- A well-developed four stars4. The Shadow Rising- A strong four stars5. The Fires of Heaven- A slow two stars\n“The Wheel of Time turns, and Ages come and pass, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth comes again. In one Age, called the Third Age by some, an Age yet to come, an Age long past, a wind rose in the Mountains of Mist. The wind was not the beginning. There are neither beginnings nor endings to the turning of the Wheel of Time. But it was a beginning.” \n"}, {"Review": "\"And the Shadow fell upon the land, and the world was riven stone from stone. The oceans fled, and the mountains were swallowed up, and the nations were scattered to the eight corners of the World. The moon was as blood, and the sun was as ashes. The seas boiled, and the living envied the dead. All was shattered, and all but memory lost, and one memory above all others, of him who brought the Shadow and the Breaking of the World. And him they named Dragon.And it came to pass in those days, as it had come before and would come again, that the Dark lay heavy on the land and weighed down the hearts of men, and the green things failed, and hope died. And men cried out to the Creator, saying, O Light of the Heavens, Light of the World, let the Promised One be born of the mountain, according to the prophecies, as he was in ages past and will be in ages to come. Let the Prince of the Morning sing to the land that green things will grow and the valleys give forth lambs. Let the arm of the Lord of the Dawn shelter us from the Dark, and the great sword of justice defend us. Let the Dragon ride again on the winds of time.\"I have read a lot of books throughout my mere twenty years of life. Some deeply fascinating, others not so much. And every once in a while I am able to lay my eyes on something truly extraordinary. One of those is definitely The Eye of the World by Robert Jordan.This is not a book turning fantasy literature on its head, or even providing the genre with major changes. When reading it, I was quite easily able to find strong similarities with lots of previous works of fantasy and science fiction, including The Lord of the Rings, Dune and Shannara. It is not among the most innovative books I have read. It is not among the most exciting books I have read. It is, however, a stunning work of pure quality which deserves to be read by all fantasy enthusiasts out there.I do not intend to write in great lengths about the story and the characters in this review, and I feel that I have already mentioned what needs to be mentioned. Most of you have already read this book. Those who have not, should really take the time and effort to do so. It is absolutely worth it.When I had read more books in the series, it had grown more and more in my estimate. Even at that early stage, this was definitely one of my favourite fantasy series ever. And definitely the best example of fantasy worldbuilding since Tolkien. At that point I was starting to wonder whether I actually considered it better than even my beloved A Song of Ice and Fire, but only time would tell there.After two years of reading, the longest I have ever spent on one single story, I have reached the end. And because of my never-ending obsession with favourites, I can finally make the official statement: Wheel of Time is my favourite fantasy series of all time. That still means it is surpassed by Tolkien's works, which do not make up a series, but this is just about the highest praise I can give.It has its boring parts just as it has its brilliant parts. It has endless descriptions of brain-tugging and Jordan's ridiculously annoying battle of the sexes. It has the worst protagonists I have ever met in fictional literature. And so much more. But I don't care.Because it also has the most magnificent setting you could possibly imagine. It has brilliant characters, wondrous and fantastic places, and deep and thrilling backstories wherever you turn. Not to even mention Robert Jordan's astounding writing.The best part about Wheel of Time is that it gives me a feeling only one book has been able to give me before. One. It should be needless to name that one, but this is definitely high praise coming from me.So treat this series like an exquisite wine. Save it for the perfect occasion, and then savour every drop. It can be a challenge to get through, but it is definitely worth it.This is in my eyes fantasy as it should be written.\"The Wheel of Time turns, and Ages come and pass, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth comes again.\"(Note: Review updated and expanded 3/3/2016)Wheel of Time reviews:#1 \nThe Eye of the World\n#2 \nThe Great Hunt\n#3 \nThe Dragon Reborn\n#4 \nThe Shadow Rising\n#5 \nThe Fires of Heaven\n#6 \nLord of Chaos\n#7 \nA Crown of Swords\n#8 \nThe Path of Daggers\n#9 \nWinter's Heart\n#10 \nCrossroads of Twilight\n#11 \nKnife of Dreams\n #12 \nThe Gathering Storm\n#13 \nTowers of Midnight\n#14 \nA Memory of Light\n"}, {"Review": "2 stars for the benefit of the doubt, because I DNFed this shit at page 10. This is my new record.Look, I'm sorry. This is another one of those Lord-of-the-Rings moment where I appreciate the effort, but this is not for me. Within the short amount that I read, I had names and random bits of history thrown at me and maybe it's because it's this early in the morning, but I nearly fell asleep and I honestly can't recall anything that I've read. I have a feeling I'd have a better time reading a textbook. "}, {"Review": "Book One of my epic buddy read of the Wheel of Time world with Branwen Sedai, one of the nicest people of OUR world! :D From the Eye of the World, you can see just how much danger the world is really in!(That's not in the book, I just made that up myself. Don't worry, Robert Jordan's writing isn't nearly as cheesy as mine!)Life in the village of Emond's Field had always been peaceful. Sure, the people sometimes argued, as families do from time to time. But ultimately, the village was a tight-knit community, and people rarely left, since they had everything they needed at home. It was a quiet life, but a fruitful one. One where people felt safe enough to leave their doors open to everyone, secure in the knowledge that the greatest evil in the world, the one most people only refer to as the Dark One rather than daring to even speak its name, was safely locked up and could no longer hurt them. That all changed the night the invaders came into town. Vicious misshapen creatures and supernatural fiends from people's worst nightmares. And their presence means something even more terrifying. The seals on the Dark One's prison are not as secure as they thought. A great evil is spreading throughout the land, whispering in people's ears and poisoning and corrupting anyone who chooses to listen.Now, a group of youngsters from the village find themselves chased from their safe home. They've traded their quiet lives for a daring adventure, one worthy of the greatest storybooks...but only if they survive long enough to tell it. And as they find themselves entwined in the ultimate war of light verses darkness, there is one burning question that haunts them throughout...\"Is one of them destined to be the person to save the world...or to destroy it?I'm actually writing this review long after reading the book, and truth be told, I still haven't been able to wrap my head completely around it! Robert Jordan's world-building is so vast and intricate, it takes time to be able to absorb it all. His lush descriptions of the environment bring his words to like so effectively, you sometimes feel like you're living the book rather than reading it. But I think the book's greatest strength is its main characters, who I'll be discussing in order of my own personal preference:Moiraine - \"Whatever the Dark One wants, I oppose, so hear this and know it true. Before I let the Dark One have you, I will destroy you myself.\"Moiraine is part of a society of magic wielders called the Aes Sedai. Later books get more into the various factions of the Sedai and the ideological differences between them all, but mostly what we're told about the Sedai in this volume is that many people fear them...and they may be right in doing so! Strong in mind, spirit and ability, Moiraine is a commanding yet charming presence from the moment she arrives at Emond's Field. Her magical powers and sense of authority reminded me of Tolkien's Gandalf...right up until the point where Moiraine promised the boys she would murder them if it was the only way to keep the Dark One from claiming them! That's when I realized Moiraine is really more like Gandalf if Gandalf's contingency plan was to throw Frodo into volcano along with the Ring if he had to!\"Of course, if anyone earned the right to throw Frodo into the fire, it was Sam!\"Nynaeve - (Perrin talking about Nynaeve): \"You think a little thing like a sunken ferry could stop her?\"Known as The Wisdom of Emond's Field, Nynaeve mostly acted as a healer and a mediator during her time there. I'll be honest, at first I found Nynaeve a little abrasive. Not only does her temper cause her to hurt people with her words, sometimes she even hits them with a large stick, and what first felt like \"tough love\" starts to feel more like a WrestleMania event! (For the record, if Nynaeve was a pro wrestler, she's so tough she would win every match, no matter who was actually scripted to win!)\" However, when a group of Two Rivers villagers leave with Moiraine, Nynaeve travels many miles and face many dangers just to bring them back. While the others are mostly motivated by self-preservation, Nynaeve's main concern was to protect the people of her village. How could I not admire Nynaeve after that? She started out one of my least favorite characters and by the book's end had become one of my favorites instead!Rand - \"A fine day for going unnoticed! I might as well carry a sign!\"Most of the book is told through Rand's POV, and it was through him that I felt Jordan pulled off his best writing trick. Rand is very different from most fantasy novel heroes. Whereas most fantasy protagonists tend to be swashbuckling, Rand manages to be...uh, whatever the exact opposite of swashbuckling is! (Unswashbuckling???) If he's running across a 100-acre field that has only one rock in it, you can bet Rand will manage to trip over that rock! If a stranger holding a warhammer asked Rand, \"Would you please follow me into this trap?\", Rand will be there right behind him! At times, Rand made me want to scream. But I also recognized that that was due to the brilliance of Robert Jordan's writing. Rand acts exactly like what he's supposed to be, a sheltered, innocent boy who is in way over his head. Add to that his affable personality, and it's impossible not to like him...which makes it even harder to watch when he manages to blunder into a life-threatening situation for the 1,000th time that chapter!Lan - \"Anything can be a weapon, if the man or woman who holds it has the nerve and will to make it so.\"Jimi Hendrix...Sean Connery...Samuel L. Jackson...some people were just born to be cool...\"This is NOT one of those people!\"Strong and stoic, Lan makes an impression as soon as he arrives with Moiraine. While Moiraine is really the more powerful of the two, Lan is still the more intimidating one. What's even more impressive is that Lan manages to be bad-ass not in what he says, but in what he DOESN'T say! Lan rarely feels the need to threaten anyone, as one look into his eyes tells people you're more likely to survive a 20,000 foot drop (sans parachute) than a fight with him! Lan is so confident he never feels the need to prove himself to anyone, and as a result he never loses his cool. In fact, he manages to be even cooler than Sean Connery and Samuel L. Jackson combined! (But not Jimi Hendrix...even in a fantasy novel, someone being cooler than Hendrix is just too far-fetched!)Perrin - \"Leaders in stories never had to put up with this sort of thing.\"Of the three Emond's Field boys that travel with Moiraine, Perrin is the most compassionate. Physically stronger than the other two, but also kinder in nature, Perrin is very likable. Awkward, but likeable. In these types of novels, the characters usually have to get used to the idea of killing their enemies right away, but what makes Perrin stand out is that he NEVER gets used to it. Facing so many dangerous foes, in order to survive, Perrin may have to fight, but he doesn't have to like it!Egwene - \"No one tells us how to be men. We just are.\"\"That is probably why you make such a bad job of it.\"Egwene managed to charm me, even though she really has the weakest motivation in the story. While the boys of Emond's Field are running for their lives, and Nynaeve is pursuing them to try to protect them, Egwene says she's tagging along because she wants adventure. (You would think after her village was ransacked the night before, the ol' adventure meter would have been full already!) Of course, it's entirely possible Egwene was really just going with them because she was concerned about the boys, but that theory is somewhat weakened by the fact that she can't go 5 seconds without hurling an insult at one of them! Still, her wit and feisty nature made me like her even in the moments when she was hard to like.Loial - \"A mob chased me all the way across the city. I'm afraid I was beginning to get a little upset\"Since I said I would talk about these characters in the order in which I liked them, the fact that Loial appears second-to-last may seem like a swipe at him, but really it's a testament as to how great the other characters are! Giving new meaning to the phrase \"gentle giant\", Loial is a Ogier (basically an ogre) who would much rather have a book in his hand than a weapon. Really, the only reason Loial doesn't make quite as much of an impression in the story as the others is because he is introduced much later in the book than everyone else.Mat - \"So you're having trouble with a couple of farmboys. Maybe you Darkfriends aren't as dangerous as I've always heard.\"Sometimes you wish book characters could come to life because they're so awesome. In Mat's case, I wanted him to come to life just so I could murder him! The only character I couldn't stand, Mat manages to exude 10 times the foolishness of Rand yet 0 times the charm. He's obnoxious and grating. The scariest part is, I get the feeling Mat was supposed to be the comic relief character, despite the fact that he rarely does anything funny. Mat is to comedy what Arnold Schwarzenegger is...to comedy!In fairness to Mat, I'm currently reading Book Three in the series, and he does show a good amount of character growth by then...but that doesn't change the fact that all throughout this book, while Mat was being chased by the Dark One, I found myself rooting for the Dark One!While I loved this book, I will say that it's not for everyone. The world-building is a little clunky at times, as Jordan has a tendency to make mentions of characters and places long before they actually appear in the story. In some ways, this makes the later books more rewarding, as things that were left a mystery in book one make much more sense later on. Also, there are long gaps in the action sometimes, so anyone looking for a fast-paced adventure may be frustrated with this one. However, if you're looking for a rich world to explore filled with compelling characters (and Mat), then it's time for you to journey to the Eye of the World!P.S. - Here was my original review, I wrote it right after a few GoodReads users got busted for plagiarism, and I addressed it in my usual subtle way...I, David Green, absolutely loved this book! It's going right on my favorites shelf, which is named \"David Green's favorites\", because my name is, in fact, David Green! I can't wait to read the rest of the series which has already been uploaded to David Green's (that's me) Kindle!Let's see you copy/paste THAT, review thieves! ;)"}, {"Review": "Let me preface this by saying very clearly that I mean no offense to The Wheel of Time fans. It’s just my opinion, yes? Just my humble opinion.So. Simply put: I hate this book. Somewhat passionately. The Romgi will attest to the fact that while I was reading I would mutter to myself about how ridiculous the plot was or how much I hated dragging myself through all 800+ pages. But I carried on.The main character, Rand, was so uninteresting that I honestly didn’t care what happened to him, nor do I have any interest in reading any more books in the series to find out if his story continues. I hope it doesn’t. I hope he dies a gruesome and painful death, leaving the entire Wheel of Time world to decay and be overrun by the forces of evil. Having a flawed main character is sort of necessary, but where were Rand’s strengths? He had a few spots of luck, and happened to be traveling with people significantly more talented than he. When he wasn’t protected by others’ cleverness and skill, he was stuck with Mat, who may possibly be the most idiotic character ever created. Perhaps that’s going a bit far. Mat is almost without a doubt the most idiotic character I have ever had to read about. I hate Mat about as much as I hate this book. His sole purpose as a main character is to screw things up for everyone else while being absolutely necessary to the Quest or Mission or whatever. Gosh I hate him.Ok, there were some ok parts. Things I enjoyed on some level: Perrin (although couldn’t the author think of a name slightly less similar to Peregrin?) and his wolfness; the Tuatha’an (Gypsies); and Loial, an Ogier (basically a redesigned Ent).The whole book was just such a patchwork collection of ideas and myths and fantasy cliches, like the author had a hat full of slips of paper with possible elements he could use and randomly pulled them out. To be fair, it appears he put quite a bit of thought into connecting everything once it was out, but seriously - Gypsies and yin-yang in the same story? A little weird, don’t you think? Oh yeah, and then there are obvious copies of Orcs and Ringwraiths, which the author intended to be similar. Not creative! Do not give him credit for that!I feel I’ve gone on long enough. But just in case you didn’t catch my opinion, The Eye of the World has a horribly contrived plot, uninteresting or downright annoying characters, and too many pieces of stories to be worth the many hours of my life that were sucked away by reading it.Yuck.P.S. I think Robert Jordan is a lousy writer. Aside from not having enough of his own ideas, he just doesn’t have the literary genius to make this book worth it. The Eye of the World reads like a cheap fantasy book you’d pick up from the $1 bin at a used bookstore, except it happens to be one of the bestselling books ever. Undeservedly so, I think."}, {"Review": "I would like to start out by saying: don’t let my conservative rating scare you off from this series. At least 75% of customers I talk to about fantasy rank this series in their top 3, if not their #1. I am definitely the minority here, as the book didn’t even make my top 20.Don’t get me wrong, it’s still a classic that deserves its place as one of the all-time fantasy greats, it just happened to have some elements that I personally didn’t care for. As the beginning of an epic quest not unlike that of Tolkien, I found it a bit long-winded. Not boring, mind you, as there were several highly developed and exciting characters (who were frankly the biggest reasons why I’m tempted to read the second book). The magic system and overall measure of time were also highly original and interesting, even though we didn’t get to learn much about them.No, what the book lacked is that sense of excitement I usually feel while reading a great fantasy novel. I believe this is due to poor pacing decisions rather than any issues with the plot. It was just too slow-moving with too many senseless encounters. There also wasn’t much of an arc, lacking the sort of emotional highs and lows that usually go along with good storytelling. I definitely would’ve appreciated more time spent on the climax of the book rather than endless chapters of the characters meeting one fat innkeeper after another. I guess I just missed that emotional payoff – I suppose I’ll have to evaluate the series as a whole for that kind of reaction.Overall, I respect this author a great deal, as I believe he has done wonders for the fantasy genre by inspiring new authors every day. There are just too many out there that I enjoyed more.Via Book Reviews by Niki Hawkes at www.nikihawkes.comOther books you might like (better):\n\n\n\n\n"}, {"Review": "*SPOILER FREE*You know that thing that happens with your favorite series? You know, that thing. Someone either asks you about it, or you sit down to try and write a review for one of the installments, and all you say or type is dying animal noises. Kinda like this: \"Navessa, what did you think of this book?\"\"AAAAARRRRRRRHHHHNNNNNNNNNAAAAACCCCC\"\"Um...are you okay?\"\"AAAAARRRRRRRHHHHNNNNNNNNNAAAAACCCCC\"\"Are you having some sort of fit right now? Do I need to call someone?\"\"AAAAARRRRRRRHHHHNNNNNNNNNAAAAACCCCC\"That's me with this series. I've actually made that noise at people. In public. I don't think this can technically be called a brain fart, because that only applies for when you're drawing a blank. We need a new term. How about brain constipation? Brain Constipation: when you have so much to say that you can't get anything out.Yeah, I think I like that. Okay, so here's me trying to type past my desire to hit caps lock and slap at the keyboard like some sort of hysterical sea lion. This series, without a doubt, is nothing short of a masterpiece. This is (by far) the most richly imagined world I have ever come across in literature. And the way it all unfolds is so organic that you don't even realize you just read twenty pages of world building, because it happens mostly through conversations, because you learn about this world as the main characters do. They hail from a tiny town as far away from civilization as you can get. When the book begins, they know next to nothing about the outside world other than rumors. Everything changes for them one spring evening, and before they know it, they're brought face to face with creatures that they thought only existed in stories used to frighten children into behaving. This book follows the same pattern that most of the books in this series do. It's told mostly through the perspectives of our main characters, half of whom are male, and half of whom are female. Nearly 90% of it is made up of world building, character building, plot twists, and traveling, while the last 10% or so is dedicated to the climax. Throughout this series you learn about the unique cultures and peoples of each country the MCs travel through, their customs, their politics, and their everyday lives. I know that seems pretty daunting, but Jordan adds the perfect amount of action and intrigue to every single chapter, balancing out the world building so that it never feels like you're reading an info-dump. Quite a feat when you take into account that the books in this series are all over 600 pages long. In short, this series is nothing more than a masterpiece. A staggering one. It actually makes me feel a little bad about myself. Because my imagination is a small, sad thing compared to what Jordan's was. Blog | Facebook | Twitter | Instagram | Pinterest"}, {"Review": "● Epically Epic Buddy Read with the BBB gang ●☢ Friendly warning: this book is looooonnng. How short do you think my review is going to be? That's right, time to do the \"get a snack, grab a drink, we're going to be here for a while\" thing ☢☢ Friendly warning #2 (view spoiler)[wow, I can be so friendly sometimes! (hide spoiler)]: I seem to have recently contracted Acute Acronymitis Syndrome (AAS™). So prepare for a Painful Onslaught of Acronyms (POA™) ☢Actual rating: 3.5 starsYeah Yeah yeah, I know, I knocked off half a star from my original rating. So sue me. I can't win with you people, can I? I survive unscathed after going through 750 shuddering pages of Epic/High/Whatever Fantasy (EHWF™) and yet here you are, bickering like bitter old maids over a Gloriously Insignificant half star. Well if it was that Gloriously Insignificant I probably would not have bothered knocking it off, but if I said that, you Gloriously Freaky Fantasy Freaks (GFFF™) would be on my back again so let's pretend I never said any of this, shall we? Good. Moving on.Let's see, what should we start with? What do you want to hear about first? The good news, or the bad? Oh, you're the annoying type of people who always sees the glass half full and want to hear about the Good News first, are you? Okay, let's start with the Bad News then (view spoiler)[yeah yeah yeah, I know you love me as much as I do you (hide spoiler)].✎ There are three main reasons why I knocked off a Gloriously Not So Insignificant Half Star (GNSIHS™) from my original rating. Bye now. Hahaha, I'm so funny I kill my little self sometimes. Oh come on, smile a little, will you? You GFFF™ (as in Gloriously Freaky Fantasy Freaks, remember? Oh please do try to pay attention once in a while) seriously need to lighten up. You should read Mermen books once in a while, I'm pretty sure it would help you get off your EHWF™ (yes yes yes, I'm talking about Epic/High/Whatever Fantasy here. What did I just say about paying attention?) high horse. Oops, am I slightly digressing here? Damn. I knew I'd forgotten to put whisky in my coffee this morning. Strange things start happening when I don't get my fix. Okay, so where were we? Oh yes, the three main reasons I did The Thing That Shall Not Be Mentioned (TTTSNBM™) (view spoiler)[I like to add variety to my acronyms, it keeps things fresh and interesting (hide spoiler)]: ① Join the Greyish Dark Side of The Lord of the Rings. We have booze cookies:I'm pretty sure you're going to sue me again but I don't care. I mean, this smelled so much like teen spirit LOTR that I could feel hairs growing on my feet as I was reading. A bunch of naïve Hobbits country boys leaving the Shire Two Rivers for the adventure of a lifetime, off to fight against Sauron The Dark One, led by a powerful magician Aes Sedai. Oh, what am I saying?! I must have put too much whisky in my coffee lost my mind entirely, this has absolutely nothing to do with LOTR. NOTHING whatsoever.② There is epic and there is EPIC:Yes, I failed to see the EPIC in this. You know, EPIC as is WOW, now that was REALLY EPIC! Understand what I mean? Good, I'm glad I cleared that up for you. The fights/battles were particularly lacking here. And I really hate it when bloodshed is disappointing. It sucks big time (as in BIG TIME). Damn. Where is Glenn Cook when you need him?③ Something Not So Insignicant that the GFFF™ will probably think is a Supremely Super Silly Reason (SSSR™) to knock Half an Insignificant Star off my rating, but that bothered me to no end: Time for an Actual Spoilerish Spoilery Bit (ASSB™). Yes, I am aware that this sucks. I am not a fan of ASSBs™ myself. I am usually all about Ridiculously Meaningless Spoilerish Spoilery Bits that Have Nothing to Do with the Book Currently Being Reviewed (RMSSBHNDBCBR™ (view spoiler)[←oooooh, I like this one! (hide spoiler)]). But it cannot be avoided. So help me God. Pretty please. Anyway, what bothered me to no end is this: (view spoiler)[Lan and Nynaeve. Nynaeve and Lan. So these two are in few scenes together. And when I say few, I mean FEW. Throughout the book, they don't exchange more than a few sentences. And yet, all of a sudden in chapter 48, BOOM! They're talking marriage. Okay then. That makes perfect sense. To think I'm always bitching about insta-love in UF and PNR! And here we have Robert Jordan pulling an insta-marriage thingy in an EHWF™ book! What a treacherous, devious thing to do, Mr Jordan. Okay, so some people seem to think there is a definite spark between Lan and Nynaeve. I personally think there is a \"I'm thinking of going to the store to buy a box of matches and then see if I can manage to scratch one in order to get a potentially tiny spark\" thing going. This \"woo hoo, let's get married!\" scene came out of nowhere and didn't fit into the story. At. All. But I guess it's all a question of perspective, right? Right.  (hide spoiler)] So there you have it. You probably think it's stupid to focus on such a Silly, Ridiculously Not So Insignicant detail, but I can't help it. I'm annoying like that. » Sooooooo. We are done with the Bad News. Please keep in mind that this half star I knocked off is Gloriously Not So Insignificant, meaning the above mentioned Bad News are Gloriously Not So Insignificant as well. So you can just go ahead and pretend you didn't read any of this. Tada! Your glass is still half full! Don't you love it when I pull my magic wand out of my hat?✎ Logic being me, I have three Good News to outweigh the three Bad News. It is SO cool to be me sometimes ← I know. This has nothing to do with anything. So what? I am awesome and there is little I can do about it ☢ sarcasm alert ☢ ① The Pretty Cool Clique (PCC™):✔ So first we have the TSTL Gang:Don't freak out, you GFFF™! This is nothing but an affectationate expression. A term of near-endearment, if you will. More or less. Because frankly, our naïve, immature Hobbits country boys here? They have that whole Acting Stupid Act (ASA™) more than covered. So much so that I originally thought they were 15 year olds. When they are actually 20 {please insert a \"kill me somebody\" gif here. I'm too lazy to go and hunt for one. Thank you}. But I have to admit the TSTL Gang grew on me as the story developed. Okay, so Mat is such a whining, complaining crybaby I wanted to murder him with my bare hands most of the time. But I like Rand. Yeah, Rand is pretty cool. And I'm a total Perrin fangirl. I'd go as far as to howl at the moon for him {please insert a subtle wink wink at the GFFF™ here}.✔ Then we have the Super Cool Chicks from I'll Kick Your Ass Land:Have I ever read a book with so much book girlfriend material? I think not. Egwene. Nynaeve. Moraine. If that isn't an Awesome Trio from Cool Chick Land (ATCCL™), I don't know what is. Damn. This book really makes me reconsider my sexual preferences. I started having doubts with The Lady, but now the self-questioning is real. What if I've been wrong all these years? What if I'm really into Blooming Chick Boobs (BCB™) instead of Lickable Guy Abs (LGA™)? Oh well, might as well snatch the ATCCL™ away and lock them them up in the Coolest Chicks wing of my harem while I think things over. BOOM! Kidnapped!✔And finally we have the Non-TSTL Gang of Big Boys (NTGBB™):We have Lan of the ASSB™ (Actual Spoilerish Spoilery Bit, remember? Please try to pay attention once in a while, would you?). Yeah, Lan is pretty hot and mysterious. Then we have Elyas (also know as Mr arh-woooooooooooooooooooo Man). And Loial of the Shaggy Head and Tufty Ears, you sexy beast you. And no we don't have Thom because I don't like him. So sue me again. And we don't have Aram either because he's so fishy every page he was in stank. And that's it. Now you understand why I'm reconsidering my mating choices. This book is Hot Guy Harem Wasteland (HGHW™) ← are you getting sick and tired of the Acronym Shit (AS™)? Yeah, me too. Don't worry though, we're almost there. Almost② The not-too descriptive description thingy.Remember the Lies of Lock Lamora of Sudden Death and Immediate Annihilation by Description Overload? Well this is nothing like it. Think I'd still be here if it was? No? Good thinking. No, this is nothing like LLL. Of course there are descriptions, but they don't try to murder you at every turn of the page. And they actually serve a purpose. And add something to the story. They don't leave you feeling like this:And for 750 pages of shuddering of EHWF™ this is quite a feat, if you ask me.③ The stories within the story:So you got your basic this is not the LOTR story (off your high horse!! Off your high horse!!). But you know what is really cool about this book? The stories some of the characters tell. Moraine's tale about Manetheren? Mesmerizing. Raen talking about The Way of the Leaf? Amazing. Loial telling Rand about his people? Captivating. These tales within the tale add so much to the story. I could read them over and over again. They take you to another world, another dimension. It's like living in an alternate universe. Or something. And I think that's enough whisky for now.What do you mean, \"now what?\" Don't you think that's enough? Aren't you suffering from Acute Acronymitis Allergy (AAA™) right now? Don't you have anything better to do with your lives? No? Oh COME ON, people, have mercy. I took me longer to write this review than to read the book. Don't I deserve a break? My whisky blood level is decreasing vertiginously here. I need a pit stop. Sorry? What was that? I'm free to go? Really? Wow. I feel so special right now. You know, you might be Gloriously Aggravating Freaky Fantasy Freaks (GAFFF™), but you can be pretty cool, too. Sometimes.» So let's wrap this up, shall we?►► And the moral of this review is: 750 shuddering pages of EHWF™ = no biggie. Bring it on, Sanderson, I'm ready to tackle The Way of Kings.PS: a glossary of all the Freaking Amazing Acronyms (FAF™) included in this review is available upon request (at a reduced price). Send a stamped envelope and a $10,000 check to your local Murderous Crustaceans branch and you will receive a copy of the glossary by return snail mail. Lucky you."}, {"Review": "\"The Wheel of Time turns, and Ages come and pass, leaving memories that become legend. Legend fades to myth and even myth is long forgotten when the Age that gave it birth returns again.What was, what will be, and what is, may yet fall under the Shadow.\"I have heard of 'The Wheel of Time' from my cousin, Brandon Sanderson, the readers and my Goodreads friend. When I have became a huge fan of Brandon Sanderson. My cousin is a huge fan of Brandon Sanderson too. He told me that Brandon Sanderson has wrote the last three books of 'The Wheel of Time'. He hasn't reading it yet but he wants to read it. When I have researched about 'The Wheel of Time' series, I have found out that there are lots of books in the series fifteen books in 'The Wheel of Time' series! Then I have heard that Brandon Sanderson was influenced by Robert Jordan and I have seen many readers have praised towards 'The Wheel of Time'. I find it curious. I have asked my Goodreads friend as I see he loves 'The Wheel of Time'. I have asked him whether 'The Wheel of Time' is worth reading. He told me definitely, if I love Sanderson's books then I told him oh man! I love Sanderson's books. I have decided to read 'The Wheel of Time' series.It is mind blowing. AlhamdulIllah, I love this book so much. I will definitely carry on reading this series. Inshallah.It is an unusual epic fantasy book. I have never read this kind of epic fantasy book before.Robert Jordan was a great author. I can see that Jordan has copied it from Tolkien but I don't mind because Jordan has his own original idea of storyline.I have noticed that Brandon Sanderson and George R.R. Martin have used the name for the character from Robert Jordan's ideas the names of his characters. Brandon Sanderson has included the character named Wit in 'The Stormlight Archive' series I know his real name is Hoid. George R.R. Martin has included the character named Bran in 'A Song of Ice and Fire' series. Wit and Bran names are in this book.'The Wheel of Time' has drawn millions readers of worldwide.The worldbuilding is stupendous! Robert Jordan has done very well.This book has drawn me. I am addicted 'The Wheel of Time' series.This book does remind me of 'The Lord of the Rings'. I have pointed out that Jordan has copIed some aspects from Tolkien: Jordan has included The Black Rider which originally idea from Tolkien, Tolkien has used the phrase 'Hobbit' refer to the small group of people whereas Jordan has used 'Darkfriend' also I feel both universes: 'Middle-earth' and 'The Wheel of Time' are reminiscent someway.Robert Jordan is the pseudonym of James Olivier Rigney Jr."}, {"Review": "3.5 stars, rounding up. Final review, first posted at Fantasy Literature:The massive length, not only of The Eye of the World itself but the entire epic WHEEL OF TIME fantasy series, along with some differences in critical opinion regarding the literary worth of this series, has always daunted me. But I thought I owed it to myself to read at least this first book and judge for myself, so when the Buddies, Books and Baubles group here at Goodreads decided to buddy read the series, I was happy to seize the opportunity. In the end, this book was both more and less than I had anticipated. The plot primarily follows the adventures of three young men from a farming community ― Rand, Mat and Perrin ― whose sheltered lives are uprooted when monstrous Trollocs, led by undead Myrddraal, attack the village and their homes. When it becomes clear that the attack was focused on these three, they leave the village in the company of some more experienced and powerful individuals who “happened” to be there at the time of the attack, along with Egwene, a young woman from the village. Other characters join their journey along the way, as they travel to a destination that they hope will protect them from the evil that seeks to capture their souls and, ultimately to the mysterious Eye of the World itself, to shore up the forces that imprison this evil.Robert Jordan’s debts to J.R.R. Tolkien are fairly obvious: the group of unsophisticated young men, from a small, isolated community, join a quest and undertake a long journey, continuously battling against a powerful malevolent force and pursued by its evil minions. The company is split apart during the journey. It’s no wonder that I kept envisioning orcs every time the Trollocs appeared on the page, notwithstanding their initial description as having an animal-like appearance. It’s a highly detailed story and world (as it should be, at 800+ pages), but the pace of The Eye of the World is frequently plodding. My detachment from the tale wasn’t helped by the repeated immature actions and decisions of several of the characters, particularly Mat, whose greed and irritating penchant for mischief endanger both himself and the group. Rand is a more sympathetic character, although he oozes “The Chosen One” vibes and occasionally his obliviousness is frustrating. Both Rand and Mat read younger than the 19- or 20-year-old men they are supposed to be. The most interesting of the trio was Perrin, who initially seems slow-witted but then develops some unexpected depth, particularly when he meets Elyas, a man accompanied by a wolf with which he telepathically communicates. Elyas claims that Perrin also has the ability to mindspeak with wolves. Perrin is resistant to the idea but here, as so often is the case, resistance against your destiny is futile.The Eye of the World did become more absorbing and interesting as I got deeper into the tale, when some intriguing new characters were introduced and the narrative took some unexpected turns. In the end, although it never completely captured my imagination in the way I had hoped, it’s still a worthy epic fantasy with layers of meaning and complexity. I’m not convinced yet that I’ll find it worthwhile to plow through thirteen more volumes of the same or greater length, but I’m open to the idea of checking out at least the next volume or two ... sometime.3.5 stars, rounding up."}, {"Review": "It was early 1993. I picked up a free sample of this book at our university book store and promptly forgot about it (finals). I dug it up later and read it. The free sample ended just as things started to get interesting, so I went to a library and borrowed a full book. Little did I suspect of what I stumble into. The most developed world of any fantasy books (OK, except Tolkien's Middle Earth). The most complex plot of any fantasy - bar none. A very long journey. This is a beginning of this journey (not THE beginning, according to prolog). Whoever reads this review and finds the beginning of this book to be too slow - stick with it until the party splits; I will not give you details to avoid spoilers, but this is where the pacing of plot really picks up. BTW, for people who have not read the books: I envy you, as if you do, you will embark on a wonderful journey."}, {"Review": "It's really difficult for me to write an unbiased review of this because there's a fair bit of nostalgia involved for me. I began reading The Wheel of Time in 1995, and it was the first fantasy series that I really fell in love with. It captured my heart and held my imagination for a long, long time. I re-read the series over the years as new books were released up until Robert Jordan died - it was too heartbreaking that he wasn't able to finish it himself and I've waited until the series is finished (and the mourning period is over) to read it again.Even on my 7th time through this 800 page tome (I know, I'm crazy), it had the power to grab me again. There is so much action, so much danger, and I love the feel it has of a world and history much larger than what we are introduced to here (even though we already get a lot!). Even knowing exactly where it was going, I still wasn't bored.This has everything you could possibly want in a classic, epic fantasy: humble beginnings; reluctant self-discovery; prophecies; creepy, dark, evil enemies of various types; good guys with unknown motivations; a unique magic system; swords and fighting men (and women); memories and relics of old things; cities; remote places; survival on the run; a vast world with many glimpses of what is to come... I could go on and on. This, to me, is Fantasy at its best. There's not just a country or two, a city or two. There are several countries, cultures, peoples, and races that are each vividly described so that it feels like an entire world. You can get completely absorbed in it if you want to. It is so well-developed as the books progress that I almost believe I've been there. I love the feeling of being in this world, and 14 books gives me that long to soak it in.Another thing I've always enjoyed about The Wheel of Time is that it has both male and female lead characters, and really great supporting ones as well. The female characters can be annoyingly bossy at times, but they are also often sympathetic (depending on whose point of view you're reading at the time). The women are strong, just as strong as the men, and I especially love following Egwene's story in the future out of those we meet in the first volume. I love the variety of characters, and I can never decide whose point of view I like best.Many people are afraid to start the series because it's so long. I can see how that would be intimidating, and I'm glad I started when there were only 6 books. I believe it ended up so long mainly because the story has more than the usual one or two protagonists. 5 main characters are introduced in this book, as well as a few minor ones. With that many characters, and more to come, 14 books is what it took to play out all their paths in sufficient depth (although I will agree that some of the later books could have been less detailed). I really don't mind the length, though. I love this world. I love to have plenty of time to live in it. I don't claim that it's perfect, but I do believe it's worth some effort. Now that my memory is stirring, I can't wait to relive the rest of it again."}, {"Review": "I was so scared to start this series for two reasons 1) of course, 14 tomes are scary! 2) I have seen many people grumbling about those middle books are slow. This is such a huge series and reading people grouch about 8-10 is not a good sign since reading 7 tomes is huge task. But then one can’t know until they try. Right? Hence I took the plunge and started Jordan’s colossal work. First thing first, Eye of the World takes its inspirations from Middle-Earth is plain to see. Right from the start I could see the similarities and I was disappointed too. But there were parts where it stand out and put a foundation for coming books.Rand, Matt, and Perrin saw a cloaked man and the very night their whole village was attacked by trollocs. Lucky for them as one of the Aes Sadai was in the village with a warder and the destruction was not very huge. Aes Sadai said times are changing and has an intuition that these three lads will be in the thick of the things. Thus begins the journey that has become legendary now and one of most talked about adventures in the fantasy world. It is a huge book and as most tomes tend to plod at times this one too suffers the same fate. Middle chapters were too slow and story became stagnant. Once I crossed 70% mark it is only then things starts picking up again. Second thing that I didn’t like about this book was that there were too many characters. It became hard for me to keep track of everyone after a time, especially when it was clear that not all of them would play any significant role in the end. But I liked the world, the magic system, the main characters, and the story has a lot of potential which I am excited to explore further. A very decent first book in a long series. I will be reading second book soon. Hope it will be more original and less a copy of Middle Earth.Also i would like to thank Iniya who joined me for this tome and will be there with me on this long journey of our own."}, {"Review": "Една от онези книги. Сещате се. Книга религия. Толкова романтична, колкото може да я види само едно тринадесетгодишно момиче. Пълна с персонажи, които са по-истински и които чувстваш по-близки от повечето хора в реалния свят.Помня сутрините преди училище тогава – ставах в 5:30 всеки ден, за да чета. Самичка, защото светът още спеше. Не и моят – в него имаше приключения и аз ги изживявах. Даже мъничко съжалявах останалите хора, които си нямат такива прекрасни истории да им правят компания. Помня обяснението на Лан към Нинив – „Ти си забележителна жена, красива като слънчев изгрев и пламенна като воин. Ти си лъвица, Премъдра“. Обяснение, което ме накара да се изчервя до ушите тогава и да го препрочета 100-ина пъти и което ме развълнува далеч повече от откровените сексуални сцени на Джордж Мартин години след това. После „Окото на света“ се прехвърли в други трескави и жадни за приказки ученически ръце и възпламени и още едно въображение. Дори само двама души да беше влюбил Робърт Джордан във фентъзи романите, пак щеше да е свършил повече работа от доста хора по света.Плаках за него, когато научих, че си е отишъл. Сетих се за изказването му, че ще пише, докато не заковат и последния гвоздей в ковчега му. Доста след това плаках и за Тери Пратчет, защото изпитах същото усещане, че една малка светлинка е угаснала и светът е станал с мъничко по-тъмен. Memento mori, но и не забравяй да живееш.Не съм дочела все още края на поредицата. Много неща не помня. Минаха повече от 15 години. По едно време си спрях фентъзито, защото се превърнах в най-идеалистичния и наивен човек, когото познавам. Уви, все още съм. И все пак, понеже я четох твърде отдавна, сякаш преди много време в една далечна галактика, планирам един ден да си доставя неземното удоволствие да прочета всички романи накуп. Така, както би направил един човек, тръпнал трескаво с останалите почитатели на поредицата за следваща част, изчел я за отрицателно време („две безсънни нощи“) и пожелал да види историята в нейната цялост накрая."}, {"Review": "DNF @503 years after I finished this book and a year after I DNF-ed the third one I decided to give this series another chance. Obviously that didn't end well. My initial rating was 3 stars than 2 after editing and now 1 since that is what DNF-ed books get. There is interesting worldbuilding here and potentially good heroic tale but I just can't look past so many annoying characters and this time around was even worse because I knew they become even more annoying. Jordan couldn't write non-obnoxious female character even if his life depend on in it. I would cheer for all of them to die horribly but main villain and his subjects are generic, tasteless evil so I couldn't be properly on his side either. My opinion additionally deteriorated because since first time I read this book and now I read over hundred fantasy book and vast majority where better. After all this you might think I walked into this one with prejudice, knowing that I will hate it but it's not the case. I like heroic fantasy (when done properly) and I love long epics and some of my favorite people on GR love this series so I wanted to love it but and I kind of feel bad for hating it with a passion."}, {"Review": "I'm going to go out on a limb here and say that this book was the one that put me off fantasy for years afterwards. Part of me was slightly interested in how the whole thing was going to end but it was over-ruled by the knowledge of nine books (at the time) after this one that I was going to have to push through. The story itself is such a fantasy cliche. Kid finds out he's the chosen one, has to defeat the big bad. I liked that story the first couple of times I read it. The characters are unlikeable and I sure didn't want to spend more volumes reading about them."}, {"Review": "THE WHEEL OF TIME SERIES BY ROBERT JORDAN: I tried. I gave it over two years of my life and I still couldn't keep going till the end. Of course, the real end will probably be book fifteen or twenty or, heaven forbid, twenty-five and up. I'm talking about Robert Jordan's Wheel of Time series. Currently there are eleven books in the series, the latest, Knife of Dream, came out last October. The first book, Eye of the World, started out really well and I felt like I'd discovered a great new epic fantasy series similar to that of Lord of the Rings. The first book proved this and I thought it was great; I was also very excited at the notion of there being so many books in the series, with the story still incomplete. The second book, The Great Hunt, while not as mind-mashingly great as the first book, was still a great read, as was the third, The Dragon Reborn, where we find out that the main character is the guy prophesied to save the world, essentially. Eight books from th ere and the big showdown still hasn't come, while Jordan has continued to drag out into the hundreds and thousands of pages scenes, descriptions, and characters bickering at each other about the same thing while repetitively employing their annoying habits, to the point where I feel like I'm reading a children's nursery rhyme. Then there's the whole deal with the main character, Rand, having his undeniable love for three of the women characters, which he is okay with, and which they are okay with, apparently, and are quite willing to share him amongst themselves. I may have kept sloughing through the series better if there'd been a lot less purple prose and books four to ten had been condensed into say books four to six, which would've made more sense and made the stories move along better. Around book five I began spotting the routine the books go through: a few hundred pages of sitting around talking, explaining and regurgitating what's happened in the past books, bitching at each other; then about four hundred pages of people painstakingly crawling from a starting point to a destination (and bear in mind that these people can \"travel\" through vortexes real fast), and then the last hundred pages is a big action scene. At book seven, Crown of Thorns, halfway through, I decided I'd wasted enough time on Mr. Jordan and his wordiness, so I employed a slow speed-reading method which got me through them a lot faster. In about three days I reached the end of book nine and decided I'd had it and it just wasn't worth any more of my time. At this point I'd been able to summarize each book into three or four sentences, and I'd decided that if I can do that, maybe it's just not worth it and I should put my reading time to something more important that I'd enjoy reading more.So here I am Mr. Jordan, signing off on your series that held so much promise and crashed and burned like a planet falling into a sun. Oh, and you know what, I'm not the only one who thinks this way. There are other people I know who've given up earlier than me, and others who've not even bothered to start because they know it's going to end bad.On the plus side, I get to sell all my Robert Jordan books and make money off him!Sayonara.If you liked this review, and would like to read more, go to BookBanter."}, {"Review": "Well, ladies and gentlemen, gleemen and Aes Sedai, Darkfriends and Wisdom, boy did this book hit me at the right time. I was bumbling around town like I always do. I was in this weird time in my life just wandering around thinking about books and what I should read next. I was parading down the cold streets with a warm beverage, wearing a sweater, considering my options, sipping my latte, letting the heat warm my bones and the caffeine electrify my brain. I had a lot of demands for whatever book I would read next. I was like a rock star passing off my rider to a sold out venue. I wasn’t playing unless all of my requests were accommodated. Well, Robert Jordan delivered for me. And now I have to read 13 more long, winding books to finish this epic journey I’ve begun. At the top of my list was some kind of epic fantasy book that was kind of like Lord of the Rings but different. This book apparently gets a lot of negativity because it copies so much from Tolkien, but I didn’t care. When I look for a new book, or movie, or band, or whatever, aren’t I always looking for comparisons? Isn’t every book now compared to Gone Girl because it was popular and people wanted something similar to read for the rest of their lives? It’s the same thing here. He does borrow a lot from Tolkien, but he also has a lot more story to tell and my guess is his story is going to veer off into many other directions. So I didn’t care, and I wasn’t upset about it. Next up on my list was a story with lots of inns and innkeepers. Man, I just loved every time these guys wandered into a new town, found that town’s inn with its fun little name, talked to that inn’s hospitable and maybe sinister innkeeper, met more townsfolk, rested, strategized, etc. I couldn’t give enough of all of these towns and the people inhabiting them. I loved every time they reached s new destination and the story unfolded more and more. I wanted inns and innkeepers, and I got a daggum plethora of them. Those were the only two requirements, really. I would love to rate this book five stars. I really had a blast reading and following Rand and his crew on their wild adventures. I loved meeting new people and learning more about the history and setting of the story. My only complaint is that there are a ton of people! There are so many words and concepts I just don’t get yet! I have so much to learn! So as epic and fun as this book is, it’s also challenging and not easy to keep up with at times. I had to stop and remind myself who people were sometimes, and I still have a lot of questions. I also have a lot more to read so I’m sure things will work themselves out. If you love fantasy books and books with innkeepers, boy do I have the book for you! If you like Lord of the Rings, boy so I have a carbon copy of that story to give to you! I’m kidding. Stop. What’s the hunt for the Great Horn anyway? I’m about to find out! I’m all in on this adventure. Can’t wait to keep truckin’ along with these guys. I just hope there are even more inns and innkeepers in the next book. "}, {"Review": "4.25/5\"The Wheel weaves as the Wheel wills\"The Eye of the World, the first epic fantasy book in the Wheel of Time series by Robert Jordan, provided me with exactly the kind of experience I expected from it.1. An old school fantasy feel.2. Lots of intense descriptions on every small detail that normally my brain just tries to ignore and piece together itself.3. Tons and tons of traveling. (No campfire is left to the imagination)4. Enough epicness to prove that it is truly one of the greats.Reading the Eye of the World, I have realized that I have grown out of many of the less modern fantasy themes and styles of writing. With books nowadays that are fast paced and give more power to the imagination to fill in the blanks, I was not used to having every detail perfectly described for me. Did I like it? Yes and No. Sometimes it was a bit of a challenge to absorb all of that information and read at a reasonable pace. I loved that if I wanted, however, I could know for sure what something in the world looked like or felt like.I also realized, that I will never grow out of the spirit of these books. Sure the writing style may not be my absolute favorite these days, but I will never hate the work for that. I will never dislike a classic book like this for explaining the songs being sung, or the meals being eaten. Simply because it's something that is fantasy at it's very core. It reminds me somewhat of a tabletop RPG, where the scene is painted for you in such a way. I enjoy it! It's almost like taking a nice stroll through the world at a liesurely pace, rather than being pushed straight into the action, though both are great and both have their own place.Is this method of writing slowly changing? Absolutely. More and more I find books paced faster, with almost movie-like scenes. As someone with limited time on my hands, faster books are easier and more accessible. I feel like it's almost a compliment when an author let's your imagination and mind follow the story and fill in the details. But there is a special place in my heart, and I'm sure most fantasy fans can agree with me, for a classic good verse evil tale where you know what you're getting yourself into. The Eye of the World was definitely that.The story was not entirely what I expected, although it did have the classic and typical fantasy tropes. You can definitely see similarities to Tolkien works, especially with the evil forces in this world. Trollocs(Orcs), Myrddrral(Nazgul), The Dark One(Sauron). The magic system is definitely unique, having both male and female sources to draw from, one tainted and forbidden while the other has its place in government and is a normal part of the world. There were about 300-400 pages of traveling,running,going from inn to inn, that I felt could have been shortened dramatically, but looking back, I actually didn't mind the light reading portions. The characters were probably my favorite part of this book. I find myself caring for several of them, and intrigued by the others. I think Lan is awesome and can't wait to find out more about his past. I wasn't sure about Rand at the beginning and still am not too overly fond of characters who are so afraid of their power and fight it at every turn, but I don't think he was excessively whiney like some that I've read. My least favorite was probably Mat, though I can foresee him becoming important. Moirraine had an aura about her that was both mysterious and comforting to the party. It honestly almost felt like a classic RPG, \"gather people along your way\" companionship.The book wasn't jaw dropping, but I have to take it for what it is: The first book in a fourteen book series. As a single book rating, It deserves 4.25/5 stars, primarily for the ending and world that was built, as well as the strong characters. The feeling that the end it gives me is definitely excitement into reading the rest of the series. I predict I will enjoy them more than this one.“You can't give up. You can't ever give up. If you give up you might as well be dead.”"}, {"Review": "A 5 star series, 4 stars for this work“The Wheel of Time turns, and Ages come and pass, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth comes again. In one Age, called the Third Age by some, an Age yet to come, and Age long past, a wind rose in the Mountains of Mist. The wind was not the beginning, there are neither Beginnings nor endings to the turning of The Wheel of Time. But it was a beginning.”This is probably in contention as my favourite book series of all time. I don't re-read many books unless I really love them. But I am in the process of re-reading these. That said this book remains for me as a four star novel purely because it is in my view weaker and less original than the accompanying volumes. This book can be read on its own and I strongly encourage anyone interested in taking up the long series to give this first novel a go. Chances are if you like or love this you'll be interested in the others. If you only find it somewhat appealing I think you'll like the second book even more because from the second and third books the series really comes into its own. So before I pump up the entire series I'll briefly tell you what this novel is about.In the usual fantasy manner we start out with a sheepherder whose life is interrupted by the arrival of strangers in his village. These strangers turn out to be a magical user and a master warrior. A peddler and a gleeman (a bard) also decide it would be great to arrive at the same time. And then a bunch of Trollocs led by a Myrddraal decide to arrive and reveal who the mysterious strangers truly are. Our main protagonist Rand al'Thor is given his father's sword and told that he is one of three men who was being hunted by the Dark One's minions. As a result to protect his village he has to leave (and this eventually all leads to he and his friends heading towards the Eye of the World). Compared to the later books this is average fantasy fare and hardly unique. But there are the subtle glimpses of how epic this series will become.For in my opinion there is no other fantasy series as epic as that of The Wheel of Time. It simply cannot be contained in its scope. Even after it was originally meant to be a trilogy it became six books and then ten. Now it will be fourteen books and has lived beyond the lifespan of its original author. And yet the story has lost little of its overall consistency. It is a sprawling world that forms across thirteen books with hundreds upon hundreds of characters that enter the frame. Indeed if you want memory training why not try reading this sprawling and long series?The premise of the entire series is only hinted at in this first book. That is that the world as our characters then know it has been created by the nameless Creator, a being of physical good, who bound the Dark One (Shai'tan) in a physical prison on this world, held captive by the turning of the metaphysical Wheel of Time. This Wheel is powered by the One Power. The One Power can be tapped by certain adepts called Aes Sedai and is divided into male and female halves called saidin and saidar. This One Power allows for Aes Sedai to weave Fire, Air, Earth, Water and Spirit to attempt various magical things and in past ages create objects of power. The Aes Sedia in the past released the Dark One partially and then rebound him but not before he tainted the male half of the power driving all male Aes Sedai insane. This destroyed the world and led to women holding the ability to channel. However prophecies exist which talk about the Dark One rising again and when he does the Dragon Reborn (a kind of male saviour) will confront and defeat the Dark One. The idea is suggested that because the Wheel keeps turning heroic characters are reborn or reincarnated and the Dark One keeps one being released and rebound in his prison and so it is the Dark One's aim to stop the Wheel of Time turning and have a kind of final Armageddon battle at last. So that is where the entire story leads towards: a massive final reckoning with good and evil.Robert Jordan draws upon many other fantasy and mythology references and yet he creates something very unique ultimately. His overall vision is huge and massive and hopefully the conclusion is equally satisfying when at last the final and fourteenth book is released. However to this date the other novels have been incredible and visionary. Not to mention that they introduced me to the works of Brandon Sanderson. Be as cynical about this series as you want there's very little that can convince me that this personally is one of the crowning pillars of epic fantasy that focuses on the conflict of good versus evil. And nothing beats this for scope in my mind.I encourage anyone who is interested in reading this series to start here and see if you like it. If you don't I'd still encourage you to try the second book as that is where the unique elements start to emerge. The third book is better still and if you make it to book six you'll start to see how wonderful the overall story is I hope. There is also a prequel which may catch your eye called New Spring. However if you're not drawn in by book one or two I'd probably admit defeat and say that this is not your kind of book. Anyway it's my aim to re-read all the books by January so I can be up to date with the final book. And hopefully I shall also be able to own the books in the future.For anyone interested here's a list of all the characters I found and thought was interesting: http://www.ugcs.caltech.edu/~karlh/cg..."}, {"Review": "I'm not sure what to say about The Eye of the World. I first read it way back in 1998 and enjoyed it well enough. I'm pretty happy to be able to say that, unlike a lot of old favourites, this story has stood the test of time. I think I might even have enjoyed this 2016 reread of Eye of the World more than I enjoyed my original read. In many ways this is a very traditional epic fantasy of good vs evil and farmboys that are destined to grow into great heroes and save the world. The saving grace for WoT and the thing that separates it from a ton of other books with the exact same premise is Jordan's engaging writing and his exceptional world building. The characters have their moments, but most are likeable and the cast is suitably large enough to give the story that epic feel to it. I think the WoT books are worthy of being considered modern fantasy greats. Rating: 5 stars.Audio Note: The ever dependable Michael Kramer did an excellent job with the male POV's, and Kate Reading was solid as ever when called upon for the female POV scenes. "}, {"Review": "*** 5 ***A buddy read with my questing buddies from BB&B and loving every second of it!!! I have decided not to write reviews for the individual books of this series - this is a conscious decision, which i took in order to spare my fellow readers from never-ending fangirling and incessant praises for this reviewers favorite series ever. So, be warned,  my rating of this series is strictly subjective and no arguments, however sound and valid, would ever change my mind about it!  Thanks to my gang at BB&B and happy reading!"}, {"Review": "As the Wheel of Time turns places wear many names. Men wear many names, many faces. Different faces, but always the same man. Yet no one knows the Great Pattern the Wheel weaves, or even the Pattern of an Age. We can only watch, and study, and hope.Despite this book reminding me quite a bit of Lord of the Rings (Mount Dhoom anyone?) I did enjoy it quite a bit. I tried to avoid comparing it to Tolkien because really there is no author that can stand near him, and I feel that was the source of my enjoyment. While you can argue that the storyline is not that groundbreaking, I felt that the writing on its own was strong.So it will all turn out like one of Thom's stories? The heroes find the treasure and defeat the villain and live happily ever after? Some of his stories don't end that way. Sometimes even heroes die. Are you a hero, Rand al'Thor? Are you a hero sheepherder?Jordan juggles a lot of characters and while I don't feel like the characters were developed amazingly, most didn't feel like strangers. Some were left with an air of mystery that added to the story. But I feel that the character development will continue in the next books, so I'm not in any rush.All in all a good read if you can manage to get the Tolkien comparisons out of your head!"}, {"Review": "Jordan's Wheel of Time series were the best fantasy books I had ever read*, the best pure stories. I wanted to live in the world he created. His descriptions of simple village life and interaction are so rich and wonderful, not to mention his treatment of city life, magic, technology, politics, romance, history, mystery, comedy, food, the battle of the sexes, military life and tactics, cultures and on and on. Just wonderful. I couldn't wait to get home from work and slip into that world. It was anguish waiting all those years for each new book to come out. When they did, I couldn't help devouring them immediately. For a while there, I'd go back and reread all of the existing books again in the run-up to each new release. They were that good. I'm sure I'll do it again at some point - read the books all the way through again. Fifteen years I've invested in these books! Reading them over and over.I do it an injustice to oversimplify it like this, but it is essentially the \"unassuming wholesome farm boy turns out to be the Chosen One and must journey with companions to confront the supernatural evil entity\" model of story. But it's just massive. Like Star Wars, it has mythological archetypes buried deep within it. Think Joseph Campbell and the hero's journey idea plus character types and situations faintly reflecting those from various cultures' bodies of myth. That makes it so deep and rich and subconsciously resonating. I remember faintly entertaining the paranoid fear that I sure hoped the author didn't die before finishing the series because I couldn't stand not knowing how it ended**. It was that good.*But then somewhere around book 6 or 7, the series started going down hill. It lost its way, ran out of gas. There were entire books where the various substories just didn't move much. And this one time, maybe book 9, the paper got thicker, the font got larger AND the pagecount went way down. It's like he was really struggling to advance the story. Slavishly I kept buying them and slogging through them. The writing wasn't any less good, it's just that it got frustrating that the story didn't advance. Finally on the penultimate book in the series, the last one released, it started to pick back up and get better. And he said the following book would finally be the last (12th) one and he'd wrap it all up, though I don't see how he can do it in a single book. The story just got so huge and there are still so many unexplored and unresolved things, there's no way he can do them all justice in a single book.**Aaaand now he has some super-rare disease, the meds for which make him so fatigued that he can't write much, and the survival rate for which is about 4 years with treatment. So it's not certain that he will live to finish the last book. Arrrrgh. You can't really be selfish about it - I mean, this is a person's life we're talking about. (But still, kind of, arrrgh.)UPDATE: And now he's dead. Some other author is going to finish the final book though. He will be working with Jordan's extensive notes and the parts of the book Jordan had already written. I don't know how I feel about that but I'm sure I'll read it."}], "Image": "https://images.gr-assets.com/books/1337818095l/228665.jpg", "Desc": "N/A"}