{"Genre": "Fantasy", "ID": "28186", "Name": "The Sea of Monsters", "Reviews": [{"Review": " A guy in Greek armor drew his sword and charged, but slipped in a puddle of pina colada. Really, who can not love a book with lines like that? I actually had the urge take this book in my hand with a strong grip and whirl it towards my head for waiting so long to read this series. I just kept putting it off for some reason or other. Luckily I came to my senses.For the most part things have been pretty quiet this school year and Percy even makes a new friend named Tyson, a giant of a kid. Well, this is the Percy Jackson series and things don't stay quiet for long. Monsters come in and attack the gym during a game of dodgeball and chaos ensues, and Percy learns that something terribly wrong has happened. The tree that signifies Thalia's sacrifice has been poisoned and Camp Half-Blood is no longer safe.Riordan has made quite a world here, but that's not the only thing you need to get a good story. Characters are  SO  important and he doesn't forget that. All of them are typically well drawn out. After finishing this one I feel like I know Percy and Annabeth a little better than I did before. We get to see some new characters, Tyson being my favorite and new powers and awesome mythological information. What really impresses me is that it can be funny, witty, informational, believable, smart, suspenseful at the same time without the reader losing the sense of adventure and how much heart all the characters have. What's so cool is that the action never seems to slow down, the action star in me is thoroughly satisfied. The ending is setup well for the next book, and just shows how tricky our villain is. I actually wish I could write a longer very concise and intelligent review about this book (maybe I couldn't accomplish that) but I don't want to give  anything  away, and really the book can stand on it's own without my help.Most people have read them all by now so this message is for you stragglers who waited so long like myself: GO AND READ IT! I doubt you'll regret it.Added later: Guess what? They decided to go ahead and make a movie based off the second book. The trailer looks promising guys!"}, {"Review": "”We did all the standard numbers: ‘Down by the Aegean´, ´I Am My Own Great-Great-Great-Great-Grandpa´, ´This Land is Mino’s Land´. The bonfire was enchanted, so the louder you sang, the higher it rose, changing colour and heat with the mood of the crowd.”Sounds like a really nice night at Camp Halfblood, right? I mean who wouldn’t want to sing “This Land is Mino’s Land”? (On a side-note: Uncle Rick if you read this, can I please have the lyrics for those songs? *lol* I’d love to read them!!!) Unfortunately not everything is as it seems, and Percy isn’t only plagued by strange dreams of his best friend wearing a bridal gown (Hey there Grover, you’re looking good! ;-P) but also by a few ancient monsters that apparently feel a need to attack his home. But worry not! We all know that for every problem there is a solution and of course Annabeth already figured it out. I guess to have a daughter of Athena at your side really comes in handy sometimes. ;-) Especially if you’re a very practical and down-to-earth person like Percy. ”I’ll give you a hint. What do you get when you skin a ram?”“Messy?”See, very practical indeed. *lol* Otherwise he probably would have never figured out that you don’t only get messy but also get a “Golden Fleece” as well. (Of course only if your sheep actually happens to be a golden sheep, but that’s another story for another day. ;-P) Anyway, moving on. Camp Halfblood is in trouble and the only thing that’s able to help them to restore their protective barrier is the Golden Fleece. So our favourite demi-gods do what they do best: They go on a dangerous quest! XD”I thought about it. It did seem a little weird, but, I mean, doughnut shops weren’t really high on my list of sinister forces.”I totally agree with you Percy, but what about the dangers of the sea? Sirens, hydras, a sinister sorceress, a woman with six dog heads or a sea monster that swallows entire ships? What about guinea pigs? Guess they all count as sinister forces. (Yes, even the guinea pigs! *lol*) Well, I’m pretty sure by now you all realized that Percy’s quest is rather adventurous and I admit it, even perilous. Our favourite hero wouldn’t be our favourite hero if he wouldn’t be able to circumnavigate all those lethal dangers though, (pun, totally intended! XD) and in the end … Well, what did you expect? Did you really think I’d spoil you? *lol* Nope, I won’t. You’ll have to find out for yourself. ;-PI’ll only tell you as much: It was a fun ride once again and after that mean cliff-hanger I can’t wait to get a hold of the next book! =)”Families are messy. Immortal families are eternally messy. Sometimes the best we can do is to remind each other that we’re related, for better or worse … and try to keep the maiming and killing to a minimum.”"}, {"Review": "3.7 STARSTHE REVIEW IS POSTED3.7 STARS Tomorrow, I'd be be on my way to my favorite place in the world-Camp Half-Blood.This is the last day in Percy's 7th grade. For the first time in his life, he almost makes it an entire year without getting expelled. No attacks or anything that can make him expelled and tomorrow he'll be going to camp Half-Blood but then Percy's mother tells him that Chiron sent her a message last night saying that it might not be safe for Percy to come to Camp half-blood and Percy also gets this nightmare that is involving Grover. what happens at Camp Half-Blood? Why does Chiron say that it might not be safe for Percy to come to Camp Half-Blood because Camp Half-Blood is like the safest place on earth for half bloods and will something bad happen on this last day? and what kind of nightmare Percy gets that is involving Grover? you need to read the book to know the answers ;p🌊 My Opinion 🌊 Actually, I'm supposed to post this review yesterday but I didn't because I went to the cinema yesterday with my mom and big brother and we came home very late, it's midnight. Okay, now let's talk about the book! to be honest, I expected much from this book since I really really enjoyed the first book. I'm not saying this book wasn't good. I'm just saying that the first book was better than this sequel. the first book was funnier than this sequel and I just felt I was missing someone and that ' Someone ' was Grover. he didn't get many scenes in this book because ... well, I can't tell you that because it would be a spoiler. Grover is one of my favorite characters in this series, so for me a book without many scenes of him would kind of feel ... I don't know, lack of something. lack of his humor. But I still enjoyed it even though I didn't enjoy it as much as I enjoyed reading the first book. But the plot of this book was exciting and I didn't get bored at all. I always found myself feeling excited and curious about what would happen next, But I still felt like something was missing when I didn't see Grover much. now let's talk about Clarisse, I didn't like her in the first book for what she did or about to do to Percy and she was really mean towards Percy.but in this book, I realized she isn't that mean. I still don't like how she acted to Percy in the first book but in this book, she's ... pretty nice to him and that means she's not completely mean. just read the book (if you haven't read it ) and you'll know what I mean and I feel disappointed to Luke. I didn't expect him to be this evil. and HOW DARE HE DID THAT TO PERCY!! I hope he gets hurt in the next book. UGH, I hate him.I already ordered the fourth and the fifth book and I have a copy of the third book but I can't read it now! Because if I read the third book now, then when I finish it and the fourth book still hasn't came, then I will be very very impatient. So I decided to read something else and when the fourth and the fifth book arrive at my home then I will read the third book. I SHOULD'VE ORDERED THEM SOONER. *sighs* thank you for reading and liking this review, guys. I appreciate it so much and I hope you all have a great weekend!❤ ❤P.S. : TYSON! I LIKE HIM SO MUCH! I hope I'll see him again in the next books. \nREVIEW TO COME TOMORROW\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~I AM READING IT! HERE I COME PERCY, ANNABETH AND GROVER. I miss them so badly."}, {"Review": "Wowowowo!! What an amazing adventure it was!! I loved it! Percy's narration was still amazing! Now Camp Half-Blood's magical boundary has been weakened as someone has poisoned the Pine Tree which strengthen it. There is only cure to reverse the effect of poison. For this cure, Percy has to go on a quest to find it. A fatal quest!I loved everything in this book!! Action scenes were amazing.Chariot Races were also amazing.Every single character in this book is enjoyable and interesting. Especially Tyson is an amazing addition. I really wish to see him in the next book.Ending was shocking. I didn't see that coming. Titan Lord, again, fooled Percy.Overall, I LOVED THIS BOOK!!July 20, 2017"}, {"Review": "Ugh, I’m sooooo late with this review (not that anyone has been holding their breath since – let’s be real – I’m probably that 0.01% who hasn’t read Percy Jackson in their life) but hey better late than never, right?Soooo, this book. This book was epic. For a middle school series, Rick Riordan truly went all out. The characters, the plot, the battles, the adventures;  the pre-wedding  it was all spectacular. (Notice all the vague adjectives I’m using bc I’m a loser who went ahead and read the next book before writing this review so like don’t blame me if I end up monologue about scenes from book 3)Percy and Annabeth will completely be the death of me, I mean they aren’t even a ship yet and I’ve become such dedicated trash, it’s wonderful I actually spend hours on a daily basis sighing over fanart So in this book, we continue from where book one left off. Percy is back in a mortal school and so far he’s year has been shockingly  average.  But the fun is yet to start when Percy successfully  though unintentionally  destroys yet another school (and getting expelled in the process).He lands himself back in Camp Half-blood, which is slowly wasting away due to a curse and it’s up to him and the others to set everything right again by retrieving the  Golden Fleece. To sum up, more action, more characters, more fun.Although this series is meant for middle schoolers, my very-adult-self (hush, I’m allowed to say that now) was continuously engaged in the plot. Let’s all acknowledge that events are  totally  unrealistic but I think that just adds more fun to the story. And let’s not forget the hilarity of this series, like the CHAPTER NAMES ARE #GOALS and the characters are so sassy omg how come I wasn’t this sassy back in middle school? “You weren't able to talk sense into him?\"Well, we kind of tried to kill each other in a duel to the death.\"I see. You tried the diplomatic approach.” Anyways, we all know that I already finished the next book and I’m trying to rectify my terrible laziness for writing reviews by pretending I’m doing the responsible thing but like, the next book is waiting for me so byeeeeeeeeeeeeee “That's what makes heroes so special. You carry the hopes of humanity into the realm of the eternal.” 4 stars!!!~~~~~~~~~~~~~~~~~~~~~~~~gotta catch up with the rest of the world !!! ᕕ( ͡° ͜ʖ ͡° )ᕗ"}, {"Review": "Another 5* from Celyn. I read this book to her out of order, having read book 1 then book 3 before it. I hate it when people do that, but the books are pretty stand-alone and we picked the wrong one when leaving the house in a hurry.Actually I can now better appreciate the cross-book story and it's quite clever, so that's good.This volume continues the mix of Greek myth, modern America, and teenagers. Percy battles through various monsters in bloodless battles where the beasties turn to mist on their deaths and reform years later. We're introduced to his half-brother, a cyclops, and a quest is launched to thwart the dastardly plan to destroy Camp Half-Blood. Various famed nasties are encountered including (& here I'm not going to google the correct spelling) Lastrigonian giants, Stymphalian birds, Charybdis and Scylla, Circe, and Polyphemus. Hermes pops up too.It's all rowdy and fairly random fun raiding not only Greek myth but other periods of history to give us a Civil War gunboat and some famous pirates to boot.The twist is actually a clever one, neatly mirroring the villian's supposed victory with the heroes'.Solid YA entertainment.Join my 3-emails-a-year newsletter #prizes..."}, {"Review": "\n“Don't you ever feel that way? Like you could do a better job if you ran the world?''Um... no. Me running the world would be kind of a nightmare.” \nthis and the final book were tied as my favourite I enjoyed Sea of Monsters SO much. After reading The Lightning Thief, I wasn't sure if I would ever continue this series. It didn't grab me as I would have wanted and I didn't feel very connected to the characters. But Sea of Monsters FINALLY got me on board. Something about it was just so, so much more appealing and fun then the first one. Suddenly I loved the characters and the plot and the world so much and I just had to finish this book as soon as possible.\n“Families are messy. Immortal families are eternally messy. Sometimes the best we can do is to remind each other that we're related for better or for worse...and try to keep the maiming and killing to a minimum.” \nmy favourite part of this book, and this series overall, is the charactersI love everyone so much. I think this book was so much stronger than the first because it really solidified the relationships between the characters Annabeth and Percy have so much time together and their relationship gets a lot of development which I loved. I also really liked Grover in this and the scenes in which they were all together at the end were my favourite. We also get so much relationships between the Camp Half Blood kids and Percy. I adore Clarisse, she may be a bit annoying and rude, but she's also kinda cool as fuck and I love her. The worldbuilding and the camp also made me fall so in love with this. It kinda reminded me of Harry Potter in that it feels like it's fantasy that COULD be real. I want to go to Camp Half Blood! And have chariot races!! and eat marshmallows at the campfire. The teachers and camp felt so fun and I liked how there was this dynamic with the camp being both fun and a home for them, whilst also being hard work and a little bit terrifying for them considering their destinies. The worldbuilding in general just had so much development. The introduction of the Oracle about Percy, the fate of Thalia, and more history around Luke/Annabeth and Thalia really developed the plot and created intrigue for the rest of the series. I love the set up for the long series wide arc and tropes like the chosen one are my FAVOURITE. This was really fun and I enjoyed it a lot. If it hadn't been for The Last Olympian this would have been my favourite in the series. "}, {"Review": "See this review and more on www.bookbastion.net!\nPercy Jackson Series Review:The Lightning Thief ★★★★★The Sea of Monsters: See below!The Titan's Curse: RTCThe Battle of the Labyrinth: RTCThe Last Olympian: RTCI always get a bit nervous going into the second book in a series. There's a lot of pressure on the author to prove that the first wasn't just a fluke, and that they can keep the story compelling over the course of a number of middle-books in the series before reaching the grand finale. I had faith in Rick Riordan though - considering the legacy of popular series he's written - and I'm happy to say that he didn't let me down.Percy remains one of my new favorite narrative voices I've encountered over the course of this year. He's so sarcastic and full of good humor that I find myself chuckling over the things he thinks or says. Knowing that this series is written for children, I appreciate his character even more. Percy is easy for boys relate to which is great. There is a distinct dearth of strong male figures in reading geared towards kids in my opinion, so I'm definitely glad Rick Riordan's characters and stories somewhat fill that void. The story is slightly less compelling than the first book, only because we've already been immersed in this world where the Gods exist. There's less to learn about now, so in some ways it feels a bit less mysterious and more familiar. I wasn't as invested in the sideplot with Grover or the cyclops either, but I definitely think it's silly and lighthearted enough that children are sure to enjoy it. Truth be told,, I'd love this story just for introducing the Hippocampi: the mythological seahorses that Percy and his friends use to traverse through their journey on the Sea of Monsters. They were beautiful and the perfect addition to the world and its magic. Then again, I'm a total sucker for magical creatures in general, which is a big reason why this series appeals to me so. My only real complaint about this entry to the PJ series is that the stakes felt a little bit low. I know that we're moving towards an epic conclusion, so things will ramp up gradually here, but the main plot was resolved at about the 85% point and the remainder before the final 3 pages felt like pointless page-filler. All in all though, this was a worthy continuance to Percy's story, and I'm so excited to see where it goes next!★★★★✯ = 4.5 out of 5 stars!"}, {"Review": "I don't get it. I just don't really like this series. My two kids would argue to the death with me about them, and I don't know why I don't like them, I just...don't. Maybe I don't like ancient Greeks mixing with 21st-century Americans. Maybe it's Annabeth's recurring refrain of \"oh my gods\" that drives me insane, or maybe it's the fact that you can't turn 3 pages without Percy being in mortal peril. (Too much adventure is bad for the heart.) Maybe I can't buy into so many perfectly-timed rescues-from-nowhere when Percy is just about to bite the big one, or the way Percy goes into every new situation thinking, \"maybe I shouldn't do this,\" but does it anyway and it's ALWAYS a trap by some monster. ALWAYS. A-L-W-A-Y-S. I know he's just an 8th grader, but golly gee Perce, wake up and smell the Cyclops Spit. Anytime you meet a new person, trust me, you should just turn and run. But you never do.I'm just not interested. I don't care how he gets out of the next life-threatening situation. Just get out of it and let's move on to the next life-threatening situation, already.With The Lightning Thief I thought maybe it was the audiobook's narrator that made me not enjoy it much, but I read this one myself, and I still just wasn't into it. I just wanted it to be over. That's not to say that I don't like Rick Riordan, because I like him fine. Total contradiction, I know, but it's true. And because not every book is every person's cup o' tea, I'll keep recommending this series to kids, because they think it's awesome. And that's good with me."}, {"Review": "\n“““If you get in trouble again, I want to know about it. And I’ll come help you again. I wouldn’t have it any other way.””\n The Lightning Thief : ★★★★⭐ The Sea of Monsters : ★★★⭐⭐Every time Percy Jackson is protective and gentle with his friends, my heart flutters. Rick Riordan does SUCH GREAT FRIENDSHIP???? I mean, the action scenes are okay. The setting + imagery are cool. But holy shit, whenever we’re presented with friendship. Or when Percy merely THINKS about how important his friends are to him. [feels happiness] \n\n\n✨What is this book about?✨\n\n\nIn the second Percy Jackson,, my beloved Camp Half-Blood is dying. The magical Thalia tree, which protects the camp from monsters, has been poisoned by a total asshole i mean who is this petty. So Percy + friends have to save the tree by finding the golden healing Fleece, which is located in The Sea of Monsters. And Grover + Percy have an empathy link!!!!!! It was adorable, because their love is so strong they appear in one another’s dreams when in danger. To ask for help??? LIKE BEST FRIENDS?????? Sadly, tho, Grover isn’t in most of the story because he’s been kidnapped. Most of the book is just Annabeth and Percy travelling across the sea to save Grover. ngl the quest is kind of boring. Also, Annabeth and Percy,,,,,don’t really?,,,,talk!!!! Or interact much at all. They’re sailing and being adventurous, but without 100% acknowledging their friendship. Which was f’ing weird. They had a small fight at the beginning of the book, because Annabeth is prejudiced against Cyclops. And Percy calls her out on it and is like “that’s srsly messed up” and it causes a strain on their relationship. I was so confused that it caused such a rift, because the fight wasn't a huge thing?????? However, you feel the strain for the rest of the book; Annabeth is just sulking because all her old friends are either dead or evil or kidnapped, and Percy is slightly jealous that she doesn’t think of him with strong affection. At one point she cries on Percy’s shoulder. (((crying on shoulders will annihilate me every time))))) But Percy is such a goddamn precious sunshine, who wouldn’t cry on his shoulder??My favorite part of this book was TYSON!!!! Tyson,,,,,,,,[fumbles for words],,,,,,,,what a gift. Tyson is a Cyclops and also Poseidon's son. That’s right kids, he’s Percy’s little brother !!!! SIBLING RELATIONSHIPS, OH YES. Tyson is the epitome of cuteness and hero-worshipping your older sibling. Between Tyson being adorable, and Lord Hermes showing up on the beach, dropping wisdom on us all, I was v happy with who the PJO club is letting in these days.\n\n✨Rep!!!✨\n\n➡️All demigods are dyslexic and have ADHD. we’re getting our daily dose of neurodiversity, because Rick Riordan cares about us.➡️Clarisse deals with parental abuse\n\n✨Overall✨\n\nI’m a college student and I ADORE this series, so middle grade books are worth it, my brave, humble boy Percy is worth it. If you love books like  The Fairy-Tale Detectives then you’ll love the Percy Jackson series. Also, the dialogue is A+++++|✨BLOG✨| ✨TWITTER✨|✨BOOKSTAGRAM✨|✨WISHLIST✨|"}, {"Review": "\n“Families are messy. Immortal families are eternally messy. Sometimes the best we can do is to remind each other that we're related for better or for worse...and try to keep the maiming and killing to a minimum.”\nThis might be my least favorite book of the series. Reading this book in one night, I kind of felt like I was being left out by some of the characters that I was attached to from The Lightning Thief. Percy Jackson still slays as always. His attitude, wit, and sense of humor fascinated me. But the problem is ... those supporting characters were playing with my mind all the time, I couldn't focus on what happened during that time or see the whole picture clearly as I did in book one. This book is on and off enjoyable for me.\n“I told Tantalus to go chase a doughnut. ”\n That being said, I liked the adventure where Percy and his fellows sail to the sea this time. It is new and fresh, at least for me at that time, and the last part of it lift my mood up from the cliché of the first half. To be honest, Annabeth annoyed me sometimes. She acts like a child, especially towards Percy. I felt she pulls the story back halfway while it's supposed to move forward. For example, when Percy decided to do something, Annabeth comes to his way and makes him reconsider his choice even though that's the right one he should do.Other than being Miss Know It All, Annabeth also reminds me of Hermione. Their characteristics are nearly the same, but the way Rick delivers the story makes them different. I appreciate that. I appreciate the feelings I got from this series, it's like being a child and hold a HP book in my hands again. Rick is undeniably a talented author.\n“Before I could figure out how to apologize for being such an idiot, she tackled me with a hug, then pulled away just as quickly. \"I'm glad you're not a guinea pig.\"\"Me, too.\" I hoped my face wasn't as red as it felt.” \nAlthough this is not as good as book one in my opinion, it's still full of adventues, betrayals, and unbelivable facts. Gods and Demigods are becoming the whole clear picture, and I'd like to see them working together in the last book. Keep your fingers crossed !"}, {"Review": "The Sea of Monsters (Percy Jackson and the Olympians #2), Rick Riordanتاریخ نخستین خوانش: هجدهم ماه سپتامبر سال 2012 میلادیعنوان: دریای هیولاها؛ نویسنده: ریک ریوردن؛ مترجم: مریم حیدری؛ تهران، نشر بهنام، 1390، در 296 ص، مصور، شابک: 9789645668707؛ مترجم: پریا آریا؛ تهران، هرمس، 1391، در 352 ص، شابک: 9789643638320؛ ‬مترجم: میثم فرجی؛ تهران، نشر چشمه، 1393، در 323 ص، شابک: 9786002293244؛ ‬مترجم: عباس زارعی؛ قزوین، سایه گستر، 1393، در 357 ص، شابک: 9789645029959؛ ‬جلد دوم مجموعه پرسی جکسون و خدایان یونان اثر ریک ریوردن است و نخستین بار در اول آوریل سال 2006 انتشار یافته‌ است. از روی این کتاب فیلمی با نام پرسی جکسون و المپ‌ نشینان: دریای هیولا ها نیز ساخته شده است. داستان: گروار که به دنبال پان است در خطر میافتد و در خواب از پرسی کمک میخواهد. گروار و پرسی موفق میشوند پشم زرین را از دست یک سیکلوپ دربیاورند و ... ا. شربیانی"}, {"Review": "TITLE: The Sea of Monsters (Percy Jackson and the Olympians #2)AUTHOR: Rick RiordanPUBLISHER: Disney Hyperion BooksPUBLICATION DATE: 2014GENRE: Middle Grade, Mythology, AdventureThis series just keeps getting better and better! Like the first book, I just had a fantastic time reading this book. I love being in the world of Percy Jackson. I love seeing how these Gods and Goddesses are in a contemporary fashion. I liked how everything that has been done in this series so far. I'm hoping to read the rest of the series soon!Anyways, let's start the reviewing shall we?THE GIST \n Percy had an uneventful year (finally). \n\nFor the first time in my life, I'd almost made it an entire year without getting expelled. No weird accidents. No fights in the classroom. No teachers turning into monsters and trying to kill me with poisoned cafeteria food or exploding homework.\n\n It was almost the end of the school year and he's relieved that none of the \"accidents\" he always had every year. Seemed the Greek Gods were giving Percy a break this year. At least, that's what he thought. Percy and Tyson were at gym class when the crazy began happening. Again. \n\nAll around Matt Sloan, the visitors were growing in size. They were no longer kids. They were eight-foot-tall giants with wild eyes, pointy teeth, and hairy arms tattooed with snakes and hula women and Valentine hearts.\n\n So no. The Gods hasn't forgotten about Percy and someone was indeed still out to get him. These creatures called the... eehhh.. something that starts with a letter L (Laistrygonians... there you g) want to eat him. Because he didn't want his classmates or himself to be eaten, he tried to fight them off. Then, out of nowhere, Annabeth came. \n\nStanding in the smoke was my friend Annabeth. Her face was grimy and scratched. She had a ragged backpack slung over her shoulder, her baseball cap tucked in her pocket, a bronze knife in her hand, and a wild look on her storm-gray eyes, like she's been chased a thousand miles by ghosts. \n\n After escaping the huge giant bullies at the school, Annabeth, Percy, and Tyson rode the cab of doom to get to Camp Half-Blood. It will be literally your doom if those three lady drivers lose their eye. Ahaha. Not kidding. After surviving the taxi ride, they arrived at camp and found it being attacked by those big, crazy bulls. The place was supposed to be warded by the tree. I won't mention much about it, but the tree that protected the camp has been poisoned. So anyone who isn't a Half-Blood can now cross the borders which is a big problem. None of the Half-Bloods are safe now. (Half-Bloods or Demigods as we all know them) Now it was up to Percy and Annabeth to not only find a cure for the poisoned tree, but also rescue Grover who has been asking to been visiting Percy's dreams basically telling him he needed saving. WHAT I LIKED: \n Freakin Percy Jackson! Can I say how much I adored this guy. And his narrative! So hilarious and honest. I liked how Rick Riordan made his character. He was special, but he wasn't perfect. I liked how the author handled his insecurity because you understand where it was coming from. It wasn't just a random, fleeting feeling. It was really something someone would feel when your own father seem to be playing favorite. Or at least that's how he thinks it was. Percy didn't pretend he was an overly nice person, because he wasn't. You'll see that wasnt such a nice guy, but he redeemed himself towards the end which was great. He was just a teenage demigod who feels, speaks, and listens like all normal teenager would which I think is one of the reasons why a lot of people read this. \n    Aside from Percy, I love Annabeth. I love this girl so much! I know there isn't any romantic stuff between Annabeth and Percy (yet) but I ship them so bad you won't even believe it! So aside from shipping her and Percy together, I'd have to say I was thoroughly surprised by her character. For someone as young as her, she was responsible, tough, smart, and really kickass. The author didn't tell me how great she was but he showed me. I think that's one of the reasons why I loved Annabeth. \n   The continuous flow of new Greek myth characters were so enjoyable. I am a big fan of mythology. Greek. Roman. Norse. You name it, I love it. Anyways, I was a bit iffy reading this because the author might not be able to give justice to the Greek gods, but this book did. It even exceeded it. Gaaah!!! \n    No freakin \"I can't live without you\" bullshit on this book. There were a lot of cutesy moments between Anabeth and Percy. And when I say cute, it's just really cute. I ship them so hard!!! :) i dont care if there was no romance in this book. But I can feel something would chance. Hrhehe \n   The cover! I mean the cover for the new editions. I didn't really like the older ones. The cover right there on top is the one I have and I absolutely love it \n    The chapter titles were funny. \n    There wasn't a lot of action on this book, but I felt that this book developed the characters a bit more. I saw more of Percy character than I did on the first book. I saw him as a son of a Poseidon and just a normal teenager who also feel jealous (hahahaha), scared, insecure and all the things that normal teenagers feel and I like that. It made his character more relatable and likable in my opinion \n   The silent message about family and how you should never turn back on family.\n\n\n\"My dear young cousin, if there's one thing I've learned over the eons, it's that you can't give up on your family, no matter how tempting they make it.\"\n\n\n    I liked how it preached that without being too obvious. But it wasn't just about family,     there was also a bit about friendship.  I really liked Hermes, Luke's dad!  THINGS I DIDN'T LIKE:   Grover. I'm not very fond of him in this book.   I found Luke a weak villain on this book. I know he is not the main antagonist, but I don't see him fighting anything himself. He was a coward and someone who relies heavily on what he believe is right. He is a rebel because of his issues with Daddy. I don't think his reason for doing what he is doing for the more evil guy is right. His motivations were a bit weak in my opinion. I wonder when we'll see the more evil guy? Would he be as devious and inhuman as Volemort? I wonder...  FINAL WORDS: This series is easily becoming one of the series I would give priority in finishing. I loved every minute of Sea of Monsters. And according to my friend Cam, she loved the rest of the books too! I can't wait to get to the rest of the books. I'm going to be hopefully getting them during the Manila International Book Fair which is happening in a few weeks! Have you guys read the Percy Jackson series? What were your thoughts? :) \nShare them in the comments below! Talk to you guys soon! "}, {"Review": "#1 The Lightning Thief ★★★★☆#2 The Sea of Monsters ★★★★☆#3 The Titan’s Curse ★★★★☆#4 The Battle of the Labyrinth ???#5 The Last Olympian ??? I know I’ve mentioned this before, but I somehow missed the Rick Riordan train entirely as a kid. I never read any of his books, never saw the Percy film(s), nothing – my first introduction to the world was last summer, when I picked up The Lightning Thief, and I thought it was cute enough, but I wasn’t super impressed, beyond totally loving the representation for dyslexia (which I’ve never seen in any other book) and ADHD (which I have, and never see rep for). This book, however, hooked me for good, and now I want to read every single piece of work that Riordan ever has released (or ever will).\n I think it’s her way of saying anything is possible. Percy can pass seventh grade. Waffles can be blue. Little miracles like that.\nMy favorite thing about the first book was Rick’s sense of humor and the ways it comes across through Percy’s narrative, and that was only further enhanced in this book. While the first one was cute, the second one actually made me laugh a few times – there’s so much more snark and sass, and it definitely feels like a slightly “older” sense of humor, despite Percy only being one year older. Percy’s outlook on the world is comical, a little cynical, and a bit self-deprecating, but never to the point of being a downer.\n“You can’t give up on your family, no matter how tempting they make it. It doesn’t matter if they hate you, or embarrass you, or simply don’t appreciate your genius for inventing the internet –”\nI also thought the adult side characters were a lot more amusing and interesting in this installment, especially Hermes, who we get to spend a little bit of time with and who I really hope we see more of in the future. I loved his little snake sidekicks, and the fact that he talked to Percy like an equal, instead of being condescending or secretive like a lot of the adults in the first book were.\n We only came close to dying six or seven times, which I thought was pretty good.\nOf course, as always, there’s a lot of adventure, but I personally didn’t think the action sequences in this book were as harrowing as the first book’s, which was my only complaint – then again, this book was also a bit shorter (it’s the shortest in the series, at less than 300 pages), so there wasn’t as much room to fit in the extra monsters and fights. I still enjoyed the action scenes we did get, and we got to experience more of Percy’s natural ingenuity, as well as the cute “coincidences” in which his gifts from the gods assist him at just the right moments.\n“Families are messy. Immortal families are eternally messy. Sometimes the best we can do is to remind each other that we’re related for better or for worse… and try to keep the maiming and killing to a minimum.”\nIf I had to pick just one favorite aspect of this book, though, I think it would be Tyson, and the family/sibling rep shown there. Tyson is a Cyclops, and as we learn very early on, related to Percy, and we see a lot of this struggle that Percy goes through between determining whether he should worry more about his own reputation, or bonding with his newfound sibling. Tyson is such a precious and sweet character, though, with a lot of his own skills and capabilities to bring to the table, and I loved watching Percy grow close to him and learn to love him despite the reputation that Cyclopes have.All in all, this book was a total delight to read, and I can’t wait to continue the series!"}, {"Review": "I have to say this is my favorite book in the entire series. Wonderfully written and filled with new characters, The Sea of Monsters is a real page turner! Within the first three paragraphs, Riordan intordunces a funny new character: a friendly 8-year-old Cyclops named Tyson; son of Posiden!The magical girl-who-became-a-pine-tree, Thailia, has been poisoned. The magical boundary that protects Camp Half-Blood is weakening, and deadly monsters attempt to wound the demigod boarder patrols as much as they can.There is only one thing that can cure Thailia's Tree:the wonderfull healing Golden Fleece.Percy and his friend Annabeth desparatly need to go on this quest: the Fleece is located in the Sea of Monsters, also known as the Bermuda Triangle; only a child of Posiden could possibly suceed. But instead, the Orcle chooses Clarssie, a child of Ares! Percy quickly reveals another reason to go on the quest for the Fleece: he has been having dreams about his friend Grover the satyr, who went to go look for the god Pan, but got captured by a satyr-loving Cyclops...on an island in the Sea of Monsters. The almost-blind Cyclops thinks Grover is a girl and is going to marry him!Now Percy, his half-brother Tyson, and Annabeth must sneak away from camp to rescue Grover from a dreadful marriage, and insure the Clarssie doesn't get eaten by man-eating sheep.I really liked this book because it was the most creative of all the series. Traveling to the Sea of Monsters, Percy and his friends face thousands of challanges of involving strength of mind and body. I thought this book was wonderful! Riordan has successfully woven a wonderful tale of danger, betrayal, humor and myth into a fantastic book. "}], "Image": "https://images.gr-assets.com/books/1400602661l/28186.jpg", "Desc": "The heroic son of Poseidon makes an action-packed comeback in the second must-read installment of Rick Riordan's amazing young readers series. Starring Percy Jackson, a \"half blood\" whose mother is human and whose father is the God of the Sea, Riordan's series combines cliffhanger adventure and Greek mythology lessons that results in true page-turners that get better with each installment.In this episode, The Sea of Monsters, Percy sets out to retrieve the Golden Fleece before his summer camp is destroyed, surpassing the first book's drama and setting the stage for more thrills to come."}