{"Genre": "Fantasy", "ID": "13642", "Name": "A Wizard of Earthsea", "Reviews": [{"Review": "”The hunger of a dragon is slow to wake, but hard to sate.”\nThe Folio Society edition is superbly illustrated by David Lupton.The boy is born on the island of Gont in the archipelago of Earthsea. This is a world infused with magic. Not everyone can control this magic, but those who know the right words and have a wizard soul can learn to utilize the power of the Earth to manipulate objects and events. The boy’s name is Duny; I can tell you that name because the name has no power over him. His true name is something he can only reveal to those he trusts absolutely beyond question.I know his true name, but fair reader, I’m not sure yet that I can share it with you. His aunt knows a few things, a handful of words, that can be used to bind things or call animals to her. Duny is particularly adept at calling falcons and other birds of prey. His agile mind soon surpasses what his aunt can teach him. He burns to know more. He is assigned to a mage, Ogion, who tries to teach him about the balance of magic with the Earth. There is always a cost for using magic. Understanding the levy for sorcery is the difference between being just impulsively talented and being wise about what you know. ”You must not change one thing, one pebble, one grain of sand, until you know what good and evil will follow on that act. The world is in balance, in Equilibrium. A wizard’s power of Changing and of Summoning can shake the balance of the world. It is dangerous, that power. It is most perilous. It must follow knowledge, and serve need. To light a candle is to cast a shadow….”If the flap of a butterfly wing in the Amazon can cause a hurricane in Florida, imagine what a wizard can do with power over the weather. It is kind of funny, but there is this one scene where wizards on different islands use spells to keep the clouds from raining on them. This storm bounces between them like a boiling stew pot. Now, a wizard like Ogion finds shelter under a tree and waits for the rain to stop. To Sparrowhawk, this type of restraint is ridiculous. If you have the power, why not use it? Duny is Sparrowhawk, and you might think that is his real name, but just because you’ve read a few paragraphs of this review doesn’t mean you’ve endeared yourself to me enough to tell you his real name. Sparrowhawk will suffice for now. Sparrowhawk becomes impatient with the restrained magic that Ogion teaches, so he is sent to magic school on the Island of Roke. There was a magic school in literature before Hogwarts? Indeed there was. The first time he goes to the dining hall to eat, there is only one table. The table, in a very Hogwarts’ fashion, expands to fit as many people who enter to eat. Sparrowhawk is soon recognized as one of the most gifted students. Spells and the names of things flow into his mind like lava, changing the landscape of his brain into something completely different. He becomes powerful.He becomes arrogant.He becomes vengeful on those who don’t appreciate his power. In a moment of hubris, he summons a dead woman from the distant past and, in the process, opens a rift that nearly kills him. It does kill the old mage who helps him close it. Something came through. Sparrowhawk is burned in mind, body, and spirit. He is guilty of a death. The shame and self-condemnation weigh heavily on him. He may become the great wizard he was intended to be, but the road will be much longer now. The shadow from another world that pursues him becomes the devil on his heels for the rest of the novel. This chase from island to island reminded me of Frankenstein and his pursuit of his monster to the North Pole. The interesting thing about this novel is that Ursula K. Le Guin’s publisher came to her and asked her to write a book for older kids. Young Adult wasn’t even a term yet in the late 1960s. She wasn’t sure she wanted to write such a book, but she was nagged by the idea of where do great wizards come from? We normally meet them when they are old sages in the vein of a Merlin or a Gandalf. She wanted G__ erhhh Sparrowhawk to be seen as more human, more fallible than how most wizards had been presented before. I liked the emphasis she puts on the importance of words in this novel and the power and magic that resides in knowing the names of things. I had trepidations about reading this book. I was reassured that I was in the capable hands of a writer I’ve enjoyed before. I have a bit of a knee jerk reaction to the term Young Adult because I’m not a Young Adult. I’m an old fuddy duddy who has a hard time watching commercials on TV geared towards youth. I certainly wince at the idea of spending hours trapped in a book intended for a younger audience. I’m somewhat alarmed at the number of ADULTS who read nothing but Young Adult. The evolution of a reader is for that person to move from picture books, then ride the escalator to Young Adult, and eventually find the elevator that will take them onwards and upwards to adult literature. I’m still pondering this. Is it an extended childhood? Why would someone always want to read about children or teenagers? Am I generationally challenged on this issue? I am happy that people are reading, and ultimately it is better that they read anything rather than nothing at all, but I do think that the more you read there should be some evolution in what you choose to read. I’m such an eclectic reader that it is difficult for me to understood people being so genre specific with their reading choices. Young Adult now dominates the publishing world. Writers are being encouraged to make changes to their novels so they can be marketed as YA. If I weren’t worried about this trend it would be fascinating. \nThere are dragon battles, alluring women who try to seduce G_d to their own uses. There are friendships made and lost; there are painful realizations, and there is growth and acceptance of our own limitations. Most importantly, there is a wizard as wise and as powerful as Gandolf or Merlin, who emerges like a Phoenix from the flames of his own childish conceit. His name is Ged, but you must only whisper it, or better yet refer to him as Sparrowhawk, and keep in the locked box at the center of your heart who he really is. ”He hunted, he followed, and fear ran before him.”If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"Review": "If there were ever a time I'd curse my constant reading of Urban Fantasy, Paranormal Romance or YA lit, it would be now.Because clearly, CLEARLY this is a fantastic book that deserved to be finished. Ursula K Le Guin is a phenomenal writer and whilst this book (up to what I read) wasn't absolutely perfect, it was enchanting. It was different, it was QUALITY.Yet I didn't finish it because, thanks to the aforementioned reading habits, my ability to concentrate and enjoy quality literature has slipped to the point that I am unable to focus on a book unless one of the following is occurring or about to occur.1) Somebody uses their super awesome powers to take down five bad guys with Kung Fu or a huge sword. Preferably a glowing sword. Preforably also throwing out witty one-liners while doing so.2) Somebody is boning.3) Somebody is thinking about boning but can't yet until the sexual tension is properly built.4) There's some mysterious creature literally murdering someone in a sickeningly violent way.What A Wizard of Earthsea has shown me is that if my rate of decline continues, then I will quickly morph from a semi-respectable, semi-intelligent, semi-quality individual into this:Don't move! It can't see you if you don't move!What's measurably worse is that I will be proud of my decay and revel in it like a pig wallows in mud. Like this only far less appealing to frat boys and those with strange mud fetishes...Clearly, this descent must be stopped. If it isn't, the worst could occur. We could all be sucked into a blackhole fuelled by fangirl squees and not nearly enough shame.Pictured: Not nearly enough shame...So feel free to help me, Goodreaders. It's obvious I need help. A Wizard of Earthsea deserved a better run on my reading shelf than it got. Even if we have to shoot a Rocky-esque montage to get me back into reading shape, I'm sure it will be worth it.I can use big words again!"}, {"Review": "\n\"It is very hard for evil to take hold of the unconsenting soul.\"\n This seemingly simple statement actually says a lot about the human nature - just as all the Ursula Le Guin's books that I've read so far seem to do.  ***A Wizard of Earthsea is a simple but beautiful and magical coming-of-age story of a young wizard Ged, who starts out as a brash and cocky boy who in his arrogance unwittingly releases a terrible Shadow upon the world, but who eventually grows up and succeeds in embracing the darker part of himself. A word of caution if you are expecting a traditional fantasy adventure - it is, more than anything, an introspective book, so be warned.\n\"You thought, as a boy, that a mage is one who can do anything. So I thought, once. So did we all. And the truth is that as a man’s real power grows and his knowledge widens, ever the way he can follow grows narrower: until at last he chooses nothing, but does only and wholly what he must do.\n------------------------------------------------------------A 1968 book with a non-white hero! LOVE.--------------------------------------------------------------There are the traditional coming-of-age fantasy elements - wizarding school, true friend, bitter rival, fighting a dragon, finding love. But there is something that sets this story apart from the newer variations on the similar theme, featuring Kvothe and Harry Potter and the like. Part of it, of course, is the narration. The story is told in the fairy tale tradition, with that particular strangely fascinating, lyrical and melodic fairy tale rhythm. But mostly is because instead of focusing on what is on the surface - the learning and the adventures - A Wizard of Earthsea goes straight for the deeper meaning, for what lies beneath the surface.\n\"You must not change one thing, one pebble, one grain of sand, until you know what good and evil will follow on that act. The world is in balance, in Equilibrium. A wizard's power of Changing and Summoning can shake the balance of the world. It is dangerous, that power. It is most perilous. It must follow knowledge, and serve need. To light a candle is to cast a shadow. \nIn her amazing brilliance, Ursula Le Guin takes what could have been a straightforward tale of the fight of good versus evil, and turns it into something more - a lesson in self-discovery and acceptance of the darkness that lives inside all human beings. This is a story about the fascination with knowledge and the temptation of power and dangers of presuming too much and upsetting the natural balance. It is a story about getting to know your own self, including the darkest corners of your soul. And the resulting epic battle of good versus evil... well, let me tell you that the resolution was brilliant and poetic, and I did not see it coming AT ALL.\n“He knew now, and the knowledge was hard, that his task had never been to undo what he had done, but to finish what he had begun.” \nUrsula Le Guin takes the elements that would be a dangerous set-up for fail in the hands of most other writers and somehow unexpectedly turns them into the strengths of this book. Take the characters - except for Ged, they exist only as sketches to support the ideas in this story; it's not supposed to ever work but it does. She brushes over the years of Ged's life and training in just a few words, not detailing the tedium as many writers are prone to doing. Her worldbuilding is not very detailed, but manages to capture the essence of this world in a few brush pen typewriter strokes. We know Ged is in no danger as from the beginning the book refers to his subsequent adventures as a great mage, but this seeming lack of danger for the protagonist does not diminish neither the suspense nor the enjoyment of the story. My one criticism goes to the some symbolism overkill (I passionately hated all the high-school teachers' neverending discussions about symbolism - yawn!), but hey - even Le Guin can't be always perfect.-------------------------------------------------------------------------Wonderful, mesmerizing read that fully deserves 4.5 stars. Loved it dearly and highly recommend."}, {"Review": "This is old school fantasy at its finest. It has all the classic elements. It has a young and naïve protagonist who learns the dangers of power; he overcomes his initial stupidity and learns how to wield his power effectively. It also has wizards, dragons and creatures of great evil. It’s a standard fantasy plot, delivered in basic way, but, nonetheless, it is still great. I think this is because of the plot itself. Le Guin drew me in completely, and made me reach the ending rather quickly. I had to discover how a young mage could defeat a dark and corrupted version of himself, one that had left him scarred forever and running in fear.  A story of growth and magic Ged is your typical protagonist; he is brave, honest and good. He goes on a journey of self-discovery in which he learns the limits, and potential, of his power. He has rather humble origins; he began life as a mere goat herder. Through this he learnt how to take care of himself rather than rely on others. However, he is also very young and rash. With his innate magical power also comes the innate arrogance that can only be associated with a wizard. He is easily tempted and goaded. A fellow apprentice entices him into a magical duel, which turns disastrous. In the process of working an extremely complex spell, aimed at the other wizard, the young Ged accidently summons great evil into the world. “You thought, as a boy, that a mage is one who can do anything. So I thought, once. So did we all. And the truth is that as a man's real power grows and his knowledge widens, ever the way he can follow grows narrower: until at last he chooses nothing, but does only and wholly what he *must *do . . .” He spends the rest of the novel trying to redeem this initial folly, and trying to survive the thing that he has actually summoned. It is a dark horror, and one that only he, personally, can defeat because he was the one who called it forth. This is a harsh lesson for Ged, and, undoubtedly, one that will make him into a much better mage. He learns caution and develops wisdom; he learns to listen and take the advice of those who are more experienced than himself. But, more importantly, he learns not to be so foolish with magic in the future because it could easily lead to his own ruination. Magic is most dangerous, in this world, and it must be handled with care.  Short and sweet  The narrative of this is incredibly bare and simple, surprisingly so. The author doesn’t dwell on things, as she is constantly pushing the story forward. The prose is basic and unembellished, but at the same time it is delivered perfectly. She tempts you to reach the end and see the worthy resolution with your own eyes. The ending is also delivered in a quick and frank manner, which completely reflects her storytelling in general. This book could have, quite easily, been four times the length. But, Le Guin’s style is quick and sharp. She doesn’t mess about with her characters. They’re there to be seen rather than described. This is a style rarely found in fantasy, and most of the time it doesn’t work that well, but in this can Le Guin does in masterfully. She gives you just enough to add depth, and in the process she doesn’t waste a single word or drag you on a long and tireless journey. I don’t think many authors could quite achieve this balance in the genre. I can’t believe that I’ve only just read this. Le Guin is clearly a major voice in the fantasy genre, yet her existence is quite new to me. When reading this I noticed many ideas that I’ve seen several times before in fantasy, yet, I never really considered with whom these ideas originated. Indeed, Le Guin created the first school of magic. It is vast and excellent, but largely underrepresented in the story. Pat Rothfuss and J.K Rowling took this idea, and actually made it better in their novels because it is the centre point of their worlds. Le Guin, however, uses the entire world of Earth Sea to tell her story. I think because of this I have a clearer mental image of her world when compared to other fantasy universes. One thing is for sure, this won’t be the last Le Guin book I read.  Earthsea Cycle1. A Wizard of Earthsea-  Four worthy stars 2. The Tombs of Atuan- A redeeming four stars3. The Farthest Shore- A strong four stars"}, {"Review": "A Wizard of Earthsea by Ursula K. Le Guin is a beautiful fantasy. First published in 1968, it has clearly influenced many fantasy novels since. Orson Scott Card, with his 1980s era Alvin Maker series, stated that he wanted to make an American fantasy, and escape or at least distinguish his work from the inherently English Tolkien sub-genre of fantasies. This is not quite such a departure from the Tolkienesque fantasies, but a difference can be seen and enjoyed. Another Goodreads reviewer made the observation that the Harry Potter series has been wildly successful while Earthsea has achieved only a cult following and peer respect. I can wholly agree with this finding and think it too bad that so many young readers have not discovered this gem of the genre. My admiration for Le Guin continues to grow, she is an amazing writer.**** 2018 Re-readSecond time around I was not as entranced by the story itself but still amazed and inspired by her timelessness, her forward vision and for what this book has meant to the genre.I wondered again about the influence this may have had over J.K. Rowling, perhaps has the book itself, or just a foundation on our modern fantasy literature.I also compared the long voyage sequences here to the long walk across the glacier in her Hainish book The Left Hand of Darkness and see that a journey tale may be a ubiquitous theme in her writing, a metaphor for growth and spiritual evolution.A good book by itself and a wonderful work for fantasy writing as a whole."}, {"Review": "This what A Wizard of Earthsea taught me: * To know a thing's true name is to know its nature. * Don't fuck with dragons (unless you know their true names). * Summoning the spirits of the dead is a bad idea, especially on a schoolboy dare. * Truly changing your form is dangerous, because you can become lost in the aspect you assume. * If you find yourself hunted, turn it around and become the hunter. * Above all else, know yourself.I don't know how I acquired this particular copy of A Wizard of Earthsea. It's an old, 1977 reprint that is, aside from its yellowing pages, in remarkably good condition for something that, in its day, cost $1.50 in Canada or 50 p in the UK. It bears no evidence of a previous owner, be that person, library, or used bookstore. Perhaps someone gave it to me. However I got it, I remember that I read A Wizard of Earthsea for a second time through this copy. I read it mostly in the backseat of my mom's van and then in a hair salon while waiting for her to get her hair done. So this book is firmly ensconced in my mind as a book I read \"when I was younger,\" and I associate it with my childhood (even though I suspect I was probably in my early teens).When I first came upon China Miéville a few years ago, I was an adult and approached his books with an adult's ideas about fantasy. I've only ever known Miéville's works through the eyes of adulthood, and that is something outside of my control, but it definitely affects how I view his works. In contrast, Ursula K. Le Guin has been with me my entire life, stalking me, if you will. Curiously enough, her books have never played the formative role in my reading, especially my fantasy reading, that others like The Belgariad, A Song of Ice and Fire, or Hitchhiker's Guide to the Galaxy have done. I don't have a pithy story about reading a Le Guin book as a child or adolescent that then opened my eyes and inspired me to read more fantasy. So it's all the more intriguing that I distinctly remember Le Guin being in my life ever since childhood. I don't remember when I first read one of her books, only that I did. And when I pick up A Wizard of Earthsea, I'm connected to my childhood, to that memory of this particular copy, as well as to memories of reading fantasy in general. This is a gateway book, and that's why it means so much to me.If you don't have this type of connection to Le Guin or to A Wizard of Earthsea, I can understand how easy it is to dismiss this book as a 2- or 3-star endeavour. It's a condensed story with a small cast of characters who aren't necessarily the most intriguing bunch you'll ever meet. There's a lot of narration and exposition covering most of Ged's childhood and adolescent years. It's not exactly the big-budget, epic type of fantasy story that is so popular now. Nor is Ged your typical fantasy farm boy Called to be the Chosen One. He's a wizard of no small talent who, because he's a cocky adolescent boy, screws up and spends no small part of his adult life attempting to rectify the mistake.There's a lot of darkness in this book. It reminds me, this time around, of Arthurian legends: well-meaning, valorous people struggling against their darker selves, and sometimes losing. Even the Knights of the Round Table had the advantage of knowing they were heroes though—Ged is not a hero; he's just this guy, you know? He's not preternaturally gifted with good sense, so like any inexperienced adolescent, he makes bad decisions and is full of flaws. He ditches his master on Gont, Ogion, to go learn wizardry at Roke because he's eager to learn \"real magic.\" He feels like Ogion is holding him back (we readers, of course, recognize that Ogion is the wise sensei who teaches his student the value of wisdom and work first). At Roke, Ged allows himself to be manipulated into magical pissing contests by his rival, Jasper. The result is the escape of a \"shadow\" into the world of Earthsea, and its encounter with Ged leaves it with some of his power and a hunger to absorb the rest of his aspect. This would be bad, for Ged, and for the world. But A Wizard for Earthsea shares with Arthurian legend that underlying motif of temptation and the sin of pride: people and magic continually tempt Ged, and his successes are measured in the varying degrees by which he overcomes and rejects those temptations. Sometimes he fails miserably, resulting in the unleashing of a gebbeth into the world! Other times, he succeeds admirably, such as in the case of the dragon Yevaud.Ged's encounter with the dragon of Pendor is nominally what turns him into a legendary \"dragonlord.\" He manages to learn the dragon's true name, and with it he wrangles from the dragon a promise never to fly to the Archipelago. The safety of the islands of Earthsea thus secure, he departs Pendor to resume his life and his apparently-eternal flight from the gebbeth.Ged's confrontation with Yevaud is right out of the classical \"man versus beast battle of wits\" canon. What stuck with me for the rest of the book, however, was how Ged deals with Yevaud's brood. He ruthlessly does battle with these dragonspawn, killing six of them. Dragons in Le Guin's Earthsea are predators but intelligent ones: their speech is the same Old Speech from which Earthsea wizards draw power. So I can't help but feel that in slaying these creatures, Ged is wreaking destruction on a much larger scale. He's destroying something unique and wonderful, even if it is dangerous to humans. And Ged is rather cavalier about it: he goes to Pendor because he's decided to leave the town he was protecting from possible dragon attacks, and before he goes he wants to ensure the town will be safe. This is his first act of major wizardry as a full-fledged wizard, and it is interesting that it is one of destruction, even if it benefits those he swore to protect.After his encounter with Yevaud, Ged bums around Earthsea for a little while, faces another great trial, and almost doesn't survive. Fortunately he finds his way back to Ogion, who sets him straight and gives him the best possible advice:If you go ahead, if you keep running, wherever you turn you will meet danger and evil, for it drives you, it chooses the way you go. You must choose. You must seek what seeks you. You must hunt the hunter.If you read A Wizard of Earthsea as a straight fantasy story about good versus evil and wizards and dragons, you will probably be disappointed. Read this way, it's a good book, but it isn't great. It's too brief to be a satisfying epic meal. The strength of Wizard of Earthsea is neither its style nor its substance but its subtext. This book embodies \"literary fiction\" a lot better than much of what gets marketed under that term today. The cover of my edition, aside from its regrettable whitewashing of the characters, seems to support the idea that this is a children's book. The brief description on the back of the book continues this illusion: \"A tale of wizards, dragons and terrifying shadows, in which the young wizard Sparrowhawk strives to destroy the evil shadow-beast he has let loose on the world.\" This description does not do the book justice, nor do I think calling A Wizard of Earthsea a \"children's book\" does any favours for the book or for children. This is not a children's book any more than other books that children or adults might read are \"adult books.\" This is a book, a book for children and for adults, and frankly one that people should read early and often.I read A Wizard of Earthsea as a child, again as an adolescent, and now I've read it as an adult. Each time, I've read it slightly differently, and it has told me different things; my opinions of Le Guin and her works have changed as my perspective changes from childhood to adulthood. For me, A Wizard of Earthsea is memorable and magical because of what it teaches through its story. It deserves five stars because, for a fantastic tale at a slim 200 pages, this book seems to contain an inordinate amount of truth.My Reviews of the Earthsea series:The Tombs of Atuan →\n"}, {"Review": "Here's an odd bit of trivia: I had just read Beagle's Last Unicorn this month, so it is still very fresh in my mind. I agreed with everyone that it was a real classic with so much to love within its pages.And yet, right after reading A Wizard of Earthsea, I'm gonna have to say I think A Wizard of Earthsea is better. Not only better, but a lot more enjoyable, fascinating, and exciting!Not by a lot, mind you, but enough that I can easily say that this Le Guin's classic is superior. :)I hope this comes across as high praise... because that's the intent. I love everything about it. It's all magic and equilibrium. The magic is super impressive and the world of islands is gorgeous. But most importantly, it's Sparrowhawk that I love. This young kid has gone through a lot in his short years and almost all of the hell and shadow is of his own making. Bad decisions leading eventually to wisdom, and all the while, the magic surges and surges.Want a dragon fight? Raising the dead? Awesome shadows underneath the waters? Great discoveries? It's all here.Maybe people just want unicorns more. I don't know. It's not me. I want magic that's clear and deep all at the same time, with a fundamental message that isn't corny and that's interwoven so deftly within the tale of discovery that the result is always obvious and profound.This here tale does that. Perfectly. I love it."}, {"Review": "As a reader of Fantasy, this book felt like a return home, even though I had never read it before. The tale of this young wizard and his hardships and coming to terms with his own darkness is one that has been redone again and again, from Rowling to Jordan to Goodkind, and so far, despite adding gobs of length and endless details, no one has managed to improve upon it.Though she isn't the first to explore the Bildungsroman-as-Fantasy (Mervyn Peake precedes her), he was an author who eschewed symbolic magic, and so has been duly ignored by most authors and readers in the genre. Le Guin's approach is much more familiar, able comfortably to abide alongside Moorcock, Tolkien, and C.S. Lewis.Yet her work has none of the condescension or moralizing that mark the last two, nor the wild pulp sentiment of the first. Her world unfolds before us, calmly and confidently, as we might expect from the daughter of noted anthropologists.As is often the case in her work, we get poignant asides on human nature, but overall, her depiction here is less novel than in, for example, the Hainish cycle. There is something flat in the plot progression, and as has been the case with every Le Guin book I have read, I found myself longing for her to take things a little further, to expand and do something risky. Often she seems just on the cusp, but rarely takes the step.Part of the flatness is the depiction of the characters, who fall victim to the 'show, don't tell' problem. Again and again, we are told of conversations characters had, of how they reacted, of whether they were clever or unsettling, but we never actually see these conversations take place. Many times, the conversations would not have taken any longer to read than the descriptions of them, so why Le Guin chose to leave so much of her story as an outline of action is puzzling and disappointing.Fundamentally, what characters do is not interesting. What they do does not differentiate them. What is most important is how they do it--their emotional response, their choice of words, the little pauses and moments of doubt. At the end of the day, the four musketeers are all men in the same uniform, with mustaches, dueling and warring and seducing women, but they each go about these things in such distinct ways that we could never mistake one for the other.The import of personality is also shown in Greek tragedy, where we know what is going to befall the character (the plot), but we have no idea how they will react when it happens. All the tension lies within the character's response, not with the various external events that inspire it.So I found it very frustrating that, again and again, Le Guin didn't let the characters do their own talking, and so I often felt estranged from them, that I didn't know them or understand their motivations or interrelationships because the fundamental signs were missing. As we near the end of the story, more and more is revealed in conversation and interaction, but that's the reverse of the ideal: once you have established a character, we can take some of their actions for granted, but it's important in the beginning to let their idiosyncrasies reveal them.As others have pointed out, Le Guin covers a lot of ground in a short span, and perhaps it was a desire to make things brief and straightforward that caused her to take the words from her characters' mouths, but again, it seems backwards to me. I would rather see a story shortened by taking out specifics and leaving promising implications instead of the other way around. A single, well-written action or turn of phrase can reveal more about a character than paragraphs of narration.In her influential essay on fantasy From Elfland to Poughkeepsie, she talks about how Dunsany does not really use dialogue the way other authors do--that indeed, she finds it difficult to locate any sustained conversations in \nThe King of Elfland's Daughter\n. Perhaps on some level, she was trying to imitate his style. But, while it works brilliantly for him, it does not serve her as well.The main reason for this is that Le Guin is much more a modern, psychological, realist author than Dunsany. Her fantasy setting is sensible, physical--it feels like a different place, a world like our world. Her characters are inhabitants of that world, the product of its cultures and history. So, when she removes their discourse and means of expression, she closes the reader's window onto the character's inner life.Dunsany, on the author hand, takes a different approach: his worlds are dreamlike, the worlds of fairy tale. His story takes place in the clash between the possible and the impossible, the real and the dream. His characters are not self-contained psychological portraits of individuals, but symbols, appendages of the dreamland he weaves. So it makes sense that they do not express themselves through the dialogue of psychoanalysis, but through the instinctual pre-knowledge of the dreamer.Indeed, Le Guin herself (in that same essay) talks about the danger of imitating Dunsany's style, that it is so unique, and his pen a master's, so that any attempt to recreate what we has done is bound to end in embarrassing failure. Yet, she also remarks, it's a stage most fantasists seem to go through: attempting to produce that sort of natural, lovely false-archaism. She managed to leave that behind, but now I wonder whether she didn't simply end up imitating another of Dunsany's stylistic modes without realizing it--one just as problematic to a thoroughly modern, anthropological writer.What is most interesting about her story is how small and personal the central conflict is. Many authors in fantasy have tried to tackle the conflict of the 'Shadow Self', from Tolkien's Gollum to the twin alter-egos of Anderson's \nThe Broken Sword\n, but none have used it as a representation of the internal conflict of the adolescent which must be overcome in order to transition to adulthood.By so perfectly aligning the symbolic magical conflict in her story with the central theme, Le Guin creates a rare example of narrative unity in fantasy. Most authors would have made it a subplot of the grand, overblown good vs. evil story, and thus buried its importance beneath a massive conflict that is symbolic only of the fact that books have climaxes. Once again I am struck with the notion that modern authors of fantasy epics have added nothing to the genre but details and length.If only Le Guin had given her lovely little story the strong characters and interrelationships it deserved, it would have been truly transformative. As it is, it is sweet, and thoughtful, and sometimes haunting--the scenes of stranding on the little island had a particularly unearthly tone--and it lays out an intriguing picture of a young Merlin, but in the end, it felt like an incomplete vision.My List of Suggested Fantasy Books"}, {"Review": "\"A man would know the end he goes to, but he cannot know it if he does not turn, and return to the beginning, and hold that beginning in his being. If he would not be a stick whirled and whelmed in the stream, he must be the stream itself, all of it, from its spring to its sinking in the sea.\"Three years ago I picked up my first Ursula K. Le Guin novel, The Left Hand of Darkness. I did so as part of a challenge to read a science fiction book, a genre in which I was not at all well-read. I didn’t really expect to like the book, but was happy to check one off the list. To my great surprise, I adored it! In fact, I still think about it fairly regularly, even with loads of other books read between now and then. I was determined to read more of her work and see if it was just a fluke that such a novel would appeal to me. I had seen a copy of A Wizard of Earthsea at a used bookshop at the time and hesitantly purchased it - an illustration of a wizard with staff in hand and a dragon on the cover very nearly told me to leave well enough alone, but I risked it. I’m not necessarily a fantasy kind of gal either… with a couple of exceptions. It has sadly sat on my own shelf for three years, until two of my Goodreads groups recently decided to read her work shortly following Le Guin’s passing. I jumped at the opportunity, and once again was astonished by both the writing as well as the perceptive concepts developed within. I won’t attempt to make any sort of comparison between this book and others within the genre, as I am not qualified to do so. I am aware that J.R.R. Tolkien came first and J.K. Rowling after. I cannot delve into a written discourse on the elements of fantasy or the influence of various genre writers upon one another. What I can do is tell you why I admired this work of fiction. The quote I’ve included at the start of my review is one that illustrates a journey of sorts. That is what I feel this book on its most basic level embodies – not just a trek across the lands of Earthsea, but a journey of the self, a discovery of one’s very substance or essence. I can see the similarity between Ged’s quest in this book and that of Genly Ai’s flight across the harsh and icy landscape of the planet Winter in The Left Hand of Darkness. Two very different characters with distinctive lessons to be learned along the way, both Ged and Genly develop and make discoveries of self as well as understanding of others. At the beginning of The Wizard of Earthsea, we meet a boy born with special gifts; one destined to become the greatest wizard of Gont… a young man called by his 'use-name', Sparrowhawk, and later by his 'true-name', Ged. Le Guin makes a distinction between use-names (or nicknames) and true-names, with true-names not being known to all, but rather to a select few that can be trusted to keep this secret. For, in Earthsea it is believed that: \"Who knows a man’s name, holds that man’s life in his keeping.\" When we first meet Ged, or Sparrowhawk, he is a teenager with a temperament that one might expect from a ‘typical’ teen. He is naïve, a bit rash, and prone towards arrogance. He is a ‘know-it-all’ who can let pride in his power get in his way. I didn’t like him initially, but he seemed very real to me as a result. Full of natural flaws, he is not a typical hero. He could have been one of us. He eventually goes to train on Roke Island, essentially at a school for wizards-to-be. He is sent there on the advice of Ogion, his quintessentially wise early master in the craft. Ogion, in fact, is one of my favorite characters. He sends Ged forth with such prudent advice as \"To hear, one must be silent,\" and \"Have you never thought how danger must surround power as shadow does light?... every word, every act of our Art is said and is done either for good, or for evil. Before you speak or do you must know the price that is to pay!\" Sensible words that can be applied to more than just your standard wizard-in-training!Pride is not easily shed, however, and as a result Ged lets loose upon the land of Earthsea a dark and dangerous creature. This evil entity will haunt his dreams as well as his waking moments. He is kept safe from this being by the Nine Masters of Roke and the Archmage while continuing to study under their tutelage. But, as we all know, one reaches adulthood and must strike out on his or her own given the knowledge and tools that have been imparted to us. Thus Ged goes out into the world as a wizard yet with the fear of this creature termed ‘gebbeth’. As he travels from land to land, Ged is pursued by this gebbeth, endangering those inhabitants of Earthsea with whom he settles for a time. As a result he moves on until he realizes that the cycle can only be broken if the hunted in fact becomes the hunter. Thus begins a new journey to seek the gebbeth and destroy it. But in order to do so, Ged must know its ‘true-name’, a name that eludes him. Many of his encounters are dark and frightening and I found the plot to move forth quickly and dramatically; it was quite gripping! At times it seemed the being would overwhelm him completely. \"The body of the gebbeth has been drained of true substance and is something like a shell or a vapour in the form of a man, an unreal flesh clothing the shadow which is real. So jerking and billowing as if blown on the wind the shadow spread its arms and came at Ged, trying to get hold of him … devouring him out from within, owning him, which was its whole desire.\"I can’t give away whether gebbeth or wizard wins in the end - you’ll have to grab a copy for yourself to find out. Needless to say, I loved it. It is a quick read for a fantasy novel, with so much packed inside. There are moments of great adventure, but also a lot of introspection which I highly esteem. You have to open up your mind to fantasy a bit to read this, but you most certainly don’t have to be a genre fan to appreciate the messages Le Guin offers to us. The world-building was excellent and I loved the growth of Ged throughout. Le Guin's themes are so compelling and leave me reflecting for quite some time after reading her work. Her worlds are a place where we can go and allow ourselves to think about ideas in ways that we otherwise might not. She helps to open our minds by painting a vivid world first, and then makes us take the next step and learn that there are in fact other ways of thinking about our own worlds and those within them. 4.5 stars rounded up to 5 for this excellent work!\"… a man: who, knowing his whole true self, cannot be used or possessed by any power other than himself, and whose life therefore is lived for life’s sake and never in the service of ruin, or pain, or hatred, or the dark.\""}, {"Review": "I rated this 5* from memory of reading the trilogy (as it then was) back in the late 70s.My wife has taken to reading to our very disabled daughter (now 13) while I make up her medicines before bedtime (it takes a while, there are 8 drugs that need to be counted out between a 1/3rd of a pill and 4 pills, crushed, mixed with water, sucked into a syringe and administered through a tube that goes through the wall of her stomach!).Anyway, A Wizard of Earthsea was a recent read, and listening to my wife read it has allowed me to revise my rating to a 4* and review it!I recall book 2, The Tombs of Atuan, being the one I liked most. I had actually forgotten all the 2nd half of A Wizard of Earthsea.Ursula Le Guin is undoubtedly an excellent writer in terms of prose and imagination. She uses the language with powerful economy.AWoE is a short book. 56,000 words compared to the 400,000 word bricks GRRM and Rothfuss putout. I mention Rothfuss as AWoE looks to be an influence, a magic school where our sole point-of-view character is educated from child to man in a form of magic where the true name of things gives power over them.It is also a very summary book in many ways. Ged's years at the magic school (boys only) introduce us to only two other pupils by name (a friend and a rival), and I don't think we're shown any actual lessons. A lot of ground is covered in very few words which can leave a sense of shallowness and a lack of emotional engagement, which is offset by Le Guin's excellent prose, but not entirely.The second half of the book, where Ged is variously pursed by or pursuing his nemesis, a magic he foolishly released as a student, was something of a grind for me. There is an awful lot of chasing a shadow across grey, rainy seas past bleak islands while Ged broods.Obviously it's not as bad as I'm making out or I wouldn't have remembered it as a 5* book or be giving it 4* now. It's powerfully written and quite literary for all that it was written for children. The magic is mysterious, powerful, and used with restraint. The world is interesting and it's a classic for good reason. I'm not sure what kind of reception if would get if it were released today, but that is an unfair test. We're still talking about this book 50 years after publication, and that's a vast achievement. It's also interesting to see how the main character is whitewashed on all the early covers.Join my 3-emails-a-year newsletter #prizes.."}, {"Review": "I remember reading this book as a child and loving it, and that is all I can remember, the reading and the loving. Anything about the contents has slipped through the old grey cells somehow. As it turned out my brain knew what it was doing when it jettisoned all the details of the book so yesterday I was able to read it as if for the first time. Like A Virgin.Nowadays any fantasy book that features a school of wizardry can not help but bring up Harry Potter comparisons (I can't help it anyway). A Wizard of Earthsea was published several decades before Harry Potter and the Sorcerer's / Philosopher's Stone, and I wonder how much of it inspired the Rowling books. No disrespect to the deservedly popular Potter series but certainly Earthsea's Roke Island's school of magic seems like a precursor to Hogwarts, and Le Guin's protagonist Duny / Sparrowhawk / Ged starts off as a boy with an unusual degree of natural talent for magic. In all fairness, the similarities dwindle to nothing by about half way point through A Wizard of Earthsea though. OK, got that out of the way, no more pointless HP comparisons henceforth.Ged by David LuptonA Wizard of Earthsea is - to some extent - a bildungsroman about a boy name Duny who has an unusually high aptitude for learning and using magic. After saving his village from invaders, he was discovered by a wizard who gave him his true name Ged. After travelling with the wizard for a while and not learning very much magic thanks to the wizard's \"Mr. Miyagi\" style of teaching he was sent to the Roke Island to enroll in a wizardry school. He learned magic very quickly of course but soon make a huge mistake and accidentally invoked Something Better Left Alone. Much gnashing of teeth and a search for redemption ensues. (I am appallingly bad at synopsizing as you can see).When Ms. Le Guin wrote this book in the 60s there was not much of a fantasy genre, some Tolkiens here some Lewises there, very little else. This makes A Wizard of Earthsea something of a landmark for the now thriving fantasy genre. Also, in those days, the term \"magic system\" did not exist but Le Guin knew even then how thoughtless, frivolous use of magic in a book can render the story unbelievable. So she cleverly imposed some logic and limitation to the use of magic and thereby created one of the earliest magic systems. \n\"Listen, I don't understand: you and my brother both are mighty wizards, you wave your hand and mutter and the thing is done. Why do you get hungry, then? When it comes suppertime at sea, why not say, Meat-pie! and the meat-pie appears, and you eat it?\"\t\"Well, we could do so. But we don't much wish to eat our words, as they say. Meat-pie! is only a word, after all... We can make it odorous, and savorous, and even filling, but it remains a word. It fools the stomach and gives no strength to the hungry man.\"\n See what I mean? Genius! The magic in the Earthsea universe is based on the \"words of power\" and \"true name\" idea. \"One who knows the true name of an object has power over it.\" is fairly self-explanatory, this applies to people's names also; giving someone your true name is a little like giving them your Paypal password, not something to be done lightly.Art by David LuptonThe book is necessarily fast-paced and eventful due to minimal length though the climax is not as spectacular as I thought it would be, it is quite satisfying and leads to an elegant wrap up of the story. The prose is beautifully written as you'd expect from Le Guin, the book was written for children so it is more easily accessible than her adult science fiction books. Don't let the \"for children\" label put you off, though, there was no YA category at the time, or this book would have been hailed as the best of them. Characterization is very nicely done, Ged starts off as a fairly typical arrogant young whippersnapper and grows into a kindhearted, responsible (and melancholy) adult. If you have kids this would be a great book to read to them. The principle of \"with great power comes great responsibility\" is much better learned here from Ged's experiences than from Peter Parker's.Another thing I remember from my first reading of this book in my teens is that I could not get into the second book The Tombs of Atuan due to the switch to a new protagonist, I wanted so much to know what Ged is going to do next. I was a stupid kid. At least now I have more Earthsea books to look forward to.Art by David LuptonNotes:• Margaret Atwood Explains Why A Wizard Of Earthsea Is A Masterpiece • David Mitchell on Earthsea – \"a rival to Tolkien and George RR Martin\"• Beautiful new illustrated edition"}, {"Review": "Wow. This had all of the plot points and awesome fantasy world that I'd normally love. The writing was almost mesmerizing at times. So why was it so painfully boring?!This really reminded me of The Name of the Wind (but at least it was better than that). Ged is a sulky, prideful boy who starts out being trained by a wizard to learn the true name of things. He eventually leaves him to go to a school and has experiences similar to Kvothe. I LOVED the elements of the world with the mages and dragons and everything, but I just could not get as into the story as I would've liked. It mostly slogged along in a passive manner and I could tell the story was well written, but my brain was too numb to care. I remember seeing other reviews about how dull this book is, but ignored them because the cover claimed this was one of the greatest pieces of fantasy literature. And I did appreciate the more intellectual side of the story, but I guess I was hoping that could be woven into something a bit more entertaining as well. It's definitely not bad, though!! I really did like the world and think I might come back to this story someday because it really does have a ton of potential. But I was apparently not in the mood this time."}, {"Review": "I can't believe I am giving a Le Guin book 2 stars, I have nothing but respect for this writer and her work, but alas, A Wizard of Earthsea was a chore to get through. Frankly, I only enjoyed the very beginning and the very end of this story. What's in between is excruciatingly boring. A Wizard of Earthsea is an introspective book. What I mean is, it's all about one wizard's personal quest to overcome the dark entity - Shadow - that he unleashed during a youthful boasting about his magical powers. Ged spends the majority of the novel feeling ashamed of his deed, or running away from the Shadow or, in the end, finally confronting it. It is not a bad tale on the intellectual level, that's why the book has such a strong following. But as a reading experience it was underwhelming. There are no interesting personalities or relationships in this book, no adventures. Just a very, very dry, almost didactic, quest. I look back at some science fiction works of Le Guin's - Four Ways to Forgiveness or The Left Hand of Darkness - they blew my mind. A Wizard of Earthsea just didn't.Listening to this novel as read by Harlan Ellison was an experience in its own. This person really overdid it, emphasizing stuff and yelling and stammering every other sentence. None if which was in the novel. At times I could almost feel him spitting during the reading. But in the end, this narrator did the job for me. When I tried finishing the novel on my own, I was bored to death, so only thanks to him I was able to get to the finish line at all. The lesson here, I guess, is that I should stay away from Ursula K. Le Guin's fantasy, which I will gladly do. "}, {"Review": "I couldn’t have chosen a better time to experience LeGuin’s reimagining of the story—pardon me, I mean The Story—which we weave into our lives and the lives of those around us. At 35, I’m not really old but I don’t often feel young anymore, and it’s only now that I feel like I am finally confronting my shadow and embracing who I am.There are an infinitude of ways to reflect upon, analyze and understand our life experiences. But LeGuin provides a framework that is just right for me. Her telling of The Story is one that I can understand, one that fits and mirrors many of my own life experiences. A Wizard of Earthsea is the story of Ged, a young man with a natural gift and a powerful potential. Ged's journey to understand his gift will be longer and more difficult than his impatience allows him to admit. He is sent away to learn from those who know how to control such a gift. Then, just as Ged is truly beginning to harness and develop his latent power, his pride leads him to overreach his abilities and loose a terrible shadow upon the world. Ged’s life then becomes one of fear and evasion, until he decides to turn and confront his shadow. Now, I don't flatter myself to think that I have the power to set free some evil that puts the world in danger. But LeGuin's story fits my life in its own way, and on a smaller scale :)So, A Wizard of Earthsea gave me a much-needed archetype to contextualize my experiences—including my fair share of physical and emotional hardships—of the last 18 months and articulate what is happening in my life. I’ve stopped running from my shadow. I’ve become the hunter and I’ve cornered my shadow on the distant sea. I’m embracing the entirety of “me,” for better or worse, even as I write these words. Already I like the person who is emerging from this fusion. Perhaps of equal import, I think my loved ones like that person, too.This begs the question: was it mere chance that I read A Wizard of Earthsea at this time, in this place in my life? Or was I maneuvered ... influenced in some subtle way by some deliberate force ... to read it now? That’s an unanswerable question, I suppose, and that’s fine with me. What’s important is that I did read this book. No, that’s not precise, I experienced this book, and at a time when I could get the most out of it, at a time when I most needed the counsel of an author who knows how to meet people where they are. I still haven't read the text of A Wizard of Earthsea; instead I listened to the audiobook narrated by Harlan Ellison. What a powerful way to experience LeGuin’s work! Mr. Ellison’s sense of pacing, tone, volume, and timing, not to mention his ability to dramatize and entertain the listener, were a perfect match for LeGuin’s natural storytelling. I listened to the book while commuting to and from work, or mowing the lawn, or—my favorite way—lying on the couch with eyes closed, absorbing LeGuin’s world as her words fill my senses. My five-star rating applies with equal force to LeGuin’s story and Ellison’s reading.Thank you, Ms. LeGuin. Thank you, Mr. Ellison. And thank you to my GR friends whose reviews convinced me I couldn’t wait any longer to read A Wizard of Earthsea!"}, {"Review": "I wish I'd read this one as a kid. It's one of those books that crams an epic story in under 200 pages, sketching the world and the details and the action rather than spelling everything out. As a kid, you get lost inside of a book like that, and it seems the better for it (the closest comparison I can think of is The Lion, the Witch and the Wardrobe - I was shocked to re-read that and discover the \"epic battle\" at the end is about two pages long).I can tell that's what UKLG was going for with this first book of Earthsea. And I did enjoy it. But it basically crams the entire stretch of seven Harry Potter novels into one book, and thus is all plot plot plot and melancholy hero and years passed and so without developing anyone's personality or giving the world some depth and color beyond its geography and a few memorable details, like the children who have lived their entire lives alone on an isolated reef and have never seen another man.Upon the recommendation of another goodreader, I downloaded this one from iTunes for $5 (I've had a gift certificate credit there since 2007... I don't buy music). Harlan Ellison reads in the style of an overenthusiastic grandpa, doing the funny voices and everything. Whether this added to or detracted from my enjoyment of the book, I cannot say."}, {"Review": "When I was in grade seven I had a Language Arts teacher named Mr. Hore (you can imagine the fun we had with that in junior high school). He noticed that I was a voracious reader, and that I was devouring fantasy books at the time, so he nudged me in the direction of his favourites: Ursula K LeGuin and Anne McCaffrey. The nudging began in class with a LeGuin short story. I remember sterile white homes that were pre-fab pods, I remember odd, sci-fi-ish flora and a girl as the protagonist. I also remember not liking it, but I was a 12 year old boy. I don't remember the name or anything else, but it instantly had me not taking Mr. Hore's recommendations seriously. Then he got me reading Dragonflight, and I was even less impressed Although I recently gave it another try and quite enjoyed the experience, back then I hated the idea, I hated the characters, I hated everything about the book, and I was thoroughly inoculated to the effects of McCaffrey and LeGuin for years to come.In my late twenties, however, I rediscovered Ursula LeGuin with The Left Hand of Darkness and was blown away by her unparalleled mind, and her conception of the androgynous/hermaphroditic Gethens. The Lathe of Heaven was prophetic and fascinating, but The Dispossessed was something more. It is one of the finest political sci-fi books ever written, a peer of Orwell's 1984 and Huxley's Brave New World (and I humbly submit that on the back of that book alone, LeGuin deserves to win the Nobel Prize for literature). Despite my rediscovery of LeGuin, though, I shied away from her fantasy literature. The damage done by Mr. Hore still hadn't healed. Until now.A Wizard of Earthsea is one of the finest pieces of fantasy literature ever written. The story of Sparrowhawk's journey from being a smithy's son to the most powerful wizard of Earthsea is a parable of equilibrium. In Ged's pride and youthful anger he conjures the dead -- a power within his grasp, but a power he cannot control -- and with it comes a gebbeth, a shadow creature that will hunt Ged until it possesses him and turns his power against the world. Heavily scarred by his folly, both emotionally and physically, Ged is shielded from the gebbeth by his Masters, and he completes his training in humility. He eventually returns to the world, leaving behind the protection of Roke, and seeks an end to the chase between himself and his gebbeth -- a return to equilibrium: \"only in silence the word, only in dark the light, only in dying life: bright the hawk's flight on the empty sky.\" In typical LeGuin fashion, Ged's struggle for equilibrium isn't our simplistic conception of a struggle between good and evil. There is no attempt for good to sublimate evil, as we see in so many works of fantasy. Nor is it a breezy assertion that both need to exist in the world; it is a recognition that if both exist at all they exist in everything, including us. The parable of Ged tells us not only to see equilibrium in everything but to consciously strive for equilibrium in ourselves.A Wizard of Earthsea is more than its message, however. It is a story to be read aloud. It is a tale for around a campfire. It is a myth for the child in all of us, and for our children. There is a formality about LeGuin's third person omniscience that has the ring of a bard passing on an important history. But there is poetry in her formal prose, too, and I found myself slowing my reading the closer I came to the end just to make my time with LeGuin's narrative voice last longer.I am sad to see that so many on goodreads don't feel the way I do about LeGuin's fantasy masterpiece, but for once I am confident that I don't need to search my reaction to the book more deeply, to make sure that I am seeing the work clearly. This time I know I am right. A Wizard of Earthsea is one of the greatest fantasy novels (or novellas) ever written. Period.And now LeGuin has two claims to the Nobel Prize. What a shame she'll never even be considered. "}, {"Review": "“In the Creation of Ea, which is the oldest song, it is said, 'Only in silence the word, only in dark the light, only in dying life: bright the hawk’s flight on the empty sky.’”“Back then, in 1967” Ursula Le Guin once commented, “wizards were all, more or less, Merlin and Gandalf. Old men, peaked hats, white beards. But this was to be a book for young people. Well, Merlin and Gandalf must have been young once, right? And when they were young, when they were fool kids, how did they learn to be wizards? And there was my book.”Think of a novel suitable for a young adult readers, about a young wizard who displays great powers and enrols at a school for wizards; a coming of age story, which led to many sequels. Immediately, Harry Potter will spring to most people’s minds. Now put all that aside, if you can, as this is a very different take on the theme. The first book of Ursula Le Guin’s series was written far earlier than J.K. Rowling’s, and is far darker than the first of hers. The world depicted here is not a comfortable familiar one, but an entirely new world of fantasy, peopled with different humans, cultures and concerns. And the magic here is never to be taken lightly.“… you must not change one thing, one pebble, one grain of sand, until you know what good and evil will follow on that act. The world is in balance, in Equilibrium. A wizard’s power of Changing and Summoning can shake the balance of the world. It is dangerous, that power…It must follow knowledge, and serve need.”The idea of a “school for wizards” seems to have originated with Ursula Le Guin. When A Wizard of Earthsea was first published in 1968, the idea was genuinely new and startling, although there have subsequently been many copies. In Great Britain, the prestigious “Times Literary Supplement” observed:“Any quick list of the outstanding books for the young of the past forty years or so will reveal that all have drawn on the extra dimension of magic or fantasy – Tolkien, White, Lewis, Pearce, Garner, Hoban and the rest,”and went on to say that many other authors would draw on the same sources, but would quickly be forgotten. Maybe one novel a year would be good enough. They confidently predicted:“there seems little doubt that A Wizard of Earthsea is the likeliest candidate that we have had for some time: if a book as remarkable as this turns up in the next twelve months we shall be fortunate indeed.It is doubtful if a more comprehensive account of a sorceror’s training exists anywhere in fiction outside the Earthsea chapters.”A bold assertion indeed! And surprising too was the fact that Ursula Le Guin was American, since the authors held up for comparison were almost exclusively British. In the 1960s and 1970s there seemed to be an endless supply of Fantasy books, all proudly claiming to be by “the new Tolkien”. All had invented lands and peoples, and all had the compulsory map at the beginning of the book. Few have lasted. Even now, the genre is saturated in both Britain and the USA - and comparisons are still made with Tolkien. Yet reading A Wizard of Earthsea again many decades later, the novel holds its own and stands apart from, and often above, any competition.One subtle difference is in tone. Fantasy stories usually depict the opposing forces of good and evil, but the reader is sure that good will win out in the end. Hence, in the “Lord of the Rings” trilogy, Gandalf opposes Sauron, in the “Narnia” books Aslan’s enemy is the White Witch, and Harry Potter’s of course, is Voldemort. But in A Wizard of Earthsea, we do not find the main character to be an upright, appealing character at all. The little boy Duny becomes reckless and proud when he sees his powers, and is named “Sparrowhawk” (or “Ged”). He is more of an anti-hero, at the beginning at least. Ged is so arrogant that he eventually raises evil powers which plague and follow him. We are never really sure whether the tormented Ged will be defeated by them, or succumb to them totally. In the end, (view spoiler)[ we learn that what we had thought was evil was really a part of the hero himself. (hide spoiler)]It is not very easy to defeat evil when it is hard to recognise what is good and what is evil in the first place. For part of this story, a luxurious life tempts Sparrowhawk, but who is to say whether this is good or evil? Many of Ursula Le Guin’s works make us question assumptions, and tend to avoid simple moral victories. But present-day readers new to A Wizard of Earthsea may not like this arrogant teenager, being used to more personable youngsters with a high moral code as their fantasy heroes. Either that or cardboard “tough-guy/tough gal” action heroes.Another element which sets this apart from other fantasy novels is the writing style, which is very reminiscent of folklore. There are simple axiomatic truths, easy to remember and quote:“To light a candle is to cast a shadow”“To hear, one must be silent”“What one does not know, one fears”“It is light that defeats the dark”“one cannot look into a dragon’s eyes”“Infinite are the arguments of mages”And these maxims take on a moral import:“Manhood is patience. Mastery is nine time patience”“The wise needn’t ask, the fool asks in vain”“But need alone is not enough to set power free: there must be knowledge”“It is very hard for evil to take hold of the unconsenting soul”Ursula Le Guin also included many factual aspects of known folklore in her books. For instance in some cultures, people believe that if they allow their photograph to be taken, then the photographer has captured their soul. In others, it is believed that your true name is something which can be used to control you. This aspect is an essential truth in the magic of Earthsea, and lies at the foundations of its system of magic.Fascinating details such as these add to the authentic feeling - the “truth” of A Wizard of Earthsea. Ursula Le Guin had developed her interest and knowledge of the folklore traditions of various cultures from her parents who were the famous anthropologists, Alfred L. Kroeber and Theodora Kroeber. The initial “K” in her name is after them.Perhaps surprisingly for a book originally in 1968 by a white female, is the fact that most of the major characters are not white. For some reason, this fact is often changed when the novels are dramatised, but there are many races in Earthsea. “Sparrowhawk” himself has red-brown skin; most are dark or black, and very few of the characters seem light-skinned. Ursula Le Guin once said that the only illustration of Ged which she felt was authentic, out of all the book and film versions, was this one by Ruth Robbins:Here is another race:“The tongue they speak there is not like any spoken in the Archipelago or the other Reaches, and they are a savage people, white-skinned, yellow-haired, and fierce, liking the sight of blood and the smell of burning towns.”This is a very refreshing reversal of the contemporary stereotype, and sets it apart from other American and British fantasy novels of the time. Ursula LeGuin herself commented on this fact:“In other ways my story didn’t follow the tradition. Its subversive elements attracted little attention, no doubt because I was deliberately sneaky about them. A great many white readers in 1967 were not ready to accept a brown-skinned hero. But they weren’t expecting one. I didn’t make an issue of it, and you have to be well into the book before you realize that Ged, like most of the characters, isn’t white.”There are actually six “Earthsea” books altogether. Although most references are to “The Earthsea Trilogy”, there are five novels, plus a book of short stories. The first three were published fairly close together (1968, 1971, and 1972), and the last three were written much later. After eighteen years, in 1990, the fourth was published, and the fifth (the collection of stories), and the sixth both came out in 2001. All the books focus on different aspect of Earthsea, but every novel in the series has been highly acclaimed, and every one has won an award.Her descriptions are always atmospheric, and sometimes terrifying:“… the thing that hunted him must be very close upon him now. That thing was bodiless, blind to sunlight, a creature of a lightless, placeless, timeless realm. It must grope after him through the days and across the seas of the sunlit world, and could take visible shape only in dream and darkness..”“Through it blazed a terrible brightness. And through that bright misshapen breach clambered something like a clot of black shadow, quick and hideous, and it leaped straight out at Ged’s face.” (view spoiler)[“It is the shadow of your arrogance, the shadow of your ignorance, the shadow you cast.” (hide spoiler)]Yet A Wizard of Earthsea is at its heart a coming-of-age story. It is the tale of a young boy who is brought up by his father and an aunt who has a little magic. He runs wild, and has a proud nature. Duny quickly discovers that he has unusual magic powers, far greater than those of his aunt. At first he uses these to help his community, (view spoiler)[ defending his town when Kargish raiders attack (hide spoiler)] but he becomes arrogant and impatient with those around him, wanting more opportunities and recognition. Most of all, he does not want to grow up to be like his father.Because he has become noticed as having a special ability with magic, the boy is taken in as an apprentice by the mage Ogion, who gives the boy his true name, “Ged”. Only later was he to learn how precious and powerful a true name was:“In that moment Ged understood the singing of the bird, and the language of the water falling in the basin of the fountain, and the shape of the clouds, and the beginning and end of the wind that stirred the leaves: it seemed to him that he himself was a word spoken by the sunlight.”“Magic consists in this: the true naming of a thing”These people from a pre-industrial society have different ideas and concepts; a different and more instinctive way of thinking. “Old Hardic”, is the language which magicians use to cast spells, and it is supremely powerful. Not only is magic only possible if you know the true names, but Ged clearly even believes his true self, or essence, consists in a word spoken by the sunlight; which is quite a difficult concept to grasp.Ogion tries to teach Ged about magic and the balance of powers, but very soon Ged meets someone who may not be what she seems. This only serves to fuel his arrogance, and he attempts to summon (view spoiler)[ a dead spirit (hide spoiler)]. Ogion has to use all his powers to stop the incantations, and offers Ged a choice.Ged chooses to develop his powers further, voyaging far away to the island of Roke, where there is a school for wizards. Here he makes friendships and enemies (view spoiler)[Vetch, and Jasper  (hide spoiler)]. But still:“he was all work and pride and temper and held himself apart”Language is power: quite literally in Earthsea. The language of magic is often a hidden secret; wizards guard their secret spells and everyone guards their secret name. Even though they were so close, Ged never learned Ogion’s true name. And later too, we see an instance where Ged cannot talk to (view spoiler)[the two castaways, who were Kargish royal exiles (hide spoiler)] because he doesn’t speak their language. Gaining confidence rather than mere posing and bluster is difficult. We see that this young teenager is still very rebellious, and also insecure. From a poor background, he feels socially and culturally challenged by some of the other many races at the school on Roke. Ged is still very proud of his talents, and to demonstrate his skill, he recklessly tries once again to summon (view spoiler)[ a creature from the undead, this time succeeding in summoning a shadow monster which is to follow him for the rest of the novel. He is in peril of his life, but the Archmage of Roke saves him, and banishes the shadow from Roke: an immense feat of magic, which drains his energy and takes his life.  (hide spoiler)]After this Ged continues to study magic, but his personality changes. He becomes keen to do good in the world, and to use his powers for great work. There follows one of the most exciting few chapters after Ged has graduated, involving protecting a small town from the dragons of Pendor:“On the wind over the grey waves they doubled, snapped, swooped, lunged, til smoke roiled about them red-lit by the glare of their fiery mouths.”(view spoiler)[ This culminates with Ged's encounter with Yevaud, the greatest dragon, over whom he gains mastery by challenging him with his true name  (hide spoiler)].“Old Speech binds a man to truth, this is not so with dragons. It is their own language and they can lie in it, twisting the true words to false ends, catching the unwary hearer in a maze of mirror-words each of which reflects the truth and none of which leads anywhere.”Such a portrayal of dragons as essentially deceitful, persists in fantasy literature.Ged has many other voyages, trying all the time to not put others at risk from (view spoiler)[ the shadow which pursues him, but he is deceived by a woman whom he met as a child, who also had some magic powers. We learn that the life of luxury she and the Lord of the Terrenon offer him is based on evil. Ged only manages to escape after turning himself into a falcon, and nearly losing his true nature in the process. It is only by returning to Ogion in his falcon form, that he manages to regain his true self. Ogion advises Ged to start being the hunter rather than the hunted. (hide spoiler)]“Ged went on, falcon-winged, falcon-mad, like an unfalling arrow, like an unforgotten thought, over the Osskil Sea and eastward into the wind of winter and the night.”We learn of gebbeths, who drain the original body and put an evil spirit in their place, and we learn the danger of only “seeming”. And we meet an old friend (view spoiler)[ Vetch (hide spoiler)], who has stayed loyal to Ged through all his trials, and even trusted him with his true name, “Estarriol”. The ending is dramatic, exciting and unpredictable. It perfectly demonstrates how (view spoiler)[ Ged gains a deeper understanding of himself, by confronting the shadow he has created through his own ignorance and pride. Since it is really his own shadow, and a part of himself, it is absorbed by him.  (hide spoiler)]A Wizard of Earthsea is an amazingly inventive and gripping example of a coming-of-age story, but it has all the basic features too. Ged starts as an arrogant, dangerous child, and over the course of the novel, makes great strides in maturity, learns a little humility, and in developing his skills to learn what his place is in the world. Although still only around twenty by the end of the novel, he has made immeasurable progress in terms of his education, friendship, loyalty, kindness and duty.It is always more fun to see someone with super powers as a hero. A lot of young adult novels tend to follow powerful and potentially important characters. For instance, “Harry Potter and the Sorcerer’s Stone”, and “The Lightning Thief” both follow this convention, and through the telling of the the story, we see the young magicians realise the limits of their power, and how they learn to be responsible for what they can do with it.But this novel is far more than a coming of age novel set in a vaguely described fantasy world. Earthsea is a complex invented world, with many cultures, races, systems of language and magic; it is rich and multi-layered. The writing too lifts this book well above the average, with its language style, atmosphere, and recurring themes and metaphors.A Wizard of Earthsea is saturated with mentions of shadows and fog; there are around a hundred mentions, despite its short length. Every time there is a significant event, the shadows are there; perhaps because shadows and mist create more powerful and subtle images than total darkness:“To light a candle is to cast a shadow …” Light and shadow are inextricably linked, and symbols of the balance, which is unalterable. From the very beginning Sparrowhawk uses fog and shadows to (view spoiler)[deal with the Kargish raiders (hide spoiler)]. Then during his naming ceremony, clouds cover the sun and cast shadows. When Ogion takes Ged with him, they “pass through the leaves and shadows of bright autumn”. Light and shadow; maintaining the equilibrium.Another powerful motif or even metaphor, is that of birds. Ged summons falcons to him, which is why people call him “Sparrowhawk”; Ogion lives in “Re Albi”, which means “Falcon’s Nest”. When Ged meets Archmage Nemmerle, he seems to understand the singing of the birds. (view spoiler)[His friend Vetch imagines Ged flying high like a hawk, and Serret, who is married to Benderesk, the lord of the Terrenon, turns herself into a gull to escape the Servants of the Stone, just as Ged turns into a falcon to fly back to Ogion.  (hide spoiler)]Birds are certainly a potent image. Although the peoples of Earthsea would be familiar with birds, they retain a mysterious quality: that of flight. They have the power of freedom, to escape by flying, which seems magical to these peoples. And they sing, which is yet another language. For these people of early civilisations, having no machines, song and dance are particularly important in Earthsea’s culture. All of their historical lessons are put into poems and songs, which the Master Chanter teaches the students at the school of magic. And one of the most important ceremonies of Earthsea is the “Long Dance”: their New Year’s celebration, when they sing about their island and Earthsea’s history, and perform dances to welcome in the new year. By performing these ceremonies at the same time, all the peoples of Earthsea share a connection, and begin to communicate between themselves.“So, as the mageborn will, Ged made his fear and regret into a song, a brief lament, halfsung, that was not for himself alone.”The story of Ged, A Wizard of Earthsea, is one which is shared, throughout the many lands of Earthsea, and for us, it is a phenomenal introduction to the series. The world of Earthsea is full of supernatural elements: wizards, dragons, swords and stones. Yet not everything is ruled by Fate; there are plenty of areas where Ged has to make difficult choices, and we are fascinated by watching how he matures during the story, and wondering whether he will eventually succumb to the darkness. And it is an excellent foundation for beginning the Earthsea books too, because by making Ged voyage throughout all the tiny islands of the archipelago, as well as the outlying Reaches, Ursula LeGuin provides us with a firm basis to read the rest of her novels in this wonderful series.“It is no secret. All power is one in source and end, I think. Years and distances, stars and candles, water and wind and wizardry, the craft in a man's hand and the wisdom in a tree's root: they all arise together. My name, and yours, and the true name of the sun, or a spring of water, or an unborn child, all are syllables of the great word that is very slowly spoken by the shining of the stars. There is no other power. No other name.”"}, {"Review": "The thing to remember about Earthsea, like all of LeGuin's writing, is that it is less fiction that it is Taoist parable. LeGuin is a philosopher cleverly disguised as a sci-fi/fantasy writer. Her writing is beautiful and languid; her characterization and plotting range from excellent to mediocre. But character and plot serve as a vehicle for the themes of balance, simplicity and serenity that infuse all of her works.Earthsea is, on its face, a fantasy saga along the lines of Tolkien or Rowling. But underneath the thin veneer of fantastical literary convention is a compelling story about action and consequence, and the nature of the self. Reading Earthsea as if it were fiction is missing most of the point, and will leave the reader confused. The story is told in fragments and scenes, and most of the important action takes place off the page. That seems frustrating and senseless, unless the reader understands that the \"important action\" is not actually the focus of the narrative.I think there's a certain amount of \"Emperor's New Clothes\" phenomenon surrounding Earthsea, as evidenced by the recent TV miniseries. People try to read it as if it were regular fantasy, and then say they like it because so many other people do, afraid to admit that they don't really get it. I don't think Earthsea stands up very well against the other greats of fantasy fiction, if it's read in this light. But the beauty of LeGuin's writing and the significance of Earthsea's message make it a worthy addition to the genre, and to every reader's library. "}, {"Review": "I have been reflecting a lot lately on the hugeness of my own limitations. This story represents one of my most obvious limitations when it comes to appreciating books. I don’t understand world building. I think this is my limitation when it comes to historical fiction as well. I don’t understand why an author would want to make a story more complicated than just what it takes to tell what happens to characters. That’s how I experience world building in both sci fi/fantasy and historical fiction – an over-complication of what could otherwise be an interesting story. Unfortunately (or maybe fortunately for you), I think A Wizard of Earthsea is mostly world building (though Ceridwen and Elizabeth inform me that I'm wrong, and I would think that they probably know better than I do what the world-building thing is about. But I am still going to proceed using my arguably faulty definition of world building). I accidentally started reading this book at the same time that Elizabeth started reading it, and in order to not add to the breaking of Ceridwen’s heart, I didn’t put it on my currently reading. I basically agree with what Elizabeth said, and I don’t have that much to add. I’m only giving three stars because my policy is to rate based on my enjoyment, and with the exception of a couple of parts, I can’t say I enjoyed reading this book. For the most part, it had that Lord of the Rings, traveling-with-no-action quality that really puts me to sleep. I liked the battle parts, though. Anyway, I know that a lot of people look down on Siddhartha and The Prophet, but I think what people enjoy about Earthsea must be similar to what I like about those books. They all have a wise, parabolic quality. And I like the self-discovery message of Earthsea. I just think there’s a lot of elaborate hand-waiving and rigmarole to get there. I haven’t read Siddhartha since high school, so maybe it is like that, too, and maybe all of this is about the timing of reading a book.I think I’ve told this story before, I forget where, but when I was in college I ran into this guy I had a crush on in high school and it’s possible that I ended up dating him for a little while. He used to come into the café I was working at and follow me as I walked back and forth behind the counter making sandwiches and whatnot. He wouldn’t talk, he would just walk up and down the counter when I did. I ended up thinking he’s probably brain damaged from all of the acid he always did. One day, I got tired of him just silently following me around, so I asked him to tell me a story. He quickly said, “Oh, no. I don’t have any stories,” and continued to follow me.A minute later, he said, “Oh, I thought of a story!” I was relieved and asked him to continue. “Do you know where the hot springs are?” He asked.“No.”“Oh,” he responded with clear consternation. “Well, do you know how to get to Dexter?”“No,” I sighed, hoping he would get on to the story soon.“So, if you’re on I-5, you take the Oakridge exit,” he explained. “Do you know where that is? I think it’s around exit [estimate of exit number] or [estimate of other exit number].”“Oh, okay,” I said, pretending I knew what he was talking about. “I know where that is.”“Oh good!” He said.” So, instead of following the road left, like you would to get to Dexter, you follow it right.” He proceeded to give me a long and detailed explanation of how to get to the hot springs, all of which I have forgotten now. There were a lot of “turn left”s and “then turn right”s. After quite a while of this, he stopped. “Okay,” I said, “What’s the story?” “Well, we went there the other day.” And that was the end of his story.Maybe it’s not fair to compare world building to elaborate directions, but that’s how they make me feel. Or, at least, how they make my eyelids feel (heavy). Sometimes directions are a necessary evil, and I’ll admit that some world building is necessary, but I like to get there in the quickest, simplest way possible. In Earthsea once I get past the directions and to what I consider the actual story, I like it, but the directions still made me fall asleep."}, {"Review": "A Wizard of Earthsea (The Earthsea Cycle, #1), Ursula K. Le Guinتاریخ نخستین خوانش: سال 2008 میلادیعنوان: دریای زمین کتاب 1 - جادوگر؛ نویسنده: ارسولا کی. لوژوان (لگوین)؛ مترجم: پیمان اسماعیلیان خامنه؛ ویراستار: نیلوفر خانمحمدی؛ تهران، قدیانی، 1386، در 327 ص، جلد 1 از مجموعه شش کتاب در شش جلد؛ شابک دوره: 9789645365835؛ شابک کتاب 1: 9789645362773؛ موضوع: داستانهای خیال انگیز از نویسندگان امریکایی قرن 20 منقل از متن: تنها در سکوت است که کلام، تنها در تاریکی ست که نور، تنها در مرگست که حیات، چون پرواز باز در آسمان بی انتها، خود مینماید؛ پایان نقل. ا. شربیانی"}, {"Review": "\"For magic consists in this, the true naming of a thing.\"- Ursula K Le Guin, A Wizard of EarthseaI rarely venture into YA fiction. Less often still do I pick up and read a book of fantasy. There are exceptions. When I trust the author, we I think there is art/beauty/originality lurking there, I will often venture into spaces and places I usually avoid. Ursula K Le Guin died last year and I started reading her bit by bit, largely focusing on her Hainish novels/cycle. I needed more women in my 2019 plan, and Saga Press recently (on the 50th aniversary of the publishing of Book 1 [this book]) published a wonderful omnibus, illustrated, edition: The Books of Earthsea: The Complete Illustrated Edition. So, I figured I might as well get into the Earthsea boat and give it a go. I loved it. I didn't read much YA fiction when I was a kid. I've read more with my own kids when they were younger, but mostly skipped over this stuff. At the time, I'd rather read Bradbury or Vonnegut. My sister-in-law drives me nuts with her books with swords and dragons. I usually ignore the pulp. But THIS. This is great stuff. It is essentially a Bildungsroman with Taoist elements (equalibrium, etc). It is carefully plotted and spare. She isn't flitting around talking too much about the dragon or the gold and jewel -strung lair of the dragon. She weaves a story about very human things: jealousy, fear, guilt, pride, friendship. The risk was worth it. The journey to other islands in this fantasy archipeligo will continue. I also think it is strangely fitting I finished it on Epiphany (bring on the Mages/Magi)."}, {"Review": "The fantasy classic A Wizard of Earthsea by Ursula K. Le Guin was first published in 1968 and this fantasy book deserves the praise it has often received. The fantasy world, Earthsea, created by the author is rich in detail. The fishy odor at the dock of every village and the salty tang of the sea literally wafted off the pages. The magical system revealed by Le Guin is convincingly real as well, and the way in which the wizards, witches, and sorcerers fit into the society felt natural and logical to me as a reader. A Wizard of Earthsea tells the story of Ged from his childhood to his maturity as a wizard. The son of a blacksmith, Ged was born with a natural talent for magic, and the village witch is his first teacher. When his village is attacked by marauders, he helps to defend his village with a confusing mist that gives the villagers the upper hand. With his power so evident, Ged is proud to a flaw. He wants to show off his power and impress people. When a wizard named Ogion comes to take on Ged as an apprentice, the union does not last long because Ged is impatient for knowledge. With Ogion’s blessing, Ged moves onto a wizard school on the enchanted island of Roke. While at this school, Ged is further goaded to show off because a higher-born wizard student constantly makes Ged feel inadequate. Foolishly Ged accepts a dare to summon the dead, which results in him releasing a dangerous shadow from the netherworld. This shadow will be the nemesis of Ged throughout the rest of the story. The strengths of this fantasy book :1. The narrative has a graceful old style tone that makes you feel like you are sitting by a fire listening to a wise old wizard telling the tale.2. This short novel packs plenty of action into every page. Something is always going on and the story never drags.3. The development of Ged’s character is deftly done. At first, I did not like Ged, but I was not supposed to because he was so prideful. But after Ged is horribly injured by the shadow he summons, his regret for his foolish pride is genuine, and I could relate to it. Most anyone has made a mistake because of the desire to show off, and, in severe situations, lessons learned from such incidents are life-changing as it was for Ged, who became much wiser after his mistake. 4. The entire fabric of A Wizard of Earthsea is tightly woven and the texture of the environment comes through in every phrase of the fantasy book. You can almost feel the windy coastlines and smell the food cooking, and the awe of the common people whenever they see a wizard is palpable. Le Guin also includes clever and creative twists throughout the story. For a time, Ged has a pet animal called an Otak, and the affection between the wizard and the pet allow the reader to feel alongside the character because many people can relate to the furry comfort of a dear pet. In another episode, Ged encounters two strange old people cast away upon a small island where they have lived for many years. Their pitiful existence upon their island prison is shocking to contemplate and their punishment so thorough they cannot even accept Ged’s offer to take them to land because they have been apart from society too long to go back. Weaknesses of this fantasy book:Only minor problems appear in this novel. In my opinion, despite the fact that the world is called Earthsea, the story had more descriptions of boats on the open sea than was needed. The ending of the story is a bit anticlimactic as well although meaningful in how it relates to Ged’s character. Overall, A Wizard of Earthsea is a splendid fantasy book. It might not satisfy readers of fantasy books who like multiple characters and subplots because it is very much a story focused on a single character, but even so, all fantasy readers will love Ged’s battle with the Dragon of Pendor. My review rating for this fantasy book is an enthusiastic five wizard staffs. "}, {"Review": "One of the first aphorisms of a creative writing class is \"Show, not tell.\" Not that I don't believe in turning aphorisms on their heads, but this one is there for a reason. Le Guin, for the greater part of the book, just tells. It makes for a painful reading experience. Children's literature in the 21st century is not limited in its range of boy in fantasy realm turns amazing magic user, and so the dull setting, plotting and characterization of \"A Wizard of Earthsea\" is best left unread. In 1967 when this was published, the environment was less diverse, and so the novel probably has some historical significance, but the painfulness of its prose is not worth its possible insights."}, {"Review": "This is such a precious book of fantasy, of a classic (if it even exists) fantasy tale, of a mage who learns his true nature, who fights himself and his fears to become a better version of himself. The plot is nice and simple, straightforward and entertaining. The writing style is superb, impressive in the simplicity of the delivery. Yet, the words used tend to be of a refined palate; it is pure gold. I dare saying this is felt as a family tale, a book to share with your loved ones; it also feels like a great book to recommend for those who do not know fantasy well or are fantasy beginners. I loved it. "}, {"Review": "The Good:Written in an amazing mythic style, this book initially blew me away. The societies depicted weren't just modern Western cultures with bronze/iron age furniture - the setting felt like a truly ancient place shaped by geography and history, and where lack of technology actually mattered. The magic and metaphysics were freakin' sweet too.The Bad:The second half of the story really dragged, probably for a few reasons. The mythical style certainly keeps the reader at arm's length (not in itself a bad thing), however the main character also becomes increasingly alienated from the setting and the other characters, and also from the reader. Or at least from this one. Then there's the main antagonist, who lacked the substance to generate sufficient drama.'Friends' character the protagonist is most like:Ged starts off a lot like Rachel and finishes like Ross or maybe Gandalf."}, {"Review": "Appropriately for a YA novel, this story is, I think, about processes of identity. In Earthsea, magic-workers are various; from the Archmages on Roke island to the village charm-maker, many folks have some wizardish powers. These come in many forms, but they are based on words, specifically the “True Names” of things in the “Old Speech”. Names are of extreme importance and power then, and a person must guard her true name, given in a ceremony performed at the age of around 13, with great care, revealing it only in sacred trust.Our protagonist, the magically-talented Ged/Sparrowhawk, struggles with certain character flaws, mainly pride and lack of self-esteem. These cause him to create further plot-tangling problems for himself. His classmate in magic school, Estarriol/Vetch, is a valuable stabilising influence, and their friendship is very touching, as is so often the case in Le Guin’s storytelling.The setting is charming and convincing; the chill, watery world, the weather-working, the extensive cast of supporting characters, including exciting mythical animals, the simplicity and sometimes hardship (never romanticised) of folks’ lives emerges palpably. Moments of transcendence, as when Ged first meets the Archmage and watches the raven, or exchanges names with Estarriol, sing out of the text. Two familiar features of Le Guin’s writing are notable here; firstly her use of skin colour; Ged is described as copper-skinned with dark hair, and his friend Vetch is darker, while others, for example the invaders who come to plunder the village, causing Ged to discover his talent, are pale folk. Reading about the latter episode, I suddenly wanted to laugh, because while this never seems to happen in fantasy fiction, it does happen in real life… secondly, the treatment of luxury as a sinister sign, since those who can afford luxury must exploit others to do so. As usual I am grateful to Ursula for keeping me awake and critical while lulling me into bliss with her lovely language."}], "Image": "https://images.gr-assets.com/books/1353424536l/13642.jpg", "Desc": "N/A"}