{"Genre": "Fantasy", "ID": "256683", "Name": "City of Bones", "Reviews": [{"Review": "IMPORTANT EDIT (1/14/18):Fam, I wrote this review in 2011. All of y'all commenting in 2018 need to get over it. I've moved to a different account. I've moved past Cassandra Clare and while I maintain that this book is a blatant rip off of about 1000 other books (and while a lot of you insist that she's an original author, like it or not, she does have a history with plagiarism/bad behavior), I haven't read any of her new stuff so I can't tell you if she's continued to toe the line with plagiarism or write poorly. In fact, I can tell you that a lot of people whose opinions I trust say that she's become a much better, more original writer. I've even considered reading some of her newer books. If you enjoy her writing, good for you. If these books she's written are important to you, I'm happy for you. My opinions are my opinions, you don't have to share them. What's really gross is the amount of bullying and personal attacks that are going on in these comments and in messages I've received. While I do regret some of the harshness of the original view, attacking me or anyone else in the comments (on either side of the fence) is gross. I've received abuse about my looks, about my writing abilities (I don't write), about my sex life (people implying I should get laid), about my mental health, and even a few messages telling me to kill myself. All because you don't like my opinion of a book. Guys, even if you hate this review, you have to see that this is way too much.I've grown up since writing this review and I sincerely hope that some of you have matured, too, since writing some of the hate that I've read (some of of which I've deleted) in these comments. Please stop. Please move on. Review from 1/24/11:I've been deliberating for a few hours over doing a Serious Business review of City of Bones and outlining the infinite number of problems that lie within, but I decided that any critical thought that I could flesh out isn't going to be anything that you've never heard before. Therefore, I choose the low road - sarcasm and mockery.Oh, Cassie Clare, you so crazy. I can only guess that after writing almost a million words of Harry Potter fan fiction, a bunch of people sucking your e-cock for stealing whole paragraphs from books and quotes from Buffy simply wasn't enough. No, I understand. You had to capitalize on all that time spent typing up whole paragraphs from books and outlining plots that pretty blatantly ripped off from various films, books, etc. I get it. I'm sure that's how the Mortal Instruments came to fruition. It is painfully obvious that your dopey red-haired ingenue and snarky blond asshole were essentially Ginny Weasley and Draco Malfoy in Original Character clothing. Ditto Simon being a hybrid of Harry/Ron and maybe Isabelle being a slutty Hermione. But wait, you didn't stop there! Hodge is Lupin/Peter Pettigrew 2.0 and Luke is better known by his other name, Sirius Black, and I am not entirely sure why you didn't just call Valentine by his true name - Voldemort. And seriously, though, why not just call the Mortal Instruments by their true name - the Deathly Hallows? But wait, it gets better!Strong with this novel, the Force is - because somehow there's a creepy Luke and Leia thing going on with Clary and Jace which, for the record: dude, that's nasty. How dare you let them make out and then discover they're related. Because I had to know in order to keep myself from hurling up my dinner, I did discover that this little detail does get resolved eventually, but I reiterate: that's nasty. I thought the point of this book was to make teenage girls hold their hands to their hearts and swoon, not make them want to upchuck with what I find to be your disturbing affinity for incest (seriously - you had the whole six episodes of Star Wars to steal, uh, draw inspiration from and you pick the creepy incesty parts?). But it's weird, because if Jace and Clary are Luke and Leia, does that make Simon Han Solo? In a weird way, I found Jace's whole over-confident demeanor to be more like Han, which I guess is pretty on point with what happens in later novels. In other news, I will no longer be referring to Valentine as simply that; he is now Darth Valentine. Yes, I said it. I guess this makes Jocelyn Padme, except she's not dead yet.I must give you where credit where credit is due, though. Clary isn't a total dumb, annoying, doormat heroine, which is essentially my biggest pet peeve in the entirety of fiction. Instead, Clary is just dumb and annoying. Why the fuck does she slap everyone? It doesn't make her a strong, venerable female, it makes her a psychotic bitch, especially since there wasn't a single justifiable slap she delivered. Also, she's a moron. Blind, deaf babies knew that Simon was in love with her. My dog knew that Simon was in love with her and the most complicated thought he has in a day is, 'gee, I think I'll lick my junk today'. I have no idea why it's such a surprise to her, really. This brings me to my second greatest pet peeve and yet another trope that you liberally borrowed from, well, everyone: all the boys want Clary. What the hell is this shit? Clary isn't even likable. You stole it off of Stephenie Meyer who stole it off of L.J. Smith and frankly? You keep copying copies, the shittier-looking and harder to read they get. You are not an exception, you are the rule.Also, okay. So the Clave is like the circle of Jedi, right? And the Circle is like the Order of the Phoenix and the Death-Eaters, sort of, but bad. So, like, Order of the Sith, kind of? Also, is Darth Valentine channeling Magneto from X-Men: The Last Stand with his whole 'purifying the race' bullshit? I think he is. Now that I've brought the X-Men into the picture, I can see the vast similarities there, too; Clary is film version Rogue and Wolverine - Rogue because she can't be with the person she loves physically (Rogue's life-sucking power = Clary's being in love with her brother) and Wolverine because of the whole not having any memories thing and wondering why he has all this power. Also, The Institute = The Knight Bus/Hogsmeade/The Leaky Cauldron (because sometimes the Institute boards travelers and there's bad food at all three places, much like Isabelle's cooking) and also Xavier's School For Gifted Youngsters (and Hodge is kind of Professor Xavier-esqe - his inability to leave the institute = Professor X's disability) and also The Jedi Training Academy and also possibly Starfleet from Trek.You know what the funniest thing about all this is, Cassie Clare? You aren't even stealth about stealing. You know, when most people shoplift, they maybe do a cursory look for the cameras and stuff something in their pocket when they think no one is looking, but you're that chick that goes up to the clerk, asks a clerk a question about a product you have in your hand while winking that you just don't have the money to pay for it. In this book there were blatant reference to both X-Men and Star Wars (Magneto and Prof. X by name and the dice hanging up in the Millennium Falcon).Now that I've drawn all necessary attention to your totally original content, I want to talk about the story in general. I read this book because it was handed down to me by my recently-turned eleven year old niece. I figured, okay, I'll figure out what the big deal is with this book since everyone and their mom (no, really, I think my mom, too) has read it. My niece isn't what anyone would call fastidious; she hates cleaning her room and at dinner, she likes to mash all of her food together and make a sculpture with it and then eat it. Imagine my surprise when I saw that the portion of the book I borrowed from her had pages upon pages of highlighted words. I figured, aw cute, she highlighted her favorite parts. But, no, my eleven year old niece had gone through the book and highlighted grammatical errors. There were misspellings, comma splices, and just general bad phrasing all throughout. She had also highlighted words that she saw in multiples. Seriously, Cassie Clare, I get it. Every time a wolf shows up in your book, you don't have to describe it as 'brindled'. I get it. Did your word-of-the-day calendar run out? Did you lose your thesaurus? Do you have a short-term memory problem and forget that you used the word 'brindled' to describe a wolf eight times? I can't even talk about the metaphors and the similes. I can't. I used to like them. Now they make me want to punch toddlers in the face because your book is full of approximately nine hundred and thirty-three million of them. I am also not going to talk about your bizarre tense changes and the random chapter you threw in from Luke's point of view which was completely out of character for both a man and a human, let alone Luke - no one talks like that.Another thing that I want to reference is this whole stele thing. In Tatiana's review, she mentioned that there didn't seem to be any parameters with this stele; it seemed to be a fix-it for whenever you had written yourself into a hole. I may not have noticed it had I not read the review first, given that as I was trudging through, I was filled with an irrational rage. It's a very good point, though. But since I read your book in three days just to get through it, I'm feeling like an asshole and I want to ask the following questions: can the stele make me look like Scarlett Johansson?; can the stele magic a cheeseburger out of thin air? These are questions of vital importance. Because if the stele can't, maybe you want to consider it in case one of your characters gets stuck on an island with no food for three years or something.In conclusion, Cassie Clare, OF COURSE YOUR BOOK IS GOOD. YOU STOLE EVERYTHING IN IT FROM OTHER PEOPLE. I just want to say that I sincerely hope that you make/have made a lot of money off your books; I also hope that the people you blatantly stole your content from take it all from you when they sue you.Here is the Reader's Digest version of this review:The Mortal Instruments = Harry Potter/Star Wars/X-Men/possibly Star TrekClary Fray = Ginny Weasley/Princess Leia/Rogue/Wolverine/Uhura/Cassandra Clare, herselfJace Wayland = Draco Malfoy/Luke Skywalker/Han Solo/Wolverine/possibly Captain KirkSimon = Harry/Ron/Cyclops/sometimes Han Solo/possibly SpockIsabelle = Slutty Hermione/one of the green chicks Captain Kirk always hits it with/one of Jabba the Hut's slaves/possibly Jubilee or another dumb, irrelevant mutantAlec = token gay character/C-3P0??Luke = Sirius Black/ChewbaccaJocelyn = PadmeHodge = Remus Lupin/Peter Pettigrew/Professor XavierValentine = Voldemort/Darth Vader/MagnetoThe Institute = The Knight Bus/Hogsmeade/The Leaky Cauldron/12 Grimmauld Place/Xavier's School For Gifted Youngsters/Starfleet AcademyChurch the cat = Mrs. Norris/R2D2the portals = Floo Network/Disapperating/Beam me up, ScottyEDIT:Someone pointed out that mundies = muggles GOOD POINT, YO"}, {"Review": "***Warning: won't contain spoilers cause I didn't get far enough to give a fuck and discover anything worth spoiling.***Okay, so let me get this out straight. I have never NOT finished a book before. Okay, I'm lying. The History of Sexuality Volume 1 by Michel Foucault remains unfinished as does Villette by Charlotte Bronte. Why? Because they were boring.Because, as I read them, I wanted to take a cheese grater to my skull and rub vigorously just to have something to do!But I have never NOT finished a Young Adult paranormal novel before. And I've read some BAAAAAD books. But I didn't finish this book because it goes beyond bad. It makes the History of Sexuality seem amazingly interesting and colourful.To be fair to Ms. Clare, I was not actually \"reading\" her novel so much as listening to the Audiobook. The Narrator, Graynor, did a particularly craptastic job.To be fair to Ms. Graynor, she didn't have much to work with. I tuned her out, I swear, I was focusing on the actual prose, taking in the story, trying to get interested. But the writing was terrible. It was painful. The characters were annoying.Now, I've been fair to Ms. Clare and I've been fair to Mr. Graynor. So there's only you left to be fair to now.And in order to do that, I have to admit that I wasn't EXPECTING to like this book. I was, however, expecting to be pleasantly surprised, and I'll explain why.Many years ago, Cassandra Clare was Cassandra Clair - a VERY popular FF author in the Harry Potter and LoTR circles. I actually greatly enjoyed her Draco Trilogy. I've read it many times. I had heard that this book was very similar to DT and so I was expecting to find it to be a guilty pleasure. Something my moral compass told me to leave behind, but that I would actually enjoy too much to do so. But I was wrong.Yeah, she plagiarized that work and I won't really go into it except to post a link because in the end, I'm not reviewing her, I'm reviewing her work.But here's the problem. Jace is really just Draco from DT. Simon is really just Ron and Harry amalgamated into one. Clary is really just Ginny. The bad guys seems too much like good ol'Voldie. The plot is painfully similar to DT. It was like reading her old work all over again. And I think, because she was really just redressing her old characters, she didn't even both to give them any growth in this story.To be honest, I didn't read far because the writing was boring (oh my lord, the similes! Someone save me from them) and poorly constructed; the characters were boring and poorly constructed and the plot was boring and poorly constructed.I'd already read DT so I didn't need to read this."}, {"Review": "Okay, so I’m far behind the curve on reading this, but I very much enjoyed my introduction to the world of nephilim, Shadowhunters and demons. Clare constructed a vivid, believable parallel world with great characters, punchy dialogue, and a winning mix of humor, pathos and action. I like her take on warlocks, vampires, and werewolves, and of course I’m a big fan or urban fantasy, where these fantastic elements mix into the regular gritty city life of New York. Clary Fray is a sympathetic protagonist, though I was equally drawn to the supporting cast. I especially like that the villains are believably three-dimensional. Even when you do not support them, you understand what motivates them. There is no easy black and white, good and evil dichotomy. I’ll be interested in seeing where the series goes from here, and what Clare does with her Victorian prequel series The Infernal Devices."}, {"Review": "15-year old Clary witnesses a crime at a trendy New York night club. Interesting thing, nobody but Clary can see both the victim and perpetrators. As it turns out, there is an entire invisible to regular people world, and Clary is an unwitting important part of it. \"City of Bones\" is one of those books that all my female friends and fellow readers simply love, Jace-mania all around. Needless to say, I had to jump on the bandwagon eventually and get me some Jace. Who am I to deny myself a pleasure to fall for a fictional hot, sarcastic and brooding guy? Imagine my disappointment, when I found out that this book was one big pile of hot mess! Sorry ladies, I said it, it's bad.I had the hardest time sticking to the story and for quite some time I couldn't figure out why. Then gradually I realized that there were several reasons.Let me start with the editing. I don't really think this book was edited at all, actually. Errors were endless and visible to even my untrained eye: wrong words (\"noise\" instead on \"nose\"); missing words in sentences; strange mix of POVs (the book is mostly told in 3rd person, from Clary's POV, but occasionally I saw both 3rd and 1st person narration in the same paragraph describing the same events, then there was a page from Jace's POV and a chapter from Luke's); Clary's father was called Jonathan in the beginning of the book, but John in the end. I can go on, but these were the things that I would normally overlook if the story itself was good. Unfortunately it wasn't, and the errors stood out.I didn't think that the story was cohesive, it just didn't quite flow for me. It read as more of a series of events rather than a novel. I thought there were some parts in the book that served no other purpose but to give our hero an opportunity to act knight-like. I am talking about the entire rat-Simon/vampires extravaganza. This story line could have been edited out completely without any damage to the narrative IMO.I couldn't quite relate to any of the characters either. What made my friends sigh with adoration, annoyed me. I hated the sarcasm, mainly because the jokes, although funny, felt often out of place, plus all of the characters attempting to joke, sounded exactly the same to me. I didn't feel the difference in attitudes of Clary, Simon, and Jace. If Clare had to make Jace a witty sarcastic type, she should have made the wisecracks his exclusive trademark, not everybody's.The story itself was so ridiculously predictable! I do not normally see what is to come in the books, but in COB, I saw every \"revelation\" coming. Clare just doesn't have a skill to lead to them subtly, it's always in your face: \"Valentine is alive\" revelation (who in this book who was thought to be dead was actually dead? - a serious question), \"your mother put a spell on you\" revelation, the big \"father/brother\" revelation - I could see them all, and I am not the most astute reader out there.Now, my biggest problem with this book - I've read/seen it all before! Clare borrows so liberally from \"Star Wars,\" \"Harry Potter\" and \"Buffy,\" it is simply impossible to overlook. Valentine - Voldemort/Darth Vader combo; Jace/Clary - Luke/Draco/Leia/Ginny (if it is possible) combo; the Circle - reversed Order of the Phoenix/Death Eaters combo; the Clave - Ministry of Magic; Luke - Lupin/Snape combo; Hodge - Giles/Wormtail combo. I can continue, but will stop here, you get the picture. Granted, there is nothing absolutely original in paranormal genre, but a skillful writer can re-work an old theme and make it new, fresh, and unique. Whatever is original in COB, is not quite thought through. As an example, let's take a \"stele.\" After finishing this book, I still have no idea what exactly it does - do you only write runes with it? how exactly do you use it in a battle? why it can open some doors and not others? it can heal, but not everything? it can make you be able to see through a wooden screen, but is it because you write a special rune with it or you use it as a wand? It seems to me stele is pretty much used as a deus ex machina, convenient whenever a quick solution to a problem needed. And what's with all the shadow folk? There is just so much mashed up together - fairies, vampires, werewolves, pixies, jinns. You name any mythical creature, it is in this book. And what about magic? I read about spells made by a warlock, stele rune tricks, curses, where does it end? The limits of magic possibilities were never defined. Bottom line, all these inconsistencies make for one unoriginal and messy imaginary world. And this probably was the main reason why I couldn't connect with this book. Finally, I was a little surprised by some of Clare's creative choices. I found both flirtations of at least 35-year-old warlock (he might be older, his age was never mentioned) with a gay teenage boy and reversed Leia/Luke extravaganza quite tacky, if not disturbing. Although I know how Jace/Clary \"family matter\" is resolved in the end, I don't find possibly incestuous relationships appealing.This review might make it seem like COB is the worst book ever written. I wouldn't say so, after all, I've read \"Breaking Dawn,\" and that book doesn't have any plot. There were some nice Jace/Clary moments, the greenhouse birthday party comes to mind. But was COB the most blatantly unoriginal book I've ever read? Absolutely (although I haven't read \"Eragon\" yet, but I heard a lot about it).In all honesty, I shouldn't give this book more than 1 star, but I will add a second one as a dedication to one Mrs. Jace Wayland. Would I recommend this book? Sure, many of my friends enjoyed it immensely. Will I continue on with the series? I don't think I will be able to convince myself to waste any more of my time on being mad at a book. I think I will just check out plot summaries on wiki and be done with the series.P.S. I just read that Cassandara Clare is an avid and famous in certain circles fanfiction writer. I guess that's where all the liberal \"borrowing\" comes from. Mystery solved."}, {"Review": "Wow. I was reading some reviews on this and people either hate or love it. I am not ashamed to say I belong to the latter. Lots of opinions means there is lots of things to say...Ok so I was practically splitting my head open thinking of what exactly I wanted to say about this book. In the end I just decided to go with what comes to mind. So here it goes...Clare does a superb job of drawing you in. Maybe the plot isn't completely unique but the world she created is. I kept telling myself this is sooooooooooo interesting. The whole shadowhunter thing oozes with coolness. I mean half angel, half kick butt people! It doesn't get much cooler than that. The story is full of action and yes sometimes there are things added for dramatic effect, but isn't that the point? If you were looking for something more slow paced read The Mill on the Floss (personally I'd rather pull more hair then read this but moving on...)I'm a sucker for action sequences so this totally delivered on that front. The author's take on werewolves was original, and I gotta say they give the vampires a run for their money. I actually guessed most of the twists but that's some of the fun. Finding the hints and feeling the satisfaction of saying YES! Score for me I got it right! Let's do a little victory dance. (insert some break dancing moves I personally cannot do here) I think some people didn't get that guessing the twists is all part of the experience.Some people claimed all of this to be fluff but I don't agree. Just look at Jace. The whole feeling about belonging has depth to it. Now for why I knocked off a star even though I REALLY didn't want to. I thought Clary would be more shocked about finding out her history. You'd think with how much her mother pounded in to her that there was not such thing as magic she would resist the whole idea more. Also I think the author tried to introduce too many fantasy creatures at once. Like the scene at Magnus Bane house was overdone for my taste. We could have done without so many new faces. Those are just little irks though, my main one was Valentine. I know this is going to sound outrageous but Valentine wasn't bad enough for me. I shouldn't feel this way looking at his track record he is evil. The thing is I wasn't scared of him. A good villain has got to be scary plain and simple. I'm hoping to see more evilness in him in the next book.Well I think I've said enough. I'm so glad I'm reading this series after all the books are out. I totally expect to be blown away by the next installment:)Later added: Guess what guys? They are making a movie and here is the trailer!"}, {"Review": "\n19 Apr '16\nBet you're sick of my updates, now.Just for reference, on the recent Sherrilyn Kenyon v Cassandra Clare.Kenyon has filed a lawsuit against Clare, and also provides a list of alleged similarities between Clare's work to her own.Read and decide for yourself.\n15 Jun '13\nupdate again! Saw some stills for the movie, and to be honest, despite being slightly spurious in my \"casting\" of City of Bones, I actually think my version is much better than the movie version.I mean, look at Isabelle, and look at Clary.Correct me if I'm wrong, but Isabelle is supposed to be way hotter than Clary.And don't even get me started on Jace.I mean, Jamie Campbell Bower was cute in a couple of his other films, but.... Jace was supposed to be..... I dunno... swoon-on-your-feet-panty-wetting hawwwt.And Simon.....I mean, he has \"friendzone\" written all over him.\n12 Jan '13\nI know this is now being made into a film, and I know they've all got the cast sorted out, but I imagined them very differently. So here's how they all played out in my head:Simon - Aaron Taylor-JohnsonFor some reason, I always imagined Simon as young Eisenheim. And a part of me wants to kick myself for associating the 2006 film with this book in any way.Alec - Ezra MillerAnd no, it's not because he's queer.Isabelle - Jessica SzohrBecause I wanted to put this picture in here, 'kay?Jace - Draco MalfoyI mean come on. Is there even a debate on this??Clary - Kristen StewartOnly because her acting skills match the quality of Clary's personality.\n11 Aug '12\nAlso known as Why Readers CAN Review An Author As Well As His/Her Book, And Why STGRB Are Full of Shit And Obviously Never Took English Lit Classes For Telling Us We're Not Allowed To.I heard about the whole plagiarism issue long before I even heard of Cassandra Clare's books, so I tried getting into it as objective as possible, given the circumstances. All I know is that she pretty much copy-pasted whole wads of text from another FF writer, from published books, from TV dialogue - into her Draco Dormiens trilogy, without providing any credit to the original authors.I also know that she lifted wads of text from Draco Dormiens into her published Mortal Instruments. What remains a mystery, though, is whether these bits copied into The Mortal Instruments were her own original pieces of writing, or some of them even plagiarized work?I won't go much into the whole plagiarism thing, since if indeed any plagiarized work exists in The Mortal Instruments, that is pretty much speculation.However, it does bring to mind questions of ethic; should a plagiarist be published? Some people strongly believe in giving second chances. I think people only deserve second chances when they admit to their errors and have truly proven their repentance. Both cases which I have not as of yet heard Cassandra Clare do.Other questions popping into my head include shouldn't there be some sort of punishment for plagiarists?! I mean, if I did in university what Cassandra Clare did in Draco Dormiens (and, arguably, The Mortal Instruments), then I would've been kicked out on the curb and my pretty Master's degree ripped to shreds. And, similar to the whole Chris Brown debacle, instead of condemning her far below ethical work habits, we, the consumers, commend their \"artwork\", as if sending the message that whatever wrongs they have done, it doesn't matter because people still eat their shit up. There is no learning curve here; or at least, no deterrence factor.But anyway, I tried to suppress these nagging questions while I read the book, because I wanted to know if I would truly, objectively, enjoy City of Bones. Especially after the whole \"GR Bullies\" absurdity, where an increasing number of voices proclaim that Reviews Should Be About Books And Completely Separate From The Author.Well, ladies and gentlemen, my experience reading City of Bones will provide evidence (alongside many other ample evidence out there), that no - sometimes we, as readers, cannot keep the two things separate. Sometimes, our moral and ethic code just won't let us. Reading is, after all, a subjective experience, and all sorts of things influence our enjoyment of it, including our perception of the author. And if that affects our enjoyment of a book, then it damn well does belong in a review if we choose to put it there.So. Anyway. Now that I'm off my soapbox. The biggest thing that stands out while I read City of Bones was \nhow inconsistent the writing was\n. It was so lazy and repetitive, information was handed over to us on a silver platter - there was no subtlety or any depth going on. But then there would be brief, short scenes or dialogues that actually made me laugh out. Those few and interspersed scenes surprised me, like one wet and icky autumn day, when I found a five dollar bill while raking up my neighbour's filthy garden.Try as I might to ignore it, I was at a dilemma. Should I enjoy this? I mean, it's only five dollars. Surely they couldn't miss it. And, I mean, I'm working my arse off in this horrible weather because my mother owes them a lawnmower. And anyway, it might not even be theirs to begin with.In the end, I took the money (come on, you would've, too!), but I just didn't enjoy it as much as I would have. And the delight I should have felt at finding money just wasn't there.These funny bits of dialogues and scenes filled me with just as much inner turmoil as my five-dollar-note dilemma, and even though I know that maybe, perhaps, it could be that these are all Cassandra Clare's own words, I still couldn't shake off the icky suspicions out off my gut - did she \"draw inspiration\" from some other unknown source, here?In the end, it just ravaged me with too much guilt and suspicions that what originally would have been a five-star scene was reduced down to three stars and a really, really sad face.Also a part of the inconsistent writing, was the \ninconsistent narration\n. I know 3rd person omniscient gives the narrator the power to sift through characters' thoughts and emotions as they please, but this is what made the narrative sound forced and contrived. We would normally follow Clary as the novel progresses - until it is convenient for us to see things from another character's perspective, in which case off we'll jump into another person's head.These conveniences are just one example of what I mean when I say that \nthe narrative lacked subtlety\n. When we aren't directly being fed a certain character's thoughts and emotions through his/her own point of view, we are blatantly told their feelings by the character themselves. Rarely are people in real life so honest and self-aware as the characters in City of Bones.\"An asshat?\" Jace looked as if he were about to laugh.\"What you said to Simon--\"\"I was trying to save him some pain. Isabelle will cut out his heart and walk all over it in high-heeled boots. That's what she does to boys like that.\"*\"(...) You want to know what it's like when your parents are good church-going folk and you happen to be born with the devil's mark?\" He pointed at his eyes, fingers splayed. \"When your father flinches at the sight of you and your mother hangs herself in the barn, driven mad by what she's done? When I was ten, my father tried to drown me in the creek. I lashed out at him with everything I had--burned him with everything I had--burned him where he stood. (...)\"*\"I didn't think you liked me all that much.\"Isabelle's brightness faded and she looked down at her silvery toes. \"I didn't think I did either,\" she admitted. \"But when I went to look for and Jace, and you were gone...\" Her voice trailed off, \"I wasn't just worried about him, I was worried about you, too. There's something so ... reassuring about you. And Jace is so much better when you're around.\"The point I'm trying to make, here, is that we get to know the characters because other characters are constantly telling us about them, instead of us making our own informed opinions of them based on their actions and words. This is why I say \nthe writing was lazy and lacked depth\n. And how Cassandra Clare tried to show us that her characters have background and troubles and are oh such damaged goods was more or less through self-testimonials such as the second quote up above, where Magnus Bane so conveniently gave away his entire childhood to three random teenagers. The chapter The Werewolf's Tale was another one of these self-testimonials for another partially-important character. This is a whole new level of telling-instead-of-showing. Where unimaginative writers just unload all these information through descriptive prose, Cassandra Clare was at least creative enough to hide it into her dialogue. But the same underlying problem is still there - we see none of this \"damaged goods\". I didn't need Sweeney Todd to tell me his past to know that he was a damaged, troubled man. His actions spoke it for me.As for \ninformation being handed to us on a silver platter\n -- all you need to do is take a look at the entire ending scene with Valentine to see my point. The whole chapter was an infodump session. Rarely do I read villains who are so eager to reveal their past and provide explanations to their potential victims. The Harry Potter novels were slightly guilty of this - especially in the earlier books - but I believe a lot of other things about the books redeemed itself from this one fault.Jace was also a bit of an infodumper, but I don't take away points for this. I mean, I get it - it's hard to get on without one character at least explaining what the blazes was going on.Speaking of characters ... this is rather tough. Many reviewers despised Jace because he was such an asshole. Clary herself accuses Jace of being an asshole plenty of times. But I've lived a fair amount of years, and I was friendly with quite a few assholes during my own teenage years. And let me tell you one thing: Jace is no asshole. He's a guy with daddy issues, trying to act tough. And that is as deep as any of the characters get. I guess, he would be my favourite character out of the whole lot - not my favourite character as in the one I liked the most, but the character whom, in my opinion, was the most developed, without self-testimonials or other characters telling us about him.But remember my five-dollar-note dilemma? Yeah. Jace was, without a doubt, a direct cut-and-paste of the Draco from Clare's Draco Dormiens trilogy - who, by default, is a creation of JK Rowling's. So forgive me if I \"can't separate the book from the author\" because frankly? If I enjoyed this book simply because of Jace, that doesn't say much about the rest of the book, or the quality of writing, because Jace is not even Clare's original character.Further illustrating the inconsistencies of Clare's writing, though, was the sudden and drastic change in Jace's character during the scene with Valentine. There is no way one person, in such a short amount of time, could thoroughly convince and change Jace into such an ... obedient? passive? receptive? character. No matter who the person claimed he was, or what evidence he brings to the table. Even if Jace believed in everything Valentine told him, there is no way it would have drastically changed him in such a manner and such a short time.Just as unlikely, was the way Jace was ready to walk the ends of the world with Valentine, build a new life with him, and in the next moment - after a few words from Clary - was ready to throw that all away once again. The double inconsistencies astound me. Clare simply does not understand human psychology or even human nature enough to make solid characters.The other characters were forgettable, to say the least. They all sounded the same, I'm afraid. Witty, dry sort of humour. It gets tiring after a while. Also, the Magnus-and-Alec thing? Can I just say, ew? Magnus is like, what? Forty? And Alec is ... sixteen?Even Valentine the Villain was ... not much of a villain. He didn't frighten me, or even daunt me. I kept reading how Clary was disgusted at how manipulative he was during his scenes, but reading the pages myself, reading his words, his actions? He wasn't particular conniving or ingenious - really, it was just that Jace was so ready to have a family back, he was willing to lap up every bit of contradicting information he heard.Plot progression and twists were unsurprising. Uninspired. No, wait, they were inspired. By Star Wars and Harry Potter, to name a few. Perhaps even a bit of Buffy in there.And this is where my final dilemma lies. To like, or not to like? That is the question.For light fluff, it has entertainment value enough. But what little entertainment value there was, was lifted off other, better, pieces of work out there. To say that I did not enjoy City of Bones would be a lie; but the question is, did I enjoy City of Bones, or did I enjoy the bits of Harry Potter and Star Wars in City of Bones?I'll let you decide if it's fine to like a book filled with other writers' characters, other authors' plot twists, other screenwriters' dialogue. Perhaps I'm being too uptight, but here's how I see it. New York with Potterverse and Star Wars. Take that away and what are you?\n"}, {"Review": "I was instantly enchanted when I first read City of Bones, and that enchantment still holds four years, and at least half a dozen re-reads later in sptite of the fact that I'm older, wiser, and should know better. I've also read countless reviews, both adoring and loathing and have come to the conclusion that this book does not garner any type of middle ground, you either love it or you hate it. I'm glad that I get to love it. What else can I say?[image error]For me, this book shines, and to those of you who loved it, I imagine you are a bit like me. You found yourself immersed in a world where demons roam the night, weres run a bar, vamps occupy abandoned hotels, warlocks cast spells while rockin glitter in their hip hugging jeans, and the law is upheld by Shadowhunters, a race of humans blessed by the angel Raziel. Hokey? Sure. Rockin like a unicorn adorned bike? Hell yes! Even the setting, NYC, was so palpable; it became another character in this vibrant story. I thought the Shadowhunter world was funny, sleek, dark, sexy and hopeful. More importantly, the characters came so alive for me that they jumped off the pages. I felt as though I were in the story with them as opposed to merely following along in their journey.Regardless of the types of books you prefer to read, or the characters that endear themselves to your heart, I think we all read to for some type of enjoyment. What evokes that enjoyment varies from reader to reader, but I still find excitement within these pages. To me, that is the mark of a fantastic book. "}, {"Review": "A great and interesting books. I manages to combine the infulences from many of top fictional series of our time. It combines hidden magic world of Harry Potter, the teenage drama of Buffy, and a couple of themes from Star Wars as well. The book is very well written and fast paces.We follow Clary Fray, a 15 year old misfit trying to find heself, not quite sure if she is goth, cyberpunk, or just a temperamental teenaged artist. One night in the local club, Pandemonium, she realises she is a witness to an attack, the strange thing is that the victim of the attack disappeared right before her eyes, and when security arrives, despite the attackers standing right in front of them, she is the only one who can see them.Clary descovers she is part of the world of Shadow Hunters and demons. Shadow Hunters are demon slayers. She learns stories of Vampires and Warewolves are more truth than fiction. She is attracted to Jace the most accomplished of this group of hunters. Much to the chagrin of her best friend Simon, and Jaces' hunter brother Alex.She learns years ago a charasamitic, powerful, and high ranking Shadow Hunter, called Valentine created his own circle to cleanse the world of all demonic blood. Weather they were good or bad, their existence was enough of a crime. He was ruthless to the point he was willing to sacrifice anyone and anything human or demon as calateral damage. Now after 17 years Valentine has seemingly returned from the dead to finish what he started. Clary must learn of the ways of the shadow hunters if she is help her friends stop Valentine.Great story, good drama, the characters are ok, the only failing I found in the book were the fight scenes. I think these are not the writer's strongest area yet. All in all a great book, not as action packed as I expected but the story makes up for this."}, {"Review": "\n\n“Shadowhunters: Looking Better in Black Than the Widows of our Enemies Since 1234.”\n\nI read City of Bones for the first time 5 years ago. I still remember that day. The sun was shining, the birds were singing It was during my first semester in Law School and I had to study History of Law, which was a complete waste of time because seriously, who is ever going to ask me whether women in Byzantium could get a divorce? (In case you are wondering, they could only if the husband was impotent or possessed). Aaanyway, I wanted a break and I grabbed this beautiful book and started reading until I finished it, bleary-eyed, disoriented and obsessed. A typical day in Kat-verse. \nSo what's the story?\nShadowhunters (ninja warriors with angel blood) fight demons and co-exist with vampires, werewolves, fae and warlocks while a former Shadowhunter with nazi tendencies threatens to destroy them.City of Bones is a fast-paced, action-packed paranormal book that keeps you invested in the story and the characters since page 1. A nerd, a heartbreaker, a jealous friend, a warlock who loves glitter, a werewolf, an artist and a gorgeous warrior introduce you to a world of magic, where nightmares come true, truths are revealed and decisions have to be made. Diving into this world is easy, effortless and so, so enjoyable.\n\n“Is this the part where you start tearing off strips of your shirt to bind my wounds?\"\"If you wanted me to rip my clothes off, you should have just asked.” \n\nHumour and sassiness are all over the place and witty banters crack you up. But mind that there is also drama, plot twists and shocking moments that make you question the writer's humanity (and maybe sanity). Cassandra Clare has a unique ability, her writing can heal and stab your poor heart.\n\n“The boy never cried again, and he never forgot what he'd learned: that to love is to destroy, and that to be loved is to be the one destroyed.”\n\nI need to warn you about Jace. He is the kind of bad boy who makes rude gestures to nuns and loves weapons and treats everything like a joke and is a total badass. You will fall in love with him and swoon and want to have his babies but you're in for disappointment. Because he is mine.So that's the general awesomeness of the Mortal Instruments.Instagram | Twitter | Facebook | BookNest"}, {"Review": "I was never expecting anything from this but an entertaining and maybe a little bit forgettable book. I was wrong; I found this completely unforgettable. For being a trainwreck.To be quite honest, I think 75% of the hype for this series comes from nostalgia. Listen, I'm sorry, I know this isn't everything, but I really... don't get why these first three books are hyped, on any level. Not only do I have ten million problems with the tropey nature and the slutshaming and the etc etc etc, it's also just... boring and also, I hate every single character. I hated... almost everything about this, until book three, which I thought was okay because it didn't take me four months [you think I'm kidding?] and also for ending the incest plotline. [Yeah, that.]Listen, I am not opposed to fun trash. I read The Infernal Devices this year and it was fantastic, and books two and three basically emotionally killed me inside. But this was not fun for me. Okay, so first of all, because we've all talked about this, The Mortal Instruments is kind of based off Cassandra Clare’s Harry Potter fanfiction [no, I'm not kidding], and it is painfully obvious. There are basic things, like that humans are known as “mundanes,” while in Harry Potter they are known as “muggles.” But then there's also the fact that the characters kind of feel like not good fanfiction interpretations of various Harry Potter characters. Our redheaded lead character, Clary Fray, is a slightly stupider version of Ginny Weasley. Her love interest, Jace Wayland, is essentially Draco Malfoy if everyone excused his actions because he’s super hot. [I really don't like Jace.] Jace becomes a member of the Ripoff Death Eaters in like book two because his father is Ripoff Voldemort [his name is Valentine. which is actually hilarious]. Simon is... Harry [again, not a very good one], and Isabelle is Hermione, if Hermione were there exclusively to be slut-shamed by the angelic virgin protagonist. I mostly said this to point out how utterly fucking dull these characters are, but... listen, I'm not actually wrong about this. If you match the characters up to her fanfiction [which is not hard], the pairings fit. You know that thing I linked up above? Well, it discusses how the fanfiction trilogy [I mean, kudos for that dedication] is endgame Draco/Ginny and Harry/Hermione, with subtext between Harry/Draco [I'm so sorry, I'm laughing typing this]. The endgame of this series is Jace/Clary and Simon/Isabelle, with subtext between Jace/Simon. Do. you. think. I'm. kidding. But listen, you'd think that after ripping from fucking Harry Potter, Clare would’ve at least come up with something interesting? I mean, fiction doesn't have to be original to be good. But again, it's basically boring, boring, boring, offensive, boring, jace is hot chapter, boring. I... don't even know where I'm going with this, I just need you all to know that this originated as Harry Potter fanfiction. Although I will point out that the original fanfiction this was based off of got taken off fanfiction.net after plagiarism accusations. And then there were Sherrilyn Kenyon's plagiarism accusations. I mean, I think fanfiction and original fiction used to be considered very different things in a way they almost aren't today, but... it's important to know.Anyway. I've established at this point that the characters are flat, it's all painfully derivative, and the books themselves are... boring. But... there is so much more.Beyond the issue of Clary's I'm-not-like-other-girls thing, there's also the issue of messily handled lgbtq stuff. So, yes, it's 2005, and I'm willing to excuse this... a little bit Alec Lightwood's entire presence in this book is to Create Some Angst through homophobia and it feels... so much like a plot device, not going to lie. While it's fair to mention that Cassandra Clare has improved her lgbtq rep - severalsapphic friends of mine would like to notify you that The Dark Artifices is awesome wrt this - it's not good in this series. Alec is barely a POV character in the first three books of the series, despite being marketed as a major character, and feels super tokenistic. Also, just... his treatment. At one point in this series, his mother, who is a supposedly likeable character, tries to kill him and his boyfriend for being gay, which he forgives her for [how?]. There is later on a lot of explicit biphobia towards Magnus [who is my favorite. I love Magnus] that is not subverted or criticized at all, and in this book especially, there's an intonation of that slutty bi trope [though the character is allowed to develop beyond that, man, it is there.]\n“You're not gay, are you?\"Simon's greenish color deepened. \"If I were, I would dress better.”\nthis... is... not... funny...No, Cassandra Clare would rather focus on something else: a sideplot where Ripoff Ginny Weasley believes Hot Draco Malfoy is her brother for two fucking books. It is exactly as terrible as it sounds. For two full books, I had to live through Ripoff Ginny Weasley’s angst over her crush on her brother and about their forbidden love or whatever the shit. Yes, I KNOW (view spoiler)[they eventually realize they weren't related. But here's the thing; they're still in love when they believe they are. (hide spoiler)]They almost have sex while still believing they're related [book three]. That's not even the weirdest part; they do it in Voldemort Except Boring’s home, right after they almost physically die, and it's wild. Do you know how many hours I spent trying to wash my eyes out after reading this? Why, exactly, is sex between two people who literally think they are siblings an enjoyable thing to read about? The focus on Draco Malfoy’s bare chest was bad enough; I don’t need to think about incest sex too. Oh, and there are so many constant descriptions of Jace’s utter maleness. It honestly feels like an entire book jacking off to the thought of Draco Malfoy’s bare chest. It's not good. I don't know. I guess not everything is bad? The worldbuilding was possibly something cool ten years ago, but it's pretty typical nowadays. I'll also give Clare a bit of credit - she's pretty great at writing dialogue. The moments where the characters are chatting or hanging out in squad dynamics are a lot of fun. But overall... no. It's full of tropes, there aren't really any plot twists, and it's honestly just boring. I'm sorry, I really don't understand the hype. Like, come on, besides being an example of all the worst bits of YA literature, from the underdeveloped characters to the lackluster worldbuilding, this first book truly takes the cake as one of the worst I've ever read. Oh, and I'm just going to say it: Jace and Simon have huge crushes on each other. I am NOT giving up this opinion. I don't really give a shit about either of them or care about this relationship, I'm just saying that factually, they talk about each other like they want to have wild sex. I'm ALSO saying that the ending scene of book two reads like shitty vampire smut. I'm picturing it on fanfiction.net with the description m/m blood drinking kink erotica don't like don't read!!!VERDICT: This book is terrible. I'm somewhat shocked to say that it gets a little better later on, but this one is objectively terrible. Maybe just skip to book two if you genuinely want to read the series [listen, I like The Infernal Devices]. Or skim. Please just skim. Blog | Goodreads | Twitter | Instagram | Youtube"}, {"Review": "Pure and utter crap. I wish there were ways to give negative stars. I certainly want the time from my life back. I would compare its writing quality to a fanzine, except that comparison wouldn't be fair to fanzines. But I swear to God, it took every single bad fanfic writing cliche and published them. What were her publishers thinking??? Where was her editor?? It was horrible. I would dearly love for a fanfiction author to make good and become a published writer, but I'd prefer one with talent, thanks. "}, {"Review": "I can totally see why everyone rants and raves over these books; while I'm only one deep (so far) and hoping to read City of Ashes in the very near future, I feel this is the type of book that teenage Chelsea would have flipped her turds for back in the day. I'm just glad I can still enjoy them now.  While very teen oriented, City of Bones still had a classic feel that surpassed barriers of age and gender, and I have heard from many folks that they wish they had found these books while they were still a young, gay teen, as this book was before it's time in it's courageous attempt to feature a homosexual couple before it was popular to do so. I was completely sucked into the action, drama, and mysterious intrigue that sweeps over the reader from the first page; I couldn't tell if I should be embarrassed to be so obsessed with such a cliche, teenage read, but honestly I don't care. I AM HERE FOR ALL THE TMI LOVE AND AM PROUD OF IT.I unfortunately accidentally stumbled across the movie before picking up these books, so there are a few spoilers I already knew about before starting the books since the movie pulled a bit from the first 2-3 books? I think? I actually like going into beloved, hyped up series knowing some of the big things before reading them for myself; I found I can enjoy it more if the stress of knowing who to ship is already handled for me so I don't invest in the wrong coupling (view spoiler)[(I'm looking at you Chaol and Celaena) (hide spoiler)]. Obviously this series features all types of supernatural creatures, but I like how Clare gave a feel of placing multiple religious/mythical/world views into a giant mashup that became her own. It was very clever and ballsy and I love it. There's not really much I can say here that hasn't already been said thousands of times over the past decade, but I'm so glad I've officially experienced my first Cassandra Clare novel and I can't wait to continue on. I know there's some dissension among which order to read in, but I've decided on reading them: 1-3 TMI, 1-3 TID, 4-6 TMI, then follow with TDA series. Wish me luck; I have a lot of catching up to do! ;) Side note- I somehow scored a like new used set of all the books (except TDA) and they all are these gorgeous Australian paperbacks. That is all."}, {"Review": "\n“You're an idiot.\"\"I've never claimed to be otherwise.”\nClary Fray goes to one little party with her best friend (Simon)...and there's a teeny-tiny littler repercussion by way of her life being absolutely and irrevocably ruined. She witnesses an unusual boy being led to the back by figures cloaked in black, brandishing knives. Curious, she decides to investigate...and stumbles upon an exorcism.The Shadowhunters are just as surprised as she is - mostly because the only people who can see Shadowhunters are other Shadowhunters...but Clary is 100% human, a mundane...or so she thought.Almost immediately,  Clary's mother goes missing and the Shadowhunters appear to be the only ones who can help her. And so, with much trepedation (and sass) she forces herself into their world...and discovers there's quite a few things she's never thought were possible.Okay, I really, really enjoyed this one....until we got to the twist at the end. Ugh. I absolutely \nloved\n the banter. Any and all scenes with Jace in it just shone so brightly. I mean, how could you not love scenes with lines like this: \n“Have you fallen in love with the wrong person yet?\"Jace said, \"Unfortunately, Lady of the Haven, my one true love remains myself.\"\nOr this?\n“Is this the part where you start tearing off strips of your shirt to bind my wounds?\"\"If you wanted me to rip my clothes off, you should have just asked.” \nOR THIS? \n“Investigation?\" Isabelle laughed. \"Now we're detectives? Maybe we should all have code names.\"\"Good idea,\" said Jace. \"I shall be Baron Hotschaft Von Hugenstein.” \nHowever...the ending? Very nearly ruined the book! (view spoiler)[ Where we find out that Jace might be Clary's long-dead-brother? It's just...are you kidding me?PLEASE tell me that surprise-incest is not going to be the new, edgy YA trope. I don't think I handle all of the gagging.AND how in the world do you still kinda sorta like your maybe-brother?Maybe it's just me but wouldn't any and all attraction be immediately snuffed out? (hide spoiler)]Four stars because I have a very selective memory she eye top-notch banter.Audiobook CommentsThe reader was fabulous through and through!Blog | Instagram | Twitter"}, {"Review": "I originally took down my review because I wanted to re-write a new one in order to make a point, but being my usual absent minded self I promptly forgot that point and so a half-written review has been sitting on my hard-drive for Hera knows how long, while people look at the [[review coming soon]] note and think...sure that'll happen. So I decided on this cool August day that I am going to re-write this damn review and get it over with.Cassandra Clare was a writer with a history that I was mostly unfamiliar with because being the sheltered little angel I am, I did not have access to the fandom when all the drama went down. However, the internet never forgets so I found about it after the fact. That and a blurb by Stephenie Meyer kept me from seeking out the series, until a friend of mine gave me Clare's spin-off series, Clockwork Angel and I honestly enjoyed it. So when it came a time for me to read City of Bones I was excited honestly. No one can say I didn't go into that book with an open mind. And in return for that, it tried to melt my brain.All City of Bones managed to be was a messy accumulation of popular stories that were great in their original form, but were blended together into a low-fat, low-carb pop-culture smoothie that is as uncreative as it is long. We get treated to a book with complete character development stasis despite being nearly five hundred pages long.When our insipid protagonist, Clary discovers, after meeting a group of mysterious strangers, that there is a whole world of monsters and fae that she was previous unaware of. On top of that an evil Voldemort-like villain called, Valentine, has kidnapped her mother. Oh the drama.Clary commits the cardinal sin on any protagonist: she is stupid. Every action she takes, from the very beginning, is done to show us what a \"brave person she is\" but only serves to inform us that she can not actually use her brain. During the first chapter or so, she comes across a group of people (the Shadow Hunters) interrogating a \"Downworlder\" and she thinks that they may be a gang. Instead of going back inside to get help or calling 911, waiting for her friend to bring help or at the very least staying quiet to ensure her own safety she tried to be a hero. \"Isn't that a good thing?\" You may ask. No, it is a stupid thing to do for many reasons. The main one being they have weapons and she does not. What can she do? If she were to get involved would it actually save that guy's life? If they had actually been a gang she would have been killed, to ensure a lack of witnesses and there would be no chance at ID-ing the perpetrators later on. Thankfully, it's not an actual gang and the Shadow Hunters are so not a problem that Clary can talk with them for a while before they decided to leave. To quote a member from That Guy With the Glasses \"They're the best!\"Thankfully for Clary she is not the worst character in this series, that privilege falls onto Jace, who is the oh-so-Byronic male love interest with daddy issues and a patronizing attitude that Clary just can not resist. He is from beginning to end an asshole and there is no nicer way to put it. He is an ass. He treats Clary like a child (which while understandable is not fun to watch when that makes her fall for him) and had everyone eating out of his hand.As they participate in this journey Clary takes these discoveries of the supernatural with a causal nod and unrealistic clarity, partly because her love interest, Jace, is her mystical estrogen bait-guide. Both Jace and Clary qualify as our protagonists, even though the story is told following Clary’s events. They are both pretty shallow characters, and upon further analysis are seen to be completely stagnant despite the many things that happen to them throughout the book and things technically do happen. Clary is plunged into a world where there is pretty much a war going on between the Downworlders and the Shadow Hunters. Information is thrown at her from all corners, including the fact that her memories have been erased since the age of two and Clary handles it with the equivalent of a shoulder shrug. There are brief moments of anger and outrage, but they fade unfathomably quickly. She never grows as a character and despite this book being the first of a trilogy I think it is fair to expect your lead protagonist to at least evolve a wee bit they discover the things that Clary does.Oh wait...WAIT! Silly me, I am forgetting something. Clary does grow in one respect! She becomes more of a judgey, pretentious, know-it-all. Clary judges everyone and everything she deems not up to snuff. Mainly Izzy who has the nerve to be beautiful and dress in an attractive manner. I mean the jolly-g, what nerve! And the fact that she and her brother come from money. Gasp. Two attractive women can not be in the same story and actually be friends without one treating the other like the anti-Christ after all. The comments on class might have been more effective if Clary did not grow up in one of the best areas in NYC. I have no problem rooting for privileged people with corny problems, I watch Gilmore Girls. That is at least better than a character like Clary who has her nose up in the air and looks down on everyone and yet tries to make out as if she is so humble. The way she treats her family friend once she finds out he's a werewolf--calling him a dirty Downworlder--I just wanted to smack her. Who does she think she is?Okay I have to stop talking about Clary.\nIn terms of just writing it is just very fluffy and silly with metaphors which do not really add anything to the story. Mainly because they are awkward and do not sound anywhere as deep as they are supposed to when read aloud. The Star Wars plot twist was just irritating to read and even thinking about it makes me want to bang my head.City of Bones is just everything that annoys me about young adult literature. It is not creative and is not fun to read, which is a shame because there is potential in it. When she re-wrote it in Clockwork Angel I thought the story was much better, but then again it had Jem who is delicious and fantastic. In fact you know what, just read that series instead. If it wasn't for me not wanting to invest any more money into Clare or wanting to spend any more time with her work I might still be reading it.Now back into my dungeon.\n"}, {"Review": "2.6/5 Stars ⭐️ ⭐️ ⭐️“Sarcasm is the last refuge of the imaginatively bankrupt.”This book didn't leave a good taste in my mouth. Basically, it left no taste in my mouth. Or if it left a taste, it was like water taste. It didn't exist. But let's talk a bit about my history with the Shadowhunter world. But first the plot in italics cause we're classy as fuck.When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder― much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is nothing―not even a smear of blood―to show that a boy has died. Or was he a boy?This is Clary's first meeting with the Shadowhunters, warriors dedicated to ridding the earth of demons. It's also her first encounter with Jace, a Shadowhunter who looks a little like an angel and acts a lot like a jerk. Within twenty-four hours Clary is pulled into Jace's world with a vengeance, when her mother disappears and Clary herself is attacked by a demon. But why would demons be interested in ordinary mundanes like Clary and her mother? And how did Clary suddenly get the Sight? The Shadowhunters would like to know... This is the first Cassandra Clare book I have ever read. You would think I knew nothing of this world before and I just starting delving to it now. And you would be wrong. Many years ago the film \"City of Bones\" with Lily Collins was the shit. Everyone was watching it and I watched it too. I didn't like it. It didn't feel special to me. After that the show \"Shadowhunters\" started. I started watching it because of a dear friend who is obsessed with it. I watch more than 70 tv shows so it's hard for me to watch something that special. And that's the case here. It wasn't anything special. But I liked it a lot and I loved the characters. Then, I joined the book community about a year ago. This book was everywhere. EVERYWHERE. So, as always, I joined the hype train and bought it. And now here we are. So, even though I have never read anything related to the Shadowhunter world, I knew about it a lot. And this is important to note here, I'm not just a new fan of everything. Let's start with what I liked. I enjoyed the banter and the humor in this book extremely much. Especially Jace's humor, I felt myself laughing out loud at times. The only moments this character was bearable. I also enjoyed the immersive world. The author created a very unique and beautiful but also gloomy world that is rich and full and has a huge history behind it. Many details about it bored me to death 💀 but it was exciting nonetheless. And now the juicy shit. What I didn't like.This book felt so childish, juvenile and immature to me. Even when the plot was getting serious, I just wanted to laugh. It started off better but after the whole Simon-rat-vampires-werewolves-fucking-motorcycles-that-fucking-fly shit, it went downhill for me. I couldn't take ANYTHING that was happening seriously! I mean come on, they wasted 50 pages on the Simon-rat situation, which was ridiculous, and another 10 pages on what ride they would get to get to Clary's house! I mean come on man! I hated Clary's perspective. I hated her insecurity, her hatred towards Izzy was unreasonable. You don't hate on someone just because they're prettier than you. Or because you think they are. She didn't even give her a chance at the beginning. Basically, the reason I think the book seemed childish to me was that we were seeing things from Clary's POV. The writing also didn't help the case, but Clary is a very immature character. HOW DID THIS AUTHOR SUCCEED IN MAKING EVERY SINGLE CHARACTER IN THIS BOOK UNLIKABLE??? (except Simon, SIMON ILY YOU HAVE ALWAYS BEEN MY FAVORITE). Characters like Izzy, Magnus and Alec, who have been my favorites for years because of the tv show, felt so distasteful to me! Imagine if I didn't know the characters from before. I would hated the guts out of them. Clary and Jace weren't a surprise to me. I didn't even like them from the show. I don't think I will ever like these two characters. They have been on my black list for years. And it's a pity because we see things from Clary's eyes. A damn pity.To sum it all up, I didn't enjoy this book. I wanted to, I wanted to add a new favorite series to my collection but it didn't happen. My dick was hard for this book series and it fell down real fast. I'm sorry, don't hate me. I think the show has done a better job with adapting this series. I know it's not the source material and it isn't that good but I prefer it. I will continue to read this series because I have heard the writing gets better, but it won't be a priority. So many books to read, so little time. Anyway... until the next one KBYE!!!"}, {"Review": "\n\n“Where there is love, there is often also hate. They can exist side by side.”\n\nHi, my name is Melanie, and I’m the last person on this planet to read anything by Cassie Clare! But I had too many best friends who promised me that reading this series would be worth it for me to finally get to Lady Midnight! Well, the other night I did an Instagram poll, because I wanted something fae and I was just going to pick up Lady Midnight, without reading any of Cassie’s other work, and some of my friends lost their shit, to put it lightly. And this is the story of how I got roped into finally reading City of Bones in 2018.Again, I’m the last person to read this, but City of Bones starts off with a young girl named Clary, and her and her friend, Simon, are in line for a teen club. Yeah, the two-thousand vibes were real. Once inside the club, a couple individuals catch her eye and she can’t resist following them out of the club, to only realize that she isn’t supposed to be able to see them in the first place. We are then thrown into the paranormal world that is hidden from the mundanes (non-magical humans). We see vampires, werewolves, fae *swoons forever*, angels, demons, and everything else you think of when you think paranormal. And we also are introduced to the world of shadowhunters, the warriors who are sworn to defeat the demons. And Clary’s world gets turned upside down when she realizes that her mother has been doing everything in her power to keep her hidden from this paranormal world. And Clary can’t even ask her for the truth, because her mother has gone missing. And the only people who can help her are the shadowhunters. *dun dun dun*\n\n“Keep in mind that when your mother fled from the Shadow World, it wasn’t the monsters she was hiding from. Not the warlocks, the wolf-men, the Fair Folk, not even the demons themselves. It was them. It was the Shadowhunters.”\n\nBack when this series came out, everyone was saying it was “Harry Potter fanfic” and my pretentious, Harry Potter obsessed self wasn’t going to read anything that was a rip off of my fandom. And were a few of the similarities there? Yeah, I mean, this is a story that centers around three brothers with three magical items that a certain villain wants, who has been presumed dead for a while now. The parallels (and names, I guess) between Valentine and Voldemort are very apparent, especially their desire for wanting magic blood to be pure. But besides this big aspect, I really couldn’t easily see any other Harry Potter elements.But you know what else? City of Bones holds up decently well in 2018. I was a little thrown off that it is told in third person, but I actually think it has aged pretty well. I am always so desperately scared to go back and read my high school favorites, because I doubt they will hold up and have the same magic they did back in the mid two-thousands. This this was a good read, and it was funny, and touched on a lot of things that are super relevant and “cool” today. And I was honestly impressed that Cassandra Clare wasn’t scared to write in LGBTQIAP+ characters in 2007. I was surprised that we got confirmation for two characters, without it ever feeling manipulative or even drawn out. And she even touches on homophobia and how differently a character would be treated if their colleagues knew he was gay. I mean, this is pretty impressive for 2007, and it wasn’t lost on me. I will say the end there was a villain that maybe did the things he did because of his love for another man that I wish wasn’t in the book, but it didn’t erase the good Cassie did with the other two characters. \n\n“The meek may inherit the earth, but at the moment it belongs to the conceited. Like me.”\n\nThis book also surprisingly made me laugh. Jace is like the most sarcastic character ever, and he actually had me laughing in so many scenes. And I loved seeing the mystery unfold right alongside Clary. Magnus was everything, I wanted so much more of him instantly. But I ended up thinking that Luke and his backstory stole the spotlight. I wasn’t prepared for those feelings. And this book had a huge cast of characters, so I’m very curious about how I’ll feel about all of them as the series progresses. Quick sentence about how the characters made me feel: ➽ \nClary\n - super likeable.➽ \nJace\n - half love and half hate (and still side eyeing you all, maybe). ➽ \nSimon\n - so annoying, please, no one give this boy a certain cup.➽ \nIsabelle\n - marry me this instant.➽ \nAlec\n - I feel neutral but hope to end up liking more.➽ \nMagnus\n - going to be the best character in literature. ➽ \nLuke\n - the star of this book for me. ➽ \nHodge\n - super good surprise. ➽ \nValentine\n - needs to get bent. \n\n“You want to know what it’s like when your parents are good churchgoing folk and you happen to be born with the devil’s mark?”\n\nOverall, I went into this with the lowest of expectations. Like, picture the lowest expectations that a human can have. Okay, now, mine were lower than even that. So maybe that’s why I got so much enjoyment out of this story. But I honestly did have a lot of fun with this, and it made me very curious to pick up the next book (hopefully soon)! Also, I have been very blessed to not be spoiled for anything in this series, the only thing I always hear was, “CLARY AND JACE!” Which is why I’m side-eyeing each one of you if the ending of this book is true. Like, you all nasty. Blog | Instagram | Twitter | Tumblr | Youtube | Twitch"}, {"Review": "3 StarsReviewing this is weird-- because I used to love it. When I was about 13, I remember finding this library book, taking it home and reading all 400+ pages  in one sitting. Then I went back the next day and grabbed the next two books, devoured them, thought that was the end and (mostly) forgot about it. (Until that awful movie came out a few years ago)So reading it now, as an early-twentysomething with a lot more reading and life experience, I knew the initial love wouldn’t be there. I had a lot of problems with this. But I still couldn’t hate it. In fact, I can see why mini-me adored it. This is a really fun story. The world is exciting with a large cast of (mostly) interesting characters.  As Clary is inducted into the Shadowhunter World, we feel pulled along with her.  The world is mysterious and sexy and complex (looking at you: numerous spinoffs).In that same vein, this introduces a slew of compelling side characters. (Aka, Alec, Magnus and Isabelle are my baes.) While the main character is frustrating (see next paragraph) the side characters are all really interesting! None are particularly well-developed here, but there are interesting dynamics at play-- the glamorous warlock who’s had enough of this Shadowhunter shit, the gorgeous huntress whose greatest priority is protecting her family, and the angsty, logical parabati scared to be who he is. Their stories are all really interesting, and I’m really excited to see their development again. But back to problem #1: the bland, frustrating, quasi-misogynist that is Clarissa Fray. I understand she serves as our introduction to the Shadowhunter world, so that’s where her story starts-- but there’s nothing else to her. Outside of asking questions about this world, she seems to have no personality, no aspirations, and nothing outside of basic “oh-gee-golly-wow” reactions. Then, once the initial shock of “demon-hunters-oh-my” wears off, it seems like Miss Clare tried to give Clary some sort of sassy! and strong! personality-- AND FAILED HARD. Instead, Clary comes across as a patronizing bully.  She blames others for everything even though she very rarely knows what the hell is going on. She slaps her love interest twice for not agreeing with his actions-- and granted, I understand why they were fighting, but it comes across like the only way Clary can defend her position is physical violence. Which she has no personality, so maybe it’s true. (screw it, this rant gets more than one paragraph. #DEALWITHIT)Clary has this god-awful self-loathing complex, I think. Because she’s utterly dripping with I’m-not-like-other-girls-so-lets-hate-all-other-girls which is some bullshit. My favorite example of this is when Isabelle dares to wear vanilla perfume of all things, and Clary has this whole internal rant about “girls who wear vanilla perfume” and how she just can’t fathom “why they want to smell like cupcakes.” She then judges their ‘daintiness,’ which is ridiculous because we all know Isabelle could kick every-square-inch of Clary’s ass. There’s more examples of this, including with female characters Clary doesn’t even know. It’s like she has absolutely no self-respect and the only way she feels good about herself is dragging down other women. Excuse me, it’s 2017 and I’m tired of this bullshit. (Also I wear vanilla perfume and I smell like a fucking delicious cupcake, thank you)There’s also some plot points that just seem a little cheesy/underdeveloped to me, including: - how fast the romance goes from uneasy distrust to love- the pointless love-triangle- the way Jace is so easily swayed from one side to another- the ex-machina of werewolves- the way no one uses their steele’s half the time- the way the steeles can do anything, except for when it’s actually useful.(Also ‘mundane/mundie’ is wayyyy too similar to ‘muggle’ for my taste. )Overall:Idk man. Nostalgia says 5 stars, but the rest of me knows better."}, {"Review": "I didn't always love The Mortal Instruments.In fact, the first time I read it, I found it quite immature and annoying. If I’m not mistaken, I read it for the first time three years ago, just before the release of the execrable movie. Well, 1) you need to know that, at that time, I wasn’t reading English books just yet (that came a couple of months later) and 2) some of the French editions look horrible (view spoiler)[ (hide spoiler)] and those are the ones my library owned. So every time I was seeking a good fantasy book and my eyes would lay on the-awful-French-editions, I would make a weird face and move on. But I gave in, because I’m the type of person who likes reading books that were made into movies and analyse what makes those books so special to bring them to the big screen. Therefore I read the first and second book, but I never got around to finishing the latter. I had fifty pages left but was obliged to return my books to the library. I didn’t even feel bad about not finishing the sequel… I enjoyed the fast-pacing, but I was expecting more intensity and seriousness from the characters. I didn’t care about the witty dialogs and jokes, I wanted KICKASS. EIGHT MONTHS LATER.I was on Goodreads looking for something good to read, when I stumbled across CAPTIVE PRINCE. I know what you’re going to say, ‘‘Why do you always have to bring that series up, can’t you just leave it alone for a review?!’’ But the truth is, Captive Prince is one of the main reasons why I decided to re-read The Mortal Instruments. So as I was saying, I found CP and then looked up the definition of M/M romance, because I had no idea what it was or what it was standing for. When I learned what it meant, I was curious and decided to give it a shot.BEST DECISION EVER. Not only did it make me want to read more M/M romance books, but it also made me want to pay more attention to Alec and Magnus! When I first read the book, and I learned that Alec was gay, I was surprised for a second but didn’t have any other reaction. As I was saying, that changed after I finished CP and I started making reviews on here. I started seeing so many reviews of TMI and following Cassandra Clare on Twitter and looking at fan art of Alec and Magnus and the other characters and I started developing an attachment to the characters through all that. So when I decided to re-read the books, I paid attention to every.single.detail and expected the jokes that take way from the seriousness… I even came to anticipate them. And, of course, the parts with Alec and Magnus melted my heart…So that was my story of how I fell in love with The Mortal Instruments. It wasn’t insta-love and that’s okay.__________________________________OLD CHEAP REVIEW:UPDATE: The re-reading was even better than the first read!OMG! I wasn't sure about this series at first because I thought the brother thing was disturbing, especially because I have one so it felt a bit too personal. But...I heard that everything eventually works out so I felt relieved and I started to enjoy this book more. Wow, I'm truly amazed! It's well written, every single action is fluently discribed and interesting, every character has something that makes them unique and likeable and oh my goddness I'm totally in love with Alec & Magnus!! I only want more, more, and more of The Mortal Instruments!!MALEC!"}, {"Review": "I think this book is has some kind of mental disability. I kind of don’t want to make fun of it because, you know, it’s not playing the game with a full deck of cards. But, at the same time, it does not have such a significant learning disability that it needs to sit in a separate classroom from the other stories; it just has this confluence of creepiness and then some kind of mild mental challenge. So, I kind of do want to make fun of it because, you know, you probably don't have to be this uncomfortable to be around, book. It's a tough call. There was this guy in my high school graduating class like that. I’m going to tell you about him in this review. I really, honestly apologize ahead of time if I offend anyone here. I especially apologize to Cassandra Clare, who I see is a GR author. I'm not meaning to disparage anyone who has a learning disability, and I have great respect for people who share their writing with others. And I'm not equating learning disabilities with mental illness or with being creepy, just to be clear. I just knew a boy who happened to have a learning disability and be creepy, and he reminds me of this book. Also, this isn't to say that people shouldn't read The City of Bones. You actually should read it, maybe, and play the really fun game, Where Did the Mangled Body Part Come From?Anyway, back to my story. For purposes of this illustration, I'm going to call the creepy high school boy David Caruso (any resemblance of that name to the name of a real person, living or dead, is purely coincidental, of course). I felt bad for David because he was so picked-on, so I tried to be nice to him. One day, he started leaving notes in my locker on notebook paper in a child’s scrawl, asking things like, “If I’m sad, can I have a hug?” He found out where all of my classes were and would be waiting outside them when the bell rang. He lived about a block away from me, so he would walk home with me from school sometimes. After the hug note, we had a serious talk about boundaries. That night, I had to take a makeup Chemistry test, which lasted about an hour. It was pouring outside, and he waited in the rain for me, standing under a tree. When I finally left, he followed me home, walking about ten feet behind me the entire way. As I was turning to the road that led directly to my house, David desperately cried out something like, “Why don’t you love me?!!!” This was a relatively common experience with him. There was another girl he was following around for a while around that same time, and he went down on his knees outside of the cafeteria, saying something similar. She got a restraining order against him. I’m not saying that I believe in originality, because I don’t, but The City of Bones made me realize that there is a line somewhere, where the flow of literary inspiration and use of traditional themes can turn into a Single White Female incident. Rather than being a fun re-imagining of Star Wars, this story was a haphazardly sewn together pop-culture Frankenstein. Eeeet’s ALIVE!!! Basically, the characters from The Gilmore Girls hook up with non-vampy, but still campy, versions of the characters from Twilight, and re-enact Star Wars. Seriously, there is a Luke Danes character, and his name in this story is still Luke. And, it turns out, it is very possible to make the Luke and Leia Skywalker relationship grosser. I'm not sure why you would want to . . . Also, I feel like there are a bunch of other stories that The City of Bones is stalking, and it seems like some other reviews list them, but I forget what they are right now. My point is that this book has killed them and is walking around wearing their skin.The other weird thing is that I’m pretty sure there’s a misquote from Star Wars in here. Isn’t Han Solo the one who says, “I know”? This book says that Leia says it. And I don’t mean that the Leia/Rory character in here says, “I know” while re-enacting the Star Wars storyline. I mean the book literally says that Leia says, “I know.” If you’re going to SWF a story, at least get it right. Better yet, don’t SWF a story because that’s creepy.I listened to half of this book on audio, driving to and from a wedding, then I read the rest on the page. Neither were good. Reading on the page is a little better because you can skip the boring parts. I’m not going to lie, though. It was actually a great experience. It was completely refreshing to read something awful. I thoroughly enjoyed it. I’m not sure why, but it renewed my hope for writing. Still, all you young stories out there, if a stranger story with shifty eyes comes up to you and asks for a hug, it’s okay to say no. Set some personal boundaries, or you might end up the victim of this kind of literary massacre. I hate to be a fear-monger, and use your own judgment, but be smart. Some of these stories obviously waited too long to take out their restraining orders."}, {"Review": "Really, there's nothing very original, or satisfying in the book. She borrowed so heavily from Buffy, Harry Potter, and Star Wars that it sticks out like a sore thumb. It reads like altered fan fiction. And I love fan fiction, make no mistake, but it's not attempting to make a buck off someone else's world, either. Which is essentially what the book is. Cobbled fan fiction that has no cohesion.I knew Clare as Cassandra Claire from Harry Potter fandom, I will admit, and that did color somewhat. But no matter the reputation, my review still stands. The blatant borrowing and cobbling jarred me from the story multiple times. As I said in another review, \"most likely would have still come to the same conclusions, due to the heavy-handed writing and knowing some of the more obvious media nods.\"For instance, the Silent Brothers kept reminding me of the Bringers in season seven of Buffy, the Vampire Slayer and the Dementors in Harry Potter mixed with a little bit of monks and made goodish. Yeah. Very hard to take them seriously. And people have repeatedly mentioned Sirius's flying motorcycle, which has been labeled a \"demon motorcycle.\" That kinda reminded me of Anne Bishop's book Sebastian, which I put down to read City of Bones, because of the fact she has motorcycles that are run by demons, not for them. But still, it's obviously not something original, even though it plays a fairly important role in several scenes.\"I truly am glad I obtained the copy from the library and not purchased. I would have been irate over the 14 dollars that I would have lost. It did not inspire me to read the other two in the series. After all, I didn't spend money, so I would have been more willing to read the book. Now? Not a chance in Hades, even if it were frozen over with pink slushie."}, {"Review": "I've actually been meaning to write a review about this book, and because I watched the film only recently, I thought why not write a review about it now. I received the first 4 books from my sister but I never got around to reading either of them. I remember reading City of Bones, but I think I stopped midway because I realized that a movie had been made of it, so I watched the film instead. City of Bones is about a teenage girl called Clary Fray who lives with her mother in Brooklyn. Clary discovers that the world she lives in is not as simple as she thinks it is when she witnesses the murder of a demon at a club.Clary's life is turned upside down when her mother is kidnapped and when she starts seeing strange creatures around her. This book focuses on her research for her true identity and also on her feeling towards Jace.City of Bones also contains numerous themes and it focuses on matters regarding discrimination based on race and sexual orientation.When I watched the film for the first time, I was more drawn to the actors than the actual film. Jamie Campbell Bower who plays Jace had me staring at him the whole time. He played King Arthur in the TV series Camelot which I fricking loved! I was so obsessed with that series, and when the series was cancelled, I was actually heartbroken. It's hard finding a good TV show that keeps you engaged. Another actor who kept me distracted from the film was Robert Sheehan who plays Simon. It was hard seeing him play such a geeky likable character because I used to watch Misfits which Robert acted in, and seeing him in this film was really weird. When I get time because my reading time is very limited as a writer, I'll probably pick up this book again someday because this series has had really good reviews, but saying that from what I remember reading this book for the first time, it just wasn't for me. I wasn't captivated from the first page, and for me that first page determines if that book will be read or not. "}, {"Review": "*Spoilers yeah*I’m going to say this now so it’s out of the way.No.I’ve never read the Draco Trilogy by Cassandra Claire on fanfiction.net.No.I have no right to mention the plagiarism event around the Draco Trilogy in this review, because I have not read it, and so I will not go into the plagiarism event.Yes.I know of the plagiarism, and I find it despicable, but I’m not reviewing that, I’m reviewing City of Bones.THE CITY OF BONES REREAD WITH PALICE AND GHIRARDELLIIt started EPIC, then tapered to a molasses read but who really cares. It’s done now and that’s that! But onto MY review!THE REVIEW STARRING GHIRARDELLI CHOCOLATEThaaaaaaat’s ME!BACKSTORY. When I first spotted City of Bones, I saw the cover and thought, “Hmm...interesting designs. Kinda weird, but I rather like it...” Drew me in, so I read the blurb, said, “Lol kay” and purchased it. What I remember after that first read was Clary, Jace, Alec, Isabelle, Abbadon, the Star Wars copycat sibling scene, and Jocelyn still being in a coma. Of all those things, Momma Fray still being in a coma pissed me off the most, and I dropped the series because of that alone.Fast forward to Ghirardelli present day with more of a brain. Now I got a sense of plot, character arc/development, themes, literary devices, and a fresh love for reading. Now, with this knowledge, City of Bones angers me even further without Momma Fray’s limp body.Le blurb:Clarissa, or Clary Fray (Clare...Clary...*sigh*) is a 15 year-old girl who is somehow allowed into a club and meets a bunch of Shadowhunters who kill a demon party goer. They’re like, “SHOOT SHE KNOWS” and she goes off on an adventure after she finds her apartment totaled by a Ravener demon thang and her mother not where she last left her.Aww yeah here we go!The writing...The. Writing.THE WRITING.I cannot begin to fathom just WHAT is going on with this prose. I’ll admit that there are a few moments where the descriptions of certain areas are vivid and near perfectEx: When Clary finds Jace with Valentine. That gold room with the velvet curtains and all that. Woooow lovely image.Also, with Abbadon. Fuck guys, I don’t wanna get NEAR whatever that thing was. Yeesh, I’ll just hide in my bed thanks.But at the same time, with this descriptions, Clare likes to drop about a bajillion these on us:“Moonlight ran like silver water...”“...stinging and aching, like raw meat.”“The apple tasted green and cool.”“Leaving the Institute was like climbing into a wet, hot canvas bag.”“...pale gold pollen as light as talcum.”WHAT.NONE OF THOSE SIMILES EVEN MAKE SENSE.CLARE...Honestly, I’ve never seen so many similes in one book ever.EVER.This is literary technique abuse in its natural habitat. I honestly thought Twilight was bad with the thesaurus raping, but Clare is nearly there with all of these nonsensical similes! Yes, some of them indeed worked, but having this army of them got me out of the story so quickly by about the 20th one that I was groaning every time the words ‘like’ or ‘as if’ came up.This nonsense is an example of telling us someone’s reaction, rather than showing us. YOu know the whole SHOW, don’t TELL thing. There’s a moment where Jace’s tension is described as a downed electrical wire or something, but that doesn’t show me anything. It’s showing me the image of a live wire on some ground. Is Jace writhing on the ground in frustration or...? Whatever.I also felt...bored. Excluding Luke’s POV and Abbadon’s chapter, I just sat and twiddled my thumbs. Nothing was interesting to me. The Ravener battle seemed meh and the encounter with Valentine SUPER lulzy.I think it might’ve been because the POVs were switching so randomly at times. Even from page one, we have Clary scoping out the blue-haired kid, then we JUMP to his perspective and we’re forced to oblige. Here I thought we’d follow third person omniscient, which I have no quarrels with since I’m doing that myself, but the switching was so arbitrary and rapid that I was unsure if who I was reading. It may just be me, but I get so mind-boggled when I come across that. The whacked POV really threw me for a ride.All the POV switching didn’t help the plot much, nor was the plot much to begin with. Clare seems to take a nose dive into plot with Jocelyn’s disappearance. I’m ready to go, I’m all strapped in. Then, she just kinda lets Clary float about for a while. Go get some memories, go help Simon the rat, go into a conflict between two boyz, go fetch the Mortal Cup (which we have no idea what it is or DOES until Dorothea spells it out when we’re roughly 77% done the book).Even with the plot jumbled up like a thousand-piece jigsaw puzzle with forks and turns that made barely any sense, it was still there, and it was throughout the book and not shoved into the end. So by my standards, this book stands a little taller and prouder than others I’ve read. I’m not exaggerating that either. This book is worthy of its two stars.I feel like the second star is for the times where I just caught myself enjoying little bits like Abbadon and Luke’s infodump. I found the battle with Abbadon to be fairly kick-butt, an I actually didn’t mind Luke’s backstory stuff so much. I started to enjoy his character a little. Speaking of characters...CLARY CASSANDRA FRAYI will never not hate Clary.Clary is a cruel-hearted, whiny, and angry little girl. She contradicts herself and her own actions, she bad mouths every living soul around her, and for what? Is this supposed to make her a strurng female churuktur or something? Kicking ass and taking names because you open-handedly smack everyone around you? That’s just being mean and hateful. There is nothing appealing or likable about Clarissa Fray.She abandons her best friend, Simon, at a poetry slam to follow the boy she barely knows, then yells at Isabelle for abandoning Simon at Magnus’ party, then she even forgets that Simon drove her and the other Shadowhunters back to Dorothea’s. This is when Simon SAVES THEIR ASSES, too.I just can’t. Clary, you’re an idiot.JACE WHICH WAYLANDOur love interest, ladies and gentlemen. Tawny, tumbling gold locks, and gold eyes! Oh sweet lawd hold me!Jace is a major asshole. Simon calls him out on it. Clary does then APOLOGIZES FOR IT (HUH?), but I still would take him over Clary. Hell, with the backstory that Jace was getting, I wouldn’t have minded if this were told from his perspective. I bet it would’ve been a lot easier (somehow), not to mention far more interesting.I can still handle him. Like, I’m not wanting to strangle Jace like I am Clary. Jace was an ass, but he didn’t cross my line. He does have a tendency to be obnoxiously cheesy and loves to fail-snark the heck out of everything. Maybe I liked him more because his seraph blades were actually psychic-type Pokémon evolutions.Actually, this brings me to one point, what’s up with steles? They make runes, but they can’t when someone’s got demon blood in them. OKay that’s cool. They open certain doors, and start...vampire motorcycles? What can’t they do? Can they make me a chicken sandwich? These steles don’t seem to have much going for them, like Clare said, “LOOK AT WHAT I HAVE” then drops them off for bumblefuck reasoning. Their description?“It was a long, luminous cylinder, as thick around as an index finger and tapering to a point.”Come on, gotta keep your subtlety in check, Clare.Anywho, the only thing that made me want to gouge my eyes out were the similes and Clary Fray’s behavior. Other than that, everything was just okay. It wasn’t beautiful, fabulous, or pure genius. This is certainly not genius material. Stuff I write isn’t genius material either.But it also wasn’t the very worst thing I’ve ever read. Twilight, Halo, and Hush, Hush far exceed this book on stupidity, plot, and What-the-flying-fuck. It is a decent read, but that’s all I can really say about it.Read it if you want, go ahead.I just know that I don’t have to go back to this book again for any reason."}, {"Review": "So here’s the thing. I got rid of my copies of these books and The Infernal Devices series awhile back when I was having a clean out. The I enjoyed some of the newer books. Then one of my groups put up a challenge for the series. Then I decided to listen to them from the library. NOW, my thoughts have changed as they do on rereads sometimes. I love certain characters more so in the newer books but in this book I feel like I wasted precious time, AND time is precious people!! This went from 5 to 4 to 2 stars. We shall see if I want to continue the rereads as I did like some of the later books. Enjoy what you enjoy lovelies 😊❌⭕️••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••STOP IN THE NAME OF LOVE! OKAY, I JUST COULDN'T RESIST =)I have only read the first three books in the series and since I have all of the beautiful UK editions, I decided to read the whole series and get it DONE! Things came back to me as I I re-read this first book and it wasn't as awesome for me the second time around but still good. I think it was the awesomeness of The Clockwork Angel trilogy that had me take it down a star. Anyhoo . . . Most of you out there have read the series so I won't run on too long. Clary and her best friend Simon walk into a bar. (I'm sorry, I couldn't help myself again) And not long after being there, Clary watches some peeps go after some dude. She follows of course and she meets the Shadowhunters: Jace, Alex and Isabelle. They are in the process of killing a demon in human form. So forth and so on, Clary's mom gets taken by the evil Valentine. That just didn't sound right, but I digress. And Clary is attacked by a monster thing and kills it. Jace takes her back to the Institute (<---everything I say doesn't sound right) to heal some injuries and talk to Hodges. At some point Simon shows up and he's staying there too even though there is not supposed to be humans in the Institute. But Clary is not just human so it's all good right. Now we have the gang together. They find out that Clary has some mental block on her memories. Well that would suck, maybe. Maybe not. Anyway, they take her to the Silent Brothers. They are creepy but I think I would like to have one as a friend to follow me to doctor appointments. They tell Clary and Jace that there has been a big spell put on her memories and they might kill her if they try to take it away. They find out it was Magnus Bane, the wonderful Warlock, that put the spell in place. I love Magnus ♥ He's so cool. He was freaking awesome in Clockwork Angels. So, they all go off to talk to Magnus about taking the spell off. He tells them that Clary is slowly getting the memories back and to just wait it out because he might kill her. I think they need to leave her mind alone! So a whole bunch of stuff happens at the end, some stuff that makes you go ew and some revelations. My two favorite characters are Luke, because I love werewolves. And Magnus Bane because he is just bad to the bone! MY BLOG: Melissa Martin's Reading List"}, {"Review": "#1 City of Bones ★★★★☆#2 City of Ashes ★★★☆☆#3 City of Glass ★★★★☆#4 City of Fallen Angels ★★★★★#5 City of Lost Souls ★★★★★#6 City of Heavenly Fire I know I’m slow to pick up this series, but I honestly spent several years of my life thinking that Cassandra Clare’s books didn’t hold anything special in store for me. They just didn’t strike me as books that I would like very much, but when my friend Julie started binge reading them last fall, I decided to finally give them a chance, and I am so happy that I did!\n“It means 'Shadowhunters: Looking Better in Black Than the Widows of our Enemies Since 1234'.”\n→ Clarissa Fray ←Clary, our narrator, was a little more trope-y and cliché than I’ve grown comfortable with in YA, but for a mid-2000s release, her character isn’t wholly unlikable or offensive. She falls victim to the “not like other girls” stereotype a few times, and she’s aggressive when interacting with… well, almost everyone… but she’s also caring, artistic, and bright. She struck me immediately as the sort of protagonist that, while I felt ambivalent towards by the end of the first installment, I could certainly grow to love throughout the series.\n “Sorry, are you telling me that your demon-slaying buddies need to be driven to their next assignment with the forces of darkness by my mom?”\n→ Simon Lewis ←If Clary falls prey to tropes and clichés a bit, Simon does, tenfold. He’s the epitome of the “jealous best friend” trope from the start, and was honestly the only thing about this book that I fully disliked. A little of his banter with Clary was cute, but for the most part, his scenes felt whiny and boring – much like his character, as a whole, felt to me.\n“The meek may inherit the earth, but at the moment it belongs to the conceited. Like me.”\n→ Jace Wayland ←Jace, on the other hand, hooked me from the beginning. I’m such a sucker for the conceited, arrogant teddy bear love interest, and he fulfilled that to every extent. His sarcasm and ridiculous remarks had me laughing out loud more than a few times, but he’s also the sort of character who you immediately can find this gooey, tender core in, and you just know he’s going to make your teeth ache sooner or later (and he totally does). I lived for Clary’s adventures with him. Even if I hadn’t enjoyed the rest of the characters and the plot, I feel like I’d have kept reading this series just for how damn cute he is.\n“Where there is love, there is often also hate. They can exist side by side.”\n→ Isabelle & Alec Lightwood ←Full disclosure: I went into this series expecting to love these siblings just because I’ve heard so much raving about them (*coughJulie!cough*), but they really are precious. I mean, Alec spends most of the first book being kind of a jerk, but he has his motives, and they’re worth pitying. Isabelle comes off as the “airheaded hot girl” cliché to begin with, but it’s immediately evident that she’s a skilled warrior, kind, and entertaining (even if she’s a terrible cook). I don’t feel like I got to know either of the Lightwood kids very well in this installment, but I definitely felt like their characters were set up well enough to make me excited to spend more time with them in the future.\n Beautiful. He'd called her beautiful. Nobody had ever called her that before, except her mother, which didn't count. Mothers were required to think you were beautiful.\n→ hunting, fighting, twists, and turns ←I was left impressed by how well Cassandra mixed world-building, character development, and action scenes in this book, but one of my few complaints was that I didn’t particularly enjoy any of the fight scenes. I know a lot of authors say they’re difficult to write, so I won’t hold it against her (especially in her debut!), but the battles were a little hard to visualize and actually had quite a few inconsistencies (such as a character being annoyed by a lack of pockets to hide something in, but on the next page, hiding said item in her previously nonexistent pocket).What the book lacked in fights, though, it made up for with world building and twists – most of which I, admittedly, was able to peg before it came to pass, but I didn’t think they felt so obvious that it bothered my reading experience.\n “The boy never cried again, and he never forgot what he'd learned: that to love is to destroy, and that to be loved is to be the one destroyed.”\n→ final thoughts ←City of Bones might not have been perfect, and it might have held true to some of the mid-2000s writing clichés I expected, but I was so pleasantly surprised by how much this story sucked me in, and how quickly I became invested in these characters’ lives and the outcomes of their struggles. More than anything, I was stunned by how quickly I fell in love with Jace and the Lightwood siblings, as well as some of the lesser-seen side characters, like the magnificent Magnus Bane and the kindly, brave Luke Garroway. I’m so glad that I’ve already got the entire TMI series waiting on my shelf, and I miiight have already ordered the TDI trilogy, if that tells you anything about how excited I am to continue this story!"}, {"Review": "Alex Pettyfer Updatehttp://www.youtube.com/watch?v=mSgEwl...***OBSCENE ALERT***\nNote: I will fucking kill the Casting Director if Alex Pettyfer,  the man of my erotic dreams and fantasies*coughs* will not be cast as Jace Wayland! Seriously I don't care if he has a British accent and he already have Beastly, I am Number Four and Torment movies for 2011, I don't freaking care! He need to be Jace Wayland and Peeta Mellark! All I want in my life right now is HIM HIM HIM!!! Kyaaaaaaaaaaaaaaaaaaaaaaa!***SPOILER ALERT***I've been curious to google Ms. Clare for the reason that I've read hate reviews about her. I was shocked to find out that she was a harry potter fan fiction writer and became controversial because she happen to plagiarize some of her chapters in her fanfic.Nevertheless the premise of this book got me interested, an ordinary girl realized that she has a shadowhunter blood and is not a mundane, her memories and sight was erased by her mother to protect her from the Clave and the Shadowhunter's world-i know reminds you of harry potter right?- so in this book I could tell that mundane was an equivalent of the world muggle from JKR. There are also obvious ideas that I felt that she got from harry potter like certain places are unplottable or cannot be seen by a mundane (uhm Hogwarts), there is flying motorcycles (Sirius motorcycle), runes, simon turned into a rat (scabbers), and there is also a portal (floo network).However what I really like about this book despite lack of originality is it definitely bad-ass, a perfect read for young adults. It is action-packed, fast-paced and never would be there a dull moment. The characters are very cool, of course there is Clary despite of being a damsel in distress all the time is surprisingly not annoying, she handles herself well at least and I love her sarcasm, wit and love the fact that she was good in drawing. The fact that she can't see how much she's beautiful in contrary that she is, is also made her a likable character. There is also Jace who is deliciously sexy and powerful, despite him being arrogant and cocky all the time the story also look to him as a melancholic person who have bothered by his past, having seen his father's death at a young age. Simon, Clary's mundane best friend which also have an unrequited love for Clary for 10 years. Jace falling in love with Clary and vice versa after all their experiences and now Simon finally confessing his love to her and now dun dun dun we have a love triangle in the story.I also like the dialogues and the fight scenes in the story it was very well-written. I love that she used Latin phrases, it's very cool. Her story is continuous and she also have twists in the story that makes it more awesome and unpredictable. Hodge betrays them and gave the mortal cup to Valentine in exchange for his freedom. Jace and Clary in the end learned the truth that they are indeed brother and sister and their father is Valentine. (this brother-sister thing reminds me of Vampire Knight)Well over-all it is very, very good so definitely I recommend it. "}], "Image": "https://images.gr-assets.com/books/1432730315l/256683.jpg", "Desc": "When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder― much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is nothing―not even a smear of blood―to show that a boy has died. Or was he a boy?This is Clary's first meeting with the Shadowhunters, warriors dedicated to ridding the earth of demons. It's also her first encounter with Jace, a Shadowhunter who looks a little like an angel and acts a lot like a jerk. Within twenty-four hours Clary is pulled into Jace's world with a vengeance when her mother disappears and Clary herself is attacked by a demon. But why would demons be interested in ordinary mundanes like Clary and her mother? And how did Clary suddenly get the Sight? The Shadowhunters would like to know..."}