{"Genre": "Fantasy", "ID": "7332", "Name": "The Silmarillion", "Reviews": [{"Review": "I had tried to read this book multiple times in the past and had basically given up, but I finally realised that I was attempting to read it the wrong way; I was trying to read The Silmarillion like I have read and reread LOTR, as a story, an epic story of course, but still a story. Now, while The Silmarillion is of course partially a story, it is (at least for me) first and foremost a religious type document, a biblical, mythological account of the Elder Days of Middle Earth. So this time, I read The Silmarillion the way I used to read my Bible and how I approached Hesiod's Theogony and other books on Greek and Roman mythology (reading small bits and pieces, following along via audiobook at the same time if possible). And I know this might sound a bit strange, I actually tried singing some of the parts to myself. And I will likely have to reread sometime soon, because there is no way I am going to be able to keep all of the different names etc. clear in my head. But for a first full and complete read, I can only say, wow. As good as LOTR, but also very different, and I honestly believe that in order to truly appreciate, savour and enjoy The Silmarillion a different approach and a different method of reading are required (it just does not work as a typical novel, because it is not a typical novel, it is not even a typical epic)."}, {"Review": "Ever since I joined GR I’ve been putting off the writing of this book’s review… but since I’m high as fuck on cold medicine I feel like I can do it so here suffer thru it!:Along long time ago a little 3rd world kid with an afro became fascinated of what he read on the internet about some British writer named Tolkien… he wanted his books… it became his obsession… so he embarked on a quest to find his books and read the shit out of them… but alas! The book was no where to be found on his dumb little island… but that wasn’t going to stop our little afro hero… he looked and looked, he went to used bookstores, he ordered 5 times in the expensive ones, he looked online, on the streets, even on the flea markets… but they were not to be found… one day after wating for 2 hours for his translator to finish translating and E-copy of The Lord of The Ring: The Fellowship of The Ring. Into Spanish and realizing that it made no fucking sense once translated… our little afro hero went into the internet and founded the only bookstore with most of Tolkien’s work on stock… in Spanish! But there was only one problem… the fucking bookstore was in freaking Spain… the cost of the books + S&H was way more of what our hairy friend had on his piggy bank… so he did the unthinkable… his parents had been bitching about his afro for months…. So he proposed to them that in exchange of his fro they should give him the books he wanted… and they accepted… in an act of self mutilation* our fuzzy friend shaved his head to show his parent’s his anger over making him lose his fro… after that the money was given to him… he could order now (his parents weren’t as stupid as he always thought) and that day.. That day the curse was born!!! It was like the curse of Feanor… but lame, the books took an entire year to arrive… now imagine our froless hero waiting and waiting and calling and emailing and checking and re checking for a whole mother fucking year with his shaved head… (for those of you who wonder this is why I will never again buy a book from the internet, I’m fucking traumatized) but when they got there… how to put it into words… I read the first book (600 pages) in one day… the second in 3 days, the third in 2 days, the fourth on a day and a half… and then it was time for the Silmarillion… I didn’t know nothing about the Silmarillion… I left it for last cuz I thought it would be the most boring one… and boy was I wrong! The first part The Music of the Ainur was such a mind blowing experience to me to the point of I cannot talk about anything else but how metal it sounded that my friends started complaining (somebody got to the point of threaten me that if said something else about Melkor being the coolest I was going to get punch in the balls) I mean if you ever read this book you should know how Melkor invented heavy metal on it… then it was the lamps and all the gay stuff that I didn’t like… that’s when I used to think Melkor was the coolest… then came The Trees… and I was just fascinated of how beautiful everything was… I know it sounds mad gay! But it was!!! And then Melkor did something that made me stop thinking of him as the coolest… he killed The Trees… is not like I cried or anything like that… but you know that was fuck up! The guy is cool and all but I know it sounds stupid… but I did like those Trees man… =( by this time I was so lost in this book that one could actually call it an obsession… I was walking while reading, talking to the characters… (if I were to get a penny for every time I told a character on this book “turn back you fool” I’d be rich by now!)… look I don’t wanna ruin anything to anybody I could honestly talk for hours about how fucking awesome Feanor is…. Or how big Fingolfin’s balls are (bigger than Steven’s) or how beautiful Luthien was and how I wished she never met Beren, or how fucking sick and twisted Morgoth gets… I mean the man was sick! But I need to stop! Cuz if I don’t I’ma be here for ever… I wanna say is that Tolkien was the mother fucking greatest of all times man… this is just such a beautiful book…*:(even tho the paper don’t agree with me on this… it was self mutilation!!! She has no idea how “attached”I was to that fro!!!!)"}, {"Review": "Writing a review of the Silmarillion is like trying to review the Bible. Where do you even start? There’s just so much story in here. Any attempt to convey it in a review would be to do the book a massive disservice. There would only ever be enough space to talk about one or a few elements of the work. So instead I thought I’d give my reasoning as to why every Tolkien enthusiast needs to read this in order to fully understand Tolkien: the sheer depth of the work.“It is said by the Eldar that in water there lives yet the echo of the Music of the Ainur more than in any substance that is in this Earth; and many of the Children of Ilúvatar hearken still unsated to the voices of the Sea, and yet know not for what they listen.”The history of middle-earth is very rich, and it stretches a very long way. Much further than the time of Sauron and the Ring. And this sense of history is only very briefly glimpsed within The Lord of the Rings and The Hobbit if at all. The Silmarillion is the entire picture; it is the entire vison of Tolkien’s fantasy world. It’s a huge piece of world building, and there really is nothing else quite like it. In here he relays a huge amount of history, a truly staggering amount for a fictional world to possess. I often talk about the need for world building in fantasy, and here it is in full force. It’s astonishing. It’s beyond imaginative. It goes further than anything before it and since. And this is why Tolkien is the master of the genre. He wasn’t the first, and he certainly won't be the last to write such fiction, but he was the best writer to ever attempt it. He more than set the benchmark when he wrote this. So if you’re thinking about reading this, but find the task at hand a little bit too daunting, then stop thinking. Pick this book and lose yourself in the history of the greatest fantasy universe ever created. You won't regret it."}, {"Review": "The Silmarillion, J.R.R. Tolkien The Silmarillion is a collection of mythopoeic works by English writer J. R. R. Tolkien, edited and published posthumously by his son, Christopher Tolkien, in 1977, with assistance from Guy Gavriel Kay. The Silmarillion, along with J. R. R. Tolkien's other works, forms an extensive, though incomplete, narrative that describes the universe of Eä in which are found the lands of Valinor, Beleriand, Númenor, and Middle-earth, within which The Hobbit and The Lord of the Rings take place.تاریخ نخستین خوانش: روز بیست و یکم ماه سپتامبر سال 2009 میلادیعنوان: سیلماریلیون؛ نویسنده: جی.آر.آر. (جان رونالد روئل) تالکین؛ ویرایش: کریستوفر تالکین؛ مترجم: مریم واثقی پناه؛ تهران، سبزان، 1385؛ در 455 ص؛ شابک: 9648249407؛مترجم: رضا علیزاده؛ تهران، روزنه، 1386؛ در 624 ص، نقشه؛ شابک: 9643342662؛ مترجم: حسین ترکمن نژاد؛ تهران، غنچه، 1393؛ در دو جلد، شابک دوره: 9786007721070؛این کتاب، نخستین و آخرین کتاب تالکین بزرگوار است، داستان دوران نخست از جهان خیال تالکین، «درام کهنی» که شخصیتهای «ارباب حلقه ها» نیز، رگ و ریشه ی خود را در آن میتوانند بیابند. برخی دیگر از نام آشنایان «ارباب حلقه ها» همچون: «الروند» و «گالادریل» نیز از قهرمانان بخشی از یک داستان کوچکش هستند. برای فهمیدنش شاید کتاب را، بیش از ده بار خوانده باشم. انگار دیگر پیر شده ام، اما هربار که خوانده ام، نکته ای بر دانسته های پیشینم از جهان خیالی که ایشان برساخته، افزون گشته است. دایرة المعارف نامهای کتاب نیز، که در اوراق و بخشهای انتهایی از کتاب آرمیده، بی نظیر است، ریشه بیشتر کلماتش انگار آشناست البته اگر نیک بنگریدکتاب سیلماریلیون داستان‌ دوران دو درخت و دوره ی نخست جهان تالکین است؛ داستان ایلوواتار و ملکور، تا پدیدار شدن الف ها و انسان‌هاست. کتاب «سیلماریلیون» از داستانهای روزگاران پیشین، دوره ی نخست، داستان آردا، و از دنیا و نیروهایی میگوید که آن دنیا را ساختند. داستان نبرد خیر و شر در سرزمین میانه ست، و جنگ با لرد سیاه «مورگوت»، کسی که سارون، تنها یکی از خدمتکارانش بود. داستان آمدن الف ها و ساخته شدن جواهرات مقدسشان، سیلماریل ها، که مورگوت آنها را دزدید، و به دنبال آن مجموعه ای از تراژدیها رخ داد؛ که: مرگ و نیستی، خیانت، پیروزی، امید و یاس، به همراه داشت. از تراژدی عاشقانه ی «برن و لوتین»، داستان فرزندان نفرین شده ی هورین، خیانت مائگلین، و سقوط شهر صخره های پنهان گوندولین نیز سخن میگوید. داستان آمدن آدمیان را نیز بازمیگوید، و رزمهاشان را و اینکه چگونه سرنوشت آدمیان و الف ها به هم گره خورد، و نومه نوری ها را پدیدار کرد. نتیجه ی این داستانها، هم در لحن و هم در سبک نگارش، بسیار متفاوت از «هابیت» یا «ارباب حلقه ها» ست، تا جایی که برخی از طرفداران تالکین خوانش آنرا دشوار مییابند، اما کسانی که به درکی ژرف از آن دست یابند؛ میدانند که ارزش اش بسیار فراتر از «ارباب حلقه ها»ست؛ و بستری ست برای آفرینش آن داستانها. کتاب در پنج بخش آراسته شده است: بخش نخست: آینولینداله «آهنگ آینور» - داستان آفرینش جهان توسط اِرو؛ بخش دوم: والاکوئنتا «حکایت والار» حکایت والار و مایار بنا به روایت اِلدار؛ بخش سوم: کوئنتا سیلماریلیون «تاریخچهٔ سیلماریل‌ها» - داستان اصلی سیلماریلیون که شامل داستان‌های دوران دو درخت والینور و دوره اول می‌شود. بخش چهارم: آکالابت «سقوط نومه نور» - داستان سقوط نومه نور و مردمانش و دوره دوم؛ بخش پنجم: حدیث حلقه‌ های قدرت است و دوره سوم - که با پایان آن این حکایت‌ها نیز به پایان می‌رسدداستان سیلماریلیون: فیانور بزرگترین الف زمانه در هنر و معرفت بود. همو بود که سیلماریلها یا همان جواهرات مقدس را ساخت و آنها را با پرتو دو درخت والینور آکند. دو درختی که میوه و شکوفه شان خورشید و ماه شد. اما ملکور، نخستین فرمانروای تاریکی، آنها را دزدید و به دنبال آن مجموعه ای از تراژدیها رخ داد. محور اصلی داستان بخش سوم کتاب «سیلماریلیون»، حول سه سیلماریل میگردد. داستان «سیلماریلیون» گاه به گذشته ی دنیا نیز میرود، به همان دوران نخست! و آن تاریخچه را نیز در جاهایی باز میکند. ا. شربیانی"}, {"Review": "Buddy re-read with Shii!I’ve been contemplating whether or not to tackle the challenge of actually reviewing this masterpiece for quite some time now. In the end, after having finished reading it for the second time, I realised that I should at least throw out my thoughts on it. So here we go…This is in my eyes the most impressive book ever written.Notice how I did not say “best”. That was completely intentional. I do not believe it is the best book ever written, even though I know others think so, and I understand their opinions. I also know people who have given up on reading this book, or been baffled by the thought of even attempting it. And I understand them too. This is not the most exciting fantasy book you’ll find. But I stand by it being the most impressive one.After almost reluctantly publishing The Hobbit and very reluctantly writing and publishing its sequel The Lord of the Rings, Tolkien could finally concentrate on what he actually wanted to do: to complete his collection of tales on the mythology and origins of Arda, often just referred to as Middle-Earth. The result, though published after the great man himself had passed away, became The SilmarillionOn the back of my little blue timeworn paperback, which is almost twice as old as I am, I read a little quote from the Guardian review of the original release. It says “How, given little over half a century of work, did one man become the creative equivalent of a people?” And the question more or less summarises my own feelings on this book and Tolkien’s other works. These three hundred pages have given life to the most impressive achievement of human creativity ever. No fantasy author has ever done anything matching this, and it is my firm belief that no one ever will. The only book The Silmarillion can be compared to is the Bible and (I hope I do not offend anyone by saying this) even it does not come close to this.The creation of the World by the songs of the Ainur… the schemes of Morgoth Bauglir for dominion over the world… the making of the wondrous Silmarils… the breeding of great Dragons in the firepits of Angband… the story of Beren and Lúthien… tales of war and betrayal and love and loss and joy and grief and everything you could possibly imagine in a tale of fantasy. All of it can be found within the pages of this little book.This book is not for everyone. In fact, I would only recommend it to those who have read and loved both The Hobbit and The Lord of the Rings. But I wouldn’t hesitate to call it the greatest masterpiece of worldbuilding the fantasy genre has ever had.All that remains is to refer you to my little collection of quotes and artwork from the most important scenes of the book. Most of you have already seen it, but for those who haven’t, please have a look:___________________________________________When the Valar entered into Eä they were at first astounded and at a loss, for it was as if naught was yet made which they had seen in vision, and all was but on point to begin and yet unshaped, and it was dark. For the Great Music had been but the growth and flowering of thought in the Timeless Halls, and the Vision only a foreshowing; but now they had entered in at the beginning of Time, and the Valar perceived that the World had been but foreshadowed and foresung, and they must achieve it. So began their great labours in wastes unmeasured and unexplored, and in ages uncounted and forgotten, until in the Deeps of Time and in the midst of the vast halls of Eä there came to be that hour and that place where was made the habitation of the Children of Ilúvatar.___________________________________________Dark now fell the shadow on Beleriand, as is told hereafter, but in Angband Morgoth forged for himself a great crown of iron, and he called himself King of the World. In token of this he set the Silmarils in his crown. His hands were burned black by the touch of those hallowed jewels, and black they remained ever after; nor was he ever free from the pain of the burning, and the anger of the pain.___________________________________________The one had leaves of dark green that beneath were as shining as silver, and from each of his countless flowers a dew of silver light was ever falling, and the earth beneath was dappled with the shadows of his fluttering leaves. The other bore leaves of a young green like the new-opened beech; their edges were of glittering gold. Flowers swung upon her branches in clusters of yellow flame, formed each to a glowing horn that spilled a golden rain upon the ground; and from the blossom of that tree there came forth warmth and a great light.___________________________________________So in that place which was called Losgar at the outlet of the Firth of Drengist ended the fairest vessels that ever sailed the sea, in a great burning, bright and terrible. And Fingolfin and his people saw the light afar off, red beneath the clouds; and they knew that they were betrayed.___________________________________________In the front of that fire came Glaurung the golden, father of dragons, in his full might; and in his train were Balrogs, and behind them came the black armies of the Orcs in multitudes such as the Noldor had never seen or imagined.___________________________________________He passed over Dor-nu-Fauglith like a wind amid the dust, and all that beheld his onset fled in amaze, thinking that Oromë himself was come: for a great madness of rage was upon him, so that his eyes shone like the eyes of the Valar. Thus he came alone to Angband’s gates, and he sounded his horn, and smote once more upon the brazen doors, and challenged Morgoth to come forth to single combat. And Morgoth came.___________________________________________Blue was her raiment as the unclouded heaven, but her eyes were grey as the starlit evening; her mantle was sewn with golden flowers, but her hair was dark as the shadows of twilight. As the light upon the leaves of trees, as the voice of clear waters, as the stars above the mists of the world, such was her glory and her loveliness; and in her face was a shining light.___________________________________________Before the rising of the sun Earendil slew Ancalagon the Black, the mightiest of the dragon-host, and cast him from the sky; and he fell upon the towers of Thangorodrim, and they were broken in his ruin.___________________________________________And thus it came to pass that the Silmarils found their long homes: one in the airs of heaven, and one in the fires of the heart of the world, and one in the deep waters.___________________________________________Ever they dwindled with the years, until their glory passed, leaving only green mounds in the grass. At length naught was left of them but a strange people wandering secretly in the wild, and other men knew not their homes nor the purpose of their journeys, and save in Imladris, in the house of Elrond, their ancestry was forgotten.___________________________________________Then the name of the forest was changed and Mirkwood it was called, for the nightshade lay deep there, and few dared to pass through, save only in the north where Thranduil's people still held the evil at bay.___________________________________________In the twilight of autumn it sailed out of Mithlond, until the seas of of the Bent World fell away beneath it, and the winds of the round sky troubled it no more, and borne upon the high airs above the mists of the world it passed into the Ancient West, and an end was come for the Eldar of story and of song."}, {"Review": "How To Build A Truly Convincing Fantasy World1. It's all about the language. Make sure your world's language is convincing, and you're pretty much there. Conversely, if your language sucks then everything else will.2. Your book can't include more than a few sentences in your invented language without losing your audience. But it can include plenty of names. So what people will really judge you on is the quality of the names.The rest of this review is available elsewhere (the location cannot be given for Goodreads policy reasons) "}, {"Review": "\"Oh woe-begotten spirit, fall now into dark oblivion, and forget for a while the dreadful doom of life.\"I must admit. I struggled. Though I love the Lord of the Rings and the Middle Earth Universe with all of my heart, tackling a large part of its history in this manner was tough going. The world Tolkien created is absolutely extraordinary, without a doubt. Unfortunately The Silmarillion is written as a long history or mythology of biblical proportions. Name after name, battle after battle, son after son. It was hard to follow. I can respect how wonderfully intricate and detailed the world is - but with that many characters and no straight story to follow through.... I'm pleased to be able to say I've done it, but I don't think it's one I'll be able to come back to time and again. I'll stick to LOTR I think. Though I will read Beren and Lúthien and The Children of Húrin when I can. Tolkien truly is a master. 3.5 stars.\"Help oft shall come from the hands of the weak when the wise falter.\""}, {"Review": "\nSauron was become now a sorceror of dreadful power, master of shadows and of phantoms, foul in wisdom, cruel in strength, misshaping what he touched, twisting what he ruled, lord of werewolves; his dominion was torment.\nAh, Sauron, Maia of Aulë—beyond doubt the singularly most enthralling antagonist whom I encountered as a young reader, possessing all of the malevolence and dark charisma and naked power of Satan, but unhobbled by the multi-aspectual morphology of Christian theology and popular culture that far too often rendered the Devil a ridiculous figure: a wild-eyed and beastly fornication ringmaster cavorting with naked acolytes; a scarlet-skinned, pitchfork-wielding fashion model for forked-tails and forehead horns; or slyly smiling traveling salesman, pitching his gimcrack wares backed by loosely-enforced contracts claiming lien upon some drink-tossed wastrel's dubiously-valuable soul. But Sauron—the dude fell, the dude schemed, the dude was scary, whether donning the raiments of a beautiful, translucent ring-wise man or an unbearably, searingly abhorrent humanoid vessel of the void.There exists no other book that I've read as many times as The Silmarillion. Much more than the questing, heroic storyline of \nThe Lord of the Rings\n was I drawn to the background of all those tumultuous events, the grand personages and royal lineages that stretched back into the mists of primordial time. Where did Sauron come from? From what pit originally arose the Balrog? What order was Gandalf exactly a member of? Who were Beren and Luthien, and what relevance did their own story have to this ultimate chapter of the War of the Rings playing out on the pages before me? Immediately that I finished the trilogy I rushed into the Silmarillion; and though at that time I was still too young to appreciate the allusions to other great mythologies, to the wonderful intricacies of the languages that Tolkien had constructed for his Middle-Earth races, to the powerful theme of tragedy—always linked with a hubris of the striving spirit—that was enjoined to the Noldorin rebellion against the Valar and their heroic-but-doomed struggle against Melkor, He Who Arises in Might, Morgoth Bauglir the Black Enemy—Radical Valar Renegade, Spawner of the Orcs, Dark Lord of the Balrogs, Tutoring Patron of Sauron; in toto, Supreme Badass Motherfucker of all Middle-Earth—still I was held spellbound by these glimpses into the Great Creation, the Dawn of Elves and Men, the Noldorin Exile and the fate of the Silmarils, which ended with such a perfect balance, the priceless jewels at rest at the bottom of the sea, the deepest of earthen chasms, and the highest heights of the heavens. What's more, after the breaking of Beleriand the reader is presented with the awesome arc of the founding and the doom of Númenor, in which Sauron gloatingly laughed atop the Island's mountain temple and lustfully defied the punishing lighting strokes that sizzled through the nighttime air; and the concluding overview of the War of the Rings, in which much is explained that makes The Lord of the Rings even more enjoyably complete than when the trilogy—and its prequel The Hobbit—were the only source for the incredibly deep history that Tolkien had woven from his lifelong love of language.These annals, with their brilliantly-etched admixtures of beauty and short-lived heroic triumphs set against an overpowering sense of futility and tragic defeat at the hands of an enemy whose cunning is as deep as the infernal pits of his cavernous dungeons and whose malice engirds the star-kissed world, whose very corruption has been bled into the core of creation itself, were just what were needed to spark a young imagination; Tolkien's private amusements and delights mirrored my own in their fledgling form, and inspired me to tributary tasks of creation that nobody else could understand or appreciate but which gave me immense personal satisfaction. They awoke within me the powerful demiurgical desire to craft worlds, populate them, endow them with their own gods and mythologies, formulate a history, laden it with political systems, the whole works, all in the service of a time-bound fate that culminates in an apocalyptic showdown betwixt the dark and the light. At that point in a person's life, when the complex and inscrutable mathematical rituals and hierarchical causality of all-powerful modern science have immense appeal but few handholds, the prismatic and primal allure of myth and magic, the intuitive interconnectedness of nature with the sorcerously creative will of man, even at that tender age a force struggling to avoid restraint and desperately endeavoring to draw power from those spiritual furnaces deep within, the font of dreams, such tales of heroism and fortitude in the face of the supernatural are, for many, very hard to resist. What's more, the channeling of natural phenomenon into organic spirits with anthropomorphic features and forms offers another intuitively-appealing means to understanding a vast material world that otherwise seems awesomely inexplicable and frighteningly unpredictable. Stories that tap into our innate desire both to be entertained and be edified by human theatre set within the panoramic vistas of a horizon-hid past—Tolkien delivered in spades.I don't care that it was edited by Christopher Tolkien and Guy Gavriel Kay and, thus, can't be declared canonical. Who gives a shit? Some complain that it reads like a Middle-Earth bible, that its archaic style and portentous prose are a labor to struggle through, and provide nothing as satisfying as the great trilogy he had wrought. Ah, tell it to the judge. They read like the annals composed from the mythological strains that wend across a mysterious, fate-bound history that they, in fact, are: it's just that this particular history was played out solely within the mental confines—a rich cerebral theatre—of the author, and possessed a coherence and potency to rival the mythologies of the Greeks or the Northmen. What more could a reader want? If Tolkien's labour of love, crafted and edited, reworked and rewritten, was of such an amazing expressiveness and beauty and power that it both upheld the Ring Trilogy and lit its mythological intimations with a fulgent blaze that only served to augment one's appreciation of the latter's depths, then why not put it out there for that multitude of fans who were dying to sample more of the mystical marvels from one of the greatest and most uniquely imaginative minds of the past century?"}, {"Review": "3.5/5 starsWith a new interest and determination, I have finally finished reading The Silmarillion.I have failed this book twice and I was so sure that I won’t attempt reading it again. However, I have just finished re-watching The Lord of the Rings trilogy extended editions and reading the Three Great Tales of Middle-Earth that’s edited by Christopher Tolkien. I know this is not the recommended reading order but it's only because of doing these two activities that I found a new interest, knowledge, and motivation to actually persevere and finish this book.Picture: Fingolfin versus Morgoth by Art-CalaveraFinishing The Silmarillion for the first time was one of the most difficult reads I’ve ever attempted in my life. It was so difficult that in my opinion, reading this book alone was harder than reading the entirety of Malazan Book of the Fallen. My main problem with it was that that I found it the first half of this book to be extremely boring. I’m talking about hundreds of names (characters, places, events) being fired non-stop at readers, monumental events happening in two sentences, and the extreme difficulty in caring with the characters because there was close to zero character’s thoughts exploration due to the biblical style of writing. However, after reading the three Great Tales of Middle-Earth, these names started to become more familiar and much easier to remember. In fact, when I got back to it, I found the second half to be so full of engaging and epic events.\n\n“All have their worth and each contributes to the worth of the others.”\n\nI won’t be reviewing each story in this book, there are way too many of them and I genuinely think a lot of Tolkienist can do a much better job in explaining the greatness of this book. Instead, I’ll say this. The First Age of Middle-Earth makes the event of the Third Age (events in The Lord of the Rings trilogy) looks like a normal skirmish. There were so many incredible and epic battle waged; tons of tragedy and loss; unmeasurable evil of Morgoth that makes Sauron looks like a brat. Out of all the stories included in this book, there were two that stands out the most to me. One is obviously the story of Turin Turambar that has already been told in full details on The Children of Hurin. I have done a full review on this story but to summarize it, I absolutely loved it and I have no doubt it will be even better upon a reread one day.Picture: The Sack of Nargothrond by Donato GiancolaThe other favorite story was definitely the War of Wrath which depicts the final battle of colossal proportion that ended the First Age of Middle-Earth. It’s such a shame though that this chapter was super short. Like many of the stories contained in this book, I genuinely think that if the right author re-wrote these stories with multi-characters POV to follow instead of an omniscient biblical style of writing, War of Wrath would definitely be one of the most epic fantasy war to be written. It’s seriously hard to explain the scope of this battle, instead, I’ll show you an image of the battle between Earendil (the tiny blue light in the picture) and Ancalagon the Black.Picture: The Dragon and the Star by Manuel CastañónThe Silmarillion was not an easy read and the first half of the book was completely not fun at all to read. Due to the nature of writing style, there were also a lot of events that could’ve worked so much better rather than making me feel so distant. However, this book clearly shows Tolkien’s capability as a pioneer in fantasy world-building. I didn’t even know how rich the lore and history behind Middle-Earth was until I’ve read this one. I highly recommend this book for patient readers and obviously, fans of Tolkien. If you’re not a huge fan of The Lord of the Rings trilogy, I really think that it’s not mandatory for you to push through this book if it’s not working for you. Don't get me wrong, there were a lot of great scenes that really shows Tolkien's imagination at its highest level. But overall, I think I'm left wanting more out of the stories than feeling completely satisfied.You can order the book from: Book Depository (Free shipping)You can find this and the rest of my reviews at Novel Notions"}, {"Review": "Though I had many near-misses with The Silmarillion throughout the years (having been introduced to Tolkien's universe by discovering The Hobbit in my school's library in 5th grade), I finally slogged my way through it during the summer after my sophomore year of college. The first two years of my undergraduate degree were rather gruelling, and I wanted, more than anything else at that time, to just read a bunch of books I wasn't required to read. After making my way through The Complete Sherlock Holmes, I decided to revisit Tolkien.I had read The Hobbit twice before and the Lord of the Rings once (and a half). As I've stated, I dipped my toes in The Silmarillion, but never let myself dive in. This time, in the interest of reading something other than required reading, I jumped in with both feet. It was cold. And deep. And dark. It took a while to feel my limbs. It took even longer to get my arms and legs moving, but I soon found I was OK: Still breathing and able to dog paddle. As I worked my way into it (and it was work!), I discovered that certain tidbits in the myths and legends of middle earth rang familiar. I knew that much of The Silmarillion had been \"back-written\" after the fact, which might strike people as some sort of disingenuous act on the part of the Tolkiens. I was thrilled. Here I learned who Elrond was, the significance of the fall of Saruman, and the true nature of and relationship between Gandalf and the Balrog. This was a revelation.I plugged my way through and finished. No, I didn't remember everything and I probably never will. That summer was a unique opportunity for me, to read almost interrupted for such a long stretch. I followed up by reading The Hobbit and The Lord of the Rings in succession, immediately after finishing The Silmarillion. Then, and only then, did I appreciate the full magnitude of Tolkien's brilliance. It was a whole new world. I had already visited it, but now the scales fell from my eyes and I saw it in a whole new light. The Hobbit and The Lord of the Rings were transformed, for me, from great books to epic.Rather than being caught up in complaining about how difficult The Silmarillion was, I felt richly rewarded. I had worked for the glittering prize and it was even more beautiful than the time when I first laid eyes on it in that musty school library in Nebraska. Can nostalgia be forward-looking? It was for me that summer. I was caught in some sort of blissful time-loop that only released me when the urgency of school set upon me again that fall. But something joyful was sparked in me that hasn't ever fully left, thanks to The Silmarillion."}, {"Review": "Time for James’s unpopular opinion: I liked this better than The Lord of the Rings!Before saying I am crazy, hear me out (actually, if you have nothing better to do, then read this review; if you have, then I gave this 5 stars, so you know my opinion anyway! See, you can’t say I don’t care for your time!). Silmarillion tells the tale of the making of the world by Eru, the God of Middle-Earth and all that followed through the first two ages of creation, up until the events described in The Hobbit and LOTR. Christopher Tolkien did a great job of connecting his father’s writings on the subject, so we have a nice and chronological story. But it is not a novel exactly, for it covers countless years.Eru and his Valar, spirits of great power, create Arda, which is the Earth that is seen and there they make the world ready for the coming of the First Born, the Elves. The Second Born, Men, come too at some point. Silmarillion is broken into 4 parts:1.\tAinulindale (the creation part)2.\tValaquenta (the bulk of the story, chronicling the rise of the Elves and then their fall from grace, the deeds of Melkor (or Morgoth), the greatest of the Valar that fell to darkness, also the master of Sauron (how awesome is that?!); and there’s also the coming of men and their part in the war that followed)3.\tAkallabeth (of the great kings of Numenor, the ancestors of Aragorn from LOTR)4.\tOf the Rings of Power and The Third Age (basically a summary of what happened in The Hobbit, LOTR and a bit before that)Now, I said it is not exactly a novel. Silmarillion is written as a combination between The Bible and a history/mythology book. It has a huge number of characters, with some of them being very prevalent. You learn here of a lot of the things only mentioned in LOTR: like Galadriel and Elrond’s origins, Earendil, Gil-Galad, Hurin, Turin, the fall of Gondolin, the great city of the Elves, the Silmarils, the most beautiful jewels ever created, the great love story of Beren and Luthien, the archetype for the fate of Aragorn and Arwen.I said I prefer this to LOTR and that is because the scope of Silmarillion is unimaginably huge. Next to it, the events in LOTR seem like child’s play. It is much more epic than LOTR and some of the characters really stick with you. The archaic style is also something I loved, unlike many people reviewing this book.Actually, I am surprised at the low grade this has here on Goodreads. The only explanation I have for it is the fact that a lot of readers search for instant gratification these days. Sad really. It is true though that if you want to read this Tolkien epic, you need patience and attention. But it is soooooo worth it!Now, I hope that some movie studio will adapt this one day (in a series of 10 movies or so that would be needed to fit all the story). All in all, it is by far the best book I (re)read this year!"}, {"Review": "The whole day, I have been trying to find the best words to use in this review, but how can you find the right words to describe perfection? This book was just a delight to read, from start to finish. The fact that a single man was able to create a fictional world with so much detail absolutely blows my mind. You can feel the love Tolkien had for Middle-earth in every word he writes. The way everything comes together makes it hard to believe that all of this is truly just fictional. There is so much information loaded in these few hundred pages; I already know that I will reread this book many, many times throughout the rest of my life, just so that I might be able to some day understand and remember everything.As wonderful and dear as this book is to me, I also want to say that:1. You probably shouldn't read this before reading The Hobbit or The Lord of the Rings. I think it would be too confusing and just a bit too much as a starter to this world.2. You also probably shouldn't read this if you didn't like either of the aforementioned books. You need to care for Middle-earth and its history to properly enjoy and appreciate this one.3. If you did enjoy the aforementioned books, do NOT go into this one thinking that you're going to get a similar adventurous story. This isn't exactly what I would describe as a \"novel\". The description it probably fits the best is \"bible of a fictitious world\"."}, {"Review": "The first fantasy book I ever read and still my all-time favorite. That said, it's not for everybody. It's been compared to the Old Testament, and that's still the best analogy; if you think that Moses leading his people out of Egypt is the stuff of grand drama, then this is the book for you, Tolkien fan or not. If you don't, then you probably ought to give The Silmarillion a pass, no matter how much you liked Tolkien's other work. This is not Lord of the Rings Plus; it's quite literally the Old Testament for Middle Earth, beginning with the creation of the world and ending just before the War of the Ring, which forms little more than a footnote in the more-than-epic sweep of time portrayed.If you're excited rather than put off by the above, then what a ride you're in for. This is high fantasy on the grandest of scales: the song of creation, by which the gods call the world into existence; the first rising of the sun, sowing panic among the many dark creatures of Middle-Earth; the first dwarves, emerging blinking and wondering from their underground birthplace; and the great kingdoms of the Elves, at the height of their power, locked in war with Sauron's master. There are some slow parts: the beginning in particular features an overlong description of Middle-Earth's imaginary pantheon that almost made me put down the book the first time, and the ending seems tacked-on, a half-hearted attempt to extend the Silmarillion's timeline to that of the Rings trilogy. But the middle is golden. For those who are into this sort of thing, it'll be some of the best fiction you've ever read. Just know what you're getting into beforehand: I'm sure the spirit of J.R.R. will forgive you for skipping it."}, {"Review": "Buddy-read with Markus!Is this book really that hard to read?No, if you take it the right way. This books was not written to make readers like an specific plot twist or character. No! This book is solely the recompilation of various tales that happened in the world where The Lord of the Rings was settled in, from the beautifully written Ainülindale and the creation of Eä, to the end of the Third Age and the Fading Years.That being said, you'll understand that it's not odd at all to find chapters entirely dedicated to geography or genealogy.Am I making it sound like a boring book? Let me fix that. This is a small list of cool things that you can expect:The awesome Valar\nMorgoth, the Lord of the Dark\nBeautiful stories about Arda's astrology\nElves behaving badly (Men did too, and dwarves. But mostly elves)\nElves being awesome\nEpic battles\nBreath taking love stories\nTales about friendship\nUnbelievable places\nBad-ass heroins\nIncest\nYes, I was surprised about that last one too.I truly hope that all this artwork is persuasive enough for itself."}, {"Review": "In my humble opinion, The Silmarillion is the greatest work Tolkien almost finished. It is by far more difficult to read than The Lord of the Rings (which I already expressed my love for earlier in the year after completing my re-read) or The Hobbit but its greatness is found in the way it mixes together epic fantasy, mythology and linguistics to create a grand tale of creation and destruction.Part of what I love so much about Tolkien's entire Middle Earth story is that there is a cycle as to how events take place. The overall events of The Silmarillion lead into the smaller events of The Hobbit which lead to The Lord of the Rings. It is a cycle that discusses the nature of archetypical good and evil and how evil does not truly die among mortals but re-invents itself in newer and lesser ways for different generations and different heroes. The ring of The Hobbit and The Lord of the Rings is birthed of Sauron and Sauron is birthed of Morgoth. The entire story of The Silmarillion begins with the creation tale of Middle Earth. This creation tale features around the idea of the one true god Eru Ilúvatar creating minor gods (or angels) responsible for the development of Middle Earth. Each of these beings possess some different type of reflection of who the ultimate God is, that is aside from Morgoth (who begins life as Melkor) who appears to possess all the reflected gifts of Ilúvatar. Much as Lucifer did, Melkor attempts to become like Eru Ilúvatar, seeking the power of true creation and falling into the shadow. Melkor then moves to distort and destroy the acts of the other godly beings of Middle Earth (the Ainur) as he could not create life aside from the blessing of Eru. This leads to him becoming Morgoth and warring openly against the other Ainur, men and elves. It is these conflicts that The Silmarillion covers in detail, alongside the actual tale of the Silmarils - three mystical gems created by the elves and stolen by Morgoth for his crown.As a rough conclusion I must admit that The Silmarillion is not for every reader. Many have complained about the rough, almost Biblical style of writing and how hard it is to read. It is not written like Tolkien's other works and part of this is because it was only in draft form when he passed away. Part of this is because it is a mythical epic and not an epic fantasy as readers commonly understand. Yet it is a work of fiction that explains best why Tolkien is the master of fantasy and one of the great fathers of modern fantasy. When 'Tolkien' clones are talked about, very few people recognise the idea of The Silmarillion. If they did then even fewer books would hold a candle in fantasy to the work of Tolkien as a whole. "}, {"Review": "Ο συνδετικός κρίκος αυτού του βιβλίου με το προηγούμενο είναι τα ονόματα. Πολλά, πάρα πολλά ονόματα και με διάφορες παραλλαγές, αλλά τουλάχιστον εδώ υπήρχε ευρετήριο και δεν τα βρήκα βουνό.Αυτό το βιβλίο ήταν συνανάγνωση με μια πολύ καλή φίλη Τολκινικιά επίσης, την Geo KwnstantinouΤο διαβάσαμε κι οι δύο για 2η φορά μετα από τουλάχιστον 7-8 χρόνια.Με εξαίρεση τα γνωστά εδάφια, (διότι για μένα είναι σαν βίβλος) Αινουλιντάλη, Τα παιδιά του Χούριν, και Τα Δακτυλίδια της Δύναμης, το υπόλοιπο βιβλίο ήταν λες και το διάβαζα για πρώτη φορά. Και αυτό ήταν θετικό.Το βιβλίο ουσιαστικά χωρίζεται σε 5 μέρη:Την Αϊνουλιντάλη που είναι ουσιαστικά κεφάλαιο κοσμογονίας (Γένεση), εξιστορώντας το πώς δημιουργήθηκε ο κόσμος με την μουσική πολλών θεϊκών όντων και όχι με ξόρκια ενός εγωκεντρικού.Την Βαλακουέντα που είναι ουσιαστικά κεφάλαιο θεογονίας, το πώς δηλαδή δημιουργήθηκαν οι θεοί, πώς σχετίζονται μεταξύ τους, τι δυνάμεις έχουν, ποιοι είναι διεφθαρμένοι κλπ.Το Σιλμαρίλλιον το όποιο είναι ουσιαστικά το 72% του όλου βιβλίου με 24 κεφάλαια που ασχολούνται με τα γεγονότα της Πρώτης Εποχής με γνωστότερα ίσως τις ιστορίες του Μπέρεν και της Λούθιεν, και των Παιδιών του Χούριν, ιστοριες που έχουν δυνατό το αίσθημα αρχαίας ελληνικής τραγωδίας, όπου ο ήρωας δεν ξεφεύγει από το πεπρωμένο του, και γύρω του όλα διαλύονται. Ποιητικά υπέροχες αλλά και καταθλιπτικά λυπητερές.Το Ακάλλαμπεθ είναι κεφάλαιο που καταπιάνεται με τη Δεύτερη Εποχή και συγκεκριμένα την πτώση του βασιλείου του Νούμενορ.Τέλος Τα Δακτυλίδια της Δύναμης είναι ουσιαστικά η Τρίτη Εποχή που είναι η πιο γνωστή στους περισσότερους όπως: Σάουρον, Γκάνταλφ, Χόμπιτς, Άραγκορν, Μόρντορ, κλπ.Ο Τόλκιν είναι ο αγαπημένος μου συγγραφέας και έτσι λογικό είναι να δώσω αυτού του βιβλίου άριστα με τόνο.Είναι ένα βιβλίο που δεν κατάφερε να ολοκληρώσει, μιας και ήταν απίστευτα τελειομανής και συνέχεια άλλαζε τη μορφή των ιστοριών τα ονόματα, συνέχεια έκανε αλλάγες. Αλλά με το θάνατό του ο γιος του αποφάσισε να δημοσιεύσει όλο αυτό τον όγκο ανέκδοτων ιστοριών.Μια συνοδευτική έκδοση αυτού του βιβλίου είναι οι Ατέλειωτες ιστορίες που ακόμη να διαβάσω και διαδραματίζονται κυρίως την Τρίτη Εποχή αλλά και με επεισόδια από τις προηγούμενες εποχές. "}, {"Review": "Ne znam iz kog razloga do sada nisam čitala Tolkina...Kako god, moja prva knjiga ovog pisca, svakako ne i poslednja.Na početku beše konfuzija...Mali milion imena božanstava (duhova) i vilenjaka na jednom mestu.Bilo je ono: \" Ko beše ovaj? \", \"Da li je to Valar, Majar ili vilenjak?\", \"Dobro bre, jesi li ti debil pa ne možes da zapamtiš likove, kako uopšte misliš da nastaviš sa knjigom?\"Uhhhh.... :D Međutim, kako knjiga odmiče, sve se vraća na svoje mesto zbog toga što se imena likovai opisi istih više puta pojavljuju (ponavljaju) u knjizi pa je gotovo nemoguće da ostanu neupamćeni. :)Nastavak čitanja teče glatko, okrećem stranicu za stranicom, ne želim da se odvojim od knjige.Završavam Silmarilion i jako mi je žao što nema više stranica.Ova kompleksna knjiga je ODLIČNA!!!Sve objašnjeno kako treba, ništa preterano, opisi onakvi kakvi trebaju da budu.Svet koji je Tolkin zamislio je fantastičan, što govori o njegovoj genijalnosti.Opisi stvaranja Srednje zemlje i dolaska naroda (vilenjaka, ljudi, patuljaka..) su zaista neverovatni.Sve priče (poglavlja) u Silmarilionu su zanimljive. Na mene je poseban utisak ostavilo poglavlje o Turinu Turambaru.Ako ste ljubitelj Tolkina i želite da znate istoriju i dešavanja pre događaja iz Hobita i Gospodara prstenova onda biste trebali da imate ovu knjigu u svojoj kolekciji."}, {"Review": "To me, “The Silmarillion” is the crown jewel of Tolkien’s work – the silmaril, if you will. I knew the basic themes long before I started the book, and after “The Lord of the Rings” I also knew that “The Silmarillion” would be what I had been waiting for. The concept was not only radically new in its time, but is still unique in any given time-frame: a made-up cosmogony and mythology (well, it always is) of a made-up world, inhabited of made-up peoples, made-up history, made-up languages etc. Everything started from scratch. Still, that is not nearly the most remarkable thing. Because if I had not known what I was dealing with, I never would have considered this to be a modern rendition rather than a mythology rooted in and legitimised by its community. Meaning to say: This sounds (reads) so staggeringly authentic! Every mythology has a familiar ring to it. After all, the do all consist of archetypical elements with a more or less prominent individual twist. And in “The Silmarillion” you get an abundance of everything to choose from. There are the imperious, demanding mania of Biblical proportions, the noble yet distant fierceness of the Edda, the disturbing darkness of the Wälsung (or Völsung) or the Kullervo as major threads. Minor ones include a cataclysm nothing short of Atlantis, a hill populated by deities of sorts, race carts in the sky etc. And an entire heap of motifs and elements that I missed or left out. Including heroes, monsters and maidens. (And with blackjack and hookers!)The prose itself is worthy of every classic, scholarly translation of an ancient source. But equally important and far more exciting on quite an instance was the linguistic splendour and brilliance, flowing into a nuanced stratification of languages, dialects, structures, system and even loanwords within Arda. A friend said that some parts of Tolkien’s opus only a philologist could find interesting. I would hardly call it interesting. My expression of choice would be a never-ending wet dream. In addition to that, Tolkien knows very well how to make use of emotions or to restrain them. He knows how to alternate between climaxes and anti-climaxes, when to engage and when to slow down, while keeping and intact, continuous pace. This tale is so epic in the original sense of the word, so full of glory, pride, hubris, tragedy, pathos, rise and downfall that it left me no less in awe than my favourite “real” mythologies. “The Silmarillion” is not only a perfect mimesis. It unfolds das Erhabene, the sublime, right in front of you, without emotional over-burdening. You can be enchanted and amazed, but you could hardly shed any tears over this. Anyway, would you over e.g. Beowulf? (Both the epic and the character.) Once the tale is finished, or even before it is finished, everything falls into place. Every line of “The Lord of the Rings” and every event in Middle-earth. For with everything that it is, “The Silmarillion” is also primarily an account of the decline of a people sprouted out of their world, yet not essentially belonging to it: the Elves. (That much we had in common. After roughly three months, I too had to leave Middle-earth behind. I knew it would be painful. But I also knew I wanted a dignified closure after pouring so many emotions into this and after everything essential had already been said. No notes, no drafts, no unfinished stories. That would only have been an ugly and ungracious life-support.)"}, {"Review": "A reread. I read this the first time in April 1992, during my second trip to London (I've been there many times since, and do want to go again). NOTE: This book is the prequel to the Hobbit-LOTR books, and if you haven't yet read those two, the ending of this book has spoilers for both.The book (first parts being written down in 1917) is divided in five parts; the first two books deal with creation and prehistory, then comes the main part which deals with the quest to get the Silmarils, plus various stories about people and persons, often tragic. The fourth part tells the story of Numenorean people, and the fifth is post-Silmarils and into post Numenorean time, with things familiar to those who have watched/read the Hobbit/LOTR stuff, including the story of the rings and the coming of the wizards. Finally there are appendixes (incl. family trees, list of persons, and on language), and the map, which I had to mend a little since I tore it a little trying to open it the first time XDNow I just make some smaller comments:- Melkor (Morgoth): pride and impatience -> shame and hatred -> envy, power-seeking, hate, violence, fear etc. Corruptor of some maias which lead to the creation of balrog, and Sauron (which means that the fight in LOTR between (view spoiler)[Gandalf and the balrog was a fight between two maias! And the balrog was there because he had been hiding there since the First Age (hide spoiler)])- loved that the world was created with (view spoiler)[chains of songs (hide spoiler)].- Iluvatar is a God-like figure, the Valar are like creative angels (and Melkor then is the Devil figure)- loved the Beren-Luthien story (I imagined myself as Beren, that says something about me *lol*); Huan the dog was amazing *hearts*- the three Silmarils are actually a bit like the Ring: their power can be bad too- I'd like to compare the stories of Turin (like a figure from the Kalevala) and Tuor: one full of rage, the other full of hardship- Sauron being called Annatar, Lord of presents (the 'anna-' part is like the Finnish verb of 'give' + the end part is used up here as feminine ending)- how the elf-wizard council thinks about (view spoiler)[Sauron's coming at first seems a lot familiar when one thinks of the 1930s... at least I saw it like that. Saruman thinks he's smart because he studies but the studying slowly snares him - perhaps it was inevitable (hide spoiler)]!- I've always had a little fascination at the story of Numenoreans:(view spoiler)[ they are like Atlantis. First pride, then wanting more than their limits allow (to avoid death which they FEAR, to visit where they shouldn't), then letting Sauron in, then daring to sail, which destroys not just the ships... *shudders* (hide spoiler)]This is a story of worship and belief; also lack of, or in wrong directions. Predictions, curses, oaths, visions. Rise and fall of kingdoms, lives and deaths of various kind. Promises and alliances, kept and broken. Prejudice, possessiveness, pride, lies, secrets, lack of trust. Bravery, skills, buiding (places and ships), sharing things, loyalty, help in battle, elf-human love and friendship. This book has so much though normal thickness.I love it just as much as I did the first time, perhaps now finding things that I couldn't see then... a very enjoyable experience. There might not be a film for this, but I got nice mental visual out of it anyway. Worth reading, again and again."}, {"Review": "\nI love messy elf drama.Super excited to kick off my Tolkien re-reads with this one!\nI think I actually enjoyed this more the second time around! It can be, admittedly, a little bit dry at times and I definitely enjoy certain chapters/stories more than others, but... I adore the world, so it's always a fairly enjoyable read tbh. I picked up on things that I missed the last time I read it - it's just a little bit lore heavy, so that's understandable. Also just about everyone has at least 2-3 names each, so trying to get my head around all of those is always an Experience.Next stop: The Hobbit and then I'm finally gonna be re-reading The Lord of the Rings for the first time in yeaaaaaars. I'm so excited!!"}, {"Review": "واو بالآخره تموم شد! واقعاً توصیه می‌کنم هیچ‌وخ تو امتحاناتون کتابای قطور و سنگین نخونین! هم عذاب وجدان ِ امتحان هس، هم این‌کتاب ِ طفل ِ معصوم.خب از قبل هم می‌دونستم با چیز پیچیده‌ای طرفم. و به‌خصوص که یه‌بار سوم راهنمایی شروعش کردم و بعد پونزده تا بیس‌صفحه به‌فوبیای تالکین و الخصوص سیلماریلیون دچار شدم، گذاشتمش کنار تــــــــــــــا حالا که به‌خاطر توصیه و علاقه یکی از دوستام رفتم سراغش. الحق خیلی عظیمه؛ ینی بخش آخرش که در مورد حلقه‌های قدرت و ایناس، شما نیگا کنین چطوری شده حاصل ِ ارباب ِ حلقه‌ها؛ در حالی‌که اونم خودش خدا صفحه‌س. :دی و تو این‌جا چقد کم بهش پرداخته شده. گمونم بهتر بود اول هابیت، بعد سه‌گانه ارباب حلقه‌ها و در نهایت، اینو می‌خوندم. که خب، گفتم یه‌بار جهت انس‌گرفتن با این‌کتاب، یه‌جور الله‌بختکی‌واری بخونمش و بعد برم اونا رو بخونم و بعد باز برگردم سراغش که دیگه حسابی تو ذهنم جفت و جور شده باشه.بگذریم از استادی و هنر تالکین، سایه بسیاری از افسانه‌های کشورهای مختلف رو این‌کتاب سنگینی می‌کرد. حالا من به‌افسانه‌های دیگر ملل اشراف چندانی ندارم. ولی به‌خوبی رد پاشونو می‌فهمیدم. حداقل می‌تونم بگم تأثیرات افسانه‌های کشور خودمونم دیدم. و تأثیرات کمی هم نیس! به‌هر حال، اطلاعات تالکین مشخصاً خیلی زیاد بوده و افسانه‌های تاریخی رو با تخیل خودش درآمیخته تا بتونه افسانه‌ی خودشو بیافرینه. یه‌چیز ناگزیره به‌نظرم.بعد، جاهایی که در مورد ایلوواتار و کلاً ابتدای داستان بود، دوس داشتم. همچنین جریان برن و لوتین رو، و فئانور هم خیلی شاخ بود! :-\" منتها ممکنه این‌فرم ِ حماسی ِ داستان به‌مزاق خیلیا خوش نیاد. برا منم یه‌جاهایی خیلی اغراق‌گونه بود. ولی خب، افسانه‌ن دیگه. به‌لحاظ فنی که در حدی نیستم بخوام ستاره بدم، بیشتر بر اساس علاقه‌م و طبعاً درکم از داستان، امتیاز می‌دم."}, {"Review": "Le storie dei cantiNei giorni antichi il canto crea il mondo, la prima età è una remota melodia e il momento mitopoioetico e cosmogonico un coro di voci, dove Ilùvatar e gli Ainur rendono luce al mondo con la musica e il pensiero, e danno origine ai primogeniti, gli Elfi, e i successivi, gli Uomini. Ed ecco allora staccarsi dissonante una voce antagonista, che ripete uniformi note e procede in un dettato solitario: abbiamo Melkor, l'avversario, il nero nemico del mondo. Le fonti dell'opera sono plurime, poesie, annali, storie orali, a volte discrepanti, contraddittorie, sempre in rielaborazione. Si narra così dei Silmaril, le preziose pietre che discendono dagli alberi di Valinor, e i viaggi, le scelte, le cadute, le rivincite, le disavventure dei Quendi in Arda. Tolkien descrive in una scenografia fatale la tensione tra potere creativo e desiderio di possesso, la bellezza contro la volontà, l'antitesi dell'essere rispecchiato nell'avere, tutto ciò a formare un'epos di incantevole e indimenticabile semplicità e potenza. Il lettore viene catturato da un'ininterrotta invenzione di linguaggi poetici e multiformi, di terre fantastiche e immaginarie, di filosofici contrasti tra epoche storiche e avventure individuali. Le mutevoli vicende costituiscono una sorta di storia sacra nella quale i sentimenti umani primari incontrano le simboliche manifestazioni del tempo: amore, speranza, virtù, coraggio e malinconia, invidia, tradimento, morte rappresentano il mescolarsi universale di rapsodici ed eterni destini.“Immortali erano gli Elfi, e la loro sapienza cresceva di era in era, e né malattia né pestilenza arrecavano loro morte. I loro corpi invero erano della sostanza della Terra, sì che potevano venir distrutti; e in quei giorni erano più simili ai corpi degli Uomini, poiché non erano stati ancora abitati così a lungo dal fuoco del loro spirito, che con l'andar del tempo li consuma di dentro. Gli Uomini invece erano più fragili, più fatalmente uccisi da armi o incidenti, e meno facile ne era la guarigione; erano soggetti alla malattia e a molti morbi, e invecchiavano e morivano. Non sanno gli Elfi che cosa ne sia dei loro spiriti dopo il decesso. V'è chi dice che vadano nelle aule di Mandos; ma il loro luogo di attesa quivi non è lo stesso degli Elfi e, sotto Ilùvatar, Mandos solo, e con lui Manwë, conoscono dove vanno dopo il tempo della radunanza in quelle silenziose aule presso il Mare Esterno. Nessuno è mai tornato dalle case dei morti, con l'unica eccezione di Beren figlio di Barahir, la cui mano aveva toccato il Silmaril; ma in seguito egli mai parlò con Uomini mortali. Può essere che, dopo il decesso, il fato degli Uomini non sia nelle mani dei Valar, né tutto è stato predetto, nella Musica degli Ainur”."}, {"Review": "This book was probably not the way to be introduced to the LotR world. I'd never seen any of the animated movies. The new movies hadn't come out yet. I'd never even picked up any of the books. Then this book was assigned as part of the course I was taking. The prolgue about the creation of the world was beautiful and amazing. And it fooled me into think the rest of the book would be just as good. Parts of it read like the Bible. \"And so-and-so begot so-and-so. And so-and-so...\"The rest of it was dry, dull and hard to slag through. Maybe if I had read the other novels first I might have enjoyed this one. When I read it I hated every moment, every word of it. I could care less about Feanor and his struggles. I have no clue why it's still on my bookshelf. Maybe I'll pick it back up one day and change my mind about it. "}], "Image": "https://images.gr-assets.com/books/1336502583l/7332.jpg", "Desc": "The story of the creation of the world and of the First Age, this is the ancient drama to which the characters in The Lord of the Rings look back and in whose events some of them, such as Elrond and Galadriel, took part. The three Silmarils were jewels created by Fëanor, most gifted of the Elves. Within them was imprisoned the Light of the Two Trees of Valinor before the Trees themselves were destroyed by Morgoth, the first Dark Lord. Thereafter, the unsullied Light of Valinor lived on only in the Silmarils, but they were seized by Morgoth and set in his crown, which was guarded in the impenetrable fortress of Angband in the north of Middle-earth. The Silmarillion is the history of the rebellion of Fëanor and his kindred against the gods, their exile from Valinor and return to Middle-earth, and their war, hopeless despite all their heroism, against the great Enemy."}