{"Name": "Echoes of Fire", "Image": "https://images.gr-assets.com/books/1534691494l/40380446.jpg", "Reviews": [{"Review": "5 Gazillion StarsI'm a little torn on how exactly to review this...I don't want to be so heavy on the gush that I give people unreasonably high expectations, leading them to subsequently not love this as much as I did...But alas, at the end of the day, I can only be true to my own feels.And, as per my favorite scene in the new Jumanji movie (if you haven't seen it yet, go...go now), says...Yas, Queen!AKA, yas, Suzanne Wright!I've said it before, I'll say it again...I am 100% biased when it comes to this author. But, what can I say?I love her stories, her writing style, her characters. Everything. ALL the things. I have literally read everything Wright has written and this series and the series from which it was spun (The Phoenix Pack series) are some of my favorite PNR series of all time. Her Dark in You series is probably legit my favorite PNR series......ever. That said, in the author notes at the end of this book, Wright mentions that she wrote this at the same time as Embers (the most recent Dark in You release).And it showed.In the best way possible. The whole time I was reading it, I couldn't help but think that Bracken was...edgier...darker...more intense somehow than previous male leads of the series. When I saw that she had written this hand in hand with Embers, it totally made sense...it was like Bracken had a little bit of Knox in him. Which - being that Knox is my number one book husband - was scrumptious. This book followed the Wright pack book formula to a certain extent...but it also didn't. Which was awesome. The way Bracken and Madisyn come together is completely different than any previous book...the way their \"mating\" comes about is completely different...All in great ways. Also notable, this book apparently takes place a little bit longer after the previous books than other past installments. Some stuff has happened between this book and the last that greatly affected Bracken and the landscape of the series in some way.All of which, again, was great. Fans of the series will love this book and I can't wait for you all to get your hands on it so we can gush together. Or so you can throw proverbial tomatoes at me for leading you astray. But whatver. This book rocked. And I'm already reading it again. And, how about that cover? *drool*\n\n\n\n"}, {"Review": "5 Pretty Kitty Stars\nLet me start this review by stating that I am a die hard Suzanne Wright fangirl. She is one of my favorite paranormal romance authors. She always gives me what I want in a book. Now that being said I wasn't super excited about Bracken's book. I didn't dislike Bracken or anything he just didn't stand out to me in previous books. So going into this read, being a Suzanne Wright book I figured I would like it, but didn't plan on loving it. OMG I Freaking loved it. Bracken blew me away. Who knew Bracken would be a yummy, sexy talking, panty melting beast? \nBracken Slater totally wowed me. He was super sexy, protective, a little damaged and at times dark, but still sweet. He also kicked major ass all over this book. Losing his whole family has changed him forever. I love that he not only fought his demons, but that he was open and honest about them to Madisyn. He had me madly in love with him 2 chapters in. Madisyn was perfect for Bracken. I love how Suzanne Wright takes these animals I know little to nothing about makes them her shifters. She shines a light on these unique and endearing animals and writes some of the cutest, kick ass, shifters I have ever read. Madisyn was no exception. She was a Pallas Cat, which I had never heard of till this book. A number of Youtube videos later and I'm in love with the cute little pallas cat. I love how Madisyn was strong but didn't stomp all over Bracken's fears or let him rule her. God but I loved her sass. And to say she kicked ass would be an understatement. She was amazing heroine. I think I have a bit of a girl crush.\nBracken and Madisyn were burning up my kindle. They had a smokin' hot connection and like I said up top Bracken was a beast. Smexy time had me feeling hot flashes. I enjoyed the plot very much, and I always love getting to read about my favorite couples from past books. This book had me cracking up from the start to finish. I mean cackling like a mad woman. I loved this book, I love this series, I love all of Suzanne Wright's other series and I just love Suzanne Wright. If you have never read any of her books you should give it a try!\n\nhttps://jessicasoverthetopbookobsessi..."}, {"Review": "5 starsReview now posted 12/12/18Do any of you save chocolate or a good bottle of wine(whiskey) for a time when you'll really need it? I do. I also tend to do it with books. I do it so much with books that if they were actual physical copies and not ebooks I'd be on an episode of Hoarders. If ebooks were not invented I think my probable cause of death would have been \"Accidentally buried alive under avalanche of books in her home\".I hoarded this book too. I pre-ordered it and then I requested at NetGalley and then spend weeks looking at it on my kindle app with my brain doing a fair impression of Gollum whispering \"My precious\" every so often while simultaneously thinking that I must save it for a truly, rainy day. I couldn't hold out anymore, I caved and here I am after reading and loving it, my book slump feelings gone and my need for a good book satisfied. I knew Suzanne Wright would do the trick.See, the brilliant Suzanne Wright took a pallas cat and mated it with a wolf and it was wonderful! I said it before the woman can make awesome mates out of anything. If she decides to mate a flamingo and a wolf I'll still read it and love it.Madisyn Drake is a lone shifter. After being orphaned and shipped around she finally finds a place at the shelter along with Makenna. If you have been reading this series and Phoenix Pack you'll remember Makenna as Ryan's mate. (If you haven't please go read the first book from the Phoenix Pack series, trust me, you are missing out!) After teasing us in the previous books we find out pretty early on that Madisyn is a pallas cat shifter. They are cute and fluffy and absolutely vicious.Bracken Slater, an enforcer in the Mercury Pack has been through hell. He lost his entire family including his baby nephew in an extremist attack. The book picks up after some time has passed. He is still dealing with grief and guilt but not to an extreme level. Everyone in the pack is concerned for him and rallies around him but he feels lost and contemplates roaming for a while.By chance he's called to pick up Madisyn following an altercation of hers at a shifter bar. Though the two of them aren't chummy,they are attracted to each other and Bracken appreciates that Madisyn still treats him the same way she did before the tragedy. With goodnatured sass, zingers and lots of bitchiness.\n\"Someone ate a full bowl of Bitch Flakes this morning.\"\"Dude, I ate two.\"[...]\"I've eaten chicken breasts that were bigger than your tits.\"\"And I've worn heels that are longer than the dick you appear to be packing.\"\nAlbeit, a tiny part of the bitchiness is down to Madisyn being touch-hungry and irritated and in pain with it. When Bracken realizes, he takes it up on himself to help but soon loses control and brands her. He decides he's through ignoring his attraction to her and he will be the only one satisfying her from then on.There was not a thing that I did not enjoy in this book. Not a single moment where I thought \"Why can't the nincompoop open his mouth and say it?\" or \"My God, why are you so stupid!\". None of that. There was not a word out of place. I loved all of it start to finish. SW has this winning formula she follows and I'm a sucker for it. I loved that we didn't have to wait ages for them to realise they are mates. Their relationship was build with honesty and communication. And of course scorching hot sexy times. The dirty talking hit epic levels and sealed the 5 stars from me. The Mercury Pack embraced Madisyn and made her feel welcome, well mostly. And almost unbelievably Greta wasn't annoying. SW build a world I have completely fallen in love with. She created these two packs and made them into family. \n\"A family who argues but resolves any conflicts. A family who supports each other and works as a unit to keep it strong.\"\nA family I can't stop reading about. And as long as she writes about them I'll keep reading. I want to read about all their kids growing up and finding mates. Cain and Cassidy, and Harleys cousins! If you love paranormal romance and shifters, then this is the author for you.Prior to reading29/10/18Omg!Omg!Omg! I got approved for an ARC!**ARC kindly provided by Montlake Romance via NetGalley in exchange for an honest review. "}, {"Review": "NOW LIVE!Amazon US * Amazon UKIf anyone ever asks me for a PNR recommendation Suzanne Wright is always my answer because I am obsessed with her shifter series. Every book just sucks me in to this world as if I'm living with the Packs, and it is an amazing experience. Echoes of Fire was no different and I instantly felt connected to the characters from page one. It's crazy how realistic Ms. Wright can make her books feel and yet it's the most unrealistic genre's out there. When she started bringing in different types of shifter's into her books I was a little apprehensive since wolf shifters are my go-to reads and what I like the most. But after reading this book I am firmly on the different-breed's side. Pallas cats are bad ass and definitely hold their own against the wolf shifters. Bracken surprised me only because his character was so different in his own book than when we were first introduced to him. But the changes were completely understandable and I loved the emotions he brought to the story. Dealing with such a tragic loss was really hard on him and I was so happy to Madisyn with him when he needed someone like her the most. She didn't coddle him or try to pity him in anyway, instead she just acted like things were normal and as the book moved along the change in Bracken because of that was evident. I loved these two together and also I just have to say Madisyn is one of my favorite heroine from this author. She was crazy and bad ass and a complete loon sometimes but it was so fun to read about. Hands down, one of my favorite stories from this author and one I can't wait to re-read. ARC kindly provided in exchange for an honest review."}, {"Review": "I am so in love with this \"Mercury Pack\" and the \"Phoenix Pack\" series, that I am actually scared they will come to end one day ... I think I literally screamed when this one landed on my kindle :PAs much as I want to read Dominic's story, I was also very curious about Bracken...especially since we found out in the last book what happened to his family. My heart broke for the big dude...Thankfully there is this awesome feline around, who is making him feel like himself again...Madysin and Bracken have been bantering together for a very long time and both of them are shocked when in a moment of vulnerability they find out, they are actually true mates...I love Suzanne Wright's heroines...they are strong and awesome and I definitely had a little girl crush on Madisyn. Damn.. but she kicked some ass !!! Thankfully the men in these series also love strong women, and so even though they are very protective...they are also very supportive ;)I would not advise anyone, to read these books as stand alone's. All the characters are reoccurring and the two series also cross over. Take my advice and read them in order...all of them, you won't be sorry.I for one can't wait until the next one comes out... I am greedy like that :P\n\n\nMy reviews are posted on Wendy's Wycked Words\n\n\nFollow me  \n\n\n\n\nMy reviews are posted on DirtyBooksObsession\n\n\n\n"}, {"Review": "\n“I won’t be pushed away,” \nEchoes of Fire is the fourth book in The Mercury Pack Series. As each shifter meets his mate, I get more enthralled with this wonderful world! Madisyn Drake and Bracken Slater are like oil and water OR fire and gasoline. They have known each other for a while and yet neither had any idea that they were mates. When Madisyn finds herself in a heated situation it is broody and overbearing Brack that lands himself in the middle of her mess. It is in the middle of the mess that they discover that they are mates. Although the two are complete opposites, the passion and intensity of the mating bond become too much for either to run away from. When Brack and Madisyn give into the bond, they become an unstoppable force. \n“I’ll want everything from you. Actually, that’s a lie. I’ll demand it.” \n Told in multiple POV, Echoes of Fire is another stunning addition to the Mercury Pack Series. Suzanne Wright is a Master Storyteller and everytime another shifter finds his mate, I am always ready and waiting to read. With action, suspense, passion, and complex characters, Echoes of Fire is an absolute must-read for anyone who enjoys a smoking hot paranormal romance! *ARC graciously provided via Netgalley in exchange for an honest review!For more reviews/reveals/giveaways visit:"}, {"Review": "ARC received in exchange for an honest review.It's no secret that I'm this author's fan. I adore her PNR books, from great plots to great characters. It's a full package. So when I had the chance to get my hands on this book, I was stoked. I knew I was in for a treat. And once I started reading the story, I simply couldn't put it down. I even believe I finished it in one sitting. And if that doesn't convince you to read this book, the characters sure will. I adored both main characters and of course also the characters from previous books. There was no unnecessary drama between Madisyn and Bracken. They knew where they stood as individuals and what they had to do to make their relationship work. Both had to overcome their past demons and there were ups and downs, like in any other normal relationship and that's what made me fall in love with them. Their love was believable, since they didn't rush things and thankfully you didn't get the insta-love that is so common in PNR books. Sure, at times it's fun to read about that type of love but for this story I don't believe it would've worked. As per usual, you also get a healthy dose of action, so there's no chance for boredom. All in all, this is a nice addition to The Mercury Pack series."}, {"Review": "Suzanne Wright has a unique way of writing real, flawed characters in a genre where nothing is real and once again she excelled at it with Echoes of Fire.Madisyn is a take-no-prisoners Pallas Cat shifter. I’m not familiar with cat breeds so had to google it and SW puts a whole new spin on cute, yet evil when challenged with Madisyn. I’m totally fan-girling on Madisyn, I so want to be her when I grow up. She’s strong, feisty, quirky ,and has no filter. None whatsoever! I laughed so hard at the stuff that came out of her mouth. She’s a lone shifter and so, is not a fan of people getting too close. And this is where SW nailed this story for me, nothing was rushed. Instead SW gave Madisyn a mate that was struggling to cope in a world where he had pretty much lost everything when his family was killed in an earlier book. Bracken is everything Madisyn didn’t even know she needed. Be still my beating heart! Bracken is cold and closed off, simply existing in a world he doesn’t want to be in until BAM! He recognises Madisyn is his mate and …. Let the fun begin.I loved that they both accepted their fate and worked TOGETHER at a pace Madisyn needed. Yes, Bracken is an OTT possessive and protective alpha male yet he understood what Madisyn needed and he gave it to her. Can you say swoon?!Wolf shifters have always been my go to paranormal read but …. but … Pallas Cats! Love that SW introduces different shifters into this series and hands down, Pallas Cats are my new favourite!Arc provided by Netgalley for review."}, {"Review": "Bracken Slater, wolf shifter and enforcer within the Mercury pack. Bracken hasn't been the same since the anti-shifter extremists gunned down his family at the drive-in. He has made a name for himself when he went after every extremist involved and took out his revenge. Madisyn Drake, pallas cat shifter with no pack, works at the lone shifter shelter. Madisyn helps hide lone shifters into a new home when needed. When the alpha from a bear clan sent people to find out where she hid a bear shifter named Daisy that he meant to kidnap into his clan, Madisyn's life is threatened when she refuses to give up Daisy's location.Bracken and Madisyn have known each other for a few years. While they are both attracted to each other, nothing has ever come of the attraction until Madisyn was threatened and Bracken's wolf urges him to protect. I like how the author brought us a mate story where the couple didn't fight the pull and yet still gave us a slow burn love. Bracken knows he's still messed up over his family. Madisyn's shifter nature has a natural independence and struggles with trust. Due to this, Bracken knows he must move slowly but that doesn't stop him from staking his claim immediately. This book provided a lot I love and enjoy in my books. The protective and possessive alpha, the independent and sassy heroine, and side characters that add to the overall storyline. I'm enjoying this series and look forward to the next couple. "}, {"Review": "Well well well, Madisyn certainly is my favorite heroine from Mercury and Phoenix Pack series!That’s right ❤️❤️❤️And who will thought the always happy go lucky Bracken will end up like this.Bu do me a favor, please read Wild Hunger, The Phoenix Pack series first after you’ve read Zander’s book before reading this book.Perhaps, only few sentences, but you will found the tragedy which hit Bracken and his family there.Poor guy and I love it to see he got the best heroine in the series!Pallas cat, never heard about that manic fluffy cat before 😂Aaaaand lurve it!"}, {"Review": "Holy effing shit!!!! I couldn’t love it more!! It was just enough of the typical Suzanne Wright style, but different enough that it felt fresh, new, and unbelievably AWESOME! These characters are EVERYTHING! I’ve said this before, but it bears repeating.....this author could write a thousand books in this series and I’d read every single one.The formula simply works. The overbearing alpha male, who finds his equally alpha badass mate is obviously my kryptonite, because these books make me go weak in the knees. This one in particular because I loved the main characters so much. Not to mention, Pallas cat. Oh my god, seriously the cutest thing ever! And she’s freaking amazing! Gah!! I loved it so, so much. Madisyn and Bracken were everything!As always, the audiobook is perfection! Jill Redfield embodies this character so well.Overall, another stellar read from one of absolute favorite series EVER!!!!"}, {"Review": "⭐️ 3.75 ⭐️This book is very complicated for me to review. I have a lot of mixed feelings about it. Let’s start with the good stuff!I LOVED how protective Bracken was over Madisyn. I also LOVED how possessive and needy he was. Heroes like that are my guilty pleasure. When those two came together, they worked so well together. They fit each other’s lives so naturally and perfectly, it felt like they were both a half of a puzzle and together they created the perfect picture. They simply GOT one another and it was really heartwarming to read about. I also loved both of this characters journey’s, each one of them overcoming their fears and hung ups ❤️Now the less good stuff 🤭Knowing they knew each other for YEARS, and never were in each other radar was a let down. How they couldn’t recognize they were mates for YEARS? If they knew each other only for a few months, I would have felt a lot better. But knowing each other for years while not paying each other much attention besides bickering (while Madisyn ‘pinning’ a little for him), and sleeping with others, and worse - Bracken pursing another female while Madisyn was RIGHT THERE .... no matter how much the author tried to convince me it meant nothing, and that he wanted Madisyn for her and not because of the bond, throughout the book there was still a tiny part in the back of my head that prevented me from fully buying it. 🤷🏼‍♀️So as you can see, when I tried not to think about it, I truly enjoyed this couple. But when the thought crossed my mind, I would find it hard to let it go for a little while. SWE. OW drama.\n“ARC provided by netgalley in exchange for an honest review”\n"}, {"Review": "Madisyn and Bracken have known each other for quite some time. They find each other to be quite annoying. Until the touch-hunger becomes too much for Madisyn and Bracken is there to witness her pain. When one thing leads to another, ending with an unconscious Bracken, suddenly they realize they are fated mates. Simple, right? Except Madisyn is questioning Brackens desire to mate with her just as I was. How could a couple who are fated to be together not recognize it for years and then suddenly, bam. When Madisyn agrees to give Bracken and their relationship a chance, they actually end up working out quite well. Thoughts and feelings from the past are brought into the light and the lack of recognition is soon understood. Not sure if I completely bought the whole set up, but I’m a lenient reader and accepted it for what it was and moved on. In doing so, I found this to be another great story to add to the other books in this series.Bracken is another wonderful alpha hero and I loved his need to protect what is his. Add in his own struggles from the past and I was a goner for him. Madisyn is a feisty, tough, independent heroine who prefers to be alone. Watching her change into a character that accepted the presence of the pack warmed me. After all, in my opinion, friends and family are everything.This definitely had some intense action scenes along with a steam factor that was beyond sizzling. When this couple get together things are HOT. My Kindle may not ever recover. I voluntarily read and reviewed an advanced copy of this book provided by NetGalley and Montlake. All thoughts and opinions are my own.Dual POVSafe (view spoiler)[some ow drama – woman wants the H as a bed partner and as a bodyguard and refuses to give him up – H never had a relationship with her and never gave her any indication he would; before the H experienced a traumatic event, he was pursuing another woman but they did not date nor have any kind of physical interaction – this caused some issues between the couple due to another pack member trying to get the H back with this ow; H is not made out to be a manwhore and there really is nothing said about his bed partners at any time except that he once had a threesome (hide spoiler)]Triggers (view spoiler)[death of an infant; violence (hide spoiler)]"}, {"Review": "So this is another instalment for the Mercury Pack, the pack under Nick and Shaya. To be honest, I didn't like Nick & Shaya's book and they annoy me as a couple (more than likely because I didn't like their book) but everyone else's book within this pack has been an enjoyable read. Including this one!I liked both these characters. Bracken has lost his whole family and has pretty much cut himself off emotionally from everyone in his pack. Madisyn is a bit of a loner and with trust issues but she seems to be the only one who doesn't pander to Bracken and treat him like he's broken. The two of them have kind of been on each other's radars, but not at the same time (if that makes sense) and the way they get together isn't the pretty, sweet, romantic tale of love at first sight, but I think that's what made it work for me. I also liked how willing Bracken was to take things as slow as Madisyn was comfortable with, building a solid foundation between the two that made their HEA more believable. At times I felt Madisyn & Bracken's story got pushed to the background in favour of other characters and their stories, but I still really enjoyed it. And even though I'm not a cat person, I googled pallas's cat and I didn't think anything could get cuter than Harley's margay cat...but I was wrong :)"}, {"Review": "4.5 smartass shifter smut starsI love Suzanne Wright’s PNR series and was so excited to go back into her shifter world as we’re back once again with the Mercury Pack. And as expected, this is a fun, fast-paced read with laugh-out-loud banter and ribbing, great action and intrigue, and a super-sexy, functional and emotional love story. Bracken and Madisyn’s story is lots of fun and I loved it!Bracken is an enforcer with the Mercury Pack. He’s a big, badass wolf shifter, but he’s understandably struggling with the violent and devastating murder of his family, still raging with anger and grief and feelings of hopelessness for his inability to protect those dearest to him. \n“Lie to me, and tell me I’m not totally fucked up.”\nMadisyn is a pallas cat shifter (yes, I had to google what a pallas cat is – very badass in their own right!). She works both at the shifter shelter that has been a part of previous books, and at one of the bars owned by the Mercury Pack, and though she and Bracken know each other, they’ve never really spent time together or gotten to know each other. But put two strong-willed, smart-mouthed shifters together and, with Suzanne Wright, you know you’re in for a great ride!\n“Someone ate a full bowl of Bitch Flakes this morning.”“Dude, I ate two.”… “I’ve eaten chicken breasts that were bigger than your tits.”“And I’ve worn heels that are longer than the dick you appear to be packing.”\nBut there is something between them. And when Madisyn is attacked and Bracken is dragged into the unfolding drama, one moment with their walls down is all it takes for them to recognise the other as their true mates, and from then it’s all on!\n“Kiss me, Madisyn.”“I need space—““And you’ll get it.” For a few hours anyway. “I’m leaving right now. But I want a kiss first.”“You want a lot of things from me.”He shook his head. “No, baby. I want everything.”\nI LOVE the mythology of this world! Each shifter has a true mate – the one person that is destined for them. Of course they can fall in love with others, but there will never be anyone more perfect for them than their true mate. And that bond is accepted and respected by all. So when Bracken and Madisyn recognise that in each other, it’s life changing. But they’re both very realistic about what it means for them.\n“You’re no coward. Which is a good thing, because you’re in for a rough ride.” He honestly felt sorry for her. She blinked, unsure if he meant that in a sexual sense. Her libido sure hoped so. “Excuse me?”“Look at me, Madisyn. Take a good long look. I’m a fucking wreck. Barely functioning. How do you think I’ll handle having a mate? I’ll tell you.” He leaned forward, pressing his body against hers. “I’ll want everything from you. Actually, that’s a lie. I’ll demand it.”“Fate didn’t just pair us up like a meddling matchmaker. Your soul is the other half of mine, just as mine is the other half of yours. It’s as simple and as complicated as that.”\nOne of the things I love best about this series is that the love stories are so freaking functional! The couples talk about their issues, they’re open with what they’re feeling, how their actions impact on each other (and their animal counterparts), and they deal with it. It’s so incredibly refreshing, and Bracken and Madisyn are no different. Bracken acknowledges that he has issues, Madisyn admits that she needs more than a mythical bond to join them together – she wants love, and the prospect of living in a pack after being alone for so long is also very daunting for her. They have things to work through, but they do just that – they work with it, and they honestly work to build something together and it’s just awesome!\n“I won’t be pushed away,” Bracken warned. “I won’t be kept at a distance. I won’t tolerate walls or barriers – not just because I won’t allow there to be anything standing between us, but because you don’t need to protect yourself from me. You hear me, Madisyn? I’ll move at your pace, but you have to let me in. You have to get used to not being alone anymore.”\nBut while they are finding their way forward together, Madisyn is being targeted by a local bear shifter clan, and there’s another shifter who has her sights set on Bracken. They are in a dangerous situation, but they have the support of their pack, and the stage is set for an exciting ride.I love this book. It’s fun and funny with a nice amount of action and a sexy (slightly filthy) romance that is just gorgeous. The audiobook is once again narrated by Jill Redfield, and she’s fantastic, doing a great job in bringing this whole world to life. I’m excited for more from this series!4.5 stars.An Advanced Review Copy was generously provided by the author via NetGalley in exchange for an honest review.\n"}, {"Review": "Oh my this is an easy five for me because I'm just loving the Mercury Pack stories. With this book not only do we get a hot shifter romance but I loved that Madisyn was part of the sanctuary caring for young lone shifters that we read about several books back . Plus she's a rare feline that until reading this I'd never even heard of . NowI'm even more in awe because the obvious research and attention to detail really helped to bring everything to life as we learn just how tenacious Madisyn really is.Now don't worry this isn't a one sided story and our hero Bracken was a total surprise to this reader. If blunt he hadn't really make much of an impact on me before but this time he's larger than life and twice as dangerous. Plus he has such a sad backstory dragging him down that honestly would melt the hardest heart. Great plot, amazing characters and such a steamy read all goes together to make this book a dream to read and I hope this series never ends !This voluntary take is of a copy I requested from Netgalley and my thoughts and comments are honest and I believe fair "}, {"Review": "This was a great read, sooo... enjoyable in lots of ways. I love PNR, but especially if it includes some hot sex.Madisyn Drake is a rare breed of cat shifter…a loner, unpredictably wild, and emotionally distant. A recent betrayal has left her ready to sharpen her claws on the next man she sees…Bracken Slater a prowling wolf with steel-gray eyes and a brooding dark edge.Convincing her that they’re meant for each other is going to take more than branding Madisyn’s beautiful neck. She’s not interested in joining an unfamiliar pack, much less answering to an alpha. But when threats from both their pasts take shape, their unexpected destiny may be the only thing that can save them."}, {"Review": "The fourth book in the Mercury Pack series is a thrilling read that draws readers in and refuses to let go. Madisyn and Bracken are strong, bold characters that really stand out and grab attention and the chemistry that burns between is electrical. The relationship between is rocky from start to finish and quite entertaining as they struggle through it. Readers can’t help but get caught up in all the upheaval that occurs emotionally between Madisyn and Bracken as readers can easily understand their motivations which it makes it difficult to open their hearts. The couple exchange some witty dialogue, some feisty debates, some sweet heart moments and lots of sizzling attraction and red hot passion during their journey to reach their happily ever after.But the tangled emotions of this relationship is not the only thing that makes it interesting, threats from their past add thrilling danger, intriguing suspense and adrenaline pumping excitement. The plot is fast paced and flows smoothly which along with the author’s ability to bring stories to vivid life, makes it easy for readers to become so caught up in the story that they lose track of time. The character interactions of this series and The Phoenix Pack series are one of family, loyalty, understanding and the struggle to survive and fit in which makes it easy for readers to connect with the them and also invites readers into their lives, so readers really can’t get enough of this fascinating world."}, {"Review": "I got to say, for the title, “Echoes of Fire,” there was little of fire reference to this story. There were small snippets of our leading character setting fires as a younger shifter, but other than that nothing became of it. It was background history that maybe came up only two or three times. The whole thing was maybe a combine paragraph. It’s interesting that she would title this book as so. Another oddity about this book is that if you look at the cover - audible gives a closer and clear image of it - the character’s eyes are almost amber/pale yellow eyes. But in the description the leading male character is clearly stated to have “Steel-grey” eyes. Huh? This is the third time (or maybe more) I found things of this nature in Wright’s books. -\t“Blaze” The beginning scene is a robbery where the leading character knocks a loaded gun away - on the street in and in an ally - only to leave without having another thought about the gun or who might pick it up.-\t“Fierce Obsessions” The leading female character is a bird shifter and at her family reunion they all have chicken to eat.-\t“Savage Urges” That cover doesn’t fit the description or image that I had of that character. I can understand small things but this was like the totally complete opposite of what I came up with. The character was supposed to be intimidating. That guy... the one on the cover... he looks more feminine than the girl on it.As for this book, don’t get me wrong, I’m usually grateful to find a new book released from this author. She’s one of my hate to love self published authors that I’ll actually admit to liking. It just seems that these books are getting redundant? Maybe a little bit of the same plot structure? Predictable? Sure there are different character match ups but the pairing couple seems to always be pretty much the same character pair as the last ones. The only books I can honestly remember, and like, are Taryn, Roni, and Ally. All the other couples I vaguely remember what’s different about them. Also, the whole shelter for lone shifter plot to me seems to be getting a bit old. I would love to see a fresh new angle to this series. Like perhaps the Phoenix or Mercury pack could get an unexpected shifter seeking help from the movement because extremist or shifters are after her and they killed her mate. A mate that was imprinted on and her real true mate is one of the pack, like Eli or Dominic. Something like that. Anything. Overall, it took longer than I liked to get into this book. The chemistry wasn’t really there between these characters until much later despite the fact that they were doing it for a while before hand. I just couldn’t mesh with these characters. Later I feel the story came together, but than the usual “the other skank female who also wants him even though she knows he’s mated”, “the someone who doesn’t think they should mate each other”, “the repeated ‘Baby’ endearment during sex that every character from every book in both series calls their female counterpart repeatedly”, and “the one leading character’s dyeing scene” at the end only to be revived just in time is getting a bit old and unimaginative. Just my thoughts there. Otherwise the story was a good go to for when finding any other book to read is becoming harder and impossible to find. I’m running out of books that are interesting and I believe it’s making me cynical and testy. I only hope that Wright can bring new life into a series that has kept me reading throughout the years."}, {"Review": "Wright hasn't lost her touch, Madisyn and Bracken are fab characters and I liked the fact there isn't any unnecessary drama between the two. Madisyn in particular I loved, she is fierce and the animal she shifts into a perfect reflection of her.Filled with action, a good amount of ass kicking and steam this is another welcome addition to the series. The tone of this is slightly different to what has come before but it works. Again, secondary characters that add to the enjoyment of the story, I particularly liked the scenes involving the kids (Willow and Cassidy). Received an ARC from NetGalley yesterday and didn't sleep until I had finished."}, {"Review": "Following the same formula of the other books in the series, this one focuses on Madisyn, lone cat shifter who works at the shifter bar where Bracken, wolf shifter of the Mercury pack, also works security.The two had been eyeing each other for a while, but Bracken is struggling with the trauma of losing his whole family while being helpless to do anything about it, so nothing happens between them. That is until Madisyn gets in trouble for keeping the location of one of the loners of the sanctuary she also works for that she helped relocate, a secret from bear shifters with nefarious purposes.The two end up in a perilous situation together and realize they're true mates, and Bracken is determined to do everything in his power to keep her safe, while Madisyn is struggling to curb her loner tendencies and let him in her life.The two spend time together getting to know each other and fall in love, slowly facing the issues that are keeping their bond from fully forming. In the meantime they deal with a few bad guys who they have a big battle with towards the end of the book and having defeated them and survived after getting injured and nearly dying, they finally get their happily ever after.Pretty familiar story if you've read any of the previous ones in the series, but enjoyable enough nonetheless.The next book in the series which will come out sometime next summer, will be Dominic's book where he'll finally meet his match according to an excerpt the author posted here.Previous book reviews (including parent series):✦ Lure of Oblivion (Mercury Pack, #3)✦ Force of Temptation (The Mercury Pack, #2)✦ Spiral of Need (The Mercury Pack, #1)✦ Fierce Obsessions (The Phoenix Pack, #6)✦ Savage Urges (The Phoenix Pack, #5)(view spoiler)[✦ Dark Instincts (The Phoenix Pack #4)✦ Carnal Secrets (The Phoenix Pack #3)✦ Wicked Cravings (The Phoenix Pack #2)✦ Feral Sins (The Phoenix Pack #1) (hide spoiler)]"}, {"Review": "4.5 Stars!This book is the continuation of the Mercury Pack series with close ties and lots of cameo from the Phoenix Pack.. I like to read the books in order but you could pick this up as a random PNR and do ok. As part of the series, it made me so happy to see Bracken begin to heal. I loved that Bracken and Madisyn were both a bit quirky in human and animal form. I loved that they really needed to both break down the protective walls they had constructed. These two grew and changed together and we don't often see that in the romance genre. Loved seeing all of the pack again. Enjoyed the bit of suspense in this one. And it was really great to learn more about other shifters in this world. Great addition to the series! *Complimentary copy provided via Netgalley for an honest review. "}, {"Review": "I love this series! Suzanne Wright writes the best characters! They are so funny and so vulnerable at the same time. I have wanted to know Madisyn's story since we first met her. And I had to look up the kind of cat she was (I won't say in case you haven't read the book) but I hadn't heard of the type she is and it's so cute! I love that she's just a bit crazy. Bracken was an ok MC. I understand his issues. and I LOVED how alpha/protective he is. I really don't know why I didn't fall all over him. He is basically the perfect caveman shifter, that I love but he just did nothing for me. I loved him and Madisyn together. They fit perfectly and helped each other with their problems. I will always read everything suzanne writes. Her characters are sassy and make me laugh and I love it!"}, {"Review": "I was kinda nervous to read this because recently, I haven't been enjoying Suzanne Wright's books and they've left me feeling very underwhelmed and disappointed. While that didn't happen with this book and I enjoyed the romance, a part of me felt like these books are following the same formula all her other shifter books have and it's gotten to the point where I get bored because I already know how the story is going to go. I did like that Bracken was a more darker hero and I liked how he wasn't this perfectly healed guy by the end but rather still working towards trying to heal and move on from the tragedy from his past. However, the one thing I wish the author hadn't done is the whole \"I never would've looked at her if she wasn't my mate\" sub plot. It just brought up so much insecurity and it made me question the relationship too because they'd known each other for years and he had zero interest in her until that one fateful night. Suzanne Wright still is my favorite paranormal/shifter romance author and I'm excited to see how she concludes both this series and her Phoenix Pack series this year. "}], "Genre": "Fantasy", "ID": "40380446", "Desc": ""}