{"Name": "Evermore", "Image": "https://images.gr-assets.com/books/1528911123l/37693552.jpg", "Reviews": [{"Review": "I really wish I could say I enjoyed this as much as  Everless. The ending is the strongest part of the book - nicely wrapped-up but with the lingering suggestion that there is more to the story - and yet even that couldn't save it for me.One reviewer pointed out that this book loses the somewhat sci-fi feel of the first book and moves more towards traditional fantasy. This is true. Those who felt so-so about  Everless could enjoy this more, as it does indeed read more like regular YA fantasy. I personally enjoyed this less, though. I’ve read countless fantasy books where a young woman must stop the evil tyrant, whilst accompanied by sexy dude; I didn't need another one.In this sequel, the use of time as currency did not play much of a role in the story. I thought this was a shame, as it was the most interesting aspect of  Everless for me. Holland explored how being able to buy and sell time from your life would affect people, and society at large, which I thought was fascinating. Unlike some other readers, I never saw much similarity between the first book and the movie \"In Time\", aside from a vaguely-similar premise. This book turns its focus to stopping the Sorceress. Most of  Evermore consists of Jules travelling around and having visions, all so that she can locate a weapon that is said to be able to kill the Sorceress. It was a struggle to get through at times. The visions grew repetitive, as did the constant brushing up against Liam and feeling chills/weird feelings that she pretends to ignore.Note to YA fantasy heroines: You're not ignoring it if you keep bringing it up. That's not what ignoring means.I was just really disappointed that the plot veered off, moving the focus off of the concept of a world where time is currency, and more towards the common fantasy aspects of good vs evil and destiny. An unusual - if, admittedly, not original - idea became just another clone for the pile. I even got Snow White vibes with the use of an evil sorceress, a huntsman, and stealing hearts.I could be convinced to return to the world of this series, but I'd like to see the author go back to what made  Everless stand out.Blog | Facebook | Twitter | Instagram | Youtube"}, {"Review": "Ah! This was everything I wanted.First - a special thanks to the publishers for sending me this arc! I recently received some fun goodies such as character cards/etc that I'll be showing off on my Instagram (link below) very soon, so stay tuned! Pst... they are gorgeous!Light spoilers for book one. Beware!I was super excited when this landed in my mail - but also a bit nervous, because I wasn't sure where the story was going. I had such high hopes after L O V I N G the first book. That happens to me often, where I'll get super attached to the first book in a series, and my heart feels like I've leap off the edge of a cliff when I dive into the second. So, naturally, after the whack-you-in-the-face ending of Everless, I was thrilled, and yet... my favorite character tiptoed out the door (not dead, relax). I was nervous he wouldn't even be in this one, or if he was, that he'd be more of a ghost of a character.Dearly beloved, I am gathering you here today to announce that Liam, my dark and broody darling, is a constant presence in these pages. Yes, that's right. He's everywhere. And I'm not complaining. Alright, moving on. We're thrown right back into Jules world head-first, and there isn't much time to catch a breath. Jules has returned to Crofton, against a certain-beautiful-someone-who-I-mentioned-above's wishes. But Jules wants to find Amma, who we briefly met in book one. Except, a very dangerous certain-someone-else is waiting for her. I think you can all guess who. So, our dear Jules is quickly captured and thrown in prison.But see, Jules has friends.I'm not going to spoil anything else, but I can give you little hints of what's to come. Jules needs answers. Even though she knows the truth of her identity, she's just beginning to understand it - and she needs those answers if she's going to defeat the Sorceress. And it isn't just one past life that she has to dig through, it's twelve! Ah! Luckily, our dashing Liam happened to study all things Alchemist-related, so he's able to help. But not for everything. Jules must retrace her former selves to search for clues, and the journey isn't an easy one. SO! You can expect blood, eerie memories, and a mad dash through time. And maybe a little somethin' somethin' else but I'm going to shut up now. What really makes this series stand out for me personally is the super creative magic system. I'll admit that at times I got a tad lost, but it didn't stop me from enjoying it because it was all-too-cool to picture. I loved the cinematic descriptions (oh, dude, this totally should be a movie or TV series).Which brings me to the writing! I love when a book balances on the edge between commercial and lyrical - where the pacing is fast but the writing remains lush. And I'll leave you with that! If you were a fan of Everless and are wondering about the second - I say take the plunge! My Blog ~ Instagram ~ Twitter"}, {"Review": "This review and other non-spoilery reviews can be found @The Book PrescriptionActual Rating: 3.5 stars“The only way to kill pure evil is with pure love”🌟 I wasn’t sure if I was going to continue this series or not, but while I was doing my Edelweiss guide post, I wanted to give an example and thus requested this book. I was approved in literally 10 mins! So I decided to read it after all and I am glad I did!🌟 Now many readers loved book 1 and some didn’t (I though it was like half good, half bad) because it kept being compared to the movie “In Time”. I saw many similarities in book 1 but here is where things start to get interesting, this book was more creative with better world building, better characters and twists. I felt it stands out by its own without depending on that movie or anything.🌟 This had a more fantasy atmosphere than the Sci-fi-ish genre in book 1. I liked the improvements to the magic system and the involved mythology was better too.🌟 The characters were good, and the plot was more interesting, I slept a few times while reading book 1 but not this one and I thought this had a perfect ending too!🌟 I don’t know if the writing improved or if I wasn’t just in the mood while reading book 1 because I think it is pretty much decent in this one. There were a few quotes that made me go “Huh??!” (see an example below). But overall it was good. It’s like—she gestures, searching for the word—“cutting the sky into pieces. No one knows how that magic might change you.”🌟 Summary and Prescription: I think that this book was better in all elements of the story than book 1 and it felt more original than that one too. If you still want to give the story a chance or if you liked book 1 then I can recommend this! I ended up giving it 3.5 out of 5 stars!"}, {"Review": "There's trepidation, fear even, in the ragged breaths we exchange now. There are a hundred small and human ways he could break me. As many in which I could and probably will break him. Maybe that's what love is, maybe there's nothing to do except open my arms to it. And so I open my arms, unafraid of the thundering in his heart The second or last book of the everless series followed the first book's ending. With Jules on the run, she ties together pieces and puzzles to destroy the sorceress. If I have to compare this to a movie it'd be like harry potter's deathly hallows part.1 where the golden trio is trying to find ways to kill voldemort. It's in ways so much better than the first book that it has non stop action and adventure. We discover more mysteries and myth as to why now is what it is. The writing is lovely, it's lush and lyrical. The author wrote the book beautifully and I honestly give her writing a 4.5 out of 5Finding the mystery. Figuring out the puzzle and the pieces to solve the mystery on how to kill the sorceress was fun and stimulating. You can't help but to theorize to what could be it. Though there's not much to say in the character development, I still found Jules' character matures way much more than in the previous book. The only things I don't like is the romance, the ending, and the world buildingI felt that the romance and the ending were both rushed and that the world building was not completely laid out that I don't have a full understanding on how the world works. I feel like there are some gaps that are not filled and that there are still questions left answeredBut overall a very entertaining and solid finale of a debut series "}, {"Review": "\n\n\"Don't you know, Jules? Everything worth doing is dangerous.\"\n\nIt's no secret that Everless was one of my favorite 2018 releases and shouldn't be a surprise that I was prepared to perform dark magic to get my hands on Evermore. Luckily, HarperTeen saved us all from that catastrophe and provided me with an advanced reading copy.Evermore begins with Jules on the run from Caro, still reeling from what she has learned about herself and grappling with her new reality. Jules struggles to choose her next path - flee or fight for the final life she has? Much of this book follows Jules on the run while she searches her past for any way to defeat the sorceress.And of course there is Liam, our dark, dashingly intelligent antihero. I wont lie … Liam Gerling is one of the sole reasons I am here. His character was my favorite from the first book and continues to hold that title through Evermore. Liam enters the book in total Liam style and is by Jules' side for much of the book, to share what he has learned of the Alchemist's life and as a steady companion through all of Jules' searching. And maybe a little something more?Evermore had has plenty of action, the pacing was great, the character arcs were well done and I got the romance I had been pining after. We learn quite a bit about Jules' and Caro's pasts, as well as what fueled the divide between them. Friendship was a large undertone to this story and I was really feeling the emotions near the end! Jules knows Caro is seeking her every weakness, most of all her friends - but its the help of others Jules must be willing to rely upon.While I had hoped it would be as sweeping and mysterious as Everless, Evermore is certainly a worthy sequel and will give you all the answers you seek!I will absolutely be reading more from Sara Holland.Review copy provided by HarperTeen via Edelweiss in exchange for an honest review.Blog | Bookstagram"}, {"Review": "\n**You can also find this review on my blog**\nBuddy read with JuliaA guide on how to throw logic to the dogs and stomp on its bones.Advice #1: Stop making any sense by walking around and telling every stranger you meet that you are an ancient reincarnated magical being called the Alchemist. Sure people will think you are totally sane and would be extremely willing to help you overthrow the queen.“Jules, you’re not making any sense.” Amma lets out a strangled laugh, and I can tell she’s trying for her usual briskness. “Stop this. You can eat and rest, and tell me when you’re feeling better what’s going on.”Advice #2: Stop info-dumping people with overwhelming information. Nobody gives a fuck. “Why are you telling me this?” Amma whispers. It’s the first question that I didn’t see coming, and it makes my breath catch.Advice #3: If you want your twin sister to believe you didn't kill her fiancee and her mother, don't go by telling her they deserved it. You practically confess murder.I swallow the speech I’d prepared for Amma. It’s safer if Ina believes a lie. Summoning an image of Caro, of Ivan, of the interchangeable Gerling faces that stole every blood-iron from my papa’s belt, I twist my face into a mask of anger. “Your mother and the Gerlings ruined my life,” I spit. The old anger swirls in me, awakened by the barbed words on my tongue. “They killed my father just for stepping inside Everless. But only after they couldn’t starve us, along with our entire village.”Advice #4: If you are an evil murderess who wants to hurt her ancient enemy by killing everyone she cares about, it's logical to not let a potential hot abs love interest to live. Right? RIGHT??There was a reason I left Everless without saying more than thank you. I scarcely know Liam—but I scarcely knew Roan either, and Caro still killed him. Too much has passed between Liam and me in the short time we’ve been allies.A hint: She does let him live.Advice #5: If you are the most wanted fugitive in the country, stop giving your name to strangers. For more detail refer to advice #1.“Jules Ember, I don’t suppose?”Advice #6: Stop being a special fucking snowflake!“If I had your abilities—” “You don’t,” I say sharply. “You don’t have my abilities, and you have no idea what it’s like.”Advice #7: Don't go to the places where obviosly you'll be killed on spot.“You’re right—I’ll go back to Everless,” I say, putting intention into the words this time. “If the weapon isn’t there, then there might be some other truth there that will help me defeat her.”Advice #8: Don't say to your love interest that you wish his family was never born... or say it because he's a spinless puppy and will forgive you anyway.“I’m sorry, Jules.” His words are softer, pleading in a way that strikes a different kind of fear into me than Caro ever has. And what’s most frightening—I believe him. “I just can’t let you—can’t stand the thought—” Please don’t finish, I think, because I already know what he wants to say. I can’t stand the thought of losing you. I swallow, blink. The pain and fear in his voice threatens to dissolve my anger. Instead, I crystallize it, turning the anger cold and hard and permanent as stone. “This world would be better off if your family had never existed,” I spit. “None of this would ever have happened.”Final advice: Go kill yourself and save us 300+ pages of reading about your reminiscence and doing nothing but drooling over hot abs and how special you are."}, {"Review": "3.5/5 Stars.Evermoreby Sara Holland3.5/5 out of 5 Stars!This review will contain spoilers!May I just say that both covers of this duology are beyond gorgeous. I mean, if you wouldn't have liked the book(s) I would just look at the covers and it will satisfy me by it gorgeousness.Before I started with 'Evermore' I was already prepared not to get into this with high hopes, because usually I end up being too disappointed with anticipated books lately especially sequels, and this was the case.I will start with the parts I didn't like: - The action started too quickly, from chapter 2 there was already an intense action packed adventure happening, I wasn't a fan of that and I felt the book was a little too rushed, at first. But then it picked up its pace, which was nice.-But in the middle part, there are many lengths and repetitions, especially Jules' Flashbacks and visions. The flashbacks were very confusing to me, at times I didn't know if there were the current events or from Jules's past lives.-This mainly focused on the history between Jules (The Alchemist) and Caro (The Sorceress). There were answers to be found, but it didn’t feel like Jules had a mystery to solve like it did in 'Everless'. Rather, the mystery seemed to be solving itself around her through the happenstance of flashbacks from her previous lives whenever she was in the right place. -The ending was a little rushed. Although, this wasn't the first time I read a rushed ending. Lately, this happens in every last book of a series; the last encounter between the main character and his/her opponent ends too quickly without anyhing intense.Moving on the parts that I did like: -The first book had me hooked, I knew it wasn't the most unique book ever, but stories that involve time related elements always intrigue me. -The romance between Jules and Liam was done perfectly, I loved it, because it wasn't the main focus of the book and amount of it was perfectly used.-The character who really surprised me was Ina: Ina turned out to be a great character, I was not expecting her to become the way she became in 'Evermore'. Meanwhile, I wanted to see more interection between Jules and Ina. The moments between the sisters are very few, but I loved seeing Ina in a new light. -The final encounter of sorceress and alchemist was quite unexpected, though not shocking, but the twist was very well done. Nevertheless I liked how almost everything got explained and wrapped up nicely, but this definitely had a slight open ending. I think, there may be a possibility of a companion novel or better yet a third book because of the notreallybutkindof uncertain ending. Eitherway, I came to like this duology, maybe not as much as I would've hoped for, but it had kept me entertained despite some weaknesses."}, {"Review": "Can I have this book, like, NOW?!!! Why do I have to wait a YEAR for the sequel?!!! I pray to God that I can have an arc soon. A year feels like centuries (pun intended😉)! 2019 can you come already?!😫update (1/16/18): Will this just be a duology? I see potential as a four-book series😍update (6/13/18): HOLY SHIT LOOK AT THAT GORGEOUS COVER I’M CRYING!!!!!😭😭😭update (7/6/18): Okay but, like, THE UK COVER IS ALSO AMAZEBALLS GUYS I NEED BOTH EDITIONS IM DEAD❤️☠️☠️☠️❤️"}, {"Review": " 3.75 / 5 What an ending! I must say, I did not see that coming. And while I do enjoy being stumped and surprised with how authors end their story, I must say that I was a little confused amidst all my surprise. Still. This was a wonderful addition to Everless and I’m actually kind of upset that it’s over!Just like in book one, I enjoyed Jules’s perspective as she continued her journey with the realization that she's the Alchemist (this isn’t a spoiler — it's revealed in book one!) from the stories she learned about in her childhood.Now, while that’s all cool and dandy, I started getting confused with all the flashback Jules was having, and it was hard keeping track of the information being thrown at me. Even now I’m trying to piece together the ending—and while I’m sure Holland really tried to make us understand, I feel she just missed the mark. This is the main reason I couldn’t give Evermore 4 full stars as I gave Everless.A big positive was Liam’s role in this book! I loved his presence in book one and loved him even more in this story. He’s probably one of the sweetest book male characters I’ve read about in YA fantasy in some time. That being said, I also wanted to learn more about his background, life, and thoughts, which we never really got.Overall, I flew through this—the story is incredibly captivating—and while there were some bumps and issues I had along the way, I think this is a solid conclusion to the Everless series."}, {"Review": "2 Stars!So Past me, should of listened to future me, I don't know why I continued with the story, apparently it's because I'm a fool who just loved the cover that much. I didn't have expectations going in, Everless was an anticipated read for me and I was let down, and once again I found this even more disappointing that the previous.I'm just going to start off by saying I did enjoy the first few chapters, they were action packed and intense, BUT at the same time things happened so quickly. We get to see the lengths that Caro will go to, to push Jules limits and I was excited to find out what was to come.However moving on from this, things seemed to be repetitive, and in the sense of the flashbacks, they weren't always clear. It kind of just bored me once again. Speaking of other things that I disliked, the thing that drew me in from the start of Everless was the concept of Time is Life was barely touched on which is a shame, because that's one of the things I really enjoyed previously. On another note, the redeeming factor of this for me was Liam, I could see this coming a mile off around page 60, but I still kind of liked it!I'm only going to speak about Jules because I just can't with this character. She is 100% a special snowflake everything she does just winds me up, she's on the run but tells everyone her name, tries to convince her friends/sister she didn't murder the people she cared about yet then lies to her and tells her she did? I'm just over it at this point :) :) :)Everless - 3 StarsEvermore - 2 Stars----------Pre Ramble ThoughtsWhy are these covers so stunning?Like legit even though Everless was meh for me (up until the last few chapters) this makes me want to read it more.Damn cover love."}, {"Review": "*I received an arc from Edelweiss in exchange for an honest review*\"Don’t you know, Jules? Everything worth doing is dangerous.\"What I liked:- Liam's character. I've said it before, but he's basically the only reason I decided to read this sequel.- the final plot twist- Jules and Caro's last fight and their story- Ina and Jules's relationshipWhat I didn't like:- Jules's stupidity (she's not always a dumbass but when she is oh boi does she deserve some bitch slaps)- the writing. It's not bad but there were so many unnecessary (and long) descriptions of palaces, places and dresses. I don't remember if I had the same problem with the first book but it kinda pissed me off here- the flashbacks. I did like the memories they 'told' but sometimes they interrupted the story and it was so annoying.- the romance. Now, hear me out. It's not that I didn't like it, Jules and Liam have amazing chemistry. But in book one they were enemies and Jules refused to trust him. Evemore begins, she trusts him blindly and loves him to the moon and back. I mean, I really hoped to see them having their deserved happy ending but I would have preferred a slower burn.All in all it wasn't a bad sequel, but I liked Everless more."}, {"Review": "I received this ARC in exchange for a fair and honest review.\nWarning: Spoilers for Everless below. \nPicking up exactly where Everless ended, we follow Jules on her escape from the Sorceress since her secret has been revealed that she is the Alchemist. Knowing who she is and that she's lived so many past lives, eleven to be exact, Jules is at quite a disadvantage of not being able to access her memories and abilities, meanwhile her arch enemy Caro has had multiple life times to hone her skills and kill the Alchemist each and every time. But this life is Jules last chance to get it right and figure out how to defeat Caro, or she will leave the place she calls home in the hands of a crazed ruler who will stop at nothing to get her way. Unable to let this be the case, and with the help of Liam, Jules manages to escape Caro's evil clutches more than once and starts a quest to find out how to defeat her.I'll admit, I wasn't very fond of Everless and how the ending felt so rushed. Everything lead up to such a fast conclusion and it felt like it all ended right as it was all finally being revealed. I also wasn't sure at first if there would be a sequel and I'm glad that there was because this book redeemed this duology for me. It was a perfect follow up to the ending that left you in shock from the first book. I needed so much explaining to happen and that is exactly what I got in the second book. Things finally started making sense and I found myself enjoying the characters more because I could finally understand them better. The magic system was sometimes a little confusing but I found that everything managed to clear itself up in Evermore. I also really enjoyed that you get to see a bit more of Sempera in this book because there is a bit of traveling. It doesn't all take place within the castle walls so it feels like it was a faster paced read keeping up with all the different locations Jules manages to pass through on her quest to discover her old memories.Jules was much better in this book as well, still as bullheaded and refusing to do whats best for her, she marches into quite a bit of danger and only manages to get out on sheer luck, So that hasn't changed from the first book. But she does grow quite a bit by the end. And because of that, I learned to like her character a bit more. Although she is so fickle when it comes to Liam, and there were many times where I wanted to scream at her to just let him know how she feels!!! But that kind of suspense is also what had me flipping pages to find out what would happen next and hope that there would be a kiss in the future pagesDear sweet Liam, he is honestly the best thing about these books. I wasn't so sure about him at first when I started Everless. But then it quickly became evident that he was the one who would be the knight in shining armor. If it weren't for Liam, Jules would have no chance of getting out of all the trouble she manages to find. And yet Liam comes to her rescue time and time again. I liked learning about his past more in depth in Evermore. We get to see where he went to school and his friends he made outside of Everless. How he is so smart when it comes to worldly things and how he might know more about Jules' past than even she knows. I think that this book would have been nothing without Liam and I really grew to love his character.Evermore ended up being a great wrap up to Everless. I feel like Holland did her characters and her story justice and tied up all the loose ends very well in this conclusion. I really enjoyed this book much more than the first and felt like without this book the series really is a bit lackluster. But the story was redeemed in book two, and for that I am happy I read this so I can conclude this duololgy on a good note. Its nice when an ending can leave you feeling content with how things happened. I finished this book with all questions answered and a feeling that things happened as they should. I like that in my reading. I want that ending that feels right, and this was it."}, {"Review": "\n“I’m sorry, Jules.” His words are softer, pleading in a way that strikes a different kind of fear into me than (view spoiler)[Caro (hide spoiler)] ever has. And what’s most frightening—I believe him. “I just can’t let you—can’t stand the thought—”Please don’t finish, I think, because I already know what he wants to say. I can’t stand the thought of losing you.\nWhat started as strong, pulse-pounding, and butterfly inducing (literally the beginning is one of the best I’ve read in a LONG time) slowly descended into boring, flat and, frankly, preposterous end. I couldn’t believe that such a strong first book, that lead to an equally strong beginning, if not stronger than book one, was reduced to that.At one point near the end I was like…Is she seriously just going to…appear like that? Like she truly knows, without a doubt, what’s going on? Really?! I laughed. I well and truly laughed-and that was NOT how I wanted the end to a favorite (again, I love first books best!) book to be.It broke my heart, shredded my soul, and made me so utterly sad that I could hardly fathom that that was the end. Like…what? It was SO GOOD up until a certain point, to which I realized, this book is not going to end well. It just couldn’t-but I had hope.And, authors, why tease something over. And over. And OVER again if you aren’t going to capitalize on it. I LIVED for the idea that (view spoiler)[Liam (hide spoiler)] would be in danger because of Jules. I WAS EXCITED ABOUT IT ALL THROUGH 2018 TO THE RELEASE DATE THAT WAS MY BIRTHDAY, no less, TO NOT SEE THIS MOMENT COME TO FRUITION. Why. WHY?! Why play something up and then not capitalize on it?I need salve for my soul, because it was brushed aside and, instead, we got a stupid and unrealistic end between Jules and the ‘villain’. Pfft.#NotPleased. I will always, ALWAYS love book one, though, and the first 30% of this book that had my pulse-pounding and promised so much more. What a waste of romantic peril to the fullest. *Sob*For more of my reviews, please visit:\n \n \n\n \n \n \n \n\n******Omg I didn’t realize this came out on my birthday!!! Happy birthday to me, Happy Birthday to me....Guess I know what I’ll be doing after my bday dinner and such ahaha thank you, Sara Holland! :P"}, {"Review": "For the most part I liked our main character Jules Ember, but some of her decisions werent the smartest. Maybe don't go to a party when someone's hunting you. I understand the main character is impulsive, but thats just plain stupid. Despite liking her I never fully connected with her. She learns a lot about herself during the course of the story and accepts the risk that comes with loving someone, but it never really changes her or her goal to take down the antagonists bloodthirsty hold over the kingdom before everyone she loves is drained of their time. Her complicated relationship with her long lost sister was beautiful. Despite not seeing her sister that often in this book I feel like she had even more character developpement than Jules.It took me a while to warm up to the love interest, especially when he thought about taking her away against her will. Even though the reason might be to protect her I feel like that shows a lack of respect for her and her ability to make her own decisions. We meet a new character named Elias who I really liked. He becomes friends with Jules and helps her hide while she tries to find a weapon strong enough to kill our antagonist. I loved how we got to understand how the antagonist became the way they were without excusing their evil deeds. I love how the author wasnt afraid to kill off some characters, but the tension didnt totally grip me. Thankfully we do get a bit of a mystery with Jules trying to remember clues from her past.I love the concept of time as currency and how it ties back to our world. I also liked the legends of the wicked Alchemist and the benevolent Sorceress. I understood the Alchemist powers, but I never got a good idea of how the Sorceress powers were different. Maybe it was explained in the first book and I just forgot. Besides that the world was easy to understand but because I wasnt a big fan of the writing everything else kind of suffered. The writing didnt flow that well so by the end of the longer sentences Id forget what I was even reading about. This happened so often I found myself having to reread entire paragraphs. I really liked the reveal at the end and how everything wrapped up. I had some idea of how it would end, but not the details.*This book was received for an honest review"}, {"Review": "3 Stars!!  🌟🌟🌟\n“The only way to kill pure evil is with pure love” \nTHIS COVER!!! Can we just stare at it for a minute...I absolutely LOVED Everless. I could not wait to get my hands on this one! Evermore picks up right where Everless left off and we are thrown back into the world. For a few minutes, I got to enjoy why I loved Everless in the first place- but then it all takes a turn. Its like we went from world building in the first book, to character building in the second. We get back stories on Jules and Caro, and see their past relationship through out the ENTIRE book. It felt like I was just reading flashbacks for the most part. The thing I loved about Everless was the whole \"time/blood as currency\"- sadly, there is hardly any of that in this installment. Without the time/blood theme, the book fell flat. I enjoyed seeing Liam in this one, but the romance felt so weird and rushed. In saying all that, there were things I liked about it, and it was a quick read- but I feel a bit let down to be honest. I want to go back to book one and ride that first book wave again."}, {"Review": "Not only was I pleasantly surprised by Everless, the first book in the series but it took my breath away. It was captivating, imaginative and unlike others in the genre. In short, it was hard to put down and even harder to forget about. Which is why when Evermore came out I couldn't wait to sink back into the world that Holland had created.Evermore picks up right where Everless left off, with Jules in mortal peril and reeling from all that she not only learned about her beloved Everless but about herself and those around her as well. Fast paced, action packed and just a hint of romance combined with danger and deceit around every corner and Evermore lived up to Everless and more. This is no sophomore slump and proves that Holland knows what she is doing.Ever bit as captivating and irresistible as Everless, Evermore once again left me eagerly turning the pages devouring every last sentence and being left wanting more.*ARC provided by the publisher in exchange for an honest review.*"}, {"Review": "The digital arc of this book was kindly provided by the publisher via Edelweiss+ website in exchange for an honest review. I really liked Sara Holland's debut novel \"Everless\" so I was excited to read its sequel. And I can say I wasn't disappointed. I'm also very glad it wasn't stretched out into a trilogy and ended up to be a duology instead.What I liked:- The writing was still beautiful and lyrical, I loved it.- The romance, while a bit rushed, was believable enough and just made me warm inside.- Jules' character development continued in this novel and I liked seeing her getting stronger every time.- The ending was quite emotional and suited the overall narrative very well.What I didn't like:- The pacing was a bit too slow for my liking, the middle of the book was especially dragging.- The flashbacks were interesting but there were too many of them and they sometimes interrupted the flow of the plot. "}, {"Review": "What an incredible let down. Color me disappointed.Um. Hi. Hello. It’s me. And I have a lot of thoughts.My poor husband has had to listen to me rant about this book in an extraordinarily cranky tone as I read it. I did make snarky voices and YA jokes that only we fellow readers would understand so hopefully it wasn’t too bad for him. But now I get to share my little cranky reader status with you.So, what didn’t I like about it?Well... the whole thing. Yeah.But more specifically:• where is our badass, independent leading lady from book one? Part of what I loved about book one was that the romance aspect was there, but the storyline wasn’t dependent on it. We got the cutesy stuff, sure, but we also got a gal who could really hold her own. In book two, Jules is saved by Liam one too many times in too short of order for me to be fully convinced of her own capabilities. Look, I love a good hero as much as the next girl. But can’t this character do anything for herself anymore? Where is book 1 Jules?! Where?! I want her back!• everything that made book one appealing, particularly its unique concept, has been thrown out the windowThis entire plot feels so contrived, like it’s been done a million times over—because it has. And I’m just over it. I think most readers are. I don’t understand why book two would remove everything that made it so appealing in book one. I really don’t. I’m stunned by this.• there is a plug on the back of the hardcover that labels it as “action-packed.” And I have to laugh at that now because it may be true, but it’s so action-packed as to become completely nonsensical. The plot is so incredibly jumpy. Things happen fast, but so fast you’re not really involved or invested in any individual moment, even the important ones. It just feels all over the place and pretty much pointless. • character decisions are highly questionableLook, maybe this is just me, okay? But if I were being hunted to oblivion by my immortal enemy, then I maybe wouldn’t go to hang out at a party (one they’re also attending btw) when I’m meant to be escaping. I don’t know. Just a thought on survival from me to you. • oh hey miss lady villain, I didn’t forget about you, don’t worry.Obviously, the villain is revealed at the end of book one. The problem is that now we have time to develop her in book two, she comes off as incredibly cheesy and painfully unconvincing. The character decisions she makes don’t make much sense either! And I’m just bamboozled by this! Why?!?! WHY.Okay, well. I think I can safely say this rant is over. And thank you so much for letting me vent because I was having a MOMENT while reading this. I had incredibly high hopes. I don’t enjoy much YA anymore, but this was a series that really hooked me. I was so excited for book two. And now my little reader heart feels cold and empty inside. Alas. On to the next one!"}, {"Review": "Honestly? No fucks were given while reading this book. Seriously, none. Look, take a moment to remember every single YA fantasy trope you can, the trivial and boring ones and the ones that have been chewed up hundreds and hundreds and fucking hundreds of times and then spit out with changed names and a 'super-duper-unique' world (read - probably resembles the idealised version of medieval Europe). That's what I think we got in Evermore. As intriguing and well executed as the first book was, as fucking stupid and annoying was this one. Damn it, what a boring waste of time. Remember how romance was not really the focus in book one? Remember how Jules distrusted Liam and was generally a quite interesting protagonist? Yeah, we have none of that here. Special snowflake strikes again, and it strikes hard. Special Jules is special. Hardly intelligent, though. And the romance? I wanted to vomit rainbows over Jules completely unfounded mooning. Don't get me wrong, Liam was fine. And so was Ina, for the most part. But in comparison to all that annoyed and/or bored me they got lost in the sea of dismay and Jules' unnecessary stupidity and drama. Take a risky fantasy world situation, create several options for the MC to choose from, make one of them particularly stupid. Jules chose this one every. single. time. From the first chapter on I just thought of the most stupid way to make the plot progress and I shit you not, I was right every time. Generally the plot bordered on nonsensical with how jumpy it was. A flashback here, an action scene there, Jules' questionable life choices everywhere, all intertwined with rather mediocre, occasionally downright cheesy writing - that's Evermore for you. Well, naturally with the typical fantasy tropes inserted and minus the interesting concept from book one. Also - Caro? Oh please, it's not so difficult to create at least a somewhat acceptable villain. What idiotic motive was that even? And her dialogue and behaviour? Are we in the opera where you need to exaggerate and over-articulate to be seen and heard properly even in the last row?! Whenever Caro and Jules talked I found myself cringing rather hard. And again - Jules. Holy shit, Jules was just bad. So bad. Badly written, badly developed. All around terrible in this installment. As was the ending, by the way. There is mediocre, there is trivial and then there is this, which is frankly a combination of both. I am so annoyed right now. This was a total waste of my time. Not recommended."}, {"Review": ". : ☾⋆ — 3 ★ READ THIS REVIEW ON MY BLOG!!!https://bit.ly/2pFdXGZARC provided from the publisher via Edelweiss+ in exchange for an honest review (thank you HarperCollins & HarperTeen!!)first of all i’d like to say that this book was infinitely better than Everless, but it also wasn’t. i’m not gonna delve too deeply, because spoilers, however i still think there were a few issues with the world building and the general plot development, but at LEAST you can see Sara Holland physically trying to put back together this world that, in my opinion, was a little bit of a hot mess in the first book. the problem with this series, though, is that the first book focused way too much on world building and not nearly enough on character development, whereas Evermore was just one 350+ page character development essay, and didn’t center on any actual world building aspects until the very, very end of the book—if at all. much of the essence of the first book was lost here. i don’t think we ever saw a single character consume a blood iron in this book. this obviously sucks, because the plot of this series is SO unique. there isn’t anything like it in YA right now, but like i mentioned in my review for the first book, most of that potential was wasted in Everless for the sake of poor characterization and the use miscommunication as a plot device. i think this duology would’ve been better off as either one VERY long stand alone, or a trilogy. basically, i had pretty much the same issues with this one that i had with the first book. the general “blood as time/time as currency” and the mythology and backstory for this world (Sorceress vs. Alchemist) feel like two entirely different books and don’t really match up with each other at all. the latter doesn’t explain the existence of the former. i insist on this series having been better off as either a standalone or a trilogy because, as a standalone, many of the plot holes could’ve been glossed over by necessity of character development —while a trilogy would’ve allowed Sara Holland to delve MUCH deeper into her universe and her characters. don’t get me wrong though!! this was still a very enjoyable read!! the romance especially was delicious and i’m SUCH a sucker for a good slow burn. it unfortunately wasn’t a huge aspect of the book since the romance was mostly pushed aside to center on the age-old battle between the Sorceress and the Alchemist, but it was still there and i still enjoyed it thoroughly. not all was for naught, my friends!!there’s definitely an open ending here so i’m hoping this series will eventually be picked up again and have a sequel (the concept is SO GOOD), but for the time being i’m somewhat satisfied with how it was wrapped up. thanks again to Edelweiss+, HarperCollins & HarperTeen!!"}], "Genre": "Fantasy", "ID": "37693552", "Desc": ""}