{"Genre": "Fantasy", "ID": "41637836", "Name": "The Subtle Knife", "Reviews": [{"Review": "When I read this the first time I completely overlooked a main component of the book. I approached it as if was the second book in the series, a massive mistake. I wrote a review criticising the fact that the novel felt awkward; it had no beginning or end: it just felt like the typical content you’d find in the middle of the story. The ironic point of this is that most critics take the trilogy as one whole book, rather than three separate works. And this really is the best way to approach the story.  The Golden Compass  is the beginning of it all, the setting of the stage. This, then, is the middling part of the work. The second protagonist of the series, the Adam to Pullman’s Eve, takes the lead here. Initially, I was very resistant to this idea. I had grown to respect Lyra; she’s a really strong heroine, but after a while it started to make sense. Pullman has expanded his story considerably. Lyra has three chapters told from her perspective. The same amount, roughly speaking, is told from the perspective of Will. The rest of the chapters are from side characters of the previous book. So there’s a strong move away from a Lyra centred story.  I have mixed feeling about this. It felt like an odd authorial decision. At times this felt like an entirely different series altogether, again, something I eventually got over. There is no sense of closure at the end of this. The first book had a strong ending, but this has very little. This book seemed to be a mere set-up for the next instalment, which makes it rather difficult to review; it’s like picking out the middle bit of a story and trying to criticise it as a separate entity from the rest of it: it’s not easy to do. Any criticism you make are negated by the fact that this is not a separate book: it’s a chunk of a greater work. So I’m going to read the third book before I speak any more about this- I need to see where these elements Pullman added go to. Perhaps a review of all three works together would be the best option. At this moment though, I find the witches one of the most interesting aspects of the work. I’m not entirely sure what to make of them as of yet. Hopefully, the third book will give me all the answers I need. \"All through that day the witches came, like flakes of black snow on the wings of a storm, filling the skies with the darting flutter of their silk and the swish of air through the needles of their cloud-pine branches. Men who hunted in the dripping forests or fished among melting ice-floes heard the sky-wide whisper through the fog, and if the sky was clear they would look up to see the witches flying, like scraps of darkness drifting on a secret tide.\""}, {"Review": "The second entry in a trilogy is often, in my opinion, the best. The author doesn't have to introduce the universe or the characters, as they did in the first installment, but they don't need to worry about wrapping up all the plot points either. Instead, the focus can be on 'the good stuff': elaborating on the story, teasing us more, giving action, chopping off Luke's hand and so on. Instead of the good stuff, in The Subtle Knife I feel as though we've had a bait and switch pulled on us.In The Golden Compass, we were treated to a rich alternate universe that had elements that were similar to our own, like some of the geopolitical structure, and elements that were entirely fantastical, like armored polar bears and witches. The Subtle Knife, however decides that most of this is insignificant and takes place almost entirely in different universes. It seems like Philip Pullman wanted to reel us in with fantasy before he could preach at us.Some of these elements are expanded upon in The Amber Spyglass, which I'm currently reading, so forgive me if they don't all apply. I had heard before I started the series that they were 'about killing God.' This seemed highly unlikely, and was probably a knee-jerk reaction from people who heard it from other people who read a synopsis of the book, etc. But... no. Some of the main characters have decided to wage war on 'The Authority.'Herein lies my main concern with the series as a whole: it's not (excuse the pun) subtle. I'm an agnostic, so these complaints don't come from someone insulted by the material, they come from someone unhappy by their handling. I love plots that put a spin on traditional religion (Waiting for the Galactic Bus, for example), but it seems like Pullman came up with a story involving a culture's religion and then decided to make it fit with the Judeo-Christian framework no matter how hard he had to push.The concept of Dust is interesting. Adapting it to fit with concepts of physics in our world works because it uses something we only know a little about. Once you try to toss in angels and consciousness and so on (which is insulting in a children's book, as he's claiming that children are entirely self involved until puberty), though, it seems contrived and silly.I may have been more willing to swallow his philosophy, such as it is, if there hadn't been a complete lack of the elements I liked in The Golden Compass: there were no Gyptians, there were no panserbjörne... they seem to make a reappearance in the final book of the series, but why spend so much time on their culture in the first book if you aren't going to include them in the second? (I know that the panserbjörne's culture is basically that of any warrior society, but they're still armored polar bears and the ten year old in me think that's awesome)It's not so much that the book is bad, per se, though I do think it becomes too dark for the age group I initially thought it was written for. I just don't think Pullman is writing for the same reason I want to read: he wants to write religious commentary while I want to read fantasy."}, {"Review": "The Subtle Knife (His Dark Materials, #2), Philip Pullman The Subtle Knife, the second book in the His Dark Materials series, is a young-adult fantasy novel written by Philip Pullman and published in 1997. The novel continues the adventures of Lyra Belacqua as she investigates the mysterious Dust phenomenon and searches for her father. Will Parry is introduced as a companion to Lyra, and together they explore the new realms to which they have both been introduced.تاریخ نخستین خوانش: روز دهم ماه آگوست سال 2008 میلادیعنوان: نیروی اهریمنی اش کتاب دوم - خنجر ظریف؛ نویسنده: فلیپ پولمن؛ مترجم: فرزاد فربد؛ تهران، کتاب پنجره، 1384، 1385، ؛ سری سه گانه «نیروی اهریمنی اش» در ایران در پنج مجلد چاپ شده: ک‍ت‍اب‌ اول‌ شامل دو مجلد ب‍خ‍ش‌ اول‌ و دوم، عنوان: س‍پ‍ی‍ده‌ ی‌ ش‍م‍ال‍ی‌؛ جلد سوم همین ک‍ت‍اب‌ دوم‌، عنوان: خ‍ن‍ج‍ر ظری‍ف‌؛ و جلد چهارم و پنجم، عنوان: دورب‍ی‍ن‌ ک‍ه‍رب‍ای‍ی‌ یک و دو؛خنجر ظریف، دومین بخش از سه گانه ی «نیروی اهریمنی اش» است. پسری به نام: «ویل»، که مادری عصبی دارد، به دنبال پدرش، «جان پری»، از پنجره‌ ای درون هوا می‌گذرد، و به «چیتاگاتزه» وارد می‌شود. اشباح، بزرگسالان «چیتاگاتزه» را، از بین برده‌ اند، و او طی رخدادهایی با «لایرا» آشنا شده، و حامل «خنجر ظریف» می‌شود. «لی اسکورسبی» هوانورد، «جان پری»، یا «استانیسلاوس گرومن» را، از میان تاتارها برده، و خود کشته می‌شود و رخدادهای دیگر...؛ ا. شربیانی"}, {"Review": "¡Ese FINAL!!! te deja con la NECESIDAD de saber que sigue.Estos no son libros infantiles, no se que se le metió al editor o a quien se lo ocurrió la brillante idea de clasificarlos de esa forma, pero a mi parecer que tengamos por protagonistas a niños no hace que el libro ipso facto sea infantil. Esta vez el centro de la historia, al parecer, es la búsqueda del padre de Will, pero una vez mas Pullman nos muestra que su trama es mas complicada de lo que aparenta ser. Los puentes entre los mundos se han abierto, el caos ha comenzado, y por si fuera poco se esta preparando la mas terrible de todas la guerras del universo...\n—Existen dos grandes poderes —declaró— que se enfrentan desde el comienzo de los tiempos. Todo avance en la vida del hombre, todo jirón de conocimiento, sabiduría y decencia que poseemos se lo ha arrancado de los dientes un bando al otro. Cada pequeño incremento en la libertad humana se ha conseguido a costa de una lucha feroz entre quienes desean que sepamos más y seamos más sabios y fuertes y quienes pretenden que obedezcamos y seamos humildes y sumisos.\n... Lord Asriel esta formando y comandando un ejercito como nunca antes se ha visto, con seres y guerreros de todos los mundos, pero ¿A que se enfrenta? ¿Quién lidera el otro bando? nada menos que Dios¿todavía siguen pensando que es un libro infantil? Mientras todo esto sucede Lyra esta perdida en un nuevo mundo donde conoce a Will (un chico de nuestro mundo) juntos tendrán que atravesar una serie de dificultades entablando amistad en el proceso. La expansión del worldbuilding ahora siendo un multiverso, mas las nuevas incorporaciones como los espantos, los ángeles, los chamanes, la daga sutil, y la antesala de la guerra neo-apocalíptica me hace amar este libro, ademas la trama tiene, conflictos religiosos y científicos, drama filosófico y mas sobre las brujas. Lo que no me gusto, fue ese final porque te deja en suspenso, pero esto tiene su punto bueno, hace que quieras leer la continuación de inmediato, y es lo que hay que hacer para conocer el desenlace de la historia. Para mas de mis reseñas sobre los libros de La Materia Oscura pueden ver los siguientes enlaces:Luces del norte aquí EL Catalejo lacado aquí El Oxford de Lyra aquí"}, {"Review": "I love the world(s), but this is where the series starts getting too weird for me. I'm just not huge on the anti-religion theme... like at times it takes away from the actual story with its intensity. I absolutely love when books can mess around with theoretical physics or philosophy, so there were still some aspects I had fun with. But the religion stuff stuck out really awkwardly for me and was hard to get past. I'm still a big fan of the witches, Lyra, Will, and the worldbuilding in general, though! The way the knife can cut between worlds is SO COOL - I love how so many of the ideas are explained. However, this book does kind of suffer from second book syndrome at times... there's just a lot of running going on. It feels like a bridge between two books instead of a story in its own right. I remember I tried to read this when I was 8 and just returned it to the library halfway through because it was boring and not fun. Aaaaand that is exactly what I wanted to do this time as well. So I guess The Golden Compass is a favorite, but the sequels do way too many bizarre things with religion in such a cynical manner that it's hard for me to have the same level of enthusiasm."}, {"Review": "I share this review again in the fall of 2017 as a fourth volume (though Pullman later wrote two companion pieces to the trilogy, entitled Lyra's Oxford, and Once Upon a Time in the North), The Book of Dust, has been released, to encourage all ages to read. As with most great \"children's\" books, there are a range of levels on which Pullman is working. He's taking on the Roman Catholic view of reality, C.S. Lewis (in The Chronicles of Narnia), and is in conversation with John Milton, whose Paradise Lost he both loves and contends with in places. But you don't need to know any of that to love this series.This is the middle book in the trilogy, and I like the first and third volumes more, big surprise. More exposition, less action, more trudging to final destinations, but you know, the writing is still exquisite, and it has surprises. One key surprise is that after focusing on Lyra in the first series, this second book opens with a focus on yet another central character, Will. When I first read this I was confused, and more than a little disappointed, as I saw a wonderful strong girl character shoved aside as usually happens in all books for a BOY main character. That isn't quite how things work, really, though, as they share the stage, and they open up new vistas and back stories and new worlds together. This is seen as a sixth grade children's series, but in truth, the older you are, the more you will get out of it, as in all of the greatest \"children's stories\" of all time, including The Wrinkle in Time, and so on. Pullman is taking on our limited view of \"reality\"-- he's engaging in physics, theology, anthropology--with a laser beam on the Holy Roman Church in particular. It's not so much an attack on The Church as an exploration of the nature of true religion, and a wider, more generous, less sin-obsessed view of the world. It's a wonderful series, which I listened to while traveling around the country with the family, a wonderfully produced cd series. It's the second volume of a trilogy, so you obviously don't begin here, but you won't regret the time you spend on the adventure. It's awesome. And whether you have read it or not, I recommend this audio version, with Philip Pullman Himself narrating, joined by a wonderful cast of characters. "}, {"Review": "I am not a fan of forwarded emails. They frustrate me, because they usually come from the same group of people, people I like a great deal but who never send me a normal \"hey, how's it going?\" message. Just \"Support our Troops\" or \"Tell every woman you know she's special\" or \"Microsoft is running a test and if you send this you could get a check for $1,000!\" When I see the letters FWD in the subject line, I usually simply delete it.I lost track of the number of emails I received telling me about the Anti-God movie The Golden Compass and the need to boycott the movies and the books. It was well over ten. Ten people wanted me to send that email on to everyone I know, telling them the same thing. Don't see this movie! Don't read these books! Alert! Alert! Alert!Nothing like calling attention to something like a planned boycott. I haven't seen the movie, because I'm cheap and it's not something I'd take my kids to or something I'd be prone to see anyway, but as I had already read the first book in the series, enjoyed it and hadn't found it to be Anti-God, I was curious to read the next to see what the fuss was all about.I don't know if the emails worked and I read with a bias, but I did not enjoy this second book. Not because it is Anti-God...which it really isn't, but more anti organized religion and organized religion's version of god, but because the writing is bad.Dialogue - choppy.Descriptions - cliched. (how do I get that little accent marking over the e?)Storyline - totally falters.I felt enormously disappointed in the direction of this book. Lyra, the young female protagonist in search of dust and her father, all but disappears in this second story. She still plays a part, but now as the sidekick to Will, a new character who is a giant \"young adult fiction\" stereotype (in search of the father he never knew while protecting his mother from bad guys and seems to be gifted in the combat department). I don't remember the writing being bad in the first book. I thought it descriptive and unique and thoughtful. Not so, in The Subtle Knife. Pullman changes gears and loses focus. There is a lot more going on and none of it is developed well. I stopped caring about the characters and their goals.I think these books had great potential. There could be a lot to discuss with adolescents (not young children...at all). The nature of the soul, the natural man, the costs and benefits of religions. All appropriate things to discuss with youth ready to question and discover on their own.Pullman takes that conversation away with his lack of metaphor. It becomes impossible to argue, \"I think the dust means this.\" or \"what do you think The Authority is for Pullman?\" when he throws his opinion at you with real life Christian beliefs. It's inappropriate and unfair. Write a fantasy or a satire or a parable if you want to. Other authors have done it...and done it well.Pullman didn't.I won't be reading the third book."}, {"Review": "Way back at the end of November/beginning of December of good ol' 2007, I read Phillip Pullman's The Golden Compass. Why? Well, because there was all that talk about how it got made into a movie. I read the book, and found it very thought provoking. As for the movie it's a watered down version of Pullman's work, but not bad for the most part. I mean, I don't think it would go over too well with audiences who haven't read to book to know that Lyra's friend Roger is killed by Lord Asreil and that Mrs. Coulter actually wants to control Lyra and in The Subtle Knife decide that yeah, she has to die. Just for a quick overview of Phillip Pullman's contraversal work and why it's a contraversy. There are three books in the series called, His Dark Material: The Golden Compass, The Subtle Knife, and The Amber Spyglass. The title of the series comes from a phrase Milton uses in Paradise Lost, which for those who don't know is a 16th century epic poem about Satan's great Fall from Heaven and the mischief he does in getting Adam and Eve to commit Original Sin. The books are about a rebellious girl named Lyra Belacqua, who comes from a world like the one we know, but is also very different. I guess you could say it's a warped version of the Victorian period. In Lyra's world, people have \"deamons,\" which are external forms of people's soul in the form of animals(Lyra's daemon is named Pantalaimon). She gets a hold of a golden compass, a device called an alethiometer, which at first she doesn't know how to use, but soon finds that it allows her to see into the past, present, and future. There is also the issue of a substance called Dust, which surronds all human life. The Church, also called the Magistrium, a very tyrannical and oppressive hand that acts first and questions later, wants to destroy Dust and Lord Asriel (who we think is Lyra's uncle but, da da da!! it's actually her father). Mrs. Coulter, being a very powerful figure in the Church, tries to seduce Lyra in a world of privilge but soon realizes that Mrs. Coulter is trying to control her. Lyra, being a free spirit, doesn't take kindly to this. So she runs away, meeting up with gyptians, where she learns to read the althieometer; gets badass texan named Lee Scoresby (and his daemon Hester)talking armored bear named Iorek Byrnison to work with her; she gets kidnapped by Tarters and sent to Bolvanger discovers the sinister secret of the Church: they cut daemons and children apart in a process known as intercision and finds that Mrs. Coulter (who is da da da!! her mother!) is in charge of the whole operation; plans an escape for all the childern where she mets the witch queen, Serafina Pekkela, and the queen helps Lyra on her quest to find her father; and her friend Roger is killed by her own father Lord Asriel which results in the creatation of a bridge from his world into another. The story ends with a very pissed off Lyra following Lord Asriel into the new world.So yeah, a lot to take in. I just gave an overview! There are so many carefully thought out details that I have left out. For example: as a child, their daemon's have the ability to change from animal to animal. When the child reaches to adulthood, their daemons settle into one animal. Very cool right? So, what's the contraversy all about?One: Phillip Pullman is an out spoken atheist.Two: His Dark Materials are catagorized as childrens books. Three: You find out in The Subtle Knife that the big plan is to kill God.Yeah. The Subtle Knife introduces Will, who stummbles across a window to city called Cittàgazze on another world. There he meets Lyra. I would explain more, but you've already put up with me talking about the first book, so let me sum up for you by what the back of the book says:\"In this stunning sequel to The Golden Compass, the intrepid Lyra find herself in the simmering, hauinted otherworld-cittagazze, where soul-eating Specters stalk the streets and wingsbeats of angels sound against the sky. But she in not without allies: twelve-year-old Will Parry, feeling for his life after taking another's, has also stumbled into this strange new realm. On a perilous journey from world to world, Lyra and Will uncover a deadly secret: an object of extraordinary and devasting power. And with every step,they move closer to an even greater threat-and the shattering truth of their own destiny.\"I know you want to read it now just see what happens. Anyway, it's very amazing and disturbing and fantasic and all those things. I just finished reading The Subtle Knife today so I have yet to read The Amber Spyglass. When I do, I'll let you know.But why are these books good and why is Pullman on my Influential Writers list along with Donne, Plath, and Hemingway? Because he wrote a children's book version of Milton's Paradise Lost! Have you ever read it? Holy Crap! I had to read it twice while I was in college. Don't get me wrong. It's awesome. It is awe inspiring. Everyone should read it. But damnit, it's long and can be a little hard to read if you don't have someone there explaining it or Cliff Notes. In Milton's poem, Satan leads an army of rebellious angels in an attempt to overthrow God. The attempt fails, and Satan and his followers are cast out of heaven. Satan, seeking revenge, convinces God's creations, Adam and Eve, to eat the fruit of the tree of knowledge, thus causing their fall from grace. In Pullman's take on Paradise Lost, God is an oppressive, senile old man, and Satan is a dashing heroic figure. But the real hero and centerpiece of Pullman's story is the Eve figure, Lyra Belacqua, on whom the salvation of the universe depends.Really? A children's book? Wow! That's what I said. So I raise my glass of Cranberry-Pomagrante Crystal Lite and vodka to Phillip Pullman for being the writer I want to be: original, brave, and honest. And to go off an a rant real quick:How can people protest and get all up in arms when they haven't even read/watched what they are getting upset about? Understandably, if you read Pullman's His Dark Materials, and you are against it, awesome. You know what are you talking about. I got really upset when people started attacking the movie without having read the book or even seen the movie. How do I know? Well, because I asked. Are people so afraid to have their ideology put into question? Do they not want to think critically, analyze what they believe in? I love being challenged. Good lord, what else do I have to do intellectualy until I light a fire under my ass and get my teaching certificate? It's okay to question what your faith and your beliefs. It allows you to see how strong you are in the decisions you have made.Sorry about that last rant there...but that had been building up for a while. Not just from Pullman's work, but also from a few other things that I would talk about but this blog is already long enough.Well, I hope you enjoyed me getting my nerd on. It was a blast!Ciao, darlings!!"}, {"Review": "For a moment, just imagine that after reading Harry Potter and the Sorcerer's Stone you were so enthralled by the protagonist (even if you weren't bare with me), his friends and the entire world that has been established. It has moral undertones, but at it's heart it is a fun fantasy novel. Then you pick up Harry Potter and the Chamber of Secrets and suddenly Harry has been downgraded as a protagonist in favor of Dan, our brand new second main character. He's super awesome and whatnot and sort of leeches attention away from Harry. Also the relationship between Harry, Ron and Hermione has been almost removed to the point that when see Ron or Hermione appear you suddenly remember \"oh yeah\" that person. On top of that, the moral undertones are now hammers that are pounded at you. It's not horrible, but after reading the first book, this is not what you imagined it would become. That is how I feel about The Subtle Knife. I did not hate this book, but after the awesomeness that was The Golden Compass, I'm really disappointed in this new world that we were brought into and the changes made to how the story was constructed.I thought that this was going to be Lyra's story, but it was taken over by Will and this really clumsy world building that I just could not enjoy as much as the previous book. I also was not a fan of all the different perspectives that were going on. In the previous novel they did a great job of putting Lyra is situations that advanced the plot and allowed her to grow as a character and we don't get that here. It makes everything come off as sloppy.That being said, this was not horrible, it was just a lackluster sequel. I am legitimately surprised that this is the highest ranked book in the series. Onward to Book 3.Oh and we get it...down with the establishment enough with the sermon."}, {"Review": "Two very strange things happened last week. I gave I Am Half Sick Of Shadows: A Flavia De Luce Novel two stars and am now giving this book five star. It is strange because the former book’s protagonist, my dear Flavia De Luce is my favorite obstinate pre teen. On the contrary, Lyra, another stubborn, precocious, pre-teen absolutely annoyed me in the previous book. Right now though, I can not for the life of me imagine why I did not like the first novel and Lyra. Well, at least I adore her right now.Philip Pullman is a genius. I loved every aspect of this book, the concept, the characterization, the plot, the pacing, everything. I remember thinking that the last book was rather boring, but this part had me catching my breath. Specters, rebel angels, parallel universe, golden compasses and subtle knives, daemons and witches- each chapter keeps you hooked and also provide fodder for the brain to muse about. I love the anti CS Lewis atmosphere of the book. The characters were another high point in this novel. Lyra Belacqua reappears with her daemon Pantalaimon and although she doesn’t play as central a role as the previous novel, she is absolutely charming. I can not wait to find out the form Pantalaimon will finally take. Marisa Coulter and Serafina Pekkala are back and as interesting as ever. Lee Scoresby and his daemon are absolutely heart breaking. A bandwagon of new and amazing characters like Stanislaus Grumman, Will Parry, Mary Malone is introduced. The friendship between Will and Lyra and Will and Pantalaimon were some of the best parts of the story. I would read the next book just to meet all these characters again. I am so glad I already have a copy of the next part. After that abrupt ending and the revelation about Lyra towards the end, having to wait for the next part would have been sheer torture. I never thought I would say this, but Flavia really is in grave danger of being dethroned as my favorite. "}, {"Review": "It has been a while since a book last left me with the desire to have my head trepanned and to become a shaman. And I suppose these days it is difficult to get on the training course and who knows if the pension scheme will be all that it was cracked out to be?Reading I thought this business of the human mind and the flow of consciousness through a multiplicity of universes reminded me of something else. As always it takes some days for this kind of thought to percolate down to the answer - I recalled something very similar from Anathem!At first my reaction was how marvellous it was that different authors had read similar things and developed an idea along related lines in parallel book universes, however once I double checked the publication dates I did feel a slight, entirely unwarranted, sourness towards Master Stephenson.In contrast to Northern Lights the story here rans over a much shorter time period, the cast of characters remained large, the deft reworking of Blake, Milton, and the Bible appeared to give away to Dark Matter, consciousness, and multiple universes, while the pace of the book was not maintained by one desperate fight after another. As much as I enjoy Zeppelins and Armoured Bears I appreciated the deployment of colours from a larger palate by the author. Continuing the theme of children in children's literature from my previous review the absence of parents from both Will and Lyra's lives is strikingly traditional. For Will he has had to become the adult figure in relation to his mother - and while the role of child carer is contemporary the fight between father and son each ignorant of the other's identity has a long history although here it is presented with a mild twist on the traditional tale (view spoiler)[ in that one doesn't kill the other (hide spoiler)]. Lyra in a way is a child without parents. Technically there are two people in the story who performed the physical functions both sufficient and necessary for Lyra to exist, but in regard to their behaviour and attitudes terminology such as parent, father, or mother seems cruelly inappropriate. Sometimes I hear the idea of there being for instance, a Catholic Atheist, told as a joke, admittedly I have had my sense of humour surgically removed, but the concept seems an entirely serious one to me. This trilogy is a strong example of it. The author does not share the faith of his ancestors but this is a work that could not exist without a tradition of religious dissent in England from the Geneva Bible, via Milton, and Blake. The power of their faith, the notions of predestination, free will, sin and grace, energise this trilogy. Fantastically, at this mid-way stage the rights and wrongs of rebellion and authority are still from clear cut, leaving the heroes, as every child is left, with untrustworthy, partisan, or uncertain guides as to their course of action."}, {"Review": "Vaya final!Ha sido muy inesperado!.Sin duda esta segunda parte es mucho mejor que la primera.Las aventuras de Lyra continúan, un poco después del final de la Brújula Dorada y ahora está con Will Parry, un niño de 12 años de nuestro mundo. Los dos se encuentran cuando Will, tratando de escapar de los problemas en su ciudad natal de Oxford, Inglaterra, se desliza a través de una ventana invisible (como una hoja de aire en el aire) hacia un tercer mundo, Cittagazze, donde se topa con Lyra. Recopilan sus historias y deducen que hay muchos mundos, todos \"enganchados\" entre sí, que coexisten, y que solo aquellos que han descubierto las ventanas pueden viajar entre ellos.Estas aventuras tienen un propósito, que se desarrolla y se convierte en capas y más claras a medida que los dos viajan y se enfrentan a ángeles, espectros devoradores de almas, humanos calculadores, una multitud de niños desesperados, aliados mágicos y amigos de mentalidad superior. El propósito, que involucra al padre separado de Lyra, Lord Asriel, y su madre diabólica y bella, la Sra. Coulter, tiene mucho que ver con la Autoridad, la conciencia y el pasado y el futuro de la humanidad.No, no es demasiado. Esta es una historia fabulosa, maravillosa, profundamente moral que se revela en todo momento. Por momentos, me encontraba leyendo con excitación que giraba la página; hacia el clímax, lloré cuando un personaje, que parecía secundario, sube al escenario y realiza, por devoción singular, un sangriento acto de valentía y amor.Una cosa que puedo decir sobre Pullman es que él es un maestro en los detalles, en el personaje, en el escenario. Su imaginación es inmensa.Por lo general, soy una lectora que gravita hacia el Realismo. Esta trilogía, llena de brujas, talismanes y poderes sobrehumanos, arroja una luz brillante sobre la condición humana de una manera que no muchos libros logran. ¿Mejor de todo? Es un paseo emocionante."}, {"Review": "Um Universo ProvocadorTrepanação — alguém conhece tamanho palavrão?Muito honesta e sinceramente, devo confessar que desconhecia tal vocábulo!Mas agora que li “A Torre dos Anjos”, e após o inestimável auxílio do Mestre Google, fiquei a saber que se trata duma prática milenar, onde, por acção dum instrumento dito cirúrgico (que, diga-se de passagem, mais parece um daqueles apetrechos de tortura utilizados pela Inquisição) se abriam orifícios no crânio, tendo em vista expurgar os espíritos maléficosE ainda há quem se negue a ler fantasia, alegando que nada se aprende!...Neste género literário, o Real, não obstante estar latente, é amplamente distorcido, recriado e reinventado! Contudo, está presente, e não escapa ao leitor atento.No caso concreto da “Torre dos Anjos”, há uma notória componente mística, que encontra expressão no Mundo das Sombras, no Enigma do Pó, no Xamã, na Missão de Lyra, etc, etc,...O Universo misterioso provoca-nos, e nós os humanos interrogamo-nos sobre a Existência e seus inexpugnáveis Segredos!..."}, {"Review": "Much like the city of Citagazze, The Subtle Knife is the crossroads between Northern Lights and The Amber Spyglass, and as such I think it's unfair to judge it as a single novel. It introduces the wonderful characters of Will and Mary, and brings the whole concept of multiple worlds into play. We also see small hints of the rebellion that will be raged across the worlds, but more importantly we see the beginnings of Lyra and Will. In Will we see someone who's had responsibility thrust upon them unwillingly, forced to deal with issues far beyond the usual imaginings of a 12 year old boy. In Lyra we see a character who's already seen and done extraordinarily things as a child begin to grow into herself, and learn to follow instead of lead. Its really the perfect bridging novel that The Amber Spyglass needs to develop characters and storylines ready for that all important final chapter. Like Dust, and the concept of destiny, it allows the reader to see the 'subtle' threads of connection that will allow certain roads to cross, and situations to happen as if it were always meant to be. "}, {"Review": "Reseña de \"Luces del Norte\" (La Materia Oscura 1)Reseña de \"El Catalejo Lacado\" (La Materia Oscura 3)\n¿Habéis intervenido en la evolución humana?SÍ.\n¿Por qué?VENGANZA.\nEste segundo libro me gustó muchísimo más que el primero. Se dieron muchos giros, conocimos nuevos personajes y arribamos a nuevos mundos. Todo lo planteado en Luces del Norte gana mayor terreno (diría que colosal) y todo lo que pensábamos que podía ser de una forma, termina siendo de otra.Sin embargo, puedo ver por qué hay algunos que no gustaron de esta saga, porque es con este libro con el que la historia despega hacia una dirección totalmente opuesta a la que creíamos (o no quisimos ver) que iba a tener. En mi opinión personal, se pone mejor y lo que nos espera en la última parte de la trilogía tiene que ser magnánimo.En resumen:\n\n    LO MEJOR:\n  \n\nEl argumento.\n Sin duda, este libro fue lo que los yanquis llaman un roller coaster of emotions, y no fue solamente el final, o los capítulos anteriores, sino que es todo el libro un continuo torrente de sucesos, información, descubrimientos y giros que me dejaron sin aire. En más de una ocasión me quedaba mirando la hoja con una tremenda cara de feliz cumpleaños y suspirando un \"¡Aaaaaaaaahhhh!\" de sorpresa. \n\n    LO BUENO:\n  \n\nLos nuevos personajes.\n Amé a Will, y no puedo concebir mejor compañero y complemento a Lyra que él. Con tan solo sus acciones nos damos cuenta de cómo es: un guerrero, como bien dicen, independiente, maduro para su edad y, sobre todas las cosas, valiente. Me gusta cómo en ningún momento se lo describe (a diferencia de en el libro anterior en el que muchos personajes se decantaban diciendo lo inteligente o diferente que era Lyra) pero lo bien que el pequeño nuevo protagonista demuestra cómo es. En este caso, lo de que una imagen dice más que mil palabras se aplica perfectamente. \n\n    LO MALO:\n  \n\nEl cliffhanger, y algunas inverosimilitudes.\n Me sorprende la confianza con la que algunos personajes reciben a desconocidos y cuentan todo lo que saben (me refiero a más de una ocasión), y también me asombra la rapidez con la que los protagonistas consiguen respuestas. Sin embargo, fue todo tan agobiante y tan abrumador, que lo dejo pasar, porque la narración de Pullman se disfruta mucho, y hasta me parece que se vuelve mejor conforme avanzan los libros. \n\n    LO PEOR:\n  \n\nLos cambios,\n que en mi parecer no fueron malos (FUERON GLORIOSOS), pero pueden levantar controversia en los lectores. Están advertidos todos aquellos que comenzaron con Luces del Norte y pretenden seguir la saga, que esto ya no es fantasía, sino que pasó a un plano totalmente religioso o metafísico. Insisto en que esta no puede ser una saga para niños, tocando temas tan delicados (que trajeron sus problemas al autor según pude leer un poco en Wikipedia sin spoilearme) y explorándolos a sus anchas sin ninguna regla ni restricción. Porque eso mismo es lo que hace Pullman: agarra el cristianismo y te lo retuerce delante de tu cara. Fuerte. Para aquellos que buscaban una simple saga de fantasía, tal vez estos libros no sean lo que esperaban. Más de una persona me dijo que la historia derivaba en algo totalmente distinto a lo que se esperaba desde un principio, y una amiga (ya lejana, por desgracia) se los había comprado hace unos años y luego los revendió porque \"no eran lo que había pensado\". Ahora comprendo todo. Para aquellos interesados en continuar, creo que es una saga que vale la pena. Yo sinceramente no esperaba nada, ni fantasía ni metafísica, y por eso el rumbo que está tomando no me disgusta en absoluto. De hecho me encanta, pues me siento bastante \"letrada\", si pudiera decirse, en el tema, y disfruto sin prejuicios de historias de este estilo, cuando están bien hechas. \n—Existen dos grandes poderes —declaró— que se enfrentan desde el comienzo de los tiempos. Todo avance en la vida del hombre, todo jirón de conocimiento, sabiduría y decencia que poseemos se lo ha arrancado de los dientes un bando al otro. Cada pequeño incremento en la libertad humana se ha conseguido a costa de una lucha feroz entre quienes desean que sepamos más y seamos más sabios y fuertes y quienes pretenden que obedezcamos y seamos humildes y sumisos.\n"}, {"Review": "What I did like about this book is that it starts with Lyra, a girl we have become acquainted with from another world, meeting Will, a boy from our world. Bringing the fantasy into our own reality was surreal and interesting. But only for a minute and then it became a bore. The story was slow and at some points stopped altogether to allow Pullman his theological preachings of anti-church and anti-god. If the story had been metaphorical I would have enjoyed it more, but it became less fiction and more essay. In this book, Lyra and Will travel between worlds attempting to find his father and continue on with Lyra's mission. There are a lot of minor characters in too many places spreading the story out too thin to move quickly enough to keep one's attention. Eventually the action picks up as the characters merge, setting the scene for the major battle in book 3, but I was too annoyed with his writing by then to shrug it off. I almost didn't read the third book after this."}, {"Review": "Why, no, I have never read His Dark Materials before. It was not a thing in Poland and after seeing that nonsensical film I was not exactly inspired to read it. However, when I was in New Your a few weeks ago, my friend there practically forced these books on me. And then it got really cold, the water in our pipes froze and reading some good children's fantasy novel seemed like the best idea.This series is definitely improving as it goes on. I liked this better than the first part. The first few chapters brought back that feeling of excitement I used to have when starting a new book as a child.Of course it is a lot of fun. But gosh, children book writers are ruthless, aren't they? They just kill the characters willy nilly, as if they were solely responsible for teaching all the children of the world about mortality. Have some mercy on my heart.So while I enjoyed this one better than the first one, I had to take off one star for not so subtle (subtle, ha, ha, see what I did there?) religious symbolism. It's like Narnia in reverse and could we please keep strong religious messages out of children's books?Also, I missed the fully fleshed world from the first book. This world seemed somewhat stunted. But hey, at least Lyra is a lot less annoying here."}, {"Review": "Later...It is so surprising to me that the thing I found vastly irritating right at page one of the first of this series - the daemon - so quickly captivated me. You have this daemon in you, all of us, just as the story goes. And as a child it is anything, it has the fantastical vision that children have, there is nothing to stop it. But then we mostly grow up and we mostly lose the idea that we can do anything, we lose imagination, we lose the unconscious bravery of our childhood, we lose the intrepidness and curiosity with which we were born. And so our daemon can no longer be anything. It is a static reflection of the settled thing we become as we move into adulthood. Well, I cling to the idea that whether or not I've grown up, I nonetheless have a daemon which can be anything but I dare say that’s fanciful.Daemons die. They die because they were fighting for you, or because you couldn't fight hard enough for them, or because they are spurned - there are at least some things your daemon can be that thrive on the nourishment that is given them by others. You can't fight to save it because you can't force people see it the right way. They take away the thing that succoured your daemon and made it and you blossom, you see it lying on the ground, dying, and there is nothing you can do. You can't save it, only other people can.If you think about it, when you read these books, the reason you feel so utterly gutted whenever one of these creatures dies, is because you know what it feels like. You know that what is being described is exactly something dying in you, a process of loss that makes you a lesser person. Grey replaces lit-up, fear replaces joy, a sick pit in your stomach replaces a heart that beat too much from happiness. These things happen and in a heart-beat something infinitely precious is being severed from you. And I feel as helpless in their path as a small child watching something monstrously large taking their daemon away. And I guess like a small child I watch and hope something even bigger will come along and save us.-----------------------A satire on the nature of academic research that one can only compare favourably with David Lodge’s work in this area. “‘Shadows are particles of consciousness. You ever heard anything so stupid? No wonder we can’t get our grant renewed.’….’It’s Dust,’ said Lyra authoritatively. ‘That’s what it is.’ ‘But you see, you can’t say this sort of thing in a funding application if you want to be taken seriously. It does not make sense. It cannot exist. It’s impossible, and if it isn’t impossible it’s irrelevant, amd if it isn’t either of those things it’s embarrassing.’….’Everything about this is embarrassing, she said. ‘D’you know how embarrassing it is to mention good and evil in a scientific laboratory? Have you any idea?’ One of the reasons I became a scientist was not to have to think about that kind of thing.’ ‘You’ve got to think about it,’ said Lyra severely.”Lyra, you see, is a child, so unlike research academics, she can have a plain interest in the truth.Later on, beginning p. 250 is a terribly amusing exchange between Dr Malone, trying to live up to the virtuous Lyra, her research associate who wants to take the money with the strings and Sir Charles, puller of the strings and more powerful than any piddly peer review. I love the part where he tries to seduce them with the lure of defence money if they tow the right line.But quite best of all, right near the end, the wonderful line of another child, Will, who, when a witch says ‘\"No. No! That can’t be true. Impossible!\"’ retorts so angrily with the simple clear mind of unaffected honesty: ‘\"You think things have to be possible? Things have to be true\"'. I would love to live by these words. "}, {"Review": "So, I'm re-reading this trilogy for the first time in like twelve years! I was curious to see what my stance on it would be after all this time. I remember loving the first book as a kid and then being a little iffy about books two and three ... and well, I think I liked this second installment a bit more as an adult, but I do still feel it's not quite as strong as the first book.There are still a lot of things I love about The Subtle Knife:• The world-building continues to be very entrancing, especially as it gets more into the concept of multiple universes.• This book also has the first appearance of the Specters *shudders* which are pretty terrifying.• I like Will, although I don't think he's quite as endearing as Lyra. But the two of them together make a cute team, and I like that they feel like actual flawed, stubborn twelve-year-old kids. I find some things a little lacking about this book though:• As the second book in the trilogy, I think it does kind of fall prey to that \"stepping stone\" syndrome where it feels more like a transition between books than anything else. It introduces Will, the multiple worlds, the Specters, etc. etc. but I don't feel like it has much of a self-contained plot. It's a bigger piece of a whole, which is fine and all, but it does feel kind of unsatisfying in some ways. • I'm still not really sold on the whole anti-religion aspect of the books. I love the world-building, the characters, etc. but when it really gets into the religion/anti-religion I get a little bored. It has some interesting messages on the subject, but it feels very heavy-handed to me and I feel like it could afford to be more subtle. I remember this being the main reason that I was not a huge fan of the second and third books when I was younger, and as an adult I'm still finding it a little annoying. Well anyway! Over all, I still really enjoyed this book and had fun reading it a second time. There are some kind of tedious parts, but in general it's still a very good book and I look forward to re-reading the third one. "}, {"Review": "The strangest thing about Phillip Pullman's The Subtle Knife is that it doesn't feel like the second book in a series, making me wonder whether Pullman first wrote this in conjunction with The Amber Spyglass, then wrote The Golden Compass as a prequel, which then became the first book in the series once they were published. Not that it matters. What matters is that The Subtle Knife is too fast, too plot driven, and too much \"a set-up\" book to be an effective second book in the trilogy. Second books are generally strong because they give the reader a chance to breathe and get to know the characters. Not so in The Subtle Knife. Instead, Pullman introduces new characters, and not just peripheral characters, but Will, a character who seems to be the primary protagonist of His Dark Materials, and Mary, who will create the amber spyglass of the third book. Meanwhile, characters who seemed important in The Golden Compass, Azriel, Iorek and even Lyra are either supporting cast or merely spoken of. Perhaps this would work if the series was longer, if Pullman took more time with his stories, gave us greater detail, but he doesn't. Everything is fast, too fast, and the characters suffer, making it difficult to care about what is happening.The Subtle Knife is definitely a let down after Pullman's quite good The Golden Compass, and I have little hope for The Amber Spyglass, but I will know soon enough since I feel compelled to finish the series.One sidebar: for those who insist on calling this series \"atheist,\" you should understand what atheism is. This series is anti-god, but that means the book MUST NOT be atheist. To be anti-god a story must posit a god, and by assuming the presence of a god (or god-like force) a story cannot be atheist. So there you go. "}, {"Review": "When I first read this book I was young enough to still pronounce the 'b' in 'subtle', and now I can't look at this book without doing it again. I still think it sounds better that way - it gives the word a sort of dull power that I think depicts the mysterious magic of the knife much better than the silly, flippant 'suttle'. Saying 'sub-tle' opens up previously-unimagined worlds which extend indefinitely into the distance. And this is what is good about this series. I've come up with a list of the main qualities that stand out in the fantasy books I enjoy, which is as follows:1. Engaging, complex characters combined with a realistic, convincing plot.2. A tragedy so heart-rending that it is somehow beautiful.3. An intriguing world.The fantasy books I have enjoyed most over the years all seem to have at least one of these characteristics. The first point, obviously, is not unique to fantasy, but I had to include it because there are a few fantasy books that I have read where magic and so on are fairly irrelevant. They are not the centre of the plot; you get the impression they were included simply because the author wanted to give themselves a different set of specifications, as a challenge perhaps, or maybe they felt bored or limited by the confines of reality. Example of this kind of book include anything by Diana Wynne Jones, as well as Robin Hobb's Assassins trilogy, which doesn't have either of the other two qualities, though the Liveship Traders trilogy that follows it has plenty of the third point.The second point relates to books whose denouement hinges on an event so sad that it is unutterably perfect, and you knew it could never be any other way. It was so sad that it was beautiful and the reason you cried was as much for that beauty as for the tragedy. The main books I can think of that have this quality are Cecilia Dart-Thornton's Bitterbynde trilogy and Sheri S. Tepper's Beauty, and there was another one by Juliet Marillier (I think). A disproportionate amount of Celtic mythology in there, anyway. But: I haven't read any of these books for years, so it's quite possible that my obsession with their tragedy was just a product of adolescent romanticism. But anyway.The third point is, I believe, the most important for fantasy. Books that are set in the equivalent of a medieval England with magic would be boring if that was all there was to it, so they have to have at least one of the other two points to be a good book. The truly great fantasy books are the ones that make you want to know more about the world in which they are set. A single novel is really quite a small number of words to depict an entire world, and I hope no author would be stupid enough to try it. The ones who really have talent can suggest, though, in just a few chapters, enough to inspire a fascination in you that will never leave. The word 'intriguing' is nowhere near strong enough to describe it. Garth Nix's Abhorsen trilogy is one of these, and Susannah Clarke's Jonathan Strange and Mr Norrell is the queen of them all, and probably my favourite fantasy book.His Dark Materials is a book of the third point, though it has elements of the first and second points too. Pullman's genius is to create a world that is very similar to ours, and then say that in fact there are infinite numbers of other worlds that are also very similar to ours, and that they all overlay each other, and that it is possible to travel between them. The contrasts between the different worlds allow him to make much of all sorts of different ways of looking at something. It's important to note that no one in these books ever thinks of what they are doing as magic - it is science, or it is religion. It is theoretical physics and experimental theology. The lines between science and religion and magic, three things that are not supposed to intersect, are blurred beyond all recognition.It's not badly written, but the best thing you can say of the prose is that it never distracts, which in this case is perfect. And of course, the characters are all right. Will and Lyra are cool, but despite their so-called 'flaws' they're also brave and good and perfect in a rather boring way. The villains aren't bad, and I like the way there are groups of characters, such as the bears and the witches, whose societies work differently to ours and who think differently to us and who do things differently as a result. The clashes between these different ways of thought (such as the one that leads to the death of Jopari (attempting to avoid spoilers)) are very well done. But nothing is really out of the ordinary.Most important, though, are the daemons. I don't think it does anything special character-wise - it's not a radically new way of creating personality or anything - but it does have a lot of tragic potential (think Lee Scoresby and Hester in the ravine, trying to call Serafina Pekkala to save them), and it is a crucial part of what makes the world so intriguing. That one's soul can live outside of oneself is something, and that this soul can then be separated from oneself is something else. That this soul can be eaten by strange spectral beings, whether within the body or without, is another thing again. That there is a mysterious substance that is attracted to this soul, and that this strange attraction varies according to the age of a person, that is brilliant.I think what I like about Pullman is that he takes his ideas much further than would occur to most other people. And somehow you can sense, like the alethiometers' invisible layers of meaning extending down to negative infinity, that the ideas ramify back endlessly too, and all you have to do is think about it and you can get there. "}, {"Review": "This second volume of His Dark Materials introduced a couple of new characters such as young Will, who becomes Lyra's friend. Lyra has crossed the bridge between the worlds at the end of the last book and landed in a city of another where there are no adults, apparently because of specters. Shortly later she meets Will, who has had it hard in his very own way what with his sick mother and missing father. For some reason, the alethiometer tells Lyra to help him find his father.Through Will, Lyra also gets to Will's world where she meets a physicist (studying what is known to Lyra as dust) and a man oddly familiar to her (though she cannot place him for a long time) and is thus sent on another quest, this time to retrieve the titular knife.In this new volume we learn of the string of worlds, people going back and forth, what happens to the party of friends Lyra left behind (Lee, Serafina ...) but also to the old enemies like Mrs. Coulter and the Magisterium (the Authority). Moreover, this sort of opens up many more elements of this story as the trilogy seems to be about so much more than what we brushed upon in the first book. As the multiverse opens up to Lyra, so does the narrative open to the reader.A friend and buddy-reader, Vero, also pointed out the inspiration the author got from Paradise Lost and it's true. I haven't read that other book but heard about it and the story it tells; the exciting story of innocence vs corruption, as well as rebellion and betrayal - all motives that are certainly present in Pullman's book(s) too. It's interesting to see the parallels as well as what he did differently and to guess why. And he's constantly playing with expectations and perceptions.At first it was a bit strange to read about (view spoiler)[angels and Asriel (I always expected his name to be spelled Azrael) wanting to fight the fight with them against Heaven or Mrs. Coulter‘s power over others (hide spoiler)] but I really don't know why as I didn't have a problem with the (view spoiler)[daemons, witches, the magic that makes the alethiometer work (before we got the explanation) etc (hide spoiler)]. However, especially after taking into consideration the afore-mentioned influence of Milton, it did indeed make sense and not really bother me much. As a middle book this was very thrilling and full of information - something most middle books don't manage so I was pleased immensely. The writing style is as fluent and approachable as ever, the characters lively and distinct and I especially like how such a fantastical story, at its core, tells of profoundly simple concepts (such as growing up) by making us accompany not special creatures but \"just children\" ((view spoiler)[for no matter what role Lyra will have to play, she doesn‘t have powers, not really, she‘s just thrust into situation after situation, trying to rise to the occasion, to do the right thing (hide spoiler)]). If one doesn't pay attention, subtle hints and elements can easily be overlooked/overheard, that's how rich Pullman's creation is.Not to mention the emotional blows the author dealt in this. His writing was always vivid and one cared a lot about the characters which made one be so shocked about the betrayal of Lyra's parents at the end of the first book as well as the fate of her poor friend Roger. However, it really hurt to read of (view spoiler)[Lee's sacrifice. I saw it coming when he helped the shaman that I knew to be Will's father early on, but I still gripped whatever I could find and tried to change the outcome by sheer force of will, because that old man was so kind and brave and good - just like his tough and wonderful daemon Hester (hide spoiler)]. *cries* And even (view spoiler)[Will's father, whom we hadn't known all THAT well, was a faithful character (saying No to a beautiful witch because he had a wife and son at home even though he knew he would probably never be able to get back to them) that made reading about his death the moment he realized who Will (hide spoiler)] was so sad!I'm glad we're buddy-reading the whole trilogy one book after another because I'm really at the edge of my seat now and want to know where the author is taking this. I do have my theories, of course, but I can't be sure.As for this audio version, I can only say that it was almost as good as the first. Almost because the beginnings of the chapters had musical intros that were a bit too loud so one could hardly understand the chapter‘s title. Other than that, great cast with impeccable performances."}], "Image": "https://images.gr-assets.com/books/1535965085l/41637836.jpg", "Desc": "ASIN moved from  this editionThe second instalment in Philip Pullman’s His Dark Materials trilogy, join Lyra as her terrifying journey continues.-----She had asked: What is he? A friend or an enemy?The alethiometer answered: He is a murderer.When she saw the answer, she relaxed at once.Lyra finds herself in a shimmering, haunted otherworld – Cittàgazze, where soul-eating Spectres stalk the streets and wingbeats of distant angels sound against the sky.But she is not without allies: twelve-year-old Will Parry, fleeing for his life after taking another's, has also stumbled into this strange new realm.On a perilous journey from world to world, Lyra and Will uncover a deadly secret: an object of extraordinary and devastating power.And with every step, they move closer to an even greater threat – and the shattering truth of their own destiny."}