{"Genre": "Fantasy", "ID": "34497", "Name": "The Color of Magic", "Reviews": [{"Review": "I haven't reviewed this because I read it so long ago that all I can remember is I loved it.I'll take our very old and battered copy (bought in 1987) to the hospice this weekend when I go with Celyn and see if I can't refresh my memory.RIP, Sir Terry.'DON'T THINK OF IT AS DYING,' said Death, 'JUST THINK OF IT AS LEAVING EARLY TO AVOID THE RUSH.'So - to the review!I've just read this in slightly over 24 hours ... which is extraordinary for me. I normally take a month to read a book. It is, to be fair, both a very readable and a very short book (65,000 words - a short fantasy these days is ~100,000 words).I was surprised to find how much of this I remembered, especially as I last read it 28 years ago!It's a very funny book with some GREAT one-liners. I particularly liked one that said about men falling foul of the thieves' guild (I paraphrase) '... men who wouldn't be going home again ... unless they happened to live near the river and their corpses floated by on the way to the sea.\"And this from the character Twoflower was poignant:\"When I think that I might die without seeing a hundredth of all there is to see it makes me feel,\" he paused, then added, \"well, humble, I suppose. And very angry, of course.\" Anyway - incompetent and cowardly failed wizard Rincewind falls in with Twoflower, the naive tourist with an impossibly optimistic attitude, oodles of gold, and an indestructible, vicious and implacable treasure chest on legs to defend him.Hilarity ensues as Twoflower tries to see everything, Rincewind tries not to die, and the gods play games with them. We get a great tour of the Discworld, its geography, magics, and inhabitants, all of which are so fantastically imaginative and amusing that even geography becomes a joy.This isn't Terry Pratchett's best book but it's full of all the great stuff that gathers together into its peak a few books into the series. It's certainly an excellent book though. Pratchett has an incredibly rare talent for compressing humour into one-liners that are witty, incisive, and yet never feel mean - it's not jokes that you feel are directed _at_ anyone, just mined from the stuff of life.I had a great time revisiting this book and if you've not tried it - now's the time!Join my 3-emails-a-year newsletter #prizes...."}, {"Review": "Reading The Color of Magic is akin to eating an entire bowl of ice cream just a little too fast...sure, it may cause your head to hurt at times, but the sweet rewards make it all worth it!Filled with ambitious wizards and ruthless assassins, the city of Ankh-Morpork has survived many dangers in the past, but now it faces an even more destructive force...TOURISM!!! When a rich but bored outsider named Twoflower decides to explore the city in search for adventure, it soon becomes an adventure for everyone around him, too! Twoflower's well-meaning but careless ways earn him the attention of pirates, dragonriders, and various supernatural entities, all looking to rid Twoflower of his treasure...not to mention his life! Soon failed wizard Rincewind reluctantly becomes Twoflower's guide, and as Twoflower explores more and more of Discworld looking for the adventure of a lifetime, Rincewind tries desperately to make sure his lifetime lasts for more than five minutes!This was me for about 80% of this book...Annnnnd here I am for the other 20%....What I loved most about this book was definitely the humor. Some authors can only come up with a great laugh-out-loud moment once or twice in a book, but Pratchett is able to pull one off in just about every page! There are oodles of witty dialogue all throughout the novel, as well as some great slapstick moments. In addition, Pratchett gives us some excellent satire, too. I got a big kick out of how familiar some of Twoflower's ideas were, like when he convinces a bar owner to \"place a bet\" on whether or not the bar will be damaged...Twoflower calls this process \"inn-sewer-ants\"! By having the other characters mock the \"outrageous\" concepts Twoflower introduces them to, it did a magnificent job painting an amusing picture of some of the absurdities of everyday life. \"The Color of Magic\" isn't just a humorous book, it actually manages to pull off several different kinds of humor!Also, I was amazed with the extent of Pratchett's imagination! While some elements of this book are your standard fantasy archetypes, Pratchett really ups the ante by giving us some brilliantly creative concepts as well. With translucent dragons, trolls made out of water, a sentient piece of luggage that manages to display so much personality without ever saying a word, and an upside-down swordfight that has to be seen, errr, read to be believed, Pratchett never runs out of new ideas to entertain his audience with.Alas, while I enjoyed this book very much, I did have a couple of issues with it. For one thing, I felt like Pratchett tried to cram way too much into a book that's barely over 200 pages. So many characters and creatures come and go, it quickly becomes difficult to keep track of what's going on! I have some friends who didn't enjoy the \"Game of Thrones\" book as they found it confusing, but at least George R.R. Martin takes a good amount of time to establish all the characters, whereas this book can sometimes feel like trying to watch a NASCAR race where all the cars are speeding in a different direction! Also, some of Pratchett's ideas were a little too \"out-there\" for me...I knew this was going to be a problem right away, when Pratchett begins the book by revealing that Discworld is a planet that is carried on the backs of four elephants who are all standing on the shell of a giant turtle that is floating through space...\"This is an awful lot to throw at me on page one, Mr. Pratchett!\"Also, while \"The Color of Magic\" works beautifully as a comedy, I'm afraid the actual story doesn't quite hit the mark. The book is divided into four parts, and each part feels like a separate book. Almost anyone introduced in one section is absent in the other three, so we're left wondering what happened to many different characters. While the events of Rincewind's and Twoflower's journey are fun to watch, there's very little true progression or closure. This storytelling technique was especially baffling in the fourth segment, where Pratchett keeps referring to an adventure that we never got to see, as it occurred inbetween the third and fourth sections. This disjointed method of storytelling prevented the book from becoming anything more than just a comedy of errors, as amusing as those errors may have been.So, while I felt this book would have been better if it were a bit longer and some of the concepts had been more fleshed out, I still had a lot of fun reading this hysterically funny adventure. I've been told that the first couple of books in the Discworld series pale in comparison to the later ones. Considering how entertaining \"The Color of Magic\" was, if this truly is one of the weaker entries, I can't wait to read more of the Discworld series! "}, {"Review": "Before picking it up, I'd heard that The Colour of Magic was funny. Now that can mean just about anything because, let's face it, comedy is the most subjective of arts. Funny is a deeply personal thing. The \"funny peculiar\" and the \"funny ha-ha\" might not be the same from person to person or even to the same person depending on their mood or their place in life. So knowing something is funny ahead of reading it really doesn't tell me much. I'd read Terry Pratchett's & Neil Gaiman's Good Omens quite a while ago, so I expected at least a hint of satire and politically conscious wit, but I had no idea which of the authors to blame for the smart laughs in Good Omens, and my recollections really shed no illumination on what was to come. So I read The Colour of Magic with as open a mind as I could and hoped for some laughs. I didn't laugh much and that surprised me. I smiled an awful lot, though. But I didn't laugh. No out loud snickers; no full-out belly laughs; no snorts; no giggles. But I did smile. Pratchett's kooky tale (really four tales to make one) of Rincewind, the one-great-spell, wizarding failure, Twoflower, the in-sewer-ants adjuster/tourist, and his Luggage was smart more often than it was stupid, consciously political, satirically silly, more than willing to take the piss out of Fantasy as a genre, but mostly it was exceedingly absurd. And all of this was what made The Colour of Magic good to very good. Even so, its audience is necessarily limited. I know why I liked The Colour of Magic, and while I imagine there are other reasons to like the story, I think it is probably a fairly inaccessible tale unless you are a reader who falls into a niche of accessibility. This is not a book that can be widely read or widely liked. So why did I like it? I liked it because I fall into a niche wherein I was able to access memories of drunken, drug-addled, teenage D&D marathons (which were extremely rare since we preferred our gaming sober), where we gave up being serious and descended into near madness. Those nights are reflected in everything that happens in The Colour of Magic. Obligatory bar fights of fantastic impossibility, Monty Hall swords and treasures, idiotic last second rescues, gods dicing, heroes thinking with the dirk in their pants, dimensional slips and deus ex machinas at every turn make The Colour of Magic a collage of gaming stupidity, and it was nice to take a nostalgic trip back to my adolescence. In fact, Pratchett captures exactly the sort of gaming experience that led our halfling priest of Xyice, God of Mischief, to wish for a foot long penis then fall unconscious from blood loss when he achieved his first erection. So I liked this book...a lot, actually.But it wasn't the best story I've ever read, and I can't imagine I could sit down and read the entire Discworld cycle without a break. It's fun. It's light. Pratchett writes better than I expected, but I bet there are many folks out there who hate this book. You have my sympathy. So yes...I was disappointed that I didn't laugh more; I was disappointed that the story wasn't more subtle; I hated the turtle carrying the disc; I wanted The Colour of Magic to be more biting than silly, more critical than absurd, more intelligent than clever. But it was a fun ride that entertained me while I did the dishes, and I couldn't help liking Rincewind, so I will probably go on, and I will likely become a fan of Pratchett's Discworld books...in spite of themselves. "}, {"Review": "And so it begins … Sir Terry Pratchett’s wildly imaginative Discworld series begins with the 1983 publication of The Color of Magic.I have been reading science fiction and fantasy for a long time and somehow I managed to not read any of his works until I came in late to the party. A friend suggested I try one, I’d like it and so I read the fourth in the series, Mort and I thought so much that I decided I would climb the hill and enjoy every step.Begin with a heaping portion of British humor (humour), mix in a share of Douglas Adams, sprinkle liberally with Monty Python, throw in a fantastic amount of fantasy from the Piers Anthony brand of fiction and top with a wink and a nod and you have Terry Pratchett Discworld embarkation. The Potent Voyager has set sail and much mirth and irreverence is certainly to follow.2019 - These are SO MUCH FUN!!!!"}, {"Review": "This must be the exception that proves the rule. For years I’ve been adamantly advocating reading series in publication order, whether a coherent story or a set of standalones. In Discworld, that simply doesn’t seem to be the best solution. Everyone seems to suggest that a new reader should not start with the first book, so this must be partially my fault for doing it anyway.The Colour of Magic is at best a mediocre introduction to what is supposedly the best humourous fantasy series ever written, by the legendary Terry Pratchett. Granted, the wild descriptions of the cosmology and topography of the Disc are indeed interesting, the writing is good and there are a few funny lines. However, I expected a lot more going on. While the total lack of a coherent plot is understandable in a series based on humour, the lack of humour is really not.That does not mean I didn’t enjoy the book. This rating may be a bit harsh, but it does seem to mean that I found the book to be “okay”. I am not discouraged from reading more books in the series, and I both hope and choose to believe that they are of a much higher quality than this first one. For the style is there. It’s only the substance that’s missing.That said, the race between two and three stars was pretty much a tie. Being a generally evil person, I opted for the lower option.I often see Pratchett compared to Douglas Adams, and just as often hailed as “the Douglas Adams of fantasy”. And so far, he unfortunately does not come close. You may be a legend, Sir Terry, but it takes a lot more to be a Douglas Adams."}, {"Review": "The Color of Magic (Discworld #1), Terry PratchettThe Color of Magic is Terry Pratchett's maiden voyage through the now-legendary land of Discworld. This is where it all begins -- with the tourist Twoflower and his wizard guide, Rincewind.تاریخ نخستین خوانش: ماه می سال 2016 میلادیعنوان: مجموعه جهان صفحه کتاب 01 - رنگ جادو؛ تری پرتچت (پراچت)؛ مترجم: آرزو احمی؛ تهران، ویدا، چاپ اول و دوم 1391؛ در 287 ص؛ چاپ سوم 1392؛ شابک: 9789646807853؛ موضوع: داستانهای نویسندگان انگلیسی - سده 20 مدیسک ورلد، مجموعه ای از کتابهای فانتزی ست، که: «تری پراچت»، نویسنده ی انگلیسی، آنها را نوشته است. داستان‌های این مجموعه، در جهانی به نام «دیسک‌ ورلد» می‌گذرند، که صفحه‌ ای صاف است، و بر شانه‌ های چهار فیل بسیار بزرگ قرار دارد. فیل‌ها نیز، به نوبه ی خود، بر پشت یک لاک‌پشت غول‌ آسا، با نام: «آتوئین بزرگ» جای دارند. در این مجموعه، بارها از کتاب‌های نویسندگانی همچون: «جی. آر. آر. تالکین»، «رابرت هاوارد»، «اچ.پی. لاوکرافت» و «ویلیام شکسپیر» با طنز یاد شده‌ است. از مجموعه ی «دیسک‌ورلد» بیش از هشتاد میلیون نسخه، در سی و هفت زبان، به فروش رفته‌ است. این مجموعه، در برگیرنده ی بیش از چهل رمان، یازده داستان کوتاه، چهار کتاب علمی؛ و چندین کتاب مرجع و مکمل نیز هست. از این مجموعه چندین رمان تصویری، بازی کامپیوتری، نمایش تئاتر، مجموعه ی تلویزیونی نیز برداشت شده‌ است. ا. شربیانی"}, {"Review": "I'm pretty sure people have told me about Pratchett and his Diskworld series before, usually working in the phrase \"He's the Douglas Adams of fantasy\" into the description. But the problem was that I always felt that I had had enough of Adams after the third Hithiker's Guide to the Galaxy book, and whenever I scanned Pratchett's section in the bookstore I was immediately put off by not knowing where to start reading among the approximately five hundred thousand Diskworld books. I'm glad I finally took the time to find out that these two books, The Colour of Magic and The Light Fantastic, jointly comprise the first tale in the series, and that they were definitely worth reading.The Diskworld books are essentially satire of the high fantasy genre, or at least that's the foundation upon which everything else is built. This pair of books follows the misadventures of Rincewind, a utterly inept and thoroughly cowardly wizard, and Twoflowers, a clueless traveler who happens to be in possession of both endless optimism and a magical suitcase that's always wandering off and messily devouring people who get in its way. Things go from bad to worse for the two as divine powers both deliver them into and yank them out of all kinds of fantastic perils.As someone who grew up reading plenty of this kind of thing and playing a lot of Dungeons& Dragons, I'm familiar enough with the genre and trappings that Pratchett lampoons. Yes, there's the Conan parody, there's the Dragonriders of Pern tribute, there's the in-joke about Leiber's Fafhrd and Gray Mouser. But that's easy. The thing that made me almost immediately fall in love with these books is the author's dry wit and his ability to derive humor not only from the absurdity of the story (and believe me, it gets plenty absurd) but also from just good old fashioned turns of phrase, wry commentary, and jokes. The guy just has an amazing ability to stuff five or six jokes into a single sentence, most of them making masterful use of that trusty standby of British humor, irony. It's really smart and really funny, and the fact that it builds on the inherent silliness of the high fantasy genre is just icing.I should also note how imaginative Pratchett is, which is a useful quality given his subject matter. He bounces his heroes from one (generally horrible and dangerous) situation to another at a frantic pace, and his ability to come up with new material and new situations amazes me. And while many of them are obvious parodies of fantasy staples, just as many seem to be wholly new creations. As one small (and obligatory) example, the Diskworld itself is a flat coin of a world that rides atop four enormous elephants, who themselves ride on the back of a colossal turtle with two continent-sized flippers that it uses to swim slowly through the cold reaches of space.But at the same time, if I have one complaint about these first two books, it's that they're almost maniacal in their plotting. While it's nice to see Pratchett's considerable imagination and humor on display as we go from situation to situation, the first book reads like an extended doodle with little plot and a whole \"gods playing games with mortals\" subtext that's entirely dropped in the next book. There's also one Conan the Barbarian parody that's abruptly dropped in favor of another Conan the Barbarian parody who Pratchett apparently liked better. It's not until the latter part of the second book does an overall plot come into play, but honestly I was enjoying myself so much I really didn't mind. Expect to see lots more Discworld books reviewed here in the future. "}, {"Review": "If I hadn't already read the entire series, and if I was judging this book just by its own merits, I'd still be saying that it harnesses the lightning and even finds a way to make it go side to side rather than up and down.It's really fantastic as a straight fantasy with tons of humorous elements, with a good deal more worldbuilding than all the later books, more obvious and harsher tongue-in-cheek elements, and a great setup for the Great Wizzard Rincewind.Honestly? I love Rincewind. I love the shard of the Great magical spell lodged in his brain, Death's endless chase for him, the straight adventure he finds himself in, and the sheer fact that HE SURVIVES.Twoflower is awesome, too, and the chest is one of the greatest unsung heroes of the age, and there is a very good case to be made that this whole novel (and the one following it) is probably the BEST INSURANCE MAN'S TOURIST GUIDE EVER WRITTEN. :)'Nuff said.Am I sad that Sir Terry is no longer with us? Yeah."}, {"Review": "Oh what fun, review to follow 😊😉So here is my review. I first read this I'm guessing some time around 1990, and then went on to read the sequels as they were released,until sometime around the millennium, when for various reasons I moved house and lost around 5000 books 😱Anyway I haven't read another Terry Pratchett Discworld novel since then. So when I was bought the first twenty in the series earlier this year I did a little mini dance (similar to the Floss ha ha) and looked forward to when I could start. Well that time is now and so I've started on the series.In my opinion this book is really Sir Terry getting into his stride and is not as good as a lot of the later entries in the series. Having said that it features Rincewind and the luggage as well as a few appearance from  DEATH so it has a lot of redeeming features. The adventure is a little disjointed but still huge amount of fun, and it did (as per usual) have me laughing out loud as I sat in bed reading it. Yes I did thoroughly enjoy it, but I know it gets better , a lot better, so it just scraped 4 stars. 🌟🌟🌟🌟Now I was trying to save reading the next book until 2019 as I have others I must finish first, but the problem is (as any Discworld lover will tell you), is that once you start you have to carry on, oh what a quandary."}, {"Review": "This series is much beloved of my friends, both here on Goodreads and out in the wilds of meatspace--he's even been referred to as Fantasy's answer to one of my favorite authors: the superlatively funny and insightful Douglas Adams. As such, I was excited to start the series at the beginning, hoping the wit and wisdom would overcome the warts of this early outing. Unfortunately,the jokes drew more groans than guffaws, reminding me of Mark Twain's comments on the book of friend and fellow American treasure Ambrose Bierce:\n\"There is humor in 'Dod Grile', but for every laugh that is in his book there are five blushes, ten shudders and a vomit. The laugh is too expensive.\"\nPratchett has none of the wry, oddball musings of Adams, and seems to me to be less the Fantasy version of that author and more the British version of endlessly 'punny' writer Piers Anthony (though thankfully without the unsettling implications of pedophilia). After finding this one unpalatable, a friend suggested I try one of his later books, so I started Moving Pictures, but while it was more competently crafted, I found it no more amusing. I guess you can't trust your friends.I've since been told to try another of his books--most often Night Watch and Small Gods are mentioned, but I find it impossible to work up any enthusiasm for another outing with Pratchett--perhaps one day, I'll get there.My Fantasy Book Suggestions"}, {"Review": "Terry Pratchett is a genius, as usual. This man can do no wrong. He reminds me a lot of Douglas Adams, my favorite in the realm of satire. Look at this similarity:\"In the beginning the Universe was created. This has made a lot of people very angry and been widely regarded as a bad move.\" - Douglas Adams, The Restaurant at the End of the Universe\"Disc philosophers agree that the First Men, shortly after their creation, understandably lost their temper.\" - Terry Pratchett, The Color of MagicThe Color of Magic tells the story of Rincewind, a cowardly fake wizard who happens to carry the most powerful spell in the Discworld in his mind. Rincewind is tasked with protecting Twoflower, a naive but totally loaded insurance agent out on a tour of the world, who has more luck in one day than anyone should rightfully have their whole lives. Joining the travelers is a multi-legged, man-eating, overprotective chest of luggage. The gods then play dice with their lives - literally. Chaos and hilarity ensue.My favorite character, indisputably the biggest BADASS of the book, was the Luggage. It follows Rincewind across the Disc and protects him from any threat. It also has the uncanny ability to convey emotions (mostly menace) without possessing any facial features. I'm eternally jealous of Twoflower for owning walking luggage - I have to drag my possessions everywhere.I love Terry Pratchett's ability to make fun of corruption, greed, cowardice, and other evils so common in the world without coming off as bitter or even very critical. He creates characters with many faults but makes them lovable anyway; Rincewind being the big example in this book.Besides that, Pratchett is insanely skilled at writing simple but funny prose. Some examples: \"The door flew open, badly damaging the assassin who was standing beside it.\"\"He drew his sword and, with a smooth overarm throw, completely failed to hit the troll.\"\"Bel-Shamharoth screamed, a sound that started in the far ultrasonic and finished somewhere in Rincewind's bowels.\"I'm attempting a full Discworld series read-through, one book per month. Check back in just over two years to see if I'm done yet xD"}, {"Review": "The Color of Magic is, in fact, four novella-length stories stitched together to create a novel-length book. But don't you worry, the book reads well as a whole without a jerking bump to stop the journey. I wouldn't have even noticed the stitching if I haven't known it was there.As the story starts, Rincewind a disgraced wizard meets up with Twoflower an oblivious tourist and his rather menacing walking luggage (yes, with a luggage like Twoflower's you don't have to worry about carry your things around; the several pairs of feet under the large chest will follow you keeping your belongings close by and always safe... did I mention the luggage may eat anyone trying to rob you?). Wizard and tourist are thrown together by unforeseen, and fantastic -but not at all unbelievable- circumstances, and soon engage in a tour of Discworld (the alternate universe born from Pratchett's supreme inventiveness). The tour is funny and surprising, and the story will carry you around without effort. However, if you're looking for a tight plot, consistent world building, or if silly British humor annoys you, this novel, and all Discworld for all that matters, may not be for you. The plot does meander a bit, but Pratchett's writing skills keep your focus somewhere else, so you don't even care.One thing is clear even in this the first novel of the Discworld series, Pratchett has bucket loads of talent. If you like to laugh, then Pratchett's your man. His comedy timing is fantastic, and he possesses the intellect and the ability to make you laugh out loud regardless if you like, or read, or are even familiar with fantasy (nonetheless, some familiarity with the basic tropes of fantasy will aid in your enjoyment).However, if you've read other Discoworld novels, you will notice that when it comes to topical humor, this novel is a bit thinner than Pratchett's later additions to the series; understandable, since it was written more tan two decades ago. Now, regardless of it age, the novel still feels remarkably fresh , mostly thanks to the imperishable quality of humor in which we laugh at ourselves."}, {"Review": "It had some funny moments, but I really struggled to get through it. In all fairness to the people who suggested I read the Discworld series, this is not one of the ones they said I should start with. I think I mostly had a hard time slogging through all of the world-building and made up words. Fantasy has never been my thing, because I'm not someone who enjoys reading descriptions of the characters surroundings. I'm not giving up on the series, though. I think I'll just go back through my book recommendations and find the ones I was told to start with. "}, {"Review": "“It is at this point that normal language gives up, and goes and has a drink.”I never really planned to read this until I met someone who loves the Discworld novels so much that I could no longer put them off. Also, this series has so many books that I will probably never be able to finish it, which kept me from reading it in the first place. Apart from the fact that they always seemed a bit too ridiculous to actually be good.Now, I did catch myself laughing a few times and generally enjoying it much more than I thought I would. The humour ranges from immature to fantastic and makes for a very entertaining read. Apart from that, the stories are fast-paced, imaginative and exciting. It won't take long for me to pick up the sequels, I'm sure.Find more of my books on Instagram"}, {"Review": "A charming and sometimes tedious novel, Rincewind grew on me quickly and I enjoyed watching him get into and out of scrapes along the way. Death's and Fate's frustration with him was hilarious. I kept imagining them as toddlers stomping their feet :-D.Two Flower I was so so on... sometimes he charmed me and others... eh. His optimism seemed misplaced sometimes, but he had good intentions.A nice start to the series, plenty of action and some humor :) The scenes with Krull and near the edge of the world were one of my many favorites... I sympathize with Rincewind and the vertigo sensation of looking over the edge *shudders* I'd rather stay on land thanks.It seemed alot to cram into one novel, at times my eyes glazed over and I had to re-read a couple passages. Don't get me wrong, it was all interesting but it could've been spread out more.An enjoyable ride nonetheless, this world is one I wouldn't mind living in and/or visit from time to time. Hats off to you once again Mr. Pratchett for bringing this to us :)Read David's excellent review , he captures it wonderfully."}, {"Review": "Meh. It just didn't do it for me. Unfortunately, this book has been recommended to me so many times by well-meaning friends who know my love of absurd British humor that it couldn't possibly live up to the hype. It suffers from The Hitchhiker's Guide to the Galaxy syndrome. For years, everyone I knew--friends, family, students, co-workers--would ask me if I had read Hitchhiker's and their mouths would drop when I admitted no, I hadn't . . . yet. Their response was always the same, \"Oh, but you have to! It's like it was written for YOU!\" By the time I got around to reading it, there's no way it could have lived up to the expectations that had been percolating for years. Ditto for The Color of Magic. I'll admit, Pratchett has a way with words and there was the occasional turn of phrase in response to which I made that air-escaping-from-the-nose sound that's not full bodied enough to be considered a snort of laughter. There was the infrequent half-smile. A few head nods in appreciation of a clever conceit. But, alas, there were no tear-inducing uncontrollable fits of laughter, which is what I expected. Will I read more Pratchett? Yes, because I have at least three more books by him lying about. I just hope they're better than this.Cross posted at This Insignificant Cinder"}, {"Review": "\nPrecisely why all the above (below, in this review, I guess) should be so is not clear, but goes some way to explain why, on the disc, the Gods are not so much worshipped as blamed.\nHave you ever wondered about what would happen if you were merely a pawn in a game played by gods? Have you ever wondered about how living in a Flat-Earth would be? Would you like to learn about what failed wizards do in their free time? Are you curious about how dragons are born and how they rest? Do you want to understand what insurance actually means? If the answer to any of these questions is yes, then The Colour of Magic is the book for you. However, if you're a pragmatist, and lack imagination, I would suggest you steer clear of the book.Welcome to Discworld; the land of the strange and scary, of the weird and wonderful. It's important to know, before you enter this magical and frankly absurd land, that you are a pawn in a life-sized game of Dungeons and Dragons. There is no escaping that. Do not make deals with Fate, do not sing prayers for The Lady; perhaps, just perhaps, you might just survive. Though, well, you do start to question whether surviving is actually worth it. Journey along with sarcastic and cynical Rincewind, a failed wizard, and Twoflower, a tourist under his care. Rincewind is an extremely likable character, a rationalist, and quick-witted to the core. \nRincewind often suspected that there was something, somewhere, that was better than magic. He was usually disappointed.\n Twoflower, who sells inn-sewer-ants polly-see, on the other hand, is a typical tourist - he gets excited at every instance, and would rather photograph a fascinating sight than run for his life. \nTwoflower was a tourist, the first ever seen on the Discworld. Tourist, Rincewind had decided, meant “idiot.”\n Together, the two make a hilarious and engaging pair, and their story is a definite laugh riot. There are books that employ elements of satire to prove a point; this book, and I believe the series by extension, are wholly satire, and I found myself literally laughing out loud at more than one point. The story starts at Ankh-Morpork, a city so rife with accidents, nothing quite astounds their citizens anymore. A city of thieves, fraudsters and scoundrels. A city through which flows the filthy River Ankh. \nIn a city where public executions, duels, fights, magical feuds and strange events regularly punctuated the daily round the inhabitants had brought the profession of interested bystander to a peak of perfection.\n The city of Ankh-Morpork perhaps best explains human beings as a species. Their casual nature, their inclination to defraud, rather than help people in trouble, and their undying love for gold. The journey from there is a meandering one, onto the Temple of Bel-Shamharoth, the temple of the Soul-Eater. There is an escape into the world of Dragons, through an actual aeroplane (like the ones we have on Earth), and onto the Circumfence, yes, Circumfence, not circumference, because you do need a fence at the rim of the Discworld. Our two friends here, they meet heroes and villains, and creatures we mustn't speak of.In his dry and totally British way, Pratchett mocks religion, and the religious. \n...the ravaged roof of the Broken Drum, was wafted high into the Discworld’s atmosphere on the ensuing thermal, and came to earth several days and a few thousand miles away on an uloruaha bush in the beTrobi islands. The simple, laughing islanders subsequently worshipped it as a god, much to the amusement of their more sophisticated neighbors. Strangely enough the rainfall and harvests in the next few years were almost supernaturally abundant, and this led to a research team being dispatched to the islands by the Minor Religions faculty of Unseen University. Their verdict was that it only went to show.\n He laughs at humans and their follies, at our propensity to regale ourselves with tales of heroes of yore. As says the resident Hero of the book: \n“I expect in a minute the door will be flung back and I’ll be dragged off to some sort of temple arena where I’ll fight maybe a couple of giant spiders and an eight-foot slave from the jungles of Klatch and then I’ll rescue some kind of a princess from the altar and then kill off a few guards or whatever and then this girl will show me the secret passage out of the place and we’ll liberate a couple of horses and escape with the treasure.”\n Satire at its absolute best, whole book is. Learn about Dragons you can summon with your imagination, and the significance of the number 8. Experience the colour Octarine, and the 8-banded Rimbow. Communicate with different languages whose words make no sense at all. Understand how magic is actually, really, quite difficult. Have hair-raising adventures with Rincewind, Twoflower, and his sentient luggage, Luggage. Curse the gods, the ghosts and the monsters. Read Discworld.\nIt was all very well going on about pure logic and how the universe was ruled by logic and the harmony of numbers, but the plain fact of the matter was that the Disc was manifestly traversing space on the back of a giant turtle and the gods had a habit of going around to atheists’ houses and smashing their windows.\nP.S., before I sign off, my good friend, The Doctor would like to explain to you what time is, because here, on Discworld, it's important to know what time is, and what it isn't."}, {"Review": "The very first Discworld novel. The one it all began with.I've been a fan of Sir Terry's for a long time. I've even read a few other of his books (some standalone, some of the Fairy Tales or later volumes of this series) and loved them all.Fans have given me two pieces of advice ever since I first heard of Discworld:1) Stay away from the first 3 books!2) Read them all! What are you, a savage?!*lol* You can see how this made me undecided for the longest time.Thus, I did what every self-respected bookworm with no idea what to do would do - I let the matter rest and, in time, watched a few of the movies first. Bwahahahahaha!The movies weren't bad at all despite apparently never having had the appropriate budget and I found myself wishing for more.All the while I collected the books (I'm very particular about the covers/editions), magnets, bookmarks, postcards, original art, pins and \"science books\" about the Discworld.And then Sir Terry died.Even while writing this my eyes water. It was, if you believe it or not, another reason to put off reading the books.In the meantime, I've collected all of the volumes I wanted (DEATH, witches, Tiffany and more) and have the others as ebooks/audiobooks, but it was time to finally start reading the series so when we talked about just that in the group, I had no further excuses.This volume introduces readers to the Discworld that stands on the backs of four elephants which in turn stand on the shell of the great turtle Great A'Tuin that floats through space. Science as we know it doesn't apply here as gods are real, so is magic, and many things exist solely because people believe in them.It is about a wiz(z)ard named Rincewind and his adventure (or at least the first half of it) with Twoflower, a visitor from the counterweight continent. Twoflower being the very first tourist means a lot of miscommunication (people in Ankh-Morpork, where he lands first, don't know what glasses are for example). This gives the author the great opportunity to mock tourism in general with people experiencing foreign places through the lenses of their \"picture boxes\", speaking in not really helpful sentences out of dictionaries. Interpsersed we get funny takes on insurance (utterly unheard of in Ankh-Morpork) and the whole \"hero\" business then and later in the book.Rincewind, one must admit, isn't exactly the greatest of wizards, but his quirky way is endearing.He and Twoflower travel from Ankh-Morpork to Quirm (or at least towards it), Wyrmberg, and even the Edge where they meet the people of Krull. They stumble from one catastrophe into the next, all the while being unaware that their encounters are actually caused by gods (they are pieces on one of their board games).This means that the reader gets to see a number of corners of this unique world that so perfectly mirrors the craziness of our own. We even get an overlapping when Rincewind calls a plane from our world to save himself and Twoflower. *lol*One comment about Rincewind. Not sure what Sir Terry intended (he had a cameo in the movie so he must have known about the interpretation of Rincewind for the screen) but he seems to be younger in the books than in the movie.Book Rincewind on covers: Movie Rincewind (right): And yes, the actor reminds me a bit of a male Maggie Smith with his gestures and facial expressions (he is as cynical and grumpy as the Dowager Countess Grantham after all).The story then concludes with a quite literal cliffhanger (bad play of word, I know) and picks up immediately at the start of the next book so technically they belong together.Now, for the actual impression.I can see why many have told me not to start the series with the first book. I am a completist and I like to read in chronological order even if it might not be 100% necessary. So doing this was the right choice. That being said, I have to admit that some spins on ideas the author played with in this were ... not too original and therefore not too funny. Sure, I enjoyed the \"Big Bang\" joke right at the beginning and loved the cynical view on many things, but overall it really could have been sharper.Moreover, and this is my fault alone, many stabs at classic fantasy bits were (if not completely then at least to some degree) lost on me. Sure, I got the parody of heroes and stuff, but none of that was laughing-out-loud material. Yes, it almost sounds like blasphemy, but it is obvious how old the book is, in what early stages Sir Terry still was and yet - and YET - you can already see and feel the greatness poking through with a dagger (Assassin's Guild style)!P.S.: For anyone wondering, luggage really was a fantastic character and I expect it to be at least this good in the next too."}, {"Review": "I first read this book many years ago and I remember I fell in love with the Disc World as soon as I read the first few pages. I loved the idea of the turtle swimming through space and the elephants and the rim fall and the eighth colour in the spectrum called octarine. Twoflower and Rincewind were the first of many of Pratchett's characters I would meet who are so helpless and yet who blunder successfully through mishap after mishap. And as for the Luggage! That has to be one of the best inventions ever. I have just reread this book in honour of Terry Pratchett after his recent death. However I find - just like last time - I am not going to be able to stop at one. I am back in the Disc World and loving it:)"}, {"Review": "I dunno if this is going to be a proper 'review' (heh, as though any of the things that I write in this space are...), it'll likely just be a bunch of randomness and ranting. So, like my usual offerings.I read Amanda's review (This'un.) and I'm all like \"Yep.\" This is one of those books/series that people love and it makes me want to love it and then I set crazy goals for myself, like reading them... all... in a year... just maybe not this one... and then when the first one ends up NOT being the fucking greatest thing since ever, I feel disappointed. It's unfair. (To me, I mean. I don't care if it's fair to the book if others have set my expectations too high and then it didn't live up to them. It's a book. It doesn't have feelings or a brain and thus cannot understand why it should feel sorry for me.)But, to be fair to the expectation raisers, I'd also read Good Omens by Neil Gaiman and Terry Pratchett, and I really enjoyed it, so that also tended to set the bar higher and make my fall just that much further. Sadface.Anyway. So, in a discussion with a friend, she mentioned that \"The Colour of Magic is basically a collection of in-jokes about other books.\" Which goes a long way toward explaining why it didn't work for me. 1) Because, of the authors mentioned whose work is being joked upon or referenced or whatever, I've read very little to none at all, and therefore would be quite the opposite of the intended audience, if, as I would presume, the audience is intended to get the jokes and/or references. 2) I just really dislike this kind of homework prerequisite reading thing. Zelazny did the same thing with A Night In The Lonesome October, and even though I had read much more of the referenced and hinted at works he incorporated into his story, and so should have been more \"in the know\" and thus able to enjoy it more, I didn't. I don't read that way. I am not analyzing every line looking for something else - I'm looking for the author to tell me a story. And this kind of storytelling is both lazy and too much work at the same time, if you ask me. Don't get me wrong, I like easter eggs in books. I do. I like little references that people in the know will get and have a little something added... it's nice. I like it. But, in my opinion, it should just be that - a little something nice added. People who don't get the reference should not even notice it, because the story is standing on its own legs and is complete without it. If the story doesn't make sense ON ITS OWN, and if I need to have read an entire genre or two's worth of books just to follow the events in your story - I'm not going to enjoy it. I don't read to interpret A to be a reference to X from book Q and need to know X from Q's history to understand what A is doing in your book. I just want a good fucking story. Tell me one, and get on with it. But about the book itself, I dunno what to say. It didn't feel like a novel, which was how I approached it, it felt like a set of stories just sharing some characters and a general world setting. I think trying to read it as a novel, looking for the overarching story from page 1 to page 200-whatever, set me up for failure as well. If I had read this as each chapter being a vignette story, that would probably have been better. Likewise, it just seemed to forget some of the conflicts that were raised. In the beginning of the book, the Patriarch (or whatever he's called) threatens Rincewind with death if anything untoward should happen to Twoflower the tourist... but that passes like a leaf in the wind and nothing ever comes of it and is never mentioned again. In fact, every danger is just gone as soon as its gone. There's no follow-up, there's no consequences... heck, most of the time there's no rational, logical reason that anything happens (or doesn't happen) in the first place. And that is one of my least favorite things. I hate when there are no rules and anything and everything and the kitchen sink are just possible because why not? It's WHIMSICAL! -_- Grrrrr. So annoying. It was like 200 pages of deus ex machina. I didn't care about any of the characters I think I was meant to care about. I liked Death, and the Luggage. I was rooting for them both to take their due from Rincewind. Maybe next book. By all accounts, the Discworld books get better, and I'll probably go along and hope for that, but my patience has thinned quite a lot. I'll give this series another chance, but if it continues on this way - with the references and the deus ex machina in place of proper storytelling, and the unfunny (because man, I didn't even crack a smile!), I'm writing it off. Life is too short.2 Stars for POTENTIAL, and I'm being generous here."}, {"Review": "suspira....Mientras mas alto pongo mis expectativas, mis caídas son peores, y al parecer con esta caeré, caeré y seguiré cayendo. Amo la magia, los dragones, y reconozco la creatividad y humor de Pratchett; entonces ¿Qué paso? una lógica tan profunda como Alicia en el pais de las maravillas, unos saltos de trama que me desenfocaban, y el final.... (view spoiler)[Toda la Creación estaba esperando que Rincewind cayera. Y lo hizo. No parecía tener otra alternativa. \n(hide spoiler)]ese final... pensé que a mi libro le faltaban paginas. No entiendo, se que el mundodisco tiene muchos fans, que es una de las sagas fantásticas mas amadas, ¿entonces...? esta historia tal vez no sea para mi...Haré algo que nunca he hecho en mis reseñas, pido a todos los fans de Pratchett que andan por esta red que me expliquen que pudo haber pasado, ¿Debí empezar por otro libro? ¿En las continuaciones se atan todos los cabos sueltos que se dejaron? ¿La escritura de Pratchett mejora? "}, {"Review": "Back to where it all began. I think this is my third time reading this, but that does show how long ago my introduction to this series was. I have a huge affection for this entire series and the author as a human being, but I'm actually quite glad that I wasn't a more sophisticated reader when I was first exposed to this. If this had been my first exposure to his work today, I'm not sure I would have continued with them.In summary, the Discworld experiences its first tourist, Twoflower, from the incredibly rich Counterweight Continent. Along with his Luggage and magic picture-taking box Twoflower encounters the wizard Rincewind who gets recruited as his guide to the wonders of the Discworld. From there, adventures ensue in the city of Ankh-Morpork, the Temple of the Sender of Eight, a hive of Dragonriders and eventually the edge of the Discworld itself.The first of the series is very much a satire of the whole fantasy field. Ankh-Morpork is a very thinly veiled Lankhmar (complete with Bravd and the Weasel). The barbarians that Rincewind and Twoflower meet are lifted straight from Robert E. Howard. The Dragonriders are a homage to Pern and Boris Vallejo. And Tolkien and RPG references abound as well. The book even has the classic \"fix-up\" novel structure where a novel is made up of linked stories that were published in pulp magazines separately.The book does what it intends to do: satire the fantasy field of the time. Pratchett's innate creativity shines through though and there are plenty of original creations that are the seeds of the brilliance of later Discworld novels, but this is clearly very early. The Patrician of Ankh-Morpork is introduced here, but he is just Generic Shrewd Ruler, rather than the razor-sharp mastercrafter of civilization that he is in later books. Death shows up as well, and has something of the dry wit of later books, but he's vaguely petulant rather than the character who can say \"LORD, WHAT CAN THE HARVEST HOPE FOR, IF NOT FOR THE CARE OF THE REAPER MAN?\"Pratchett also becomes a great novelist in structural terms with great attention to pace and plot. That's not in evidence here, and I felt it was a bit of a slog to get through."}, {"Review": "Magic never dies. It merely fades away. I first visited the world of Discworld at the age of twelve when I was still wolfing down picture books and fingering through easy-peasy written books. Then one day, I saw a friend prancing around with this book to classes. I have a sharp eye on colourful book covers and this one's won me over. I demanded asked to borrow this and right on the spot, he let me.Back home I immediately flipped to page one. Upon the first few paragraphs however, my brain went dead.Has someone ever tell you a joke that is supposed to be funny but you just don't get the meaning? That was how it was like with this book. I didn't get the humour and the worldbuilding was much too intricate for me to swallow.So in the end, I gave up after 15+ pages in. The next few days after my defeat, the book was returned back to its owner. I did not look back after that. Six years later, I revisited Discworld, and I can safely say that I absolutely love the adventures this time. The worldbuilding took a while to piece itself together but when it did, the final image is fantastic and utterly magical. Imagine a whole world being carried on the backs of four elephants standing on the shell of a large, gigantic turtle (sex undertermined) as it moves slowly throughout space.Bizzare, isn't it?That is what I would describe the whole story. Bizzare, and completely out-of-the-blue. Rincewind who's an incompetent, dull-witted wizard found himself acting as a tour guide for the naive, gullible, and painfully optimistic Twoflower who had just arrived in Ankh-Morpork hoping for an unforgettable adventure. Armed with a hundred-legged Luggage that can snap and bite, a bag full of gold and a picture box (camera), he is the very image of a tourist except with the label 'KIDNAP ME AND TAKE ALL MY GOLD' slapped on his forehead. When Twoflower got kidnapped for his money, Rincewind was forced to rescue the fellow.\nTourists, Rincewind decided, meant Idiot.The Colour of Magic is a series of adventures and unfortunate events between a cynic wizard and a happy-go-lucky tourist.I don't think I've ever laughed this hard after  Good Omens, another fun satirical book. The story is always delivered in full humour, always even when things turn a wee bit grim. This time though, the witty remarks are not lost on me. Much like the title promised, the book is full of colour and magic (don't expect too much from Rincewind though. He may be a wizard but he only knew one spell). It never failed to keep me on my toes with its fantasy elements that keep pouring in. There are dryads, elves, dragons you must imagine to conjour to life, a walking Luggage, an imp who paint pictures, a talking sword, hydrophobic wizards, gods, goddesses, and DEATH Himself. Adventures after  adventures! If you want a fun read then this book is something to be reckoned with.'It was octarine, the colour of magic. It was alive and glowing and vibrant and it was the undisputed pigment of the imagination, because wherever it appeared it was a sign that mere matter was a servant of the powers of the magical mind. It was enchantment itself.But Rincewind always thought it looked a sort of greenish-purple.'"}, {"Review": "I read this book way back in high school, when I lived in England. Having forgotten everything except for the fact that there was a trunk that liked to eat people, I bought the book (again) to see how it stood up these many years later. As I've read I've received goodreads messages and been spoken to by several people who have warned me that Pratchett was just warming up with this one, that he hadn't reached his highest form yet. I still have to read more of his work (I'm planning on Mort and Guards! Guards!), so I have no benchmark to measure against other than what I thought in high school versus what I think now. And while the book is funny, it's not as hilarious as I remember it. I've probably become a little jaded since those days, which is more a reflection of me and my experiences than it is of Pratchett and his writing. That's not to say that the book was bad, it wasn't. In fact, it's got some moments of pure brilliance and was, in some ways, much more well-written than I had expected. The exchange between the Arch Astronomer of Krull and Goldeneyes Dactylos smacks strongly of the sort of humor one would expect in a Jeeves and Wooster story. And that is the highest compliment I think I can give to a piece of humorous writing. The section on the Wyrmberg sniffed in Michael Moorcock's direction. And at least a couple of the characters were spoofs of two of my favorites: Fafhrd and Grey Mouser.I must admit that I also liked Rincewind, the bungling wizard. Some have labelled him a coward. I'd call him . . . normal. Someone like you or me: allergic to pain, justifiably afraid of being dropped from great heights, fearful of fear itself, and yet he commits himself to get done what needs to get done when it really matters . . . most of the time. Unlike, say, Gandalf, Rincewind is full of foible and, as a result, a really loveable character. At least he was for me. I feel for the guy. Sometimes what I'm feeling is embarrassment, but I feel for him.Poor Rincewind. I do hope to see him again.Twoflower, the other main character, I liked at the beginning, but by the end of the book he seems to have become rather withdrawn and almost a touch (just a touch) sullen. I couldn't figure out why he changed so much through the book, so I'm left to speculate.Maybe he became jaded after high school, just like me."}, {"Review": "Are you looking for a book about a frustrated, incompetent wizard-loser guiding a tourist around a world comprised of a flat disc sitting on a turtle’s back, a gigantic turtle that flies though space?Well, look no further - The Color of Magic is your ticket!Of all the Discworld books, of all the craziness, the thousands of jokes, the laser-guided satire of fantasy novels so good that it became almost its own genre, for me the Color of Magic is the one book to rule them all.Maybe it’s because this one was the first, the original, that it still seems so fresh, even thirty-five years after its first publication.So many memorable characters are introduced who will become players in the later novels: The gods of the Discworld, Death (Of course) and the bumbling tourist Twoflower being three who turn up in Pratchett’s later works. And of course there is Rincewind, the central character of this book and one of the great comic characters - a drop-out from magical school The Unseen University, a born loser with a sentient spell from the most dangerous book on the Discworld lodged inside his head.Rincewind is hired by Twoflower - the Discworld's first tourist - to guide him, and they proceed to have a series of life-threatening and very funny adventures which serve as a nice setup for the reader too to be guided around Pratchett’s world. The Color of Magic is hilarious, packed with great ideas, sharp observations and some damned funny satire of both the fantasy genre and modern life - Twoflower's attempts to get one of the rough cutthroats of Ankh-Morpork to understand inn-sewer-ants (Insurance) being one particular standout.Beyond its own brilliance, this novel is the foundation of an enduring and often very entertaining series of forty-one books, of which Small Gods, The Light Fantastic, Sourcery and Guards! Guards! are a few favorites of mine.If you haven’t read any of the Discworld books The Color of Magic is a great place to start, and a fine example of Pratchett at his best. Terry Pratchett had a talent that few authors possess- both a sense of humor and the skill to put that humor on the page. Few books make me laugh like this one did, and even fewer make me smile just at the memory of reading them."}], "Image": "https://images.gr-assets.com/books/1407111017l/34497.jpg", "Desc": "Terry Pratchett's profoundly irreverent, bestselling novels have garnered him a revered position in the halls of parody next to the likes of Mark Twain, Kurt Vonnegut, Douglas Adams, and Carl Hiaasen.The Color of Magic is Terry Pratchett's maiden voyage through the now-legendary land of Discworld. This is where it all begins -- with the tourist Twoflower and his wizard guide, Rincewind.On a world supported on the back of a giant turtle (sex unknown), a gleeful, explosive, wickedly eccentric expedition sets out. There's an avaricious but inept wizard, a naive tourist whose luggage moves on hundreds of dear little legs, dragons who only exist if you believe in them, and of course THE EDGE of the planet..."}