{"Name": "Craven Manor", "Image": "https://images.gr-assets.com/books/1510505414l/36582543.jpg", "Reviews": [{"Review": "This was an excellent ghost story. I loved the main character’s attitude; although he was a bit naive, Daniel was delightful. It’s nice to see his type of character. In a lot of ways he reminded me so much of someone close to me and he was hardworking, so I bonded with him instantly. It was very refreshing. I loved the entire premise and legacy of the family at Craven and the story surrounding it all. I loved reading this a lot. I received an advance copy and read it right away and could not put it down. This is something I would even read again. Everyone has their type of ghost story and this was definitely mine. This is a clean story, but spooky, full of the paranormal, some mystery and suspense thrown in. Would love if it continued though it ended well. "}, {"Review": "CRAVEN MANOR, by Darcy Coates, is a supernatural novel with a rather unique scenario. In the beginning, we are introduced to a young man--Daniel Kane--who is searching for odd jobs every day just to survive. His cousin, Kyle, allows him to stay in his cheap apartment--providing Daniel can get together enough money to pay half the rent. Immediately, Coates is able to show us the intrinsic differences between the two. Daniel is something of a rare anomaly nowadays; a gentle, caring person who would give his meager earnings to others in need, rather than buy food for himself. Kyle is obviously one who feels that world owes him, and thinks nothing of walking all over people like Daniel. Not one to complain about his situation, Daniel would remind himself: \n\". . . He lived in a home for desperate people, and desperate people couldn't be choosy . . . \"\nI found myself very impressed with Darcy Coates' writing style. In some places, her words flow with such a graceful ease, yet their meaning is so full of conviction and leaves you thinking on them for some time afterwards.\n\". . . No one said hello or even made eye contact . . . that sense of non-existence had left him with a permanent fear of being forgotten by the world . . . \"\nOur adventure begins when Daniel finds a curious note addressed to him, informing him that he has been hired as a groundskeeper for a place called Craven Manor. The barest of directions are left for him, and Daniel probably would have not given it another thought if not for his cousin suddenly complaining about him \"not contributing enough\".Coates continues to use some great scenes to further characterize the individual people in this novel. Now, she adds the most perfect balance of atmosphere to immerse the reader completely into the story unfolding. Once we see Craven Manor in our minds, there is no going back. I found that I didn't want to leave this novel for even a moment.\n\". . . The manor wasn't a cheerful place . . . But it felt secure . . . \"\nThe balance of human, supernatural, and environmental surroundings make for the perfect combination here. Craven Manor--\n\". . . A manor to strike fear into people who saw it . . .\"\n--is a major presence--almost a character all of its own. The neglected--yet somehow still striking-ediface stands as a testament to the past that never really . . . left.\n\"Things that die here have a tendency to linger.\"\nThe twists and revelations create a story that keeps you riveted to every page. The emotional pull of not only Daniel, but of the other characters and elements, intensifies as the story goes on and more of the historical events are slowly revealed.\n\"Ghosts are real . . .\"\nDarcy Coates has written a story that stuck with me long after I finished my first reading. This is most certainly a book I see myself returning to in the future for re-reads.\n\". . . I've found that death and I don't agree too much . . .\"\nThe mystique, characterizations, revelations, rumors, unlikely friendships, and betrayals were especially \"real\" feeling to me, and I give the author a great deal of credit in coming up with a tale that seems so \"new\", when the vast majority I read often appear as variations of the same theme.\n\". . . Sometimes, a drastic loss can herald a new start . . . \"\nHighly recommended!"}, {"Review": "I can't believe this book is nominated for a Goodreads Choice Award. It was a very average story. I decided to edit this review a little bit after talking to a few people and after thinking more about the story. Things make a little bit more sense to me now, but I'm still not sold on this book.The story starts out with Daniel getting a job offer to be the groundskeeper for Craven Manor. He decides to take the job because he really needs the money. Little does he know this manor is very haunted. He begins to see ghosts, hear weird sounds and he starts to get bad vibes from Craven Manor... This book made no sense to me for multiple reasons. I still don't get the characters initial reason for taking this job. I also don't get the relationship between Kyle and his cousin. I feel like the author was trying to make some big twist in her book, but I felt like they were a little out there.There are only a couple of pros about this book. 1) I feel like Daniel is a very likable guy so I dig that.2) The book did have a couple of creepy parts.I would not recommend this book to anyone, but I would love to hear more opinions about it. If you want to read a good Darcy Coates  book then I would suggest  Hunted ."}, {"Review": "This was another awesome ghost story by author Darcy Coates and I have added it to my favorites shelf. The mystery begins when Daniel receives a note under his door to become a groundskeeper of an old mansion called \"Craven Manor\". He is wary of who sent him the note and why they would want him to take care the mansion. But as mysterious as it sounds he sets off to find out if the note is for real or if someone is playing a trick on him.But it is not a trick as when he arrives at the mansion, he finds there is an envelope inside with strange kind of money. He becomes more intrigued as he also has instructions not to enter certain rooms in the house and to never enter the tower. The only living creature in the house is a cat which looks kind of poorly, so Daniel decides that he will take up the offer and do what he can around the mansion. He also moves into the groundskeeper's cottage so that he can keep an eye on the estate. There are loads of twists and turns throughout the book along with plenty of ghostly mystery. Darcy Coates has done it again with pulling haunting stories out of her imagination and taking the reader into her ghostly world. Five stars for this one. "}, {"Review": "This was the first book I've read by Darcy Coates and it was really good!If you don't like very scary books, no worries, you won't have to sleep with the lights on or anything. It's just a little creepy and there's a few 'hold your breath' and 'make you jump' scenes but nothing over the top.I'm kind of picky about ghost/ haunted house stories especially the endings but I was pleasantly surprised by this one. It wrapped up nicely and didn't leave you hanging with a million questions which seems to be the case in a lot of the ghost stories I seem to read.I personally want to read all of her books now including her upcoming release The Carrow Haunt which sounds like it's going to be awesome too! My poor TBR is never going to decrease.Before you stay at Craven Manor though, you need to know the Rules:\nNo strangers are allowed onto the property.Do not enter the tower.Do not leave the groundskeeper's cottage between midnight and dawn. Draw your curtains.Keep the door locked. If you hear knocking, do not answer it.\n "}, {"Review": "Daniel Kane, is a homeless person, looking for a job. His cousin Kyle takes him in so he can help pay the rent. Daniel works all kinds of odd job to help his cousin pay the bills. One day a note is slip under his door, with some money, and a job offer. Against his better judgment, Daniel decides to take the job. The position is grounds keeper at Craven Manor. Daniel moves into the ground keepers cottage, right behind the crypt. Daniel goes to the manor, and the door is wide open. He also notices, that the outside growth, is way out of control. Cleaning this up, will take along time, for one person. When Daniel enters the manor, there is a note with money, and promise of more. There is also a list of rules, that he must follow, if he wishes to keep his job. Daniel notices, that the inside of the manor is covered in dust. Daniel believes that no one has lived here, in a very long time. One of the rules that Daniel must follow is, that he can't go up in the tower section of the manor. He wonders, what could be up there, that make this off limits. The only living thing, that Daniel has seen in the manor, is a stray cat. Strange things begin to happen around the manor. While outside, he thinks that he see somebody in the tower window. How can this be, no one has lived here for a very long time. Daniel knows that Craven Manor is hiding something. There are many twists, and turns along this bumpy road. The author does a excellent job in developing the characters in this tale. Craven Manor, by far, is one of the best books that I have read by Darcy Coates. I highly recommend this book."}, {"Review": "Not as creepy as The Carrow Haunt, but still a very enjoyable book.Daniel is living with his cousin Kyle in a 2 bedroom apartment. Daniel is glad Kyle let him live with him, since he was living on the streets before Kyle found him.Kyle may not be the best roommate, and Daniel still doesn’t have a steady job, but he thinks he will get by like this. But his search for a job is not going that well, and he goes hungry a lot since all his money goes to Kyle for rent. When Daniel finds an envelope on his doorstep addressed to him one day, he isn’t sure what to think. The envelope contains a note offering him a job as the groundskeeper of Craven Manor. Daniel is curious enough to go check the place out, but when he sees the isolated dark manor in the middle of the forest, he isn’t so sure he wants anything to do with it. But when Kyle tells Daniel they’re taking on another roommate who is taking Daniel’s room, Daniel has no other choice than to accept the job offer and move out.To Daniel it looks like Craven Manor hasn’t been taken care of in a very long time. He’s not sure how anyone can live there. But apparently Bran, the owner of Craven Manor, does.Daniel finds a letter with instructions to clear out the garden, all the way to the crypt, and some valuable coins. He can live in the groundskeeper’s cottage, but he can’t go out between midnight and dawn and he should ignore it if someone knocks on his door at night…This was more creepy than scary. The whole atmosphere was just what I was looking for in a book, even though I wasn’t all that scared. I really liked Daniel and how he dealt everything. I could really feel his desperation and how he felt he had no other choice but to accept the job as groundskeeper for a creepy old house in the middle of nowhere. The fact that he had nowhere else to go added to the whole suffocating atmosphere.I do have to say that it wasn’t as scary as The Carrow Haunt, the only other book I’ve read by Darcy Coates so far. And the end was.. strange. This is not a ‘the ghosts are all exorcised and I moved far away from it all’ kind of ending. Not that it was bad, it was just different. And I was thinking how things would go for Daniel in the future.But this was still a very enjoyable book that sucked me in from the first page. I really like Darcy Coates’ writing and I can’t wait to read more books by her.(PS, this is not a romance)"}, {"Review": "Daniel was a good guy in his early 20's but down on his luck when it come to securing a permanent job. His cousin wasn't helping either, trying to evict him in a subtle way. So, Daniel had no other way but to accept a job offer as groundkeeper at a creepy abandoned mansion.From the get go the setup was creepy. You knew something was waiting for Daniel. You knew something was going to happen. But you couldn't help but root for Daniel.The ghost in Craven Manor can be equalized as the one in Hogwarts, more towards fantasy rather than horror."}, {"Review": "There is just something special about reading a book by Darcy Coates for me. Her writing doesn’t stand out above her peers in style or clever self expression. Neither the stories as a whole nor the separate pieces which make up those stories are groundbreaking. She writes good, classical ghost stories. Any experienced horror reader will see every twist and turn coming from a mile away. And yet... they are so thoroughly enjoyable each and every time. Picking one up is like seeing an old friend after a few years absence. The protagonist of the story, Daniel, is down on his luck. He’s a young man, living in his cousins apartment, and jobless. He was recently homeless and is fearful of returning to that situation. Daniel gets an odd job offer to be the caretaker of Craven Manor. When he shows up, all the normal triggers and troupes occur for a classical haunted house story. Like I said, it’s very hard to figure out exactly why Darcy Coates’ books are so enjoyable. In a way, they shouldn’t be. And yet, they are. I especially enjoyed her protagonist, Daniel, and the arc his character takes as he settles into becoming the caretaker of the proverbial haunted mansion. It seems like every haunted mansion has a caretaker, and Ms Coates’ story goes a way into describe how they might get those intrepid caretakers. This is also the first time I have ever seen Ms Coates write a male protagonist. Women often have trouble writing believable male characters, as men have trouble writing women. But, Ms Coates is clearly talented enough where this is not a problem for her in the least. I took a star off for two reasons. Firstly, Coates, possibly trying to break her own mold a bit, added some fantasy elements to this haunted house tale. At times, I felt like I might be reading a pitch she had for a comic book or graphical novel, rather than a straight prose work. At times, I thought it worked great. However, other times it came off as slightly cartoon-ish. It didn’t always seem to work. Secondly, Coates spent a lot less time on building the atmosphere of her haunted abode. She usually does that well, but it can be tedious if you read a lot of these. (“Yes, yes. We get it. It looks haunted because it is haunted!”) Personally, I enjoy a slow burn and the build up. I thought, by getting into the action of the ghosts so early, she took away some of the creepy factor. Again, at times it read like the pitch for a graphic novel, where a lot of the atmosphere would be handled by the art. However, in prose form, it just made the book less scary. All in all though, this was yet another enjoyable read from Darcy Coates. I speak of her books often with people who enjoy scary books. She knows what she’s doing. I can’t wait for her next!"}, {"Review": "I have never read a Darcy Coates story before, but now will gladly look for her books to read. This is a great story of Daniel who is desperate for a job, who has no money and nowhere to live. But suddenly he is offered a groundskeeper job in an old mansion (which he didn’t even know existed). But why is there so many rules? Such as do not open your curtains at night , do not open the door to the tapping he hears and do not enter the tower. But human nature persists and Daniel does find out much more than he bargained for with the mansion and the history of the building.Well written fast paced story."}, {"Review": "Daniel gets the job offer of his life, work at a big manor, but not everything seems right.So, I couldn't sleep and I was in for a bit of a horror book. Hey, if I can't sleep anyway. :P I knew that with Darcy Coates I would be having a ride of creepiness, so I was eager to start this one. I quickly found out that, apparently, I already read a bit of the book. I was at first worried that I may have read the book and that Goodreads had gone and effed up again, but thankfully after a few chapters things started to be new for me.The manor. Well from the start I was definitely noping as the author described the building, the garden, the crypt. I just knew this wasn't a place one would visit during the day or night. It was just such a foreboding place. It was instantly clear that this place had seen a lot of terrible things. And as the story progresses and we see various facets of the story pop up, I was intrigued, but also having a serious case of goosebumps because it was pretty dang terrifying. Daniel was pretty brave, and I loved how well he went to tend for the garden. But also the crypt, how he tried to make it more of a spot of peace than something overrun by darkness. And the house, he also tried to take care of the house and the cat that lives there. Sure, he was terrified at times, but he still kept going. Mostly because he didn't want to be homeless ever again, but also because he felt happy doing the work. At the beginning and also later on we could see him care for an older neighbour of his. Who saw him as a grandson which just had me smiling so much.Bran was a fabulous character. He was creepy, yes, but I am not sure how to explain. I just liked him. I knew his intentions weren't bad, he just was a bit crappy at executing them. :PAnnelise? That girl was terrific. I feel sorry for what she has gone through, poor thing. :( But it seems she doesn't mind being what she is now. She is finally living her life. I was delighted with the way the whole midnight curfew and what happens at midnight stuff was handled. At first I was effing terrified and when the scratching began I was just looking around my dark-ish room waiting for something to pop up. But then later I found myself looking forward to the midnight parts. Of course, ha, I won't tell you why. I will just say this, I had a smile on my face. Daniel is really a great guy. So many people would have fled in terror. While I did love the story, I am a bit sad that it wasn't a pure ghost story. Instead we also had a monster, a plague, shapeshifters. At times it just didn't feel right to me, it was just too much and so I was rolling my eyes a few times and found myself thinking: \"Yeah, sure, add that as well, what is next? Aliens?\"It was pretty hilarious that Daniel couldn't seem to figure out what to do with trust. He seemed to easily give it to everyone but then also immediately pulled it away when he heard bad words about this person (and didn't even care to ask for an explanation from the person it was about). Kyle is the biggest reason why I am given this book a lower rating than I was planning. From the start I didn't like Kyle, but then he gets worse with each time we see him. He just didn't seem to have any conscience of care for anyone. He just saw money and he didn't care who or what he had to destroy to get to it. *rolls eyes* Was it really necessary to keep on telling the portrait was x and y. In the end I was just giggling at the silliness of it. We get that the portrait is x and y, you already told us so many times now. :PThe author really knows how to write a creepy story. There were times that I just put my book away and tried to regain my breathing to normal levels again. And I even had to read something fluffier afterwards so I could finally try sleeping. The ending was pretty great, I am very much happy for Daniel. He deserves this, he worked so hard and fought so hard. Plus I am happy for other characters as well. They too deserve some happiness. All in all, a very exciting book with lots of creepy moments. I can't wait for Darcy Coates newest book, I know it is coming out very soon and I am so excited!Review first posted at https://twirlingbookprincess.com/"}, {"Review": "Daniel goes from living on the street to living in his cousin's apartment, to being the caretaker at the spooky and ramshackle Craven Manor. His employer has explicit, but mysterious instructions, and Daniel's paid with antique and valuable coins. It's soon evident that there's something malicious afoot and the ghostly young child has carried her fear about this evil force with her to the crypt. We won't discover the truth about Craven Manor until the end, and that will keep you reading.What I enjoyed: Daniel--the good guy who deserves the breaks he gets in the story, and the one you want to triumph. Bran, the employer, is another character you like in spite of his decline into death and his proclivity for shape-shifting. Even the ghostly child has charm, and then you can't figure out what that mother has really done, but you must hate and fear her entirely.There are some great red-herrings and the creep-factor is high in this one, and so if you like to be on edge of your seat while reading, you'll enjoy the story. What annoyed me: If there's one word I'll never use again it's \"horrific.\" I lost count of the times it was used in this tale. So much that if I hadn't been reading on my Kindle, I would have crossed it out and substituted a different adjective. Sometimes the verbs just didn't fit. It was as if the author wanted something fresh, but only succeeded in something odd. And I became really lost in the final descriptions of Daniel's and Bran's fight against the malevolent force. I confess to skimming parts when I should have been deeply engrossed. "}, {"Review": "Quite different compared to the author's previous works, but this is still very much a gothic ghost story at it's core.I feel the characters could have been fleshed out a little more (no pun intended), but I did enjoy the relationships between Daniel, Bran and Annalise in particular. Daniel was such a naive sweetheart that I alternated between wanting to hug and shake him.I did predict the twists quite easily, but I read a lot of horror and still enjoyed the read so much I finished it in one sitting.Plus I know the writing must have been good, because I despised Kyle and cheered when anything and everything bad happened to him, because he deserved it all.Maybe I'm the real bloodthirsty monster here?"}, {"Review": "3.5 starsI've seen Darcy Coates books all over Amazon and Goodreads, and her eerie covers always catch my eye, but I'd never read any of her work.  After Craven Manor was nominated for a Goodreads award in the horror category, I knew it was time to change that.My heart immediately went out to Daniel.  He's down on his luck, with barely a penny to his name, but is so generous to others.  Maybe he's a bit naive, but I awarded him bonus points for being an animal lover.  This author definitely knows how to set a tense, haunting scene - the imagery is wonderfully vivid, and the neglected grounds of the manor were easy to visualize.The final battle, although furious, seemed to stretch on for bit, but it led to a satisfying ending.  I also found the relationship between Daniel and his cousin, Kyle, kind of weird, and never really understood it.Overall, I enjoyed Craven Manor, and I'm sure it won't be the last book I read by this author."}, {"Review": "Holy Cow! This book was OMG awesome! I loved this book so much it definitely made it to my 2018 Favorites List. The book follows a young guy named Daniel who is really homeless but staying with his dreadful cousin Kyle, which let me say right now I hated him! Daniel gets a letter under the door offering him a job at Craven Manor a spooky abandoned estate. Daniel takes the job because it comes with lodging and gets him out of Kyle's apartment and of course the pay is great. While working at the Manor, things start to happen and I am not going into the story more because I do not want to spoil it but OMG it is definitely a Must Read especially during the Autumn/Halloween season. I highly recommend it!"}, {"Review": "I really liked this book. It has ghosts, creepy manor, nice plot and happy ending. It's written in a very straightforward way and it isn't a flowery prose which I liked the most. Not every book needs to be at least 500 pages long to be good and overflow with fancy and grandiloquent words, phrases and sentences and elaborate descriptions. The plot wasn't something spectacular or groundbreaking but I devoured the book in one sitting.Bran was my favourite character and Daniel was the most frustrating one due to his exasperating naivety. However, no foolish actions means no plot.This is truly a perfect light, mysterious and eerie story for me. Very enjoyable and I would really like a sequel, though I'm not holding my breath. "}], "Genre": "Fantasy", "ID": "36582543", "Desc": ""}