{"Genre": "Fantasy", "ID": "14497", "Name": "Neverwhere", "Reviews": [{"Review": "I didn't enjoy this book as much as I should have. I kept distracting myself with the thought, \"Why the hell haven't I read more of Neil Gaiman's books?\" Then I would have to tell myself to shut up, because I'm reading one right now, and I can return to berating myself later.Neil Gaiman really understands fantasy. He understands that it isn't elves dancing in a forest and drunk dwarves mining for gold with improbably well maintained beards. No, fantasy is a reflection of reality, but fantastic. It isn't an alternate reality, but reality through the lens of imagination, and possibly some mind altering substances. Not only does he capture the essence of fantasy perfectly, but he does so with the trickiness and charming language that seems to be uniquely in the realm of British humorists. He rarely describes anything in a completely straightforward manner, instead choosing to almost fool the reader into visualizing his delightful (or, when appropriate, very undelightful) characters and events. I couldn't help but to be completely charmed by and immersed into London Below, right up until the point when some jackass started to wonder, \"Why the hell haven't I read more of Neil Gaiman's books?\"==============So, a few years later, and a lot of people seem to like this review, still. I've decided to abuse the popularity of this review to attempt to steer fans of Neverwhere towards a few other books that I think they will enjoy. Despite the theme of the review being \"Read more Neil Gaiman\", the books listed below are actually by different authors, since I think I've already made it clear that you should read more Neil Gaiman. So, aside from all of those, here are a few other recommendations:1. Bridge of Birds, by Barry Hughart - An epic, hilarious mythological adventure.2.Wool, by Hugh Howey - A pretty dark and serious tale of people living underground on a ruined world.3. The Baroque Cycle, by Neal Stephenson - A globetrotting adventure set among a lovingly researched historical backdrop. 4. Little Brother, by Cory Doctorow - A nerd finds himself suddenly and unexpectedly being stalked by his own government, and doesn't think it's so cool."}, {"Review": "I won this in a Goodreads/Firstreads Giveaway! Yay! Look at these pictures! Sorry for the darkness. We were in the sunlight but it canceled us out. Anyhoo! I am in love with the looks of this little book! It doesn't have a dust jacket! It's one of my fav hardbacks! I love them without the dust jackets. I have added a picture of the front and back. I have also added a picture of just one of the many illustrations through-out the book and the inside book flap that isn't really a flap but they made it look like one! Now if I can just love the book! =D OMG! I sat here trying to think where I new Chris Riddell that did the illustrations through-out this book. As soon as I started and saw the picture of the older Richard Mayhew it freaking hit me! The picture looked like a grown up picture of Twig from The Edge Chronicles that Chris Riddell did the illustrations on =D I loved those books too. Anyway, this was a dark little book but it also had hope for a man that was hopeless. Richard Mayhew is living a life that is boring in my opinion. He goes to work doing boring work. He has a fiance, Jessica, that announces they are getting married and pretty much tells him everything to do, what to wear, etc. She's so beautiful that he just does it and he's a sort of a push over but I like him. Once day a girl pops out of a door when Richard and Jessica are hurrying to a dinner with one of Jessica's clients. Richard stops to help the girl who is bleeding and pretty much blows Jessica off. Yay! Richard takes the girl named, Door, to his home and lets her rest as she doesn't want to be taken to a hospital. Turns out these creepy dudes named Mr. Croup and Mr. Vandemar are after her. Suddenly Richard is dragged into the world of London Below. It's a very dark story in London Below. Richard is stuck there trying to help Door and some others. When he tried to go back home once, he didn't exist so he was stuck down below. \nRichard wrote a diary entry in his head. Dear Diary, he began. On Friday I had a job, a fiancee, a home, and a life that made sense. (Well, as much as any life makes sense.) Then I found an injured girl bleeding on the pavement, and I tried to be a Good Samaritan. Now I've got no fiancee, no home, no job, and I'm walking around a couple hundred feet under the streets of London with the projected life expectancy of a suicidal mayfly.\nBut over time, helping these people/creatures, Richard finds a meaning to his life. When he goes back to London Above, he realizes it's not where he belongs. I loved the characters in this book, even the evil ones were written terrifically. I love, love, loved that Richard finally found his place in the world. He really is a good guy =) Happy Reading! Mel ♥MY BLOG: Melissa Martin's Reading List"}, {"Review": "Neverwhere was my first real introduction to the world of urban fantasy - a clever take on Alice in Wonderland, one can say, set in the semi-magical, unsubtly dangerous, and quite fantastically warped world of 'London Below'.\"Young man,\" he said, \"understand this: there are two Londons. There's London Above - that's where you lived - and then there's London Below - the Underside - inhabited by the people who fell through the cracks in the world. Now you're one of them. Good night.\"Neverwhere is one of my all-time favorite books. It has just the right amount of wild imagination (inexplicably somehow still grounded in firm reality), a healthy dose of absurdity and strangeness, remarkably colorful larger-than-life characters, unforgettable setting that is more of a character than a simple backdrop, and, of course, sufficient amount of lovely dry humor. Besides, there is that certain 'something' in Neil Gaiman's writing that keeps bringing me back to his works - that cleverness, I guess, that boldness in his approach to writing, that apt descriptiveness that burns scenes into your mind without becoming boringly detailed or repetitive, and the bit of mesmerizing darkness he harbors in all of his works, regardless of the theme or target audience.In Neverwhere Gaiman uses the old technique of taking a person belonging to the 'regular' world and throwing them into the midst of a fantastical reality, using the protagonist as our eyes into this world - think of \"Alice in Wonderland\" or \"The Wizard of Oz\" or its younger siblings like Miéville's \"Un Lun Dun\".Richard Mayhew is a timid and perfectly average London guy who suffers from a noticeable lack of figurative backbone - and the only time in his life he does show some of that ill-fated backbone, combined with some very real compassion, he gets himself into trouble that is waaaay over his head. Let Richard tell you about it himself:\n\"Dear Diary,\" he began. \"On Friday I had a job, a fiancée, a home, and a life that made sense. (Well, as much as any life makes sense.) Then I found an injured girl bleeding on the pavement, and I tried to be a Good Samaritan. Now I've got no fiancée, no home, no job, and I'm walking around a couple of hundred feet under the streets of London with the projected life expectancy of a suicidal fruitfly.\"\nUnwittinly having thwarted an assassination attempt on a young girl named Door and having helped her because, let's face it, he's basically a decent guy, Richard suddenly finds himself in the London Below - a place for those who no longer belong to the regular 'London Above', a place for those who have slipped through the cracks of ordinary reality. It is a place that exists outside of our conventions of time and space, touching our reality but not quite overlapping it.\"There are little pockets of old time in London, where things and places stay the same, like bubbles in amber,” she explained. “There’s a lot of time in London, and it has to go somewhere—it doesn’t all get used up at once.\"“I may still be hung over,” sighed Richard. “That almost made sense.\"\"Just like London Above, London Below is a melting pot - except for this one is for relics and discards and misfits of all kinds of times and legends and beliefs and tales. It is a place for those who fell between the cracks - think of those you usually do not notice even if you walk past them on the street, like the homeless, for instance; they are already invisible to us. It is also a place for those who spent too much time in the company of the supernatural, and for those who don't fit in our world. You can view it as a colorful tapestry - or more aptly, as a dirty filthy rag made of mismatched and threadbare bits and pieces that once were something grand and even now create a mesmerizing albeit puzzling effect through their sheer strangeness and unexpected combination.And it is a place that has teeth and is ready to bite. It is harsh and cruel, full of menacing dangers lurking around every corner. Friends can quickly turn into foes, and promising a favor is a serious thing that can get you far in this world. It takes skill to survive here.And Richard is very much NOT prepared for that.\"His life so far, he decided, had prepared him perfectly for a job in Securities, for shopping at the supermarket, for watching soccer on the television on the weekends, for turning up the thermostat if he got cold. It had magnificently failed to prepare him for a life as an un-person on the roofs and in the sewers of London, for a life in the cold and the wet and the dark.\"London Below is a place populated with creatures that have enough color and flair to them to easily stand out against the drab background of life and their surroundings. Of course I'm talking about Marquis here, the not-so-honest and yet brave and loyal (for a reasonable price of a favor) Marquis de Carabas, the guy who you would ultimately want covering your back in a sticky situation (as long as you can overlook the fact that he may have had something to do with creating the said sticky situation in the first place!)\n\"He...\" Richard began. \"The marquis. Well, you know, to be honest, he seems a little bit dodgy to me.\"Door stopped. The steps dead-ended in a rough brick wall. \"Mm,\" she agreed. \"He's a little bit dodgy in the same way that rats are a little bit covered in fur.\"\nWith characters like Marquis, or the enigmatic single-minded Hunter, or pretty much anyone Richard comes in contact with in this weird mixture of rooftops and sewers and underground tunnels, London Below is a confusing blur to Richard's tired and overwhelmed senses. Some things don't make sense. Others make way too much sense, are way too literal (Earl's Court or Knightsbridge, for instance). He is so out of place here, it's almost painful to read, as you wince and cringe at his pathetic attempts to clutch to what he continues to view as safety and sanity. And no, this sanity does not normally involve girls named Door or a charming scoundrel Marquis de Carabas, or Angel Islington, or outwordly hired thugs Croup and Vandemar, or Rat Speakers, or Beast of London, or the real Old Bailey, or the nonexistent British Museum underground station where Earl's Court can get you if you so please. \n\"Richard did not believe in angels, he never had. He was damned if he was going to start now. Still, it was much easier not to believe in something when it was not actually looking directly at you and saying your name.\"\nBut eventually Richard may, just may, start discovering something about himself that is a bit more adjusted in the world that has slipped through the cracks than \"real\" London. In other words, Richard Mayhew just may have gone native. Unlike Dorothy and her Toto, he may not want to just live happily ever after in his version of Kansas.\"Metaphors failed him, then. He had gone beyond the world of metaphor and simile into the place of things that *are*, and it was changing him.\"After all, haven't we all at some point asked a question about what is the meaning of all that we are doing? Haven't we always wondered whether there ay be something else we may be better suited to be and do? Haven't we wanted to escape somewhere... well... else? Different? Isn't that some of the reasons we wan t to immerse ourselves into worlds of fantasy at least for a short while?\n\"Work. Home. The pub. Meeting girls. Living in the city. Life. Is that all there is?\"\nUsually, however, the point is to return home, enriched by experiences of the outwordliness, and, of course, gain some appreciation for the life we used to take for granted before. Because, of course, no matter how much we want to, we will never escape the real life. Or can we? After reading this book, I know I would want to, had I been in Richard's place. But I cannot, and so I appreciate my mundane uneventful life - but what if I didn't have to? Who knows........................\"The marquis de Carabas raised an eyebrow. \"Well?\" he said, irritably. \"Are you coming?\"Richard stared at him for a heartbeat.Then Richard nodded, without trusting himself to speak, and stood up. And they walked away together through the hole in the wall, back into the darkness, leaving nothing behind them; not even the doorway.\""}, {"Review": "I first started reading this book and honestly wanted to just chuck it in the bin. I said very mean things about the protagonist under my breath.Surely, I said, a Protagonist means that they are pro and totally into furthering the story. Surely, Protagonist is the similar to Proactive and Productive.I was wrong. The word Protagonist, in its basic form is not similar to proactive. It simply, from the Greek plays, means the principle character or the first speaking character.However, I maintain that the kind of protagonist that most people want to read about is one that actually bloody does something!History/Language lesson over.Neverwhere is a book that TRIES to be clever and magical. In many senses it utterly manages to be magical and creative and fun. It fails, however, to be clever. There are so many lines in this book intending to be dry wit and just come off dry stupid. Allow an example:There are four simple ways for the observant to tell Mr Coup and Mr Vandemar apart: first, Mr Vandemar is two and a half heads taller than Mr Croup; second, Mr Croup has eyes of a faded, china blue while Mr Vandemar's eyes are brown; third, while Mr Vandemar fashioned the rings he wears on his right hand out of the skulls of four ravens, Mr Croup has no obvious jewellery; fourth, Mr Croup likes words, while Mr Vandemar is always hungry. Also, they look nothing at all alike. Oh! I see what you did there! *Kat laughs, slapping her knee with her hand in amusement* No, not really. If he'd left out these lame little lines I think I probably would have enjoyed this novel a whole lot more.Just about every other character in this story is awesome except for the protagonist. Give me a story about Marquis de Carabas and I will read it in a second. Honestly, fantastic character right there. Tell me I have to read another whiny missive about Richard Mayhew and I will likely stick hot pokers into my eyes first.I get it. I really do. It's a journey. He has to LEARN and GROW and CHANGE. But he takes a REALLY long time to do it and he only ever grows to be slightly less pansy, soft and annoying. The total character growth comes to equal someone who doesn't just sit idly by and let people take stuff from him.Let me give you an example. He met a girl who was unconscious in the streets and bleeding to death. He takes her home. This causes his fiancee to break up with him. He then goes through a lengthy process to get the girl back where she came from. Once he does this he then loses his job, his apartment and all his money. He then goes to find the girl for a) an explanation and b) help. Without her help he will probably die as another side effect of having met her is that he has two psychopathic killers on his tail. She simply apologizes and walks away, abandoning him. So what does he do? Does he chase her down and gently remind her that she owes him a favor? Does he barter and trade what he can, whilst trying to lure the killers into a trap so that he can some how defend himself? No. I will now transcribe from the book EXACTLY what he does.Richard leaned against a wall, and listened to their footsteps, echoing away, and to the rush of the water running past on its way to the pumping station of East London, and the sewage works. \"Shit,\" he said. And then, to his surprise, for the first time since his father died, alone in the dark, Richard Mayhew began to cry. He decides to stay there and die. That's right, folks. He just stays there waiting to die. Boo-fucking-hoo.Ya know, I don't accept this crap from a female character - nor do I accept it from a man. How the hell am I suppose to sympathize with someone who so blithely lets everything he has slip through his fingers because he can't speak up and demand explanations or some kind of help? This level of pitiful doesn't help the audience empathize - it makes them think your protagonist is an idiot. The plot is pretty good - despite everything being painfully obvious and predictable at the end. The world building is fantastic. It's probably the best thing about this book. It's really creative and fascinating and interesting.Over all, it was an alright read. It wasn't great. I labored through until the last half where it began to pick up and markedly improve. Thus only three stars. Had the first half been more like the last half then it would have earned four."}, {"Review": "yet another book that has been sitting on my bookshelf for ages and im so glad i finally made time to read it. if i remember correctly, my interest was first piqued when someone had posted some fan art for this and i just thought it looked so. cool. and i knew it was a world that i really, really wanted to dive into. so it makes me a little sad that i didnt enjoy this as much as i thought i would. but its definitely a case of it being my fault and not the books. i just dont think urban fantasy is my kind of genre. i tend to like my fantasy and realistic fiction to be separate, so stories that fuse the two fail to keep my interest - as was the case with this. but i will admit, i actually thought the world of london below was very cleverly done. i will forever praise gaimans creativity for the humour and appropriateness used when creating and mirroring london above. as someone very familiar with the city, it was fun to see such a unique, but recognisable, feel to the world. overall, this is by no means a bad book. its well written, has a lot of interesting characters, and the world building is superb. my mediocre rating just comes down to personal preference and enjoyment. but i would still recommend this to everyone!↠ 3.5 stars"}, {"Review": "Wow that was fantastic!I listened to the audiobook because my brother recommended it to me. Neil narrates it himself, which I thought was really cool.When I think of Urban fantasies this is now the first book that will pop into my head. Neil built this incredible world below London, that weaved in and out of our reality seamlessly. I think he benefited from calling on existing infrastructures like the London Underground to give a sort of map, but he worked it into the story beautifully. There were no info dumps, everything was concise and hung tight to the plot.It also benefited having chapters follow different characters like the Marquis and the cutthroats Croup and Vandemar because I saw how vast London Below was and learned certain rules of bartering I probably wouldn't have learned without those chapters. The story is plot-driven, following the quest of Door, and Richard tags along once he is accidentally brought into this world. Richard starts as a fly on the wall for the reader to see London Below but as the story unfolds he becomes an active participant in the quest.That's why the story is never boring. It's an active story. The team is never waiting for their quest to find them they're actively seeking answers and all their accomplishments are earned. My final note might give away the ending. I'm sensitive to giving away spoilers so if it bothers you stop reading here..........By the end of the book, we become Richard trying to open a door to London Below. We want to re-enter too."}, {"Review": "Richard Mayhew had a perfectly ordinary life, thank you very much.He had a job that he didn't quite hate, a fairly decent apartment and a lovely fiancee (despite what his friends thought). One night, he and his fiance stumble upon a broken, bleeding girl. The strangest thing? His fiance couldn't quite see the girl - or more like once she noticed the bleeding girl, his fiance would just as quickly un-notice her.Shrugging that off, Richard takes the girl back to his apartment (at her insistence) and tends to her wounds. She leaves in the company of a marquis for the Under-London. A few short days later, much to his horror, people start to react to Richard the same way. Their glances slide off him, they cannot hold conversations - it's like he has disappeared. When his landlord shows Richard's apartment to a prospective buyer - with Richard still in there - Richard knows that he has to go to the Under-London as well. Door (the injured girl from before) takes pity on Richard and allows him to join her crew - though much to his dismay, this new world is filled with sewer people, terrifying women and the worst possible creatures and things.\nI want to go home. Then he mentally underlined the last sentence three times, rewrote it in huge letters in red ink, and circled it before putting a number of exclamation marks next to it in his mental margin.\nI really enjoyed how much of a reluctant adventurer our main character is. Finally, a character who reacts the way I would on a quest! That being said, there were so many intriguing side characters that it's almost disappointing to follow the only normal human. I would have loved to hear this story from the perspective of Door or the marquis. Gaiman does a fantastic job of weaving in fantasy elements into his novel - equal amounts of horror and delight - I was absolutely fascinated! How does he even come up with such ideas?\nI mean, maybe I am crazy. I mean, maybe. But if this is all there is, then I don't want to be sane.\nAudiobook CommentsRead by the author - which is always a plus, especially when done by Neil Gaiman. He always reads so well! I swear, this man could read anything and I'd give it a listen.The 2018 PopSugar Reading Challenge - A book that is also a stage play or musical(Aside: Door's whole family has the special ability to open doors at any time, anywhere...and what does her dad name her? Door. Are you serious??)Blog | Instagram | Twitter"}, {"Review": "3.5/5 StarsWhether you’ve read his book or not, there is a high chance that you have heard of the name Neil Gaiman if you’re a reader and most people probably loved his works. Let’s just say I finally knew why. I knew about him since 2009 from watching the movie Coraline which I loved and turns out it was based on a book written by him and that movie shocked the crap out of me cause it so imaginative and scary at times, I thought it would be a family movie. Fast forward 8 years later and here I am finally reading his first solo book. This is my first try at reafing Neil Gaiman’s work and my first try at the genre ‘Urban Fantasy’.The plot in my opinion is good but it’s really not something great, it’s just there to move the story along which is completely fine for me but I just wish it’s something more special considering the praises Neil got. This is one of the rare cases where the blurb of the book only give the basic plot of the first 2 chapter without ruining your reading experience so if you want to know what the basic premise of the book is about you can start there. What fascinates me the most about this book is instead the world that Neil created. The world of London Below is highly imaginative, it twisted our real world London and makes it into something resembling Hell. Consisting of bizarre characters, creatures and combined with Neil Gaiman’s storytelling skill, it made the setting a really unique place to visit (not literally.)Here’s a fantastic artwork done by Marc Simonetti to show a comparison of the London Above (our world) and London Below (alternative world).There’s a lot of good character here but other than the main character, Richard, there’s too little development for any of them. It’s understandable though since this is a short book and there’s not enough room for improvement other than the main character. I loved the character development of Richard, it’s amusing to see how he changed from his first appearance until the last part of the book and a plus also to the main villains Croup & Vandemar which provided their scary nature while sometimes being funny at the same time with their banter towards each other.There’s quite an annoying problem when I’m reading this though but this could be just me. There’s a lot of places mentioned in the book which doesn’t contained any description at all! I know it’s because the setting are based on our real world but for me who never goes to London and know about it only from movies and the TV series Sherlock Holmes (THE NEW SEASON IS COMING OUT IN 3 DAYS BTW), I have to Google Image almost every places mentioned in the book otherwise I can’t imagine what the setting of the story even look like. The only places I didn’t Google are Trafalgar Square, London Bridge and Big Ben. (Btw, are all Urban Fantasy the same case as this?)By the end of this book, I can’t help but feel I wanted a sequel and I'm looking forward to read more of Neil's work. I’ll recommend this book to anyone looking for a fast Urban Fantasy read with unique writing style. I’ll leave this review with my favorite quote in the book, which probably you won’t understand the meaning behind them but once you read this book, you’ll know why I really love this quote.\n“I mean, maybe I am crazy. I mean, maybe. But if this is all there is, then I don't want to be sane.” \n"}, {"Review": "Neverwhere!Upon beginning a review of Neverwhere by Neil Gaiman my first thoughts were to write that even a bad Gaiman novel was better than most other authors best work. But this is unfair, Neverwhere is not a “bad” novel at all. Compared to Stardust or Anansi Boys, or especially the masterpiece American Gods, it lacks the epic presence and may even be categorized as one of Gaiman’s lesser works. What is present, though, is Gaiman’s phenomenal writing, his brilliant and original imagination and his ability to simply tell a good story. This was entertaining and the literary ground is ripe for more Neverwhere adventures if he ever decided to return, and he has hinted that he may. Croup and Vandemar are two of his best characters.For Gaiman fans, but would not be the best to begin a tour of his impressive canon."}, {"Review": "Final review: After a multilevel process of reading, commenting and then rereading (see my various updates below), here is the final summation of all my thoughts and feelings about Neverwhere: 4 stars! And read the illustrated version!Review first posted on Fantasy Literature:Neverwhere is a novel that improved dramatically for me on reread, which actually was a surprise to me. I originally read it about six years ago when, in an odd twist worthy of London Below, it mysteriously appeared one day on my clunky Kindle 2, without my having ordered it. About a month later it just as mysteriously disappeared again (luckily I had finished it just in time). I was fascinated by the marvelous and imaginative setting of Neverwhere and London Below, but only mildly entertained by the plot, which ― other than the beginning and the end ― I found quite forgettable.Still, when I was offered the chance to read a 2016 edition of Neverwhere with the “author’s preferred text” and illustrations by Chris Riddell, whose illustrations make Gaiman’s The Sleeper and the Spindle so memorable, I jumped at the chance. It was a wise decision on my part.Richard Mayhew, the “everyman” character whose impulsive kindness toward a wounded stranger on the street upends his life so dramatically, was a more sympathetic character for me in this reread. He becomes virtually invisible to normal Londoners, like the homeless whose ranks he physically and symbolically joins. Richard takes a chance, following the path of Door, the young girl he saved, down into London Below, a Byzantine setting with a bewildering assortment of fantastically strange characters. The plot is equally disorienting, a labyrinthine quest that takes Richard and his group from one place or contact to another, as Door tries to find out who killed her entire family, and why, and Richard hopes that somehow he’ll be able to regain his normal life in London Above. They’re relentlessly pursued by Croup and Vandemar, a pair of gleefully horrible assassins, whose employer is shrouded in secrecy.Both the plot and the characters gained clarity and cohesiveness for me on my second read, freeing me to appreciate Gaiman’s wry humor and the intricacies of the story and its setting. I smiled at the family of Lord Portico (despite their tragic fate), who all have portal-related names and the ability to open doors and locks at will. And I understood better the nature of the capricious Marquis de Carabas:The Marquis de Carabas was not a good man, and he knew himself well enough to be perfectly certain that he was not a brave man. He had long since decided that the world, Above or Below, was a place that wished to be deceived, and, to this end, he had named himself from a lie in a fairy tale, and created himself — his clothes, his manner, his carriage — as a grand joke.Districts and areas in London become weird characters or morph into something sinister. Hammersmith is a jeweler; Old Bailey (the London Central Criminal Court building) a feather-covered old man who lives on the rooftops; Earl’s Court is really an earl’s court, though an odd one indeed; Knightsbridge (an area of West London named after a crossing of the River Westbourne, now relegated to an underground river) becomes Night’s Bridge, a darkness-shrouded crossing that takes a terrible toll on those who pass. Blackfriars (an area in central London) is the home of the Black Friars, like Brother Sable and Brother Fuliginous. Most interesting to me was the real-world counterpart of the Angel Islington: The Angel, Islington is a historic landmark area (originally an inn called the Angel Hotel) on the corner of Islington High Street and Pentonville Road in Islington, an area of London. (The building is now a bank, but the Angel name has been adopted by an adjacent pub.) This web page  is a Google map that links actual London locations to their references in Neverwhere, a fun exercise for those who’ve read this book.Riddell’s whimsical pencil drawings add greatly to the story. Along with the full page illustrations at the beginning of most chapters, there are countless sketches that wrap around and through the text. Rats peek around the corners of paragraphs; lovely, vampire-ish Velvets eye you from the tops and sides of the pages. It’s entrancing.This illustrated edition of Neverwhere also includes Gaiman’s aptly named 2014 short story “How the Marquis Got His Coat Back,” which should be read after the novel. In it we learn more about the Marquis’ family, and meet some characters that were only briefly referenced in Neverwhere, like the sinister shepherds of Shepherd’s Bush.If you’re going to read any edition of Neverwhere, I strongly recommend this illustrated edition, whether you’re already a fan of London Below and its inhabitants, or are considering checking it out for the first time. Despite some weaknesses in the story, it’s well worth your time to experience this fantastical world, especially as envisioned by Chris Riddell.Update #2: I'm upping my rating to 4 stars on reread. Neil Gaiman's mix of dark fantasy, whimsy and wry humor is really appealing, and the plot worked far better for me the second time around. Chris Riddell's pencil illustrations wrap their way in and around the text - they're very cool. I liked Richard, the main character, as Everyman, the way London Beneath worked both as a symbol for the homeless and as an amalgamation of different times and places.Full review to come.Update #1: So the joke's on me. Even though I only mildly liked this Neil Gaiman fantasy novel the first time I read it several years ago, when it showed up on a $1.99 Kindle sale a couple of months ago I decided to buy it (major splurge there) and try reading it again. Because maybe I read it wrong the first time?Not four weeks later a publicist emailed me and offered me this new enhanced hardback edition with illustrations by Chris Riddell for review. I LOVED Riddell's illustrations in The Sleeper and the Spindle, so I said yes, and now it's in my hands. So I could have saved my two bucks, but all things considered I think I've definitely come out ahead. :)We'll see if the reread + Riddell's wonderful pencil drawing illustrations change my initial 3 star rating here.Initial review: Neil Gaiman's fantasy about a dark, magical London underworld, which exists side by side with our world, left me with mixed feels. The setting is marvelous and fantastical, and Gaiman does a great job creating it. The plot, though, about an ordinary working man who extends compassion to an injured stranger and, as a result, unexpectedly finds himself up to his neck in this strange and dangerous magical world, was forgettable, at least for me. I read this four or five years ago and, other than the beginning and the end and a couple of cool settings (especially Knight's Bridge/Nightsbridge), I hardly remember anything about this novel. Still, it's Gaiman, and a lot of people love this book.Interesting personal story: the reason I originally read Neverwhere is because it mysteriously appeared on my Kindle one day, without my having ordered it. About a month later it just as mysteriously disappeared again. Apparently the ebook is magical too!I received a copy of the 2016 illustrated version of this book from the publisher for review. Thank you!!"}, {"Review": "The mean guy inside of me is completely against my giving this book a four-out-of-five instead of a three star rating, but the good guy/casual reader wins out! Hey. C'mon, gimme a break. This is Neil Gaiman: He's not one of Stephen King's favorites for nothing!Incredibly short, seemingly dippy sentences make up this whimsical phantasmagoria-- more Hollywood script/ graphic novel than novel outright. Gaiman mixes and mashes myths & monsters all for this tight, devious yarn. It must be said that the constant name dropping (we see angels, references to Atlantis...um, Charlaine Harris doppelgangers??) becomes insipid: Gaiman takes over already-told stories instead of making brand spanking new ones. All this said, the puppetmaster does well with the toys he himself has brandished, placing them in ridiculous situations as outlandish & incredible as those found at Hogwarts or Oz. This & 'Stardust' are equally lit that is just above average & right below great."}, {"Review": ".“There are two Londons. There’s London above – and then there’s London below.”This book was recommended to me by genial Goodreads friend, Matthew Quann, whose effusive review sealed the deal.I was initially reticent… Having read Gaiman’s The Ocean at the End of the Lane, I felt that his writing was a bit ‘young’ for my own personal taste and decided that, though delightful, his books weren’t for this beyond-middle-aged sourpuss.Despite my misgivings, I dived in and was immediately beguiled – the story returning me to a childhood of Alice in Wonderland and The Wizard of Oz (as was Gaiman’s intent).Our antihero, Richard Mayhew, is a total wuss who fails to meet the high standards set for him by his high-maintenance fiancée, Jessica. But Richard is generous of spirit and one day skips an important business dinner to aid a blood and mud-caked girl who collapses at his feet on a London pavement.He is soon drawn into a lamplit, subterranean world of sewer-dwellers, rat-munchers and pantomime villains. Oh and there’s a marquis and an angel thrown in for good measure!I enjoyed this more than I did The Ocean at the End of the Lane; it had a bit more grit and spite about it - even a swear word or two and an instance of bosom fondling (Neil Gaiman, you naughty schoolboy!).But there is a child-like simplicity to his writing, and I can’t escape the feeling that it’s all a bit too YA for me. Neil strikes me as one of those men who has bypassed puberty on the way to adulthood. His undoubted secret superpowers are his fertile imagination and his unsurpassed ability to connect with his inner child. Only Terry Pratchett did it better.The book is wonderfully Dickensian in parts and Gaiman elicited a lot of knowing nods and smiles from me, with his in-jokes and observations of the London Underground. Neverwhere is as adult-lite as I expected it to be, but it was also a fantastical, wonderfully escapist read; I enjoyed it more than I thought I would, but doubt I'll read any more of his. Thank you, Matthew.(You can see his review here): https://www.goodreads.com/review/show...& Apatt Seriniyom's splendid review: https://www.goodreads.com/review/show..."}, {"Review": "Picture Hitch Hiker's Guide to the Galaxy. Really good books right? Now imagine if someone took the first book and mad libbed characters, settings, monsters, etc, so that you were left with the exact same story except instead of travelling the galaxy with your crazy friend and the most powerful man in the universe, you were travelling in haunted British sewers with a nerd's wet dream of a Xena warrior princess rival and a Gothic princess who can unlock doors (sigh). I don't think there is much of a coincidence either because Gaiman wrote the Hitchhiker's companion in the early 80s, as well as conducted interviews with Adams while he was alive (not to mention took writing tips from him). The only saving grace for me with this book was the fact that there someone actually made a miniseries on the BBC of it that is actually so bad that it makes the book look half way decent. Between all the cliche characters, cheesy narration, and formulaic plot, its just not worth your money or a read, especially when Hitch Hiker exists already. I've said it before, stick to American Gods and The Sandman when it comes to Gaiman."}, {"Review": "Dear Book,Why did you get over so soon?? Why did you get over at all?? :(I could have spent many more hours exploring those underground tunnels in the company of those wonderful people, and reveling in the amazing things that some of them - especially marquis de Carabas - had to say.I could have spent many more days reading and re-reading those delightfully formed sentences, laughing at the intelligent absurdity of it even when not-so-scary villains were doing not-so-pretty things.I could have spent many more rainy Sundays cooped up in my room and dreaming about rat-speakers and angels, midnight markets and doors, the London Above and the London Below.But no matter how much I tried to prolong it (and trust me, I did), the inevitable happened.I made it past the last page.And I miss you. So very much :'(Why are you a standalone, book? Why don't you have a sequel?I loved you before I even started - maybe the words 'Neil Gaiman' on your cover had something to do with that?? Three chapters later and I was unimpressed with your protagonist. Richard Mayhew was such a... such a... damsel in distress - except he wasn't a damsel (Come to think of it, what is the opposite of damsel???) Anyway, I mentally pegged you as a 4-star then but somewhere in those dank tunnels, you charmed me, book. You made me fall in love with you. You won me over with your ready wit and imagination and your lovely, lovely sense of humor.Thank you for coming into my life even if it was for a brief while. Thank you for taking me to that wonderful world. Maybe I'll fall through the cracks and go there someday. Or maybe I'll just revisit it in my dreams - safer that way.Love you. Miss you.Your slightly insane reader,Scarlet.P.s. Please tell Neil Gaiman to never, ever stop writing."}, {"Review": "Richard had noticed that events were cowards: they didn't occur singly, but instead they would run in packs and leap out at him all at once.This is a very well-written and predictable book by Neil Gaiman.Richard is an office drone.Of course he is.And he's dating a go-getting, beautiful woman who doesn't love him for what he is, but sees \"potential\" and dreams about the man she can turn him into. You know the type. Scarlett Johansson from DON JON.And he's miserable, but pretends he's happy because... she's beautiful, I guess? Our first clue that he's a moron.And he's an orphan.Of course he is.One day, which seemed just like every other ordinary day, he and Girlfriend are walking to an important dinner with Important People whom Girlfriend really really wants to impress, when Richard stumbles upon a filthy, skinny young woman in rags who is bleeding profusely. Girlfriend is not sympathetic but Richard shows mercyOf course he does...and takes her back to his apartment where he tends to her wounds.She is not from this world, but from another world, a darker and more dangerous world, hidden right beneath London's surface....Of course. I know where this is going...And she's some sort of princess or something....Of course......I am unsure if I have simply read too many books.Too many books, or too many books by the talented Mr. Gaiman, but either way I saw 99% of the plot coming from 10 miles off.Gaiman was constantly trying to shock me and surprise me. I was neither shocked nor surprised.And I'm starting to think that Gaiman has just one plot, a plot that he uses over and over and over and over and over and over and over and over and over and over again in each novel/story.I've gotten used to his preferences. Like hidden worlds full of sinister and quirky characters. Orphans. Evil bad guys who talk and dress as if they are Victorian gentleman and are always referred to in some respectful way.I'm not slamming Gaiman. He's an excellent storyteller - excellent. The book was fun, quick, and had great world-building. If only I hadn't seen all the characters before. If only I hadn't heard all the details of the plot before. I was disappointed in how little Gaiman was able to surprise me or interest me here.PLUSES: - If it's your first Gaiman book, you'll probably be blown away. - Wonderful rat characters who are cute and charming. - Amazing world-building. - On-point dialogue, fun characters, a breezy, action-adventure movie type feel with that special Gaiman dark-but-not-really-dark feel thrown in. - Is able to maintain a \"dark fairytale\" feel while included things like the word \"fuck\" and used condom wrappers. - Good ideas that he works into his writing, such as:When he had first arrived, he had found London huge, odd, fundamentally incomprehensible, with only the Tube map, that elegant multicolored topographical display of underground railway lines and stations, giving it any semblance of order. Gradually he realized that the Tube map was a handy fiction that made life easier but bore no resemblance to the reality of the shape of the city above. It was like belonging to a political party, he thought once, proudly, and then, having tried to explain the resemblance between the Tube map and politics, at a party, to a cluster of bewildered strangers, he had decided in the future to leave political comment to others.Or what about this:He continued, slowly, by a process of osmosis and white knowledge (which is like white noise, only more useful), to comprehend the city,...Isn't that interesting? It's such an interesting idea. - Sometimes Gaiman is genuinely funny, usually when he's discussing sex.The thin girl was gulping down one of Richard's bananas in what was, Richard reflected, the least erotic display of banana-eating he had ever seen.Or how about this, this cracked me up:A late-night couple, who had been slowly walking along the Embankment toward them, holding hands, sat down in the middle of the bench, between Richard and Anaestheisa, and commenced to kiss each other, passionately. \"Excuse me,\" said Richard to them. The man had his hand inside the woman's sweater and was moving it around enthusiastically, a lone traveler discovering an unexplored continent. \"I want my life back,\" Richard told the couple.\"I love you,\" said the man to the woman.\"But your wife - \"she said, licking the side of his face.\"Fuck her,\" said the man.\"Don' wanna fuck HER,\" said the woman, and she giggled, drunkenly. \"Wanna fuck YOU...\" She put a hand on his crotch and giggled some more.I found this very funny.MINUSES: - Pathetic man-child hero who is supposed to go from zero to hero, but instead goes from zero to perhaps a zero-point-five. Starts off as a worthless noodle, ends up being a worthless potato. Slightly harder, more nutritious, but basically still brainless and not worth much. - The book is very predictable. - The book, being a \"dark fairy tale\" like the majority of Gaiman's books, can be a little cutesy and trite at times. - Gaiman often tries too hard. I found his evil Victorian gentleman villains to be a LITTLE too dramatic and over-the-top for my tastes. It's just...It was too consistent, to steady and inexorable a walk to be described as a stroll: Death walked like Mr. Vandemar.Oh, yes. He walked like death. Uh-huh. Please make some attempt to control yourself, Mr. Gaiman. I can handle the sharp teeth and long black coats and eating pigeons and all that other crap, but there has to be some end to the hyperbole, surely? - Not only does he try too hard in the writing (occasionally) but some of the jokes are just... COME ON. We have De Carabas stealing candy from a baby at one point. LITERALLY. Stealing candy from a baby. Isn't that a bit much? I think it's a bit much. There's no other reason to do it than to show what kind of man De Carabas is.This is the kind of thing I'm dealing with here.Or \"Mind the Gap.\" You know, that sign by the train that says, \"Mind the gap\"? And in this book the \"gap\" is actually this wraith-like thing that comes out of that space and tries to kill you or eat you or something.You know. Like Alice in Wonderland jokes. There's a lot of Alice in Wonderland type jokes in here.You should see how Gaiman takes paragraphs (PARAGRAPHS) to lovingly and carefully set up a \"the penny has dropped\" joke. It's... Well... Not too funny, IMO.Or what about when Gaiman has Richard go up to Jessica, and - to prove that he knows her - say, \"You're Jessica Bartram. You're a marketing executive at Stocktons. You're twenty-six. Your birthday is April the 23rd, and in the throes of extreme passion you have a tendency to hum the Monkees song \"I'm a Believer\"....\"Listen, I see what Gaiman is trying to do. He thinks that a woman who hums \"I'm a Believer\" when she's having sex is funny. But the whole idea is ludicrous. If you are \"in the throes of extreme passion\" you should be unable to hum anything. Or, ideally, be unable to even form coherent thought. The whole idea is ridiculous to the point where it wasn't funny to me.You think THAT'S ridiculous in a book about beasts living in sewers and angels and vampires and etc.?Yes.Okay. Weirdo. - The ending. I mean, SO PREDICTABLE. The (view spoiler)[not-so-nice ex-girlfriend comes crawling back to the pathetic man-child and begs him to marry her. He's no longer interested. He's so far above her now. He can't even be tempted. (*Carmen is angry*) Typical male fantasy.He's returned to the real world after becoming The Warrior (who defeated the Beast and saved people blah blah blah) only to find out a 9-5 office job doesn't hold his interest anymore? There's a big surprise. He ends up deciding to go back and live in the filthy but magical Otherworld? There's a big surprise. (hide spoiler)]But perhaps what upsets me most about the ending is that he's supposed to be transformed from a man-child or a pasty untested office drone or a slave to the Matrix or what-have-you into a strong, capable, competent man and I just DID NOT BUY this. I'm not buying it. Not to mention that I'm still EXTREMELY angry with Richard for (view spoiler)[letting that rat-girl Anaesthesia die.  (hide spoiler)] Fucking hell, it was like he didn't even... I mean, fuck. He should have DONE SOMETHING. He just accepted (view spoiler)[her death (hide spoiler)] like it was nothing. Am I supposed to be OKAY with this shit? Am I supposed to be okay that he didn't fight for her? No, I'm not okay with this. Fuck that. - Oh, and he's a moron. Richard is a huge moron throughout the book. And he never gets any smarter. To my intense dismay. I find it hard to respect or admire someone so stupid....Tl;dr - In conclusion: An excellent story wonderfully told by a master storyteller.Unfortunately, due to me having read too many books or perhaps too many books by this particular author, I was not as impressed as I had hoped to be.Still, a great dark fairy tale with rich and deep worldbuilding and fascinating ideas."}, {"Review": "\n“Beware of Doors.” \nNeverwhere reminded me of Alice in Wonderland with a darker setting. The lead character is an adult confronting a world that he's never known before. The concept of Neverwhere is easily understandable even though the narrative is multi-layered and complicated. Why not ? This is exactly an urban fantasy novel without young adult materials, but Gaiman managed to throw some little things that we're so accustomed to, such as London, the lousy villains, the wise hero and MAGIC.There's a point that hit me hard, though. It's about when the author described about Thailand, which is my country, he said that it smelled like sex and forests. The first thought coming to my head was the fact that it was true. I loved how surreal this work was, the mix of fact and fantasy is even and it's hard to find this kind of work from somewhere. Neverwhere is a piece of art that is so simple but unique because it was written by Gaiman.\n“He had gone beyond the world of metaphor & simile into the place of things that are, and it was changing him.” \nThe twists were wicked. The dialogues and the actions subtly convinced me to ponder what I knew amd got from reading this book. The lack of the connection between these characters was the only that took out one star from my review. Richard's motivation was kinda flat, but other than that, everything in Neverwhere was fine and worth reading.\n“Mind the gap!” \nhttps://goo.gl/cFctLe"}, {"Review": "\n“The Marquis sighed. \"I thought it was just a legend,\" he said. \"Like the alligators in the sewers of New York City.\"Old Bailey nodded, sagely: \"What, the big white buggers? They're down there. I had a friend lost a head to one of them.\" A moment of silence. \"It was OK,\" gurned Old Bailey with a grin that was most terrible to behold. \"He had another.”\nThis book feels like pure magic. And wow, looks like I'm getting the Gaiman hype. Neverwhere follows the story of Richard Mayberry, a pile of anxiety who becomes immersed in the world of Door, an injured girl whose life he saves. But I think this is a more universal story than that - Gaiman is trying to impart a message about life being more meaningful when you risk things for happiness.\n“I mean, maybe I am crazy. I mean, maybe. But if this is all there is, then I don't want to be sane.”\nGaiman is an expert at worldbuilding that’s clever but not overwhelming. The reader is thrown into his world in the same way the characters are - no infodump, no exposition. The worldbuilding here is, while sadly no longer as original as it was in 1995, quite entertaining – I especially loved the concept of a hidden market spread by rumor. And a series of plot reveals and developed characters help the book gain a sense of true authenticity. Maybe my favorite thing about this book is the excellent comedic irony. Something I’ve consistently loved about Gaiman is his villain writing – his villains tend to be humorous characters in their own right. While it’s a little thing, it helps to give his books their sense of timelessness and blurring of the boundaries between children and adult literature. But honestly? The main strength is the writing. This was the first Gaiman book I read in physical copy, and I think his writing may just translate better for me on paper than on audio because I liked this so much more after I switched from audio - and that’s even though I love his voice!! The lack of references within the writing give a sense of timelessness and ambiguity that feels perfect for the story. Maybe there's not much special about the story, but his writing is so much fun and so good. Okay, quick shoutout to racism in the 1990s - the line “giggled like a Japenese girl” is racist as hell and should’ve been cut in the new versions, and I’ve read multiple  articles on the racist implications of using “caramel-colored” or other food metaphors as a skin description, so that was cringey. There is also a character whose death, while handled really honourably, is super tropey. REAL SPOILERS AHEAD: (view spoiler)[a sapphic black woman being killed off when literally every other non-villain character survives the book? That is…. interesting (hide spoiler)] The only reason that shit like this didn't bother me more was the fact that this was pubbed in 1995, but damn, would really like that cut. Overall, though, I found this book supremely entertaining. With developed characters, interesting worldbuilding, a timeless feel, and such excellent writing, this is one I’d highly recommend. Blog | Goodreads | Twitter | Youtube"}, {"Review": "God damn it, Goodreads, when are you going to let me use half-star ratings? You had enough time to make those hideous green \"want to read\" tabs next to every damn book in my newsfeed; could you please throw me a bone and stop confining me to full stars? I demand half stars, Goodreads. Particularly for this review, because three stars seems unfairly low, and four stars is a bit much. Neverwhere is early Gaiman (published in 1996), and it shows. You can see him working on the formula that would make American Gods, Anansi Boys, and Coraline successes - unassuming Everyman gets sucked into a magical, dangerous new world and had to navigate through the insanity - but not quite getting it right. This reads sort of like a first draft of his later, more well-crafted books. The story takes place in modern-day London, and our Everyman is Richard Mayhew, who discovers a girl bleeding on the street one night. He takes her to his apartment and patches her up, and almost immediately a sinister pair of not-quite-men appear at Richard's apartment looking for the girl. The girl's name is Door, and the rest of her family was murdered. Door has the ability to open things that are locked (hence her name), and is being hunted because of this ability. Richard tags along with her, not entirely willingly, into London Below, which is a classic Gaiman world of magic and terror. And, in true Gaiman fashion, the fate of the world hangs in the balance.It's a good story, the characters and worldbuilding are magnificent, and it's full of Gaiman's signature reminders that magical worlds are actually fucking terrifying, as well as plenty of his unexpectedly funny bits, like this exchange:\"The door was opened by a sleepy-looking footman, wearing a powdered, crooked wig and scarlet livery. He looked at the motley rabble on his doorstep with an expression that indicated that they had not been worth getting out of bed for.'Can I help you?' said the footman. Richard had been told to fuck off and die with more warmth and good humor.\"But throughout the book, even as I was being alternately thrilled and horrified by the story, there was a palpable feeling that something was missing. The villains, while terrifying, were somehow not as threatening as they should have been; I saw several of the big plot twists coming a mile away (view spoiler)[Seriously though, was anyone surprised that Hunter turned out to be the traitor? And obviously the angel was the Big Bad, because the Marquis was too obvious and there weren't any other characters available for the role (hide spoiler)]; and somehow the big quest never felt important or developed enough. It was something involving a key - I read the book a few days ago, and already the details of the mission are slipping away - but I never felt like I really understood the importance of it all, and it just functioned as a way for the characters to keep hanging out and struggling against evil together. By the end of the book, the entire quest just felt like one big MacGuffin, and I was left feeling slightly deflated. None of this should suggest, of course, that this book isn't good. Because lest we forget, Average-Quality Gaiman is still Really Really Good Gaiman. Even after all the mild disappointments I listed, I still found myself invested in the world of London Below, and wishing that I could read more about it. Ultimately, the book functions as a good introduction to Gaiman and why we love him, but it doesn't hold up to his later works. "}, {"Review": "3 of 5 stars to Neil Gaiman's Neverwhere, a fantasy full of quirky characters and commentary on society, published in 1996. This was another book group selection (not mine), but by someone who has very good taste in books.I'd never read Gaiman before, but he seems to be immensely popular. We read it in 2009, many years after it first hit print, but still at the cusp of my interest in fantasy books. I think it was too much of a fantasy for me, as I tend to need some rules or boundaries, and I couldn't tell what was real here. Seems it's all real, but for a newbie at the time, I was lost.Essentially, a man wandering around London, falls through a hole of sorts... into fantasy world... and when he returns, everyone has basically forgotten who he was. Right from that point... I'm not sure what's real anymore. But I stuck with it... and he meets tons of people after him, including a mouse (yes a mouse)... Door (yes, that's her name) is his new friend, and she's helping him thru this new world, but then she disappears. Very complex. Door must stand for something. I might consider re-reading this one again to see if I'm more open-minded about it. And this refers to my understanding of the book and the graphic above about \"I'm lost and returning...\" Never happened.Key Take-a-Ways1. The characters are wonderful. Imaginative. Vivid. Very likable, but also a tad confusing. Was this Peter Pan in Neverland??????? Alice in the Wonderland?2. London is very dark. Scary dark.3. Life is not what it seems. Don't ever try to be a Good Samaritan and rescue someone. NOT WORTH IT!!!!4. Gaiman is a master at intense visuals.5. I'm not as creative as I think I am.So... read this if you love fantasy. If you don't, I wouldn't chance it. This was a very \"out there\" type book for me... though it had many funny and wonderful parts.Good Luck if you cross that one...\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by. Note: All written content is my original creation and copyrighted to me, but the graphics and images were linked from other sites and belong to them. Many thanks to their original creators.[polldaddy poll=9729544]\t[polldaddy poll=9719251]"}, {"Review": "“There are four simple ways for the observant to tell Mr. Croup and Mr. Vandemar apart: first, Mr. Vandemar is two and a half heads taller than Mr. Croup; second, Mr. Croup has eyes of a faded china blue, while Mr. Vandemar’s eyes are brown; third, while Mr. Vandemar fashioned the rings he wears on his right hand out of the skulls of four ravens, Mr. Croup has no obvious jewelery; fourth, Mr. Croup likes words, while Mr. Vandemar is always hungry. Also, they look nothing at all alike.” Mr. Croup and Mr. Vandemar are two of the most vividly imagined villains I have ever encountered in fiction. Google their names and you will find numerous fan arts of the two of them, with surprising variations on how they are visualized by the artists. “We are,” said Mr. Croup, “after all, famed across the entirety of creation for our skill in the excrutiatory arts.”Neverwhere is full of memorable characters, when you read a book in the fantasy field (urban fantasy in this case) it is usually the world building and the plot that drive the narrative, but Gaiman is not your average author, even within his fantastical setting we are still very much invested in the characters.Neverwhere is basically the story of mild-mannered office worker Richard Mayhew who proves the old adage “no good deed goes unpunished” by helping out a girl he finds bleeding on the pavement. The girl is called “Door”, a member of a noble family from “London Below” a parallel dimension of the normal London (called London Above by the “Below” people). She is on the run from Mr. Croup and Mr. Vandemar who are intent on putting an end to her as they have already done to the rest of her family. Richard takes her to his flat, treats her injuries and allows her to recuperate there. Hunter, Door and Richard by FuelreaverUnfortunately, soon after Door returns to London Below Richard find that he had suddenly become an “unperson”, unseen, unknown and forgotten by the people of our world. To get his life back he must enter the strange world of London Below and help Door to find the person who hired assassins to murder her family and their reasons for doing so. Tremendous fantasy adventure ensues.Neverwhere is a wonderful read, a colorful, fantastical romp with a heart. If you are a denizen of “London Above” you will find extra enjoyment from the odd characters based on different London locations, such as the Earl who holds his Court in a magical London underground tube train car, the beautiful Angel Islington, the formidable Seven Sisters, a nice old man called Old Bailey etc. Gaiman manages to make interesting characters out of them all. \n The full main cast, click on image for full size (sorry I don't know who to credit just yet!)Better still, are the central characters, Richard Mayhew is your average nice everyman character the readers can easily identify with, but he is quite dynamic in how his bizarre adventures change him over the course of the novel. If he seems ineffectual to begin with, by the end of the book I was rooting for him to succeed and prosper. Door is lovable, her female bodyguard Hunter is incredibly badass and her roguish right-hand man, The Marquis de Carabas, would be an anti-hero if he was the hero of the story.The narrative is rather episodic which detracts from the momentum of the main story arc a little, but every episode is a delight. Some element of humour is present in almost every scene and most of the dialogue. The climax is suitably thrilling and the epilogue, though a little predictable, should leave most readers feeling warm and fuzzy.Neverwhere actually started life as a BBC TV series in 1996, written by Gaiman and comedian Lenny Henry. The script was later novelized by Gaiman and published alongside the broadcast of the TV series. It was also adapted as a graphic novel/ comic book series and a  radio drama in 2013. I wish I could keep up with all these adaptations, I will have to seek them out somehow. In the meantime, I am delighted by the book and highly recommend it._____________________________• Update Feb 18, 2017: Neil Gaiman's Next book will be a sequel to NeverwhereComic book coverQuotes:“Do all the machines just give you things like that?” asked Richard. “Oh yes,” said the old man. “They listen to the earl, y’see. He rules the Underground. The bit with the trains. He’s lord of the Central, the Circle, the Jubilee, the Victorious, the Bakerloo—well, all of them except the Underside Line.”“Remember what I told you about the shepherds of Shepherd’s Bush?”“He tried to apologize to her in French, which he did not speak, gave up, and began to apologize in English, then tried to apologize in French for having to apologize in English, until he noticed that Jessica was about as English as it was possible for any one person to be.”“Is there anything, really, to be scared of?” “Only the night on the bridge,” she said. “The kind in armor?”“The kind that comes when day is over.” And then they set foot on Night’s Bridge and Richard began to understand darkness.“Metaphors failed him, then. He had gone beyond the world of metaphor and simile into the place of things that are, and it was changing him.”\n Wonderful fan art by SegundusPeter Capaldi as Angel Islington in the 1996 BBC series"}, {"Review": "Actual Rating: 3.5 StarsI've not read as much of Neil Gaiman's work as I would have liked to by this point in my life, and so I thought I would fix that with one of his stand alone novels. Neverwhere follows the story of Richard Mayhew, who after a show of good Samaritanism finds himself accidentally in the world of London Below. It's just like London Above (a.k.a. our world), except for everyone and everything in London Below is probably trying to kill you. It's also very dark.There is honestly a lot to love here. Gaiman writes characters exceedingly well. He also has a flare for the wicked & ridiculous. You don't often find an author who can so seamlessly blend together comedy with cruelty.His writing style in general is very complimentary to the type of story he's telling here.Here's an example:“You've a good heart. Sometimes that's enough to see you safe wherever you go. But mostly, it's not.”This novel is ripe with black humor, violence, and magic; it's critical of how often we anxiously await the end of our journey through life instead of enjoying the ride. Overall, a cleverly told tale with a genuine message with an great cast of characters for the delivery. Where this book fell short for me was in it's plot. I just did not care how this plot ended up working itself out.I was soooooooo unengaged. There were funny moments where I would pop my head back into the story, but for the most part I didn't care who stayed, who went, who lived, or who died. It's not that it was a boring, but no aspect of it really caught my attention. So in short, I'll say that I enjoyed where this novel was trying to take me. I maybe wasn't on board with some of it's components, but there are some absolutely stellar moments.If you're die hard fan of Gaiman, this is definitely required reading. But if you're looking to discover why people love him, I maybe wouldn't start here."}, {"Review": "What a wonderfully whimsical and well-written novel.One of my projects for 2017 was to get through a stack of Neil Gaiman books, of which Neverwhere is my fourth and favourite. My first ever exposure to Gaiman was during my high school years as I established a bedroom basecamp to read the beautiful, hefty, and leather-bound Sandman absolute collections. I can remember the feeling of being captured by Morpheus and his family and never quite knowing what type of story Gaiman had in store. To this day, Gaiman's seminal series remains my all-time favourite comic and one of the most influential works in my life.It comes as little surprise to me that this is my favourite Gaiman novel as it is the most like Sandman. Neverwhere opens with the entirely average, good-natured Richard Mayhew opting to help a wounded homeless girl on the streets of London rather than go off on an important date with his fiancé. Richard's decision to help this girl, Door, leads him to an unimaginable realm beneath London, aptly called London Below. It is there that Richard meets vagabonds who speak-to and revere rats, an ageless hunter of mythical beasts, a charming con-man, and a whole host of other wonderful beings. From early on, London Below captured me as only the best fantasy worlds are able. There's grit, grime, humour, mystery, and scams lurking behind every corner. Neverwhere is kept aloft on a sea of peculiar magic by Richard Mayhew's delightfully astounded and questioning behaviour. As the magic in the world becomes more and more prominent, the reader is able to accept this new reality because of Richard's incredulity throughout the earlier portions of the book. My fiancé recommended this one to me and we had a great chat about how Gaiman builds London Below so effectively because Richard is essentially the reader placed in this ludicrous situation. We also discussed how it is a little bit like adult Harry Potter! I could go on at length about how Door is a terrific hero and that her quest to avenge her family makes her the driving force behind the novel's momentum. I could also talk about the Marquis de Carabas' endless charm and his presence in the book as a kind of dirty wizard. Oh, and it would be a shame to leave out Mr. Croup and Mr. Vandemar, the book's murderous and hilarious antagonists. But here's the thing: all of those characters are better met through Gaiman's superb novel. There are few books that make me feel panic or worry as I turn the last few pages, but Neverwhere had me on the edge of my seat as I was escorted out of London Below. This book is great, and I can easily recommend it to anyone looking for a compelling and entertaining adventure novel."}, {"Review": "Neverwhere is one of those books that answers the 'what if' question about the city in which you live your days, going through your admittedly 'mundane' routines. In this case, London. What if there was a London Below, a strange world which consists of Underground railways, tunnels, sewers, and sometimes uncannily parallels the London that the average inhabitant thought they knew but didn't, and in a way that seems a lot more interesting? It's a scary place, not terribly clean and sanitary. But it's also a place of wonders. If you spent some time there, would you find yourself, and realize that the normal world just doesn't hold the same charm for you, now that you've realized the possibilities? With this book, you can ponder these questions for yourself through the viewpoint of Richard Mayhew.The unknown is scary for us. Scary, but also exciting. You just have to find the courage to seek it out. That's one thing I love about books. They take me places that I'm not sure I'd want to go in real life. And in the process, they make me want to be braver than I am. Richard has to find that courage (the hard way), but he becomes a hero and a champion in his own right in the process of his journey. He faces pain, loss, and uncertainty, but he gains a lot more in return. This is the third book I've read by Neil Gaiman (all on audio), and I really appreciate his writing. He has a wonderful way with humor, a grand sense of adventure and whimsy, and he finds the uncanny and fantastical in the everyday and ordinary. Honestly, that's why I love fantasy, particularly urban fantasy. Although parts of this story were dark in subject matter and could have been too gruesome, the writing keeps the subject from being over the top in these areas. Subtlety in storytelling gives this reader enough to know just how bad the bad guys are, and without the scenes being too off-putting. And there is always hope that good will win out. I need that in a book. Of course, living in the sewer and the underground aren't the most clean ways to go about one's business, but there was also an undeniable appeal to these worlds. I'm not saying you will see me taking off on a sewer adventure (not going to happen), but at least I can read about it, and think that it didn't sound quite as bad as I thought it would (for the most part).I liked the diversity of this world. People of different colors, shapes, sizes and origins. That's how a big city like London truly is, not the monochromatic make-believe of some of the shows on TV (which I won't name) where you wonder how the characters can go seven seasons without ever encountering a person of color. And the diversity isn't just background filler. Diverse people have strong roles in this story. With this added appeal, it made the novel even more enjoyable.Neverwhere was a fun, interesting novel, with some mystical, otherworldly elements right smack dab in the middle of the everyday. I loved that about this book. I am so glad I started reading Neil Gaiman. I recommend you give this book a try if you haven't read him yet.Overall rating: 4.25/5.0 stars."}, {"Review": " \"Τίποτα δε θέλω. Αλήθεια. Απολύτως τιποτα\". Και ξαφνικά συνειδητοποίησε πόσο αλήθεια ήταν αυτό. Και πόσο φρικτό. \"Έτυχε ποτέ να αποκτήσεις όλα όσα ήθελες; Και να καταλαβεις μετά ότι δεν ήταν αυτά που ήθελες;\" Νομίζω δε θα μπορούσα να διαβάσω σε καλύτερο timing το συγκεκριμένο βιβλίο. Ο κεντρικός ήρωας με τα λόγια που σας παρέθεσα λίγο πιο πάνω, συνοψίζει σε γενικές γραμμές ένα από τα πολλά ερωτήματα και προβληματισμούς που βασανίζουν το τελευταίο διάστημα το μυαλό μου και προσπαθώ να βρω την απάντηση. Είμαι από τους ανθρώπους που πάνω κάτω όπως και ο ήρωας μας είχα μια συγκεκριμένα τακτοποιημένη ζωή και μέχρι μια ηλικία ήμουν και πολύ ευχαριστημένη από αυτή. Μάλλον δεν ξέρω αν ημουν ευχαριστημένη αλλά αν θέλετε δε με είχε προβληματίσει ποτέ συστηματικά και έντονα αν ήταν όντως η ζωή που είχα ονειρευτεί. Τι γίνεται λοιπόν όταν ο κόσμος σου μια μέρα αναποδογυρίσει? Τι γίνεται όταν πιστεύεις ότι είσαι εδώ κάπου και ξαφνικά βρίσκεσαι στο πουθενά? Τι γίνεται όταν μπορεί μεν να μην έχεις μια άσχημη ζωή αλλά από τη μια μέρα στην άλλη σου φαντάζει τόσο πολύ προβλέψιμη και βαρετή μέχρι απελπισίας. Τι γίνεται όταν ξαφνικά αρχίζεις να βλέπεις πράγματα που μέχρι τότε έκλεινες τα μάτια ή τι γίνεται όταν ξαφνικά ανοίγεις τα μάτια και αντικρίζεις μια διαφορετική πραγματικότητα από αυτή που πίστευες?  \"Για τις πόλεις ισχύει το ίδιο που ισχύει και για τους ανθρώπους, κύριε Βάντερμαρ\", είπε ο κ. Κρουπ. \"Τα έντερά τους είναι ο καθρέφτης της υγείας τους\". Ο συγγραφέας λοιπόν βάζει τον ήρωα του και μαζί τους αναγνώστες του μέσω ενός εξαιρετικού παραλληλισμού να σκεφτούμε ακριβώς αυτή την τακτοποιημένη ζωή που έχουμε όλοι μας, τις σχέσεις μας με τους άλλους ανθρώπους. Έτσι βρισκόμαστε να παιδευόμαστε μαζί με τον ήρωα για το ποιοι είμαστε ποιο είναι το πραγματικό και το εξωπραγματικό μέσα σε ένα φανταστικό κόσμο που στήνει στο κάτω Λονδίνο. Μια μοναδική περιπέτεια που στήνει ο συγγραφέας όπου αλλάζει η αίσθηση του χρόνου Πένα μαγικήμ ευφάνταστη και με απεριοριστο σεβασμό και αγαπη στον ήρωα του. «…Αγαπημένο μου ημερολόγιο. Την Παρασκευή είχα δουλειά, αρραβωνιαστικιά, σπίτι και μια ζωή, που είχε νόημα (όσο νόημα μπορεί να ΄χει μια ζωή τέλος πάντων). Και ξαφνικά βρήκα ένα πληγωμένο κορίτσι στο πεζοδρόμιο και προσπάθησα να είμαι Καλός Σαμαρείτης. Τώρα δεν έχω ούτε αρραβωνιαστικιά, ούτε δουλειά, ούτε σπίτι και τριγυρίζω μερικές εκατοντάδες μέτρα κάτω από τους δρόμους του Λονδίνου, με προσδόκιμο ζωής μικρότερο κι από έντομο εφήμερο, μυγάκι της μιας μέρας…» Αλήθεια εσείς τι θα κάνατε αν ήσασταν ο Ρίτσαρντ? Και ο δικός μου προβληματισμός συνεχίζεται"}, {"Review": "*7/10 spangly shooting starsA contemporary urban fantasy novel in typical slightly off-beat Gaiman style. It's mainly a portal fantasy (the kind where you go from the \"everyday\" world to a \"special\" world through some kind of portal, as with Alice in Wonderland, The Lion, the Witch and the Wardrobe / The Magician's Nephew, Harry Potter Boxset, The Wonderful Wizard of Oz, The Fionavar Tapestry, etc.). The 'alternate world' (the world where Londoners who \"fall through the cracks\" go), has the setting and atmosphere of a Gaslamp fantasy.I loved the eminently accessible style and the humor. The well-executed pace and tension kept me easily and continuously turning the pages - at some points even faster, due to good foreshadowing and tension-building, without me ever stalling my read out of boredom. The characterization (one couldn't help becoming fond of dear old bumbling Richard much as you do of Bilbo Baggins), was also good, so pretty much all of the basic literary elements were well executed. ...and speaking of Bilbo Baggins, structurally speaking, the novel felt like a fairly standard monomyth, and also has elements of a Bildungsroman. (In fact, I had to keep stopping myself from mentally ticking off the 'stages' of the traditional fairy tale as per the structuralist narrative analysis of folk tales by Vladimir Propp and Svetlan Todorov.)Is Gaiman doing this on purpose, though subtly twisting it? It seems awfully similar to one of his other works, Stardust , from a narratology/structuralist point of view...but the ending to some extent subtly thwarts the traditional folk narrative - it goes a bit farther, in that the hero might not quite end up where he had started. (Which is a good thing, of course - uniqueness in literature is always a good thing; we don't want to be reading cookie-cutter books all the time, do we?)I'm struggling to decide between a 3 and a 4 star rating. I had already rated most of the fantasy fare that I had enjoyed over the years 3 stars - (but we need more stars, Goodreads!) ..so giving this one more would, for instance put it above Lee and le Guin and on par with Gene Wolfe - and Wolfe is, in my opinion, definitely a cut above this - but then I should probably go and rate my Wolfe upwards.... I'm especially trying to decide how much I like the ending. Enough for a 4? Is Gaiman just patly endorsing escapism, a sort of Never-neverland of never growing up and not facing Life? ...or is he saying there is more to life than just eating, rutting, sleeping and earning the wherewithal to do so? It seems ambiguous enough to leave me pondering, and that is a good thing too!Is Neverwhere a metaphor for the \"soul\"? For creativity maybe, or perhaps for meaning? Is Gaiman saying we should stop to smell the flowers, to see the magic in Life? Is he saying that we should make a conscious effort to keep the magic - the wonder that a child feels for life - that thing that C.S. Lewis described as \"joy\", in our lives? As opposed to the other possible interpretation, being that this is simply a pat fantasy escapist novel which puts out the general implication that Life is too dull and boring to be bearable? If the former interpretation holds true, then I should be giving this 4 stars, which is my rating for more exceptional books. ...but the last chapter is so ambiguous... Hmmmmm. It's really hard, this star-rating thing.Well, maybe it deserves 4 stars just for the marvelous creation of the magnificent character of Hunter, who seemed to me that she could be a slightly more 'tribal' version of this: "}], "Image": "https://images.gr-assets.com/books/1348747943l/14497.jpg", "Desc": "Under the streets of London there's a place most people could never even dream of. A city of monsters and saints, murderers and angels, knights in armour and pale girls in black velvet. This is the city of the people who have fallen between the cracks.Richard Mayhew, a young businessman, is going to find out more than enough about this other London. A single act of kindness catapults him out of his workday existence and into a world that is at once eerily familiar and utterly bizarre. And a strange destiny awaits him down here, beneath his native city: Neverwhere."}