{"Genre": "Fantasy", "ID": "22055262", "Name": "A Darker Shade of Magic", "Reviews": [{"Review": "\nEvery night of the year, the market lived and breathed and thrived. The stalls were always changing, but the energy remained, as much a part of the city as the river it fed on. Kell traced the edge of the bank, weaving through the evening fair, savoring the taste and smell of the air, the sound of laughter and music, the thrum of magic.\nI'm already a Victoria Schwab fan after reading her good vs evil superhero urban fantasy novel - Vicious - so I couldn't wait to get reacquainted with her addictive writing style, complex characters and wonderfully-conceived fantasy worlds. As it turns out, A Darker Shade of Magic was even more than I'd expected.This book feels more like traditional fantasy than Vicious with the style, the invention of a new language, the large cast of characters, the magic, and the focus on royal/political dynamics. And yet, to use the word \"traditional\" anywhere near this novel is an injustice because it's unlike anything I've ever read before.The characters are weird and colorful. We have a protagonist - Kell - who is strong and badass enough to root for, but also complex and layered enough for us to truly care about and relate to. Plus, he has a coat that has many sides, which he turns around depending on how he wants to look - insane, unique, wonderful. Schwab's imagination clearly knows no bounds.We also have a cross-dressing pirate who happens to be a tough, infuriating and lovable female character - Lila. And a promiscuous prince, villains who are blood slaves, evil twin rulers and much more. And then there's this bizarre world that just played on every one of my senses. The author asks us to believe in a setting that is incredibly farfetched and yet she breathes life into this world with evocative language and makes the unbelievable something we can picture in our heads. She shares little stories from this world's history to flesh out the picture:\nThe infamous Krös Mejkt, the “Stone Forest,” was made up not of trees but of statues, all of them people. It was rumored the figures hadn’t always been stone, that the forest was actually a graveyard, kept by the Danes to commemorate those they killed, and remind any who passed through the outer wall of what happened to traitors in the twins’ London.\nWhat's all this about the \"twins' London\"? Well, in this world there are four different versions of London that only the Antari like Kell can move between. Technically, there are only three these days because Black London fell, consumed by its own misuse of magic. The others are Grey London (the one we know), Red London (the one Kell is from) and White London (ruled over by the sadistic Danes twins).Everyone, it seems, is out to use magic for their own selfish goals in this book. And when a mysterious relic from Black London - a relic that should have been destroyed - reappears, Kell and Lila must do what they can to protect it from all those who wish to claim it as their own.Nothing short of a wild, fast-paced adventure.Blog | Facebook | Twitter | Instagram | Youtube | Pinterest"}, {"Review": "\n“I’d rather die on an adventure than live standing still.”\nIsn’t it astonishing how upon our second readings of our favourite books, we discover so much more about our beloved characters and the world-building itself than the first time around?And so in consequence to my rereading of A Darker Shade of Magic in order to be fully prepared (memory-wise) for A Gathering of Shadows, I started seeing redeemable qualities in Delilah Bard, the fierce, courageous (yet reckless) thief.When she and Kell—the gorgeous Kell, my sweetheart, Kell—had gotten closer on my first reading of this book, I damn straight wanted to chop her head off.But now, my wish is only to smother her a little bit in her sleep—just a little bit.Progress, right? Saves me a death sentence.A Darker Shade of Magic is such a colourful book. I say that because there is not one dull character or moment in the story. Even Holland—yes, the poker-faced Holland—released a feeling inside of me… curiosity.It’s a dangerous world—forgive me, worlds—Kell lives in. In Red London is by far the most agreeable place to live in, but the other worlds (or shall I say ''alternative Londons'')—Grey London, White London and (dead) Black London—are not as pleasant.But magic runs through his blood, for he has a great purpose: to travel through the Londons for diplomatic purposes and to keep peace… He’s somewhat of a guardian to those lands.Kell is incredible. It’s—and I mean it—impossible to dislike him. He’s understanding, temperate, calm, powerful and charming without even trying to be (he really isn’t), unlike his brother, Rhy, whom I love dearly but do not get to spend much time with (what’s with not including him in the adventure, Miss Schwab?)Miss Schwab is a very skilled writer. What’s funny is that even though this is a relatively dark fantasy novel for (debatably) mature teenagers, it strangely feels like a fairytale, or a cautionary tale, rather. It’s just so… memorable and… re-readable, like a classic.Love, love, love! To all fantasy readers who have yet to plunge into A Darker Shade of Magic, feel my wrath! (You need read it.)Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"Review": "YA/adult Fantasy. There isn't just one London. There are, in fact, four cities sharing that name and geographic location, each in a very different plane of existence. The novel takes place in the early 1800s, when magical travel between the different Londons has been severely restricted. Long ago, the place called Black London underwent a massive magical accident -- a sort of implosion during which the forces of magic consumed the humans who tried to wield it. Since then, the doors between the worlds have been sealed. The only ones who can travel from world to world are the blood magicians known as Travellers. When we first meet the traveler Kell, he has arrived in Grey London (in our own un-magical world) to deliver a message from his own sovereigns of Red London to King George III and the Prince Regent. The existence of other Londons, we learn, is a closely guarded secret that only the rulers know. We follow Kell's travels from Grey London to his home, the magical Red London, to the sinister world of White London, ruled by a pair of despot siblings who make Vlad the Impaler look like a nice guy. At the same time, we meet a young thief of Grey London named Lily Bard, whose life becomes entwined with Kell's accidentally as they are both plunged into a plot to reawaken magic and tear down the walls between the worlds.Phew! Just describing the book makes it seem complicated, and it is an intricate world that V.E. Schwab has created, but it's not as confusing as it seems. I highly recommend checking it out if you like fantasy. The idea of four separate Londons is fascinating, and like all the best fantasies, this novel makes its system of magic seem absolutely plausible. Me -- I hope I never get stuck in White London. That place is YIKES. Having said that, I would definitely sign up for more adventures with Kell and Lily!"}, {"Review": "\n\n“As Travars,” he said. Travel. \n\nAnd oh boy, I did travel. I was covered in smoke, I tasted metal, I smelled roses, I wore a bizarre coat and I dreamed under a pale sky. But unfortunately, I did not feel.A Darker Shade of Magic had great potential. The world V.E. Schwab created is fascinating, full of magic and blood. There is Kell, an Antari, a blood magician who can travel between parallel universes, and Lila, a street thief who wants to become a pirate and experience great adventures, and when their fates interwine, they are the only ones who can save all three Londons from the tainted magic that destroyed the forth. I mean, it sounds pretty amazing, doesn't it?\n\n“I'd rather die on an adventure than live standing still.”\n\nI can't say that the execution failed me, because I was all too eager to read Kell and Lila's story, to turn the pages and fight and travel and discover the mysteries of the powerful obsidian stone and uncover conspiracies and secrets. But in the end I was unsatisfied. I expected something more and my expectations were not met because I couldn't connect with the characters. They were superficial and I was detached. I didn't care about their fates, I didn't find in them the depth I wanted and the pang of enthusiasm I usually feel when I start a new series. I was just a silent observer, witnessing their story unfold without finding the spark of magic that would make me an active participant and cheer for them, worry for them and eventually love them. Lila annoyed me a couple of times with her imprudence and her recklessness but there is no doubt she was a badass and strong female lead. I liked Kell a little more and I waited for the signs that I was falling for him, but they never came. I'm still intrigued about his magic and his past though and I'm curious about the way his relationship with Lila will develop.\n\n“Some people steal to stay alive, and some steal to feel alive. Simple as that.” \n\nI can't help but shake the feeling that V.E. Schwab had raised her wand, ready to cast the spell that would bewitch me but the words never left her lips. Her plotline was like Red London, vivid and full of possibilities. Her characters like White London, dangerous yet somehow pale and faded. And me, well, I'm Grey London, magicless in the surface but waiting for the magic I know it exists to ignite. I don't know how to rate a A Darker Shade of Magic. Four stars are too much, three not enough, and I'll have to settle with 3.5 and a hope that A Gathering of Shadows will actually be the one that will disperse the shadows the debut of this trilogy cast."}, {"Review": "\n“I'm not going to die,\" she said. \"Not till I've seen it.\"\"Seen what?\"Her smile widened. \"Everything.”\n Kell - one of the last Antari - is playing a dangerous game. Being an Antari, he travels between worlds. He knows of four worlds and all four of them have one, conveniently overlapping city: London.\nGrey London\n - Magicless, technology driven.\nRed London\n - Magic is considered a gift and is practiced with careful determination\nWhite London\n - Magic is cruel, often needs to be stolen and locked into bodies\nBlack London\n - Magic is hungry and all-consuming, magic apocalypse happened here. All magic, artifacts and people from Black London is banned from the other worlds.Kell frequently travels in and out of the Londons - passing along correspondence, adventuring and smuggling artifacts (that last bit is hugely illegal). After a visit to the cruel king and queen of White London, Kell is given an innocuous black stone and told to bring it to Red London. A bit buzzed and confused, he travels between worlds only to discover that the stone is actually a part of Black London.By smuggling the stone, Kell committed treason against the crown of Red London (his adopted family) but more importantly, the black stone contains remnants of that world's magic - seduction and hunger.Delilah \"Lila\" Bard lives in Grey London (not that she knows it). It's the only London without magic and she's spent her entire life looking for a way out. And then Kell lands on her doorstop.\nI'd rather die on an adventure than live standing still.\n Kell immediately struggles with the power of the stone. And he soon realizes that although he may not want it, help will come to him  in the form of one very, very stubborn Lila Bard.\n“Sure I do,” countered Lila cheerfully. “There’s Dull London, Kell London, Creepy London, and Dead London,” she recited, ticking them off on her fingers. “See? I’m a fast learner.” \nWhewww! I really enjoyed the start to this series!Schwab had such a unique idea - with the four Londons and their varying degrees of magic - and executed it extremely well. I loved all the details she included - it really made the story come alive. As for the characters...Lila (at times a bit over the top) really balanced out the seriousness and coldness of Kell. The two of them working together had a really natural feel - as evidenced by their free-flowing banter.\n“I apologize for anything I might have done. I was not myself.”“I apologize for shooting you in the leg.” said Lila. “I was myself entirely.” \n I cannot wait to get started on book two!Audiobook CommentsRead by Steven Crossley - and he did a great job. This was a rather well-read audiobook. I do wish he would've had more emotion when it came to his characters but then again, Kell is supposed to be a little stand-offish.Blog | Instagram | Twitter"}, {"Review": "\nRE-READ UPDATE:\nSo, in a startling turn of events, this book is even more insufferably perfect the second time round and I'm so in love with it I frequently forget WHAT AIR IS. I love Kell. I love his frown. I love his love for his brother. I love his smol fragile beginnings of a relationship with Lila. I love his bloody magic. I love his dark side.I LOVE THIS BOOK AND THIS WORLD AND THESE CHARACTERS SO MUCH IT HURTS JUST A LTITLE WHICH CAN BE TRANSLATED A LOT.Wow. I may need to go lie down or else faceplant into A Gathering of Shadows for the second time. <3(FYI the audiobook was fantastic.)ORIGINAL REVIEW: 2016:It took me 90001 years of procrastination to read this. I DOn'T EVEN KNOW WHY???? I over-hyped to myself??? (Despite already having read and adored Vicious. So clearly I am the most pathetic of grapefruit fiends.) So of course I ADORED this book. It was violent and magicy and bloody and incredibly written...and I have a severe love Kell's magical multi-sided coat. Like seriously, I want one. YOU DON'T UNDERSTAND HOW MUCH I LOVE HIS FREAKING AWESOME COAT. Ahem.Also this book just had this WHOLE LIST of things I love...seriously, it's like it stole the checklist of \"things Cait likes\" and just completed it all perfectly. For instance:• Magical multi-sided coat ✓• Characters who put things in pockets, like millions of things (I have a pocket infatuation btw) ✓• Sassy, snarky witty banter ✓• A girl who's #1 aspiration is to be a pirate (#goals) ✓• Evil magic ✓• Concise writing ✓• Lots of stabby stabbing all the time ✓• LIKE STABBY STAB EVERYTHING OMG ✓...I told you...IT WAS WRITTEN WITH ME IN MIND. (Ahem.)Also I absolutely adore VE Schwab's writing style!! Like it's brisk and too the point. It doesn't fluff around. And she is QUEEN of world-building. Gah, I am in love with the world building skills. Seriously not a lot of books manage to make a world this complex and dimensional but EASY TO UNDERSTAND so so simply and fast. I actually never had any \"Huh, I don't get it?\" moments. Which is a big deal for me. Because 87% of my life is spent saying \"Wut. I don't get it.\" BUT NOT WHEN I READ A SCHWAB BOOK HUZZAH.And the characters?! Omg...I shall pause here and SHRIEK MIGHTILY OF MY LOVE. Shriek loudly, I tell you.• Kell was perfect. Like, literally perfect. A little bit tragic and lost and longing...and also totally sassy with the perfect comeback waiting. I love how basically the ENTIRE book is because he made a stupid mistake...so he's a gorgeous little darling, but at the same time immensely flawed.• Lila, of course, is my hero. She's NASTY. She's a thief and so snarky...omg, she'd bite you. She really would. And she's wondrous. I love how she starts off just wanting an adventure -- BUT THEN SHE GETS A FRIEND IN KELL. <333 And the way she and Kell continually had to save each other?!?!?? My favourite thing of ever.• Rhys was definitely a potential favourite. I mean, I DID love him. He was really overconfident and dashing and dazzling and spoiled and vibrant and INCREDIBLE. My favourite kind of character, tbh....but....he really wasn't in the story very much. For this I am sad.• Holland? I feel I want to mention Holland, who is another magician like Kell (they're the only two of their kind who can jump through worlds), and he was really CREEPY. But tragic? Like I felt really bad for him even as he was doing terrible evil things. He was enough of a villain to be hated, and enough of a victim to make me whisper a small \"oh dear\" and feel sad for him. #perfectwriting...basically everything in this book was freaking perfect. nUNNNNNGH.OH WAIT. One thing wasn't perfect. But this is purely me? And I dare say most people wouldn't have this problem: but I found the book very predictable. Seriously I KNEW what plot twists were going to go down most of the time??? It was really weird. I have this slight suspicion that it's sort of how I would put together a story? (I am in NO WAY claiming to be as good of a writer as Schwab. HAHAHAH NOPE. I am like a toddler with a crayon compared to her. But...yeah. I would choose all the plot directions she went in, which made me sort of know they were going down?) SO THAT'S WEIRD. BUT THAT HAPPENED. Also pleeeeeeeeeeease tell me I'm not alone in catching the potential-plot-twist-about-Lila?!?!? (view spoiler)[ LILA'S FREAKING MISSING EYE?!?! BAh. She is so totally an Antari. Clearly someone cut out her eye as a kid, right??? (hide spoiler)]...also I feel like I read somewhere that there was no romance in this book? WELL HECK NO. I SHIP KELL AND LILA LIKE NOTHING ELSE. There was a kiss. That's ship material there.I also really liked how it didn't spare the characters. And like everyone's moral compasses were soooo twisted. AND THERE WAS TONS OF STABBING AND BLOOD EVERYWHERE. I'm like such a violent little squid. I know. But omg, so much blood. Everywhere. (Also it gives me the shivers when they cut themselves for spells. Ugh.)So basically this book is perfect. BUT YOU ALREADY KNEW THAT. And I'm actually glad I only read it just now?? Because I can go buy A Gathering of Shadows straight away! HAPPY DANCE. I love the characters, I am so sucked in by the writing, and I can't get enough of the epic dialogue and the perfect plot twists and the bloody spectacular brilliantness.YES I'M DONE GUSHING. OMG.(You can all say \"I told you so\" but I will smush cake in your face and glare.)(Also the part where Lila knocks Kell out with a book is basically the best part of the entire book and gives me life quite frankly.)"}, {"Review": "An Overhyped Shade of MediocreBefore you jump down my throat, I didn’t hate this novel as much as I felt let down by it. Let me explain: it’s been hyped up everywhere and when that happens, expectations tend to run very high. Think back to when you were a kid and wanted something for your birthday so much and were so sure that you were going to get it; and even if you got plenty of nice things, the fact that you didn’t get the one thing you wanted made you disappointed. That’s the same feeling I got from this book.Further, I felt like there was a lot of pandering going on here. Currently, YA books are trying their darnedest to be inclusive, which I personally think is a great step in modern storytelling. However, I don’t care for having one-dimensional characters just for the sake of faux-representation. Prince Rhy is well, a prince, but he’s also bi/pan/omnisexual…. and that’s about it. Sure he is our MC’s best friend/adopted brother and serves some purpose in the story, but he’s mostly a token character since there is nothing more to him. Our second case of pandering comes from our female MC, Lila*. She’s a tough female protagonist with a dark past, because we’ve never seen that before. *eye roll* Okay, I get that audiences need strong female characters and are sick of Mary Sues, but Lila reads like a stock character. She’s tepid and boring, just like the writing.This book took me longer to finish than I would have thought, simply because the writing is so dry and flat. On nearly every page I pendulated from interested to bored and back again like a metronome. The story itself is captivating in parts, but the actual prose has no life. There's no heart in it at all, and you don't care about the characters so when they die it's no big deal. It sits there listless and says, Our main character is Kell, and he is oh so original. You guys, he’s “one of the last travelers—magicians with a rare, coveted ability”. Are there any protagonists that don’t have rare gifts anymore? Wait though, he has a completely black eye and does blood magic and there is only one other blood magician in the story so of course they have to face off. Not only that, the MacGuffin in this book is a stone split in half, and wouldn’t you know it? The other half of this stone belongs to the villain! I have never heard of a hero and villain having some sort of weird twin connection between their magical foci before /sarcasmBack to Lila. (view spoiler)[I think it’s pretty clear that Lila is an Antari because she’s missing an eye (that probably would have been black like Kell’s) and there are strong hints that she has magic inside her, plus she can also travel worlds). (hide spoiler)] It seems like the very idea of her was taken from watching Kiera Knightly in the Pirates of the Caribbean  films. By the end, she has a pirate coat and is seen looking at a bunch of ships deciding which one to steal.There’s a lot to be confused about in this book too. Especially, trying to remember the differences between the 4 Londons. Yes, there are 4. It’s some alternate dimension thing?? There’s really no explanation as to why there are at least 4 different (overlapping) universes here other than the need for Kell to jump between them because of some quasi-political reasons.All in all, it’s interesting concept that was dryly executed with borrowed characters and buzz that will make you expect more than this book actually has to offer. If you just want a mindless popcorn book made up of ideas seen elsewhere and are clueless enough to think that one-note tertiary characters are progressive, then you'll probably love it."}, {"Review": "I sort of flew through this book.Or rather, I listened to the audiobook extremely quickly. I found the story interesting at first but it rapidly lost steam for me... The writing was great, but I didn't care much for the plot (which seems to be a pattern with Schwab's books for me, with Vicious being the exception). The concept of parallel Londons was really cool, but aside from that I didn't find it very interesting. I was also left wanting more character development. All I could think during this book is how much Kell and Lila reminded me of Kelsier and Vin from The Final Empire by Brandon Sanderson. I'm not even completely sure why, but there it is. They didn't feel like new characters to me at all. Also, I wouldn't recommend this audiobook. The narrator does wacky, over-the-top accents that lessened my enjoyment of the book and took away from the story. (Victoria even told me she didn't like that about the audiobook. That's a sign that it's PRETTY BAD.)All of that being said, I didn't hate the book, so I feel like 3 stars is a good rating to represent how I feel."}, {"Review": "Reviewed by: Rabid Reads4.5 starsA DARKER SHADE OF MAGIC is one of those books that I needed to reflect upon before reviewing.As far as I can tell this happens to me for one of two reasons:1. It was awful, but in a way that confounded me, either b/c it was an author whom I love and trust and WTH happened? Or b/c my issue(s) is nebulous and thus has to be dissected to determine the root of the problem.2. It was amazeballs, but in a way that confounded me, b/c SO MUCH CLEVER. This was a #2 situation. Fyi.And even though it's been over a month, I'm still kind of at odds about what to say.Firstly, it is a fact universally acknowledged that I am a character-driven reader.BUT.I was not more than mildly invested in these characters until I was more than halfway through it.Secondly, it is a fact universally acknowledged that ROMANCE, I love it.Yet there was very little romance in this book.SO. We have:1. Characters I didn't immediately connect with. 2. Little to no swoons.And still . . . I LOVED it.Do you see why I needed time to traverse the dark and twisty paths of my mind? But ultimately, it comes down to this:Victoria Schwab is a bloodydamn genius.No really. She is. She created a world so vastly different from others I've encountered, with hinted at conundrums for a later date, and characters who are . . . oblivious yet discerning, adventurous and daring, scared but determined, arrogant yet realistic, but above all else they are compelling. They are also broken. In remarkably similar ways despite the disparity of their situations.Kell is a member of the royal family. A prince. Brother to the heir. Except he isn't. And he knows it, they know it, everyone knows it. B/c Kell . . . is a young man with a rare and remarkable ability, and was therefore removed whence he came to become an adjunct extension of a pre-existing family.But everyone pretends.Just like Kell pretends not to be consumed with questions about what came before. Lila . . . *shakes head at Lila* Lila is a young woman who refuses to be confined by the restrictions of both her gender and her station. She is astonishingly intelligent. She is independent. If she had a middle name, it would almost certainly be Hubris. And yet, she is bitterly fragile. She wants nothing from no one, and accepts nothing she cannot immediately repay, negating any debt she feels is owed. She's painful to watch. But I had to watch. Had to. If for no other reason, then to see what she would say/think next:\nThe rich strutted around, assuming they'd be safe, so long as they stayed in the good parts of town. But Lila knew there were no good parts. Only smart parts and stupid parts, and she was quick enough to know which one to play.\nDO YOU SEE WHAT SHE DID THERE?! *head explodes b/c can't contain the awesome*That kind of brilliance is around every corner. That kind of brilliance is why, for the first time ever, I neither DNF-ed a book b/c characters I didn't connect with or lamented my decision to stick with it after the fact. And honestly, I have no idea what my problem was. I've already said that, yes, eventually, they began to tug my heartstrings, but why it took so long . . . ? It shall remain a mystery.But things like this:\n\"I'm not going to die,\" she said. \"Not till I've seen it.\"\"Seen what?\"Her smile widened. \"Everything.\"\nwere the turning point.Plot-wise, I'm not going to say anything, b/c the less you know, the better. As for world-building, take the things you think you know about magic systems and toss them out the window.When I first learned that one of the rulers of Red London had a special talent for controlling the will of others, I was like, \"Well, that sucks,\" and when Kell walked up the fortress steps that were guarded by ten soldiers who were indeed controlled, I thought, \"That is such a waste of power. How many people could this guy possibly control at once, and how could he have any power left over to defend against a direct magical attack?\"But I had made an incorrect assumption. Just b/c that's the way magic typically works, doesn't mean that's the way it works according to Schwab. Arthos can control as many people as he wants. All he has to do is brand them with his particular kind of magic. And that, my friends, is terrifying.  And all of that is why A DARKER SHADE OF MAGIC will be near the top of my Best Books of 2015 list. You will laugh at drunk men stumbling groggily on stairs (HA!), you will nod your head thoughtfully as Kell and Lila reveal the intricacies of what makes them tick, you will gasp in shock and horror when you find yourself walking across the bones of defeated enemies, and you will not regret reading this book for yourself. Highly recommended.My other reviews for this series:\nA Gathering of Shadows (Shades of Magic, #2)\n\nA Conjuring of Light (Shades of Magic, #3)\n"}, {"Review": "My spoiler free video review is now up!!: https://youtu.be/hINnk0eqj8I4.5 StarsAll I can say is WOW!That was incredible!! First off, the characters were FANTASTIC! Schwab is truly a master when it comes to crafting multidimensional, well rounded, and flawed characters. Rhy is so pure and precious. Kell deserves love and happiness. And Lila. Lila Bard is my new queen. This was truly one of the most realistic fantasy worlds I've ever read about. I mean that in the sense that the world seemed like something that could actually exist. The world was complex and intricate, but just grounded enough that the concept of 4 parallel London's is something I can truly conceptualize. In other words, it made me believe that the magic was real. As always, Schwab's writing was absolutely engaging. It's concise and simplistic, yet still full of warmth and depth. This book was a bit slower paced but I thought that it matched the world perfectly. It was fast-paced and action-packed where it needed to be and still took its time to develop the world and characters completely. Needless to say, I loved it. And I can't wait to continue on in the series!"}, {"Review": "This is an unpopular opinion, if you’re easily offended, please don’t read this review.Okay, 3 stars is still a good rating but I think rating aDSoM 3 stars on Goodreads is like I’m an E.T who arrives in London. This is my sixth month on Goodreads and throughout that period, there are three series that always appeared on my feeds and probably everyone else. First, Six of Crows duology, second, anything that came out of Sarah J Maas’s head and finally, the Shade of Magic trilogy by V.E Schwab. It needed to be said first that I’m not a fan of the YA genre but these series are hyped as drug dealers search for heroin and I decided to give some of them a try with hope it will changed my mind on the genre. Sadly it didn’t, Six of Crows duology disappointed me (Oh look, so many arrows. Casted magic barrier to block all the arrows shooting at me), this book also disappointed me (Magic Barrier is now broken) and I won’t even touch anything by Sarah J Maas. (Endless arrow pinned me to a wall.)Don’t get me wrong, I never said I hated the Six of Crows duology or this book, it disappointed me but I actually think both series is still good to read. I actually liked this book for a while until the underwhelming climax happened. It’s just a shame there are a lot of parts that obstructed me from loving aDSoM. I love V.E Schwab’s work on Vicious, it was unique, morally ambiguous, suited for adult audience and have great characters. It’s why I gave this series a try and turns out I’ve been fooled. aDSoM’s plot is really YA-ish and it’s the exact opposite of what made Vicious great for me.There is nothing remotely interesting about the plot. It’s a very typical McGuffin story which had been overdone to death already. These days, there are a lot of stories and themes that have been overdone but somehow managed to deliver immersive and intriguing plot with great casts of characters and their developments. That’s the other main problem with ADSoM, I’m so detached from the story and the characters that I honestly don’t care about any of them if they died or not. There are no developments at all for the main characters except Lila. Kell is angsty but he cares about Rhy, Rhy is gay (or bisexual or nymphomania I don’t know, seems like he’ll have sex with anything that moves.) and he cares about Kell, Lila is adventurous, \n“I'd rather die on an adventure than live standing still.”\nHolland is mysterious and the Dane Twins is sadistic. There, I talked about the main characters personality and their development progression throughout this whole book within one sentence. Lila and Holland is probably the only saving characters of this book, Lila character is more fleshed out compared to the rest and for Holland, he’s just more interesting and every scene where he appears really shine for the book.Holland and the Dane TwinsI honestly prefer Holland to be the main character compared to Kell. Seriously, out of everything I ever read, Kell is one of the most boring character of all time. The only thing intriguing about him is his coat and it's always a bad sign when the clothes is more captivating than the person. Don’t even compare him with Kelsier from Mistborn just because they have similar name, just… don’t.Finally, the last problem I have with the book is the underwhelming magic and climax. If there's one thing that V.E Schwab haven't improved since Vicious, it’s definitely the climax scene delivery. Vicious would have received a 5 star from me if it wasn’t for the super underwhelming climax and sadly, it’s still the same here. Even all the action scenes in the book are really standard and provides zero intensity. I read the climax sequences with a face and emotion so flat that drinking a hot Chamomile tea will give more reaction to my emotion.Now, with all the problems I have with the book, you’re probably wondering why this is not a 1 star or 2 star review. Here’s the thing, even with all the negativity, I still don’t hate the book, I still enjoy reading it. Why? Because of these 3 factors that really shine from aDSoM. 4 alternative London concept, V.E Schwab’s writing and Kell’s Coat, yes that coat is a work of brilliance and deserve an extra star.The 4 color alternative London is a really great concept, it’s one of the biggest reasons why I bought this book in the first place other than the fact I thought it will be more adult oriented than Vicious. It’s like V.E Schwab took Neil Gaiman’s Neverwhere imagination and gave it a twist to make it her own idea. All 4 version of London have their unique characteristic. Grey London, our version of London which smells like smoke, Red London, Kell’s version of London which smelled like fire, White London, the Dane Twin’s & Holland’s version of London which smelled like blood and finally Black London, the lost London which smelled like teen spirit. Okay I’m joking, there is no known smell to Black London since no one can go there anymore. I do wish there’s an explanation though on why there is 4 London in the first place since the setting is in our real world, maybe the future sequels will enlighten me on this.I have always loved Schwab’s writing, her choices of words and pages format never fails to make me turn those pages even when things aren’t interesting. Finally, Kell’s coat, I won’t talk about this much since I honestly think it’s better for you to find out about this peculiar coat on your own. If I have Kell’s coat, I don’t think I’ll ever need another coat again. Take note fashion designers, when you make do a Men’s fashion show, Kell’s Coat is the kind of shit I will buy in a heartbeat.Not this cereals costumeNot this Frankenstein’s monster wannabe, why would I want to eliminate my own neck?And for the love of all that is holy and sacred not this abominationDespite everything, I still like the book enough to finish it and I still have hope for the future sequels. It won't be soon but I will continue with the series eventually with really low expectation. I’m hoping a Gathering of Shadows and a Conjuring of Light will be better than aDSoM since obviously to me this book is clearly an Overhyped Shade of Magic. It lacked a touch of brilliance to make the book reach its maximum potential that the concept provides and I sincerely hope the sequels will receive the shade of magic it needs.Booknest"}, {"Review": "*Major spoilers ahead. They won’t be marked*I was really hesitant going into this one because hello??? I usually end up hating on the most hyped books loved by all my friends. However, I’m so fucking happy and shocked that I actually enjoyed this. This book is dark and gripping book full of magic. I loved it and I wanted to give this 5 stars, I really wanted to, but the beginning took some time getting into and it was very dull and boring. The beginning of this book felt like I was reading a textbook. The writing was bland and there was lots of info dump towards the beginning. Later on, I did grasp the idea of the different Londons and magic. This book has such a fantastic world building and once the info dump was over, I understood it all. Anyways, the book did get better, a lot better when Lila Bard made an appearance. Things got 200% more fun and interesting and I WAS HOOKED. ●This is a reaaaaaaal slow burner and guess what? I loved it. I seriously fucking hate slow plots, but this book does it so well, it’s impossible not to like it?? This book is literally almost perfection from multiple Londons, complex sexy coats (yes I have issues), badassery, badass female leads, RHY (my new husband, guys), KELL, magic, and evil. The plot of this book seems like any other plot with evil magic on the loose and then we have a hero who has to save the world from bad people *cough* FUCKING HOLLAND AND THE FUCK FACE DANE TWINS* who want to misuse the magic, but Schwab has a way of weaving this plot into something entirely new and thrilling once more for me. It seems so original and gripping even though I’ve a hundred other books with such a similar plot. ●I love how this book had no romance AT ALL (well maybe a little). Yo guys, it’s refreshing to read a book where the characters don’t think about kissing and fucking each other while trying to save the world. I like books with a litttttlllleeeee bit of well done romance so I was kind of worried this book would turn out dull because I’ve heard there was no romance, but WORRY NOT, it was bloody fantastic. I couldn’t stop myself from shipping Kell and Lila. However, I’m actually really glad they had no romantic development because Kell and Lila staying just as friends (??) is much much better and refreshing. I WANT LILA AND KELL TO HAVE SOME SWEATY SEX OKAY BYE.-This book has a captivating plot, characters that will make your heart ache and villains that you'll want to fucking murder so bad. Overall, IT HAS LITERALLY EVERYTHING YOU CAN WISH FOR, SO GO FUCKING READ IT OKAY.Another thing that made this book much much more enjoyable for me was turning innocent quotes into dirty quotes. :)) *Lmao just check these status updates out for all the dirty*-https://www.goodreads.com/user_status...-https://www.goodreads.com/user_status...-https://www.goodreads.com/user_status...-https://www.goodreads.com/user_status...Other than that guys, I want to marry Rhy bc he’s such a flirty, sweet bastard, how can anyone not love him??? I want to adopt Kell as my new son and go cut some bitches with Lila Bard. Oh, I would particulary like to cut that Holland bitch right in the face, that would be great! :) LMAO SORRY I HATE HIM, WHY DO PEOPLE LOVE HIM???****oh my fucking balls of titanium, my soul is hurting, who the fuck allowed this ???i love Kell and Lila Bard the bitch so so much i love these characters. full rtc soon"}, {"Review": "“A life worth having is a life worth taking.”Wow. I'm stunned and I'm in awe.Incredible world-building, beautiful language and an intruiging plot make this 5 out of 5 stars. And let's not forget about the \"cross-dressing thieves\", \"sadistics kings (and queens)\" and my favourite the \"royal who is equal parts Prince Harry and Jack Harkness\". I love Rhy.This novel started as it ended: magical, sensational and breath-taking. It is as beautiful from the outside, as it is from the inside. It's the kind of book you want to keep reading and at the same time to never end.This is one of the best examples of world-building there is. A world (or better: four worlds) so complex and so big, needs a skilled writer to make it feel real. Schwab mastered that skill and made ADSOM far from one-dimensional. There is so much to see, so much to feel, so much to find out. A book like this keeps you pondering for quite a while and even longer.Victoria Schwab turns out to be one of my new favorite authors.Find more of my books on Instagram"}, {"Review": "I don’t know what I can say that hasn’t been said before. But in short, this is just perfect. Every page is magic and every scene has a purpose. The characters bring life into this book. The magic system and the writing style is unique and a breath of fresh air. VE Schwab’s writing style truly shines through and I loved every moment of this. Reading this book feels like stumbling into something wholly new and familiar at the same time. Reading this was an adventure with magic and drama. Reading this felt like taking on this world, (and other worlds), it was such a fun experience."}, {"Review": "\n\n“I apologize for anything I might have done. I was not myself.”“I apologize for shooting you in the leg,” said Lila. “I was myself entirely.”\n\n\nActual Rating: 4 1/2 Stars.\n So you may notice this book is kind of polarizing within the adult sff community; a little bit And for me personally it is.... such a fave. I keep returning to this world and these characters and I doubt I’ll ever stop.For the approximately five people who don’t know, A Darker Shade of Magic is about a world with four parallel worlds, all very different but sharing the same London. There’s Grey London, aka our world. Red London, a land of magic and peace. White London, a land of turmoil and war and an overuse of magic. And Black London, the land where magic went wrong and burnt out. Only a few people can travel between worlds, and when one of the only two left, Kell, discovers a magic stone that could destroy his world, he and non-magical Lila go on a journey to put it back. Let's get the problems out of the way - \nthe plotting is a mixed bag.\n Pro: fast-paced and \nnever boring.\n This book is a 400-page wild ride. Con: literally \nno driving force\n behind the plot. The characters don't even have a quest until around page 200, and it makes the entire book feel just a bit messy. This is a problem Victoria Schwab tends to have a lot [she’s my favorite author so I’m allowed to say this], where her characters just meander around in search of an end goal. This.... kills her series conclusions. Like, it’s killed both of the series enders I’ve read by her for me personally, and this is coming from the bitch who has five starred every single other book I’ve read by her. But it doesn’t really hurt the plot that much here, so it’s fine, and we’ll just address that more in the ACOL review. \n\n“What are you?” she asked. “A monster,” said Kell hoarsely. “You'd better let me go.”The girl gave a small, mocking laugh. “Monsters don't faint in the presence of ladies.” “Ladies don't dress like men and pick pockets,” retorted Kell. Her smile only sharpened. “What are you really?” “Tied to your bed,\" said Kell matter-of-factly.“And?” His brow furrowed. “And in trouble.”\n\nThe main thing I always come back to about this book is that it is deeply, deeply \nmagical\n. It was nigh-impossible for me to not be engaged in this story. The writing style is SO GOOD, lyrical and gorgeous and with a really nice flow to it; one of my good blogger friends discussed her sentence structure, and it is so fantastic. The worldbuilding is creative and intriguing and perhaps best of all, makes a surprising amount of sense for such a wild concept. Also, I would die for these characters. Oddly, they didn't totally grow on me until like... 2/3 of the way into the book? While I could recognize from the beginning that the leads were well-developed and interesting, it took me a while to feel as if I had a concrete concept of who they are. And then we got to the ending and I was screaming in agony at the thought of these characters dying, and I was like \"oh shit\" and realized how much I love Kell and Lila and Rhy and how much I care about their relationships. V.E. Schwab does a lot of showing, not telling, which makes the character development a bit more subtle; these characters are based off their motivations perhaps even more than their actual traits. And both of these things mean you’re less invested in the beginning and then.... more invested in the end. Slow start, flawless payoff.I actually want to talk a little more specifically about these characters because when I think back on this series, they are always what come to mind. Kell is a grumpy child who we love anyway. Lila is a fucking badass genderfluid thief with a soft side and I love her. Rhy is a bisexual prince [literally] who spends half his time dragging people. Even Holland, the sort-of-villain, is a super dynamic and intriguing character. Oh, and then the relationships: Kell and Lila, y’all. Kell and Lila are my ride-or-die book couple and I love their dynamic and I love how they’re constantly dragging each other and just. fuck. I love them. I also really really like Kell and Rhy’s relationship, which is so ridiculously loving and caring? They are perhaps two of the most different people ever and they love each other so much it's beautiful. I also kind of love that 98% of the dynamics in this book kind of read like everyone has dated everyone else and it’s now Really Awkward [this is both Kell & Holland and also Rhy & Holland and it later becomes the canon dynamic of Rhy & Alucard, and it's hilarious]. If anyone wants to come for me about this, I point to That Time Victoria Schwab Said That Every Character In This Series Should Be Read As Queer. No, that is not the only reason why I like this series, and yes, they’re all bi icons and you can’t take that away from me. Anyway. Super highly recommended for fans of creative, engaging fantasy. Blog | Goodreads | Twitter | Youtube"}, {"Review": "i have an unexpected three day weekend and i cant think of a more productive way to spend it than by starting a new series/trilogy! so i did queen schwab the honour of entering and experiencing her world of many londons.okay, one thing that i have come to realise is that schwab is a grower, not a shower, as it takes me quite some time before i feel settled within her stories. i would even say she has perfected the art of a slow burn because at times when i didnt feel like anything is happening, i was still enjoying myself. and im certain that had to do with the brilliant writing and world building. im very much a plot person, so i was thrilled when i found myself not caring about what was going to happen next because i was so caught up with the characters and the environment and the magic. the writing was so detailed and skilled, and i think that made all the difference for me. overall, this was an very entertaining read! even though most of the time i had no idea where the story/series was going (and i still dont because this could have worked as a standalone), i would be lying if i said i wasnt desperate to find out. so bring on book two!↠ 4 stars"}, {"Review": "Magic was a living thing—that, everyone knew—but to Kell it felt like more, like a friend, like family. It was, after all, a part of him (much more than it was a part of most) and he couldn’t help feeling like it knew what he was saying, what he was feeling, not only when he summoned it, but always, in every heartbeat and every breath. He was, after all, Antari.*This review contains spoilers.*I just finished this book and my mind is all over the place. I went into this book not knowing much about the plot except that it involved magic and that everyone seemed to love it. A lot happened in this book, I’m not even sure where to begin. A Darker Shade of Magic has amazingly complex characters (among my favorites: Prince Rhy, Lila Bard, and of course Kell) they made it impossible to put the book down. This book was so original and creative. I had to stop everything I was doing and just finish it.V.E Schwab's writing is outstanding.Kell’s relationship with his brother was incredibly heartwarming. I love close families in YA books. “Would you tell them?” asked Kell.Rhy sighed. Kell watched him try to answer several ways before he finally said, “There is nothing I would not give you.”Kell’s chest ached. “I know.”“You are my brother. My closest friend.”“I know.”Also, can we talk about Holland? When we first met Holland I thought he was going to be on Kell’s side. It seemed (to me) that underneath all the evil and pain that had gotten into his body, there was still a flicker of humanity. Unfortunately, I was wrong. I’m kind of sad that he didn’t turn out to be like I originally thought- and watching him suffer at the hands of the Dane twins was extremely painful. I felt extremely relieved when Lila and Kell killed both of the twins. “Holland knew. He’d seen the attack coming, and he hadn’t stopped it. The instant before the metal struck him from behind, Holland had stopped fighting. It was only a second, a fraction of a breath, but it had been enough to give Kell the edge, the opening. And in the sliver of time after the metal pierced his body, and before he fell, it wasn’t anger or pain that crossed his face. It was relief.”I’m glad Holland got his peace.I also loved loved loved reading from Lila’s point of view. I was anticipating the two main characters meeting right from the start- and it did not disappoint. The chemistry between Lila and Kell felt so real.“How did you know?” she asked, looking down at the rubble of the queen. “How did you know she wasn’t me?”Kell managed an exhausted smile. “Because she said please.”Lila stared at him, aghast. “Is that a joke?”Kell shrugged slightly. It took a lot of effort. “I just knew,” he said.“You just knew,” she echoed.”Need the next book now.Oh, and this song made my reading experience 10 times better (I’m still listening to it on repeat).Support creators you love. Buy a Coffee for nat (bookspoils) with http://Ko-fi.com/bookspoils\nThis review and more can be found on my blog."}, {"Review": "#1 A Darker Shade of Magic ★★★★★#2 A Gathering of Shadows ★★★★★#3 A Conjuring of Light ★★★★★\"There's Dull London, Kell London, Creepy London, and Dead London. See? I'm a fast learner.\" Despite the fact that the four Londons share a name, they have little else in common; one is brimming with life, one is held captive by wicked rulers, one has no magic at all, and one is dead. While there used to be traversing between the Londons, now the doors have been sealed to all except the Antari: magicians with the ability to command blood itself, allowing them to travel between the parallels.One of the last two remaining Antari in the world, Kell, is the unofficial carrier of messages between the three living Londons, but his entire world comes crumbling down around him when he is tricked into taking a magical object that has enemies hunting him down from one city to the next. When Lila, a young thief and aspiring pirate, is drawn into the middle of his adventure, Kell must learn that the boundaries between good and evil magic aren't as defined as he once thought they were, and he must straddles those boundaries to right what has been made wrong.---This book was my first ever Schwab read, and I went into it a little bit apprehensive, because she is so widely loved that I wondered if this series would live up to the expectations I had for it. I picked it up for the Life & Lit June group read, and ended up putting it off until the last possible minute because I was so wary, but my nervousness was entirely unfounded. This book was phenomenal!KELL ➳➳What can I even say? Kell is one of the most lovable male MCs I've seen in a really long time. He's so loving and protective, despite his ongoing self-identity crises regarding his family. He loves his brother Rhy with a fierceness that I couldn't get enough of, and he's just so genuinely good in his heart that I couldn't help but root for him. He's one of those MCs that makes me afraid to continue the series because I can't handle anything terrible happening to him.LILA ➳➳I didn't really know what to make of Lila at first, because to be frank, her excuses for thievery kind of rubbed me the wrong way. Like... you're just going to steal from all of these people because you can? I wouldn't have minded so much if she just stole food or whatever, but trinkets? (I revisited this annoyance a few times later in the book, too.) Overall, though, I really enjoyed her sassy attitude and the way she refused to let anyone tell her what to do or hold her down. I loved that she insisted on going on an adventure, even if it meant risking her life, and her interactions with Kell were just adorable.RHY ➳➳Adorable. Absolutely adorable. He actually made me cry a few times because he just is so pure and innocent and golden.HOLLAND ➳➳Holland honestly gave me the sketchiest vibes ever from the beginning, but I think he's a fantastic character and I pitied him more often than not. I know some shit went down, but I really hope we get to learn more about him later in the series.PLOT & WORLD ➳➳I thought the plot, as well as the world-building, were absolutely incredible. I loved the idea of these parallel cities that the Antari could travel between, and I thought the magic system was beautifully built up. Too many books ignore the foundation for their magic systems and you're kind of left just going, \"oh, well, it's magic and that's that,\" but Schwab didn't do that at all in this book. The idea of these Antari being sort of the chosen ones who could control blood was just badass as hell, and I really hope that Kell and Holland aren't actually the only ones left.WRITING ➳➳Like I said, this was my first time ever reading anything by Victoria Schwab, so I had no idea what to expect. My very first impression from the opening segment,\nKell wore a very peculiar coat.It had neither one side, which would be conventional, nor two, which would be unexpected, but several, which was, of course, impossible.\nwas that her writing reminded me a great deal of Tolkien, circa The Hobbit. As I got further into the book, I did find that Victoria's voice is very much her own, but I enjoyed it to no end. It was the perfect balance of straightforward and flowery prose, and it painted a splendid picture while never wasting too much time on the details.FINAL VERDICT ➳➳Overall, I thought this book was a fantastic beginning to a series and I cannot wait to continue with book #2. I gave this an easy 5/5 stars and would recommend it to anyone who likes three-dimensional high fantasy read, full of a delightful set of characters and a terrifically intriguing world.You can find this review (and more) on my blog here!"}, {"Review": "So... I finally finished this book. I say finally because it took me a lot to get through - and into- it, and I'm not entirely satisfied with what I read.I'm a huge Victoria Schwab's fan, she's both an amazing author and a really kind person that I'd spend days worshiping. Vicious is one of my favorite books of all time and her writing is very original. Yet this book...\nI can't tell you if I loved it or not, if maybe I should try and reread it in another moment, because maybe I'm too dumb to get its awesomeness on the first try, or dump it because it's not my cup of tea. I don't know a single thing, and in my mind it's a solid three. Not here, not there. In the middle. It's not a bad book -quite the opposite, actually-, and I do get the hype to some extent, but maybe I wished that it suit my reader needs more than it actually does. The magic system is probably the thing I liked the most, it added that dark atmosphere I always expect in one of VS's books. I can't say the same for the characters, unfortunately, because, aside from Rhy - and sometimes Kell, too- I didn't like any character in particular. I'm looking at you, Lila. You were a pain. The plot is good, I love London and the way its portrayed, but I had trouble following the writing at times. I found some parts a little dull or anticlimactic, and I had to put it down often because I kept getting distracted by other things. The twists and stabs were absolutely great, though. I can see a lot of her writing in dynamic scenes and I appreciate the author's talent. Overall, this is a good book, and I'm probably going to continue with the trilogy when I have some time. I just feel like something is missing.\n"}, {"Review": "I recently met V.E. Schwab and found her entertaining and charming. So I acquired one of her books! I don't think my review of this work is affected by knowing the author, but I like to be transparent.I always like to avoid spoilers, but in this case, I think the book jacket gives away a bit of the setting, so I'll share it here as well. Imagine four Londons, existing simultaneously but separately. Each has a differing amount of magic, with black London a loss, and Red London a place where magic is like an extra sensory level. Kell is our protagonist, a young man with the very rare ability to travel among the London's. Indeed, that is one of his duties, for the royalty of each London are aware of one another and wish to stay in touch. Kell is a de facto member of the royal family of Red London, treated as a son and brother, but also as a value possession.The one thing that is forbidden to Kell is to bring artifacts or souvenirs from one London to another. And of course, that is the pivot point of the story. And it should be enough to intrigue you into sampling it.The tale is told from multiple points of view. I liked how the characters were introduced as well as how the Londons were shown. No time is wasted in pulling the reader into the story, and once the action begins, it is relentless. I was pleased to see how advanced magic mimics technology in Red London, for I feel that this is an aspect that is often neglected in stories of worlds where magic exists and is exploited as commonplace. I also felt that the way Kell is exploited by his adoptive and loving family has deep roots in human nature. Given the ruthless nature of Kell's antagonists, the story does not flinch from some very dark violence. All good points in my estimation.Quibbles: This book is part of a longer series. As I drew toward the close and realized that not all the conflicts could be resolved in the remaining number of pages, I wished that I had known that from the start. At one point in the story, the characters have a sanctuary and an ally that I wished had been introduced sooner. But both of these quibbles are based on my personal preference and may not impact your reading enjoyment at all! And given the teaser chapter in the back of this book, it looks as if A Gathering of Shadows may focus more on one of the characters I especially enjoyed.All in all, a solidly constructed fantasy with fully realized characters and a unique setting!"}, {"Review": "Damn! This had everything I ever need in a fantasy novel.- Intricate yet understandable magic system- Original world building- Little to no romance- Solid evil villains- Fantastic characters with humour- Addictive storylineGuys I absolutely adored this, and how has it taken me this long to read?Writing this, I cannot think of even 1 think I disliked. Kell is an Antari someone with magic powers, able to travel between the 4 Londons. Red - his home, Grey - the dull London where magic is nearly all gone and White - where magic is controlled and used to assume power, and once there was a Black London, consumed and destroyed.When Kell becomes tangled up in some dark magic, he takes it upon himself to make it right. Along with Lila Bard - a thief and cut-throat he just can't seem to shake. I loved this. I don't know what else to say. This was my first Schwab book, but it absolutely will not be my last! Roll on book 2! :) ****************************************************Outstanding!!!!"}, {"Review": "3.5 starsThere was just something about this one that kept it from totally rocking, and I can't quite put my finger on what it was. It was good, just not (for me) great.Kinda dry maybe? Or I just didn't totally connect with the characters? Not sure.But it's still one of those books that I'm glad I read, and I'm actually really looking forward to reading more about this world/worlds that Schwab created. And I seriously mean that! There's something cool about this setting and these characters that makes me want to see what's going to happen next. I kind of feel like maybe the first book was just a set-up, and now that the world building is done, this series (trilogy?) is gonna take off!Because that happens, right? Book one is sorta dry and crunchy, and then book two rocks!*nods head*Yes. I'm feeling confident about that prediction for some reason. I loved Vicious, I loved the world that she created in this one...totally confident.*cough*Anyway. My point is that I can see why so many of my friends loved this, and I don't want anyone to mistake a 3.5 rating as something bad.I don't understand why anyone would think that to start with, but...there's always one.*eyeballs crowd*So the gist of the story is that this wizardish (Traveler) character named Kell is one of the 2 people alive who has the ability to move between worlds. \nLondons\n, to be exact. There are 4 different alternate worlds out there, and the only thing they have in common is that London is a city in each of them. Grey London = Us There's no magic left in our world.Red London = KellHis world has a perfect balance with magic, and it's a pretty nice place to live.White London = Dangerous Their world has squeezed magic so hard that it's retreating from them. It's filled with desperate people willing to do bad shit for power.Black London = DeadSomething happened and they were overtaken by evil magic, sealed off from the other worlds, and now exists only as a cautionary tale.The point? Magic is real!Without spoiling anything, he gets robbed by a scrappy thief from our Grey London, and the two form a strange friendship/partnership. It's sweet without being romantic...YET. And that's a real selling point for me. It's not that I don't lovelovelove romance in my books, but as I get older/more crotchety, I find myself seriously digging the Slow Burn storylines better than the instant attraction stuff. I get the appeal, but it just makes me scoff at this point in my life. When I read about a couple who seem to fly into each other's arms in a fit of passion, all while declaring their undying love for each other? Instead of oohing and cooing like a normal person...This! This is what I see!Ok, besides a non-awkward romance, this has a few other cool things going for it, as well.1) Cool family dynamics! Kell's part of a magical Royal Family. Well, sorta, but not really. It's...complicated.2) Delilah (possibly) has a secret origin! Is there more to her than meets the eye? *wink, wink* {insert spoilery inside joke here}Still, even without anything extra, she's a tough little cookie. 3) The worlds themselves are just plain interesting. I think Schwab did a good job describing the different Londons because all of them felt very real and well thought out. But I've always had a thing for alternate versions of our world stacked on top of each other, so this was right up my ally, to begin with! And how cool would it be to have the ability to slide in and out of each of those?!Ok, so even if it didn't really satisfy me as much as I had hoped, I'm all in for the next book!Also reviewed for: \n\n\n"}, {"Review": "Words... I need to find words...OK, I'm trying to write review for this *fantastic* book again...I loved this. Immensely. \nBest opening chapter\n  that I could recall reading which includes Kell's JACKET. That thing deserved a mention since it was truly a piece of art in and of itself. Glorious world: imaginative, expansive yet still 'contained' and that was a splendid thing.There's a sort of calmness in her writing style that I just absolutely adored. I don't think I can put it into words why, only to express how much I love reading the story she crafted."}], "Image": "https://images.gr-assets.com/books/1400322851l/22055262.jpg", "Desc": "Kell is one of the last Antari—magicians with a rare, coveted ability to travel between parallel Londons; Red, Grey, White, and, once upon a time, Black. Kell was raised in Arnes—Red London—and officially serves the Maresh Empire as an ambassador, traveling between the frequent bloody regime changes in White London and the court of George III in the dullest of Londons, the one without any magic left to see.Unofficially, Kell is a smuggler, servicing people willing to pay for even the smallest glimpses of a world they'll never see. It's a defiant hobby with dangerous consequences, which Kell is now seeing firsthand.After an exchange goes awry, Kell escapes to Grey London and runs into Delilah Bard, a cut-purse with lofty aspirations. She first robs him, then saves him from a deadly enemy, and finally forces Kell to spirit her to another world for a proper adventure.Now perilous magic is afoot, and treachery lurks at every turn. To save all of the worlds, they'll first need to stay alive.\nShades of Magic series\n1. \nA Darker Shade of Magic\n2. \nA Gathering of Shadows\n3.\nA Conjuring of Light"}