{"Genre": "Fantasy", "ID": "15241", "Name": "The Two Towers", "Reviews": [{"Review": "Another Tolkien review? Yep, I’m putting out another Tolkien review. I’m on a mission, a mission to review everything written by Tolkien. And I literally mean everything. I’ve read most of his works, so I’m starting with those first before I move on to the few I haven’t read (there’s not many).This is all preparation, and a readdress of his writings, before I delve into Christopher Tolkien’s twelve book The History of Middle-Earth later on this year. Yep, I’m that much of a Tolkien nerd. I’ve been meaning to tackle it for years, and it will likely take me even longer to get through, but I know it will be worth it. For now though, as I did with my review for The Fellowship of the Ring, here are a series of ten points to explain exactly why I love this particular book: 1. Gandalf the White “Do I not say truly, Gandalf,' said Aragorn at last, 'that you could go whithersoever you wished quicker than I? And this I also say: you are our captain and our banner. The Dark Lord has Nine. But we have One, mightier than they: the White Rider. He has passed through the fire and the abyss, and they shall fear him. We will go where he leads.Gandalf the Grey was charming and quirky; he was everybody’s friend and advisor. But he was also a great wonderer and a great quester. He was an unearther of dark secrets and mysteries. And Middle-Earth no longer needs such a figure, darkness is now on her doorstep; it is no longer hidden. So Middle-Earth needs a man (or Istari) with far sight that can unite the scattered forces of Rohan and manipulate events in order to ensure that the King does, indeed, return. It needs a methodical man of great wisdom and intelligence; it needs a stagiest: it needs a new white wizard now that Saruman has changed his colours. And he has come. 2. Riders of Rohan I just love the entire country of Rohan. Tolkien based much of their culture and background on Anglo-Saxon tradition, and I just love it. Did I say that already? I don’t care. It doesn’t lessen it. The Riders of Rohan are awesome, and Gandalf the White comes just in time to save the poisoned mind of their King. I think this entire side-plot is very clever. I would love to see what happened if Saruman would have won here. Could Wormtongue have become the new leader of Rohan, in effect, siding with the forces of darkness? Food for thought. He did want to marry Eowyn after all. Had his plan gone to fruition, he would have been regent. 3. Faramir of Gondor Boromir has always been one of my favourite characters from Tolkien, simply because he was one of the most human. He was a flawed hero, but I don’t get that sense from Faramir:\"Here was one with an air of high nobility such as Aragorn at times revealed, less high perhaps, yet also less incalculable and remote: one of the Kings of Men born into a later time, but touched with the wisdom and sadness of the Eldar Race. He knew now why Beregond spoke his name with love. He was a captain that men would follow, that he would follow, even under the shadow of the black wings.\"He was a better man that his brother, and why his farther didn’t see it I will never no. 4. The Ents Talking Trees? Trees that throw rocks and kill evil orcs? What’s not to rave about. The Ents are old even by Middle-Earth standards. They must have seen so much in their lifetimes. When I read about how all their wives disappeared I had a good laugh. Was Tolkien trying to be funny? They clearly wondered off and got chopped down by someone who wanted to make a house or something. 5. Nazgul and their FellbeastSo we have nine undead Kings. They wear cowls of black and are pretty much invincible. To call them bad-ass would be to do a massive disservice to their awesomeness. So how do we make them even cooler? Give them flying beasts of death, obviously. 6. GollumGollum, for me, is an image of what Frodo could become. If he tried to keep the ring for himself, and went into hiding, he could become this way. Having him around, no doubt, helped to strengthen his resolve and remind him exactly why he can’t keep this for himself. 7. Helm’s Deep BattleNow the movie really capitalised on this and gave the film a stronger ending, but it was still fun to read about here. It was intense and bloody. Haldir and the elves of Lothlorien saved the day. Without them the men of Rohan would have died before Gandalf and Eomer showed up. 8.Tests of Friendship and loyalty “It's like in the great stories, Mr. Frodo. The ones that really mattered. Full of darkness and danger they were. And sometimes you didn't want to know the end… because how could the end be happy? How could the world go back to the way it was when so much bad had happened? But in the end, it’s only a passing thing… this shadow. Even darkness must pass.” Sam really starts to realise how important his role is in this adventure. He may not have any songs sung about him, and nobody will remember him as the hero, but he is the one who will have to get Frodo to Mordor. Frodo has the ring, and Sam has Frodo. He has a big task on his hands. Also Gimli and Legolas know that they must stay close to Aragorn because his role is also very important. The fellowship, through broken, must remain resolute. “He stands not alone. You would die before your stroke fell.” 9.Aragorn’s transition  Aragorn has many moments to shine in the first book, but it here that his real capabilities are displayed. He leads part of the defence of the Helm’s Deep, and he is instrumental in the final victory. It is here that we begin to see the first glimpses of the man that will one day become the king of Gondor.  10. The real threat is yet to be realised Mordor’s full strength has not been seen as of yet. We’ve had glimpses, and the tension is really increased as this book finishes. The Witch King’s hour draws near.  Final thoughts- Tolkien’s  The Lord of the Rings was meant to be one entire book, so when writing a review of this I did really consider the structure of the book. There’s no beginning or end per say, but that’s because it is the middle of the story. And the middle of the story is just as grand as the rest of it."}, {"Review": "\nThe hope for saving Middle-Earth continues!\n\nTHE FELLOWSHIP IS BROKEN\n\n There is some good in this world, and it's worth fighting for.\nSo much for the fellowship made of representative of the races of good in the Middle-Earth with the task of destroying The One Ring in the hellish fires of Mount Doom, located right inside of Sauron’s domains.Members fell, member got tempted by The One Ring, members got trapped, the journey now has two roads and it’s not certain which way is the right one. Maybe no one is, but they need to take decisions, keep in movement and to trust that they are doing what is right.While they knew each other (in some cases) barely before the start of the mission, they now have a bond, a camaraderie, a friendship that it will be put to test to the maximum.New allies will rise but also the dark forces are getting stronger.And yet, HUGE surprises are ahead of them. Since it seems that in Middle-Earth certain things aren’t definitive.\nISENGARD’S AGENDA\n\nA king will have his way in his own hall, be it folly or wisdom.\nSomething that I liked while reading the book(s) (since I noticed it since the first one) is that Saruman is a servant of Sauron. Yes, the powerful wizard of Isengard wants The One Ring BUT not for giving to the Dark Lord or Mordor, oh no, no, no, Saruman knows that who gets The One Ring will rule in the Middle-Earth and since he is already one of the most powerful beings in that realm, it’s only logical to get The One Ring and with that key advantage, he will be able not only to challenge the armies of men, dwarves and elves but also the dark forces of Sauron.I have huge respect for the good King Théoden, BUT dang it! How can you have as your personal advisor somebody running with the name of Grima Wormtongue! Geez! It’s like the Green Lantern Corps: “Oh, who would think that SINESTRO will resulted a bad guy.” Geez!In the movies is understood that Saruman “works” for Sauron but in the books, at least in my humble analysis is quite clear that Saruman is a third column in this dangerous game in the Middle-Earth. And anybody who was not only member of The White Council but its leader and having forces trying to get control of the Middle-Earth, it’s never wise to underestimate his potential of causing destruction, suffering and pain.\nTHE BATTLE OF HELM’S DEEP\n\nI have spoken words of hope. But only of hope. Hope is not victory.\nYou don’t know the courage of men until they are tested against a challenge without hope.Some war strategists would say that battling a lost battle is pointless and it’s better to flee for fighting another day.But what happen when there isn’t another day?When there is nowhere to run away?When accepting that it’s a lost battle isn’t an option?It’s when you know of what you are made of.\nSAM RULES!\n\nDon't go where I can't follow!\nIt’s obvious that the saga of Lord of the Rings have many heroes, many awesome characters, but many of them have training, skills, education and powers to help them, but……Samwise Gamgee shows one of the most amazing heroism of all, not matter that you can say that he everything against him.First of all, Sam is a Hobbit, not the most useful species in the Middle-Earth in matters of war, and even between Hobbits, he may not being the “best example” of his kind.Sam wasn’t as old as Frodo, Pippin and Merry, therefore less mature.Sam didn’t share a family bond like Frodo, Pippin and Merry shared.Sam wasn’t even of the same social status in The Shire as Frodo, Pippin and Mery, since they were from respected Hobbit families with lineage, while Sam was the son of Bilbo’s gardener.While Merry and Pippin were traveling with Frodo out of a family thing, for Sam was basically a unpaid job imposed on him.So, when the things got tough (and trust me that things couldn’t get tougher than what they got!!!), Sam could easily flee, throwing to hell that awful job, and getting back to safety, back to The Shire.But no.Not Sam.Sam keeps walking, keeps looking out for his master (Frodo) and keeps to amaze due his honest loyalty, his unconditional friendship and his unbelievable willpower."}, {"Review": "A review of Lord of the Rings: The Two Towers by SauronAfter my review of the Fellowship of the Ring, my agent BBMed me and said that people still thought I was a bitter a-hole. He suggested that I learn to deal with my situation by talking with some likeminded people who have faced similar frustration. So he signed me up for Dark Lords and Villains Anonymous. At least that’s what it's called on the website. When I send out a FB invite to my peeps I usually use the subject line \"Hatas Beware\". Because General Zod is still trapped in that ridiculous Phantom Zone, we can't really meet in person so we IM. Every week a member discusses his or her public failure. This is the transcript from my week.Sauron: Hello, my name is Sauron, and it's been 56 years since the publication of my defeat.Group: Hello Sauron!Sauron: I'm…I'm not sure where to start. I just don't think I've been given a fair shake. I recently emailed an op-ed piece to the editor of the Times. In it, I argued that the name of Tolkien's \"masterpiece\" should be renamed \"An Unprovoked Attack On Sauron the Merciful\" and that the second book should be entitled \"Saruman F*cks The Pooch\". Crusty old cracker. It looked like my email was blocked so I tried another. None of them worked: frodosucksballs@yahoo.com; bitemearagorn@gmail.com; theresnowayanelfcouldfireabowandarrowlikethat@hotmail.com. Nothing. Anyways, my point is that none of this was my fault. I mean, things started off fine. That Boromir got what he deserved. I've never tried to destroy someone who cared more about their hair!General Zod: Can anyone help me!!??Agent Smith: Shut the hell up windowboy!Sauron: Thank you. Ahem. Darth Maul: Bllllllaaarrgghhh.Darth Vader: You'll have to excuse my associate. He's…useless.HAL 9000: Just what do you think you're doing, Dave? Agent Smith: OMG! Can anyone stop this light bulb from saying that every week!Moby Dick: ArrrrrrrrrrrrrrrhhhhhhhuuuuuuuuuuuuflllllllllllllllllllAgent Smith: Jesus, now the whale is talking.Randall Flagg: Let…Sauron…talk.[silence]Sauron: If I may continue. Helm's Deep. My grandma could have tossed that joint before breakfast. But instead of sending her wheelchair-bound ass in to lead the charge I chose an Uruk-hai. In retrospect, since I took the time to hatch those suckers, I could have included some dolphin or chimpanzee in the mix to boost the IQ a little. Or at least supplied them with better loincloths. One Uruk-hai had a bad habit of talking to me while his leg was up on the table. We don't need to see that. Oh, and why don't I put all my faith in Gríma Wormtongue, he sounds reliable. Every time I looked at his multi-coloured eyes I wanted to puke.General Zod: That was pretty dumb.Khan: [shouts] THIS IS CETI ALPHA FIVE!Sauron: OooooK. I also regret relying on that damn Palantir for global communications! That freakin snowglobe basically told me that everything was going just fine. These days Saruman would have just texted me something like, \"Yo, Sauron, we may have an issue.\" Instead his ass is whooped by trees. You know, man invented fire like 10,000 years ago. Trees.Jabba the Hutt: Sorry, I got here late. Has that loser Sauron started yet?[silence]Khan: I shall avenge you.Sauron: Thanks. Anyways, where was I? Oh yeah, Shelob. Stephen King's made me afraid of clowns and spiders. I don't want to discuss that bitch.Khan: You see, their young enter through the ears and wrap themselves around the cerebral cortex. This has the effect of rendering the victim extremely susceptible to suggestion. Later, as they grow, follows madness and death. Sauron: STOP! A-hole. That's why Kirk can beat you while simultaneous boinking a green chick. You're pathetic. Go back to selling coffee or whatever you've been doing. This is getting me nowhere. I never should have signed up for this. And there's no fracking way I'm writing a review of my demise in The Return of the King. [end transmission]Moby Dick: Arrrrrrrrrrrrrrrhhhhhhhuuuuuuuuuuuuflllllllllllllllllll[end transmission]"}, {"Review": "\n\nBook Review\n\nFor as long as I can remember, I have loved serial fiction and saga stories. The Lord of the Rings trilogy and associated books by J.R.R. Tolkien are a treasure. I first found the books when I was 14 and had to re-read again when the movies came out in the last decade or so. The second book, The Two Towers, was a worth follow-up, enhancing every original love I had with the story. I'm generally not a fan of the fantasy genre, and have only read perhaps 20 books in total, less than 3% of my entire reading history. But something about these books absolutely stands out among to me as a truly amazing series. I liken it to Star Wars as a movie and film phenomena, when it comes to the saga story. But this one started out as a set of books, which makes it even more fantastic...For me, although I loved all three in the series, the middle one was the least favorite, but they were all still 4+. The first one introduces everything and sets the stage. The last one is the epic battle. The middle one... pure awesome storytelling... but it's the middle. Full of history, secrets, revelations, explanations... you learn the most here. But you also get a little overwhelmed with the sheet amount to remember. But I like that about it too. And to tell the story of dark versus light. To see people you love fall to their death. To think so much will change for the worse. It's a challenge to decide which part of the story to love most.If you've not read the series, it's probably 2000 pages in its entirety. I still think you should read it... but start with book 1 of course. You can't read out of order. Then let's chat again! :)\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by. Note: All written content is my original creation and copyrighted to me, but the graphics and images were linked from other sites and belong to them. Many thanks to their original creators.[polldaddy poll=9729544][polldaddy poll=9719251]"}, {"Review": "The second act of the classic Lord Of The Rings saga is divided into two halves; the second half focussing on Frodo, Sam and Gollum and the first half focussing on the rest of the divided fellowship.To be honest, I love this book so much, it's virtually impossible for me to write a balanced review. If you're also a fan, you know exactly what I mean, so I'll leave it there. :-DBuddy read with Sunshine Seaspray.-----------------------------------------------Re-read in 2017: If anything, I love it more than ever now. :-D"}, {"Review": "494. The Two Towers (The Lord of The Rings, #2), J.R.R. (John Ronald Reuel) TolkienThe Two Towers is the second volume of J.R.R. Tolkien's high fantasy novel The Lord of the Rings. It is preceded by The Fellowship of the Ring and followed by The Return of the King.کتاب نخست: یاران حلقه؛ کتاب دوم: دوبرج؛ کتاب سوم: بازگشت شاه؛عنوانها: خداوندگار حلقه ها؛ فرمانروای حلقه ها؛ ارباب حلقه ها؛ سالار انگشتریها؛ نویسنده: جی.آر.آر. تالکین؛ تاریخ نخستین خوانش: ماه ژوئن سال 2002 میلادیعنوان: خداوندگار حلقه ها؛ نویسنده: نویسنده: جی.آر.آر. تالکین؛ مترجم: تبسم آتشین جان؛ تهران، حوض نقره، 1381، در شش جلد؛ عنوان جلد نخست: رهروان حلقه ها؛ شابک: 9649305491؛ موضوع: داستانهای نویسندگان انگلیسی -سده 20 معنوان: سالار انگشتریها؛ نویسنده: نویسنده: جی.آر.آر. تالکین؛ مترجم: ماه منیر فتحی؛ تبریز، فروغ آزادی، 1381، در سه جلد؛ عنوان جلد نخست: دوستی انگشتری؛ جلد دوم: دوتا برج؛ جلد سوم: بازگشت پادشاه؛ شابک دوره: ایکس - 964697130؛ عنوان: فرمانروای حلقه ها؛ نویسنده: نویسنده: جی.آر.آر. تالکین؛ مترجم: رضا علیزاده؛ تهران، روزنه 1381؛ در سه جلد؛ عنوان دیگر: ارباب حلقه ها؛بخش نخست: یاران حلقه؛ بخش دوم: دو برج؛ بخش سوم: بازگشت شاه؛ چاپ ششم 1391؛ شابک: جلد نخست: 9789643343224؛ عنوان: ارباب حلقه ها؛ نویسنده: نویسنده: جی.آر.آر. تالکین؛ مترجم: پرویز امینی؛ تهران، دنیای نو، 1382؛ در شش جلد؛ شابک: 9646564992؛کتاب حاضر بخش دوم از مجموعه سه گانه «ارباب حلقه ها» است. در این کتاب «فرودو بگینز» و همراهش «سام»، پس از جدا شدن از گروه یاران حلقه تلاش میکنند، خودشان را به سرزمین موردور، و کوه هلاکت برسانند. و از طرف دیگر یاران حلقه درگیر جنگی بزرگ میشوند، که «سارومان» متّحد «سائورون»، علیه روهان ترتیب میدهد. ا. شربیانی"}, {"Review": "\nHerewith Some Notes On My Inaugural Journey Through The Second Volume Of Tolkien's The Lord Of The Rings\nMe after staying up all night reading The Two TowersI liked \nThe Fellowship Of The Ring\n, but this book made me love Tolkien’s Middle-Earth epic. Some of the writing is astonishing (see quotes below). The author handles various storylines – the fellowship has scattered, after all – gracefully. And after having two of its main characters (and their slimy guide) spend a lot of time climbing up a cliff, the book ends on one whopper of a cliffhanger.• The Treebeard and Ent scenes are magical, if overly long. I love the ecological theme – destroying the countryside to fuel industry and war has consequences! – and the way the Ents are described.• Fewer songs and poems!, which means fewer songs and poems to read with eyes glazed over. With the exception of... • Sam's \"Oliphaunt\" poem: simply adorable.  Here it is.• Loved the Théoden transformation scene. And really, people trusted Gríma Wormtongue? Wasn't his, you know name, a clue to his character?• Saruman’s manipulative speech at Isengard, when he tries to use his evil wizard powers to win over Théoden et al: brilliantly written. Shame they had to cut down the exchange for the movie. And I love Saruman's coat-of-many-colours, which would have been too gaudy or campy for the film, I guess.• The Helm’s Deep battle wasn’t as sharply written as I expected. It went on forever and I had a hard time getting oriented. I was bored enough here to put the book down for a few days. (Now that I’m in partway through The Return Of The King, I think Tolkien’s battle-writing skills improved for the Minas Tirith fight.) Re: Helm’s Deep: Peter Jackson was smart to end the film with it.• Monologues. Now that we’ve met most of the major players, there are fewer of those “Hi, I’m X, son of Y, and here’s my story” passages.* But of course Gandalf gets one, cuz everyone needs to know what happened after he battled the Balrog in Moria, right? And I guess these monologues are meant to be stories told over firelight, good roasted food and mead. (People weren’t as distracted by things like social media back then.)• Shadowfax: I’m not even a horse lover, and I kinda fell in love with the gorgeous, noble steed, the pride of Rohan.• It took some major cajones to go 200 pages without dealing with Sam and Frodo. Talk about keeping us in suspense! And while we're talkin’ Hobbits, Pippin gets way more to do than Merry in this book, including his scenes with that cool \"seeing stone,\" the palantír.• Sméagol/Gollum. After all the stories other people told about him in Book One, we finally meet him, and... wow. He’s the work's single tragic character. I’m sure there are PhD theses about how he represents the dark or greedy side of human nature. (Frodo knows he has to accept him.) I suppose he could withstand a psychiatric diagnosis, too. Schizophrenic? Addict suffering from withdrawal? Whatever, he’s fascinating, and earns our suspicion, fear and also pity.•The writing. Nearing Mordor, after they’ve survived the spooky Dead Marshes, Frodo and Sam come to another landscape that’s as bleak and desolate as death itself:Frodo looked round in horror. Dreadful as the Dead Marshes had been, and the arid moors of the Noman-lands, more loathsome far was the country that the crawling day now slowly unveiled to his shrinking eyes. Even to the Mere of Dead Faces some haggard phantom of green spring would come; but here neither spring nor summer would ever come again. Here nothing lived, not even the leprous growths that feed on rottenness. The gasping pools were choked with ash and crawling muds, sickly white and grey, as if the mountains had vomited the filth of their entrails upon the lands about. High mounds of crushed and powdered rock, great cones of earth fire-blasted and poison-stained, stood like an obscene graveyard in endless rows, slowly revealed in the reluctant light.• Introducing… Faramir, a brave man who knows how to speak, not just act! We’ve seen heroic warriors, funny Hobbits, gruff dwarves, arrogant wizards, and those damn elves deliver all their words with a mischievous twinkle. But Faramir impresses with the sheer nobility of his character. When he meets Sam, Frodo and Gollum, and learns to trust the first two, he delivers this lovely speech about war, honour and what he's doing all this for: War must be, while we defend our lives against a destroyer who would devour all; but I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend: the city of the men of Númenor; and I would have her loved for her memory, her ancientry, her beauty, and her present wisdom.• Shelob-POV! No spoilers, but I love learning the backstory of this character. The way Tolkien sets up the finale, from the stairs of Cirith Ungol, the cave, the smells, etc., and then seeing everything from the character’s point of view? Just masterful. • Shagrat and Gorbag, the bickering orcs in the cave in the final pages. They’re minor characters, but I love their awesome names and their complaining about what to do. Sure, they dispense information we (and Sam) need to know, but they’re also drones kvetching about their jobs, as commonplace on Middle-Earth as on earth itself. On to the finale, The Return Of The King!---* Spoke too soon. Now that I'm reading The Return Of The King, there are a bunch more people being introduced. And so many place names! Glad there won't be a Middle-Earth geography quiz afterwards."}, {"Review": "Tolkien did not design The Lord of the Rings to be read as three separate books. However, since the book is flawless, there is just no boring moment. Even if you chop it further to 6, 12 or 24 books, I think all of them deserve 5 stars. I am not a big fan of fantasy genre but this one is just over the top. It is about good vs. evil and the nature of evil. With a universal theme like that, the non-stop action, the memorable characters, the extricate design of the fictional world, Middle-Earth and the lyrical prose, Tolkien wrote a book that will outlive all of us here on earth.The story begins with the four hobbits separated into two, Frodo and Sam who will later meet Gollum on their way to Mordor and Merry and Pippin lost in Fangorn and later meeting the Treebeard and the rest of the Ents. This is after the death of Boromir who is one of the members of the Fellowship (Book 1). He is killed by the Orcs after his attempt to steal the ring from Frodo and Sam. If Book 1 was mostly about the four hobbits, in this Book 2, Tolkien put them on a sideline and the focus here is the Fellowship fighting the Orcs. For most of the story in this book, the hobbits are at the sideline. They only came into action when the Ents with Merry and Frodo on top of Treebeard are destroying the first tower where Saruman resides: ORTHANC. Then the other two, Frodo and Sam battle with Shelob on their way to the second tower, CIRITH UNGOL where the other villainous wizard, the ultimate evil, Sauron lives. So, the two bad wizards stay in those two towers overlooking the Middle-Earth. Some crazy people say that the title \"Two Towers\" is a metaphor for two penises and there is a homosexual relationship between Frodo and Sam. Go to hell, I tell them. The book is so good and the movie is at par so please spare these works of art from your shallowness. I pity these people for not being able to appreciate good literature.On to Book 3. I am hoping that the third and final book will be as exciting as the two. Tolkien, sir, you are just so brilliant I'd like to open your grave and kiss your hands as a sign of my admiration and respect for you sir. There is just no other fantasy writer like you. Although I enjoyed The Game of Thrones and has a plan of reading the series where it belongs, A Song of Ice and Fire, I am sure that despite George Martin having the hindsight advantage, still your LOTR is better. I will not even say that yours is original. That could mean that his is better and yours are just the original. All of their works will not be able to top yours. Yours is simply incomparable and will always be better than all of their works. LOTR cannot be outranked. It will always be THE BEST epic high fantasy. Ever."}, {"Review": "The Two Towers suffers from the Jan syndrome. It's the middle child, and one that wasn't even meant to exist. Tolkien didn't intend The Lord of the Rings to be a trilogy, but rather one whole book, so inevitably the second volume was doomed to have no true beginning nor a satisfying finish.When I first read it as a teen I didn't enjoy it much at all, and it's still not my favorite of the three, but having read it again recently I warmed to it. It provides an admirably strong bridge between the first and last book, while including some very memorable moments and revealing interesting background details. Who could forget the Ents or the creepy Dead Marshes? The fight with Shelob was quite exciting. The struggle with Saruman and the Battle at Helms Deep is a great primer for things to come. All of these things and more are sometimes forgotten when comparing the quality of the three books side by side. Personally I love the first book when the four hobbits are on their own in the Old Forest, evading black riders and picking their perilous way through the Barrow Downs. And of course the final book is the satisfying pay off with the added bonus of all those info-laden appendixes, great for the hearty fan.The Two Towers may not get its due, but it is a fine book."}, {"Review": "Rereading The Lord of the Rings in German is an interesting exercise; as usual, not knowing the language well and being forced to go slowly makes me notice aspects I missed or skipped over on earlier visits. Two things in particular stood out. First, and I guess this comes from first being exposed to Tolkien at age 10, I had somehow managed to block out the fact that Frodo is obviously gay. I outlined this theory for my friend E, who shares my passion for Scandinavian languages and Middle Earth lore, and she was sceptical: she thought homosexuality wasn't part of Tolkien's universe. But to me, the case is pretty solid. Frodo has no interest in women whatsoever, and there's never any suggestion that he might. He does however have tender feelings for Sam, which are reciprocated. The scene on the stairs of Cirith Ungol, where Gollum sees him resting his head in Sam's lap, is quite moving. The other thing, which I think I saw before without really seeing it, is the extent to which the bearers of the Three Rings - Elrond, Galadriel and Gandalf - are controlling the action. Their thoughts are always on Frodo, guiding and helping him, and they can see far, both in space and in time. On several occasions, when Frodo is on the point of succumbing to the power of the Ring, Gandalf is able to rescue him. And when Galadriel meets him in Lórien, and she says that the fate of the Quest hangs by a hair, I think she can already foresee the whole continuation, and she knows how very difficult it will be. Everything depends on Frodo's being able to show mercy to Gollum, because he will play a crucial role at the ultimate moment; but, for reasons that are never explained, neither she nor Gandalf can tell him why. It is a pity that so many aspects of the background were exposed when the Silmarillion was published after Tolkien's death, since they revealed too much of the mystery, but it is still quite adequately mysterious. I think people underestimate Tolkien's skill. This is a book you can read many times, and you'll always find something new."}, {"Review": "The Two Towers is the second novel of the trilogy The Lord of the Rings. The companions are split to do their own bidding for the cause against darkness that is coming over their world. One group fights Saruman. The other group searches their way to Mordor with the ring's burden. What perils await? Will they come out on top?*Smacks face with book and cries out \"I LOVE YOU\"*This is one of the greatest novels that I have ever read. I bet everything has been said about this trilogy, so I will try to keep it as short as possible. J.R.R Tolkien has another huge fan. Furthermore, I never want to watch the movies ever again, because this book is GREAT. From the first chapter I was under Tolkien's spell. It was a lot more actioned pack and a lot more fun to read compared to the first book. I did not find it parts boring unlike in The Fellowship of the Ring. The writing did make me sleepy, which caused me to only read two chapters at a time. His writing is very detailed, but beautify written. I could imagine every crook and nanny, all the fields of battlement, the lush forest, and whatever in between. I will say this again that Tolkien has an amazing imagination, and he made an entrancing world for his characters. It still amazes me.I love all the companions. I would love to hug them all. All of them play to their strengths and have the moral courage to fight back against the evil that lurks. They all put a smile on my face. I love Sam and Frodo's relationship. Sam would do absolutely anything for Frodo. As I recall, Frodo is a lot more weaker in the movie than in the novel. I like Frodo in the novel, and I wish the movie made him a little bit more stronger. BUT there is a new race that tops over them all, and it is the Ents. I love the Ents. I love how relax they are, and how passionately they feel for their fellow trees. \"Do not be so hasty.\" I would love to meet an Ent, if they were real. Even Smeagol I have pity for. Sorry to go back to science, but I can't help but notice sometimes. Thinking about science makes me happy. I started thinking about natural selection and what traits were being passed down to the races. I noticed this when Treebeard was asking Merry and Pip about Entwives. Legolas has far sight, great hearing, fair skin, and soft feet. The Hobbits short, light footed, and good hearing. Those traits were passed on from generation to generation, and it is helping them survive. NATURAL SELECTION FOLKS! The Hobbits are not the greatest fighters, so they can hide easier in smaller places to avoid the enemies. Elves protect their homes, so they have qualities of fighters in night or day. GOSH that made me very happy. I can't wait to read the Return of the King next month, but I will be really sad for it to end. The series has been amazing so far and I just don't want it to end. I absolutely love it! This review and the one on my blog are practically the same, but incase you forgot visit my site. haha http://dancingbetweenthecovers.com/re.... If not, oh well. Read well folks! "}, {"Review": "I'm one of very few people in the world that actually really hate the Lord of the Rings trilogy, and 'The Hobbit' as well. I've read 'The Hobbit' twice, trying to capture the second time what I was sure I must have missed the first time round... but no. And then I read The Fellowship of the Ring and found Frodo's story to be as drab and long-winded as that of Bilbo. I would have stopped there but my friends told me that I should definitely read this book, promising me great adventure and well-written fantasy worlds. And still no.I realise I am in the minority and I don't know why. But I've looked for what everyone loves so much about these books and everytime I find pages and pages of boredom. These novels are the kind that make me want to skip pages - and I really hate doing that because I feel like a cheat, but ack! What is it? Really, what am I missing?"}, {"Review": "“War must be, while we defend our lives against a destroyer who would devour all; but I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend.”This second installment (or the middle of the book to be more correct) is phenomenal. If you had some trouble trudging thought the songs and the first and second breakfasts in the first book, this book is your reward. The story, the characters, the sass! The Two Towers is the best of Tolkien bottled up in a bottle. The bottle of the finest, richest wine. ​“I was talking aloud to myself. A habit of the old: they choose the wisest person present to speak to.”Many new characters came onto the scene and I adored every single one of them. Treebeard especially, and the fact that he was somewhat based on Tolkien's friend Lewis (the author of The Chronicles of Narnia) was beyond heartwarming. Literary world needs more friendships as one that Tolkien and Lewis had. Two literary geniuses who inspired each other, put each other in each other's books and dedicated books to one another. As with every great fantasy book that I read I find myself unable to pick just one favorite character - instead I have a small army of favorite characters. Because each of them brings something different to the book, something that I love. The Two Towers is full to the brim with my favorite characters, and yes, Treebeard is definitely one of them. An ancient race of tree beings (very badass beings at that) that can turn the ground upside-down if they get angered enough. But they also could spend hours just enjoying the wind and the earth. Which brings me once again to Tolkien's tremendous love for nature and the environment - it is one of the very prominent themes of the book, and one that fills my heart with joy. Because of his innate affinity for beauty of nature - Tolkien's writing and descriptions are transportive. You can almost imagine yourself in Middle Earth - being carried high up by Treebeard, or getting lost in the marshes. ​Another character that stole my heart with his very first appearance is Faromir - a man even more honest and righteous than Aragorn. Faromir is one of the very few (well one of the only two characters in the whole book who aren't tempted by the ring and its power, not even a little bit) and for that Faromir is definitely a top character for me. Because if you read the book you know how much it says about the person if they aren't even tempted. But few rival to Sam Gamgee in terms of awesomeness. I am one of those people who thinks that Sam is the true hero of the story, and book two proves so much of that. Sam is the man, thetas honestly all I can say, because his actions speak for themselves. “Don't leave me here alone! It's your Sam calling. Don't go where I can't follow! Wake up, Mr. Frodo!”The Two Tower's pacing is perfect, while The Fellowship of the Ring was very slow to begin, because of the extensive lore that was being explained, the second book is full of adventures, action, sassy comments, beautiful friendships and also sad moments. I found myself simultaneously wanting to read faster because I couldn't stop, and also needing to stop because I didn't want the book to end. A paradox, really. And an ode to great storytelling!​Cannot wait wrap up my journey with The Return of the King, although I will also be sad to leave the Middle Earth (for a while, because there will be many more re-reads in the future). P.S. My husband and I have been watching some military rations videos rom different counties and that is when I realized that the lembas was probably inspired by military grade food bar - made to sustain you for a day with just one small block of compressed food that contained all vitamins, fats and proteins a grown man needs for a day. And it makes complete sense because Tolkien himself was in the army. My WEBSITEMy INSTAGRAMMy WORDPRESS BLOG"}, {"Review": "En mi opinión, aquí es donde empieza lo duro y la acción de esta travesía. La comunidad del anillo es una introducción de la trama, en sentido de organización, introducción de personajes, etc. Sin embargo, aquí es cuando la cosa se pone más densa, cuando las cosas poco a poco se van transformando en algo cada vez más infernal. Aquí es cuando la comunidad comienza a tener problemas: caen en trampas, tienen riesgo de morir, y están forzados a sacar sus mejores habilidades de supervivencia.Aparte de todo esto, es cuando los personajes comienzan a crear lazos de amistad... unos más que otros (lo que es normal), pero aquí es cuando ya se arma todo el equipo y, por lo menos yo, comienzo a tomar cariño a los personajes.Es bastante hilarante imaginarse cómo va cambiando Gandalf, cómo Gollum tiene cada vez más protagonismo en el libro, y cómo se va desarrollando a través de la historia.¡Uf! Simplemente es maravilloso leer un libro e imaginarse tantas cosas mientras se lee. Esa es la magia de leer: crear tus propias escenas mientras vas leyendo una historia."}, {"Review": "Anish: This book is a vast, VAST improvement on the last one!People:   Really? And yet you rated it 4 stars while you rated the last one 5 stars! Anish:   Yeah well, for me this book had a couple of problems...People:   Really? Are you even serious? Do you not know what you have just read? Who you've read? Anish:   I do know that and it has nothing to do with penmenship but... People:   For shame, Anish, for shame! What do you have to say for yourself? Anish:   This is what I have to say...First off, Acknowledgements!A very huge and heartfelt thank you to The cheery lady who has a great name and The guy who has the same box set as mine for inviting me to buddy read! In all honesty, this has been my most fun and engaging BR by far and now I certainly hope to finish this series with both you folks even though you both almost killed me with your reading speed! :DAnd Avinash, a special thanks to you, for standing strong in a gentlemanly fashion when we disagreed about a certain thing. Much love to both you guys!!Let’s start by saying that I will be pretty hard pressed to add anything more than what I already said in the review of The Fellowship of the Ring. Yet, let me try, for one shouldn’t stop trying for fear of failing, should they?Let’s talk story first.There is SO MUCH story in this book, crammed inside the pages that it seems like a surprise that all of that happened in just one book! And it’s really hard to give a synopsis of a book like this bcz that in itself would make a huge review and I intend to talk about the book rather than the story. So I will give out the major hits! \nFall of Boromir\n \n“What news from the North, O mighty wind, do you bring to me today? What news of Boromir the Bold? For he is long away.’ ‘Beneath Amon Hen I heard his cry. There many foes he fought. His cloven shield, his broken sword, they to the water brought. His head so proud, his face so fair, his limbs they laid to rest; And Rauros, golden Rauros-falls, bore him upon its breast.”\n The mighty fall too. Boromir….ah Boromir! The poor chap who paid dearly for the mistake he made. A mistake whose punishment shouldn’t have been death. And yet, it is. The man of Gondor, dead. Defending the hobbit friends Merry and Pippin, taken by orcs. Is he redeemed?\nReturn of Gandalf\n \n“I have passed through fire and deep water, since we parted. I have forgotten much that I thought I knew, and learned again much that I had forgotten. I can see many things far off, but many things that are close at hand I cannot see.”\n Aragorn, Gimli and Legolas, in pursuit of the orcs, end up in the Fangorn forest where they are met by none other than beloved Gandalf! And yet it’s not the Gandalf the Grey of old. This is Gandalf the White, on a mission to stop the enemy. To do what he may with the time afforded him. Can he make a difference?\nBattle of Helm’s Deep\n \n“You must go to Edoras and seek out Théoden in his hall. For you are needed. The light of Andúril must now be uncovered in the battle for which it has so long waited.”\n The war is afoot and the people of Rohan must make a stand. The mettle of men must be tested! Will they survive?\nFall of Isengard\n \n“A king will have his way in his own hall, be it folly or wisdom.”\n Saruman the wise, the treacherous, safe in his tower, who joined forces with Sauron must now be brought low. A major ally of the dark lord must be snuffed. But who dares? But help does have a way of coming from unlooked places. And it does. Will Saruman be rid of? \nFrodo and Sam\n \n“Frodo was very brave, wasn’t he, dad?” ‘‘Yes, my boy” ‘‘I want to hear more about Sam. Frodo wouldn’t have got far without Sam, would he, dad?” \n The duo must go on. Into Mordor! To find a way they must also make an alliance that seems unlikely to result into anything good. And yet what choice do they have? On and on, they must go. And they do. With naught but friendship to guide them in the darkness and fear that presses in on them. Do they get anywhere though?\nFaramir \n \n“And here in the wild I have you: two halflings, and a host of men at my call, and the Ring of Rings. A pretty stroke of fortune! A chance for Faramir, Captain of Gondor, to show his quality!”\n Boromir’s brother. A captain leading his people on a tough mission who happens to cross paths with Frodo and Sam. The one grieved by his brother’s death. The one who has now the One Ring at his disposal, for the taking. Should Faramir fail like his brother did?Let’s talk book.What makes an author write? I mean I get that they want to tell stories and yet this is not a story that Tolkien has produced. No. This is an experience. A world that is just as detailed and every bit as real as ours. He has put in so much, created so much! He produced greatness! Why? What was the motivation?Was it to earn? Was it to just tell a story that he had? Was it the praises from the reader? What was it? I think, in my very small and humble opinion, it was immortality. I think it was his want to leave a mark upon the world in order to cheat death. Isn’t that something that has driven many?\n“I wonder if we shall ever be put into songs or tales. We’re in one, of course; but I mean: put into words, you know, told by the fireside, or read out of a great big book with red and black letters, years and years afterwards. And people will say: ‘‘Let’s hear about Frodo and the Ring!’’ And they’ll say: ‘‘Yes, that’s one of my favourite stories.”\n And hasn’t he been immortalized? I’d say he’s cheated death and he has had the last laugh! For as long as there will be readers, I am sure these books will survive.When I picked up this series, I bought the box set mostly on an impulse, despite almost DNF’ing my first venture with Tolkien in form of The Hobbit. I didn’t like it. Yet, something told me that I was probably not matured enough as a reader to handle that book when I picked it years ago. So I picked this series, many books later. With only a few chapters into the first book, I knew my gut was right!First thing that I loved about this book was that it started right from where we left off in the first one. I am not a big fan of cliffhangers being drawn out. That was the first thing that this book did right and from then on, it kept ticking most of the boxes that needed ticking.The writing is so exhaustive, so detailed that at times I felt overwhelmed. And to a certain extent I believe that this is one of those books whose sheer intensity and depth and details simply cannot be soaked in totality at your first go. One HAS to read it a couple of times to be fully aware of all the little fillers and specifics that have been used to populate this world of Middle Earth. One doesn’t not simply read this series once! Sorry, I just had to do that! We had to do it, didn’t we precious, oh yes we did! :PWith an exception of one chapter about the Ents, which was super slow but just according to the story, the rest of the book is very well paced and it’s always moving forward. So much is happening, so much is being described. This is not a book for light reading. This is immersive. The book ends with yet another cliffhanger of sorts and has setup the stage very nicely for the final instalment. It’s very rare to find books in a series that are an improvement on the preceding books. This one does that. I am in total awe of this author and I salute him for having creating something like this…something so enormous and so beautiful. Tolkien is something different. I don’t think comparing any author with him is fair on the other author. Not that comparison is fair in itself but I don’t think any author should be measured against Tolkien.There are songs and poems in the book that are very well done indeed and they just add to the charm of everything else. It gives the world a history, a sense of being ancient. The words and dialogues are gems and reach deep inside.The character of Gollum is extraordinarily well done! It sounds exactly like what a creature like Gollum should or would sound like. There is the malice and insanity and indifference and even so, there is a small part of the good old Sméagol that has survived. But I think, the character of Faramir takes the cake! I mean this is the only character that was so on point! He sounded just perfect. A guy whose heart is heavy with the death of his elder brother and yet duty forces him to stand fast in his stead and lead his men. To serve his nation and take up arms. A guy who clearly looked upto his big brother and yet, he turned out better than him, turned out to be someone who never lets go of his honor. Someone who has a level head on strong shoulders! I absolutely LOVED Faramir and Gollum! If anyone rivals those two, it is my dear Sam! Who else could it ever be? Sam, the loving and doting Sam!And yet, for all its greatness, this book isn’t unblemished either.Just like the last book, this one too, has many places where the dialogues from the characters come off as funny in a sad or dangerous situation. It kind of kills the mood in a way and although Tolkien more than just makes up, it still does happen. Legolas is the most useless character in my opinion as his words, few as they are, mostly miss the mark by a big margin. This is a letdown. A small one and yet, it is.Another thing that is lackluster was the battle sequence. The battle of Helm’s deep was not intense enough for me. It felt a little loose, I guess? And too short. Way too short. The siege could have been bigger. Another letdown, small one again and yet, still there.But the one thing that really put a dent in this book for me personally is this.Frodo and Sam, the whole thing, is based on friendship. The way Sam sticks around and takes care of him and everything. It’s the kind of friendship that probably doesn’t exist and yet we all wish for! Which is why Sam is such an awesome character!For me, friendship is based in trust and faith and most importantly, respect. Equality. Two people from any background can be friends as long as they respect each other, treat each other equal and trust each other. This is all that friendship asks for. This is how I feel.So imagine the dent it puts in the shining image of friendship of Frodo and Sam when Frodo calls him his servant! In this book, I can’t count how many times, in the narrative, Tolkien refers to Sam as Frodo’s servant. It starts to sound like Sam is duty bound to Frodo, which he is NOT, in anyway. Sam did not need to come along except that he wanted to! To be there for Frodo! To not leave him alone in his troubles. But Frodo never stops Sam from addressing him as Master!To my eye and mind, that’s disrespectful. It’s not treating someone as your equal. And this…this leaves the whole relation of Sam and Frodo feeling lesser than it is! \n“Sam sat propped against the stone, his head dropping sideways and his breathing heavy. In his lap lay Frodo’s head, drowned deep in sleep; upon his white forehead lay one of Sam’s brown hands, and the other lay softly upon his master’s breast. Peace was in both their faces.”\n Excuses will always be there. Excuse can be made for made for almost anything. But if you can’t call a spade a spade bcz of excuses then you is lying, my man! And lying aint my scene.Tolkien, through Frodo, degrades Sam, even if it is just a touch. But he does. Sam was never his servant. It irked me personally and no explanation resolves the crime of calling your friend, one like Sam, a servant and disrespecting them. None exist in my books and to that end, I will deduct one star. Wrong is wrong, even if it is Tolkien who commits the deed.This, again, brings me to my original stand. The LOTR movies are better than the books. The movies have changed and corrected all that is wrong or lackluster in the books and it has taken this series to a whole new level. For me, this is one rare occasion where the movies are better. Peter Jackson, you glorious bastard, you created magic! Yet, this book is one of the finest pieces I have read! I really like this series, so much so, that I didn’t expect it and I can’t wait to get to the final part! This is a goodbye to Middle Earth for now. Despite the couple of small and one major flaw, I love everything in this book. Burárum! Too long have I ranted! I should stop and sign off! \n“But I shall miss them. We have become friends in so short a while that I think I must be getting hasty!”\n"}, {"Review": "جان رونالد روئل تالکین، در جبهه های جنگ جهانی اول در فرانسه شرکت کرد، در نبرد \"سُم\" که بیش از یک میلیون نفر در آن کشته و زخمی شدند. و بنا به گفته ی خودش هیچ یک از دوستانش از آن نبرد زنده برنگشتند.تالکین به علت ابتلا به تب خندق، بیماری ای که بین سربازان جنگ جهانی اول که در خندق ها کمین گرفته بودند شیوع پیدا کرده بود، از خدمت مرخص شد و به انگلستان بازگشت. در طول دوره ی نقاهت، یادداشت های اولیه ی خطّه ی میانه را نوشت، که در طول جنگ جهانی دوم، به خلق \"ارباب حلقه ها\" منجر شد.تالکین، هر چند انکار کرده که نبرد حلقه نمادی از جنگ جهانی باشد، اما صادقانه اعتراف کرده: نویسنده نمی تواند از تأثیر تجربیات خود برکنار بماند.و تأثیر تجربیات دو جنگ فاجعه بار بر سر تا سر ارباب حلقه ها بیش از آن آشکار است که نیاز به اثبات داشته باشد: نیروی تاریکی در \"شرق\" (بخوانید: آلمان نازی) و متّحد مطیع و در عین حال خیانتکارش، \"سارومان\" (بخوانید: ایتالیای فاشیستی)، جنگی فاجعه بار و خانمان سوز و همه گیر، به طوری که همه ی خطّه ی میانه (بخوانید: اروپا) را در بر می گیرد، وحشت حاکم بر داستان، وحشتی که کسی امیدی به پایان یافتنش ندارد، نبرد صنعت و طبیعت، استفاده از مواد منفجره با این که ارتباطی به زمان داستان ندارد، و جزئیات بسیار دیگر، همچون خاموشی سراسری گوندور از ترس دیده شدن نیروها، یا پرنده هایی هولناک که با جیغ هایی \"فراصوت\" مدام در آسمان گشت می زنند، یا جاسوس های دشمن که همه جا حضور دارند، یا تلاش دشمن برای ساخت نژادی جدید و قدرتمند و شیطانی و...فکر کنم رگ و روح این داستان را، عمق وحشت این داستان را، کسانی به طور کامل درک کرده اند که همچون تالکین فرزند آن دو جنگ ویرانگر بوده اند."}, {"Review": "Well two down and one to go. One of the first things I have to say about this book is WOW the battle of Helm's Deep was short. Since I saw the movies before reading the books, so much of what I saw is superimposed over the words I'm reading. This is probably the first book series I've read, after seeing the movies, where I feel like seeing the movies helped. I tip my hat to Peter Jackson, personally, after reading the first two parts of the Lord of the Rings, I think he did a fantastic job with his adaptation. Frodo is such a better character in the books though. All of his actions are the same but we get the internal workings of his mind in the book, which we, unfortunately, did not get in the movies, so he comes across as intelligent and mature in the books and . . . well I'll just say he comes across as a more deserving ring bearer in the books. My favorite scenes in this book were two brief interactions between Sam and Frodo. The first when discussing the bread and it's revealed Sam is trying to keep rations for the journey back home while Frodo is at peace with the thought that it's a one way journey to Mordor.The second is Frodo and Sam talking about their adventure as a story in the future. Sam pretending to be his future kids asking to hear more about Frodo, and Frodo jumping right into the role of another child wanting to hear more about Sam. It was just a really cute human moment that made me love the characters even more. I will begin the Return of the King tomorrow and will hopefully have this series completed by the end of the week. I'm sort of sad about that to be honest, but oh well, on to the next one. "}, {"Review": "I feel guilty rating this book because I kid you not, I just BARELY absorbed anything in this book. I listened to it on audio, and I was maybe only attentive for 50% of that experience. It doesn't help that my professor gets so off track during class that we never actually discuss what we've read, so I don't have any incentive to read what we've been assigned. This series is definitely something I want to revisit in the future when I'm not skim-reading it out of a 10-pound series bindup and I don't have to read the entire series in 4 weeks. I love Frodo and Sam and Gollum. So much. I wanted to love this, but reading it was unbearable because of the size and page requirements, so hopefully when I reread this one day from the box set I already own, I will enjoy it and see its merit enough to rate it higher."}, {"Review": "دوران راهنمایی دوستی داشتم به نام پریا، که تا این لحظه، با فاصله ی زیاد، کتاب خوان ترین دوستم هم هست. دقیق یادم نیست، اما فکر می کنم یکی از کتاب های هری پاتر دست من بود، یا شاید پریا، و در لحظه دوست شدیم. خیلی کتاب رد و بدل می کردیم و بعد هم کلی در مورد کتاب ها صحبت می کردیم. من عاشق ریاضی بودم و پریا عاشق نقاشی، و به همین خاطر نگاه پریا به کتاب ها با نگاه من خیلی فرق داشت. پریا جزئی نگر بود، به تک تک کلمات دقت می کرد و از تک تک جملات لذت می برد. من اما مشتاق رسیدن به آخر کتاب بودم. اصلا بعضی وقت ها اول فصل آخر را می خواندم تا حدوداً بدانم آخر داستان به کجا ختم می شود، بعد با خیال راحت از اول شروع می کردم به خواندن. پریا با کتاب ها زندگی می کرد، عجله ای برای تمام کردن کتاب ها نداشت. من ساعتی صد صفحه می خواندم تا زودتر به آخرش برسم.سال دوم یا سوم راهنمایی بودیم که یاران حلقه اکران شد و تب خواندن ارباب حلقه ها بالا گرفت. پریا از دو برج شروع کرد، و همینطور که از کلمه به کلمه ی کتاب لذت می برد، بعضی قسمت ها را برای من هم می خواند. طبیعتاً عاشق لگولاس بود -مثل من- و معمولاً قسمت های مربوط به لگولاس برای خوانده شدن انتخاب می شدند: یک بار از رو می خواند، یک بار با شوق تکرار می کرد، بعد می خندیدم و دوباره می خواندیم. خیلی کتاب ها را هر دو خوانده بودیم، اما دو برج اولین کتابی بود که تقریباً با هم خواندیم. خواندن مجدد دو برج بعد از پانزده، شانزده سال، برایم دو لذت داشت: اول لذت خواندن خود کتاب و دوم مرور خاطرات دوران راهنمایی و دوستی با پریا. بهترین سال های عمرم، با فاصله ی زیاد. "}, {"Review": "“The cold hard lands, they bites our hands, they gnaws our feet. The rocks and stones are like old bones all bare of meat.But stream and pool is wet and cool: so nice for feet! Get Down!”Yesss, we love rock ‘n’ roll, don’t we, Precious? The nassty hobbitses they hates it. Dust and ashes! Those nassty thieving disco dancing hobbitses, we hates them!I often heard that the LOTR trilogy is one book published as three, I have always thought it was some kind of hyperbole, but no, having just read The Two Towers I believe LOTR is almost literally one big* book trisected. The last chapter of  The Fellowship of the Ring and the first chapter of The Two Towers could have been combined together as one chapter. There is no time lapse to speak of. The first half of the book consists of two narrative strands: the adventures of the Testosteronic Trio, Aragon, Legolas and Gimli, and the chillin’ adventures of Merry and “Fool of a Took” Pippin. Aragon’s team has a hard time of it, starting with the discovery of poor Boromir pushing up the daisies.After floating ol’ Boro’s body on a wee boat down the River Anduin they embark on a search for the AWOL hobbits, hooking up with an old pal along the way and getting involved in a war between the city of Rohan and Saruman’s orcs-filled forces. I don’t enjoy reading about warfare much but Gríma Wormtongue is good for a laugh. (He is an advisor to the King and his name is Wormtongue? How did he get the job?)Meanwhile, Merry and Pippin get kidnapped by orcs and rescued by the environmentally friendly Treebeard of the Ents.Art by Ted NasmithMan, I love the Ents, they should have their own spin-off books battling orange critters disseminating fake news about global warming. Anyway, the Ents also go to war with poor beleaguered Saruman who nobody seems to respect anymore, and is probably under investigation by the FBI.The second half of the book is all about the Terrific Trio of Frodo, Samwise and “Obsessed much?” Gollum, AKA Sméagol. Things are never dull with Sméagol around, he is not a very nice guy and he will not have your back when things go south, but he is possibly my favorite character in the entire trilogy. He is more complex than he seems, has his good side which tends to peep out for a few seconds before it gets swamped by the nassstiness. He also has brilliant chemistry with Sam.Art by - uh - frodoSpeaking of whom, Samwise is my favorite hobbit, he is perceptive, loyal and absolutely badass when the chips are down. Samwise for president! Frodo and Sam’s nightmarish journey towards Mordor is an ingenious notion. They are great counterpoints to Mordor, cute, almost cartoonish characters navigating a drab, dangerous and stinking landscape makes for a fascinating contrast, and a very compelling narrative; further enhanced by the addition of the untrustworthy Gollum.Tolkien’s talent is astonishing. His meticulous world building is legendary, and his prose is always elegant. Best of all (for me) is his dialogue, where he endows the characters with distinctive voices. It is interesting to compare Frodo’s dialogue with Samwise’s, Frodo is much more educated but Samwise has a lot more ready wit and humour. Gollum is, of course, in a class of his own, LOL! I half expected The Two Towers to sag a bit, being the middle section of the epic story but it is generally fast-paced, some R&R scenes—where Aragon’s team just sit around and shoot the breeze—and bizarre musical numbers notwithstanding. Can’t wait to get my mitts on  The Return of the King.Notes:* The entire trilogy is shorter than  War and Peace, or for a more related comparison, the entire trilogy is about the same length as  Words of Radiance, as a trilogy LOTR is a mere pamphlet really.• Sam and Gollum are like an old married couple but Legolas and Gimli are also great together as BFFs, or “Legimlas” if you ship them 😀• Faramir, Boromir’s brother, shows up, a nicer, more honorable man than his brother but a bit of a bore really, he tends to suck the life out of the narrative when he is in it.• Sméagol’s grammar is even worse than Yoda’s, but somehow better. Nassty midget Jedis, we hates them.• Sam’s Gaffer quotes are the best!Quotes“Do not meddle in the at Fairs of Wizards, for they are subtle and quick to anger.”“That's the one place in all the lands we've ever heard of that we don't want to see any closer; and that's the one place we're trying to get to!”“Don't hurt us! Don't let them hurt us, precious! They won't hurt us will they, nice little hobbitses? We didn't mean no harm, but they jumps on us like cats on poor mices, they did, precious. And we're so lonely, gollum. We'll be nice to them, very nice, if they'll be nice to us, won't we, yes, yess.”“Various reproachful names for himself came to Sam's mind, drawn from the Gaffer's large paternal word-hoard.”“But where there's life there's hope, as my Gaffer used to say; and need of vittles, as he mostways used to add.”Badass Samwise vs Shelob (sorry, don't know who the artist is)"}, {"Review": "2017 (18) Update:Sixth read, best yet. I caught something to figure out. We leave Saruman to Sauron, who believed he saw Frodo in the palantir. He sent winged Nazgul to follow up, but I don't recall hearing anything more of it.I found the summaries enthralling, and am embarrassed to admit I finally found the passage explaining the title. He gives great summaries explaining history, and explains Sarumans Tower copies Saurons, as they both had been set up in better times. The fight with Shelob scared me and the hand to hand combat made me realize Tolkien must have known this from war experience, and I realized this little Hobbit from nothing and nowhere defeated an evil thing of dark nobility from ancient times.And the feeling, the burning pleasure! What a gift to humanity! Thank God for Tolkien's work and life!2016 UpdateI'm grateful I abandoned the movies. The book reads in a different way, yet I feel the movies present a dazzling and significant interpretation. The books start to take on an earthy, ancient, Pagan-like feel. I'm not talking about the Dragnet version of Pagan; I mean the earth religion, the ancient one, before my own religion oppressed them and categorized them with an evil entity they didn't even believe in.I also experienced some personal revelations for my life, and a glimpse of the spiritual nature of the book, and of Tolkien. I have a Pentecostal background, which includes speaking in tongues, although I now attend a Baptist church and if I speak in tongues there they may tackle me and pin me down and try to cast demons out of me. In the book, Sam holds up the Phial of Galdriel against Shelob: \"And then his tongue was loosed and his voice cried in a language which he did not know....\" That describes the biblical and experiential gift of tongues, to me.I felt the time spent with Faramir paced slow and dragged on; my thoughts threatened to wander, but it provides a backdrop for the rest of the masterpiece.Frodo felt a coldness in his arm spreading to his heart when the Rider flew over him. His world blackened and his thought patterns turned negative and despairing. This made me realize some of my own thought patterns have been inspired by some form of darkness, within or without, and I need to abandon these patterns.This year I went through a divorce. I've often wondered at my life, at the pointlessness of some things, and wonder what God is thinking, putting me through some of the destructive and pointless things I've experienced. I sat on break, at work pondering this story a couple days ago. Another important character manifests in this book. Tolkien introduced this Being in The Silmarillion. Middle-Earth calls him Illuvitar. I see his influence in this story, although not once does JRRT mention the name. Can you imagine the reaction of the council, if they had planned it this way? \"Okay, so Gandalf will need to die. Boromir, you'll need to die too, and Aragorn, you'll need to be absent while two Hobbits split the party and need rescued. Frodo, you and Sam need to go into The Land of Shadow alone, to face wild beasts and threat of exposure, without a guide and only on your tiny little strength. Sorry, it just has to be this way, everyone.\" Elrond and the rest would have laughed at this, yet it turned out to be the best plan, although the most foolish. Some things happen in life we don't understand, but a hidden Person works things out we don't understand. He does it so our Saurons and Morgoth don't understand the battle plan either. He does it for a greater purpose, to bring about some greater good, and to reward us for our effort and suffering. That describes how I see things in my version of spirituality. I'm more impressed with Tolkien's depth every year. Only a twenty year effort could produce such a masterpiece.2015 Update I didn’t expect this, but my fourth read thrilled me more than the last three. I found nothing to criticize here. I believe my reading skills have strengthened this year because I’ve increased my daily reading and writing. Where I would wander in my mind before, I find I can follow the words into deeper descriptions. The imagery in this book transports the mind into a real place. No movie can do this. I’ve experienced utmost pleasure in these pages, and have closed the book at night wanting to dream and go there again. I noticed something about Gandalf in this fourth journey. In the first book, although I didn’t mention it in the previous 2015 review, Gandalf seemed to be a grumpy old worn out man, using his wisdom and intelligence to shut everyone else down. He disagreed with everything people said and corrected them. I never noticed that before. Then he fell into shadow. [SPOILER – SKIP TO NEXT PARAGRAPH IF YOU HAVEN’T READ THIS OR SEEN THE MOVIES.] In the second book he reappears, and he has changed. He has been renewed, and has more joy, more confidence and charisma, like he took a long nap and feels better. I never noticed this change until this read. I like Gandalf the White better than the Gray. He treats people nicer and he doesn’t act as grumpy. Tolkien has a strong ability to describe settings and create mood. When the mind follows his words, they seem to bring this reader into a trance. Writers have mentioned being entranced by the writing process. What incredible talent to put the reader in a trance. How does Tolkien do it? How many times will I read before I see it? His trilogy puts a kind of spell over me. I feel it, literally feel…something…when I read. Perhaps he organizes his word patterns in a way or manipulates the language. I don’t know, but I have never experienced this with any other book quite the same way. I feel he literally takes me into this other world. 2014 ReviewThe beauty and history of middle earth is introduced through a snapshot of that history in the War of the Ring. Rohan is introduced to the reader. Eowyn, Eomer, Faramir, King Theodin, Saruman and Wormtongue come onto the scene. The Ents have a meeting with the Hobbits and tear apart Isengard. The book is wonderful, as the history goes as deep as the roots of the Guardians of Fangorn. Every character has depth and personality, history, and inner struggles. I fell in love with every one of them."}, {"Review": "AUDIO REREAD #2 Actual reread probably #62018 Reading Challenge: book made into a movie I’ve already seenI want to start a list of every book that includes a \"Dark Lord\"Wormtongue vs Worm TailI can't help it. Every time Sam says \" master! Master!\" I break into Master of PuppetsWhat is it about companions on a journey to conquer evil that strikes the heart of us readers?I totally forgot about the abrupt ending!!! I'm never prepared for that. I feel like Towers is a bridge book, but it sets the stage for Return brilliantly.Audiobook #22412/3/18 holiday reread for the 1,000 time"}, {"Review": "\n“The world is indeed full of peril, and in it there are many dark places; but still there is much that is fair, and though in all lands love is now mingled with grief, it grows perhaps the greater.”\nThe quote above is just one reason to get yourself to read this. This was the second part in one of the most-beloved series of every fantasy lover. If you're a person who loves a good adventure, with twists, surprises, great characters, fun & drama then you cannot continue living on this earth without reading this piece of dream.It explores the dark & full of wonders world that is Middle-Earth. It just goes on to show us that there is hope even in the bleakest of moments. Our characters never lose their hope, they are endlessly brave and courageous. There is war and action, it's a must-read.\n“War must be, while we defend our lives against a destroyer who would devour all; but I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend.”\n"}, {"Review": "My final read of 2018 and it was a full five stars and a new favourite! I'm looking forward to completing this infamous trilogy but I'm putting it off as I seem to be unable to say goodbye to these beloved characters.On my review for The Fellowship of the Ring I stated that my familiarity with the film acted as a barrier, in some areas, when it differed from these books it was based upon. However, it also helped me to bond with all the many elves and dwarves and hobbits, and it is now impossible to view them as anything other than the beloved actors who play them!"}, {"Review": "\n\n “War must be, while we defend our lives against a destroyer who would devour all; but I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend.”\n\n\n4 Stars\nSooooo I originally said I’d have this review up on the day that I finished it. And I basically did. But like I typed up literally 75% of what was a decently long review, all nicely formatted, only to have my computer glitch out on me, and I lost it all =[. I just didn’t have the energy to type it all over again out of frustration. From now on, I’m typing all my reviews in a word document and then transferring them haha. This book was a big improvement for me compared to the first book. What improved exactly? Well, frankly, I just enjoyed this book a whole lot more, and a lot of the things that majorly pissed me off in the first book (the incessant pages of singing and lyrics, Tom Bombadill, lack of character personality, ect…) were not nearly as present in this book. I found myself loving the Aragorn, Legolas, and Gimli POV, especially. In terms of the pacing, this just felt like a well rounded book, in comparison to book one. I never felt like the story was dragging, and that left me content for most of it. \n\n”There is some good in this world, and it’s worth fighting for.”\n\n\nStory & Plot:\nIn book one, Tolkien lays the foundation and the floor plan for the entire story, and by the end of the book you get a really good idea of where you’re headed for the remainder of the series. This book differs in that we really start to get into the meat of the story, told from two points of view (with a smattering of Pippin and Merry thrown in). If we’re talking about the story of each POV, the Aragorn, Legolas, and Gimli POV would receive a full five stars from me. There was a lot of development between the individual character relationships, some intense battle scenes, and plenty of things to keep you interested. I LOVED the Battle of Helms deep. We actually had a more interesting villain, too, because of the presence of Saruman. Just overall really enjoyed it.Frodo and Sam’s POV, unfortunately, fell really flat for me. I feel like the majority of the POV was Tolkien just constantly reminding the reader of how exhausted they were, and how tiring the long walk to Mordor is, and how on-edge Frodo felt because of his responsibility. It got extremely tedious, very quickly. So that was a little disappointing. \nCharacter Development:\nOnce again, my enjoyment of this book was more or less split down the middle, because I love Gandalf, Aragorn, Gimli, and Legolas. Tolkien does some excellent development, not only of the individual characters, but also of their relationships with each other. The friendship that develops between Gimli and Legolas is one of my all-time favorites – that’s how much this improved for me. Frodo, on the other hand, seriously needs a personality. He’s literally the most boring and entirely uninteresting characters that I’ve ever read. The only thing that made his part of the story interesting was that we get to learn more about Gollum, who actually IS an interesting character. I think he actually might be my favorite character in the series, because even though you’re not supposed to like him, at least he’s interesting to learn about. One thing I’ve realized about this series is that in spite of the fact that Sauron is one of the most iconic fantasy villains of all time, we know almost nothing about him. Having a good, well-developed villain is more important than I think a lot of people realize – many of my favorite books of all time gained that status because of the villains in them, and Sauron just isn’t developed at all. Even in movies, this is honestly what made a movie like The Dark Knight stand out in comparison to basically every other super hero movie ever made. It’s hugely lacking in this book.\nWorldbuilding & Prose:\nNo doubt about it, Tolkien’s books are so famous because he is without a doubt one of the best world builders of all time. Reading his books leaves me in awe at this guy’s mind, in every chapter we learn more and more about the history and lore of Middle Earth. It’s really, really cool to read. Just considering that Tolkien literally has volumes and volumes of books detailing the histories of Middle Earth can illustrate how complex this is, and these books only scratch the surface. Read this book if only to experience some excellent worldbuilding. \nIn Conclusion:\nIn spite of Frodo’s complete lack of personality, and my own personal lack of enjoyment during that entire part of the book, I really did enjoy reading this far more than the first one. There’s enough good here to really get yourself engrossed in the story, which is exactly what I want when I’m reading a fantasy book. I’ll hopefully be starting book three very soon =].\n\n“It's like in the great stories, Mr. Frodo. The ones that really mattered. Full of darkness and danger they were. And sometimes you didn't want to know the end… because how could the end be happy? How could the world go back to the way it was when so much bad had happened? But in the end, it’s only a passing thing… this shadow. Even darkness must pass.”\n\n"}, {"Review": "Quickie review: -This book contains my favorite non-fellowship character: Faramir. His family situation is dealt with more in the next book, but the fact that he turned out so good and fair, as shown in this book, makes me just love him. He is badass when necessary and wise when that is necessary, and generally gets to the point with only a minimum of the usual plethora of talk first.- There's one single named woman in this book, and that's Eowyn. She got short shrift in this book, much like Arwen does in the whole series, but at least her time is coming soon. - Ents! Compared to the movie, where Merry and Pippin basically have to manipulate the Ents into going to war against Saruman, the Ents decide all on their own, and pretty quickly too. - Battles. Helms Deep and Isengard were such small potato battles in this book. The movies definitely do them better justice, though it would have been awesome if they'd kept the Huorns in. :DI do love this book though. I love Rohan as a whole, and love the regiment at Osgiliath where we meet Faramir. The second half, with Frodo and Sam, drags a bit, but it's necessary. We can't just skip them. On to The Return of the King!"}, {"Review": "\"It's like in the great stories, Mr Frodo. The ones that really mattered. Full of darkness and danger they were. And sometimes you didn't want to know the end... because how could the end be happy? How could the world go back to the way it was when so much bad had happened? But in the end, it's only a passing thing... this shadow. Even darkness must pass.\"The second volume in The Lord of the Rings, The Two Towers focuses on the disintegration of the Fellowship, as Frodo and Sam go off on their separate journey towards Mordor whilst Merry and Pippin are taken captive by some Orcs. Meanwhile, Aragorn, Legolas and Gimli decide that they will attempt to pursue and rescue Merry and Pippin.As a child, The Two Towers was always my favourite movie, and I think I used to say it was my favourite book too, but as I've gotten older my favourite movie is now The Return of the King. I'm still unsure as to whether my favourite book will change as well, we'll soon see! I loved this reread though, there's so many great quotes and events jammed into The Two Towers, but I do have my complaints too.Firstly, the positives! My eyes brim with proud tears as I reflect over how Aragorn has grown - it is in The Two Towers that he really starts to demonstrate his leadership skills at the Battle of the Hornburg. You can quite literally see me standing at the sideline waving my huge Aragorn flag. MAKE THIS MAN KING. I fear that every LOTR review will basically just be me rambling on how about how much I love Aragorn, but the heart wants what it wants.Another positive - in the second half of the book we get so much Gollum and that greatly pleases me. He is such an incredible character that no scene can possibly be boring when he's there. He cracks me up by how he constantly refers to Frodo as the good master, whereas Samwise is the nasty one! We've already observed how strong and brave Samwise is, and that's built upon in this volume, where at times he literally carries and drags Frodo onwards in their journey. Also *potential spoiler alert* the scene where he thinks Frodo is dead and decides that he'll carry on with the mission of destroying the ring... MY HEART. Samwise just wants to be at home with his feet up, but here he is, with the whole weight of Middle Earth on his shoulders.Also, young Johann was a complete moron. I used to complain all the time about how much I hated the Ents and how those chapters were so boring that I wanted to cry. It's strange to observe how your reading tastes change as you get older, because I was ALL OVER those chapters this time around. The Ents are awesome! You also can't talk about The Two Towers without referring to Shelob's lair. I find that chapter so uncomfortable and unsettling to read, because... spiders, man. But the tension and dread that Tolkien builds is terrifying. I guess my main problem with this book is the separation of the two storylines into Book 3 and Book 4. I mean, we don't get to see what Sam and Frodo are up to until halfway through, and then that also means we don't get to check in with Aragorn etc for the remainder of the book. I personally am not a fan of this, I'd rather we moved back and forth between the two storylines, because I start to miss characters when I don't get to see them for a while. And dare I say it, but it meant the second half of the book can slightly boring at times... it's just Sam and Frodo walking basically - but thank god for Gollum!If you had to force me to chose, I would perhaps rank The Two Towers over the Fellowship. I think. Gah, this is too difficult! But I'm really intrigued to see how I feel after my reread of Return of the King. This one, however, gets 5 stars out of 5! It's sad that my journey through Middle Earth is coming to an end soon, but we can always go back, can't we?"}, {"Review": "I love the LOTR books and there are no words I can use to describe the beauty of the prose and the beautiful, absolutely stupendous wordplay that's been used to create life like imagery. Seriously, there is a reason why LOTR series is considered the finest work of the 20th century. There is no parallel to it. It has inspired generations of writers and will continue to do so for many centuries to come. Before I get to my favourite phrases from Book 4 and 5 or ‘The Two Towers’, a few lines about the story so far:A company comprising men (Aragorn, Boromir), elf (Legolas), dwarf (Gimli), wizard (Gandalf) and hobbits (Frodo, Sam, Pippin, Merry) has started from Rivendell for Mordor with one purpose in mind: to destroy the dark lord Sauron’s ring. However, first Gandalf and then Boromir are lost to them and then as fate would have it, their journey is waylaid by a cruel army of Orcs called the Uruk-hai.Despite being outnumbered, the company decides to fight. It is at this time that Frodo, the ring bearer, decides to leave the others, and make this perilous journey on his own, but he hasn’t gone far when he realises that his servant, Samwise, has followed him, so has Gollum to whom the ring previously belonged. Will they be able to make it to Mordor or perish mid-way? Will Frodo be able to destroy the ring of power or succumb to its charms? Will Samwise stay true to his master till the end and be able to protect him from the devilry of Gollum or not? With Gandalf gone, the others are now under the charge of Aragorn who has his own challenges to face. For starters, the Uruk-hai have taken Merry and Pippin as prisoners and they must now be rescued before they are presented to Saruman, a wizard who has his stronghold in Isengard and is perhaps acting at the behest of the dark lord. Isengard needs to fall but Aragorn and his companions cannot do it alone. Will he have help from the others? How will he do it?Some of my favourite phrases from these books:*My heart speaks clearly at last: the fate of the Bearer is in my hands no longer: Aragorn*There is some will that lends speed to our foes and sets unseen barrier before us: a weariness that is in the heart more than in the limb: Aragorn* 'And ere morning it will be in the East,’ said Legolas. ‘But rest, if you must. Yet do not cast all hope away. Tomorrow is unknown. Rede oft is found at the rising of the Sun.'*'I would cut off your head, beard and all, Master Dwarf, if it stood but a little higher from the ground,' said Eomer.* 'Halflings!’ laughed the rider that stood beside Eomer. 'Halflings! But they are only a little people in old songs and children’s tales out of the North. Do we walk in legends or on the green earth in the daylight?''A man may do both,' said Aragorn. 'For not we but those who come after will make the legends of our time. The green earth, say you? That is a mighty matter of legend, though you tread it under the light of day!'*Uruk-Hai'But what are we going to do at sunrise?’ said some of the Northerners.'Go on running,’ said Ugluk. ‘What do you think? Sit on the grass and wait for the Whiteskins to join the picnic?'*There might be all the difference between an old cow sitting and thoughtfully chewing, and a bull charging; and the change might come suddenly.*'We have journeyed a long way round,’ said Legolas. ‘We could have all come here safe together, if we had left the Great River on the second or third day and struck west. Few can foresee whither their road will lead them, till they come to its end.’‘But we did not wish to come to Fangorn,’ said Gimli.‘Yet here we are- and nicely caught in the net,’ said Legolas. ‘Look!’*Gandalf to Aragorn (about Sauron): That we should wish to cast him down and have no one in his place is not a thought that occurs to his mind. That we should try to destroy the Ring itself has not yet entered into his darkest dream.* ‘Dawn is not far off,’ said Gamling, who had now climbed up beside him. ‘but dawn will not help us, I fear.’‘Yet dawn is ever the hope of men,’ said Aragorn.*‘You rascals, you woolly-footed and wool-pated truants! A fine hunt you have led us! Two hundred leagues, through fen and forest, battle and death, to rescue you! And here we find you feasting and idling–– and smoking! Smoking! Where did you come by the weed, you villains? Hammer and tongs! I am so torn between rage and joy, that if I do not burst, it will be a marvel!’‘You speak for me, Gimli,’ laughed Legolas. ‘Thought I would sooner learn how they came by the wine.’‘One thing you haven’t found in your hunting, and that’s brighter wits,’ said Pippin, opening an eye. ‘Here you find us sitting on a field of victory, amid the plunder of armies, and you wonder how we came by a few well-earned comforts!’‘Well-earned?’ said Gimli. ‘I cannot believe that!’*‘The treacherous are ever distrustful,’ answered Gandalf wearily.* 'It a greater honour to dangle at your tail, Gandalf,' said Merry. 'For one thing, in that position one has a chance of putting a question a second time. Are we riding far tonight?'* I wish there was a clear path in front of us: then I'd go on till my legs gave way: Frodo Baggins*We only wish to catch a fish so juicy-sweet: Gollum*'We are famisshed, yes famisshed we are, precious,' Gollum said. 'What is it they eats? Have they nice fisshes?' *I suppose it's no good asking \"what way do we go now?\" We can't go no further-- unless we want to ask the Orcs for a lift: Frodo*What's more, if you turn over a new leaf, and keep it turned, I'll cook you some taters one of these days: Sam to Gollum*'I don't like anything here at all,' said Frodo, 'step or stone, breath or bone. Earth, air, water all seem accursed. But so our path is laid.''Yes, that's so,' said Sam. 'And we shouldn't be here at all, if we'd known more about it before we started. But I suppose it's often that way. the brave things in the old tales and songs, Mr Frodo: adventures, as I used to call them. I used to think that they were things the wonderful folk of the stories went out and looked for, because they wanted them, because they were exciting and life was a bit dull, a kind of a sport, as you might say. But that's not the way of it with the tales that really mattered, or the ones that stay in the mind. Folk seem to have just landed in them, usually-- their paths were laid that way, as you put it. But I expect they had lots of chances, like us, of turning back, only they didn't. And if they had, we shouldn't know, because they'd have been forgotten. We hear about those as just went on-- and not all to a good end, mind you; at least not to what folk inside a story and not outside it call a good end. You know, coming home, and finding things all right, though not quite the same-- like old Mr Bilbo. But those aren't always the best tales to hear, though they maybe the best tales to get landed in! I wonder what sort of a tale we've fallen into?'*Summary of the story as per Treebeard: ‘By root and twig, but it is a strange business: up sprout a little folk that are not in the old lists, and behold! the Nine forgotten Riders reappear to hunt them, and Gandalf takes them on a great journey, and Galadriel harbours them in Caras Galadhon, and Orcs pursue them down all the leagues of Wilderland: indeed they seem to be caught up in a great storm. I hope they weather it!’"}], "Image": "https://images.gr-assets.com/books/1298415523l/15241.jpg", "Desc": "The Fellowship was scattered. Some were bracing hopelessly for war against the ancient evil of Sauron. Some were contending with the treachery of the wizard Saruman. Only Frodo and Sam were left to take the accursed Ring of Power to be destroyed in Mordor–the dark Kingdom where Sauron was supreme. Their guide was Gollum, deceitful and lust-filled, slave to the corruption of the Ring. Thus continues the magnificent, bestselling tale of adventure begun in The Fellowship of the Ring, which reaches its soul-stirring climax in The Return of the King."}