{"Genre": "Fantasy", "ID": "100915", "Name": "The Lion, the Witch and the Wardrobe", "Reviews": [{"Review": "This is the first book where I chronicled my thoughts as I read through it with my son. I don't know how easy it is for y'all to access the record of those here on Goodreads, but if you're looking for a detailed account of my thoughts on the book, you can look there.I'll say this. I've read a lot of books to my little boy these last couple years, and I can honestly say that This book is among the best. Good, tight writing, good description. Good action. Also there's not a lot of dead space or trashy empty dialogue that just seems to be there to take up space. (That's become a particular peeve lately. And when you're reading a book aloud, it becomes really obvious.) The British slang will be a stumbling block to some. But it's not too bad. And there were a few slight pieces of sexism that I ignored, skipped over, or re-worded on the fly. But honestly, this book was written 60 years ago, and you need to cut it a little slack because of that. And in my opinion, it only needs a little slack. Truth be told, I've read books written this year that have ten times the sexism this one does. Also, I'd like to make it clear that this is the FIRST book of the Narnia Chronicles. This is where you start the series. I'm sorry if you read them in the wrong order, but if you did, it's better than you admit it now, come to grips, and move on with your life knowing the truth."}, {"Review": "\n“If ever they remembered their life in this world it was as one remembers a dream.” \nThe real world is boring; it’s mundane, unimaginative and dry. So humans create fantasy as a means of escape. We watch movies or go to the theatre to see something more interesting than the standard realities of the everyday. We paint pictures and gaze up at the stars. We play video games and roleplay. We dream. Authors like C.S Lewis and J.K Rowling show us this miserable world; they show us its tones of grey. Then underneath it all they reveal something spectacular: they reveal fantasy. So we have four rather ordinary children about to embark on an extraordinary adventure. As a child I used to always daydream. I’ve always been somewhat introverted and would prefer imagining faraway places than existing in the now. I still do this as an adult. And this is why I love fantasy so much because it is so immersive; it literally takes my mind away. Lucy, Susan, Edward and Peter are the lucky ones. When they stumble across the wardrobe, the gateway into a more interesting realm, they experience something spectacular. “She did not shut it properly because she knew that it is very silly to shut oneself into a wardrobe, even if it is not a magic one.” Sure, there’s a war going on. And, certainly, there’s an evil witch going around murdering people. But, for me, that’d be a price worth paying. For in Narnia there is also Aslan and a whole bunch of interesting characters. There is hope, magic and companionship. The wise old Aslan though is the star of the show. He sacrifices himself for his friends, for his people. Though one issue I have with the book, and one that makes me very much aware of the text as a construct, is the questions over why Aslan actually needed to the four children. He pretty much deals with the problems by himself. There’s prophecy involved, but on a plot level he clearly could have sorted this mess out without any outside interference. I’ve seen a lot of hate over these books because of the Christian allegories involved in the storytelling. Now I find this somewhat stupid. I’m not a Christian, far from it, but you can’t really criticise a book because of this. It’s incredibly naïve. It would be like judging Jane Eyre  based on its feminism aspects or Shakespeare’s exploration of colonialism in  The Tempest. It’s silly. This book is, undeniable, full of Christian dogmatism. But it’s what the author wanted it to be. If you read Tolkien’s work there are so many allusions the world wars; this doesn’t affect the overall storytelling. It’s simply what is there. Read this with an open mind, as an English Literature student, I read the bible. I don’t believe the words inside, but I can still enjoy the experience. And this story is no different. Take it for what it is. “Wrong will be right, when Aslan comes in sight,At the sound of his roar, sorrows will be no more,When he bares his teeth, winter meets its death,And when he shakes his mane, we shall have spring again.” And that’s something special. I do, however, much prefer the works of Tolkien. I feel that his writing is more universal in terms of age audience. With this though, I’m very much aware of it as a children’s book. The prose is designed to sound like a children’s bedtime story in places. That’s not exactly a bad thing though. I love Narnia but I can, at least from my perspective, objectively say that Tolkien was a better writer. Though what Narnia does have is Aslan. It’s hard not to Aslan. Wouldn’t it be just wonderful if he met Gandalf? Could you imagine the stories those two could share? I'm dreaming again."}, {"Review": "My greatest disappointment in 'The Screwtape Letters' was that Lewis was not able to demonstrate what made his good people good or his bad people bad. The closest he got to defining goodness was that you could tell the good people from the vague aura of light that surrounded them--and which even shone in their cat. In this book, the cat is much bigger.Aslan had no character, he was just a big, dull stand-in. Lewis often tells us how great he is, but never demonstrates what it is that makes him great or impressive. Sure, he helps the kids, but all that makes him is a plot facilitator. He also has his big Jesus moment, but that has the same problem as the original: if he already knows that there will be no lasting negative outcome, how much of a sacrifice is it, really?But then, Aslan isn't based on the original fig-cursing, church-rejecting, rebel Jesus, but the whitewashed version. Like Mickey Mouse, Jesus started out as an oddball troublemaker with his fair share of personality, but becoming the smiling face of a multinational organization bent on world domination takes a lot out of a mascot, whether your magic castle is in California or Rome.Such a visible figure must become universally appealing, universally friendly and loving, lest some subset of followers feel left out. And it's this 'Buddy Christ' tradition from which Aslan springs. Devoid of insight, wisdom, or charm, Aslan is just here to do all the things that our protagonists can't do.This also beggars the question: why didn't Aslan just take care of all this stuff long before the kids arrived? Why did all the animals and fairies and giants have to suffer the pain of an endless winter? We're never given any good reason Aslan had to wait for the kids--since in the end, he does it all on his own, anyways. Sure, Lewis mentions something vague about a prophecy, but in fantasy, prophecy is always a bandaid authors stick over their plot holes: 'Uh, the shlubby nobody is a hero because the prophecy says he is--he defeats the ultimate evil because the prophecy says he can'. The only thing the kids do is help run the battle, but this is only necessary because Aslan is absent, and he's only absent because the kids screwed up, meaning the entire thing would have gone off without a hitch if they had never showed up in the first place.In that regard, I have to say Lewis did an excellent job boiling down Christianity into a fable, and leaving the problem of evil completely intact. Some readers suggest that Aslan lets the queen take over to teach the kids a lesson, but is it really worthwhile to let all the inhabitants of a kingdom suffer a century of misery just to teach a few kids about the true meaning of friendship?The villain is just as poorly-constructed, and seems less concerned with defeating her enemies than with being pointlessly capricious. She manages to trick one of the children, but instead of taking advantage of this fact, she immediately makes it clear that she tricked him. I mean, how did someone that incompetent take over in the first place?Selectively stupid characters are silly and convenient, especially as villains, because this completely undermines their role as foil. It is impressive when characters overcome challenges, but not when challenges simply crumble before them. The children are lucky the Queen was more of a fart-stealing Old Nick than a Miltonian Satan, otherwise they never would have stood a chance.It is interesting to look at how many Christian authors have tried to reconcile their faith with complex fairy mythologies; not that Christianity doesn't have its own magical fairy tales, but these other traditions are not exactly compatible. Dante has Virgil lead him through hell, the Buddha was made into a saint, holidays were given new meanings (even if they often kept old symbols and names), and magical monsters were also given a place in the new faith.In the Middle Ages, monks compiled 'Bestiaries', which described the roles of dragons, unicorns, and real animals in Christian synbolism; there were even century-spanning debates about whether dog-headed men were descended from Adam. These books were rarely accurate, but allowed Christian theology to adopt many stories and superstitions from earlier periods; for instance, the connection between unicorns and virginity or the belief that pelicans fed their own blood to their young, in imitation of communion.So Lewis' attempt to take myth and adapt it to a Christian cosmology is hardly new--there is a long and storied tradition explored throughout the Chivalric period and recognizable today in books like The Once and Future King, but Lewis doesn't do a very good job of reconciling these disparate mythologies.Like most Protestants, Lewis' religion was a modern one--not magical and mystical, but reasonable and utilitarian. He did not draw on the elaborate, convoluted apocrypha of hallucinatory monsters and miracles that mystics obsess over, instead, he made a small, sane, reasonable magical world--which rather defeats the point. It is unfortunate that many of today's readers think of Lewis' writings as defining English fairy tales, since his late additions to the genre are not original, nor are they particularly well-executed examples.Many authors have come to the genre with much more imagination, a deeper sense of wonder, and a more far-reaching exploration of magic. We have examples from Kipling, Lewis Carroll, Dunsany, Eddison, Morris, and even modern updates by Gaiman and Clarke. Lewis, like Tolkien, may be a well-known example, but both are rather short-sighted, and neither one achieves as much as the many talented authors who came before.I'm not saying Lewis is bad, merely that he is unremarkable, and is hardly preeminent in fantasy, or even in children's fantasy. However, I do think his fundamental message is a bad one, even if he didn't realize he was creating it. In all his worlds, all his stories, he takes the sorts of people he dislikes, defines them as 'evil', then sets himself apart from them. There is no attempt to comprehend or to come to mutual understanding. I cannot respect a book which encourages people to vilify what they don't understand and to call isolation righteous. If any worldview deserves the epithet of 'evil', it is the sort of willful, prideful, self-indulgent ignorance Lewis displays.My List of Suggested Fantasy Books"}, {"Review": "\n\n“Lucy looks into a wardrobe”\n\nI was feeling rather nostalgic this holiday season for some reason, and I thought what better way to pay homage to my childhood than by rereading The Lion, the Witch and the Wardrobe for the first time in a very long time! And, friends, I fell so in love. I actually think I’m going to make it a holiday tradition to read this book every single December for the rest of my life. And it was so funny, because I was very apprehensive going in, because when I was little, I think the religious themes went over my head, but I didn’t know how overbearing they would be reading this story for the first time as an adult. But it honestly wasn’t too much. I mean, some of the characters in Narnia refer to the kids as “Son of Adam” and “Daughter of Eve” and like I get the parallels with Aslan and Jesus now! But I still think it was very thoughtfully done and didn’t pull me out of the story or anything like that. But if you are unfamiliar with this beloved children’s tale, this is a story about four children who have been recently adopted by an old professor who lives in a massive house. And one rainy day, while the kids are bored, they decide to explore the house that is now their new home. And the youngest of the children find a portal to a magical land, ruled by the White Witch, who is causing an endless winter. ➽ Lucy - The Best Character.➽ Edmund - What A Little Shit.➽ Peter - Good Guy.➽ Susan - Group Mom.➽ Aslan - Simba Who? ➽ Tumnus - Second Fave, Even Though He Almost Kidnapped My First Fave.But there was so much that I forgot about this story: Mr. Beaver poppin’ open a cold one at dinner, Tumnus almost kidnapping Lucy, Everything the professor says to the kids and how he helps them, Edmund being the such a little shit that even my patience was getting tested, Turkish Delights, Father Christmas, and him giving the kids weapons as gifts! Overall, this was just the perfect winter wonderland to me. From closet, to lamppost, to dam, to forest, to castle, I never wanted to leave this adventure. I am not sure if it is a lot of nostalgia talking, but this was maybe the best thing I read all holiday season. It was exactly what I wanted, and I was truly enthralled from the first to last page. I never wanted to leave this endless Winter. Blog | Instagram | Twitter | Tumblr | Youtube | TwitchBuddy read with Julie from Pages and Pens! ❤"}, {"Review": "\nOne day, you will be old enough to start reading fairytales again.\nIt's like C.S. Lewis was speaking to me. I never read these as a child but now that I'm in my mid-twenties, I'm feeling the urge to visit all those childhood classics I never read. And I'm so glad I did. \nPeter did not feel very brave; indeed, he felt he was going to be sick. But that made no difference to what he had to do.\n Four siblings on a rainy day play hide-and-seek. The youngest discovers an incredible secret in the back of the old wardrobe in their uncle's house. After a fair amount of convincing, she and her three siblings set out to explore and are soon whisked into the land of Narnia.\nNarnia! It's all in the wardrobe just like I told you!\nCould you imagine a more magical world? I've watched the movie as a kid but reading the book? It's 110% better. The amazing characters - from Mr. Tumnus to the White Queen - just tie this story together. Unforgettable.Audiobook CommentsRead by Michael York and this was a pleasure to listen to. I felt like a little kid being read to!Blog | Instagram | Twitter"}, {"Review": "5 stars to C.S. Lewis's The Lion, the Witch, and the Wardrobe. Adored it. I must have read it three or four times as a child. Hits all the spots in my reading dreams. a forest. A large family. Talking animals. Secrets. Mystery. Drama. Hidden messages. Saga and series. Every child should read it.Imagination runs free here. 4 children stuck a house. 1 goes exploring and finds herself lost in the world of Narnia. And the rest follow her.Siblings fight. The book shows what happens when you don't listen to one another.Aslan, the hero lion, helps show what sacrifice is all about. Good stuff.I spent many a days looking for the secret world hidden somewhere in my closets. While I never actually transported to another world, this book is like its own Narnia - a transport into something magical."}, {"Review": "I loved this book.It was first read to me in 4th grade. We would all come in from lunch and our teacher would read to us for about 30 minutes before we would start class. I remember this book because it wasnt read to us by Mrs Graham, but instead it would be read by Mr Goodwin, her long-haired, bearded, Birkenstock wearing teacher's aid.  Over the next few weeks we were enthralled by this story, we couldnt wait for lunch period to be over so we could hear what was happening in this magic kingdom, called Narnia. From the begining we all identified with Lucy and her siblings. How was it possible that an English girl could transport herself to another place, simply by hiding in a wardrobe? And once through the wardrobe, there was this wonderful and friendly creature called a faun, Mr Tumnus. All this in only the first chapter. As the chapters progressed we got to know more about the siblings and the other creatures who inhabit Narnia. Some people critisize C.S Lewis for using too much Christian symbolism, but I was in 4th grade and to me this was the most wonderful and exciting book ever written for children.  When Mr Goodwin finished the book. I instantly went to the library so I could read it myself. I was very proud this was the first book I read \"without pictures\". To my joy, I discovered there were other books about Narnia and I eventually read all of them too. Evenutually I discovered other wonderful places in other books and I continue to look for them today. I will always be grateful to Mr Goodwin, he started off by telling me about Narnia, but in the end, he introduced me to so much more through my on going love of books. Thank you Mr Goodwin, for everything."}, {"Review": "What are you doing on that wardrobe? Narnia Business!!I read this book as a book challenge and adored it. I had not read this book before and did not know of its existence as a child. I would have loved it even more then, I imagine. Four English children, removed from London for their safety during WWII, are sent to a country manor to live with a professor. Lucy is the first to enter the wardrobe and be transported into the secret world of Narnia. There she meets a talking faun who eventually warns her about the white witch who keeps Narnia in a constant state of winter. A human’s presence in Narnia is threatening to her and the animals are under orders to inform her at once. Once back home, she informs her siblings who do not believe her until they too eventually enter the wardrobe and the world of Narnia.Narnia is full of talking animals, magic, and the loathsome witch who turns animals into stone statues if they do not do as she pleases. With the help of a Beaver couple, they escape in time and get to meet Aslan, who teaches them true bravery, sacrifice and teamwork.This is a great fantasy book for both children and adults alike. Suspension of belief and a desire for entertainment is all one needs to enjoy this book. The illustrations are precious and go perfectly with the story."}, {"Review": "What's it with British literature? How from a relatively small pool of population can such creative writers emerge? I don't like C.S Lewis's non fiction books, but here he knocked the ball out of the park.Aslan, whose antics and decision making and beliefs are difficult to map, is the way by which the children triumph. If Alice in Wonderland was positively secular, TLTWaTW is heavily defined by the Christian mythos.There are many shining examples of pause to let the tension play out, before a little more of the adventure is revealed. Curiously, along with wonder, it is with the realization that I read this book. It's very much Anglo Saxon in nature, yet it lends itself to translation so easily. It's a book that does not belong to any age, decade, or era. It's a little wonder of writing. The figures agree with me: This book is apparently one of the top 10 bestselling books of all time."}, {"Review": "The Lion, The Witch, The Wardrobe (Chronicles of Narnia, #1), C.S. LewisThe Lion, the Witch and the Wardrobe is a fantasy novel for children by C. S. Lewis, published by Geoffrey Bles in 1950. It is the first published and best known of seven novels in The Chronicles of Narnia (1950–1956). Among all the author's books it is also the most widely held in libraries. Although it was written as well as published first in the series, it is volume two in recent editions, which are sequenced by the stories' chronology (the first being The Magician's Nephew). In 1940, four siblings – Peter, Susan, Edmund, and Lucy, whose surname we will learn in a later book is Pevensie – are among many children evacuated from London during World War II to escape the Blitz. They are sent to the countryside to live with an old professor, later to be named Digory Kirke. Exploring the professor's house, Lucy finds a wardrobe which doubles as a magic portal to a forest in a land called Narnia. At a lamppost oddly located in the forest, she meets Tumnus, a faun, who invites her to tea in his home. There the faun confesses that he invited her not out of hospitality, but with the intention of betraying her to the White Witch. The witch has ruled Narnia for years, using magic to keep it frozen in a perpetual winter. She has ordered all Narnians to turn in any humans (\"Sons of Adam\" or \"Daughters of Eve\") they come across. But now that he has come to know and like a human, Tumnus repents his original intention and escorts Lucy back to the lamppost. ...تاریخ نخستین خوانش: سال 2002 میلادیعنوان: ماجراهای نارنیا کتاب نخست: شیر، کمد، جادوگر؛ نویسنده: سی. (کلایو) اس. (استیپلز) لوئیس؛ مترجم: امید اقتداری؛ منوچهر کریم زاده؛ تهران، انتشارات ایران، 1377؛ در 218 ص؛ شابک: 9646038085؛ چاپ دیگر: هرمس، 1379، در 166 ص، چاپ بعدی 1382؛ در 169 ص؛ شابک: 9647100116؛ چاپ سوم 1384؛ موضوع: داستانهای نویسندگان انگلیسی برای نوجوانان - قرن 20 معنوان: شیر ساحره و کمد لباس؛ نویسنده: سی. (کلایو) اس. (استیپلز) لوئیس؛ مترجم: پیمان اسماعیلیان خامنه؛ تهران، قدیانی، بنفشه، 1386؛ در 236 ص؛ شابک: 9644178505؛ چاپ بعدی 1392؛ در 238 ص؛ شابک: 9789644178504؛عنوان: ماجراهای نارنیا 1: شیر و کمد و جادوگر؛ نویسنده: سی. (کلایو) اس. (استیپلز) لوئیس؛ مترجم: فریبا کلهر؛ تهران، پنجره، 1387؛ در 168 ص؛ شابک: 9789648890846؛ شیر، کمد و جادوگرعنوان نخستین جلد از سری هفت رمان سرگذشت نارنیاست. لوئیس برای نوشتن رمانهای این مجموعه، از شخصیت‌ها و ایده‌ هایی از اساطیر یونان و روم و همچنین از افسانه‌ های کهن بریتانیا و ایرلند سود برده‌ است. نارنیا دنیایی ست که در آن حیوانات سخن می‌گویند، جادو امری رایج است، و خوبی به جنگ با بدی می‌رود. داستان آفرینش نارنیا در روز نخست: با آواز اصلان شیر، و سخنگو شدن حیوانات با جادوی او، در کتاب خواهرزاده جادوگر، و داستان پایان آن در کتاب آخرین نبرد آمده‌ است. اما ماجراهای سرزمین نارنیا، انگار برایم همان داستانهای دل انگیز هزار و یک شب هستند. چند سال پیشتر این مجموعه را دو بار خواندم. مرا نیز نوجوان کرد، سرشار از خیال و دلشوره، برای ماجراجوئی. شاید راز ماندگاریش نیز، که هم اکنون یکی از آثار کلاسیک ادبیات انگستان به شمار است، همین باشد. زنده کردن خیال، تعلق داشتن به یک سرزمین، تلاش برای پیروز شدن رویاهای نیک . ا. شربیانی"}, {"Review": "A Defence of C.S. Lewis...or a brief attempt at suchSome thoughts recently crossed my mind in regards to arguments one could offer as a defence of the Christian side of this novel. The main arguments against this novel as a 'Christian allegory' that I have heard are: 1)Aslan is not a strong Christ-figure 2)That C.S. Lewis 'preaches' a black and white morality. So I'm going to roughly address them from my perspective and hope it encourages some discussion.1) I will agree that Aslan is not a strong Christ-figure. Firstly for Aslan to really represent Christ he would have to be true to the gospel story. In other words he would have to be god made into man come to die for all mankind. However as he only dies for the one traitor again it's not sticking true to the Biblical gospel that all have sinned and that Christ was needed as a sacrifice for that sin. If you take things too literally here, C.S. Lewis' novel doesn't make much that much sense theologically as a result. I'll explain where I am/was going with that in a moment.2) I debate that C.S. Lewis preaches in his novel. Occasionally he can be a touch patronising but compared to many authors he rarely slips into such condescension. As for his morality I think you must understand it from the perspective of Christianity. Christianity is about black and white morality essentially: good versus evil, light vs. dark and truth vs. lies etc. It is also very grey in that Christianity is about life and the fact that no one is perfect, that everyone fits into that moral grey area. Of course I explain roughly and inadequately.Ultimately I see that there is room to argue that C.S. Lewis does a poor job of writing an allegorical novel. However I see it as a very subtle novel that unlike others (for instance The Alchemist) does not build its story around expressing an ideology but rather incorporates an ideology into its storytelling. I think that if one wants to criticise this novel it should be for not properly showing the gospel rather than for 'preaching'. I know that I and many others enjoyed the story first before seeing the connection between it and the Biblical tales. I enjoyed it even more afterwards so, then again I could be a tad biased.Original ReviewTo begin I must note that I grant this such a high rating due to the impact it had on my life. It to me is one novel that were I to pick the one novel that forged a love of books for me it would be The Lion the Witch and the Wardrobe. Why? Because I can remember back about twelve years ago when I was homeschooled by my mother as a five year old. We wandered down during winter into the warm back room and she read the first Narnia book to us. The image of a red faun carrying parcels as he passed a growing lamppost would stick with me from that moment (as it stuck with C.S. Lewis). As I learned to read the Narnia books were the first novels I sunk my growing reading teeth into. And to this day I have read and re read the novels back to front (and maybe front to back).The Lion the Witch and the Wardrobe is a novel written for both children and adults. It contains highly allegorical elements as C.S.Lewis was a well-known apologetics writer. However he wrote that he did not write his novel as a pure allegory but as a story. And that is what The Lion the Witch and the Wardrobe is, a story to be enjoyed by everyone. And although written in simple language the reader can quickly, concisely and easily imagine the world without the clumsy constraints of overused words. I personally cannot imagine a world without these novels.Additional thoughts:1. Just a question at last. And one with a highly philosophical twist to it. Why is it that people so readily condemn those books which are considered as moral tales? You'd think we could do with more morality in such a twisted and confused world regardless of accepting the belief systems. 2. I have heard many people describe the entire series as silly and far too preachy. I do not see it that way at all. Trust me if C.S.Lewis wanted to be preachy he would have written a lot more philosophy and less story. Yes I can see how some would call this silly but then I argue that they are missing the point. It's a fairytale type fantasy intended mainly for children (and for those children again as adults or for their parents perhaps). But I argue that as Lewis only wrote this story based on the story of the crucifixion in many ways that it was not intended as a preachy book. My question is that why is it that if I were to base a story along what some call the 'Christian myth' it is claimed as preaching while as if I were to base it on any other mythology or story it would be deemed as merely copying the themes of another mythology? Is this yet another example of doublethink?**See 1984"}, {"Review": "Novels were not a part of my life until my mid teens and therefore I missed out wonderful reading experiences like the Chronicles of Narnia but while I wish I had read more as a child I am having an absolute ball catching up on all these enchanting books when I can appreciate them on a different levelimage: The Lion, The Witch and The Wardrobe is a compelling story that is both enchanting and filled with fantasy and adventure and I think can be appreciated by both adults and children alike.Writen by C.S. Lewis in 1950 for his god daughter Lucy, The Lion, The Witch and The Wardrobe is part of a book series which is known as The Chronicles of Narnia. Set in England during the Second World War and tells the story of four children who are sent to the country to stay with a wealthy, eccentric professor in large county house. While playing hide and seek in the many rooms of the house on a rainy day one of the children discover a Wardrobe and the fantasy and adventure begins.Beautifully written, intriguing even for someone like me with a low tolerance for fantasy. I was charmed with the setting, the atmosphere and the wonderful complex and charming characters I met along the way. I loved the themes explored in the novel and really enjoyed the reading experience as an adult."}, {"Review": "I just re-read this book and got so much more out of it than the first time. The symbolism & parallels to basic Christianity stuck out. *turkish delight is our human nature, prone to addiction, selfishness and wrongdoing*Peter said about Edmund, \"We should go after him. After all he is our brother.\" Even though he had just betrayed them and was causing grief they didn't mistreat or disown him. *The very mention of Aslan's name caused certain positive feelings to come over them all they didn't know why. But it made Edmund feel guilty.*After Ed was returned and his siblings saw him for the first time Aslan said, \"Here is your brother and there's no need to talk about what's in the past.\" They forgave their brother. Aslan neither excused him nor condemned him.*They all knew better than to go into a wardrobe & shut the door as the book mentions a whole bunch of times. We regularly do things when we know better.*The professor makes them think and questions their disbelief in Lucy's story. This is something the movie totally leaves out. \"Who would you usually believe, Lucy or Edmund?\" etc. Edmund shows the worst side of human nature, to betray & let others down.*I love that Father Christmas comes giving gifts that represent the gifts & talents we each have to help others with and to overcome evil with.There's more but I have to go! Loved the book. And the movie."}, {"Review": "The Role (bibli)call:The big cuddly cat = Jesus. Strange that a lion should be chosen to represent the big man when Lions are notoriously aggressive, solitary carnivores who are more likely to eat any potential apostles than than teach or lead them.The white witch = Satan or Eve the temptress depending on which side of the tree of knowledge you're most likely to be barking up. Famed for a monochrome wardrobe in the A/W line only. Like Alan Rickman in Robin Hood: Prince of Thieves, she has cancelled Christmas.Edmund = Judas Iscariot. Judas has been proven to be a more astute bargain maker and walks off with 30 pieces of silver for his denials. Edmund gets a box of sweets. Lucy, Peter, Susan = apostles, knights and other positive biblical forces. An unusual scenario given the general hoo-hah about whether or not any of apostles were female (see last supper male/female image debate).Mr Tumnus the faun = an aberration. With his goat like legs and general caprine features you might be forgiven for imagining that he might be an agent of Satan, or Pan or some other pagan deity. Nope. He's on the side of good and not evil and that there throws the nice set of biblical allusions into chaos.Beavers, birds, satyrs, fauns and other ancillary creatures = collateral damage.Plot summary: Icing sugar, picture perfect winter wonderland accessible through the rear of roomy wardrobe handily equipped with high-end (but non PETA approved) all weather garb. Ruled in supremely effective manner by single minded, highly organised, independent woman until arrival of children and large pet. Maybe this book is actually a metaphor for home life in the modern age."}, {"Review": "“Once a king or queen of Narnia, always a king or queen of Narnia.” The Lion, the Witch, and the Wardrobe is the second novel of C.S. Lewis series, The Chronicles of Narnia. Or it is the first novel, depending on the order you are reading them in. I am reading them in chronological order, instead of the order of publication. This novel is about four siblings, who unexpectedly discover an enchanting new world through a seemingly normal looking wardrobe. What adventures await for these children in this marvelous land?Just like in the Magician's Nephew I found myself transported into a warm, and highly imaginative land. I couldn't wait to discover the land of Narnia once again, and trudge through the endless days of ice and snow. I thought C.S. Lewis had a creative way of writing to his age group. He wrote in the perspective of a child leading through their imagination, where their only worry was an endless winter without Christmas. If there was an endless winter, I would be thinking ice age. The Lion, The Witch, and The Wardrobe brightens up my imagination, which I have forgotten with my dreary adulthood duties.The children were realistic with their thoughts and perspectives of life. I did find Digory and Polly from the previous book more enjoyable to read about, because I found them more clever than these children. Nothing, for me, made these children stand out. I hope the other books help that along.The one thing that aggravated me about this book was the scene were Aslan was giving the gifts to the girls. He gave each a weapon to protect themselves, but insisted that they stay away from the war. War was not a place for a woman. Excuse me? War affects everyone. It is just an outdated idea, and I literally glared at the page wishing it to burn. If only I was Carrie. I could do whatever a man can do. I'll beat you up, Aslan. With that insulting messages, I found myself digging deeper into characters. The one strong female lead was the witch, who was also evil. The message is subtle, but it leads to how woman should behave, and the plenty of stereotypes against strong woman in the world. Strong woman are unattractive, or any woman who is in a power position is a bitch. I also know that this was written in a totally different era, but it still doesn't make it right. It was a shameful message, and I couldn't for the life of me shake it off.The Lion, the Witch, and the Wardrobe is another magical, highly imaginative adventure through the land of Narnia. I can't wait to read the next novel, The Horse and his boy. Happy Reading. blog|new blog|instagram|twitter"}, {"Review": "“Once a king or queen of Narnia, always a king or queen of Narnia.” In this magical whirlwind of Narnia, four children – Lucy, Peter, Susan and Edmund all enter Narnia – a magical world where animals talk and the White Witch who reigns as Queen makes it always winter and never Christmas. They enter at different times, but from the same place – the old Wardrobe. Lucy enters first and encounters the Faun who is in the pay of the White Witch and tries to kidnap her. Edmund, who enters second, finds the White Witch and thinks she's kind and caring, only to later discover that she is a cruel, evil and untrustworthy woman. Susan and Peter enter together and find Lucy and Edmund. They all meet Mr. and Mrs. Beaver who invites them to lunch at their cottage. During lunch they realize that Edmund (who had fought and was angry with the other three) had left to join forces with the White Witch whom he believed would make him Prince. The Beavers along with the three children set off on a long and perilous journey to find Aslan – the King and Lord of Narnia – and rescue Edmund. Together, the children join forces with Aslan's army against the heartless and wicked White Witch.I simply loved how Lewis created the world of Narnia, a land of magical creatures and awesome adventure. Lewis describes his characters, writing about them in the form that children aged nine and above, and even adults would enjoy. I liked Lucy best because she is a curious, truthful and kindhearted girl whom I could relate to. This book taught me two important lessons; that looks can be deceiving and that two wrongs don't make a right. Lewis has a clear and vivid writing style, which makes it easy for the reader to follow and remain totally engrossed. My favourite part in the book was when Aslan was de-stoning the statues and everything came to life. It made me feel as if all the de-stoned animals were right there in front of me, beckoning me to join them. I now understand why The Lion, The Witch and The Wardrobe is a children's classic. It is a must read for us all!!!“Always winter but never Christmas.”"}, {"Review": "It dawned on me the other day that I'd never read The Lion, the Witch, and the Wardrobe. What an oversight! I had to fix this.I knew the story. When we were kids, one of my cousins was all about this book and liked to tell me about it. I remember absolutely bawling my eyes out when the 1979 cartoon version aired on tv and Aslan was subdued. And then I also knew it through the more recent movie adaptation. Now, having read the actual book, it turns out I already as good as read the book. It varies very little, especially from the most recent movie version. And why should it? It's simple, straight forward, short and with very little story-fat to trim off. The Lion, the Witch, and the Wardrobe is seriously a sleek book! There's barely any filler, just a straight forward narrative that takes you through the adventure. And what an adventure! This is the kind of story young dreams are made of! What impressionable young mind could not get caught up in a fantasy of monsters, magic, evil queens, heroic lions and more with boys and girls to follow into a mystical land, leaving behind the mundane?The only thing about the story that I could speak negatively about is its everything-and-the-kitchen-sink tossing in of whatever legendary beast Lewis could think of, plus, what the hell, let's throw in Santa Claus, too! African savanna animals, Greek mythological beasts and Old Saint Nick...sure, why not?! Maybe it wouldn't bug me as much if I didn't know that Lewis made fun of his friend Tolkien for writing fairy tales, and then he comes out with this, one of the most fanciful of fairy tales, where any manner of childhood fancy comes true. Bah, let's leave these sour grapes.I respect Lewis the writer and thinker. I've enjoyed reading and contemplating a variety of his works. And even at the advanced age of 43, I found myself sucked into this story. I may be over 30 years beyond the target audience, but I still found plenty to love about The Lion, the Witch, and the Wardrobe!"}, {"Review": "Well, can you blame me for loving this? I certainly hope not. It's Christmas and I feel like a little kid and I was craving something to make me feel like I am one, indeed, and this book travelled me to a wondrous world full of heroes and of course a villain. The ride was awesome and I found the characters warm and fuzzy despite the eternal cold that had been placed upon Narnia. Now, they're all free of the curse of the White Witch thanks to Peter, Susan, Edmund and Lucy. The kings and queens of Narnia.\n“Once a king or queen of Narnia, always a king or queen of Narnia.”\nThis is remarkable. It's amazing how short it is, I only read it in one and a half hour, I simply devoured it. It's short but so detailed and concentrated. It's like a fairytale. I'll certainly be reading this to my kids in the future. \n“I wrote this story for you, but when I began it I had not realized that girls grow quicker than books. As a result you are already too old for fairy tales, and by the time it is printed and bound you will be older still. But some day you will be old enough to start reading fairy tales again. You can then take it down from some upper shelf, dust it, and tell me what you think of it. I shall probably be too deaf to hear, and too old to understand a word you say, but I shall still be your affectionate Godfather, C. S. Lewis.”\n"}, {"Review": "After I first read this book as a young boy I remember distracting my father one day whilst he was working in his shed at the bottom of our garden. I was about 11 at the time and my father was filing away at something in the vice attached to the work bench. I spotted the pincers/pliers in his old wooden toolbox and secreted them away in my knitted cardigan, fashion was not a strong point back in the 1970's, and I sheepishly snook out without being noticed. That was the beginning of the adventure for an eleven year boy. When I got back to my bedroom I closed the door and went about removing the panel pins from the backing boards at the rear of my wardrobe. I remember it took what seemed to be an eternity and I froze every time I heard somebody on the landing outside my bedroom door. Waiting for my mother's voice enquiring what I was up to. It never came and I felt relieved and a great sense of accomplishment when the last pin was removed and I was able to step into my wardrobe and out the other side. I pulled the wardrobe slightly away from the wall and was able to trig the boards back in without them falling out. I had lots of fun inviting friends around after school and showing them that when I stepped into my wardrobe I disappeared into a portal and into a new world. When my friends opened the door all they saw was some clothes and the backboards. Of course the joke did not last long as children are inquisitive and found out eventually. We had so much fun pretending we stepped through my wardrobe into Narnia. The fun lasted for about two weeks before my mother found out and my father reattached the back boards. I remember as an eleven year old boy my imagination was so vivid. Children back then had so much fun creating characters and worlds. Today not so much in this digital world of game boys and mob phones etc. Reading books is all about expanding the mind, food for thought, and I yearn back nostalgically to those times. The films based on the books are great but, I personally think the book should be read first.🐯👍"}, {"Review": "Every time I read this story, I feel happy. I love fairytales and mythology and I believe this books is the perfect example of how fantasy, mythology and fairytales can be combined and create a strong result. 1. First of all there is obviously the “The Snow Queen” fairytale by Hans Christian Andersen, the ultimate evil woman whose myth is used in this book too. She brings cold and misery and never allows Christmas. She changes people’s heart and eyes. She freezes their hearts like block of ice, she makes their eyes to see only the bad and ugly in people and things. She will isolate and steal the little boy from his siblings. She will change him and make him taste the dark side and the betrayal. 2. Then, there is a combination of mythology by different cultures and countries. The faun, the centaurs, the Minotaurs from the greek and roman mythology. Faun can be met also in English mhthology as puck (William Shakespeare's play A Midsummer Night's Dream).3. Giants (\"Jack and the Beanstalk»), Ogres and Boggles from the Northumbrian and Scots.4. There are unicorns and werewolves with stories that can be found as far back as history has been written.5. There are the talking animals that we meet in so many old fairytales like Three Little Pigs Little and Red Riding Hood with the evil wolf (Brothers Grimm).6. Kings and Queens, Princes and Princesses that we meet in every fairytale and history telling.7. There is a touch of Alice in Wonderland (Lewis Carroll) where Lucy instead of falling through a rabbit hole into a fantasy world and following the rabbit, she goes through a Wardrobe and follows the faun.8.There is Santa Claus or Father Christmas (the traditional English name for the personification of Christmas) who brings useful gifts9. Finally there are so many children’s novels in 20th century where children meet strange magical creatures and change their life and their thinking (Five Children and It by E. Nesbit).The Lion, the Witch and the Wardrobe teaches children merits like personal sacrifices for the general good, friendship, love and commitment. And also it includes negative concepts like betrayal, deceiving and suffering. The good thing is that there is always time for a cup of tea..."}, {"Review": "What an amazingly delightful book! I regret not reading it earlier ** Before I begin, let me clarify that as I am not a Christian, I had no idea that this book was written by keeping the image of Jesus (as Aslan) in mind. I just came across this revelation on Goodreads, and it just added another layer to the story! The review below is written only by treating it as a fun-filled and action packed novel!I had seen the movie based on the book a couple of years ago, and had really loved it! On reading the book, I realized it's just an extention of the movie(Should have been the other way round, but then, the one which comes first usually forms the greater impression). I'm glad the scripwriters did not destroy the essence of the story, which is (though simple), a charming tale!Anyway, coming back to the story, it is about four adventurous children, who accidentally discover the magical world of Narnia behind a wardrobe in an old strange house. But all in not well in this magical land! It's under the reign of the evil queen -- the WHite Witch! Together with the help of a Magnificant Lion -- Aslan, the children go on to kill the witch and themselves become the Four Kings(and Queens!) of Narnia.Though lacking much plot twists, I loved it simply because it was so easy-flowing! I altually wished I had a naughty kid near me whom I could catch hold of and read the book aloud to! I would love to see his wide-eyed amazement when Lucy would open the wardrobe for the first time, see his dissapointment when Edmund would betray them, (view spoiler)[hear his sigh when Aslan would sacrifice his life, (hide spoiler)] and catch that gleeful smile when they would win the Battle!Maybe someday, sometime!P.S: I really liked the dedication. It read: \" My dear Lucy,I wrote this story for you, but when I began it I had not realized that girls grow quicker than books. As a result you are already too old for fairy tales, and by the time it is printed and bound you will be older still. But some day you will be old enough to start reading fairy tales again. You can then take it down from some upper shelf, dust it, and tell me what you think of it. I shall probably be too deaf to hear, and too old to understand, a word you say, but I shall still be,your affectionate Godfather,C.S.Lewis.\"\n Dear God, I hope I'm NEVER too old for fairy tales! \n"}, {"Review": "Going into the world of Narnia was like a dream. Exploring the new world and creatures and seeing it all through the eyes of these amazing characters was just the best time. Other than what was probably the biggest plot conveniance I've read since Harry Potter (view spoiler)[ Santa Clause showed up (for the first time in a lifetime), gave all the children swards, and bows, and a horn that can call help whenever needed, then flew off again  (hide spoiler)] this book was just amazing. It had such a sweet and well rounded ending that it honestly felt like a standalone. I almost didn't continue to the next one because it was such a satisfying ending but I just want to spend more time with these children and in this world. So, on to the next one!"}, {"Review": "This is one of those books that takes you to a land where you feel like you've come to this place many times before, it feels like home, you keep hugging this book, every time enchanted and when you return to your world.All you feel is MAGICAL. \"I wrote this story for you, but when I began it I had not realized that girls grow quicker than books. As a result you are already too old for fairy tales, and by the time it is printed and bound you will be older still. But some day you will be old enough to start reading fairy tales again.\""}, {"Review": "As wonderful, almost, as it’s prequel. So little to choose between them in terms of enjoyment, that it seems harsh one is 5⭐️ And this is only 4. Maybe it is simply because I read The Magician’s Nephew first. Either way this is still an excellent storyline with enjoyable (and hiss-able) characters, that cannot fail to leave a warm feeling in one’s heart. Without wishing to give the game away, even (view spoiler)[ the sneaky Edmund comes good in the end  (hide spoiler)]As I said in my review of the first book in the series, I had no intention of reading the Narnia Chronicles, but it looks like I am (2 in 2 days). So bring on the next (hmm I really will have to check out the films(?) )"}, {"Review": "I am tempted to give this book a zero but the idea of going through the wardrobe to another land is fantastic. Everything else, however, is not fantastic, including:The over-the-top Christian allegory.The complete absence of dramatic tension - the characters are static and the conclusion is foregone. There is nothing to keep you reading, to challenge you, or to even vaguely interest you.The writing is mediocre at best.The dialogue is mediocre at best.Awful book, it as if someone read Matthew through John, and then said these four gospels are good but it would take a master writer to retell them with talking animals and have it be worse to the point of complete boredom."}], "Image": "https://images.gr-assets.com/books/1353029077l/100915.jpg", "Desc": "They open a door and enter a world NARNIA...the land beyond the wardrobe, the secret country known only to Peter, Susan, Edmund, and Lucy...the place where the adventure begins. Lucy is the first to find the secret of the wardrobe in the professor's mysterious old house. At first, no one believes her when she tells of her adventures in the land of Narnia. But soon Edmund and then Peter and Susan discover the Magic and meet Aslan, the Great Lion, for themselves. In the blink of an eye, their lives are changed forever."}