{"Genre": "Fantasy", "ID": "9361589", "Name": "The Night Circus", "Reviews": [{"Review": "Contains some minor spoilers.I disliked this book, which means I ought to rate it one star, but it is not as awful as my one star shelf. One star books have to really repulse me to get that rating. The only redeeming thing about The Night Circus is that I didn't feel the one star compulsion to start a bonfire so I could properly dispose of it, hence two stars, but in this case it does not mean I enjoyed the book at all.From the Goodreads summary: \"But behind the scenes, a fierce competition is underway—a duel between two young magicians, Celia and Marco, who have been trained since childhood expressly for this purpose by their mercurial instructors. Unbeknownst to them, this is a game in which only one can be left standing, and the circus is but the stage for a remarkable battle of imagination and will. Despite themselves, however, Celia and Marco tumble headfirst into love—a deep, magical love that makes the lights flicker and the room grow warm whenever they so much as brush hands.\"The above is a series of filthy, filthy lies intended to make you part with your money. Did the person who wrote the description read the same book I read? Or did he get so bored that he fell asleep and was forced to wing it for a deadline? If that's the case, I feel for the poor guy since I fell asleep reading this a few times, but I don't forgive the lies.Lie Number One: \"A Fierce Competition\"What Actually Happens: Instead of reading about a battle of wits, ingenuity, and talent taking place on a magical field you get two slugs racing against each other... over the course of sixteen or so years. Yeah, all those extra years might kill the intensity, but think of the emotional investment you make in those slugs. You can bring your new born baby to see them and go again every year as the fierce competition between the two of them goes on and on and on and on and on... (view spoiler)[and on and on and on and on and on and on and on and on and on and on and on and on. (hide spoiler)] Your child will have a driver's license when the fierce competition is over.Lie Number Two: \"A Duel\"What Actually Happens: For a significant part of the story the two 'dueling' magicians are raised separately with no knowledge of one another. For ANOTHER significant part of the story only one magician is aware of who they are 'competing' against. By the time the magician who was unaware is finally brought up to date they have been collaborating on projects for years... Yes, you read that right. They never stand toe to toe in any sort of competitive sense. They build little attractions for the circus and sometimes they built them together, leaving gaps for the other to fill because they like each other's work. This is how they 'fiercely compete' during their 'duel.'Lie Number Three: \"Trained Since Childhood Expressly For This Purpose\"What Actually Happens: This sounds like a warrior toddler getting out of bed and doing push-ups (or the magical equivalent) every day for forever with the intent of search and destroy. In reality, they both have haphazard educations from sociopathic father figures* who never tell them a damn thing about the competition. They don't know what they're doing or how to play the game (and neither does the reader for most of the book). I believe this is because the author had no idea how to make them actually compete or what she was doing beyond establishing a lot of overly descriptive scene setting. The training is just education from two different schools of thought on the subject of magic. They're not given any idea of how to be the victor. It's an experiment, which is vastly different from training a warrior as this is made to sound.*The father figures are equally psychotic, suggesting that both of their philosophies are fundamentally flawed because they're both batshit crazy. One slices his daughter's fingers open over and over again to teach her how to heal herself, even smashes her hand to break her bones for a lesson, and the other does not know his ward's name until he is nearly an adult. Neither of them ever face any consequences for the things they do to the children or the many experimental children before them.Lie Number Four: \"Only One Can Be Left Standing\"What Actually Happens: Aside from the obvious (view spoiler)[happily ever after (hide spoiler)] ending the author works in, there's no reason that one of them has to die. The previous \"battle\" before this one (I'm sneering at that) lasted thirty-seven fucking years and only ended because one of the magicians committed suicide. There's absolutely no sense of urgency in this book. It moves at the languid pace my grandmother's overweight poodle used to meander around at, like there was no where to go and nothing to do. The author tries to force some urgency and pacing in by having both characters willing to lose the game so the other can win... but why? If you're playing a game of Monopoly with a friend (Monopoly might be too exciting a comparison to use here but lets work with it) and someone's going to need to commit suicide at the end of it then you... don't stop playing. You don't even have to sit at the board all day every day. You can come back once a year and make a fucking move. No one in their right mind would jump up and yell 'I shall die for you my dearest!' especially if you know your friend will jump up and say the same thing louder.I don't know what happens if no one commits suicide? Does someone self-implode from excess magic? We never find out anything substantial. We don't know how past competitions ended beyond that single one. The book is left open-ended so that the publishers can milk this monstrosity all over again if it sells well.Lie Number Five: \"Despite themselves, however, Celia and Marco tumble headfirst into love—a deep, magical love that makes the lights flicker and the room grow warm whenever they so much as brush hands.\"What Actually Happens: After many, many years of not knowing who the other magician is, Marco reveals himself to Celia. The author tells you sparks fly. Sparks do not actually fly because these two 'characters' are about as flat as they come. There's no resisting falling in love. They just decide to do it in true Edward/Bella/Twilight fashion. There's no \"deep, magical love\". The love story is next to non-existent. On top of that, Marco continues to see someone else for years after... why? I don't fucking know. But it's a big god damn deal because she goes nuts and disrupts some of the magic of the circus and allows Bad Things to happen.There's so many other things wrong with the book. There's intertwining timelines. We jump back and forth decades in time, vanish off into characters who are at first totally unrelated to the circus and then have minor roles later on. None of the core characters are well-developed and none of the relationships are even remotely worth reading about. I don't get why the book is set in the period it was set in. Social standards aren't kept up. Maybe it was more atmosphere? Maybe it was so that the author didn't have to deal with the people who would show up to debunk the magic of the circus.On that note, the magic was so obviously magic that I got annoyed. I feel slightly insane for typing that out, but hear me out. It's all supposed to be real magic done with a wink and a nod so people won't realize it's real magic. Turn a jacket into a raven and then grin and wave so people believe you just performed the best slight of hand ever. Of course, the tricks were too fantastical to be believed. The wooden animals on the carousel breathe... and no amount of great mechanics could have made that happen 100 plus years ago. There's ice gardens and foggy mazes made of clouds, fires that never EVER go out, no one in the circus or relating to it ages (minus kids), and circus tents set up by invisible people. Everyone in the circus assumes the set up is done by assistants... what? assistants they never see? Where are the circus people when the set up and packing happens? Where do they think the crew goes after? Really, Book? Really?All of this happened as a contest between two old men who do nothing but sacrifice the lives of children so they can have the satisfaction of being right about things that are \nnever. fully. described.\n One prefers things more obvious and in your face, the other is quiet and prefers a more book based education. Seriously? This was the propelling point for the entire novel?!The world building and magic rules also suck. Anything the author wants to have happen can happen with minor limits. The only reason to read this book is the lovely descriptions and abundant scene setting. I do not recommend it to people who like a good story, although if you're into abundant prose give it a whirl. It's kind of like reading a travel brochure while high as a kite.Edit: To anyone who has not read the book and might be making their decision to read/not read based on this review, I wanted to say many people I respect found more redeeming qualities in the book than I did. Here is one such review. Based on my experience, I still recommend reading sample chapters online first or a library trip."}, {"Review": "If I could trade places with anyone in the world, it’d be with someone experiencing this book for the first time.I feel like my life is just a series of intense obsessions because I'm pretty sure this book has just become one of my defining personality traits. I've stayed up reading it until the early hours of the misty morning, rugged up so tight in the story even my soul felt warm. I wish I could inject this story into my blood stream. My heart is literally swelling with so much love I don't even know what to do with all of it.\n“You may tell a tale that takes up residence in someone’s soul, becomes their blood and self and purpose. That tale will move them and drive them and who knows that they might do because of it, because of your words. That is your role, your gift.”\nThere is some kind of magic feeling about this book that I can’t explain with words. It was like sharing a four hundred pages moment that meant nothing but the closing of space, and left nothing but a memory you're not even sure wasn't a dream. This is the kind of book you remember when you close your eyes and bathe in the moment of a sunset. The spiritual equivalent of waking up to someone stroking your face with a petal. The story was like the color wheel. Everything was blended. I can tell you distinctly that it started with a challenge thirty years before. Two magicians masquerading around with such arrogance. And a Circus of Dreams. But then the mystery takes on a life of its own, slowly borning all around you and that’s when you get to the shades and hues, the unnamed colors and you can’t tell where it stopped being one color and started being the other.There were just so many twists and turns that your grip on reality and emotions leaves you. And it's like when you think there's gonna be another step but your foot just goes through thin air and your whole world drops out from under you for a second. \n“You think, as you walk away from Le Cirque des Rêves and into the creeping dawn, that you felt more awake within the confines of the circus. You are no longer quite certain which side of the fence is the dream.”\nIf the writing could take on a human vessel, she'd be wearing a haute couture dress and a princess tiara and running around a stone palace with sunlight and enough mirrors around to bask in the aesthetic glory. It was so beautiful that I was in a constant state of paralysis. I mean, it might have just been different symbols and concepts and scenarios but it was crazy how when brought up together, they had the power to twist emotions and make you cry or laugh or want to scream in frustration.I also loved the characters so much. They were all multifaceted and morally ambigous, giving you the impression of being a wispy shape that appears in the corner of your eye when you're wandering through the streets at night and that you can never quite make out when you look for it but still you wonder what it could have been. (except Widge & Poppet—they're the only pure thing left in this world and my heart is sucking both of them in with all the power of an anteater’s tongue.)I've honestly just gotten tired of waking up and immediately reflecting on the insignificance and impermanence of life, I want to go with them on a long train ride through Europe, following the circus from location to location, and occasionnally stoping at little cafés and eating at corner restaurants and spending nights together drinking on the balcony of a hotel room.\n“I would have written you, myself, if I could put down in words everything I want to say to you. A sea of ink would not be enough. But you built me dreams instead.”\nI've experienced 446 different shades of emotions reading this book but I can say without a shade of doubt that The Night Circus has just become one of my favorite books of all time.BLOG | TWITTER | INSTAGRAM"}, {"Review": "Five Things About THE NIGHT CIRCUS.Ordinarily when I do my recommendations, I do a “five reasons to read _____,” but I think opinions will be so divided on THE NIGHT CIRCUS that I think “things about” will be more useful.1. This novel is not what it says it is. Well, back page copy is always a weird thing anyway, as it’s not written by the author. And a weirder thing because it is essentially a glamour shot of the novel. It is not a lie. But it isn’t really what the novel looks like when it’s wandering around in its bathrobe getting coffee and trying to figure out if that smell is coming from the kitchen sink disposal or under the table. The resemblance is always a bit sketchy. THE NIGHT CIRCUS’ resemblance to its cover copy is sketchier than most.2. This novel is about a thing. It has people in it, too, but it is mostly about a thing, the eponymous circus. It’s told in third person omniscient, which means it sounds like God is narrating the thing, if God decided he really loved black and white tents and fancy umbrellas. The voice that narrates this book is interested in humans, too, but mostly about how humans make the circus and the circus’ magic interesting.3. This is not a romance. There is a love story in it, which is good, because love makes the world go round, but it is not a romance. If you go in imagining to be swept off your feet from page one, you can keep on imagining. The novel starts before our lovebirds have hit puberty, so you’re going to have to imagine for quite awhile. 4. The circus is not really a circus. This is fine by me, because I actually don’t care for circuses. They smell, the animals always have that look of dubious maltreatment, no, I don’t want to win a prize by shooting that thing off that other thing over there, and also, clowns look a little grubby to me. No, the Night Circus is a circus in the respect that there are tents, and there are performers, and some of them are acrobats. Mostly it is a place where pretty, pretty magic is passed off as illusion so that us muggles won’t be scared by it. I’d go to that circus. 5. This is not a thriller. This is a not an action-packed adventure. It’s not even a simmering revenge or bubbling rivalry novel. It is a novel about a thing, with love in it, and it spans over a decade. If you have a problem with that idea, it’s best you walk away now. But if you like Ann Patchett or Audrey Niffeneggar novels, or if you really thought JONATHAN STRANGE & MR. NORRELL was the bee’s knees, well. WELL. You have just found your next read. Enjoy. I did. "}, {"Review": "The Night Circus will be a 5-star book for a certain reader. This reader likes a lot of descriptions, doesn't mind a very slow story and has a soft spot for circuses. I am not that reader. I prefer imagery to complement a plot rather than substitute it.The plot summary of The Night Circus promised many enticing things, but delivered, in my opinion, only on one - lush imagery of a mysterious circus that was a collaborative creation of two rivaling magicians. The book was good 80% description of various circus tents, performances, dinners and pretty, visual acts of magic. I did enjoy it for the first 40 pages or so, but it got old very, very quickly. It got tiresome, it felt indulgent.The remaining 20% were dedicated to: a battle between the two magicians that consisted of... making up pretty things to impress each other (yes, you read that right, no actual combating of any sorts in this \"fierce competition\") and a lukewarm romance that came out of the magicians' fascination with each other's creations from a distance, rather than interacting in any meaningful way.My resulting disappointment with the novel had also a lot to do with the writing style - Morgenstern chose to write in present tense, 3rd person. It worked well for describing imagery, but made the narrative distant, detached and the characters - unrelatable and flat. To be honest, I am not sure if The Night Circus can even make a decent movie (the rights were bought by Summit). There was not much drama there or action, the story was anti-climactic, the love was dull and the magic was only vaguely defined and seemed to have no rules and limitations. I am thoroughly puzzled by the book's comparisons to Harry Potter."}, {"Review": " Aw hell, I'm going to rate this 4.5 stars. I can't resist this book was so freaking good. I don't normally change my ratings, so don't expect this TOO often. My feelings are so conflicted about this book. I don't know whether to immortalize it for all eternity in a frame on my wall, or throw it into the fire. So, how the hell am I supposed to rate this book? A million stars, one star, 837 stars, what? In the end I did some crazy, overly complicated math that really makes so sense in my head, and came out with four (which I raised to 4.5 because I'm such a weakling) stars. For the longest time during the book, over two hundred and fifty pages, I thought that I disliked this book for some very specific reasons, but this is where the confusing part comes in so hang with me for a second: once you get to the end, you realize that you only  thought  you hated those parts, and it was really all part of Morgenstern's brilliant plan!I know a few of you are probably giving me this look right now:Don't worry, though, I'll explain! Let me start by saying that this is a book you definitely have to read twice. The first time, you really aren't going to understand all of the nuances and parts of this story until, well, until it's way too late. That's something pretty special-and rare-about this book; it reminds me a lot of Great Expectations in that way. Let me try to elaborate with, since I know you guys love this sooooo much, ........ a story!  Most books and/or series that you read these days, you pretty much know the whole plot (sometimes even books before the TSTL character does) and how it's going to end: in a predicable, sappy, cheezy, blah blah blah you've read it a million times kind of ending; sometimes even just a couple of pages into the novel. In  The Night Circus , you really don't. The plot strings start out so loosely that you can see little to no connection to them besides the two obvious ones with Marco and Celia. You've seen loose strings before in many a sloppy novel, so you just dismiss out all of ones you deemed \"unimportant\" in your eyes and focus on Marco and Celia. Wrong move. You get more and more confused as the book goes on; what's with all the other POVs and time jumps? Really, just a general what the hell is going on? But that's not the truth; while you're so eagerly and attentively looking at your two little strings, Morgenstern brings all of those other little strings closer.....and closer......and closer together until, unbeknownst to you, she starts weaving them in with Marco and Celia. As I said, you're still in the dark about most of it, but you do notice that the book is getting better, but don't realize until there's only about forty pages left that, holy fucking shit, your two little strings that you started out with is now a huge, complicated, rope, but the book won't let you stop and analyze it. It carries you forward in a wave of sheer awesomeness as you devour every page. Then, you get to the end of the book, and your brain blows up. It literally blows into a million billion little pieces all over wherever you're sitting as your cat crawls all over you and nips your ankles (which is why I suggest you don't finish this book in a public place, because you will be incapacitated for several minutes and look like an invalid). [image error]When you finally get your brain back together, it almost blows up again when you realize that she planned for you to feel like this  all along.  She's been playing you and has had you wrapped around her little pinky finger from the start. Like Great Expectations, you're never really going to understand the plot and all of the strings fully until you read it through twice, when you can really fully comprehend every little detail that Morgenstern wrote into this story.Now that I told you about how my brain exploded about twice, let me get on with this review and tell you what I  thought  was annoying:What I'm about to tell you right now is  not  a joke. There are  fifteen  fricking POVs/main characters in this book that you're supposed to keep track of, and in case you still don't believe me, I'll list them for you:1.Marco 2.Celia 3.Tara Burgess 4.Poppet 5.Thessien6.Pospero 7.Mr. Barris 8.Isobel 9.Bailey10.Chandresh11. Widget12. Mr. Murray13. Lainine14. Tante Padva15. TsukikoThere are also chapters where she does it in POVs of other people from the circus, and sometimes she writes as though you're the one walking through it. Like I said, the first time you read through it, this can be very confusing and overwhelming, but once you read it through again, knowing the ending (and you can bet that I re-read this amazing book the second I was done with it) you truly understand these characters and why Morgenstern did it. And, no, I'm not going to tell you what at the end of the book made me change my mind so suddenly, you'll just have to read it yourself and be as astounded as I was. It's definitely worth waiting for.Awwww don't pout, I know you guys will love it! The other thing that hurt my head about this book was the seemingly obsessive amount of date jumping. We go from the early 1890's, to 1895, to 1893, back to 1898, up to 1901, back to 1899, etc. It was very struggling to read; she be in 1895 for a chapter, jump around through years for 5 or more chapters, then go back to 1985 like I was expected to remember everything that happened before, and most of the time it would be with different people than the ones I'd read however many chapters ago. It was hard, let me tell you, but what pushed me through, the amazing life preserver that Morgenstern threw me, was the writing.Ohhhhhh the writing *drools at the mouth*It is seriously some of the best stuff I've ever had the pleasure to read and enjoy. And for those of you that know me and have seen some of my other reviews, you guys know that that doesn't happen much at all. It flows so perfectly, sounds so beautiful, and uses just some of the most gorgeous wordplay I've ever read. It truly is stunning. Here's some examples that just knocked the breath right out of my lungs:The circus arrives without warning. No announcements precede it, no paper notices on downtown posts and billboards, no mentions or advertisements in local newspapers. It is simply there, when yesterday it was not. The towering tents are striped in white and black, no golds and crimsons to be seen. No color at all, save for the neighboring trees and the grass of the surrounding fields. Black-and-white stripes on grey sky; countless tents of varying shapes and sizes, with an elaborate wrought-iron fence encasing them in a colorless world. Even what little ground is visible from outside is black or white, painted or powdered, or treated with some other circus trick. The ticket booth clearly visible behind the gates is closed and barred. The tents are still, save for when they ripple ever so slightly in the wind. The only movement within the circus is the clock that ticks by the passing minutes, if such a wonder of sculpture can even be called a clock. The circus looks abandoned and empty. But you think perhaps you can smell caramel wafting through the evening breeze, beneath the crisp scent of the autumn leaves. A subtle sweetness at the edges of the cold. The sun disappears completely beyond the horizon, and the remaining luminosity shifts from dusk to twilight. The people around you are growing restless from waiting, a sea of shuffling feet, murmuring about abandoning the endeavor in search of someplace warmer to pass the evening. You yourself are debating departing when it happens. First, there is a popping sound. It is barely audible over the wind and conversation. A soft noise like a kettle about to boil for tea. Then comes the light. All over the tents, small lights begin to flicker, as though the entirety of the circus is covered in particularly bright fireflies. The waiting crowd quiets as it watches this display of illumination. Someone near you gasps. A small child claps his hands with glee at the sight. When the tents are all aglow, sparkling against the night sky, the sign appears. (and here's another one)The woman wears a dress something akin to a bridal gown constructed for a ballerina, white and frothy and laced with black ribbons that flutter in the night air. Her legs are encased in striped stockings, her feet in tall black button-up boots. Her dark hair is piled in waves upon her head, adorned with sprays of white feathers. Her companion is a handsome man, somewhat taller than she, in an impeccably tailored black pinstriped suit. His shirt is a crisp white, his tie black and pristinely knotted. A black bowler hat sits upon his head. They stand entwined but not touching, their heads tilted toward each other. Lips frozen in the moment before (or after) the kiss. Though you watch them for some time they do not move. No stirring of fingertips or eyelashes. No indication that they are even breathing. “They cannot be real,” someone nearby remarks. Many patrons only glance at them before moving on, but the longer you watch, the more you can detect the subtlest of motions. The change in the curve of a hand as it hovers near an arm. The shifting angle of a perfectly balanced leg. Each of them always gravitating toward the other. Yet still they do not touch. (one more, just to sate your guys' thirst)But that is before it is wound. Before it begins to tick, the pendulum swinging steadily and evenly. Then, then it becomes something else. The changes are slow. First, the color changes in the face, shifts from white to grey, and then there are clouds that float across it, disappearing when they reach the opposite side. Meanwhile, bits of the body of the clock expand and contract, like pieces of a puzzle. As though the clock is falling apart, slowly and gracefully. All of this takes hours. The face of the clock becomes a darker grey, and then black, with twinkling stars where the numbers had been previously. The body of the clock, which has been methodically turning itself inside out and expanding, is now entirely subtle shades of white and grey. And it is not just pieces, it is figures and objects, perfectly carved flowers and planets and tiny books with actual paper pages that turn. There is a silver dragon that curls around part of the now visible clockwork, a tiny princess in a carved tower who paces in distress, awaiting an absent prince. Teapots that pour into teacups and minuscule curls of steam that rise from them as the seconds tick. Wrapped presents open. Small cats chase small dogs. An entire game of chess is played. At the center, where a cuckoo bird would live in a more traditional timepiece, is the juggler. Dressed in harlequin style with a grey mask, he juggles shiny silver balls that correspond to each hour. As the clock chimes, another ball joins the rest until at midnight he juggles twelve balls in a complex pattern. After midnight the clock begins once more to fold in upon itself. The face lightens and the clouds return. The number of juggled balls decreases until the juggler himself vanishes. By noon it is a clock again, and no longer a dream. If you guys aren't sold on the snippets I just gave you, then you're all nuts. Certifiably nuts. In the end, I would recommend this book to almost anyone and everyone, as long as they actually know what an amazing book really is. If you're huge fans of these books: Hush, Hush, Twilight, Halo, Angel Star, etc, read nothing else but those, think that classics are stupid, out of date, books, and don't have enough patience to be able to truly enjoy a challenging book instead of just being half filled on pathetic YA tropes, then this book  is totally  might be out of your  pathetic  league. But for everyone else, READ THIS NOW!..........  or else.  If you think I'm kidding.....I'm not.Just kidding!Or am I........?"}, {"Review": "Rating: 6* of fiveSometimes, some books just don't lend themselves to an analytical, opinionated review. I'm reluctant to do that kind of review here and now because the experience of reading The Night Circus was like smelling a magnolia blossom...perfect, sweet, rich, satisfying a need I didn't know I had until it was met...but to examine it, to handle it, even gently, risks that somehow the magical smooth gorgeously textured vessel of chastely erotic pleasure that this book is will let it begin, inexorably and inevitably, to brown and curl and die, and become...just a wonderful book.I'm not ready for real life yet. I want the magic to linger just a little longer.The physical book itself was a Christmas gift to me from a GoodReads friend, and to him I offer humble thanks on bended knee. This was in the top five reading experiences of my life, and will most likely remain there for the rest of it. I am changed and exalted. And it is thanks to you, and your gift to me.\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"Review": "Wedding cakes are typically the prettiest cakes, but they are almost never the tastiest cakes. I am not a cake expert (can I be one though? Is that a thing I can be?), but it seems to me that the tools necessary to make a cake exceptionally pretty -- a vat of fondant, to start -- also contribute to the cake not tasting all that good (unless you somehow really like fondant, which is incorrect).Don't misunderstand me, I have no issue with cake. The right decorations, the right frosting (buttercream, preferably chocolate), the right consistency (moist, but not crumbly), the right layering (chocolate mousse) -- it is a perfect example of a food that does one thing, but does it very well. And that's fine.But a gorgeous wedding cake, covered in fondant and appliques, is only gorgeous until you cut into it, take a bit, and realize, hmmm. It's pretty and all, but you could do with a bit less artifice and a bit more of the good stuff. The cake part.The Night Circus is a wedding cake with fondant that goes nearly all the way down. It is an exceptionally pretty cake -- captivating, intensely visual, ornate and delicately constructed, with unruly swirls of back and white and surprising splashes of vivid red. But what is underneath? Oh, there it is... a little bit of cake, way down at the bottom. It's pretty good, too. Light, airy, a hint of chocolate and smoke. But all that sculpted icing has lodged in your throat, and it's kind of hard to swallow.Erin Morgenstern writes beautifully. This is a book about dueling magicians and bewitching enchantments, set in the Victorian age circus, so you can probably imagine what you're going to read, but she decorates her world remarkably well, creating magical attractions that are lightly sketched, allowing them to grow in your imagination (I want to play in the vertical cloud maze, and climb to the top and jump into a sea of wispy fluff).But good lord, just re-read that paragraph. Magicians, Victorian circus, cloud maze, sea of fluff? Eye roll? I've read a few circus books, and I should probably get it into my head that they are almost never for me, because too much of this stuff can get to be a bit much. \"Insufferably twee,\" I might have commented. Did I mention is is also a star-cross'd romance? With achingly, dippily sincere lovers?I mean, whatever, that's fine. I can handle romance, I can handle reading long, elegant passages about the sets of various Tim Burton films. Just give me a good story.But I don't think this book has a very good story. It is all setting, tone, establishing a mood. The story just kind of sits there, down at the bottom, under all that decoration. It isn't that interesting, and certainly not an entirely stable foundation. But maybe if it was jazzed up a bit? Put some filler in there -- a framing device, a needlessly fractured timeline. Does that make it taste better? Not really. The additional flavors are nice enough. They keep you eating reading, anyway (I can't remember if I am still talking about cake).Now for a paragraph that I won't be able to shoehorn into the strained theme of this review, but it needs to be said nonetheless: I don't like it when books about magic put zero parameters on what magic can do, or how it is. The magic in this book is unrestrained and excessive and after a while, very boring to read about. It powers the attractions at the Circus of Dreams, but with no restraints, the attractions can be, literally, anything. So why was I yawning halfway through the act? This book has received intense advance hype, and it will probably be a huge seller. Probably. But I'm not sure. If I wanted to further stretch my metaphor I would point out that you buy cakes at Jewel all the time but you only buy a wedding cake once. --Addendum to Danielle Trussoni: I found your blurb on the back of this book to be as uninspiring as your debut novel. Do you really want to be the blurb-whore who speaks of a book that is explicitly about magic with phrases like \"so magical, there is no escaping its spell\"? Also, \"enchanting\"? Also, \"If you read just one novel this year, this is it\"? Really? As long as it isn't your book, I guess."}, {"Review": "“How can I excel at a game when you refuse to tell me the rules?”I guess “The Night Circus” is one of those books that make it especially hard to write a proper review and if I’m entirely honest I have to admit that I don’t even know where to start. It was unlike any other book I’ve ever read and therefore the usual structure of my reviews just doesn’t seem to be appropriate, let alone to fit. ”I would have written you, myself, if I could put down in words everything I want to say to you. A sea of ink would not be enough.”To use it for such a particular book would be as good as impossible and since I’m no part of “Le Cirque des Rêves” all I’m able to do is to resort to the written word and to hope that it will suffice to convey all of my diverse emotions. And heaven knows there are plenty of them. ;-)”There’s emotion,” she says. “Deep emotion but you are only on the shore of it, still near the surface, while it is waiting to pull you under.”Just like Herr Thiessen I shall forever be a “Rêveur”, a Dreamer who looks at “The Night Circus” with wide eyes, getting lost in the intoxicating smell of the impossible and wonderful. I will wear my red scarf and explore the mysteries of this incredible and lovely place and as I walk down those countless tents and see all the different signs, I’ll pray that it will never lose its charm. Because places like that are special. They rarely or barely exist in the dull light of our daily world, the knowledge we soon will have to leave this venue only igniting our wish to stay. ”Why haven’t you asked me how I do my tricks?” Celia asks, once they have reached the point where she is certain he is not simply being polite about the matter.Friedrick considers the question thoroughly before he responds.“Because I do not wish to know,” he says. “I prefer to remain unenlightened, to better appreciate the dark.”We want to experience the magic, want to marvel at its beauty and strangeness, at its impossibility and rareness. ”She is radiant. For a moment, while they look at each other, he cannot remember what he is meant to be doing, or why she is handing him a piece of paper with the number twenty-three written on it in his own handwriting.”The love between Celia and Marco is a never ending well of creativity, sweeping us off our feet, making us long for more. The details of their creations are incredible, the love and dedication they put into their work so delightful that we can’t help but get lost in their tents. Each night we try to explore another one, sometimes we end up returning to those we already know. ”I only hope that was as pleasurable a sensation for you as it was for me.”To be one of the “Rêveurs” is a constant struggle, a never ending fight to find a balance between exploration and devotion. We want to indulge ourselves in the familiar, yet at the same time we want to surrender to the new. At a place that’s made to be impossible literally everything seems to be feasible as long as you’re willing to give it a try. ”Am I close enough for your illusion?” she asks.“If I say no, will you come closer?” he retaliates, not bothering to hide his grin.The only thing that never bends is time itself though. It slips through your fingers while you explore the circus, while you get lost in so many people’s dreams. It runs out before you even know it, the intricate dancing clock merciless as it continues to tick. ”You may tell a tale that takes up residence in someone’s soul, becomes their blood and self and purpose. That tale will move them and drive them and who knows what they might do because of it, because of your words.”You’re too distracted to pay any attention to your surroundings though, too preoccupied with the performance of the red-haired twins. As the sun finally begins to rise, you realise that you have neither visited “The Ice Garden” nor “The Cloud Maze”. There’s only enough time left to do one more thing and you barely thought it before you’re already standing in front of the last tent you’re going to visit tonight. “The Wishing Tree” is spreading its branches into endless night, countless candles flickering in the dim light. “Let me return to the circus.” You plead as you light another candle, feverishly hoping and praying your wish might come true…”All around him, lights are popping to life along the tents, flickering like fireflies.”"}, {"Review": "shrug. yeah, i had a good time reading this book. i got really swept away in its atmosphere, and it didn't disappoint me because i didn't go into it thinking it was going to be a masterwork of literature, explaining the human condition and changing the way i saw myself and my relationships in the future. it presented itself as a fantasy novel about a magical victorian circus and that's exactly what it gave me. i think it is most successful in terms of its mood and its atmosphere. this is not a novel where character development is a priority.it is, and remains,le cirque des rêves. dreams don't need to explain themselves, to me, they just have to be interesting. i think the novel early on absorbed some of the dream-logic from its subject, and as time passed and situations occurred without any sense of explanation, i was just the reader getting carried along with the text; the dreamer following the imagery. it is not that her language is hypnotic, but she has a definite ability to write imagery, and to kindle the reader's imagination.the plot is simple. against the backdrop of a mysterious circus that appears and disappears around the world without warning, operating in the deepest hours of night, two master magicians release their protégés in a battle of magical one-upsmanship...to the death. yes, it is less dramatic in reality, as years pass and the battles play out more like a contest martha stewart would devise to get her magazine staff motivated...but with magic! it becomes a call-and-response between two magicians who are initially unaware of the other's identity or abilities as they create incomparable attractions in the circus' confines, and struggle to maintain them as time passes and the strain of keeping all their magical balls in the air begins to take its toll.eventually competition gives way to mutual admiration and then... well, magic.she does love to stress the color scheme of the circus. joel had the best line ever: I can handle reading long, elegant passages about the sets of various Tim Burton films. hee-hee. agreed. but i loved her descriptions - i could actually envision this circus, and the attractions, and the marvelous flights of fancy - it all just stirred my imagination in a completely rewarding way, and this is a circus i would want to attend. also, dinner parties i would want to attend. yeah, bb, she's talking about me.god, remember when magic was everywhere? there was that moderately popular children's book series about the boy who was like a wizard or something? and then Jonathan Strange and Mr. Norrell came out in 2004, and then in one single year, bothbased on a story from here:The Knife Thrower and Other Storiesandbased on this book:The Prestigecame out and everything was magical all the time? it was almost too much magic.i'm glad we took that break to let vampires and other things break up the feeling of magician overload.and i am glad i read this book for the \"readers' advisory for all group read #2. and i'm glad i didn't let all the negative reviews change my mind. i agree with some of the points others made, but ultimately, i found this to be a wholly satisfying book whose reading experience mirrored the themes of magic and dreams, and i was glad that there was still some secrecy at the end of it all.i mean, you know what happens when a magician reveals their secrets, right??no one wants that.come to my blog!"}, {"Review": "Some books touch your soul in unexpected ways. I’ve never been to a circus nor have I ever had a wish to go to one. But after reading this I want to go to one. Admittedly, this is plain folly because a circus this beautiful and enchanting could never be reality; it’s simply too wonderful, and could only ever exist amongst the pages of a magnificently written book. Real circuses are horrible places that are full of cruelty, animal exploitation and vile entertainment. What I mean to say is that I actually want to go to the Night Circus not just some random circus!Damn you Erin Morgenstern for making my heart long for the impossible! The wonder of the circus is captured on the very first page. It's described as a place of magic and wonderment; it simply appears out of nowhere. The gates, as the name suggest, only open at night. Morgenstern then goes further and teases us with descriptions of circus food and beverages; she creates a place that is majestic and thoroughly irresistible. The atmosphere that is created throughout is spectacular. I want to go there. (Have I said that already?) Well, I’ll say it again: I really want to go there! Like, now! Can you blame me? It’s just all so magical and beguiling:\n“The circus arrives without warning. No announcements precede it. It is simply there, when yesterday it was not. Within the black-and-white striped canvas tents is an utterly unique experience full of breathtaking amazements. It is called Le Cirque des Rêves, and it is only open at night.” \nBut, that’s not all the book has. That’s only half its wonderment. The circus is a mere stage for an old grudge match between two opposing magicians. The two have been at war for a long time, and they’re using their two respective apprentices to fight their battle for them. The two are trying to create the most powerful magician who will best the other’s student. The circus is a staging ground (a charming one at that) for the competition, and the two young students are little more than tools for their masters. Except here’s the problem and solution: they fall in love (arrrrr!) This book wouldn’t be complete without the romance elements; it fulfils it, even if it is a little predictable. The romance that developed is handled superbly. It wasn’t remotely rushed, though at the same time it was clear that the initial attraction was there. It was built up slowly and eloquently. The relationship that developed was believable; it was, in essence, very much like the book: pure magic. I think it was intensified by the fact that they should have been enemies not soul mates; it made it feel like it shouldn’t be happening, but was still unavoidable. It was all so good, and I truly didn’t expect to like it so much. I’m not fond of the circus because of the exploitation involved. This, however, was something completely different. “The finest of pleasures are always the unexpected ones.” I have nothing negative to say about this book whatsoever; I have no criticisms or complaints. For me, it was a perfect reading experience. So come and read this book, and be prepared to be thoroughly charmed.Blog | Twitter | Facebook | Instagram | Academia"}, {"Review": "I have a bit of a complicated relationship with The Night Circus. I had been wanting to read it for 2 years now and was immensely excited to finally pick it up. I knew the prose was extremely flowery and lyrical so combined with an adult fantasy story, I anticipated it being a challenging read for me personally. I decided to listen to the audiobook after hearing great things, but quickly realized I was struggling to remain engaged with the story. After four hours of retaining almost nothing about the plot, I decided to restart completely. After giving it another try and putting in more effort than normal to ensure I was fully comprehending the story, I ended up falling in love with the story! After finishing and loving it, some of the faults of the novel began to sink in after the initial excitement faded and I realized it wasn’t the perfect novel I originally thought it was.CW: child abuse, deathWhat I loved about The Night Circus was the atmosphere. The ambiance surrounding the circus and festivities felt tangible. I feel it would be difficult to read this novel and NOT want to attend such a mysterious and intriguing event. It was dream-like, captivating, and all around gorgeous. I love books that are extremely visual and I was not disappointed with this read.This book is really slow-paced which I could sometimes get behind, and other times struggled with. There were moments where I really appreciated the time and care put into lengthy descriptions but other times I was begging to move forward. I also felt similarly to the time jumps – At times I felt they were intriguing. At others, they were confusing. Of course, it does all make sense in the end so I don’t consider it a massive issue.My main gripe with the story was the execution of the competition; The synopsis details a high-intensity competition between two magicians, but that promise does not follow through. It takes until ¾ of the story to find out any significant information about this “competition” which leads to an extremely slow-moving plot. Due to that, there is zero sense of urgency. No true rivalry, no anticipation for how the competition pans out, no fear for the consequences of losing. I desperately wish there had been more to this plotline because there was so much potential, but it just fell so flat for me. On a similar note, I wasn’t swept of my feet by the romance. It felt forced and underdeveloped. I think with more interactions between the couple, it could have been enjoyable but the lack of exploration made it feel forced and mediocre. This romantic plotline has been done thousands of times in literature, and there was nothing notable about this take.Overall, I did genuinely enjoy my time reading The Night Circus. I would probably give it a 4/5 stars entertainment wise, but a 3.5/5 for execution, but I’m keeping it at 4 stars because of how mesmerized I was by the story. This is one of those situations where I have more critiques than positive notes, but my overall feelings and memories of this novel are utter enjoyment. Despite my struggles with it, I would still high recommend."}, {"Review": "As a young girl, Celia Bowen is delivered to the father she never knew, a world famous magician whose secret is that his show is genuine magic - not illusions. He teaches Celia to manipulate the world in the same way so that she can compete in a high-stakes game against Marco, an orphan similarly trained by her father's nemesis. The arena for this game is an elaborate, surreal circus. Neither Celia nor Marco knows the extent of the game, nor their opponent, until they have fallen in love with each other. I am going to blow the mind of everyone who gave this book five stars. My biggest problem with it was how badly Erin Morgenstern broken the cardinal rule of creative writing: show, don't tell. I will 100% agree that Morgenstern did an incredible job describing the wonder and magic of the circus. Her elaborate descriptions of magical tents and off-beat performers initially drew me in, though I worried about how long-winded and verbose some of her descriptions could be. Morgenstern's problem is that the plot and character development takes places mostly through dialogue and not action. Most of the significant plot twists were revealed by one character telling another, which took most of the suspense out of the story. I had the same problem with the character development. There was practically no exposition to give insight into these characters, no sense that they acted with reason beyond the need to make the story do what Morgenstern wanted. They didn't feel real.And the love story? Please. Dear Ms. Morgenstern: I do not believe two characters are in love simply because they say they are. They should act as though they are falling in love. Celia and Marco declare intense feelings for each other the first time they meet one another. The result is a juvenile, melodramatic, and inauthentic \"romance\" that I couldn't bring myself to care about. It's just like my friend's fourteen year old sister who declares her world-ending love for a different boy each week: \"This one's different. It's real. I swear.\"Similarly, it bothered me that the high-stakes battle unfolded in the form of Celia and Marco conjuring magical tents for each other...from afar. She did it from the center of the circus, where she was one of its main attractions, and he did it from London, where he worked as the assistant of one of the founders. I was expecting a dangerous, breathtaking game of one-upsmanship along the lines of the movie The Prestige. I know that the distance between Celia and Marco was necessitated by Morgenstern's love story, but it hardly made the game feel Life-and-Death. There was no suspense, so urgency, and really no sense of competition at all. Celia and Marco kept being told that they had to be careful and they had to up their game and that the battle would be coming to a head soon....but nothing ever seemed to come of these warnings. I never once worried that one of them was in danger. I would give Morgenstern four stars for imagination and creativity, but her execution falls flat. If you want to read this solely for the descriptions of the circus and the magic, I'm sure you will enjoy this book a lot. If you're looking for a well-told story, look elsewhere. "}, {"Review": "Reread: 2018Maybe more like a 2.5/5?I apparently enjoyed the audiobook much more because this time around I was really into it (and I remembered basically nothing from my original read, or listen rather) but then I got to the middle and I completely lost steam. I didn’t connect with it in the way I had wanted to and while there were some aspects I found very interesting, for the most part I felt like I was constantly waiting for more (which seems to be the point of the book). Just not for me anymore I guess!**This was unlike anything I've read before. Everything about this book was so intricately crafted and made for a masterpiece of a story. The characters and the circus itself were just something out of this world and it was really incredible. The writing was amazing as it built this ambiance leading up to the end of this book.That being said, I had some qualms with this book that made it not be a 5 star book for me.The pacing was very slow. I'm generally a fast reader so I get frustrated with slow paced books. This is a book you are meant to take your time with so you can be absorbed into the world and the magic of the circus, and for me, that's kind of a negative. It wasn't really a bad thing but I just like fast paced books is what I'm trying to say.I felt there were waaaay too many characters. It was hard for me to keep track of who was who and what they did and it was a little bit confusing at most times.And finally I just felt like there was something missing for me. I cannot put my finger on what it was, but just something.Overall I did enjoy this book and I would recommend it. I assure you it's unlike anything you've ever read before."}, {"Review": "\n“The circus arrives without warning.”“You think, as you walk away from Le Cirque des Rêves and into the creeping dawn, that you felt more awake within the confines of the circus. You are no longer quite certain which side of the fence is the dream.”\nThese sentences are the beginning and end of the mesmerizing story of  Le Cirque des Rêves. Three simple sentences that somehow encapsulate your emotions at the very point of the book they are placed. One filled with intrigue, the other with the love, fondness and simply the dreamlike nature of the journey you have been through.A page into this book and I knew it was going to be one of my most favorite books. Now, I tell you that this book is without a doubt on the top 10 of my favorites list. I don’t usually specify the ranking of the book when I tell you it’s one of my favorites because honestly- I can’t rank them, but I love this book too much for it to not be in the top 10.The very nature of this book seems enticing and the story pulls you along in a daze much like the story of the very circus it portrays. The theme of the book which can only be aptly described as Black, White, Grey and Red fills your head, and leaves room for nothing more, as the story unravels in the most fascinating manner. I read a lot of fantasy books but this book is one of the best representations of the magical atmosphere and simply hypnotizing background a fictional world can create. I also loved the way the story has chapters which are told from the perspective of people who have experienced the circus, and the chapter is in the form of an article or review they’ve written, these chapters somehow feel the most mystical throughout the book (some of these chapters are actually my favorites). ‘The Night Circus’ mainly follows the unknown competition between two magicians, Celia and Marco, who have been trained since childhood for what they can only describe to be a game. The blurb of the story kind of focuses on these 2 people who happened to be our protagonists, so I thought the book was going to be revolving around them. Once I started the book I realized I couldn’t be more mistaken, the book does in fact tell the story of Celia and Marco, but it also entrances you in the world of  Le Cirque des Rêves, I fell in love with the circus, the concept of the story, the people, the writing and most of all, the sensational world Erin Morgenstern created. I can’t elaborate on how much I love the writing of the story and the outline of how it was intended because I don’t have words that will do justice to this world. This book is definitely a 5 star, 100% read, for me at least. A magical story of a magical world, Erin Morgenstern hats off to you."}, {"Review": "Buddy reading this book with my favorite Princess Celeste2.5/5 StarsThere will be rants on this review, if you're easily offended I recommend you to stay away from continuing.I really wish I could rate this higher but if you heard about this book already, you probably know there have been a lot of mixed reviews on it. It’s either you really love it or you really hate it. Sadly, I’m one of those closer to hating it.Before you read this book, I must state two things. 1.DO NOT TRUST THE BLURB & THE REVIEWS WRITTEN ON THE BACK OF THE BOOK. THEY ARE SO MISLEADING AND WILL RUIN YOUR EXPECTATIONS OF THIS BOOK. Seriously, whoever wrote those deserve to get fired, they completely misled me into buying this book with wrong expectation.2. The Night Circus is not a plot centered book, it’s not a character driven book, it’s a setting centered book and guess what the book is about? (Hint: the title). This is literally what the book is about.I’ll get around to them later but first I’ll start my review with my favorite part of the book, the writing and setting.I can’t stress this highly enough, just look at all other reviews on this, even from those who gave this book 1-3 stars, everyone agreed that Erin Morgernstern’s writing is an absolute beauty. Everything in this book is written so beautifully and enchanting that it made me really wish a circus like this do exist.The setting, the clothes, the magic and even the food are so magical and written in so much detail. (Seriously, prepare to play Hunger Games on your fridge.) Honestly, Morgernstern’s writing alone truly deserves 5 stars, it's the only reason why I still gave the book 2.5 stars even though I have so many problems with it.I like to think of Morgernstern writings as makeup. You know when you put on makeup to make yourself more pretty or hide the imperfection such as pimple on your face? This is exactly the case. It’s like Morgernstern conjured a spell of BB Cream and Concealer to hide the fact that there’s so many problem within the book.Now I’m going to talk about the problems, remember that this is all just my observation and opinion.1. The main characters developments are close to none.For me, great character developments are one of the most important factors in my love for any book. Other than Bailey, Widget and Poppet (which don’t have enough appearances, Bailey should’ve been the main character rather than Marco or Celia.) I seriously don’t give a shit what happened to any of the other characters because they’re all so flat. There’s just not enough development on them to make me really care. Even after knowing what happened to some of the characters in the book at the end, the only reaction I could give is2. Extremely slow paced with no plot progression.I don’t mind slow paced book as long as there is some sense of plot progression, character developments or great climax and satisfying ending waiting for me at the end. In fact, I really love slow paced books which took its time to develop the plot and characters carefully. However, in this book, not only the plot moved at a snail pace, there are so MANY unnecessary parts that could be cut out. Page 220-350 is a major snooze fest for me. All they talk about is the Night Circus over and over again which I get it already, it’s magical. The color of tents is black and white, there’s a majestic clock and a white bonfire, stop repeating them over and over again! These 100+ pages could’ve been used to develop the characters and plot more but no, we get tons of repetitive description again on The Night Circus and unimportant information.Now let’s talk about the most misleading part in the blurb as well as the rest of the problems. (yes there’s still more.)1. \n“A fierce competition is underway”\n and \n“The circus is but the stage for a remarkable battle of imagination and will”\n I can’t say much about these without spoiling the ending but I’ll say this, there’s no FIERCE competition at all. Don’t expect any kind of skill, action or magic rivalry, there is none. Even the main characters don’t know what the competition is about until around page 400 out of 500 which is really dumb. By the time it was revealed, it was super underwhelming and provide no intensity to the story whatsoever.2. \n“Morgernstern manages to conjure up a love story for adults that feels luxuriously romantic” –The Washington Post\nWhoever wrote this is either a kid, someone who read a different book or batshit insane cause the love story that occurred in this book is definitely not a luxuriously romantic adult love. It’s instead one of my most hated trope in books, insta-love. The love stories happened twice in this book and guess what? Both of them involved one of the main character, (view spoiler)[Marco (hide spoiler)] and are both insta-love. Both happened within ONE CHAPTER on their FIRST TALK with each other. The magicians in the story, especially (view spoiler)[Marco (hide spoiler)] seriously need to use some of their magic to keep control of their libido. It will save some of the major conflicts that happened in the book.Overall, I don’t like the book and I’m really disappointed with it. It starts off really great only to loses its charm and magic quickly. Inflicted with a lot of problems, this is currently one of my lowest rated books in my bookshelves. I should state this though, if you’re looking to read something magical, beautiful settings with absolutely beautiful writings ONLY, I’ll definitely recommend this. However if you’re looking for something with great story, satisfying ending, fantastic characters development, great romance or even an ant sized of actions, nope, I can’t recommend this book. You won’t find any of them here, I’d even tell you to stay away but again, all of this is purely my opinion and my review, you could end up loving it much more than I do.As I mentioned in the beginning of my review, it’s either you hate it or you love it. Sadly, like the quote in the book \n“The circus arrives without warning”\n for me it’s more like \n“The disappointment arrives without warning.”\n"}, {"Review": "4.5⭐️So intricate. So complicated. So atmospheric. I read this a few months back but I never really wrote anything, save for the six words above. Well, I just found what I wrote in one of my folders, so... here.Alright, let me start off by saying that this book was magic. Simple as that. Seriously, the writing?? Experience it, my friends. Just experience it for your selves. Furthermore, this is a book you have to read twice to really comprehend and appreciate the magic behind it – never had I been so confused by everything I was reading that I had to constantly go back and re-read some parts! Now, as hard as it is to summarise the plot, enough about my lack of plot-grasping-abilities and let me tell you what you're missing out on by not reading it. --The setting and context:The story is told in various timelines (it starts out in 1873 then goes back and forth between current time and the past) through many, MANY POVs as well as a reader in the crowd which gives a feeling of personal presence. And although it is mainly about our two leads Marco and Celia and their duel, it is the circus that has the leading position in the story. It is the focal point of everything and has a life of its own.The tone and mood of the book are as intriguing as its characters. Everything and everyone is puzzling. The tone changes from fascinating and mysterious to anxious and depressing to hopeful. The mood varies from gloomy to romantic and from desperate to peaceful.--The plot and characters:If you think this is high-paced, action-packed thrill of a ride, you’ll be sorely disappointed. The plot chains start out so loosely that you can see little to no connection to them besides the two obvious ones with Marco and Celia. And as nothing is plainly revealed in one instant, you get more and more confused as the book goes on; (SO MANY POVs and time jumps!) and as each chapter leaves you with more questions than answers, you find yourself asking, just what in the hell is going on?? But bear with it all because while you’re so eagerly and attentively focusing on two strings, Morgenstern brings all of those other little strings and slowly starts weaving them in together.Each character, though overwhelming at times has his/her role to play in the grand scheme of things and no one feels like a placeholder. And while some might disagree, I don’t think there is a clear-cut villain here (alright, maybe one). But although the antagonists feel villainous, nothing is black and white. They are enigmatic and indecipherable and as the story starts to weave in, we get to, more or less see why and how they became to be who they are.--The slow-burn (if any) romance:Right, so, I don’t even know if I should really say 'romance' because the romance really takes a back seat to the main plot. Plus, the story starts when our two lovebirds are practically children so it takes a long while for things to really develop -hence the slow-burn-. However! when you get that small snippet -practically a few pages- of this ill-fated love, it is one light-flickering (literally), fate-changing romance that will either make you gush or practically scream of rage.--The writing style:Now, I know I’ve said that this book is magic and it is -I don't think I've ever used the word magic this many times in one review- but it is largely the writing and the style in which the story is told that makes it magical. It is seriously some of the best writing I’ve ever had the pleasure of reading -of course, nothing beats The Wall of Storms but pretty damn close-. It is immersive, atmospheric and just… pure enchanting. It flows so perfectly. Truly stunning.But don’t take my word for any of it, seeing (experiencing) is believing!Couldn't give it the full rating because half the time I was so utterly and completely confused out of my mind that I’d constantly go back and REALLY read some parts -is that even a thing though? Can you REALLY read? As opposed to just reading?- Well, you get my point. It was tiring and... horribly bad for my already bruised ego."}, {"Review": "Find me on Instagram & Twitter!\n❝When the final bulb pops alight, and the smoke and sparks dissipate, it is finally legible, this elaborate incandescent sign. Leaning to your left to gain a better view, you can see that it reads:Le Cirque des RêvesSome in the crowd smile knowingly, while other frown and look questioningly at their neighbors. A child near you tugs on her mother's sleeve, begging to know what it says.'The Circus of Dreams,' comes the reply.❞\nRating: ★ ★ ★ ★ ½The Night Circus was one of my favorite books of all time when it first came out during my teen years. I didn't understand everything that happened in the story but it still remained one of my favorite, if not my favorite, books of all time.After reviewing books for a year now, I decided to pick up The Night Circus once again after reading and hearing about several other books that closely resembled the premise of this book, but were never able to top the enigma that is The Night Circus. I wanted to see this book in a new light, from a reviewer's point of view, and see if this book is truly the greatness I once remembered as a teen.And now, I've come to the conclusion that no matter how young or old I am, The Night Circus will always be my favorite book of all time. I could read it five times or a hundred times or how many more times after that and I will never be able to bring myself to grow tired of this book. Just the whole premise of the Circus, the characters, the illusions, the romance, the mystery... It all just takes my breath away. I have never read a book that's ever impacted me this way or stuck to me no matter the years that pass. I know that some readers don't fancy circuses as much as I do, and that's understandable. I've always had a soft spot for circuses and The Night Circus has sastisfied and brought to life the circus that I've only seen in my imagination.I only had two complaints while reading this book. One of those complaints was the slow pacing. I remember distinctly the first couple times I've read the book and skimmed through so many chapters because I was just so eager to get the ball rolling. I wanted to skip past Bailey's chapters, Friedrick Thiessan's chapters, and a few more chapters that slowed the book down in the middle. I still found myself wanting to do that now as I read the story this time around. But unfortunately, no matter how much I wanted to skip those parts, every chapter and page is a puzzle piece that connects the whole storyline together.Secondly, the Circus and the magic itself were so elaborate and unlike anything you've ever seen before that sometimes the imagery became a bit difficult to envision. There were so many beautiful tents and illusions but I just couldn't bring myself to visualize them because my imagination simply just couldn't reach those lengths. I give praise to Erin Morgenstern's writing and imagination for creating these beautiful enchantments that goes beyond our wildest dreams. I've been stumped at certain descriptions before but not like this! Though it may prove to be a little problematic for people who love to visualize certain details, I think it adds to the mystery and the character of the Circus.One of the aspects that put the cherry on top for me was the romance between Celia and Marco. The romance in The Night Circus may come off as instalovey for some and if it were any another book, I'd probably say the same, but it does not bother me one bit here. Although our characters only interact for a few chapters until they officially \"fall in love\", it feels as though that love has always been there from the very first pages when they were sealed and bound to one another at a young age. In fact, Marco and Celia have been separated for most of the book, with subtle hints of dancing around one another for years that when they do finally happen, you can't help but root for them like crazy and hope they have the happily ever after that they so desperately deserved.The Night Circus was absolutely captivating, outstanding, and just pure enchanting. Though this book does have its flaws, Erin Morgenstern's writing has a way of luring and hooking you into her story, and just whisks you away through a mysterious, magical labyrinth that is The Night Circus. This book will always be near and dear to my heart and has impacted me in ways I never knew it could. Of all the books I've read so far in my life, The Night Circus is, and probably always will be, a book that I'll always remember."}, {"Review": "This book had so much potential. The world that Morgenstern created is so exquisite that it should have been easy for her to spin a good story. The Night Circus could have been a story of intrigue and manipulation. It could have been a heartfelt romance. If Moregenstern wanted to, The Night Circus could even have been a coming of age story with a thoughtful message about growing up and the choices we make. Instead, the final product is a badly written soap opera. The main characters, Marco and Celia, were very hard to like. They were supposed to be adults, but I personally felt as if they had the emotional maturity of pre-teens. For example, after one of Celia's friends dies, she goes to Marco for comfort. While crying in his chest, Celia says that this character had often written letters to her. This is what Marco says: \"I would have written to you as well if I could. A sea of ink is not sufficient to describe my feelings for you.\" This then turns into an entire conversation where they sap about how much they love each other. Mind you, the friend had been dead for less than a few hours. That's alright though, his death was clearly not as important as their love.Speaking of their love, it was melodramatic and unrealistic. Marco is enchanted with how beautiful Celia is. Celia plays hard to get, but after one evening in which they have a stale, uninteresting conversation, they are suddenly madly in love. In one scene, Marco held Celia's hand, and the mere touch of his skin on hers had her gasping for breath. Honestly? In another, he grabs her and kisses her in front of a ballroom, and the chandeliers tremble. Every interaction basically involves them either being used a plot vehicles to explain things to the reader, or was an excuse for them to state their love. Over and over and over again. Each time in a more melodramatic way than the last. Never mind that nothing happens for them that actually would cause them to fall in love. Finally, just to drive my point home, here is an actual line from Marco: \"I would rather die by her side than live without her!\" Ug.Even when their interactions could have been meaningful, one or the other finds a way to devalue the entire scene. At one point in the book, Celia is complaining about the emotional toll that this competition is having on her. Marco offers to go to his mentor and have Celia declared a winner. Hey! Problem solved! (Well, not really, but neither of the characters know that yet)What does Celia do when she is given an answer to every one of her problems? She decides that it is much too tiring to talk about. So instead making an honest effort to figure out their problems together, she enchants him so that he can't speak, complains more about the emotional toll that this competition is having on her, and then has emotional sex with him. It was such a pity that Morgenstern chose such god awful characters to be the focus of the book. She had so many characters at her disposal who were much more likable and three dimensional. I would have loved the book if it had been about Chandresh and his pride, and how Marco and A.H manipulated that to their ends. Or if it had focused on Prospero and Mr. A.H as they dueled with their ideologies. Though the Burgess sisters were minor characters, their slow realization that something wasn't right with the circus could have made for an interesting main plot. Even if the story was about Bailey, it could have been sweet and adorable. Out of all the potential characters and stories she had, Morgenstern chose the worst, and magnified them up to 1000.Besides the characters, this reader also had problems with the plot, namely that fact it was vague and riddled with loopholes. The reader is never quite shown how the magic in the book works, or even how the competition itself works. Without this understanding, it was hard to know why Celia and Marco did what they did, because there were a million other things that they could have done that would have made more sense. Lucy's review provides one glaring example. In addition, the plot itself moves dreadfully slow. It takes 16 years for something to actually happen, and Morgenstern tries to distract the reader from that by filling the pages with pretty imagery and tone. In short, what could have been a fantastic story was ruined by lazy plotting and dreadful characters. Morgenstern should consider a career in art directing-she can create beautiful images and obviously has a vivid imagination, but she cannot create any substance behind her images."}, {"Review": "Sometimes I want chocolate. And sometimes I want the chocolate experience. I'm as guilty as the next person of the occasional vending machine pick-up for when I need those quick fixes. But then there's the slow anticipation. Take last week, for instance. It had been a few days since the last time. As I waited in line for my latte, my eyes happened to linger on a cute little cupcake, dark velvety goodness. Short, stacked, with a swirl of fluffy milk chocolate frosting. I resisted temptation, but the thought of chocolate lingered in my mind, and it was only a day or two before I found myself heading to my favorite chocolatier, craving the bittersweetness of an espresso-infused truffle. The overwhelming rich smell of cocoa as I opened the door. The charming smile of the clerk. The snap as my teeth bit through the dark chocolate coating, and the coffee-flavored richness of the silky ganache coating my tongue.The Night Circus is achingly beautiful. I'll concur with the critics that it might not have much of a plot, but sometimes the point is the storytelling. Morgenstern's writing reminds me of In the Night Garden in it's deceptively simple storytelling, of Peter S. Beagle's melancholic and star-crossed lovers, and of Steven Millhauser's love of ornate visual details in a magical environment. It's lyrical and evocative. If you want hair-trigger, gun-slinging action, this is not the book for you. If you look for slow, winding beauty, the walk in the sun-filled garden and the sparkle of sunlight off ice-covered trees, this might be your book.Cross posted at http://clsiewert.wordpress.com/2012/1..."}, {"Review": "I never expected to like this book. Just from the title I knew it wasn't for me, but so many people spoke highly of the book, so I read some reviews... And my opinion remained the same. This wasn't for me. Nothing about it appealed to me, and so I had no interest in ever reading it. But, it was chosen for my bookclub, and so I read it. Technically. And now I am going to rant about why I wish I hadn't. In detail, which means there's gonna be spoilery stuff, probably. Here we go:I don't like reading about circuses or parties or scenes of revelry and dreamlike wonder. I don't like reading about unrestrained, no-holds-barred magic that is only limited by the imagination of the magician, with no boundaries or explanation of how it works. I don't like magical realism. I don't like endless descriptions of every-fucking-thing ever.I don't like books without a point or plot or reason for existing beyond their own wank. And I REALLY don't like insta-love and completely unrealistic \"love will find a way\" stories. (And don't give me crap about it being fantasy either. That's just a shit cop-out for lazy storytelling.)Annnnnnnd since that's exactly what this book was, it should come as no surprise that I did not enjoy it. I know. I'll give you a moment for this revelation to settle. Why hello there, Clock. Fancy meeting you here! ...Are you following me?Ugh. Reading this (or I should say listening to it- but more on that in a bit) was mind-numbingly tedious and just all around awful. I can't think of a single thing that I enjoyed about this book. I can't even say, \"Oh the writing was good\" because the writing was so fucking purple that I feel like the Purple People Eater mistakenly ate something that didn't agree with him, perhaps one of the oh-so-interesting guests at Mr. Lefevre's parties, mmm? And then it shat out this book. He looks pleased with himself.So we have ENDLESS descriptions of parties, endless descriptions of the food at the parties, and the people at the parties, and the clothes the people at the parties are wearing, and how OH SO EXCLUSIVE the parties are, which is good, because for fucking fuck's sake if I had to endure MORE guest descriptions I think I might really have ice-picked my own face. Then we have ENDLESS descriptions of the circus, and the tents in the circus, and the ground at the circus, all of the signs at the circus and on the individual tents, and the food at the circus, and the non-tent attractions at the circus, and everything you can imagine at a circus and even 50 things you can't. And let's not stop at one example, or two examples, let's have ALL of the examples. If there's 12 chimes on the CLOCK during the lighting of the bonfire and each corresponds to an arrow fired into the cauldron where the fire will soon be lit, we have to have every last one of them described, in detail, with the seconds leading up to the first chime spelled out too (DRAW, NOTCH, PULL....RELEASE!). Described to the point of brainmush, in fact. Perhaps Erin Morgenstern thinks she's the only person on the planet with any imagination, because her descriptions left absolutely nothing for anyone else to imagine. Oh, no, I take that back. We get to imagine all the stuff she DIDN'T describe to death... or even bother to include. You know, like the plot. Or the magical education specifics. Or the moves in the OH SO IMPORTANT Challenge (capital C) that is apparently, supposedly, the point of this book's and the circus's existence. We are allowed to imagine that stuff, because, though we're told that they exist, THESE things are apparently not even important enough to warrant any explanation at all. Not when we have super vital things like CLOCKS to describe and hint at incessantly! Speaking of the Challenge-slash-Duel-slash-Competition thing... Could it have possibly been more lame? \"The first move has occurred. The earth shook and I felt a disturbance in the Force!\" \"What was the move? What does it mean? What happens now? Does this mean this story is going to actually start soon?\"\"Hmm? What move? OH, hey! Wanna see my dress? Let me describe it to you!...\"\"FML. I can't even. I just.... Can't.\"And that's the duel, until the point when *gasp* THIRTY YEARS AFTER BEING BOUND TO THE CHALLENGE, they find out what the fucking stakes are... and then they do (wait for it...) Nothing. The universe does all the work and these two \"main characters\" just get moved around like chess pieces. Only chess pieces have a purpose, unlike Marco and Celia. Moving on... I hated the way the story jumped around in time. And I REALLY REALLY hated the lapses into 2nd person narrative to take me inside the circus. I don't like circuses, and especially don't like magical, whimsical circuses of dreams (imagine me saying that with as much disgusted sarcasm as possible). I don't give two craps about the endless tedium tents of the circus, so those parts were boring as hell for me. I would also love to know how a pregnant woman in the late 19th, early 20th century would know that she's having twin babies, specifically. There was no sonograms back then, no ultrasounds to show Mom and Dad their little bun(s) in the oven, so short of X-ray vision, or some sort of precognition (which seems more likely), there's no way that anyone could have known. But no explanation is given for that little tidbit. We're just supposed to say, \"OK then!\" and let our eyes glaze over with the next 15 or 20 mentions of clocks, I guess. And then there's Jim Dale, who read the audio. I just can't stand him. I just can't. His voice and reading style make me angry. I hate when readers have to do the voices and can't let characters speak for themselves. He gave these characters voices that completely clashed with my impressions of them, and it was distracting. Not that any of the characters were truly remarkable on their own, but I'd rather them be unremarkable than memorable for being a distraction from their own story. But, speaking of characters, I didn't care about any of them. At all. Literally. I couldn't have cared less if an enormous sinkhole opened up and swallowed up the entire circus. No big loss. None of the characters were real enough for me to care about. Oh, we're told all about their personalities and whatnot, but for all Morgenstern's showing of everything else, her characterization leaves quite a lot to be desired. Marco apparently thinks it's OK to lead on his girlfriend for years, while cheating on her RIGHT UNDER HER NOSE... but that's OK, because he just erases those memories. No harm, no foul! Celia is just a Mary Sue. I actually forgot that \"the illusionist\" was her sometimes, because both could have been anyone. There's absolutely nothing interesting about her at all. Her magical abilities aren't a substitution for personality, you know. Celia doesn't even say Marco's name until the last 3rd of the book, and then only at his specific request. But I'm supposed to believe they are in love. Uh huh.But they have to be in love, otherwise the Love Shall Overcome deus ex machina trope that needs to die a horrible painful death would be out of place! Can't figure out how to legitimately get out of the corner you wrote yourself into? It doesn't matter! As long as the two Insta-Lovebirds are together, nothing can harm them or happen to them. The universe will (apparently) conspire to bring about the one solution that will be timed perfectly (know what shows the time? CLOCKS.) and will make EVERYONE a winner. Because everyone gets their reward if they just show up and then give up. Whenever there's a winner, there's also a loser, and losers are sad. The universe won't let you be sad, so it'll change EVERYTHING around to make sure everyone's a winner! No hurt feelings here! You'd think, that by the end, the glorious, long-awaited end, I'd have known better than to assume that there would be a proper ending, or any kind of sacrifice or trial or... broken nails or even a dirty dress or SOMETHING. Nah. Silly me. The end was so ridiculously \"perfect\", and fell together so effortlessly, that the ridiculousness actually cost me IQ points. What was the point of enduring reading this book? It has nothing to say except the tired \"If you just love ENOUGH, you can do anything\" shit that only tweens actually believe. So. There's no point, endless, tedious descriptions of things I couldn't care less about, the lamest conflict EVAR, and insta-love to boot. I wish I could give this negative stars."}, {"Review": "هذا الريفيو كتبه أحد الحـالـمين، أرجوك لا تقرأه إلا إذا كنت منّـا.. حــالــم(سبع أسباب لتقرأ رواية  لتدخل عالم السيرك الليلي)1- لأنه الشتاء .. ولأنه الليل .. ولأنه وقت السحر والخيال .. ولأنه السيرك الليلي .. ولأنهحتي إن لم تكن من هواة السيرك -مثلي- ستشدك وبقوة احداث الرواية الغريبة للنهايةالرواية تبدأ من وجهة نظرك أنت، وأنت تري سورا يحيط حلقة سيرك غريبة، بل عدة حلقات من السيرك ، خيماته مخططة باﻷبيض واﻷسود، بل وقطعة اﻷرض المحيطة به كلها مخططة بنفس اللونينالسيرك ظهر فجأة في وسط الحقول علي أطراف المدينة .. لوحة في مدخله تقرأها \"سيرك اﻷحلام - تفتح اﻷبواب بحلول الليل، وتغلق عند مطلع الفجر\"ستقف، ستنتظر ، حتي يحل الليل وتدخل الخيمة ... ولكن الرواية ستبدأ أحداثها، لذلك ستنتظر بين كل بضعة فصول لتري ما بداخل أحدي خيمات و حلقات ذلك السيرك الذي دخلته ... لتشاهد ما بها وتستكشف السيرك كما تستكشف وتتابع أحداث تلك القصة الخيالية المليئة باﻷحداث*************************2- ولأنها تنقلك لعالم ساحر .. ولأنها كقصص الجنيات الخيالية ولكن بأطار مناسب للعصرقصة جنيات خيالية فريدة حيث أنها أساسا لا تبدو لك بأي حال من اﻷحوال كتلك القصص، فهي تبدو كرواية عادية ..ولكن في قلبها ستجد ذلك الخيال والسحر ، الحب والصداقة و التضحية و الغموض و اﻷبهار مندمجين في مزيج فريد بين أسوار هذا السيركعندما تظن انه لا وجود للقصص التي قد تقلب حياتك كما في القصص الخيالية..تأتي تلك الرواية لتقلب لك فكرتك عن العالم وتجعلك تنظر لأي شئ نظرة سحرية حالمة*****************************3- وﻷنها عن لعبة تحدي بين متنافسين أثنين...لا تنتهي إلا بفوز أحدهماتبدأ اﻷحداث في أواخر القرن التاسع عشر برهان بين برسبيرو الساحر الإستعراضي و السيد ألكسندر ذو البذلة الرمادية ، لعبة تحدي بين إبنة برسبيرو ذات الموهبة السحرية الغريبة و فتي يختاره السيد أ. ويعلمه الخدع السحرية ليضاهي الموهبة السحرية الفطرية ﻷبنته ... علي أن يبدأ ذلك التحدي عندما يكونا مستعدان ,فهما مازالا أطفالا وقتها .. ولا يتقابلا أو يتدخل أيا منهما في عمل الأخرلن تعرف كل قواعد اللعبة ، ولا المتنافسان نفسهما يعرفانها ولكن يبدو أن التحدي بدأ عندما قرر رجل العمل الترفيهي السيد تشاندريش أن يقوم بعملا مبهرا ، أن ينشئ سيركا مختلف عن أي سيرك سبقه ، وهنا يبدأ السحر والخيالتأتي سيليا أبنة هيكتور \"بروسبيرو الساحر\" لتقدم نفسها للسيد تشاندريش للعمل كساحرة أستعراضية تقدم الخدع السحرية في حلقات السيركويستقبلها هنا ماركو, المساعد الشخصي للسيد تشاندريش... والذي يعمل لديه بأمر من أستاذه..السيد أ. ذو البذلة الرمادية*****************************4-.. ولأنها قصة متعددة الشخصيات .. ولأنها قصة متعددة الأبعاد..ولأنهاأذن هي ليست قصة سيليا أبنة برسبيرو الساحر وماركو تلميذ السيد أ والتحدي بينهما فحسبهناك العديد من الشخصيات ,بل وبعضها يحدث في زمن يسبق الأخر ولكنك تقرأه في تمازج غريب وجذابكل شخصية عمقها علي حسب دورها في الأحداث, كلهم يربط بينهم خيط واحد...خيط السيرك الليلي مهما أختلف الزمن الذي به قصتهم, سواء عاملين به, من مؤسسيه أو من زواره الحالمين هناك الفتي الصغير بايلي أبن أحد المزارعين بأمريكا والذي أنجذب لبوبيت الفتاة ذات الشعر الأحمر التي ولدت بالسيرك يوم إفتتاحه هي وأخيها التوأم..وصارا من أعضاءهستجد هناك أيزوبيل قارئة أوراق التاروت الجميلة وحبها تجاه ماركو , قصة السيد تشاندريش وطموحاته العالية, السيد فريدريك صانع الساعات الذي يصمم ساعة بديعة للسيرك ,وبالرغم من اقتصار دوره عند ذلك الحد ألا أنه يقع في الحب...حب السيرك وساحرتهوهناك التوأمان برجيس..الأختان اللتان يتأثرا بالقوة الغامضة للسيرك بالرغم من أنهما مجرد مشاركتين في التأسيس بعيدا عن السحر..إلا أن حركة الزمن تجعلهما يشعرا بأن شيئا ما ليس علي مايرام5-.. ولأنها عن الزمن ومروره وقسوته ... ولأنها ومع رفض الأختين برجيس للثبات العجيب برغم مرور الزمن..كانت شخصية أخري تسعي للخلود الكاذب وتجنب مالا يمكن تجنبه أبدا..الموتولكن الزمن دائما ما يغير كل شئ مهما حاولنا أيقافهوهذا ما نراه في تلك الرواية ولأنها عن اليوتوبيا التي تتحول للأتجاه العكسي.. ولأنها عن الأحلام التي تتحول لكوابيس ولأنها عن تلك التغيرات التي ما كان لها أن تكون, ولكن يغيرها ويشكلها الزمن 6- ولأنها عن قصص الحب التي ما كان لها أن تكونما كان من المفترض ألا يحدث في لعبة التحدي التي راهن عليها برسبيرو الساحر والسيد أ. بإبنة الأول و تلميذ الأخير قد حدث..ألا ينخرط المتنافسان في التحدي في شئ مشترك..ألا يتقابلان ..أو المهم ألا يتعلقا ببعضهما البعض, أو يقعا في الحببالضبط كقصص الحب الشهيرة التي ما كان لها أن تحدث, كمثلا أخرهم كاتنيس أيفيردين و بيتا في ألعاب المجاعات قد بدت لي بداية قصة الحب تلك غير مقنعة بشكل كافي أو غير مرضية..ألا أن التتابعات بالنهاية جعلتها بشكل ما مقبولة وملائمة للنهاية وفكرة الرواية وككل قصة حب صراع..لن تتخيل كيف ينتهي, وهو أجمل مافي قصة الحب تلكولكن تظل قصة تعلق بايلي الصغير ببوبيت والسيرك هي القصة الأجمل..بالنسبة ليوأيضا وهذا الأهم تعلق الحالمون بالسيرك... وتلك هي النقطة الأخيرة في الريفيو*****************************7- ﻷنها عن الحالمون ....وحتما ستجد نفسك منهم بالأخص إذا ما كنت تقرأ هذا الريفيو بعد التحذير في البدايةالسيرك يحقق نجاحا ضخما، هو يظهر فحسب بين عشية وضحاها وسط الحقول بأطراف المدن المختلفة دون سابق أنذار..السيرك كما وصفته في بداية الريفيو ، نفس ذلك السيرك الذي دخلته أنت نفسك بمجرد دخولك صفحات الرواية,أو دخولك سطور هذا الريفيو وستخرج منه بنهايتها بعد زيارات لا بأس بها لحلقاته وخيماته أيا كان سير اﻷحداث بالنسبة لمصير السيركوكأي شئ جميل ,ساحر , خلاب ..سيخلب ألباب عشاق السحر والخيال , سيودون زيارته دائما ,يسعدون دائما بلقاء أشخاص لا يربط بينهم أي شئ مشترك سوي عشقهم لهذا السحر والخيال,يتقابلون معهم كأصدقاء حميمين وينخرطون في أحاديث مطولة عن ذلك السحربعضهم قد يخصص ميزانية خاصة للتتبع ذلك السحر عبر المدن مهما كلفه من المال والوقت, يعشقون إقتناء التذكارات منه ويحتفظون بها بتغليفها كما هي, يراعونها كأنها أحجار نفيسة يرون في هذا الغذاء الروحي من السحر والخيال والجمال أمرا هاما لتجميل الحياة وجعلها أكثر قابلية للعيش بها ,أكثر قدرة علي تحملهابعضهم حتي يعشق الكتابة عن ذلك السحر, يتشارك مع الأخرين تجربته الفريدة بإسهاب من خلال كتاباته مقالات ومقالات يصف بها كل مايحتويه ذلك المكان الساحروهنا .... وجدت نفسي من ضمن شخصيات الروايةبالنسبة لي شعرت أن السيرك هو قراءاتي المختلفة , الروايات التي أعشقها وعشت في عوالمها والتي سعدت عندما وجدت مجتمع به الكثيرين من الحالمين هنا في الجودريدز مكتبتي هي كمقتنيات السيرك التي اعشق الحفاظ عليها بجمالها وسحرها.. الريفيوهات التي أكتبها لا غرض منها سوي نقل تجربتي في العوالم السحرية مهما بلغت درجة واقعيتها التي أعيشها بين صفحات أي كتاب, أحاول عرض جزء لما شعرت به كرسالة أو هدف من تلك الرواية مهما بلغت بساطته بإختصار قدر الإمكان كي لا أفسد علي من يرتاد ذلك السحر متعة إكتشاف المزيد بنفسهولذلك أحتفيت بتلك الرواية التي جائت من عالم الروايات التي أفضلها , كعالم هاري بوتر الذي أحاول الكتابة عنه كل تجربتي مثلا في مقالات ومراجعاتوبالرغم من أن قد يكون لي ملاحظات طفيفة عن بعض نقاط الحبكة ، إلا أن الرواية قد نجحت وبشدة في تعريف السحر الموجود بالعالم من حولناو أيضا تعريف سحر الرواية وسحر القصة كما ورد في الفصل القبل الأخير \"قصص\" ربما هو الخلاصة لأهمية القصص..ومن بين سطوره إخترت أغلب المقولات التي أستخدمها خلال الريفيو أدعو لقراءتها ودخول السيرك الليلي كل الحالمين، ﻷني متأكد إنكم ستجدوا جزءا من عوالمكم المفضلة بها، بل جزءا منكم أنفسكم بها..وعندما تخرجوا من مخيمات ذلك السيرك بمطلع الفجر ستشعروا فعلا بأنواع السحر التي حولنا\"وﻷنها من الروايات القليلة التي ما أن تصل إلى أعتاب صفحاتها القليلة الأخيرة، تشعر أنك تريد التوقف فقط للعودة للرواية يوما أخر لأستكمالهاألا انتهي رحلتك فيها أبدا بالرغم من توقك لإستكمالها\"ولأنها عن السيرك الليلي الذي فعلا قدم نموذج للقصص الساحرة...بإستخدام رمزا جميلا مخطط بالأبيض والأسود , ولمسات بسيطة من الأحمر القرمزي ولأنها ولأنها ولأنها... :)محمد العربيمن داخل سيرك الأحلاممن 24 نوفمبر 2014إلي 4 ديسمبر 2014****************************************************المحطة القادمةأول قرائتي للكينج ستيفين كينج"}, {"Review": "i posted this review in case anyone needs a reminder that nothing is safe and death comes for all of us and life is just an endless cycle of suffering and disliking books you thought were your favorite.uh. find it here: https://emmareadstoomuch.wordpress.co...-----------I did not care for this book, which has sat on my all time favorites shelf for two years, AT ALL.There’s instalove, because of course. Characters are either a) horrendous or b) flat or c) somehow both??? Every other sentence is actually two forced together by a comma, because we all full-on adore a good comma splice amiright. Predicates suffer without subjects. The whole thing is so horrifically, tragically, life-bendingly slow and so boring it took me 9 days to suffer through it.However.The setting is glorious, magical, awe-inspiring, creative, unreal, unique, fascinating, and altogether so painfully lovely any reader with half an imagination will be dying to pay a visit. DYING, I tell you.It’s better than Hogwarts. Better than any fantasy novel. It’s life-changing and gorgeous and all around my favorite setting for all time forever.BUT.Don’t forget.This book is also really bad.So how, pray tell, do I f*cking rate something like that? How do I review it???I guess I’ll backtrack a little and cross my fingers for some fresh #inspo.The Night Circus is a sprawling book (this is a nice way of saying it takes place over like a million years and is still somehow boring). We follow the creation of le Cirque des Rêves, which is an entirely black and white circus with some delicious snack options that takes place at night. It arrives without warning, no announcement precedes it, etc etc, you’ve heard the quote.Something that should make this more interesting and instead makes it, in a shocking twist, much more boring, is that the circus is also the venue for a long-term magical battle.Celia and...sh*t what’s his name...Marco? Is it Marco? Okay yes it’s Marco. Celia and Marco are two magician people (illusionists) who are both involved in the circus and use it to one-up each other until eventually they get way too busy making sweet sweet love to even try to be interesting.It’s less hurtful because they were never interesting, really.So that’s the plot but I cannot emphasize enough that it does not matter, is really boring, and only serves to take away any number of pages from just describing the circus. Straight up if this was 600 pages of unbroken description...five stars boi.But it’s not. And here we are. Dealing with these cretins. (Marco, by the way, is the sh*ttiest person in the world and makes Boring But Otherwise Mildly Unpleasant Celia seem like a goddamn saint.)As mentioned, the characters are, without exception, boring or bad or otherwise unpleasant. There was exactly one individual I liked, and said person was taken out of the picture faster than I can say “what the f*ck why do I never like any books I loved this book literally two years ago what is going onnnnn.”And I can say that surprisingly quickly. (Because of practice. Because of all the times I’ve said it.)God I hate the name Marco on this dumbass white boi. Unrelated but I do.Speaking of that warty wimp piece of sh*t, T H E I N S T A L O V E! If I have ever read a worse “““love””” story (love in excessive quotes because I’m prettyyyyy sure you can’t be in love with someone just because his eyes are such a lovely green!) I cannot recall it. Marco and Celia are nasty together. Not because they’re cruel (although Marco is, to an innocent - albeit boring - woman), or because they’re gross in the sense that, like, a witch in a live-action Disney movie is gross (although it inspires a similarly visceral disgust in me): because they are sooooo lovey-dovey and emotive. Right away. And also for all time forever with no relief.Enough o’this.Bottom line: instalove. Horrible characters. Terrible (nonexistent) plot. BUT ALSO THE BEST SETTING EVER WITH NO EXCEPTIONS. I don’t know, man. You decide.-----------PRE-REVIEWi did not like this book at all. also, i loved it. (both of these things are equally true.)review to come, once i get that sh*t sorted-----------CURRENTLY READING UPDATEme: *moves to college*me: *has literally no time, doesn't open laptop for 3 days, has had a total of 35 minutes to read*me: hmmm...i think it's time to pick up this 500-page, all-consuming fave of a book for a reread wish me luck in my bad decision making!!! you have to, condemning my horrible choices is mean!!!!!!"}, {"Review": "I started reading The Night Circus on 8/15/17 and finished it on 8/21/17. This is my second time reading this book. It is an amazing read. The writing is so magical. I can’t read any other circus books without thinking of The Night Circus. I feel offended when I read The Nowhere Emporium and saw how the author copy almost every idea off of this book. I can’t read Caraval without putting it on hold to read this book again. The way Erin Morgenstern describe the circus is magnificent. The world building and the story is as smooth as pearls. I can’t get enough of this story and the author’s writing!This book started out in the present day when The Circus of Dreams arrived without warning. This circus only opens at night which makes people in town wonder why. As soon as the doors open, everyone gasps in amazement. The story then go back to 1873 to introduce Celia Bowen, daughter of Hector Bowen (aka Prospero the Enchanter), a magician. The magician likes what he saw in Celia after their sudden meeting and went to contact the man in the grey suit (aka Alexander H.). They meet where they discuss a challenge that will take place in the future, Celia Bowen versus Marco Alisdair, a boy the man in the grey suit found at an orphanage. Many years passed by while Celia and Marco trained, separately and differently, not knowing each other or much info of the game. It’s important to pay attention to the date at the beginning of each chapter because it goes back to how the circus started to the present day where readers attend the circus to somewhere in the future where Bailey is predicted to be involved in the circus. There is a lot involved in this book and many characters to know. All of the characters are likable, from main to supporting. This book is told in the third person point of view with many angle views to an event.This book is impeccably written. I love reading it so much and I don’t ever want it to end. I wish there was an epilogue in this book that will give me a glimpse to what the future brings for the characters, especially Poppet and Bailey. I know it’s left for the individual readers’ interpretation but I personally want the author to conclude it for me. I love the design of the game. It’s vague to start out with but fall into place in the end. The writing in this book is addictive. My attention was on this book all the time. I really like Celia because she does awesome magic. I also like Poppy and Widget, especially Widget’s bottles and stories. Marco’s magic is cool too because I can’t imagine how much he can do just by reading a lot of books. This book is full of suspense and can be summarized as a love story. I highly recommend everyone to read this book! Reading the second time is definitely better than the first!Pro: awesome cover, beautifully narrated, unique characters, magic, suspense, couldn’t put down, fast pace, page turner, a love storyCon: noneI rate it 5 stars!***Disclaimer: I borrowed this book from the library and my opinions are honest.xoxo, Jasmine at www.howusefulitis.wordpress.com for a detailed review"}, {"Review": "Holy. Crap. Excuse my language but holy crap is the only way I can accurately portray what I am thinking now that I am done this book. This is, without a doubt, my favourite book I've ever read. Ever. There is nothing that compares or even comes close to how I feel about this book. If I could choose one fictional world to live in, I would sacrifice Hogwarts to go to this circus.For the first time ever, I wrote a list of things I wanted to talk about in my review. I just don't want to forget anything.To explain The Night Circus to someone would take ages. It is impossible to explain this book without telling the entire story and giving away spoilers. The blurb of the book does a good job but really doesn't portray the book as amazing as it is. This book is a puzzle. In the beginning there are so many characters and storylines that are to separate from each other that it initially feels like you're looking at a brand new 1000 piece puzzle and you have no where to start. But gradually as you read you get the frame of the story built, like the outside of the puzzle. Then you work on the inside and as it starts coming together you start seeing the brilliance of it and things you never noticed before and that shock and surprise you. This book does that. When the pieces of this puzzle start coming together the book goes from wow to amazing. There is no better way to describe this book than a puzzle.The Night Circus manages to bring you into another world entirely. I just spent the last few days in an entire different world than the one I am currently in and I didn't want to leave it. Morgenstern manages to create this amazing setting in your head with this vivid imagery and description. Truly some of the best writing I have ever seen. I almost hate her for creating a place where I cannot go because I wish more than anything I could see this circus in person. Although, she does manage to make you feel like you are apart of the story, like you're more than just a bystander watching everything happen. You feel like you play a key role in this story.Another aspect of the book is the little bits where she is writing directly to you. Telling you to imagine that you are in the circus. I thought this was for an added bonus, trying to make it seem more real, but at the end finding out what it was actually was the most fitting ending. The entire book was brought together full circle with that last line. The characters are outstanding. I won't go into details with all of them because there is simply too much to say and not enough words left in my mind to explain. The characters and character development were stunning. If I could give her an award for writing I would. They are intricate and delicate and strong and extremely complex and they are all amazing. And for once I found a book where I didn't hate a single character. I didn't even dislike a single character. Even the background characters that are unimportant are loved because they are all so important to the story. They are the puzzle piece to the story that, without this piece, the entire puzzle falls apart. So kind of like the glue.This book is not confusing, at all. It has a lot of things that you don't understand, but it brings with it a sense of patience. There is no rush to find anything out. And I love that. I've never felt that before. Things you don't understand are all eventually explained, but even if they aren't you don't care. The ending is still a bit more than I fully understood, but I just don't care because it was all so beautifulI doubt anyone has read my entire review for this book, but if you have managed to read to the end of it and you are still not convinced to read this book, I STRONGLY urge you to do so. I am so passionate about this book and I have a feeling I will live to love it for years and years to come. Such a book hangover inducing book though.Book Challenge book #42: A Book With Magic"}, {"Review": "If I had to describe this book in one word, that word would probably be...wondrous. This story made me want to smile, frown, laugh, and curl up into a ball and cry. Try to imagine someone taking Carnivale, Somewhere in Time, Something Wicked This Way Comes, and The Prestige and mashing them all together into a poetic, stunning piece of fiction with a beautifully melancholic, bittersweet ending. It made me crave magical autumn nights spent in a circus that defies the conventional laws of the universe, and somehow made me nostalgic for something I've never actually experienced. The imagery alone deserves the highest praise, and it is complemented by a powerfully poignant tale of love and grief, desire and loss, the magic that is all around us, even if we can't see it. It's not a fast-paced tale, it is meandering, subtle, and completely amazing. This is the kind of story that stays with you well after you've finished reading, a story that makes you gaze into the distance and sigh every time you realize Le Cirque de Reves hasn't materialized in your town overnight. For some reason, this book reminds me of autumn, my favorite season (perhaps due to the aforementioned similarity to Something Wicked This Way Comes), and I think perhaps it will become a yearly read for me, when I inevitably begin to feel that pull to see orange, smell pumpkin, and hear the dry rustling of dead leaves as they dance down the street.My favorite part: \n\"They stand entwined but not touching, their heads tilted toward each other. Lips frozen in the moment before (or after) the kiss.  Though you watch them for some time they do not move. No stirring of fingertips or eyelashes. No indication that they are even breathing.  \"They cannot be real,\" someone nearby remarks.  Many patrons only glance at them before moving on, but the longer you watch, the more you can detect the subtlest of motions. The change in the curve of a hand as it hovers near an arm. The shifting angle of a perfectly balanced leg. Each of them always gravitating toward the other.  Yet still they do not touch.\"\n "}, {"Review": " \"People see what they wish to see. And in most cases, what they are told they see.\" Okay, so I was ever so slightly disappointed by this one. It is loved by so many and I just felt certain that I'd love it too. There were parts I absolutely adored. It had a strong start, 2 young children are bound into a 'game' or 'challenge' that can start at any time, and neither of them fully understand the rules or how a winner is declared.As the circus itself is created, I loved the descriptions of the numerous magical tents including the cloud maze, the labyrinth, the ice garden and so much more that just set the atmosphere in the circus. I loved Poppet and Widget, and Bailey - they are probably my three favourites.What I liked less was the romance, or insta love if you will. Because I was not expecting it, and it isn't mentioned in the blurb I felt cheated. I came for a wonderfully magical tale about a circus, friendship etc. I didn't need or enjoy some all encompassing and oh so convenient romance thrown in - but this is just me, and I never do well with romances in books at the best of times.I also wasn't sure how I felt at the ending (view spoiler)[ either Celia or Marco has to die, but they manage to find a way to die, but not quite die? Again it seemed very convenient that they were able to cop out (not that it wasn't nice that they were able to cop out, but still...) very soppy and romancy and again, not what I came for.  (hide spoiler)]I loved the writing, and the descriptions of the circus and the characters - so many wonderful characters to love, just a few little bits that lessened my enjoyment.3.5 stars****************************************************************3 stars? Maybe 4 stars? I need to mull it over. Rtc"}], "Image": "https://images.gr-assets.com/books/1387124618l/9361589.jpg", "Desc": "The circus arrives without warning. No announcements precede it. It is simply there, when yesterday it was not. Within the black-and-white striped canvas tents is an utterly unique experience full of breathtaking amazements. It is called Le Cirque des Rêves, and it is only open at night. But behind the scenes, a fierce competition is underway—a duel between two young magicians, Celia and Marco, who have been trained since childhood expressly for this purpose by their mercurial instructors. Unbeknownst to them, this is a game in which only one can be left standing, and the circus is but the stage for a remarkable battle of imagination and will. Despite themselves, however, Celia and Marco tumble headfirst into love—a deep, magical love that makes the lights flicker and the room grow warm whenever they so much as brush hands. True love or not, the game must play out, and the fates of everyone involved, from the cast of extraordinary circus performers to the patrons, hang in the balance, suspended as precariously as the daring acrobats overhead. Written in rich, seductive prose, this spell-casting novel is a feast for the senses and the heart."}