{"Name": "Queen of Air and Darkness", "Image": "https://images.gr-assets.com/books/1510447136l/13541056.jpg", "Reviews": [{"Review": "What do you mean this trilogy is over? It’s 2 am and I just finished this. Now I need to cry myself to sleep because what do you mean this trilogy is over??Full RTC.Buddy read with my girls: Amy, May, & Maram. ♥ \nUpdate Nov/4/2018:\n holy shit there’s one more month left you guys holyshitholyshitholyshit\nUpdate 12/11/2017:\n COOOOOOOOOOOOOOOOOOOOOVER REVEAL GUYS GOD I AM SO DAMN EXCITED. BUT DECEMBER 2018?! THIS IS WAY TOO LONG HELP.\nUpdate 8/9/2017:\n GUYS!!! Release date has been pushed forward, I repeat, RELEASE DATE HAS BEEN PUSHED FORWARD! It's now set for Fall 2018 release!!!!!! I may or may not be crying right now.\n24/5/2017:\n That moment where I have to wait TWO DAMN YEARS for this. Where can I find a time machine???? After the ending of Lord of Shadows, I won't even make it through today, let alone two more years. :) :) :) :) :) :) :) :) 730 more days:) :) :) :) :) :) :) :) :)"}, {"Review": "1.) City of Bones ★★★2.) City of Ashes ★★3.) City of Glass ★★★1.) Clockwork Angel ★★★4.) City of Fallen Angels ★2.) Clockwork Prince ★★★★5.) City of Lost Souls ★★★★3.) Clockwork Princess ★★★★★6.) City of Heavenly Fire ★★★★★*.) The Bane Chronicles ★★★*.) Tales from the Shadowhunter Academy ★★★1.) Lady Midnight ★★★★★2.) Lord of Shadows ★★★★*.) Ghosts of the Shadow Market 8/10\n\n“There was blood on the Council dais, blood on the steps, blood on the walls and the floor and the shattered remnants of the Mortal Sword.”\n\nFriends, it has been a ride. I have spent the last six months reading everything that Cassie Clare has created for the Shadowhunter world, and it was all leading up to this moment – the release of Queen of Air and Darkness. And friends, it was so worth it. Not only was reading all of these books and stories, and falling in love with so many of these characters and worlds, a highlight in my reading year, it was just a highlight in my 2018. And I just want to thank each and every single one of you that came along with me on this journey. \n\n“Blood always matters, to the wrong sort of people”\n\nAnd this book picks up immediately after the events in LoS. Fascists are trying to control the Clave and dictate how Downworlders should be treated. In Faerie, the Seelie and the Unseelie court are trying to hurt each other, while the Unseelie King has something that the Seelie Queen doesn’t want to live without. Warlocks are hurting, so many of our main cast of characters are missing, and so many people are grieving the loss of loved ones. \n\n“Sympathy is common. Knowing the exact shape of the hole someone’s loss leaves in your heart is rare.”\n\nQueen of Air and Darkness is truly a love letter to grief. The first section of this review is going to be spoiler free, so I’m going to try to be really vague. Ty is choosing to ignore his grief, Alec is throwing himself into work and wanting a better world because of his grief, Julian thinks revenge is the only way to work through his grief, Emma has finally made headway with her past grief, to only be forced to experience more all over again. We see parents grieving the loss of their children, children grieving the loss of their parents, and everyone grieving the loss of loved ones because of wars they didn’t ask to be a part of. But that’s what happens when you love people, and you let them in, because nothing is permanent, and grief is inevitable. There is no wrong way to grieve, but you do get to choose the actions you perform in the name of that grief. And we get to see people make a lot of hateful choices, and take a lot of hateful actions, because of their grief; Cohorts and fae queens and kings alike.And this third and final installment in The Dark Artifices series does get rather dark, so please use caution. Content and trigger warnings for hate speech (always challenged and always negative), threatening to out someone, talk of wanting to sexually assault someone, self-harm, death, loss of a loved one, murder, torture, captivity, blood depictions, strong depictions of grief, trauma, and depression, talk of suicide, a lot of violence, and war themes. As always, Cassie is so very inclusionary and gives us so much rep that is very respectively done. From so much sexuality and gender representation, to racial diversity, to giving us a main character on the autism spectrum, to body diversity, to really respecting mental health in this book. I’m not saying that Cassie Clare is the pinnacle of what representation in books should be, but I’ll be dammed if she isn’t trying, and if she isn’t doing a better job than any other cis white woman writing YA currently. Overall, it is also actually wild how talented Cassandra Clare is, because the cast of her books are so large and expansive, but I’d die for almost every single one of them. I had so much fun reading this last installment, even if it wasn’t my favorite. But I will talk more about that below! I will say that I need The Red Scrolls of Magic, The Last Hours, & The Wicked Powers right this very second. Like, the wait is probably going to kill me. But I’m going to die with the biggest smile on my face. Please use caution reading the rest of this review if you have not read this book and all the series leading up to this book! And as always, I’m going to do a little mini character breakdown on my thoughts and feelings on all the main characters in this book. Spoilers ahead!(Art by Alice Duke!)➽ Emma Carstairs - You all, I can’t even talk about Emma properly. She is my favorite Shadowhunter of them all. I love her, I love her bravery, I love her empathy, and I love how she loves. I’ll be honest, the worst part about turning the last page of this book is knowing that I’ll never be able to read another new book where she is the main character. ➽ Julian Blackthorn - First off, Madalyn pointing out that Julian is probably demisexual added ten years to my life and I needed you all to know this. Next, Julian Blackthorn is my everything and I hate that I’m so weak for this soft boy, but it is the damn truth. Also, because I’m a perv and this needs to be said, Julian and Emma reciting the parabatai vow while fucking? My kink. My fucking kink. Damn. The gifts CC gives us. ➽ Church - The real MVP of this book. ➽ Helen Blackthorn-Penhallow - Helen and Aline are going to be the best moms ever, and I am so happy that Cassie finally let us see this power couple! And I can’t wait to actually see them fall in love during TRSoM, but I know it is going to be my favorite thing in this entire series! ➽ Aline Blackthorn-Penhallow - Okay, Helen and Aline are my TRUE OTP! And Aline literally give me life, while standing up for Helen, during this entire 900+ page story. And I’m here for any story that is a bout an Asian girl getting into a sapphic relationship with a fae girl. I mean, it is kind of my life goal. ➽ Mark Blackthorn - You all, we did it, and CC answered our prayers! And she gave us the polyamorous relationship of my dreams! I will say that I don’t entirely love that they only have their cabin to share their love, but I hope that a lot happens in future books to make this trio able to truly spend all of their lives with one another. But that scene on the boulder between the three of them? 11/10, I will be rereading once a week for the rest of my life. \n\n“All this time we were waiting for you. We loved each other, and it was a great thing, but with you, it is even greater.”\n\n➽ Cristina Rosales - I just love Cristina. I love her friendship with Emma, but I loved her deciding, at her own pace, what she wanted in her life. And she’s so damn strong, while being so damn giving, and she honestly deserves the entire world. Also, no offense, but Cassie Clare also gave her the worst Shadowhunter weapons, imo. ➽ Kieran - I mean, you all know I’m trash for dark (ever changing) haired fae princes who end up being king. But like, I’d love Kieran even if he was none of those things. He is honestly probably my third favorite character in all of the Shadowhunter world. And when all the fae people were remembering all the kind things he did for them, and when the little girl gave him the white flower? Friends, I’m weak, and soft, and crying, and in love with Kieran so very much. ➽ Adaon - Wow, the resident sleeper and true hero of this story. ➽ Kit Rook / Christopher Herondale - Alright, Kit is going to have the coolest power(s) in the Shadowhunter world. But I truly loved how this book officially proved that Kit is going to have an actual claim to rule all of Faerie, and I’m here for it. ➽ Tiberius Blackthorn - Oh Ty, my sweet Ty. You know this necromancy and dark magic are going to follow him all the way through TWP! You all also know that I’m a sucker for siblings who are best friends, and Thule Livvy’s letter actually gutted me. \n\n“I love you. I love you. I love you.”\n\n➽ Livvy Blackthorn - I don’t really understand how ghost Livvy works, or how the connection with Ty works, but it equally breaks and warms my heart. But I do really wish she would have just been able to rest in peace.➽ Octavian Blackthorn - I feel like Poor Tavvy is the character that is looked over, but it is because he is still so little. But I cried really hard when he told Julian that he just wanted to go home at the end. Julian really raised all these kids to be brave, to be strong, and to love always. ➽ Dru Blackthorn - Dru truly has grown up and came into her own during these three books. I love her, and I loved seeing her journey. And I especially loved seeing Ty spend more time with her. I can’t wait to see her grow and shine even more in TWP where she will be a main character. ➽ Ash - Did Cassie really have to give him Rhysand wings? Truly? Honestly? Lord, why? But… I’m here for it, and I also ship him and Drusilla so damn hard already. When he picked up that picture that Julian drew and learned her name? I screamed. I can’t wait for that to make another appearance. ➽ Magnus Bane - You all know Magnus is my favorite. Every book I fall more and more in love with him. And seeing him as a dad? It is truly the best. Also, Magnus having a heart to heart with Ty about gutted me, because it was so damn beautiful. ➽ Alec Lightwood - I honestly feel like Alec was a real shining star in this book. And he is going to completely change the world with unconditional love. And seeing him become Consul of the Clave? I don’t even have words. Alec started out as a character that was hard for me to like, now he’s a character that’s hard for me not to love. \n\n“No shining new world could be built on blood and bones.”\n\n➽ Zara Dearborn - Worst part of this book? That Zara didn’t die. And now she has her own little private city to breed her hate. I am so not looking forward to what is going to come of her and her hateful gang being left alone. Real talk, I would have been like, “We will leave all you Cohorts alone, as long as you give us her!” *winky face* I’m a petty and bitter bitch. ➽ Horace Dearborn - Thank you, next. ➽ The Kelpie (that Julian saved) - I always love the magical creatures of stories, that come and help and save that day. But this was too damn much for me. TOO DAMN MUCH. ➽ Manuel Casales - This guy is so chaotic evil. And I’m so bitter that he didn’t die while Emma and Julian were on their wild rampage. ➽ Diego Rosales - I also really couldn’t ever truly like Diego. Yeah, he did Kieran a solid, and I respect it, but I still never really liked him. He is one of the few side characters I’m okay saying goodbye to. ➽ Jaime Rosales - I feel like CC is just going to give Dru all the options between Ash, Cameron, and Jaime, but Jaime is the one that skeezes me out for some reason. I just, don’t want it to happen. Nice dagger gift and all, boy no. ➽ Diana Wrayburn - I will say that I was a little uncomfortable with how Julian and Emma found out about Diana being trans, but I am honestly just so happy that she is living her best life now, while being able to be open. And the talk she has with Julian and Emma, when she is like, “No, I’ve always been a woman.” Praise/bless. Give me an entire Diana series, please, Cassie Clare. ➽ Gwyn - Wow, the best character in the entire Shadowhunter universe. The blessings. ➽ Catarina Loss - Catarina is the best side character, and she does so much good, and she is so pure, and I wept extra hard when she stood by Magnus at his wedding. Like, these warlocks put me in my feels every single time. ➽ Ragnor Fell / Shade - And this warlock just makes me laugh so damn hard. And I cheered out loud when the reveal actually came to fruition! I can’t wait to see even more of him with Ty in Scholomance. ➽ Annabel Blackthorn - What a missed opportunity in this book to not give Annabel a better story. I’ll talk more about this below, but Annabel deserved better, especially with how breathtaking this cover it.➽ The (old) Unseelie King - I don’t know if I just forgot, or if I never picked up on it, but this dude had a half skeletal, half handsome face? That’s actually badass. ➽ The Seelie Queen - This bitch. She legit just shows up in every book, in every timeline, just to rain on everyone’s parade. ➽ Tessa & Jem - I screamed all over again after they announced they were pregnant. And now that they are going to raise a Herondale, Kit, so he can be safe? Ah, I just love this little family so much.➽ Izzy & Simon - I really wish they played bigger roles in this story, and that we would have received two weddings in this 900+ page tome!➽ Clary Fairchild - I won’t lie, I was really disappointed when we found out what Clary’s vision really was. God, I mean, I knew Cassie wouldn’t actually kill her, but I wanted to so much more, and it was a really anticlimactic reasoning. ➽ Jace Herondale - “I would die for Jace to shoot finger guns at me” - Lea, 2018. Real talk, Jace had me actually laughing out loud during this entire book and I loved and hated every single second of it. Especially his banter with Kit, I mean, Christopher. And when Jace voted in Alec for Consul of the Clave? The tears just won’t stop, friends. ➽ Evil Jace Herondale - Lord, why do you want us to suffer? \n\n“There is nothing simple about vengeance, and nothing pure”\n\nOkay, so one element or “trope” that I hate when books do is that alternate and/or parallel universe storyline. And I never, in a million years, would have guessed that Cassie Clare would pull this in QoAaD, but here we are. I’ll be honest, I kind of loved the concept of a Mad Max world where Sebastian Morgenstern not only won the Dark War, but now rules, but the entirety of Part Two was a little too much for me. Especially because they didn’t even bring back Thule Livvy and Thule Raphael. And in return, it almost felt like tragedy porn seeing them live again. And now we have an evil Jace in our world and on the loose to… kill Clary? Love Clary? To do something with Clary? Yikes. But the true reason I am giving this book four stars, and the reason I probably think it is the weakest book in The Dark Artifices is because of Annabel. What a missed opportunity to have an amazing villain character. Instead, she dies at 60%, only for us to be rickrolled with a demon pretending to be her. She died so easily, too, and it felt so bad. I mean, she is on the cover of this book! And the title is completely her! Why would she barely show up in the 900+ pages, have the lamest death, and have no character development when she could have been such an amazing and intricate character. \n\n“Please don’t leave me in this world without you.”\n\nAnd then let’s not forget about Julian and Emma turning into giant, angel versions of King Kong, picking up and yeeting the bad guys. Even though, Zara conveniently didn’t get yeeted. Like, for a second I actually thought Emma was going to die, and then, in turn, Julian would have died, too. But when Emma said, “Let us burn.” I thought they would just die and become angels together, and my emo and sappy ass would have loved that. But instead, the whole wild giant thing happened, and then words of their loved ones “healed” them. Which was eyeroll worthy, but also sweet. Yet, when the heavenly fire didn’t damage ANYTHING except their parabatai bond? You all, I can’t. It just feels so unsatisfying. And Emma and Julian really are my favorite couple in all things Shadowhunter, but even I can’t just accept that and pretend it was realistic. I honestly think CC just wrote herself into a hole, and putting a bright and shiny bow on it was the only option, but it doesn’t mean I have to like it. I will also say that the ending was completely and utterly fanservice, but it was fanservice that I ate up with a spoon and asked for more. Magnus and Alec’s wedding was everything, and Alec’s proposal made me actually ugly cry. Just seeing everything that these two have been through, all the lives they’ve impacted, all the family they have made, they were just so damn deserving of this happiness. And then the short story after the epilogue? With Jace and Clary in that greenhouse? God, that greenhouse. It really feels so full circle, doesn’t it? All of these original characters have brought me so much happiness in 2018, and seeing them get moments of pure happiness at the end of this book was honestly everything. \n\n“As long as you exist and I exist, I will love you.”\n\nOverall, I’d give my life for Emma Carstairs and any of the Blackthorns and I will never forget this reading experience. Picking up City of Bones this year was one of the best decisions I’ve ever made. And now I finally get to wait and suffer for the next thing Cassie Clare publishes with the rest of you! And special thank you to Lea, Sol, Madalyn, Jane, & Amber for allowing me to cry and scream and gush with you! You all made the experience even more special and I love you all! ❤Blog | Instagram | Twitter | Tumblr | Youtube | Twitch"}, {"Review": "The inside dust jacket!!! This is one of the most beautiful covers! Well shit! This book had all the feels in the world!! Sadnesssssss, happiness, anger - ALL OF THEM! I'm happy with this ending. That epilogue! You know what? I said I wasn't going to read any more books she writes in this series because I'm done. But after all of that, I might read the other books coming out to see what else is going to happen. Always makes me nervous with my favorite authors out there because I'm afraid they are going to kill too many of my loves. There are actually books I haven't continued because I know a love is going to die. Guess it's time to buckle up buttercup and read ALL THE BOOKS! Peace, love and apple pie! Mel 🖤🐶🐺🐾😘🦄💕"}, {"Review": "this truly WAS the infinity war of the shadowhunter chronicles, it was so wild to see so many characters from across this universe play a role here and I LOVED IT.I've had like a month to process this book and okay like I don't think my brain and heart will EVER be able to process what this book just did to me but I'm going to try. So, yes below you can read my \nFULL REVIEW OF QUEEN OF AIR AND DARKNESS\n (also, I'm saying now I CANNOT PROMISE THIS REVIEW WILL BE SPOILER FREE OK YOU WERE WARNED)\n“The sky was a road and the stars made pathways; the moon was a watchtower, a lighthouse that led you home.”\nThis book was easily my most anticipated book of the year. I had made a big claim that if Queen lived up to Clockwork Princess, then The Dark Artifices would become my new favourite series of Cassandra Clare's. I don't know how I feel about that now. This ending wasn't as good as the Clockwork Princess ending for me, but there was SO many things I loved about it. I loved the characters, (most) of the plot, the angst, the romance, and seeing all the different series come together (most of the time). But there was some things (the lst 100 pages) that annoyed me so I just couldn't give it a five star even though it SHOULD HAVE BEEN ..... it COULD HAVE BEEN ....... im furious ! Anyways, lets break this bad bitch down: \n“I whisper your name, Ty. I whisper the most important thing: I love you. I love you. I love you.Livvy” \n\nCHARACTERS\nLets start with characters because it's my favourite part of this seriesEmma remains my favourite character, what an iconic queen. I honestly ADORE Emma and she's one of my favourite CC characters ever. She's changed and developed so much between book one and three, but I love what a strong badass she is whilst also being caring and compassionate and maintaining important relationships. It's nice to have a female character who'd badass and blunt but not necessarily cold. I literally love her, and I really want her to punch me in the face because it'd be an HONOUR. Julian for some reason a lot of people don't like Julian but I LOVE JULIAN. He's such an interesting and unusual main male character, especially from Cassandra Clare. So I think he adds a really great dimension to this series and is such a contrast to characters like Will or Jace. AND ANTI-HERO JULIAN FINALLY KINDA ROSE AND I WAS SCARED. All in all I loved his arc in this book .. the dark julian contrasted with actual julian was painful to read but I loved it. YOU ARE IN THE CAGE? I cried. Also, I just love Dad! Julian and how he treats his entire family dfjghdfkj. ALSO WE LOVE A DEMISEXUAL !! KING!!!!!Mark, Cristina and Kieran SO I have always felt meh about Mark. I don't dislike him .. I actually like him quite a bit. I just don't like him as much as some people seem to. I felt pretty much the same about him in this as I always have. I love Cristina and I loved her in this too. But I felt she didn't get as good an arc as the other characters? Her entire plot was pretty much romance which was kind of annoying though I DID LOVE HER TEAM UP IN FAERIE. ICONIC!! Kieran I still feel mixed on. I've never liked him much but he did grow on me a bit in this. I actually kinda ended up liking him even though I still don't care about him on the same level as the other characters. But his character arc was great. Kit and Ty THEY WERE NOT IN THIS ENOUGH?? Okay yes they literally had a major plot arc BUT STILL. Ty should of have a POV but he never did! I also hated the conclusion of their arc ... obviously it's going to be the main focus of The Wicked Powers but it was SO unsatisfying here. I also though Ty's literally had no growth in the 700 pages of this book which was annoying. But I LOVED KIT SO MUCH. Thats my son !!!! I really liked his role in this book and his POVs were some of my favourite. He is fucking iconic and hilarious .. \"you are so forked\", bitch you better BET i laughedDru My unexpected fave of this book. In Lord of Shadows I liked Dru but felt I didn't really know her. She had SO much development and growth in this and I loved her role. I didn't expect to love her so much but I seriously do, and I think of all the characters I am MOST excited to see more of DRU in The Wicked Powers! She stole my heart, I love her. Jaimie and Diego They were in this more than I expected and I didn't .. love it. Honestly I did Not like Diego's chapters much, I just don't care about them that much so their chapters were always the ones that made me want to put this book down. But I did like their characters in relation to their character arc with Cristina.Diana  I LOVE DIANA and I honestly don't have heaps more to say about her?? I liked how she became a more important role in the Clave in this book and I also liked how there was more focus on her being an older sister to Emma and Julian in this. Helen and Aline  MY SAPPHIC QUEEEENS ! I love both of them so much. Aline was such a fun character because she was so different to Helen and even to Jules and Emma in terms of how she handled the kids. Helen was sweet and I LOVED her relationship with Mark in this. Seeing those two interact were some of my favourite parts of this book. Aline and Helen are also so fucking cute jghfkgj it's unfair of Ms Clare to show us gays a pair of gfs that cute when she KNOWS none of us can achieve that irl because all gays are too useless to actually date other gays. \n“Grief can be so bad you can’t breathe, but that’s what it means to be human. We lose, we suffer, but we have to keep breathing.” \n\nPLOT\nQueen of Air and Darkness picks up right where Lord of Shadows ends. I loved this choice but also I WAS IN SO MUCH PAIN. The scenes of Julian crying and Ty passing out were hard to read and seriously I was emotionally wrecked by page 25 I literally had to take a break. I pretty thoroughly enjoyed the first third of this book. The chapters in faerie were exciting and I liked seeing so many different characters play a role. Simon, Isabelle, Jace, Clary and more appearing was so fun and I loved the cameos. The plot in faerie reminded me a lot of Lord of Shadows but I decided I didn't mind it. That fight in the throne room also reminded me of that fight scene in The Last Jedi with Kylo/Rey and bitch I was HOLLERING. The only plot in the first third I wasn't a fan of was Julian's emotions things - I didn't think it was bad but it just came out of nowhere? In no previous books, even when Emma and Julian discuss their \"options\" did him removing his emotions come up so it felt out of nowhere and kind of lazy? The second part in Thule was literally my favourite part of the book which seems to be an unpopular opinion, but I thought it was SO MUCH FUN. It was like a canon AU and I was loving it. Seeing the world as it would have been was interesting, and I loved Emma and Julian's arc in this. The focus on their romance and Julian's choices was great and Thule really allowed a lot of emotional catharsis and tangible contrast between what is and what could have been. ALSO JULIAN AND EMMA FUCKING WHILST SAYING THEIR PARABATAI VOWS WAS HOT AND LITERALLY IS MY KINKThe final section was my least favourite and where everything seemed to fall apart. I felt Cassandra Clare had so many thread and plots and character things to work with and they ended up not coming together great. It definitely felt like she lost control of the story a bit. The climax was .. incredibly disappointing and so cliche. Again, the whole \"Nephilim Parabatai\" thing just came literally out of nowhere. The ending of Julian and Emma's complications with being Parabatai was so lazy and wasn't even foreshadowed as a legitimate option until it randomly happened. Using heavenly fire again also felt lazy and the whole \"family talks you down\" thing was SO cliche. I felt so unsatisfied with the ending here, and I really just can't get over Emma and Julian randomly going giant, throwing around the evil elf army like what the FUCK even was that. It was just messy and weird. \n“Be good, my archer boy. Come back to me.” \n\nROMANCE & ANGST\nSo where the plot let me down, the angst came THROUGH. Honestly I was going into this wanting some sweet, sweet, painful angst and phew, once again the good sis Cassandra delivered. JULIAN AND EMMA .... *kisses fingers* oh yeah thats the STUFF. Like I've said multiple times, I adore them. ADORE THEM. I honestly love their friendship/relationship so much and the whole set up of them being best friend, literally Being Eachother's People, like no one loves them as much as they love eachother ... oh fuck YES thats the shit. I THRIVE off of that. And she delivered in spades .. she really did. AND OH THE ANGST OF DARK! JULIAN. And Dark! Julian being like lowkey hot ... yeah I'm into that. Anyway, truly excellence once again. Mark, Cristina and Kieran ... FINALLY the OT3 we all love and deserve. I see you boring bitches whining about the ending of this love triangle but it is WHAT. WE. DESERVE. Turning your love triangle into a polyam ship? inspired. And it honestly was so well written? That they're all equally in love with eachother?? That Mark/Cristina or Mark/Kieran or Kieran/Cristina doesnt even work because they're all thinking about one another like .. it's mess and I adore it? And the three way ship is perfect?? BUT THE ENDIGN .... I hate that omg ! It was so unresolved which was annoying as fuck but also I stan King Kieran so idk phew that is a tough one. I feel it will also be resolved in The Wicked Powers (IM HOPING)Ty and Kit ... they're so cute aw man. I love Kit's inner monologue around Ty, he's so enamoured with him in such a pure and cute way and there is definitely going to be an arc around him Realising He Is Queer which should be fun. He really is the bi king I deserved. And Ty always recruiting Kit and trusting Kit was so sweet, they're both sweet and even tho I'm an angst DEMON I was rooting for them and their softness. Jace and Clary. LOOK ALL I AM GOING TO SAY IS THEM GOING BACK TO THE GREENHOUSE TO WHERE IT ALL STARTED HAD ME EMO AND ALSO THEM BOTH BUYING A RING ....... INSPIRED\n“You might be in the cage, Jules, but as long as you are like this, I am in the cage with you.”\n\nISSUES\nAlright the gush has been real now it's time to do some quick rants x Although I loved the Thule chapters, I had one huge issue and that is MAKING SEBASTIAN THE VILLAIN. Sebastian is the one behind all this nonsense and I HATE THAT. It is SO lazy to just bring an old dead villain back, and it's fucking annoying. What is the point of TMI and killing Sebastian if random alternate universe Sebastian can just return to fuck it up? I thought that was so lazy, and completely the opposite of what I had come to expect from CC in this trilogy. In Lady Midnight, Malcolm being the villain completely subverted my expectations because she kept setting up warlock = good, and then she undermined it, which was neat. Malcolm was also such a strong villain with interesting and complex motivations. And while I love Sebastian as a villain, he doesn't fit here, and he's just pure evil, which is fun in tmi but ultimately boring to repeat over and over. I felt CC really let down the great start to the series and intricate plot she had set up. I also was ... so sick of the cameos. Does anyone else wish she would just let TMI go?? At first they were fun, but they started to totally eclipse the other, main characters. I don't want a continuation of their plots, I want the Blackthorns story! LET THEM GOOOO. Also, the epilogue totally sets up The Wicked Powers as City of Lost Souls 2.0 and i am ... not keen. And like I said the last 100 pages were just .. messy. I'm annoyed because I SHOULD have given this a five star .. it was going so well. Everything I came for was there. The angst was top notch, the character interactions were great, and the book was fast paced and exciting. But those last 100 pages were too much and just so cliche and weird. And the ending was complete fanservice, which usually I don't mind, but this was WAY too much. I've said this soo many times but I HATE when books with dramatic \"this is going to change everything this is the end of the world\" plots have literally no consequences. Like the tagline of this book was literally \"everything changes\" but in the end nothing happened and everyone got to be happy. LOOK I LOVE PAIN AND SUFFERING OKAY. But I just think it's a super let down and doesn't deliver on my expectations of something Big happening.Okay, I admit the loss of Idris was big and will probably play a big role in the next book .. but again it's the same problem I have with other plot lines. Nothing was finished off in this series ! It was all left for the next one. Which is lazy and unsatisfying. I get her series run on to eachother, but the ending of each individual series should still be satisfying and contained to that series in my opinion. \n“If aught but death part thee and me, Emma,” he said, and pressed his lips to the strands. Emma closed her eyes as she whispered, “Julian. Julian. If aught but death part thee and me.” \nAlright .. that is IT! This is an extremely gushy and messy review I recognise and own it. You'll just have to live with it. PLEASE chime off in the comments I still need to discuss this book I am still in shock"}, {"Review": "This was a wild ride (and a really LONG one). I’ll try to write a review :).EDIT: Mini-reseña en español a petición popular.¿Pues qué decir? Si me conocen, saben que va a ser muy difícil que un libro de -my queen- Cassie Clare me falle, y este no fue la excepción, ¡estuvo buenísimo! Tuvo de todo, y no hubo parte que considerara aburrida, en cada momento estuvo pasando algo y casi me dan once paros cardiacos (???) mientras lo leía. Además, casi lloré en tres ocasiones. Ahora, quiero simplificar esto haciendo listas:Lo que no me gustó:+ Que es DEMASIADO largo, sí creo que le sobraban unas 200 páginas (o tal vez unas cuantas más). A veces siento que Cassie ya los está haciendo largos just because. Solo porque sí.+ Que eran MUCHAS historias qué seguir, muchos plots, muchas tramas, muchos personajes. Teníamos la historia principal (que ya ni estoy segura de cuál es) y teníamos unas 15 más. Cada personaje estaba haciendo algo diferente y ya no supe qué tuvo más peso.+ Que se supone que Annabel era la ultra villana (¡hasta le dieron la portada!) y su participación fue casi irrelevante.+ La decisión de Julian al inicio del libro. Me molestó e hizo que se me olvidara por qué me gustaba el personaje.+ (view spoiler)[La forma en la que se resolvió lo de la maldición de los parabatai. ¡Fue súper conveniente y poco creíble! MUY SENCILLO. SIN CONSECUENCIAS. Toda la trilogía se trata de eso... ¿y lo resuelven de esa forma? BYE. Cassie ya resolvió la vida de todos sus personajes con Fuego Celestial (obvio decir \"todos\" es una exageración, pero ustedes me entienden). (hide spoiler)]Lo que sí me gustó:+ Kit y Ty preciosos. Los amo. (view spoiler)[Pero estos hijos míos tienen mucho qué hablar y resolver en los próximos libros, no se pueden quedar así. LLORO. (hide spoiler)]+ Dru Blackthorn, ¡la adoro! Creo que se volvió mi Blackthorn favorita.+ La parte de Thule me encantó. No sé si sea opinión popular, he leído reseñas de personas a las que se les hizo puro relleno (que ok, tal vez sí lo fue un poco), pero se me hizo muy AMAZING.+ Jace y Clary en este libro estuvieron increíbles.+ La boda. (No diré de quienes, pero ufff esa boda me hizo muy feliz).+ El humor de las hadas, jajaja, las frases que soltaba Kieran eran lo más bonito-gracioso. También Mark de repente soltaba algunas que me hacían carcajear.+ ¡Aline y Helen! LAS MEJORES.Las veces que -casi- lloré:(Todo es spoiler, así que lean bajo su propio riesgo).+ (view spoiler)[Cuando Tessa muere en Thule. MI BEBÉ HERMOSA. (hide spoiler)]+ (view spoiler)[AY, cuando Julian revela que se van a llamar \"Livia's Watch\". (hide spoiler)]+ (view spoiler)[Cuando Alec le propone matrimonio a Magnus, TODA ESA ESCENA. (hide spoiler)]Por ahora eso es lo que puedo recordar. Si le quité una estrellita fue por todo lo que está en la lista de \"Lo que no me gustó\", pero sepan que en general fue una lectura que disfruté de principio a fin y que me hizo fangirlear y gritar de la emoción y de la histeria. ADEMÁS este libro sirvió de \"introducción\" para The Wicked Powers y nO PUEDO ESPERAR. CASSIE, ¡me vas a tener leyéndote 84 años más!"}, {"Review": "This was... a whole mess.**Spoilers are marked in text, and in case character talk was what you were here for, I keysmashed a bit at the bottom of this page.\n\n➽P A C I N G I S S U E S G A L O R E \n\nFuck, you guys, the scope and pacing of this was wild ride. Generally, this just felt very thrown together in comparison to the fairly well-balanced nature of earlier books. Let’s talk some details.First of all, the concept of Thule… is good. [And Melanie’s description of it as a Mad Max version of the Shadowhunters world is honestly real.] BUT it takes up about a quarter of this 900 (nine hundred) page book, and it. has. no. bearing. on the plot. until the epilogue. in which it is used to set up another whole ass trilogy.Also, what the fuck happened with Anabelle? Anabelle honestly has one of the better villain setups Cassie has ever pulled off, and the fact that she does nothing except die, and dies halfway through the book is just. It’s just a mess. I hate it. Just as in… every one of CC’s conclusions I’ve read, I think the first five chapters or so should have been incorporated into the last book. She has a tendency to set up The Final Showdown conflicts at the beginning of the third book rather than at the end of the second, which messes with her flow, leaving us with abrupt book two endings (Lord of Shadows. i loved that book but admit it, this is a problem) and lacking buildup for events in book three.Here is a simple way this couldve been done to this particular book: end it not on the note of (view spoiler)[Livia’s death (hide spoiler)], but on the note of Julian’s trip to see Magnus. This both makes the ending of book two less abrupt and, more importantly, given how weirdly disconnected some of this conflict feels, sets up an approximate book three conflict. Oh, and speaking of villains, remember how Zara was going to die and I was going to be allYeah. I don’t either. \n\n➽F A N S E R V I C E I N P S\n\nRemember back in my review of book one, when Jace and Clary’s heavyhanded but brief cameo was the most I’ve liked them in the entire canon of the universe, and yes it was fanservice but it was fun? Oh man. Good old days. This could have been The Mortal Instruments book #7, City of I Don’t Give A Shit for all the TMI presence. I don’t even know if I’m referring to stuff with earlier characters, because I actually don’t mind that too much. Magnus and Alec, two of the only characters in TMI I actually like, have stopped being done dirty finally; Jem and Tessa are two of my favorite fictional characters and I can’t even pretend to complain about their cameo; even though I never got to their minor presence in TMI part two, Helen and Aline are amazing. So maybe it’s not even about the fanservice; it’s just that the. scope. is. so. so. wide. By this, I am of course referring to: Thule, and the return of Sebastian Morgenstern and his secret?? son?? a character I will not even pretend to give a shit about. And also Emo Jace. And okay, listen, I know Cassandra Clare isn’t exactly trying to get all of her work done completely sans-fanservice: the investment in the characters and relationships is the backbone of her work, what makes it so easy to enjoy. But unlike some of her other books, this just… fell flat? It feels like the heart, the enthusiasm, the genuine love that she poured into The Infernal Devices and earlier books in this series was just... missing.\n\n➽T H E A C T U A L E N D I N G\n\nUh, so first of all, I will say that I didn’t totally 100% hate the actual ending. I just didn't really feel it was built up enough. And to me, it demonstrated just how little progress was made within this book.Here's the thing: of the three main character dynamics used for conflict within this series — Christina & Kieran & Mark, Kit & Ty, and Julian & Emma — only one is genuinely resolved. And the thing is, this lack of resolution sort of works; one dynamic is about half-resolved and just dealing with problems, and one is not even close to being resolved but they're getting a whole series written about them, so fine. But I think my overwhelming feeling upon first finishing this book was... wow, is that all we're resolving? Is that all the progress we've made? Really, in 900 pages? In that case... couldn't it have just been 500 pages?Moving on. The final battle is... sort of cool, but it is awkwardly written, and feels fairly contrived. We know something magic is going to happen at the end, and we hope it'll lead to a somewhat decent ending, but the buildup falls apart just a little on the way. On that topic: (view spoiler)[no one dying. See, I actually hate major character death, so I can’t really pretend to be upset about this, but no one really gets changed permanently by the battle, either? (hide spoiler)] To me, it just feels like this series has been pretending the ending is going to make us all sooooo sad, and it doesn't. It's a series about hope and coming together, which is great — it just shouldn't be talked about as a tragic romance, that's all. \n\n➽I S W E A R, I D I D N’ T H A T E I T\n\nUm… I thought the first 20% or so of this book was really pretty solid? This section was also a lot funnier! Examples of this phenomenon include: ➽“and- julian is like sebastian morgenstern!” *cue Diego laughing really hard*Julian putting his boots on Horace’s desk like a legend➽“you two have really fucked up.” ➽“ever wanted to move objects with your mind?” “sure, sounds great!” ➽“who hates you? I’ll kill them!” which is just a deeply Aline thing to sayI’ve sort of alluded to this already, but the most coherent main theme of this book is the idea of grieving for the lost being a necessary process, and when that theme stands out amongst the generally muddled plot, it’s handled well. Julian’s arc around grief is nuanced and fairly well-handled; Emma’s arc has sort of always been about grief, it’s just that this book realizes it better than earlier books. Ty’s arc around grief is honestly just kind of heartbreaking. Kieran’s arc focuses more around finding forgiveness, but it feels coherent with the rest of the arcs. Alec’s arc (I know) is around worrying about eventual grief and is… honestly better than any character arc he got in TMI? SORRY. For those of you in the comments saying I’m rating generously… I mean, I guess I am. But I can’t actually give this book two stars because, as I deepdived into in previous reviews (#shamelessselfpromo), I like these characters way too much. OH AND. You all know I’ve been talking about this nonstop, but Mark and Christina and Kieran!! Being a canon dynamic!! I really really wanted more out of their buildup, to be honest, because it’s been utterly fantastic up to this book, but I’m just. So so happy. That the polyamorous trio is canon. I’ve been waiting six months but the rest of you have all been waiting years so round of applause for that!!I also think, removing all critique, that juggling ten to fifteen lead characters with any degree of success is incredibly difficult, and the fact that this is even somewhat pulled off is really impressive. I mean, even putting important-in-the-future characters like Dru (who deserved more airtime), Tavvy, Dark Livvy, Gwyn (codename the only man i trust), Cameron, Jaime (who i dislike. just facts), Diego (who i now love!!), and Ash (??) to the side, and even eliminating villains like Zara, Manuel, Horace, the Seelie Queen, the Unseelie King, Annabel, Sebastian, and Dark Jace, and even not counting the massive presence of TMI characters like Helen, Aline, Jace, Clary, Magnus, Alec, and Ragnor Fel — several of whom have actual character arcs in this book — we still have Julian and Emma, Mark and Christina and Kieran, Kit and Ty, and Diana starring as genuine leading characters. That’s a total of thirty-one names including eight leads. Impressive as fuck. \n\n➽E N D I N G T H O U G H T S\n\nNo one has ever accused me of being coherent. →this series could also be called Julian Makes A Bad Decision: News at 11→Everything Diana And Gwyn Have Ever Done. It’s Flawless And Good→There was a line in this book in which Aline’s posture is described as “straight,” which is something no self-respecting gay would write without making a joke. That’s not a flaw. I just think I’m funnier than I actually am.Anyway. Yes, as we’ve discussed, the entire existence of this whole world is kind of ridiculous, but I’m not going to pretend I don’t love it. \nlooking out for:\nThe Red Scrolls of Magic | 2 April 2019Chain of Gold | 19 November 2019The Wicked Powers | sometime, 2022\ndark artifices reviews:\n book one | ★★★★★book two | ★★★★★book three | ★★★☆☆Blog | Goodreads | Twitter | Instagram | Youtube"}, {"Review": "I’m sorry… but did you expect anything less that 5 Stars for my absolute Queen?!Perhaps being parabatai was a weakness that could trap you. But so was any kind of love, and if love was weakness, it was strength, too.Before I get into this review those illustrations were EVERYTHING! They were so beautiful and the detail! It made me so happy!So I’m not going to lie this review will more than likely be rusty as I haven’t done one for quite a while now so I shall try none the less. Just a pre warning in the things I like and the things I don’t like there will be minor spoilers so you can just stop at that point if you haven’t ready this already.Going to this I was a bag of nerves, I knew that it would be heart wrenching after what happened in Lord of Shadows but the way in which grief is portrayed throughout was just so raw and dealt with in different ways by all of the characters. I didn’t know where the story would take us with the final instalment and I’d be lying if I said this was what I expected, but that kind of makes me enjoy it even more.Luckily I’d read all of the tales from Ghosts of the Shadow Market which were very useful going into this because of how much background we got in relation to a specific character so knowing what I did I was very very worried in regards to that, it was very interesting seeing it all come together though!What I love so much about this series is the characters, there’s honestly no one (other than Zara and the Cohort) that I dislike, I love stories that have strong relationships and this has so much love between the characters you can’t help but become invested in them.The way in which it ended, I am so surprised, it’s not what I expected what so ever and now I’m super intrigued to find out what’s to come, if there’s not another series I WILL RIOT!“Some lights were never meant to burn for long.”CharactersTo start with Emma and Julian, honestly all the way throughout I was so worried for what was to come, their love for one another is just so strong and I just wanted them to be happy, IS THAT TOO MUCH TO ASK! Emma is still the strong character from the previous books, and her development from Lady Midnight to this was amazing particularly in one chapter where she realises something and that she has t overcome that and move away from it. My heart for Julian broke, he goes through such a rough patch and seeing what he does to himself DESTROYED me. His care for his siblings and Emma is just undeniable.Then we have the trio that is of course Cristina, Mark and Kieran! I never in my life thought I would enjoy a trio again from Will, Jem and Tessa, but here we are! The balance between them all is just so pure and perfect. They all just fit together in ways that just balance each other out, Cristina is such a loving character and probable;y the purest soul in this book, she is so open and honest and her love for people, ahhh she’s so lovely! Mark is Mark, the things he does and says, they are just so lovable and you know he just tries his hardest to help, the small gestures he does throughout I was NOT coping! Then finally Kieran, I can honestly say that in this, Kieran is my favourite character, He was just so funny and he really came into his own, his love is fierce and when he feels something strongly he will try his best. There is so much I want to say and rave on about but I’m trying to keep this section spoiler free, but I love him!Kit and Ty were the two characters I worried about the most after everything that happened in Lord of Shadows, and I don’t think I’m alone in this thought, Ty has to come to terms with a lot, and boy does it get deep! My heart is broken for him, and it was so sad to see the lengths he went to throughout. Then we have Kit another personal favourite of mine, I am very very intrigued by him. Once again I felt sorry for him, he was trying to help Ty, but at the same time trying to deal with other things going on with himself, he is just too precious!I don’t think I really knew much about Dru, Helen and Aline, just the snippets every now and again. Drug for me was SUCH a good character, I liked her friendships with Ty and Kit and her realising her own self worth, it was just nice to see her being able to do small things to help the people she loves and cared about. Aline was so fierce anything relating to making Helen upset Aline took zero bull shit and I LIVED for it, coming into that environment she handled it so well and I just adored her love for Helen, it was just so sweet. I honestly felt for Helen, she’d been away from her family for such a long period of time and to see her bond with her family made me so happy! At times I felt frustrated for her but the way she handled things I felt so proud!My least favourites… Zara and The Cohort I legit hate them all. They were devious and sneaky (but I love to hate characters) and you can’t not hate them. Now as much as I dislike them some of the things they did were clever but still not a fan, I just want to slap them all and I like to think of myself as quite a nice person aha!Finally Diana, Gwyn, Alec, Magnus, Jace and Clary, I know this is a weird bunch to put together but it’s probably easier this way because it’s just little things. Diana was of course great and what she did YES GIRL! Gwyn once again enjoyed! It was nice to see Jace and Clary again, they’re not my favourite characters but it was still good! Alec and Magnus! I’d forgot how much they were in Lord of Shadows but I honestly love their defiance and how they work together the simple things make me happy! Pre Warning there will be spoilers aheadI love you. I love you. I love you.What I liked?- Some nice little references to previous books (Will Herondale of course)- Ty tryin to get to Livvy, my god my poor little heart, but it was such a Ty thing to do and just ARGH- Seeing the family Dynamics, it was so lovely to see Helen and Aline back- Ty gave Kit his first Witchlight! Come onnnnnnnn- I didn’t mention this earlier BUT the Trio relationship, I never knew I needed this but turns out I 1000000% do, I am here for it! I could go on and on, but I loved Kierans description of why they were perfect as a unit and it was everything!- All of the tension, nothing going right, just forever hoping for some Peace!- Perfect Diego helping Kieran along with Divya, I liked seeing a bit inside the Scholomance- All of the feeeeeeels- Kieran pretending to be asleep because he felt awkward… dead :’)- Helen sitting on Kieran and him asking her to move because it’s painful (these one liners have me every time)- Emma taking the Tapestry… absolute gold!- The names of the Downworlders ”My name is Greg. Greg Anderson.” “It’s Elton John, said Aline grabbing a stamp” - Another Kieran moment… calling his brother a Turnip- Goodbye Arm, you know when you know!- Dru and Kieran with the mugs- That LETTER! I was like no no no no no- Seeing the relationships with so many Parabatai is was very interesting and also heart wrenching at the same time!- Now Julian steps up a lot but what he does in this with sending of the letters and the resistance it was so engaging to read, you could see his thought process and you could see just how smart he actually is. Not only that but the BANNER, I was ugly crying, full blown tears!- Dru asking Kit to teach her things and becoming a True Con Woman!- Kit and just how loving and protective he is towards Ty, he knows how to deal with him and just AHHH I CAN’T!- That T-SHIRT! hahahahahahahahahahaha- The cake :’)- Magnus being able to talk to Ty, it was just such a lovely moment because he just seemed to understand, I know a lot of the other characters too, but Magnus is different in his own way and helped Ty a lot.- Kitten calendars!What I didn’t like?- I wasn’t particularly fond of Thule, I get why it had to happen and I don’t know if it’s because of how I was feeling at the time, I think because it was mainly focusing on Julian and Emma and I missed the other characters at that time.- KIT DESERVED MORE! I am low key sad at how he parted with the Blackthorns and in particular Ty, but I kind of get it if there’s more books to come because SURELY it will be about them reconnecting maybe? Although I do like that he’s with Jem and Tessa!- My expectations going in… I kind of also thought there’d be more of Annabel and Ash. I’d guessed in Lord of Shadows that Ash was going to be important but we didn’t really see either of them that much.- I also kind of expected more with Manuel, when we see small snippets from his point of view I thought something more was going to happen unless this is setting him up for the next books“The sky was a road and the stars made pathways; the moon was a watchtower, a lighthouse that led you home.” Overall I’m so happy with the way this turned out, it was my most anticipated release for the year and it didn’t disappoint! It’s bittersweet that it’s over but hopefully there will be more to come. I need answers, and you can’t leave some of the characters like this!A-T-L-A-S-TLady Midnight - 5 StarsLord of Shadows - 5 StarsQueen of Air and Darkness - 5 Stars-------Pre Ramble thoughts...WE HAVE TO WAIT TWO YEARS FOR THIS!AFTER THAT ENDING?!---------25.06.2017Helen and Aline snippets on Tumblr, already not coping.---------12.11.2017WE HAVE A COVER... it’s so beautiful! Want. Need. THE RED, I CAN'T LIVINGGGGGGGG———-12.02.2018TY and KIT snippets... LIVINGGGGGG ❤️—————28.06.2018When you pray to the gods that you've ordered the right Limited edition... if not well I'll be on the hunt!P.S - 6 months (ish) to go!--------20.10.2018After The Land I lost, I need this now. Why may you ask? THEY HAVE DROPPED A HUGE HINT ABOUT SOMETHING AND I AM DYING INSIDE---------"}, {"Review": "I shall obviously write my review when I actually read the book, haha. ----------Book Signing- This was the first book signing that I’d ever been to and I had an absolute blast! This took place on the last day of classes for the autumn term though, so I had to hustle to the event after class! (Guess who was still crazy early? Haha, this girl! *raises hand*)- Let's see what I remember. Phones weren't permitted to be used during the event, and I'm a goody-two shoes (no matter how much of a badarse I imagine myself to be), so I couldn't take any notes, ugh.- This event took place in a huge, university auditorium. Cassie was in conversation with Carrie Ryan at the event, who, if I'm being totally honest, I hadn't heard of until then. Carrie wasn't that engaging of an interviewer, so I can't recall much about her, sorry. - Cassie is a very funny interviewee. She's as funny in person as she is in her books.- One anecdote that she told wasn't even hers! LMAO, oh Cassie! xD Essentially, she took credit for a really funny story about her bestie, Holly Black, when it really involved Holly and Kelly Link. If you want the full details, check out my Wicked King signing. Holly had a good laugh about it, when she found out Cassie lied about it!-Another anecdote DID involve Holly. The two of them went to upstate New York to an apparently haunted, mental institution for research. They weren't allowed in because the building was condemned, I believe. Long story short, the two of them hopped the fence and snuck in, only to be discovered by the police, LOL. They told the police that they're authors, in an effort to avoid being arrested for trespassing, and the police were like, \"Oh, you mean like a historical novel about New York?\" and Cassie goes, \"No, it's a book about demons\"...to which the police responded, \"Get outta here before we arrest you!\" xD- The audience also had the opportunity to ask her questions, some of which turned into them thanking her for all of the different types of representation in her novels, which I thought was really sweet.- There was a trivia section with REALLY HARD QUESTIONS btw, so naturally I didn't win any of the prizes, some of which were a Magnus plushie and an ARC of the Red Scrolls of Magic. - We weren't allowed to bring backlist titles from home and were only permitted to have our new copies of Queen of Air and Darkness signed and personalised. Oh! And we also received Shadowhunter Army pins at the event. It had this insignia on it:- This portion of the event was really impersonal because of how many people were in attendance. There were SO MANY! The signing-line tickets were assigned in the order of purchases (kind of like at a delicatessen, where you are assigned a ticket number), and I was letter F, so it wasn't too bad of a wait for me. The part I didn't like is that we could only say about a sentence to her before we were hurried away from the signing table (in an assembly line-esque fashion), so that they could get to the next people. Also, we couldn't have actual photos with Cassie. The staff from the booksellers took \"action shots\" as we were getting our book signed. - I remember telling her that I've been reading her books since 2007 and they've had such a huge impact on my life (I kind of panicked; I was a bit starstruck, haha) and she responded with, \"Well, thanks for sticking with my books for so long.\" OMG GUYS, I WAS WITHIN BREATHING DISTANCE OF CASSIE CLARE AND I SPOKE TO HER AND SHE SPOKE TO ME AND OMG!!! <3- I think, because of this, if I hadn't added this section about my experience here, I would have forgotten what my feelings were about meeting one of my favourite authors in person. I'm so grateful that I had the opportunity to do so, as I know that there are many people who haven't. She was really lovely and nice, and I'd definitely jump at the chance to see her again...but hopefully, it'll be a bit smaller???"}, {"Review": "Your age does not define how well or not you will/would like a book.Just because this is labeled as a YA book and you will be twenty something when it comes out doesn't mean that you can't enjoy it.If you are a big fan of Clare's series and end up reading it how ever old you may be, that's awesome. If you don't end up reading it, no big deal. I just don't see why people need to be saying that \"this is the last Clare/Shadowhunter book I'll be reading\" because it hasn't even come out yet, nor have any books of this series for a matter of fact. If you're not excited for it, then you're not excited for it, but don't be thinking negitively about a book series that hasn't even come out yet. Please and thank you."}, {"Review": "SPOILER REVIEWTrigger Warnings: grief, self mutilation, death, war, murderMy review for Queen of Air and Darkness by Cassandra Clare was first posted on my blog. Find it here.Queen of Air and Darkness is the book I have been waiting for all year. I don’t think I have ever anticipated a Cassandra Clare book as much as this one. The ending of Lord of Shadows scared me to my core and if you ask me about it today you have a 110% chance of me bursting into tears at the mere mention of it. This finale to The Dark Artifices series did not disappoint. It left me reeling and having so many damn questions. You can bet I screamed WHAT at my book around about 100 times a page. I was absolutely shattered.This finale will probably be Cassie’s best. They continue to get better the more she writes and I am so damn happy to be able to experience this journey with everyone as we dive into the Shadowhunter realms. I am also self-proclaimed Shadowhunter trash – while also seeing everything wrong with the books and Cassie, I’m not blinded, don’t worry.As a warning, this review will contain spoilers. The spoilers will be for the previous books in this series so you have been warned. I can’t talk about this book without mentioning certain events. If you haven’t read this series, come back after you do so we can discuss. If you haven’t read this series and don’t want to, read forward and be spoiled, my friends.Queen of Air and Darkness picks up exactly where Lord of Shadows dropped off. With Julian holding Livvy after she has been murdered. We get to experience every ounce of grief that the Blackthorn family feels throughout the book and it is honestly enough to knock you off your feet. I promise you that you will burst into tears several times at work…not that I did that. The finale of The Dark Artifices takes you on a journey. There are countless storylines and at times it is a tad difficult to keep up. Obviously, it is better to have read all the Shadowhunter Chronicles to understand how people relate to certain things but it really isn’t needed. You can jump into this series and scream – obviously don’t just jump into Queen of Air and Darkness without having read the previous books.Throughout this book we get to follow Julian and Emma’s struggle to tamper down their feelings, Ty dealing with his grief for Livvy in the wrong way, Kit being a Herondale, Drusilla coming in to herself, Diana and Gwyn’s love story continue, Cristina, Kieran and Mark drama, Cohort business (seriously this was some Donald Trump shit), some Faerie Drama and finally find out who the mysterious Ash is (we all knew). Within 800 pages a lot has to happen and it does. We get to see all the old characters whom we loved and I even found myself liking Clary and Jace – something I thought was impossible when I read The Mortal Instruments. I can barely even begin to talk about each plot line because there is just so much going on. You will be thrown in a whirlwind and be actively engaged no matter who’s the storyline you are reading. There are plenty of changes throughout the long ass chapters Cassie writes to get a feel for everyone.I should probably start off with the one thing I disliked about Queen of Air and Darkness. I don’t know if I ever publicly spoke about it on my blog but anti-hero Julian was all that I ever wanted in this series. To see Cassie jump outside her comfort zone and write him would fuel me. While we did get somewhat of an antihero Julian it was not what I had imagined. In fact, it was slightly disappointing and something I’m not sure added to the plot. Julian turning off his feelings simply felt weak. You’re telling me the boy who walked miles to get groceries for his siblings would turn off his feelings for them? Try again.That’s all I didn’t like though, so Cassie really did smash it out of the park.Throughout the series, we have had glimpses of Aline and Helen. We have never really gotten to see them which is disheartening as the only f/f couple in the series. We finally get to really meet them and I must say that I adore them. Aline was so damn relatable to me and Helen was just an angel who wanted to care for her siblings, even if they didn’t want her to. The couple themselves were so damn sweet and I adored every moment of their relationship on the page. They were truly so special to read. I am sure we’ll see more of them in future books as well which has me squealing with excitement.There wasn’t much Jem and Tessa in this book either which was fantastic. If you know me, you’d know I hate that ship. I get it. Everyone thinks it is the best love triangle to ever exist in the sense that you can’t ‘choose’. Bitch, I chose and now I can’t like Jem. I hate him. So, having not much of them throughout this book was fantastic. Though I could have done with more Simon and Isabelle, oh well.Interdimensional travel is typically something that turns me off a book. However, Thule was magnificent. A world completely opposite from the one our character lives in where Sebastian Morgenstern won the war. It was chilling. The fact that Cassie thought of that? Ugh, her mind. She is a genius. However, she really didn’t include as much Annabel as I thought she would considering she is on the cover. I wonder where that will come in to play?The relationships in this book as well. Cassie diving in to a poly relationship was fantastic, Cassie’s further development of Emma and Julian was brilliant, Magnus and Alec’s already established relationship filled me with joy and I don’t even like them, and lastly, Drusilla’s future love life will probably be complicated but y’all know I love her.Cassandra Clare carefully crafted it so every single plotline that ran through this story intersected at the end. They all came together in a big way that you know leads off into the next series. I can truly not wait to read whatever she puts out next. I honestly need it in my hands like yesterday. The ending of this particular story left me breathless. I can’t wait to see what hints that we found throughout this book to come to fruition in future books.I would desperately love for Cassie to give us a nice happy ending for the Blackthorns but with the fact that The Wicked Powers is based around Kit and Ty (who I can’t even begin to talk about in this book) tells me this family hasn’t had the last of its dramas.Overall, Queen of Air and Darkness will probably be my favourite book of 2018. I am still reeling from the events and want to scream about them from the rooftops. Heck, this is the first review I’ve sat down to write straight after finishing the book. Cassandra Clare gives us a bit of everything in this finale and even more. I can’t wait to hear everyone’s thoughts and theories on what will happen next."}, {"Review": "THAT ENDING HOLY SHIT. Review to come.________\nPre-read Rambles\nI AM SO EXCITED FOR THIS–BUT OH SO TERRIFIED PREPARE YOURSELVES! HERE WE GO!!9 June, 2018I have been completely avoiding any snippets or any information about this book for like a year. I have not even read the blurb. I do this for any book I'm really anticipating because people give away TOO MUCH DAMN INFO, like I wanna experience it for myself WHEN I READ THE BOOK..... Anyway the one tag line that I can't help seeing everywhere is: \nEverything Changes in Queen of Air and Darkness\n.And that scares the crap outta me because I know that Cassie Clare has the capacity to shred my world apart. [*cough cough* clockwork princess anyone?] I don't know how I will survive. I think I need to re-read Lady Midnight and Lord of Shadows in preparation for this."}, {"Review": "\n“Without sorrow, there can be no joy.\"  \n\n“Shadowhunters are slow to love,” she said, “but once we love, we love forever.”  \nFinally, happily ever after!! \n\nJulian & Emma\n\n“I’m not the same person. I can’t say I feel things I don’t understand.”“Well, I want the same person,” she said. “I want Julian Blackthorn. My Julian Blackthorn.”  “So who am I to you, then?” he asked, dropping his hand. “You are the person I have to protect until my Julian comes back to live inside you again,” she said. “I don’t want this. I want the Julian I love. You might be in the cage, Jules, but as long as you are like this, I am in the cage with you .”   \n\n\nMark & Christina & Kieran \n\nAlec's & Magnus's Wedding <3 \n“When one day people look back on me and what my life meant, I don’t want them to say, ‘Alec Lightwood fought in the Dark War’ or even ‘Alec Lightwood was Consul once.’ I want them to think, ‘Alec Lightwood loved one man so much he changed the world for him.’ ”  \n\nUntil I read this epilogue!!! \n\nTy & Kit (I love them)\n\n\n“I can’t live without Livvy.” “Yes, you can,” Kit whispered. “You can. You think this will make your family stronger, but it will destroy them if you bring her back. You think you can’t survive without Livvy, but you can. We will go through it together.” Kit’s face was cold; he realized he was crying. “I love you, Ty. I love you.”\n \n\n"}, {"Review": "so i'm going to demand compensation for that ending bc what the hell cassie, what the hellin all honestly, there were mass portions of this book that dragged so badly for me but lol @ me bc the ending made up for it and i am complete 🗑️ for the blackthorns. literally give me a book about them eating pancakes and going to the park to watch birds and i'll always 5 starthe 2 greatest moments from this 900 paged book:1. tavvy asking to be carried and taken home in the middle of a war2. \"my emma\"goodbye y'all--------------------------------this is IT Y'ALLTHIS IS THE END OF IT ALLTHIS IS GOING TO BE THE END OF MEbuddy read with the squaf, jia, marami, & amy"}, {"Review": "My opinion on this is basically ONE LONG EXTENDED SCREEEEEAM. Ok I love this series. I absolutely am obsessed with it. My hEarT. Of course finales come with so many expectations, but this was amazing. But then I am Shadowhunter trash and these books can do no wrong afjdskald. I will say that is is incredibly hard to write a review...my brain is a smooshed swirl of emotions.but basically: GOOD JOB BOOK. YOU RIPPED ME IN HALF AND ALSO HEALED MY SOUL. BLESS. ➸ My ships. MY SHIPS.Look I had expectations and wishes, and they were met. Although, I mean, I had a lot of cool theories that didn't happen -- GOD I WISH I WROTE FANFIC because I have thoughts. But anyway, I love the romance in these. I know we roll our eyes a lot at the whole \"It's the end of the world but you're kissing right now???\" thing. But also: it makes sense. Like at one point Cristina told Emma she had romance problems and Emma was like, THANK GOD. LET'S TALK ABOUT THAT INSTEAD OF DEATH. So I get that??? I think it's entirely natural that a bunch of teens who are stressed to the point of breaking will find comfort and longing in kissing one (or two idk go for it, childs) another.also fkkkkk I LOVE MY SHIPS.(view spoiler)[ Ok here's the thing though: I WANTED Kieran x Cristina x Mark to get together like nothing else. And they DID. POLY REP OMG. But I also wanted them to be forever-together, because apparently I am built of tree sap. I wanted Kieran to marry Cristina and Mark and they all live as faerie kings/queens. Idk don't judge me. I had my heart set on this. Not just like weekend flings in a cottage smh. So it's like 80% of a win storyline. But yeah :/ How are they going to raise their CHILDREN like this. (They have no kids, hush. I'm just saying.)  (hide spoiler)]➸ How my heart beats for my Blackthorns.The family is so STRESSED here omg and devastated and wrecked. I love how they all tore away from each other and realised it wasn't helping. Helen is a sweetheart gift, I'm so glad she's here to be mum/big sister!! Mark continues to be SO PURE and wholesome afjdksald I love him. (He like makes donut sandwiches and he's so pleased with himself arranging the plates.) I love that Julian just SNAPPED because he held up for so long, it was good to see a human side. Dru got way more of a part and I loved it!! THE BLACKTHORNS ARE EVERYTHING.I also just want to say I really really love Kieren. Far too much afjdklsa my faerie, dramatic deadly son. And Cristina !!!! LOVE CRISTINA!! Also Diana. And Kit is precious and his story has only just begun so afjdklsad I cannot wait for his trilogy even though it's going to be forever till it comes AHHHH.➸  Was it too long???Here's the thing: 50% of me loved every. frikkin'. page. Because I want maximum time with my children. However, the book was genuinely uncomfortable to hold. It took me forever to finish it because my brain was screaming \"READ MORE!!\" but it physically hurt to hold. I knoooow. There are kindles. But I just think it should've been a bit shorter. Or two books? Two books would've been fine.➸ The plot was INTENSE THOUGH.So much happened like afjdksald I'm a whirlwind. It's impossible to talk about the details without spoilers though, so I'm just living it as: it was so long, but yet never dull. I loved how it balances the soft moments (with coffee and cuddles and coloured pencil smudges and beach kisses) with the hardcore action moments (fighting in Faerie, slashing swords, using impossible magic, badass battles, heartwrenching traumaaaaa). ➸ I also have NO idea how Cassandra Clare keeps this all straight in her head. 0_0I'm just...wow. There are so many threads, so many details (like who has which knife and how that's important later) and it just boggles my mind!! The histories all twine together and reference each other and it's just Good™ and clever.➸ And it doesn't spare the emotions.I LAUGHED. I CRIED. I WAS A MESS. I was like anxiety laughing all the time??? There's less sassy comebacks in this one because the book is SO DARK. But god, I live for the one-liners. But seriously it ripped me to pieces AND it was satisfying and good.I THINK THE THING TO TAKE AWAY HERE IS THAT I LIKED THIS BOOK. Just a little. Not much obviously. I'm chill. *hACKS UP A LUNG* It gave me what I desperately wanted with my sons' ships. It gave me maximum Blackthorn time. There was mercy AND vengeance. There were plot twists, cunning schemes, and love. It was the kind of emotional wave that you just stand there, fists clenched, and scream for a very long time bECAUSE YOU FEEL TOO MANY THINGS AT ONCE.ugh ok. I need to go cry until The Red Scrolls of Magic and Chain of Gold are out. \"But I thought -- you said we would be done with each other.\"\"I am not done with you,\" said Kieran. \"I could never be done with you, Mark Blackthorn.\"\"I am also an excellent cooke,\" said Mark, putting an acorn onto his s'more. Everyone stared.\"He can't help it,\" said Cristina loyally. \"He has lived with the Wild Hunt for so long.\"\"I don't do that,\" said Kieran, eating a s'more in the correct fashion. \"Mark has no excuse.\""}, {"Review": "\nThings I liked:\n ◘ Cassandra Clare’s writing continues to improve immensely and was beautiful.◘ Lord Byron and Edgar Allan Poe have been two of my favourite poets since high school, and this book was partially inspired by poems from BOTH of them.◘ It had an abundance of hard-hitting, emotional moments. But they were also balanced out by the funny, light-hearted, happy, tender moments. ◘ EMMA AND THE BLACKTHORNS. They were the highlight as usual. Their immense love for each other hurts me.◘ Little moments such as Mark’s balloon animals for the kids, or (view spoiler)[Aline’s (hide spoiler)] “goddamn delicious” frittata make the series what it is. ◘ Julian’s art and artistic analogies give me life.◘ Emma’s no-nonsense attitude. Sure it gets them into trouble sometimes, but I love her for it?◘ I don’t like picking favourites but if I HAD to pick my single favourite character it would be Church Emma. ◘ Marks character development since book 1 was fanfreakingtastic. I remember him using faerie prose and putting Tavvy in bags of sugar, but now he’s referring to Shadowhunters as “we” and not “they”. He’s come so far :”)◘ Magnus was a blindingly glittery star. ◘ At one point it felt like things were just on repeat, but then something happens that FLIPS EVERYTHING ON ITS HEAD AND I LOVED IT.◘ That damn strip of red cloth hurt me.◘ The message that the Cold Peace was the opposite of peaceful and instead brought war. ◘ The disarray within the Council was captured well, and is reflective of political chaos in today’s societies. “People are terrified. And fear isn’t logical,” “...and we seek to control what we fear.”(view spoiler)[◘ There were two things that took me completely off guard:1. The whole Thule ordeal was my favourite. It was giving me serious Shrek: The Final Chapter And Gemina vibes.2. The Cohort’s stunt at the end, Kit’s reveal and corrupt Jace, which set up Wicked Powers.◘ My darling alternate universe Livvy possessed such bravery, such strength 😭◘ How actual photographic evidence couldn’t convince alternate universe Livvy that Emma and her brother were real, but Julian’s drawings could. That genuinely made me tear up. ◘ Livvy’s letter to Ty was beautiful, poetic and so very heartbreaking. The “I love you. I love you. I love you.” from Livvy to her twin. A small part of me died and something in that letter just made me sit there and weep like the walking tragedy I am. ◘ The fact that they named the resistance Livia’s Watch 😭 and JULIANS BANNER.◘ Julian being scared out of his mind and being driven to turn his emotions off. “What hurts more,” Magnus asked, “the love or the hate?”“I don’t know,” Julian said.” THAT SCENE.◘ All of the Blackthorns are growing up, dispersing in their own directions and moving on with their lives, and I feel like that aspect was captured really well. The change felt scary, and very very bitter-sweet, like it does in real life.“As long as you know home is always waiting for you,” said Julian.”◘ Michael Wayland, Robert Lightwood’s parabatai. I wasn’t expecting an appearance, but when he showed up at Robert’s funeral it was a tragic kind of wonderful. (hide spoiler)]\nThings I disliked:\n◘ In Lady Midnight and Lord of Shadows, you’d be able to read them without having read The Mortal Instruments while still being able to get pretty much the full effect. But I feel like this book was more dependent on fully understanding the events of the past: The Battle of the Burren, the formation of the Cold Peace, Valentine’s Circle (view spoiler)[and Sebastian’s history. (hide spoiler)]◘ Not going to lie, the book made me roll my eyes more than a few times. ◘ I HATE, loathe, abhor, detest, despise the Mark-Christina-Kieran triangle thingamajig I’m sorry. ◘ This has been the case with all of Cassandra Clare’s books, but not every single character (including all of the side characters) needs to have a dramatic romantic subplot or love interest. If we replaced some of that stuff with more page time for Emma and the Blackthorns, I would’ve been a happy camper.◘ Why do I have to share a name with the Dearborn witch?(view spoiler)[◘ “I talked to Jem at the meeting,” Emma said. “He told me he would never do it, never.” This is a prime example of characters withholding information from each other for the sake of plot convenience.◘ That flipping parabatai curse and the unoriginality of how it was resolved. Two kids with a forbidden romance and heavenly fire burning within them save everybody with their vast power and are looked upon as angels from then on. Sound familiar? Yup, thought so. ◘ This is a pivotal moment that the entire trilogy has been leading up to and it fell SO so so flat for me. I was expecting something more epic and explosive with more consequences. ◘ “We lost good warriors on the battlefield, but your friends are safe.”Sigh. Not sigh of relief. Sigh of dismay and incredulity. Cassandra Clare has never liked killing off major characters, but I thought she broke out of that mould with Livvy’s death. But again, everyone survived the battle. It makes it feel like the book lacks stakes, and it’s plain unrealistic. ◘ Yes, I know that we see many tragic deaths in Thule, but that felt like a cop out because all of those characters were alive in their actual world. (hide spoiler)]\nMore quotes that I liked (there are a lot of them):\n◘ “She told me once there is a clock in the hearts of parents. Most of the time it is silent, but you can hear it ticking when your child is not with you and you do not know where they are...” ◘ “Be careful what masks you wear, child,” Nene said, “lest you lose your true face forever.”◘ “It requires mortality to make art. The knowledge of death, of things limited. There is fire inside us, Emma, and as it blazes, it burns us, and the burning causes pain—but without its light, I cannot see to draw.”◘ “...but sometimes you wanted to focus on something trivial to take your mind off the apocalypse.”◘ “Once you dissolve dye in water, you can’t take it back out.”◘ “He’d always called it her Wall of Crazy, but in a lot of ways Emma thought of it as a wall of sanity,”◘ “I can’t tell you it gets easier. But it does get steadier; you learn how to live with the new rocking of the new earth, the way sailors gain sea legs.”◘ “...and I’m worth talking to without pretending I’m something I’m not. And I’m not going to bother with anyone who doesn’t see that.” Wise words from miss Drusilla Blackthorn.◘ “It does no one any good to look backward for too long and forget that the future lies ahead.”(view spoiler)[◘ “Entreat me not to leave thee,” she said, reaching for the doorknob, “but you’ve left me. You’ve left me, Julian.”◘ “But I felt it. I was living in black and white and now the color is back.”◘ “In the club yesterday you talked about the weight on you, crushing you. In our world, your last words were ‘I’ve never felt so light.’  ”◘ “...but I can’t have Cameron die for the safety of a world that I’m willing to run away from.”◘ “You are in the cage.” […]“I am in the cage with you.”◘ “I thought I’d be able to think more clearly, without feelings. But the opposite is true. I can’t think at all.”◘ “Maybe Arthur had been right. Maybe mercy was better than revenge.” (hide spoiler)]The majority of the book: Unreserved 5 stars 60-or-so pages during the climax: Dismal, heartbreaking 3.5 starsOverall rating: ★★★★☆¾Uhh for anyone still reading this, my condolences. Pretend that I’m handing you a medal.—————————————Somebody hold me while I mourn over this trilogy being over. But also nobody touch me or talk to me or glance in my direction or breathe or blink. —————————————I have to say that the covers for this series are THE BEST so far. Also CAN WE JUST FAST FORWARD TO NEXT YEAR THIS TIME? Please? I need this in my life."}, {"Review": "i'm putting this on hold because i feel like this book has some pacing issues and i'm having a hard time staying focused on it right nowmaybe it's also my inner coward who just isn't ready to say goodbye to these characters yet and wants to postpone the inevitable heart breakeither way it's not the right time and i'll get back to this intimidating 900 page son of a bitch soon :-)______me being excited about a shadowhunter release is very off-brand for me but it's happeningi just want to state very loudly that if anything happens to anybody in this book cassie and i are going to have (one-sided) beef and it's not going to be pretty!!!!! (ง'̀-'́)ง fictional character death is detrimental to my health and i can't handle another lord of shadows type shit. have some decency✦ buddy read with most of goodreads but especially the squad: maymay, gianna, marami"}, {"Review": "I'M CRYING I CANT DEAL----------XXXXX-----------XXXXX-----------XCFGHIJNVV IM SO EXCITED HOLY FUCK BUDDY READ WITH TRINITY WHO I'LL TAG LATERupdate 11/12/17 I want to be angry that the aesthetic for the series covers doesn't match but im not????if I say I don't love this cover I am lyingupdate 9/8/17 2018 IT SAYS 2018 IVE NEVER BEEN HAPPIER AT A PUBLICATION DATE CHANGE.YESSSSSSS--------You have got to be kidding me. WHAT HAVE I DONE TO DESERVE THIS PAIN.*sigh* about 600, 600 six fucking hundred days of painP.S IF ANYTHING HAPPENS TO CLACE IN THIS BOOK. ANYTHING TO THREATEN MY SHIP. I WILL BURN THIS BOOK."}, {"Review": "Quick thoughts before the review:I liked it more than the previous books but I still have some mixed feelings about it.The wedding scene at the end was adorable and I am glad Emma didn't break the bond but the while thing in the other dimension was way too off. I felt like it was cheating because we had already faced Sebastian (even with Emma needing closure) and also I just never could take Annabelle seriously enough to think about her as the real threat. So, that fell flat for me. The Seelie Queen is still the biggest danger and I wonder how long can these books feed off that.But yeah, I kind of liked it but still it was nothing stellar.All the Blackthorns stood out as usual and old beloved characters were there doing stuff I guess."}, {"Review": "So I have thoughts. I have a lot of thoughts. First off this trilogy is over which is extremely sad considering it was one of my favorites of all time😭. But with the way this book ended we know for sure that the next series is going to be as action packed as this one. This book was extremely beautiful and the representation that was shown was so very well done and I was so so happy to read this trilogy. I'm gonna miss Emma and Julian so much. They were definitely two of the best protagonists I've read about. This book just tied everything together and the way Cassandra Clare shows that 'Love conquers all' is literally what made the book even more special. I'm so happy I read this because I was in a terrible reading slump for almost a month and it was so hard for me to get out of it but I did and now I have exams going on..how tragic. I can't wait for Cassie's next book."}, {"Review": "More like \n1.5 stars\n!?! Believe me, no one is more surprised (and saddened) by this than I am. This might as well be my most disappointing book of 2018. I had to put it down halfway through and finished two other novels. That much I dreaded picking this one back up.Is it wrong to say that it didn’t feel like a Cassandra Clare TDA book? Compared to LoS, which is still my favourite in this series, this read like a much-diluted version of her TDA Shadowhunter universe, the characters were boring me to death with their endless conversations and the plot pacing was all over the place. I couldn’t bring myself to care about any of it. Having this many shifting POVs and subplots (Emma, Julian, Cristina, Mark, Kieran, Kit, Dru, Diana, Helen, Diego, Manuel - completely unnecessary and not very convincing as a rather cowardly psychopath, I am surprised Church didn’t get a say in this) makes for a dull and highly predictable read, because, if not handled properly, it simply repeats things over and over again.I’ll give you an example: take Kieran, Cristina & Mark and make “last night” happen; have Cristina and Mark talk about said last night; have Mark and Kieran talk about it; have Kieran, Cristina and Mark talk about it; have Emma AND Cristina talk about it; have Kieran and Adaon talk, in a roundabout way, about it; have Kieran, Cristina and Mark talk about it some more. See where I’m going with this? There’s so much Kierarktina??? talk in this book that, to me, it overshadows the other relationships and friendships. I get that Cassie wanted to do it right, but it’s just too much. It reads like a fanfic wet dream.The entire Thule episode was ridiculously weird, recycling plot and restoring characters that should have been left where they belonged: in the fictional bin! Also, (view spoiler)[am I the only one who thought of the alternate dimension they pulled off in the TV show while reading this? Granted, here everything a lot darker, less sparkly. (hide spoiler)]There were some many emotional moments in LM and LoS that had me basically yell “How dare you?” at my own books. The grief and other intense emotions here were watered down by the constant shifting of perspective: you couldn’t spend enough time in a character’s mind to get a sense of what they’re really feeling. This review could be waaay longer, as I took notes (with loads of exclamation marks & WTFs), but right now I can’t be bothered... I might sound like a broken record with this one, but it needn’t have been a 900+ book! Who’s surprised by the Epilogue? Not me… Ughhh. I was over Clace like four books ago.I feel like we went back to TMI with this one!"}], "Genre": "Fantasy", "ID": "13541056", "Desc": ""}