{"Genre": "Fantasy", "ID": "28187", "Name": "The Lightning Thief", "Reviews": [{"Review": "I'm slightly ashamed to say that I watched the movie before I read the book. But I'm even more ashamed that I watched the movie only to experience the hotness that is Logan Lerman.But, come on! Someone tell me that  this , is not hot:Really. What did I tell you? (I do imagine that you probably won't read the rest of the review anf just stare at this gif instead, but that's no reason not to like my review! :D)But, I really have to thank Logan. I really do. Because without his unfreakingbelieveable hotness, I wouldn't have watched the movie, and I would've never read the awesomeness of The Lightning Thief. Yes, I loved the book. I've always taken an interest in Greek Mythology and I thought Rick Riordan's take on it was very unique, and unlike anything I've read before. I absolutely loved Camp- Halfblood. Well, it sure seemed better than the budget summer camps I've been to. RR seriously out did himself with writing the camp. I could imagine everything vividly and I like to think that I know the camp from back to front. The cabins would have to be my favourite feature of the camp, though. If only they were like that in the camps I've been to. Percy. What can I say? The guy has amazing underwater powers, is kick- ass and is a demigod. He's super loyal to his friends and family, is brave and has the looks (this is the part when you look at the gif of Logan Lerman again ;D). And he can make me laugh. Come on. You have to give a guy who make you laugh some credit. In short, the guy's the full package. Another thing I loved were the other characters. Especially Annabeth, who looks like Cinderella in Percy's words (am I right? I don't have the book on me, sorry. Stupid library fines). And I'm expecting something to develop between her and Percy, if you know what I mean....So, yeah. I loved the book, it was exciting, fast- paced and humorous. Just one thing though, I'm kind of pissed that they didn't have cabins in the movie. Or Clarisse. Or the Oracle. Though it's hardly RR's fault. I just had to get it out there."}, {"Review": "When I was about halfway through this book, I started making a list of its similarities to Harry Potter. Here is a sampling from that list:1. There are three young heroes: a brainy girl (Annabeth/Hermione), a funny screw-up type (Grover/Ron), and a somewhat troubled but very brave lead (Harry/Percy).2. People freak when the Harry/Percy character says the name of a powerful character. 3. The main bad guy (Kronos/Voldemort) is seeking to return to his former power, but most people are totally in denial of that happening.4. The heroes train at a school that divides its students according to their character. (Chiron, the head trainer of the camp, equals Dumbledore.)5. Chiron/Dumbledore knows a prophecy about Percy/Harry but won't tell Percy/Harry what it is exactly.6. Percy/Harry has a gross stepfather named Smelly Gabe who protects him during his childhood, so Smelly Gabe obviously equals the Dursleys. 7. Harry/Percy can talk to a certain animal because of his special gifts (Harry could talk to snakes, Percy can talk to horses). 8. Riordan's three young heroes face down a three-headed dog at the end of their big quest, which if I'm not mistaken is exactly what happens in HP1 (granted, the three-headed dog is straight out of Greek mythology, so I should cut Riordan some slack on this one).I could go on (and on and on) which would be fun for me, but I won't. Instead, I'll shock you by saying that I totally loved this completely derivative book. It's super fun and fast-moving and the fact that it's kind of a HP rip-off actually makes me like it more. God, I loved Harry Potter. The Lighting Thief is like methadone. That might be what I said about the The Amulet of Samarkand but it's more true here. I can't wait to read the second one!"}, {"Review": "\nChiron looked surprised. “I thought that would be obvious enough. The entrance to the Underworld is in Los Angeles.”\nAs someone who has worked in Los Angeles, I can tell you that this is completely accurate.While Harry Potter was spending his summers at the Dursleys, Percy Jackson attended Camp Half-Blood. This book has done the impossible: it has redeemed the name of Percy.Yes, that's right, that snot-faced, lily-livered waste of air of the very same name from the Harry Potter universe. That name is now relegated to the ranks of \"acceptable,\" because of my love for this book.Perseus (Percy) Jackson is the kind of kid with whom you can't help sympathizing. He is the type that's born under a dark star, because inevitably, wherever he goes, whatever he does, however good his intentions, he can't help but fuck everything up. Everything that can, does and will go wrong. A simple field trip can turn into a disaster in seconds.Jay-Z's got 99 problems, Percy might have more. He nearly flunks all his classes, he's got dyslexia, he's got ADHD, and then there's Nancy Bobofit.\nNancy Bobofit appeared in front of me with her ugly friends—I guess she’d gotten tired of stealing from the tourists—and dumped her half-eaten lunch in Grover’s lap.“Oops.” She grinned at me with her crooked teeth. Her freckles were orange, as if somebody had spray-painted her face with liquid Cheetos.\nNancy Bobofit is not a major character in the book. I have to mention her because her character resounded with me. I had my own Nancy Bobofit back in grade school, only her name is Mimi. Nearly 2 decades later, the memory of her horrible face still makes me shudder. But I digress.As if the bullies aren't bad enough, his dad is a no-show, his stepfather is LITERALLY named Ugli, and there are crones foretelling Percy's death as well as a minotaur chasing his ass around. AND NOBODY'S TELLING HIM A SINGLE FUCKING THING. What's with all the secrecy, man?As it turned out, Percy is *whispers* special. He is a half-blood, meaning one of his parents is a Greek deity. He gets sent to Camp Half-Blood, with roughly 100 other kids like him.It's a freaky place for a kid who's known nothing but relative normalcy his entire life. All of a sudden, he's playing Pinochle with a Greek God (Dionysus---what a drunk), his best friend Grover turns out to be a satyr, and the gorgeous blond girl who rescues him thinks he's a doofus and she keeps calling him \"seaweed brain.\"To be fair, Percy had it coming. He is kind of a seaweed brain.\n\"Another time, Athena and Poseidon competed to be the patron god for the city of Athens. Your dad created some stupid saltwater spring for his gift. My mom created the olive tree. The people saw that her gift was better, so they named the city after her.”“They must really like olives.”“Oh, forget it.”“Now, if she’d invented pizza—that I could understand.”“I said, forget it!”\nNot your best moment, Percy.As it turned out, Percy IS special. His dad is one of the Big Three gods. Which kind of sucks, because that's not supposed to happen.\n“About sixty years ago, after World War II, the Big Three agreed they wouldn’t sire any more heroes. Their children were just too powerful.\"\nA lot of people would think it was pretty cool to have such a powerful dad...not really.\nNow that I was declared a son of one of the Big Three gods who weren’t supposed to have kids, I figured it was a crime for me just to be alive.\nNot only does Percy have to struggle to fit in at Camp Half-Blood, but there's some shit going on in Mount Olympus. The gods are fighting again (when are they not)...\n\"During the winter solstice, at the last council of the gods, Zeus and Poseidon had an argument. The usual nonsense: ‘Mother Rhea always liked you best,’ ‘Air disasters are more spectacular than sea disasters,’ et cetera.\"\n...and consequently, like a brother playing a prank on his younger siblings, someone's stuff was stolen. And Zeus thinks that his bro, Poseidon, put Percy up to it.Of course, blame the poor kid. Now Percy is shit out of luck YET AGAIN, and he's got no choice but to go on this huge stupid quest into the underworld (Los Angeles, ha!) to clear his name.He's not alone, he's accompanied by the snarky, gorgeous, fiercely competent Annabeth (she of the seaweed brain name-calling), as well as the most incompetent satyr that ever lived.\nIn his pocket was a set of reed pipes his daddy goat had carved for him, even though he only knew two songs: Mozart’s Piano Concerto no. 12 and Hilary Duff’s “So Yesterday,” both of which sounded pretty bad on reed pipes.\nIt's going to be a loooooooong trip to the Underworld.The Setting: THIS. THIS IS HOW YOU DO GREEK MYTHOLOGY. I am a Greek mythology buff. I FUCKING LOVED THIS BOOK. This book is just absolutely fucking perfect in every way when it comes to rewriting and reinterpreting the Greek pantheon. It is so hilariously, awesomely irreverent, but completely fitting. The gods are reimagined, but they stay true to their true nature, and the myths are retold in a cheeky, flippant manner that had me giggling my ass off. This book is so fantastically snarky to the Greek gods. Everything is incredibly well-explained to a lay audience, like how the Greek gods can't seem to keep it in their pants.\nAnnabeth nodded. “Your father isn’t dead, Percy. He’s one of the Olympians.”“That’s...crazy.”“Is it? What’s the most common thing gods did in the old stories? They ran around falling in love with humans and having kids with them. Do you think they’ve changed their habits in the last few millennia?”\nAnd apparently, the habit runs true for both male and female goddesses.\n“What? You assume it has to be a male god who finds a human female attractive? How sexist is that?”\nThe existence of Greek gods and goddesses themselves are well explained, and believable.\n“Come now, Percy. What you call ‘Western civilization.’ Do you think it’s just an abstract concept? No, it’s a living force. A collective consciousness that has burned bright for thousands of years. The gods are part of it.\"\"Did the West die? The gods simply moved, to Germany, to France, to Spain, for a while. Wherever the flame was brightest, the gods were there. They spent several centuries in England. All you need to do is look at the architecture. People do not forget the gods.\"\nI had my doubts about the execution of the premise of Greek mythology, and all my doubts have been destroyed. his book does great justice to the Greek gods, it is the most faithful rendition than I have ever read.The Characters: Yes, Percy is a special snowflake, but HELL, I LOVED THE LITTLE SHIT. He's got a special destiny. He is a special child. I DON'T CARE. Percy is such a sympathetic character, and although he won't be replacing Harry Potter in my heart any time soon, there is a special spot for him. He can give up pretty fast. He's kind of a wimp, but you know, finding out that you're a hald-blooded demigod is kind of a big deal, and I understand his attitude of \"GET ME THE FUCK OUT OF HERE.\"\nI didn’t know what else to do. I waved back.“Don’t encourage them,” Annabeth warned. “Naiads are terrible flirts.”“Naiads,” I repeated, feeling completely overwhelmed. “That’s it. I want to go home now.”\nHe doesn't really want to do anything big. He's pretty stupid sometimes (Auntie Em, geez), he's not exactly heroic. He only does the heroic shit when there are no other options.\n“All right,” I said. “It’s better than being turned into a dolphin.”\nI loved Annabeth, she is all I could want from a female supporting character. I can't say that I'm fond of Grover...but I can't help feeling that we'll be seeing more of him in the future.\n“But a quest to . . .” Grover swallowed. “I mean, couldn’t the master bolt be in some place like Maine? Maine’s very nice this time of year.”\nOverall: a fantastic book. A good middle grade book makes you feel like a child again, and this book did just the trick. I found myself giggling throughout the book, and an hour after reading it, there's still a smile on my face that can't be wiped off."}, {"Review": "Were you a bit weird in school? Or are you still in school and think you're kinda weird? I mean, everyone is weird, but you know that I mean. Maybe you didn't fit in, maybe people thought you were a bit of a loser. Maybe you had learning difficulties, were a target for bullies, got into trouble a lot, maybe it seemed like your teachers just didn't like you. Maybe you sucked at reading and were even diagnosed with dyslexia. Or ADHD.Well, don't worry. Truth is, you're actually most likely a child of the gods with secret powers that enable you to zap those bullies and fulfill your true destiny. Screw school, you've got bigger things to deal with anyway. Lol, this book is amazing. My only regret is that I didn't have it when I was twelve years old because I would have read this until it was falling apart in my hands. Every insecure kid (so basically every kid) should read The Lightning Thief. I would want my hypothetical kids of the future to read this book. It's the ultimate childhood fantasy - discovering that everything people labelled as \"weird\" or negative about you is actually caused by your secret awesomeness. Pretty perfect message, if you ask me. I know, I know - this is plain old childhood wish fulfillment at its finest. But who cares? The best kids books are all about wish fulfillment to some extent and it's not like Percy Jackson doesn't have his fair share of enemies and heartache. It's the same idea that we all loved to buy into. The orphaned and neglected Harry Potter discovering he is a wizard. The nerdy loser-ish Peter Parker developing special abilities and becoming Spiderman. Children in the middle of WWII discovering a secret world through a wardrobe door in which they reign as royalty. Percy Jackson finding out he is the son of a god and has his own super powers. On top of the powerful message, this is a fast-paced exciting fantasy story full of friendships, Greek mythology, magic, mystery, bad guys and girls, and constant adventure. I enjoyed it now, despite me being a good ten years older than the target audience. I would have enjoyed it even more ten years ago. You should definitely go read this. Then, when you're done, give it to a kid to read too.Blog | Leafmarks | Facebook | Twitter | Instagram | Tumblr"}, {"Review": "I just had to get the illustrated edition! It's so awesome! I will leave some pics below and I took them last night so they are not great shots. =) There are A LOT more pictures as you can guess. Like I said, sorry about the darkish pics. I was taking them while laying in bed last night. Lol Happy Reading! Mel ♥•••••••••••First ReadingI am FINALLY getting around to reading this series. I thought the movies were okay, I do wish they would remake them and make them better, like the books =) Poor Percy. Look, I didn't want to be a half-blood. If you're reading this because you think you might be one, my advice is: close the book right now. Believe whatever lie your mom or dad told you about your birth, and try to lead a normal life. Being a half-blood is dangerous. It's scary. Most of the time, it gets you killed in painful, nasty ways. If you're a normal kid, reading this because you think it's fiction, great. Read on. I envy you for being able to believe that none of this ever happened. But if you recognize yourself in these pages-if you feel something stirring inside-top reading immediately. You might be one of us. And once you know that, it's only a matter of time before they sense it too, and they'll come for you. Don't say I didn't warn you. My name is Percy Jackson.Most people already know the story of Percy Jackson and how he found out he was a half-blood. How he ended up in a half-blood camp (almost didn't) How he beat a Minotaur and later on, many things. I thought it was a fun read and I loved all of the different mythical creatures! That was so wicked cool! Percy makes some good friends in the camp and they go with him to do a quest. He has been blamed for stealing something from Zeus, which he did not, so they have to set out to find who really did it. Other wise there is going to be some knock down drag out with Zeus and Percy's father (Poseidon) and others of course. So they set out on this quest. They have to go have a little chat with Hades <-- fun times. They get attacked by many creatures of all shapes and sizes. They also get help from certain creatures and a pink poodle named Gladiola who ran away from home and doesn't want to go back but does so the kids can have some reward money. Wasn't that sweet! ↑ Can you blame little Gladiola? I mean I love the color pink, but NO, JUST NO! Anyhoo, I did want to smack the group a few times because of stupid things, but who doesn't do those from time to time. *raises hand* I loved when they saved the animals in the old truck they were riding in, Grover is awesome! I look forward to reading ALL of the other 50 billion books in this ongoing Rick Riordan world! ♥MY BLOG: Melissa Martin's Reading List"}, {"Review": "\nEDIT 09/06/2013:-\n That's it. I have had my fill of too many stupid, brain-cell destroying comments posted on this review in the past few months asking me to write a 'best-selling book' before attempting to take apart Rick Riordan's writing. As if the exclusive privilege of negatively criticizing a book is accorded only to published writers and not ordinary reviewers/readers. I do have the right to record my feelings about a book in my review. And it's such a shame that I am actually being forced to put up this edit to make people aware of this fact. If this review hurts your sentiments as a fan, I am sorry I can't help you there. You must grow up and learn to let dichotomous opinions co-exist in harmony on the same page. That is all. Caution:- Brutal honesty ahead. Read at the expense of having to respect someone else's views.---------What a feeble attempt at recreating the Harry Potter magic! Aside from being highly unoriginal and unimaginative, the book grates on your nerves due to the frequency of Percy's lame attempts at sounding witty. Seriously, I'm supposed to laugh at his observations on the 'Bull Man' and 'barnyard animals'? Not only did the writer not bother racking his brains to come up with a plot or a proper story, choosing instead to recycle key elements of the Harry Potter series, but he also ignored important aspects of a fantasy novel, one of which is the language. To call the narration just bad will be an understatement. Same can be said about the dialogue and the way the plot progresses - it's one cliched event unfolding after another. The only novel thing about this book is the seamless integration of Greek mythology into a fantasy-based set-up. The 1 star is for that. And so I'd like to put a premature end to my review because I just realized the futility of writing one of a book I hated. "}, {"Review": "this is one of the most common books that pops up on my feed. no joke. i probably see this at least a couple times a week, so i finally gave in and read it! yay me! hehe.i will admit, this is the first time i have read a middle grade novel since i was that age, but i have to hand it to rick riordan. this story is sooo unique, which is hard to do considering how many fantasy novels are out there for young readers. and i have no doubt that, if i had first read when i was a kid, i would have been beyond OBSESSED with it. it makes me so sad to think that my childhood missed out on this series. but reading this as an adult is an entirely different experience. i can appreciate this for what it is, which is fun and exciting, but it honestly just made me feel old as it has a very juvenile feel to it. i have heard some of riordans other books are aimed towards older readers, so i may give them a shot since i do love me some greek mythology!↠ 3.5 stars"}, {"Review": "Really is there something I could say that hasn't been said? Doubtful, but in utterly stupid human style I will write a review anyway attempting to tell people how cool this book is.This is plainly an  awesome  idea. I had always wondered what happened to the kids of half gods/goddess and humans. Here's the story to quench your curiosity. Percy Jackson has been dumped around from border school to border school. He has never been quite like anybody else, but as the end of sixth grade approaches he'll find out how unique he actually is...I picked this up thinking that I would enjoy it, but not to the extent of really being  hooked  so fast. Literally from the first pages I knew I was gonna finish this book. It's geared towards middle grade readers and mostly male I think, but really all that goes away when you're reading this. As an older reader I did see most of the twists coming but that is because the author is generous about hints, which I have always liked. What really sold it for me though is the action. I have mentioned this numerous times, but I'll say it again,  I am a total sucker for action scenes . Give me a good fight sequence and I'm there. A few reviews mention how this is ripoff of Harry Potter, and now that I think about it I could see where they are coming from. There are definitely similarities, but to be honest I didn't really catch that, (I guess I'm kind of dim...I shouldn't probably admit to that *shakes head* moving on) because the world the author set was so original that the similar setup can be easily forgiven.We all love heroes. Especially ones like Percy. People never expect much from him, and that's what makes this journey of his so personal to the reader. You root for him and are so glad that his muscling his way through it. It has the feel of cheering for the underdog. And I'm guessing this underdog is going to blow everyone out of the water.Extra Note: Oh glorious goodness they made a movie! Here is a link to the movie trailer."}, {"Review": "My inner child is absolutely devastated that I didn't read this series when I was a kid. Percy Jackson was one of those series that was always there, just on the periphery of my social conscious. I knew I should read it, but for one reason or another I gravitated to other things instead. Thankfully, as an adult who likes reviewing books for fun in my spare time, I have absolutely no shame about reading the series now, even if it was originally intended for a younger audience. In some ways, I think I might have even enjoyed it more as an adult. I'm a huge fan of Greek mythology. (I may or may not have filled electives in high school and college with classes on mythology; just like I may or may not have obsessed over shows like Xena and Hercules in my teenage years.) I had a great time comparing my own personal knowledge of Greek mythology against the ways that Riordan weaves the stories into Percy's larger adventure.It's such a fun way to introduce Greek mythology to children and teens while staying entertaining for adults as well! The mythology remains faithful to the original stories, but it feels fresh and fun here as each character is full of personality and charm. The world is full of magic and wonder and I never once felt bored as the characters explored within it. Speaking of characters full of personality, Percy Jackson himself is one of my new faves in terms of characterization. He's brave, loyal and hilarious and his friendship with Grover and Annabeth has quickly become a favorite for me. Also, can I just say that I think it's so cute that Riordan based Percy on his son, who had been diagnosed with ADHD and dyslexia? I think it's so awesome that Percy gets to sort of stand apart from other heroes in stories as a champion for those kids forevermore. When I finished reading this book, I immediately went and told my 11 year old nephew that he absolutely had to read this book so I had someone to talk to about it. I'm proud to call myself a Percy Jackson fan and will be continuing the rest of the series shortly! ★★★★★ = 5 stars! See this review and more on my blog: Book Bastion my blog: __________________Can ya'll believe I've never read this series before? I picked up the first 3 books on a whim the other day and am excited to give it a go. RTC."}, {"Review": "A list of reasons I love this book, brought to you by Nostalgia™:- clickbait chapter titles- middle grade book that doesn’t write down to its audience- percy jackson was my first book boyfriend and remains the most iconic of my middle school crushes- I kind of like him better than harry potter???- he mails the severed head of a monster to the fucking gods bc they weren't being appreciative enough of him- basically, the son of the sea god is literally and figuratively salty- annabeth is only 12 yet so fucking smart and badass??? I want to adopt her- grover is a sweet, smol vegetarian who will forever have a special place in my heart- also he talks about food in his sleep- features a main character with ADHD and dyslexia- mythology is incorporated into the modern world in absolutely flawless and endlessly clever ways- it’s just so much fun?????This was the first book series I think I truly loved as a child after Harry Potter, and I honestly don’t know why I waited so long to reread this. It’s fun and smart and also kind of emotional but maybe that’s just me bc I have an unhealthy attachment to these characters.If you’ve already read this, you should reread it, and if you haven’t, please do!!!!!! My br partner hadn’t read this before and she loved it anyway, so I stand by my belief that the nostalgia factor isn’t necessary to enjoy this book as an adult! 💙---------------------------rereading this with matthew gray gubler's #1 fangirl bc we need something fun to get us out of our slump :)))"}, {"Review": "this is a perfect book for young teenagers. if you were trying to devise a formula for writing a perfect book for this age group, you could not have done much better than this.1) mysterious parentage. kids are totally self-absorbed. some never grow out of it, of course, but in younger people, it is more excusable - their internal life makes up the majority of their experience, they are used to being the center of attention and they spend a lot of time thinking about themselves and fantasizing. so having romantic, mysterious origins is the best thing ever - \"maybe i am the son/daughter of a god/goddess/russian count, etc...\" i still wonder about that, even though it is clear where i came from.2) this book has excellent gender equality, so it appeals to both younger girls and boys. goddesses are just as cool as gods, and their children are equally badass. this is rarely the case in teen adventure lit. (see naruto)3) this makes history class relevant.(or wherever it is that kids learn about those wacky greeks) personifying the gods and goddesses makes them more recognizable and immediate for kids; bringing old litterature aliiiive and all that. and they will definitely learn not to mix up chiron and charon.4) but it is also wonderfully subversive. it is all about polytheism and it makes the point that what we consider mythology today used to be a very real belief system for tons of people. any bright kid is going to make the logical leap to thinking about contemporary religion and how one day, it may well fall under mythology for students of the future, and how any current religious disagreements will be just like poseidon and athena's quarrels. because of this, i am surprised that this series has not been more frequently challenged/banned. oh, i know why, because the people most likely to challenge shit are not themselves capable of making that logical leap; they operate solely on knee-jerk see-a-bad-word reactions.but this book is great - it has fantastic pacing, the characters are incredibly appealing, i like the premise, and i really really like that it is five books only. i will definitely read the rest of these puppies when i get around to it.come to my blog!"}, {"Review": "Yet another review:Well I feel like I've rewritten/updated my review of this like a billion times at this point, but I'm here to do it again. I re-read this over the span of the past two days when I had to take two super-long bus trips. This was the third time I've read the whole thing, I'm pretty sure (kind of the fourth time I guess, since I read a lot of it out loud to my younger siblings last year). There are few books that I loved when I was 12 that I still deeply love now, and this is one of those few books. In fact, the more times I read it the more I fall in love with it. I adore the series as a whole and think it develops so wonderfully as it goes along, and sometimes I almost forget how great the first book is. Maybe it's not the strongest of the series, but it's still fantastic. It's exciting, it's hilarious, there are so many lovable characters and great character development/backstories/etc. and as a giant mythology nerd I love how all the Greek myths are tied in and modernized. The rest of the series just gets better and better, and I love the Heroes of Olympus series as well––and it always makes me happy to go back to where it all started, and remember why I first fell in love with this book/series nine years ago. (Gosh that makes me feel old.)------Old/crappier review from like two years ago under the spoiler.(view spoiler)[Hmm my old review for this kind of sucked. I feel like I've rewritten this review like twenty times, but oh well. I guess I just can't do this book justice. Percy Jackson & the Olympians is one of my favorite series, despite the fact that I think it's probably aimed more toward 12-year-old boys, and ... well, I'm a 19-year-old girl. But I can't help it. I fell in love with these books when I was around 12 and I never outgrew them (which is something I can't say for most books I liked when I was 12).You know what's freaky? So, my friend and I went to a Rick Riordan book signing recently. (And that's not the freaky part, although seeing him in person was pretty freaky.) Anyway, we're standing there and I'm like, \"OMG ... A lot of these kids were, like, not even born yet the first time we read The Lightning Thief.\" We were kind of surrounded by little 7-year-old boys it seemed like. But anyway, IT WAS STILL AWESOME. And really there was no point to this story except to prove my point ... that I have loved these books for a long, long time.Everything about these books is just totally lovable. The characters are great, the character relationships are nicely developed, the story is exciting, all the Greek mythology is tied in brilliantly, the humor is laugh-out-loud hilarious. Mannn, I could go on and on. And they just get better with each book. I frequently pick these up and read parts of them just to make me feel better. They're an instant pick-me-up. Also, random side note: the movie was just ... horrible. I could go on a long rant about it, but I won't because that would be annoying. Let's just focus on how awesome the book is.These books are just beastly awesome, and if you have not read them I pity your depraved soul. Go read them now. If you have read the book and seen the movie, I am crying with you right now. If you have seen the movie and not read the book … well, something is wrong with you. Go read the book, for crying out loud! (hide spoiler)]"}, {"Review": "The only word I can think of that’s relevant to how I felt about this book is \nFun, Fun, Fun\n. Why in the world haven’t I picked this book up when I was in middle school, I’ll never know. Lbr, what’s in the past is in the past and I’ll just have to get over the fact that I might have crawled out of my shy shell sooner if these books were in my life earlier. On a positive note, I have the whole series on hand ready for me to binge as well as 2763274 other series to look forward to. that’s #sorta #winning.So, I’m one of those readers (if there are even such readers) that added this to my TBR solely for its fan art because ooooooo boooiiiii. !!! THE FAN ART !!! aaaaand at the time, it wasn’t even my intention to purchase the boxset but I came across it for a very cheap price so me being me, I couldn’t resist it. *imma also get outta my system about how time wasn’t on my side and that I waited a whole month for it to come in the mail but now I see that it’s totally worth it.*With that said, I can finally jump into my semi-coherent feels that The Lightning Thief have bestowed upon me:- #1 CHARACTERS. Percy, Grove and Annabeth = squad goals. I love how they’re all so different from each other and would literally go to the ends of the earth for each other. - Just by reading the first line of the first page, I knew that this book would be packed with sarcasm. I didn’t care that it was a middle grade novel and that there may be some cliches here and there. I was all chill while my wonderful babies were out having the time of their lives, saving the world and of course trying not to get themselves killed in the meantime :’)- I loved how the writing was simple in that I’m learning elements of mythology without all the crazy info dump that YA/NA fantasies usually have. Tbh, I don’t remember a time where mythology didn’t interest me yet I pretty much went into this knowing very little. I know, I know it’s weird.- I love me some books that I can fly by, especially during a time in need aka I-found-the-cure-to-my-really-strange-reading-slump. The book is filled with hilarious banters, adventures and action and the pacing was just wonderful. - Grover is me. - I love how Annabeth loves to read.- Percy is a cinnamon roll. - Overall, I low-key want to ditch my current reads and just get to the sequel already :’)"}, {"Review": "One of the Greatest Urban Fantasy's Beginning I've ever read.Now as I join Hogwarts every September to May, I'll spend my Summers in Half Blood Camps.It's awfully late for me, I know. But I was stubborn enough to not listen to 2 of my best half blood friends here on Goodreads to visit the Olympians.“Gods—the forces you call the Greek gods—are very much alive.”I can't believe it's just Mr. Rick Riordan’s first novel.And Believe me if you didn't read it..you missed a real great series..Very well written, well paced, amazing bunch of characters & funny sarcastic tone that you'll love no matter you're twelve or thirty three.And creepy atmosphere and nightmarish scenes, interwoven with huge honest references of the Greek myth that serves as crazy urban fantasy theories related to our real life..All that in a very hell of very thrilling real roller coaster plot, that takes you across the United States, and back again..A story that serve for one complete story for 'Book One', and leaves you longing for the next ones that promising of even bigger plot.Now, if you're still want me to talk about why you should start reading this series, heres the above's ..ANALYSE ▪▪Very Well Written. (4.75)-------------------Smoothly you step into the character, Percy, the narrator.. His life, bits about his past, then bit by bit into the conflict(s), then the Greek Mythology … then the Quest(s)..Finding the Lighting Thief... which is not as easy as it seem..ups and down with thriller and chilling and creepy and even funny parts. Everything smooth and well explained with what serve book one -with hints that sure will serve later books-Well Paced. (4.99)------------See above. I truly rarely felt like that with most new YAs… always there's this boring slow parts that show up every now and then.here everything measured , not too heavy boring flashbacks nor prolonged scene full of rant as many action YAs... it's like the amazing Harry Potter pace if u know what I mean.Amazing Bunch of Characters (4.5) --------------------------I loved Percy, really. May be because everything smoothly introduced. And he just keep in character, I mean for 12 years old kid, would you believe he'd go to the dangerous underworld to retrieve the Lighting weapon from The Lighting Thief? Just because some gods will do wars for it? “Blaa-ha-ha!”. Well... when you read his reason and motivation you'll find that it's more believable and true to the character.And I love that.Also having Attention Defucit Hyperactivity Disorder (ADHD) and Dyslexia as well as it served an important point of making the high fantasy of the Greek Myth into our real world-urban- fantasy, it also a good touch to encourage any kid who suffers that -which is bit more than you may think- anyone can be hero.. just don't make it stops you. Percy didn't stop trying to read the whole book.. -kinda-\n“Or maybe they’d realized I got my essay on Tom Sawyer from the Internet without ever reading the book and now they were going to take away my grade. Or worse, they were going to make me read the book. ” \nAnnabith also was a fun to read. So smart. Groover... also this good \"strange\" friend..And I also loved the mother and her love of Blue food. that reminds me..So long no photo, here's some blue food.Also all the other characters are very well introduced.. just as every thing.Funny Sarcastic Tone (4.5)--------------------Very easy lines, smart, wit, not just for the young age but really for all. -unlike my previous encounter with Magnus.- It's so funny here and in the point.Creepy Atmosphere and Nightmarish Scenes (5)---------------------------------------It's not supposed to be a horror story. But it has a lot of creepy places the friends visit.. Like this \"Ever after\" Las Vegas Casino...or Medusa's Shop for statues.And also the way Rick Riordan writes the nightmare scenes is really full of horror and creepy symbols.And speaking of symbols ;Relating Greek Myth to our Real World. (5) --------------------------------I am NOT a fan of Fantasy, I just prefer, rather adore URBAN FANTASY -Which is why I didn't like Magnus for some serious violation to the real world-But this one really smartly written, with real references to actual myths or work of art and literature work.I loved how Mr. Rick connect the prosperity of the ancient Greek myth and civilisation with the current American one.His theory here is so smart..and convenient enough to fall in love and immerse into his well crafted world..And if you're, like me, not feeling well about the gods concept.. he also have a convenient idea here ;\n“Well, now,” Chiron said. “God—capital G, God. That’s a different matter altogether. We shan’t deal with the metaphysical.” “Metaphysical? But you were just talking about—”“Ah, gods, plural, as in, great beings that control the forces of nature and human endeavors: the immortal gods of Olympus. That’s a smaller matter.”\nSo, as I said, it's the amazing blending of the myth with real life in America is what makes it an excellent Urban Fantasy..And speaking of America.A Thrilling real Roller Coaster Plot  (4.5) that Takes you Across the United States (4.99) and back again.. ----------------------------------Although the first story for Percy supposed to be just an \"introduction\" to this world, but you find yourself gotten into a hell of adventure full of crazy chase and creepy places hidden in real world..There's this great concept of \"the Mist\", that surrounding the myth creatures among us as the story goes..\n“It's funny how humans can wrap their mind around things and fit them into their version of reality.” \nThis theme of mist repeated in a good measure to keep the illusion that it's real story happening in our real world in a real famous places along the US.And I loved visiting about 3 or 4 states and important places there through the first adventure only...and I believe more is coming in this Adventure Packed series..~~~~~~~~~~~~~~~~~~~~~~~~So, finally... if you're a Harry Potter fan..or any newer YA fantasy fan... or if you're old school mythology fan, you'll love to join us the Half Blood Camp.. trust me.A special thanks to my half blood friends who encouraged me repeatedly on starting this amazing series -why you didn't push me even harder :), kidding-, thanks again truly I'd never read it without your recommendation -felt I was too old to join another huge,full of books and many series.but Rick Riordant really worth the read. He got his style,, may be reminded me with Harry Potter's first book structure..but wasn't it the greatest structure ever?The point that he used it creating a whole new exciting crazy myth/modern adventure..Mohammed ArabeyWith the Olympians from 3 Nov. 2016To 9 Nov. 2016"}, {"Review": "Believe it or not, but this was actually my first Rick Riordan book!!! ANDI really enjoyed it!!! *lol*This was such an epic adventure and I loved the countless hints and references to Greek Mythology! XD Rick Riordan’s approach definitely was a more than just funny one and I couldn’t help but had to laugh out loud whenever Percy opened his mouth! I swear that young boy is the embodiment of sass and the more I read about him, the more I got attached to this awesome boy! <3 I want to adopt Perseus and if Poseidon doesn’t want him it’s his own fault! XD After reading the first book I don’t really feel a connection to Annabeth, but maybe this is going to change?! She seemed to be an interesting character and I liked their easy banter, altogether she was just too reserved for my taste though, which is pretty sad because I’m more than just certain that she’s actually a very cool girl! (On a side note: I really loved that she gave Percy the nickname “Seaweed Brain”! *lol* I’m fairly certain it could have been worse! ;-P)And Grover? Well, I guess I liked Grover as well! His habit to eat tin cans was a little unsettling but hey, I’m not going to judge him for his rather questionable diet. XD After all his heart is in the right place and when it comes down to it, this is everything that counts! ;-P I just hope he’ll survive his personal quest and I can’t help but wonder if we’re going to see him in one of the next books! Since my jump on the “Percy Jackson” train seems to be more than just a little delayed, I finally decided to leave it at that. I guess there is really nothing I could write or say that hasn’t been said already! I mean there are actually 46.835 reviews on goodreads! (Yes, I looked it up! ;-P) So yeah, I guess that says it all! XDIf you haven’t had the pleasure to read the book yet I recommend you to do the following though:Get a copy of “The Lightning Thief”, snuggle into your soft and comfy bed, ignore the bad autumn weather and enjoy the freaky ride! ;-P"}, {"Review": "I've read all (I think) of this series to my daughter, Celyn, but somehow this one escaped being reviewed until now.I half-watched the film a year or two before we read this. Actually it was Rick reading (and being kind enough to review) my own trilogy that steered me toward picking up these books for Celyn (she's very disabled and can't read books for herself).Anyway, it was a very good read. Celyn enjoyed the action and humour, and I enjoyed seeing the Greek legends I loved reading about as a kid given a new lease of life, offered up to the most recent generation.It starts off with that irresistible device beloved of fantasy books that you (vicariously the hero) were meant for more than this regular old world and that all those odd things you don't understand about everyday life ... really are odd and full of special meaning. In fact ... your dad's a god, and not just any old god but Poseidon himself. And that means you're part god yourself! Hoorah!So Percy gets inducted into hero school, makes friends with good monsters, fights and kills bad ones, and dives into adventure.The hero school (Camp Halfblood) has demi-gods descended from all the Greek mythos, which makes for fun conflicts. Meanwhile in the wider world there are rumblings that the titans (from whom the gods wrested control of the world at the dawn of time) are about to stage a comeback. Zeus has lost his lightning bolt and the thief must be found before the gods fall to blows and Olympus topples.The genius is in the mix of modern day America with all its kitsch, landmarks, cities etc with mythical Greece. It shouldn't really work, but does. And to cap it all, your kid is getting a classical education on the sly!Join my 3-emails-a-year newsletter #prizes..."}, {"Review": "THE TIME HAS COME, GUYS. I mean, I bought a copy like months ago and never knowing when I would read it but HERE I AM READING IT FOR THE FIRST TIME. 😎😎( but I have watched the movie ... and I wish I hadn't watched the movie before reading the book 😭😭but it happened before I became a reader. )~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nREVIEW TO COME TOMORROW\nAll I can say now is \" FUCK I NEED THE SECOND BOOK \"THE REVIEW IS POSTEDto be honest, few months ago, I tried reading this book and then after I read a few pages, I just found it boring and then I just put it back on my bookshelf but I also said to myself that I was just not in the mood to read it at the moment so I would just read it another time and then few weeks, I decided to read it again because I just had this feeling that I was in the right mood to read it and my friend, Melanie, she loved this series and she also recommended it to me like ... I don't know, probably a year ago and I was like \" hmmm, this series must be very good till she liked it this much \" so I also felt like I had to know why she loved it and she also helped me to understand few things when I didn't really understand, so thanks, Mel! AND OH MY GOD. THIS BOOK. I CAN'T EVEN. IT WAS REALLY GREAT. I admit that I didn't really enjoy it at first and maybe it's because that was the first time I read a book that has monsters in it but I didn't have a hard time to understand this book and then after few hours reading this book, I felt connected to the story and to the characters and day by day I found out that I enjoyed it a lot and this book was really really fun and the characters! especially, Percy and Grover, they were really funny and let me tell you, guys, that I rarely laugh when I read. probably just smile but this book, it made me laugh so much! and half way reading this book, I also felt like I was going to like it very much in the end and I WAS RIGHT! and I love the friendship between Percy and Annabeth! in my opinion, it's friendship goals! I don't even have this kind of friendship, but I do really want to have one. seriously, if you haven't read this book then YOU NEED TO READ THIS BOOK LIKE RIGHT NOW. You'll be missing out such a great adventure, if you don't read this book. this is the kind of friendship that I always want to read in books. like there are these people and they don't know each other and then they meet and the friendship start forming through their adventures. THIS IS THE KIND OF FRIENDSHIP THAT I HAVE BEEN LOOKING FOR. I literally have nothing to say anymore. JUST READ THE BOOK AND YOU'LL KNOW HOW AMAZING THIS BOOK IS. oh and I already ordered the second and the third book and I CANNOT WAIT TO READ THEM. SFGSAGHSAJHBJHSHDSFBJHBDH"}, {"Review": "Who knew middle school books could make me gush and squeal like a 12-year old. I loves!!!Can we just appreciate how much  FAN ART  there is in this fandom???!!!??? ٩(^ᴗ^)۶  “If you’re reading this because you think you might be one, my advice is: close this book right now. Believe whatever lie your mom or dad told you about your birth, and try to lead a normal life.  This book is informative, interesting, funny, charming, it’s just all of the above and I’m already trash.  The Lightening Thief,  is the tale of Perseus Jackson, a young boy who found out he’s a half-blood in a very hilarious manner. Due to his birthright, Percy is expected to embark on quests and save the world from impending war. Now it’s not just Percy that’s a sweet darling child who’s sassy and brave and courageous, it’s also his comrades, Annabeth (GIMME MORE PERCABETH PELASE) and Grover, his peculiar little friend. The trio of this group is so wonderfully entertaining to read about it. I didn’t think I would LOVE a middle school book as much as I loved this one but I was thoroughly entertained the entire way!I’m so enthralled with the setting of Camp Half-Blood, like can we get an entire book just set there?? It’s so different from anything else I’ve read. Fetus May really missed out on good reading material. Smh. So, I’m sure  everyone  has already read this series and they’re rolling their eyes at my basicness but I’M SO EXCITED TO CONTINUE THIS SERIES!!!  “If my life is going to mean anything, I have to live it myself.”  Okay, stay tuned cause I’m gonna be back for more of this Percy kid. 4.5 stars!! ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Buddy read with these fabulous cupcakes, Kimiiiii ♡♡♡ and Jenny♡♡♡ Now you may be thinking,  \"May, how on  earth  did you manage to pass middle school without reading these books? You must have had a  terrible  childhood,\"  and to which I would respond, \"Yes, yes, in the book world, it sure seems that way.\" .-."}, {"Review": "person: your name is percy?? like percy jackson??me: (internally: who tf is that) yea i guess. person: is it short for perseus????me: ...............yes? person: OMG!!!!! LITERALLY LIKE PERCY JACKSON!!!!!!! YOU'RE PERCY JACKSON!!!!!!!!!!me: uhhhhh.... ok but my surname isn't jackso-person: PERCY JACKSONNNNNNN!!!!!!! after that above conversation occurring approximately 1000 times in the space of like a month with 1000 different people, i should probably read this book and find out what the big deal is. I GUESS. "}, {"Review": " “It's funny how humans can wrap their mind around things and fit them into their version of reality.”  Story ⭐️⭐️⭐️⭐️⭐️First of all: Now I see why so many people are angry at the movies. They’re so different. I mean, they have some similarities, but in a big way they’re different. And what can I say? Am I surprised that I liked the book more than the movie? No, absolutely not. I liked the movies, but after I saw what the real story should’ve been like, I think they could’ve made more of it. Second: There is no question if this is a book for kids or not. It definitely is. It’s for children or younger adults (I could say like me, but I’m 23 and that’s probably older than a normal young adult is - right? But who cares?) That’s why I’m rating it as my thirteen year old self. And my thirteen year old self loved this book. It was so different, so funny and so entertaining. It was so much fun! Sadly, I had a slight idea what the ending is (thanks to the movies, duh) that’s why I wasn’t as surprised of it like others would be (but I was pretty surprised how much everything was changed in the movies?!). But still.. it’s a great book and I can’t wait to continue the story of Percy and his friends.Characters ⭐️⭐️⭐️Is my thirteen year old self in love with Percy? Probably. Is she in love with Annabeth? Yep. And does she wants to have a best friend like Grover ? Absolutely. Sure, there could’ve been more depth and a bit more character development. But it’s a children’s book, guys. Not an adult high end fantasy. So it was okay, it was good. It fitted the story perfectly and left a little bit open for the next few books.World ⭐️⭐️⭐️⭐️You know what? My first Rick Riordan book were the books about Greek gods and heroes. And I literally devoured them. One day and I was finished with these light and funny books that taught me a little bit about Greek mythology. (I tried some adult books and I got to page 3 or 4 and I was like: Nope, sorry. So dry and slow and soooooo confusing.) So if you ever want some funny background (that maybe isn’t really historical correct?) of the Greek mythology and Percy’s world, then you should definitely try out these books. But back to the main book: if you know just a tiny bit of the Greek mythology you know that there Is an Olympus full of gods and on earth there are humans and some rare half gods. Even though these were the stories of a time really far away, Rick Riordan is putting them back into our reality and our timeline. It’s hugely entertaining and funny and I loved it, even though there could’ve been more depth to the whole world building (but maybe that’s just a first book illness and it’s getting better with every book - who knows?) All in all it was really good for the genre it’s in. Relationships ⭐️⭐️⭐️⭐️Oh, friendship is such a huge word in this book (it’s a children’s book, remember?) and it was so heartwarming and so so cute. They were so loyal to each other and always protected and fought for each other. It was just so adorable and so cool. If I ever had the chance to meet these guys, I would totally join the group - even as an 98,12% human (who knows - right?🤷🏻‍♀️). Writing style ⭐️⭐️⭐️Well, it was funny. And entertaining. But it wasn’t worth five stars. It was a good, nice language. Fitting for a children’s book and a light hearted but still action filled story.It’s definitely worth trying it out even if you’re an adult and waited years to read it."}, {"Review": "Buddyread with the demigod squad мαү, Jenn and Chara Illustrations by: KAIAYAME “Deadlines just aren't real to me until I'm staring one in the face.” \n More like 3.5 stars to be honest. I wish I had read this book when I was a kid. I feel like 12 year old Kimi would have absolutely adored it. That being said I still really enjoyed it as a 23 year old. It was a pretty awesome little adventure and I'm glad I read it. ➨Grover is definitely my favorite character of the series so far. He's basically my spirit animal. He loves food and he's funny. What else could you ask for in a character? ➨I love the connection that Annabeth and Percy have. I foresee the cutest OTP coming to life in the near future. \n“You drool when you sleep.” \nWhen that's the first thing a girl says to you, you know she's the one. (That was relationship advice with Kimi *ding*) ➨Mrs Dodds scares the crap out of me. We don't talk about Mrs Dodds. The world building was actually one of my favorite aspects of this book. I have always been interested in Greek Mythology so I knew quite a bit about this field already. I love how Rick Riordan portrayed the Greek gods and I can't wait to read more books in this world. The plot is the main reason why I took some stars off my rating. It's not bad or anything but as many other Middle Grade books, it was quite predictable. Overall, I'm really glad to say that I'm finally part of the fandom. I'm planning to read one Percy Jackson book a month with my good friend мαү for the rest of this year so we can hopefully start catching up on this bandwagon. Let's see if we can stick to this commitment. Thanks for reading, please share your thoughts in the comments. I would love to know how you feel about this series. -------Pre-reading:For all those of you who are like \"Hey Kimi, where have you been for the last 10 years?\" Well, let's blame it on my parents (as you do) for never buying me a Percy Jackson book when I was a kid. When I first heard about this series, the train had already left and I was already \"too old\" for this kind of books so I let it go but now Rick Riordan keeps coming out with these awesome new books every year that everyone i know absolutely loves and I'm just sitting there in the corner. I feel so left behind. I want to be part of the fandom. I WILL be part of the fandom. "}], "Image": "https://images.gr-assets.com/books/1400602609l/28187.jpg", "Desc": "Alternate cover for this ISBN can be found herePercy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse - Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him. When Percy's mom finds out, she knows it's time that he knew the truth about where he came from, and that he go to the one place he'll be safe. She sends Percy to Camp Half Blood, a summer camp for demigods (on Long Island), where he learns that the father he never knew is Poseidon, God of the Sea. Soon a mystery unfolds and together with his friends—one a satyr and the other the demigod daughter of Athena - Percy sets out on a quest across the United States to reach the gates of the Underworld (located in a recording studio in Hollywood) and prevent a catastrophic war between the gods."}