{"Comment": [{"Upvote": "8", "Review": "Debbie Macomber’s newest book, Cottage by the Sea is a sweet romance.  There is no other description that works better.  She takes characters that have been thrown curves in life (Curves that would take most people down.) and allows them to find a home with hope.  This skill is highlighted in her newest novel.Annie was enjoying life as a young person.  She had a great career, friends and had a fun time.  When she was asked to come home for Thanksgiving, she declined having made prior plans.  It was that simple plan that changed Annie’s world and now she needs to find a way to move on.  It is hard to start again, so she goes to her last happy place, a small beachtown in the Pacific Northwest.Keaton has always known what it is like to be an outsider.  He was big, ungainly and didn’t speak.  He knew he was unloved and unlovable.  He has a few friends and a life in the seaside town, when he saw the woman who was the girl he fell for so many years ago…Keaton and Annie have a chance to change their hopes and expectations, but along the way they bring Mellie and Preston.  The ability to move beyond the past and start again.  The story takes many twists and turns and each step allows you to fall deeper and deeper in love with the characters and their plight.This sweetness in a story is not my usual level of enjoyment.  I like books that are a little edgier, but I will take a Debbie Macomber novel like this any day!  It was a fast read, the characters, stories and problems to resolve.  I was all in from the first.Thank you NetGalley for the opportunity to read this book.  A Cottage by the Sea by Debbie Macomber is a great read.", "Star": "5.0 out of 5 stars", "Title": "a sweet romance"}, {"Upvote": "5", "Review": "Debbie Macomber delivers a strong and emotional story that will tear at your heart in more ways than ever in COTTAGE BY THE SEA. With her trademark writing style, she delivers a story that is full of heart and at times lots of pain though tinged with hope. I loved this new release by one of my favorite authors. She created a story that is at times quite emotional, loving and with a sweep of her pen, romantic as well. When I first met Annie, she was full of life, hope and delight, determined to have a four-day weekend with her friends, to have fun without family obligations getting in her way. In all reality, a typical twenty-something who thinks she has the whole world to get to the heart of things later. As many know, life sometimes doesn’t deliver all rainbows and sunshine, especially when tragedy strikes. Annie made me love her and I in turn loved how she was able to finally breath, find peace and a chance to love once more. The small town of Oceanside worked its magic on Annie and I found it so irresistible. I was longing to see if this special town was real just to visit it one day. With each page I read, I was sucked not Annie’s story, of her coming to grips with her loss and finding her new normal; grieving yet also finding peace that has eluded her for over a year. The story flows so smoothly I didn’t know I was at the end of the book until I turned the page and saw there was nothing left of Annie, Keaton and their friends story.Ms. Macomber delivers a story that is at once powerful yet charming. A story that will stay with you long after you are done with the book. The characters made me laugh, cry, smile and sigh. I loved meeting Annie, Keaton and the residents of Oceanside so very much. Ms. Macomber has a knack to creating a story that leaves you breathless and longing for more. If you haven’t tried one of her books before, this is a perfect introduction into her writing. I do want to point out you may need a box of tissues at times as you fall into Annie’s life and loss.  COTTAGE BY THE SEA is a fast-paced story that will leave you with a smile in your heart and on your face. I look forward to seeing where this author goes next as I know I won’t be disappointed with her next story.", "Star": "5.0 out of 5 stars", "Title": "Delightful if at times hard to read through the tears"}, {"Upvote": "11", "Review": "This is an old-fashioned romance and a very fast read. There's no explicit sex. It won't be giving away any spoilers to say that every single obstacle is overcome and there's a relatively happy ending for all the characters. It's written in basic language - I'd call it fourth grade level - and is probably much cleaner than any book read by an average teenage girl. A lot of things are extreme, from character descriptions to plot devices, but it's pretty easy to put that aside and simply enjoy the way everything works out for the best.", "Star": "3.0 out of 5 stars", "Title": "A simple sweet romance"}, {"Upvote": "2", "Review": "You could say the bottom dropped out of Annie Marlow's world.  In one tragic instance her whole family was gone.  Sixteen months later she was still reeling and unable to move on.  Needing to find a happy place she went back to Oceanside.  Her family used to vacation here for a week every summer so she had good memories of their vacations.  Having found employment and also a place to live Annie moved to Oceanside.  It was here she found the peace she had been searching for.  She also found Keaton.  He is a very large man who speaks very little.  Annie finds that she really enjoys Keaton's company.  And where do things go from here?  You will want to read this book and find out because it is not all hearts and flowers.  I really enjoyed every minute of this book.", "Star": "4.0 out of 5 stars", "Title": "*** Love isn't all hearts and flowers ***"}, {"Upvote": "2", "Review": "First off, I have to confess I am no fan of romance novels, never have been.  The last romantic stories I read were “A Woman of Substance” and  “The Thorn Birds”, some 30 years ago.  I don’t even like novels at all, preferring instead non-fiction, true stories about history, spy stories, and especially anything about the U-boats.  So it’s conceivable that my review of this book may not be very objective.  I mean, are all romantic novels so schmaltzy?I chose this book because of the title; my family owned a cottage by the sea in Wells Beach (on the opposite coast), where I spent all my summers, so I figured I could relate to the story.  HA!  Not even close.  Also, quite frankly, it had been on the Seattle Times best seller list for MONTHS.  I figured, how bad could it be, right?  I just needed a little fluff to read at night when I can’t sleep, something to get my mind off whatever it is that’s keeping me awake.And, frankly, this book did that, which is the only reason I gave it two stars.  The author has proffered up an interesting story line and established her characters quite well.  I often felt like giving up and throwing the book in the GoodWill bin, along with all my clothes donations, but I had to find out what happened to the characters — which is the only reason I stuck with it.  I had to read past a lot of pages, skipping lots of redundant fluff that the author said over and over again, ad nauseam.  It’s an insult to the integrity of the reader, as if the author can’t remember that she already said it a couple dozen times before.  And seriously, does it really take five pages for the boyfriend to decide whether or not to give the bouquet of daisies to his girlfriend?  I got the impression that the author had a page quota.If you are interested in this book, you can find it at GoodWill, where I will be donating it.  No more of this genre of book for me!", "Star": "2.0 out of 5 stars", "Title": "Sorry, But NO."}, {"Upvote": 0, "Review": "As is the case with all of Debbie Macomber's books, this is an excellent book. Annie's parents, her brother and his wife, and their toddler died in a deadly mud slide in the early morning on Thanksgiving Day. Annie's mother had really pressured Annie to join them for Thanksgiving and Annie had refused. Now she had a bad case of survivors remorse.The family had spent many summers in a cottage by the sea at Oceanside where Annie had happy memories. She went to Oceanside to try to find her happy place. After just a short visit, she realized she found peace there so she packed up and moved. She found a job as a physician's assistant and managed to rent the same cottage from her summer memories. She was finding her peace and a whole lot of troubles to confront.", "Star": "5.0 out of 5 stars", "Title": "Is There Peace Anywhere?"}, {"Upvote": "4", "Review": "Not what I would expect from Macomber. Very repetitive. Slow. Boring. I’m having trouble even finishing. Definitely not up to par. I hope this isn’t going to be the new style in which she writes!!", "Star": "2.0 out of 5 stars", "Title": "Repetitive and boring"}, {"Upvote": 0, "Review": "The main character is a good person and she finds a true love from an unlikely source.  Along the way, she helps others be free of pain and worry.  You cheer the main character all the way through the book.  You are happy for her and you become even more proud of her for making the choices she does.  This is a book that starts with a bang and you are sad.  You have to continue reading in order to get to a happy place with the character.  All readers will enjoy this book and the setting for it too.  The author again delivered a great story!  Way to go Debbie Macomber!", "Star": "5.0 out of 5 stars", "Title": "Survival from a pain that no one should live with!"}, {"Upvote": 0, "Review": "I like reading books about living by the sea. This one started out good but didn't quite ring true for me. The main character, Annie, moves to a cottage by the sea (hence the title) after her family is killed. This is the same cottage her parents rented each summer for 2 weeks when she was growing up. It gave her comfort in the wake of the tragedy taking her parents and other family away for good.The guy she meets was described as being huge and silent. He came off (to me ) as being retarded or slow witted. That was fine.But then Annie is attracted to him and kisses him. A very unlikely union I thought.  Didn't click for me.Also I was disappointed they moved away from the place they both loved so much.Not one of my favorite books", "Star": "3.0 out of 5 stars", "Title": "Not one of my favorite books"}, {"Upvote": 0, "Review": "I usually love all of Debbies books but this story was long and boring, It may be the fact I got the audio book, and story reader almost put me to sleep each time I listened.  Sorry to be so honest but Debbie has done so much better. Hope her writing style returns from the past to punch up her next book.", "Star": "3.0 out of 5 stars", "Title": "Slow read - Not Debbies best"}, {"Upvote": 0, "Review": "Keaton has been a lost soul due to his fathers abusive treatment toward him since the loss of his wife during Keaton’s birth. Annie is a lost soul due to the loss of her entire family in a mudslide.Annie’s return to the small town her family vacationed in during her younger years, brings her back in contact with the small cottage her family once found joy in visiting. Keaton and Annie meet again and together they bring the Cottage back to life and their love into the fullness of being. Together they find love and healing.", "Star": "5.0 out of 5 stars", "Title": "Another heartwarming story of loss, love and-healing."}], "Star": "4.5 out of 5 stars", "Name": "Cottage by the Sea: A Novel", "Format": "Format: Hardcover", "Price": "$14.34", "Author": "Debbie Macomber"}