{"Comment": [{"Upvote": "60", "Review": "I just finished this book, and I loved it so much!  I laughed a bit, I cried, I hated to see it end even as I read on, eager to see what happened next. It made me feel as if I was right there with the characters experiencing what they experienced.  I can't say I have a favorite book, I have many favorites and this one has just joined the ranks of them.  I did read the one star reviews just out of curiosity, and I must say I am appalled. What ignorant people wrote those reviews? There were complaints of bad grammar and bad punctuation.  I saw none of these.  Maybe the critic meant the bad grammar as to the way characters spoke, which is how they should have sounded. Punctuation?  I saw nothing wrong.  One review criticized that the author mentioned the Heimlich Maneuver some years before Heimlich was born.  The words Heimlich and maneuver never appeared.  At one point a character slapped another on the back who was choking and the lodged food flew out, but not once did she say anything about Heimlich or Maneuver. Another criticism was that it wasn't historically correct.  How so?  If there were any discrepancies, keep in mind literary license perhaps, or if there were any historical discrepancies they were so minor as to be unnoticeable and I do know a bit about Titanic, having read about it for years.  All in all, I must say those bad reviews seemed to come from people who just wanted to complain out of jealousy or ignorance.  I don't know if the book was self published or not, but it was the best job of editing I've ever seen in recent times.  I recall no spelling errors either.  As to the names \"being too similar\" complained about ... what?  There was Maggie, Kathleen, Katie, Peggy .... names one would find in books about Irish people.  I HOPE OTHER READERS WILL DISREGARD THE \"SOUR GRAPES\" REVIEWS AND GIVE THIS BOOK A CHANCE.", "Star": "5.0 out of 5 stars", "Title": "A Genuinely Great Book"}, {"Upvote": "8", "Review": "A terrific book!  I loved the historical story of Ireland and the lives of modest folk. The vivid story of a young girl leaving the life she knows and traveling on a train for the first time to get to the ship.  The awe of the mighty TITANIC at first sight.  Amazing!  The description of the opulenceOf the ship and the sheer size of it.  I was pleased to read the 3 rd class accommodations were decent and the crew treated them well.The horrific event of the sinking was heartbreaking. I cannot imagine the terror those people went through with the freezing temperatures andFridged water. I felt as I was there enjoying the socializing on the ship and then the terrible night! The final events of Maggie's story was uplifting and very moving..  Very well written.", "Star": "5.0 out of 5 stars", "Title": "TITANIC SURVIVOR"}, {"Upvote": "18", "Review": "I e never read anything by this author, but, I will be sure to read everything she has written! Her writing is superb! Her attention to detail was so vivid, it was hard not to FEEL as though you were a part of the story yourself! She effortlessly traveled in time from 1912 to 1985, and between America and Ireland without any confusion or awkwardness. It was a side of Titanic that I hadn't been exposed to before...that being the grueling heart wrenching story of the survivors, the surviving family of lost loved ones, and those who were indirectly embroiled in the tragedy. How communities United to aid those in need, and comfort those who grieved, much in the same way we approach tragedies in modern times. Most stories  I've read or seen relating to the Titanic end with the survivors on the decks of the Carpathia, which is a disservice to the story.Although there wasn't the media presence there is today to document everything, this gave Such an accurate description, you almost didn't need film to capture it....words were profound enough. In a world where we are so accustomed to instant gratification, this author made the reality of the lack of it, and the pre-technological world achingly clear. The waiting and not knowing often took days, weeks, or even months or even years to disseminate information or communicate.Excellent book, phenomenal writing, don't Miss This One.", "Star": "5.0 out of 5 stars", "Title": "Breathtaking account of Life Before, During, and After Titanic"}, {"Upvote": "3", "Review": "Ms. Gaynor has written a really wonderful novel.  This book really pulled me in and made me cry and made me think.  The author's perspective was very introspective and gave me yet another way to remember tales of the Titanic.  Part of this book, reminded me of the last movie, and it also made reference to the old black & while version.  I have seen both.  We all recall the basic tales, the lives lost, the glamour of the ship, the tragedy.  This novel brought you closer to what it feels like to survive.  I am sure many people have asked, \"why did I survive?\" when a tragedy occurs.  If you have been lucky enough not to have been in that situation, this wonderful novel will take you there.  The writing was great.  I felt the depth of emotion from the characters, felt I knew them and suffered and rejoiced with them.  Read it - I suggest tissues nearby.", "Star": "5.0 out of 5 stars", "Title": "A touching, tragic novel with great depth of feeling.  When you read this you are transported back in time."}, {"Upvote": "133", "Review": "With the centenary of the sinking of the Titanic almost upon us, it's only right that we're reminded of one of the most awful maritime disasters in history. Hazel Gaynor's beautiful novel, The Girl Who Came Home, is not only a reminder of the actual disaster, but it's an exploration of human emotions - a gut-wrenching before and after look at lives that were forever changed on that momentous day.  Hazel has based this novel on a true story of the Addergoole Fourteen, a group of men and women who left their small village in County Mayo inIreland to board the Titanic for its maiden voyage.In Chicago in 1982, Grace Butler is looking for a story to write in order to revive her journalism career.  She needs something big - something that will tap into the readers' emotions and get her noticed.  But never in a million years was she expecting her great grandmother, Maggie Murphy, to be the one to provide her with what she's looking for.  Maggie has kept a secret for seventy years and decides that now is the time to open up and share it with her great granddaughter.And so the story takes us back to that rural Irish village in April 1912 when seventeen year old Maggie Murphy is preparing to sail on the Titanic, along with her aunt Kathleen and two of her best friends, Peggy and Katie.  In all, fourteen men and women from the village are packing up their lives in hope of a better one over in America.Maggie is excited about her impending voyage, but devastated to be leaving behind her beloved Seamus.  She hopes he'll be able to join her soon in America but in the meantime, he's written a selection of love letters to keep her company on the journey ahead.  These letters form part of this amazing story, where we learn what's going through the minds of some who have been left behind.  Maggie also keeps a private journal during the sailing and it allows us a glimpse into her innermost thoughts.Hazel's depiction of the characters in this novel is beautiful.  She brings us right into their lives and we become invested in them.  Although we know the fate of the ship, we're left rooting for the people we've come to know and hope that there's a way out for them.  We also see the stories of some of those waiting on the other side - the relatives and friends who have gathered to hear news of the ill-fated ship.  How unbearable it must have been to have to check a list of the dead, praying you wouldn't see your loved one's name on it.Through all the mayhem on the ship, we follow Maggie and learn her fate, but it's only as the full scale of the disaster unfolds that we begin to learn the fate of the rest of the Irish group.  Hazel manages to weave plenty of twists and surprises into the story and I have to admit to shedding a tear on a few occasions.Forward to 1982 and Maggie and her great granddaughter decide to take a trip back to that little village in Ireland where it all began.  Seventy years on, she feels it's about time she made peace with her past.  It's an emotional scene as the past mingles with the present and we're left reeling as some unexpected plot twists reveal themselves.If you're a lover of all things Titanic, you'll love The Girl Who Came Home, but if you just like a great emotional read with amazing, relatable characters, this is also the book for you.  Hazel has managed to take a story that we've all heard a million times and give us a new perspective.  Her attention to the detail of the ship made me feel I was there and her ability to portray the innermost thoughts of the characters meant I was fully invested in them and their safety.  It's a thoroughly enjoyable read and I'd highly recommend it.", "Star": "5.0 out of 5 stars", "Title": "A wonderful, heart-wrenching read"}, {"Upvote": "4", "Review": "I really enjoyed this telling of an already frequently visited story. It reminded me of the movie starring Leonardo DiCaprio and Kate Winslet, although this one had a happier ending that I wasnt expecting. The only part that I did not like, and the reason I rated it 4/5 stars is the multiple times the author commented negatively about the little dog in the story. Once from a character's point of view, MAYBE twice I could understand. Instead the numerous negative references re the little dog seemed to reflect the authors' own negative feelings which really bothered me and I felt completely unnecessary and cruel.  Otherwise, I enjoyed the book.", "Star": "4.0 out of 5 stars", "Title": "Very Good Tale"}, {"Upvote": "4", "Review": "I will never buy another book by Hazel Gaynor. This author seems to enjoy repeating herself as though her readers are children who need to be reminded over and over about the traits of characters or the blossoms on cherry trees in an Irish village.  I felt as if Ms. Gaynor was obligated to fulfill a contract for a certain word limit in her book so she had to \"pad and ramble\" in her text.", "Star": "1.0 out of 5 stars", "Title": "Tedious Reading"}, {"Upvote": "2", "Review": "This is a wonderful story of those who traveled to America in search of a better life, some on ships that made it to America's harbors and some on the Titanic.  Maggie seemed to have an average Irish upbringing, giving the reader a glimpse into life before coming to America's shore.  The surprise ending really thrilled me, as I had hoped for something like that, but no spoiler here.  Intertwining Maggie's story with Grace's shows a generational bond not always seen today.  The book brings different social classes traveling together, showing how each prepared for the voyage and how the response to the sinking was basically the same for all classes.  I recommend this book highly, it tells of lasting relationships.", "Star": "5.0 out of 5 stars", "Title": "Titanic Memories"}], "Star": "4.5 out of 5 stars", "Name": "The Girl Who Came Home: A Novel of the Titanic (P.S.)", "Format": "Format: Paperback", "Price": "$14.20", "Author": "Hazel Gaynor"}