{"Comment": [{"Upvote": "59", "Review": "This was a terrific read!  Frazier takes us through the passages of Varina's life as a mirror to the life of the South during her years from youth to old age.  Frazier's depiction of the antebellum South, complete with the neurotic obsession of her soon-to-be brother-in-law's vision of a slave culture and her soon-to-be husband's unique relationship with his overseer/slave/friend, Pemberton, precisely defines what southerners meant by the term \"the peculiar institution.\"  Her flight southward is of course metaphoric for the flight of any southerners in the disastrous end of things for the Confederacy.  The vignettes along the muddy roads headed southward are excellent, and say much about what was to come for the South over upcoming decades.  I especially like the depiction of Varina as an ever more independent thinker and actor.  It's hard to imagine that the marriage to a repressed martinet like Jefferson was one of much joy.  And over time nearly all their children die.  Varina emerges as a woman who can stand apart from her world, evaluate it, see it for what it is, and maintain a dignity and an integrity.  I came away liking this woman, perhaps respect would be a better word.  And as a longtime student of the Civil War and its aftermath in Dixie, I found her an excellent cipher for its people and their travails.  Beautiful phraseology throughout.  Great story.", "Star": "5.0 out of 5 stars", "Title": "Varina's Life as a Metaphor for an Age"}, {"Upvote": "30", "Review": "Varina Howell was born into a Mississippi family whose economic status waxed and waned. At the age of 13, she was sent for one year to a girls' school in Philadelphia and returned home to be tutored by a lawyer/judge living in a cabin on her family's homestead.  Judge Winchester instilled in Varina a life-long love of books and trained her in both Greek and Latin for a life of the mind through the study of history, philosophy, poetry and mathematics.  As \"spinsterhood\" approached, at the \"ripe old age\" of 18, Varina was married off to the widower Jefferson Davis, over twenty years her senior and still eight years in mourning for his first wife.  Varina later noted, \"Back then, a good marriage did not require love: a good marriage meant security.\"  She planned to settle on the Davis Mississippi plantation, but her husband chose a political career as a member of the Federal House, Senate and finally Secretary of War. The couple lived in Washington, DC for over 15 years where Varina, because of her wit, charm and education, became friend and hostess to Presidents and Congressmen of the day.  After the Mexican American War, she refused to join her war-hero husband back in DC until he changed his will to make her the beneficiary of his estate.  She finally won her cause.  When the Civil War began and her husband became the first and last President of the Confederacy, she reluctantly moved with their children to the Grey House in Richmond.  She loathed Richmond and was never accepted by the local high society.  She viewed slavery as the \"strangeness of owning people\" since she treated \"help\" like members of her family.  She believed that the South was unprepared for conflict and queried of the Confederacy, \"Is it self-government or self-immolation we are testing?\"  As Richmond burned, she fled with her children and a few loyal servants toward Florida and ultimately planned an escape to Cuba.  It was not meant to be: Jefferson was captured and later imprisoned near DC for two years and she was \"imprisoned\" for a year in Savannah.  After the war, she lived mainly apart from her husband in Europe and with friends throughout the South.  Upon his death, she completed his memoirs.  She supported herself in New York City by writing articles for the New York World.  She befriended Julia Grant, wife of Ulysses Grant, and the women were often seen in public to promote further reconciliation within a healing nation. Varina openly asserted, \"The right side won.\"Frazier is a master wordsmith. He unwinds Varina's life backwards, from the end of her life forward, primarily using fictional conversation. Frazier's prose captures not only the lushness and false \"civility\" of the slave-propelled agricultural economy of the Antebellum South, but also the ravaged landscape and desperate population after Sherman's march to the sea.  Even better are Frazier's delicate forays into the psyches of post-war Jefferson and Varina.  The first reveals a delusional, old man failing both mentally and physically quite emotionally detached from his wife of almost fifty years.  The other is a person with a will of steel who fulfills her obligations, mourns the death of her children and creates a new life.  She wrote, \"It is a frightful thing to drop out of one's place in the world and never find it again..\" Thanks to a gifted author, the reader becomes acquainted with an important American feminist who was, in many ways, ahead of her time.", "Star": "5.0 out of 5 stars", "Title": "A Southern-Belle Bellwether"}, {"Upvote": "19", "Review": "This book was a true testament of what a man I never knew anything about was really like.  Jefferson Davis.  It was an interesting story of a very unusual marriage during one of the worst times in our country's history. And the courage Varina had in taking care of her own.  She was a woman way ahead of her time and never failed to speak her mind and question what she did not understand. She never looked back, always to the future and took the good, bad and ugly in her stride.  Good read although written in a different mode.  If you like history  and fiction combined you will definitely enjoy this book.", "Star": "5.0 out of 5 stars", "Title": "Loving History with a twist"}, {"Upvote": "25", "Review": "As a life long reader and a person with ancestry firmly in the South for generations, books centered in the Civil War and Reconstruction era are sought out. The author, Charles Frazier, previously wrote Cold Mountain, a Masterpiece, in my opinion. Often a novelist has that one outstanding book and all that follow seem inadequate, even those well done. With Varina, the author has accomplished his next great work! Difficult as it can be to weave real historical figures into the fabric of fiction, Frazier has done so, and in excellent form. For readers who have preconceived thoughts, that all of war was a simple concept, after reading this book, you may feel differently. The human, emotional weavings with passion and yet, leaving the reader to ponder and reflect without judgment. Stop and reread and repeat, the same paragraphs, for the nuances and beautiful structure of thought into words, is what I found myself doing. Frazier is the most eloquent writer of near prose I have found. He can turn a phrase so profoundly, you want to keep it with you. I often do copy them down.In these days of selective spending and the abundance of book selections, it is easy to be tempted by covers and advertising. Varina is a novel that will be a keeper and one you will recommend to friends. I highly admire this book and the authors dedication to fairness, frankness, and the harsh truths that we humans created and still exist with the aftermath to this day.", "Star": "5.0 out of 5 stars", "Title": "Another Masterpiece! Varina!"}, {"Upvote": "7", "Review": "The premise of the book sounded intriguing and I have loved Frazier's past novels however, this one missed the mark from my point of view.  It might have been because I was reading it on my Kindle Book, but it seemed hard to follow the characters, time and place.  I didn't find the characters to be particularly interesting or authentic.  I kept thinking that it would get better as I kept reading but it really didn't.  It was one of the few books where I was glad when I had finished it.  Sorry, Charles.  I will try your next book though.", "Star": "3.0 out of 5 stars", "Title": "Not Up to Frazier's High Literary Standards"}, {"Upvote": "2", "Review": "Varina is a novel about the wife of the Confederate President, Jefferson Davis, by Charles Frazier, who also wrote Cold Mountain. A large portion of the book deals with Varina Davis’ life after the fall of Richmond. It follows her unsuccessful escape accompanied by her children, servants and friends as she tries to reach Cuba.The novel weaves back and forth in time as James Brooks, aka Jimmy Limber, connects with her in her later years. The controversy of whether James was originally a slave of the Davises, an adopted son, protege or family ‘pet’ is never completely explained. But James collects V’s memories of her life as a girl, her meeting and marriage to Jeff Davis, her early days in Washington as a political wife and later as the First Lady of the South and the tragic loss of her young son, Joe.It took me al least a third of the book to relax into the writing style. At first, I found it self aware and bordering on pretentious. As I got more deeply into the extraordinary life of V, my irritation at the forced writing style fell away. She is portrayed as a complex, intelligent and wily woman, clearly ahead of the times she lived in.What the novel did was whet my appetite to discover the true Varina Davis and I shall carry on with my research.", "Star": "4.0 out of 5 stars", "Title": "3.5 Stars. A Slow Start But Worth It"}, {"Upvote": "2", "Review": "From now on I will always read the sample pages online. If I had known that Frazier doesn’t use quotation marks around dialog, I would not have bought this. It is sad that so many readers overlook this and award the book 4 or 5 stars.  I’m my opinion, this quirk  makes for clunky reading. This, coupled with his sometimes over the top metaphors, only brings attention to the author. When reading a book you want the opposite effect, you want to be transported to another place.  Here, you stop and notice the quirks.  Also, I found the narrative very jumpy, hard to follow. I have read many recent popular historical novels about the old South and I loved them. In this book I didn’t get a true sense of place, despite the many metaphors.  I’m sure there is a good story in here, but readers  shouldn’t have to work so hard to find it.", "Star": "1.0 out of 5 stars", "Title": "His ego is showing"}, {"Upvote": "3", "Review": "I had never heard of Varina Davis before I read this book but I like the author. It is a tragic story in many ways but beautifully written. Another stunning example of how women had almost no rights but we're incredibly strong and resilient-more so than the men who had all of the rights at the time.", "Star": "3.0 out of 5 stars", "Title": "little known wife of confederate president"}, {"Upvote": "2", "Review": "But it just didn't quite measure up. In places, the writing is beautiful as you expect from Frazier, and sometimes the book really captured my interest, but I kept finding myself putting it down and then picking it back up again. The narrative is disjointed and cumbersome in places, and I never felt any connection to the characters. Also, while I do like Frazier's ability to write, the way he sets off dialogue with dashes grates on my nerves after awhile. Overall, I wanted to love this book, and I didn't hate it, but I just expected more/better. I definitely will read more about Frazier, however.", "Star": "3.0 out of 5 stars", "Title": "I'm a Civil War buff and wanted to like this book."}, {"Upvote": "4", "Review": "I purchased this book, because I really knew little about Varina Davis. There were some interesting historical facts, but I never felt I knew her.  The jumping from the past to the present was not a helpful format. There were too many people to keep track of, and I found myself skimming through.", "Star": "3.0 out of 5 stars", "Title": "Enough to make me finish, but not enough to wow me"}, {"Upvote": 0, "Review": "I'm a member of a very smart book club, and we all gave a thumbs up to Varina, many of us having read most or all of Frazier's other work. What I found especially compelling aside from Frazier's narrative strategy, which alone makes the novel worth reading, is how Varina introduces the issue of race, something that pretty much defines the United States today as it did in the nineteenth century. Whether you are more interested in history or in literature, you won't be disappointed in Varina.", "Star": "5.0 out of 5 stars", "Title": "Compelling and Timely Novel About an Interesting Historical Figure"}, {"Upvote": 0, "Review": "I really enjoyed reading this novel about Varina Davis, the First Lady of the Confederacy.  I found her a fascinating character and Frazier did an excellent job of depicting that time in our nation's history.  After I read his description of their wedding picture I looked it up online.  He is spot on!  The life of a Washington wife as told from her point of view was an exciting one especially as Varina was barely out of her teens.  If you like historical fiction you should try this one.", "Star": "4.0 out of 5 stars", "Title": "First Lady of the Confederacy"}], "Star": "4.1 out of 5 stars", "Name": "Varina: A Novel", "Format": "Format: Hardcover", "Price": "$14.55", "Author": "Charles Frazier"}