{"Comment": [{"Upvote": "13", "Review": "Fifteen year old Bee lives in Seattle with her parents in a 12,000 square ft building that once was a Catholic school for wayward girls. To say their lifestyle is unconventional would be an understatement. Their \"home\" has blackberry vines growing through the floorboards, a roof that leaks like a sieve, and an odor that would assault anyone's nose who might enter; yet the three of them don't seem to notice. It's not because of lack of intelligence or money. They all have Einstein level IQs.  Elgin has a very high level job at Microsoft, Bernadette is an award winning architect, and Bee has been accepted to a prestigious boarding school.They are planning on taking a trip to Antarctica over Christmas break, a reward for Bee's perfect report card. But things start going awry. And then Bernadette disappears...This is a strange story told in an unique way.  It's told by Bee with the help of emails, letters from school personnel, police reports, medical reports, invoices, etc. This book is satirical; certainly not a book anchored in \"everyday life\" realism.  In this regard, it reminds me a bit of Rachael Joyce's \"The Unlikely Pilgrimage of Harold Frye\".\"Where'd You Go, Bernadette\" isn't for everyone. Of course you can say that about every book ever published, but that goes double here. I would've given up on it if not for a reading buddy who pushed me to stick it out.  The characters are not likable in the beginning (or understandable), especially Bernadette.  But once I got through the first quarter, I was invested in the story. And when I reached the last page, I realized wisps of Bee, Bernadette, and Elgin have been written in my memory bank with a permanent marker. They'll fade, but never completely leave.Can't possibly give this less than 4 stars.", "Star": "4.0 out of 5 stars", "Title": "Be prepared for a unique reading experience!"}, {"Upvote": "22", "Review": "I didn't care much for this book.  With all the hype, I was expecting a seriously funny, interesting book.  I didn't like the characters and the plot was ridiculous.  I didn't care for Bernadette.  I thought she was a flake.  Maybe to enjoy a book, you have to become engaged with the characters, but for me, I only liked and felt sympathy for the daughter.  Now, I'm clearly in the minority of ratings.  Many people read and enjoyed this book, so don't take my rating as the gospel.  I think you should at least try a sample to see if the book is to your taste.", "Star": "2.0 out of 5 stars", "Title": "Not to my taste"}, {"Upvote": "8", "Review": "I really enjoyed this book - even though it wasn't remotely what I was expecting. Told through a series of narrators, with emails, letters, and texts, this is a tightly-woven contemporary epistolary novel. The primary narrator is Bee, telling the story from her perspective as a young teen daughter. Bernadette, her mother, is a former MacArthur genius award winning architect, who is missing.The book is by turns hilarious and touching. It skewers helicopter parents, high tech, and Seattle. It also focuses on mother-daughter relationships, family dynamics, and creativity. The main characters, including Elgin the father and husband, are unforgettable. This is a book that makes you feel good!", "Star": "4.0 out of 5 stars", "Title": "Unusual and interesting novel"}, {"Upvote": "4", "Review": "Thank goodness I picked this book back up after not liking the Kindle sample a couple of years ago. It was so odd and quirky—laid out as a series of speakers or written communications alternating to roll out the story. So many others loved the book that I gave it another try. I'm so glad I didn't miss this highly entertaining, funny, poignant, and remarkably original work.There are so many layers here, and my review will not do it justice. It is a screamingly funny and intelligent satire of the wealthy, bright, but eccentric \"Microsoft executive types\" in Seattle. A review on Amazon got it just right: \"A whip-smart, hysterical dramady about a family in crisis after the disappearance of its misanthropic matriarch.\" That matriarch was Bernadette.Bernadette—at one time a revolutionary architect with a cult-like following—dropped out of that world to accompany her equally brilliant and odd husband to Seattle for his ground-breaking work in artificial intelligence with Microsoft. Their delightful daughter Bee is achieving great things at school and is relatively oblivious to her family's eccentricities or her mother's increasing agitation and agoraphobia in dealing with the \"gnats\"—parents at Bee's school whose antics and priorities are hilariously sublime satire.Bernadette's disappearance sends Bee and her father on a poignant, intense, and globe-trotting search, during which they uncover much about themselves and about the power of love and the importance of being true to one's self.", "Star": "5.0 out of 5 stars", "Title": "Original, smart, and very satisfying."}, {"Upvote": "4", "Review": "From the outside Where'd You Go, Bernadette? is essentially chick lit fluff. At its core though it's a funny, sad, heartwarming story about the love between a mother and daughter. The novel is told through a series of documents such as emails, faxes, hospital bills, letters-and some occasional real time plotting. It definitely shows that there are two sides to every story. Bernadette Fox suffers a professional disturbance in LA and her and her husband Elgin make the move to Seattle, where Elgin quickly rises in rank at Microsoft while Bernadette suffers a series of miscarriages and is unable to get over what happened in LA. They have a daughter, Bee who is super smart and is more or less the one laying out the story. Bernadette unable to cope with her professional and personal losses becomes increasingly agoraphobic and particular. Elgin is constantly at work. Bee however worships her mother and the strange world her mother has created, Bee sees as fun and magical. After a series of mishaps Elgin decides Bernadette needs psychiatric help and schedules an intervention that goes horribly wrong and Bernadette disappears. But Bee knows if her mother can be found, it's her that can do it. I really enjoyed this book. The writing and pacing is good.", "Star": "4.0 out of 5 stars", "Title": "Better than I expected"}, {"Upvote": "3", "Review": "For a time I lived around Cupertino, and I recognized many of the characters. I had the impression that the book would have continued in the vein (would be. 5 star review).However the quarrelsome/crazy women finds an iceberg and is rendered sane and functioning. The 15 year old daughter matures in under an hour and all is right with the world. The husband is sort of left out of the game plan.A quick read and flows well.", "Star": "2.0 out of 5 stars", "Title": "Hollywood Ending"}, {"Upvote": 0, "Review": "This one is a great read — Where’d You Go, Bernadette? by Maria SempleI enjoyed this book immensely, giving it 4 stars! It is cute and quirky. An epistolary novel written from the perspective of Bernadette’s daughter Bee. In the novel we learn from Bee that Bernadette is a wonderfully brilliant and eccentric woman who owns up to her short comings and stands up to the antagonists with grace and cleverness. Quite honestly Maria Semple had me at the first page:PART ONEMom Versus the GnatsThis first page had me hooked. I was thrilled that I already felt the makings for a good, lighthearted read, and I was not disappointed! Semple wove a tale of highs and lows, struggles and triumphs indicative of the idle middle class. I could see something like this happening in Anywhere, USA. If you’re looking for a good read that doesn’t take itself seriously, with high action, great humor, and a lighthearted air — then this is a great book to dive into! I highly recommend it.", "Star": "4.0 out of 5 stars", "Title": "This one is a great read"}, {"Upvote": 0, "Review": "This was a fun, entertaining read that I got through in about a day when I was holed up with a stomach bug.The first-person narrative shifted often through the use of emails as the medium for the protagonist making it a bit hard to follow.Sometimes the \"content\" of the emails seemed far less like language that would be written in emails -- the use of \"and then I said....\" isn't typically how emails would be written so you also didn't know if you were still in the email conversation or standard prose.I was a bit bored with the drama that was created by the stereotypical dram of the husband working long hours and falling out of touch with his wife plot line, and some of the plot scenarios you can see coming a mile away.All in all, this book kept me entertained and I didn't have to do too much thinking while I was sick.", "Star": "4.0 out of 5 stars", "Title": "Delightful entertaining read"}], "Star": "4.2 out of 5 stars", "Name": "Where'd You Go, Bernadette: A Novel", "Format": "Format: Paperback", "Price": "$9.76", "Author": "Maria Semple"}