{"Comment": [{"Upvote": "13", "Review": "After reading this volume, it makes you question whether Ainz is actually the protagonist of this series until now or someone villainous like him who has been pulling the strings. Similarly to Volume 4, Volume 7 has basically also portray the protagonist as the main villain this time around, but the events unfolding here is more brutal and gruesome in comparison. The fact that I had to invest myself into reading it from the viewpoint of characters outside Nazarick solidifies that Ainz is becoming more evil as he can get. His minions or NPCs are acting exactly the same way as him since he permitted them to do unspeakable, horrific things to these characters. If anything, Volume 7 as a whole got me to reevaluate Ainz differently than your average protagonist in other Isekai series.", "Star": "5.0 out of 5 stars", "Title": "After reading this volume, it makes you question whether ..."}, {"Upvote": "15", "Review": "This is by far the darkest book yet in the series, this volume follows a group of people who for one reason or another aren't registered with the adventurers guild,Instead these people are called workers and the jobs adventurers don't or can't take are how they make a living. They get hired to survey a newly discovered ruin and well, it ends up being the Great Tomb of Nazarick. This was a story where at some points I had to just put the book down for a moment and picture the events in my head and would end up shuddering.we learn quite a bit more about the empire and a little bit about the slane theocracy, and we finally get to meet the Prince of Fear... If you've read the books up to this point and enjoys them then you'll probably enjoy this one too, even if it leaves a bit of a sour taste in your mouth. I'll definitely be picking up the next volume.", "Star": "5.0 out of 5 stars", "Title": "Darkest entry yet..."}, {"Upvote": "6", "Review": "Another nice addition to the series. One of the reasons Overlord is so fun is because the author isn't afraid to shift to multiple point of views of different characters in the overall story line. It makes the story and its world feel more alive. In that sense, the perspectives shown and the some of the actions committed in this book are the darkest yet. It may, like it did a bit with me, at times feel exaggerated or forced (I only mean about the main character here). Don't get me wrong, I am a sucker to dark fantasies, and its not anywhere enough to ruin my enjoyment as like I said, I think it was more of a exaggeration rather than a plot hole or a mistake. Anyhow, I expect things to further escalate as Nazarack develops and becomes more influential to the world, and can't wait to see what happens next. My only wish is that the books get translated a bit quicker, but I guess you have to live with what you got.", "Star": "5.0 out of 5 stars", "Title": "Can't Wait For The Next Book"}, {"Upvote": "4", "Review": "Thank you so much for creating a story with a protagonist who is not the \"faint when a hot girl talks to you type\"! Finally a \"good guy\" who isn't afraid to get his hands dirty...or bloody. Please keep this series going!!!", "Star": "5.0 out of 5 stars", "Title": "Dark and enticing"}, {"Upvote": "2", "Review": "Love this LN series and the anime, managed to read this one before the S3 premiere that covers this", "Star": "5.0 out of 5 stars", "Title": "Thumbs Up"}, {"Upvote": "2", "Review": "Love the Overlord series and the light novel is always such a delight to read.", "Star": "5.0 out of 5 stars", "Title": "Five Stars"}, {"Upvote": "2", "Review": "I gave it a 5 star rating because it fulfilled my desires of knowing what is happening next along with more characters.", "Star": "5.0 out of 5 stars", "Title": "Definitely a great series"}, {"Upvote": "2", "Review": "I feel like just started reading... And suddenly 'boom!' i'm out of pages... I feel cheated. I need more. I shall haunt your dreams if you don't release book 8 soon~", "Star": "5.0 out of 5 stars", "Title": "Too short!"}, {"Upvote": 0, "Review": "Great little read, oh boy did that get violent. Might be expensive for a 2-3 hour read, but it is the only light novel I will purchase.", "Star": "5.0 out of 5 stars", "Title": "Good read"}, {"Upvote": "2", "Review": "Really do I need to say anymore if you are here then you know why not to hear me talk about it but to buy it for we all serve the Overlord", "Star": "5.0 out of 5 stars", "Title": "All hail the overlord"}, {"Upvote": "2", "Review": "This volume is great!  It continues to build and expand on the world of Overlord.  If you have enjoyed the previous volumes, this volume will be a great addition to your collection!", "Star": "5.0 out of 5 stars", "Title": "More Overlord Goodness"}, {"Upvote": 0, "Review": "Great series, cannot wait for the next one", "Star": "5.0 out of 5 stars", "Title": "Excellent Story line"}], "Star": "4.7 out of 5 stars", "Name": "Overlord, Vol. 7 (light novel): The Invaders of the Great Tomb", "Format": "Format: Hardcover", "Price": "$13.59", "Author": "Kugane Maruyama"}