{"Comment": [{"Upvote": "8", "Review": "I am very happy this book came out,I am a very big fan of the the baby sitters club books and I am sooooo happy the 6th book came out! It's very cool that Mallory became the 6th member of the baby sitters club last book,when there were 5 members,in the 5th book,and now,there are 6 members,and its book 6!!!!! Hahaha!!! Its actually funny once you think about it. My favorite part about the book is probably the 5 days watching the kids! And also doing a \"rehearsal wedding\" seems like a great idea! It seems like an example of what the real thing will be like. It seems like an amazing idea for real life with chores,wedding,school plays,and more!!!I can not wait until book 7 comes out!Who is it, I think Mary Anne's turn to do it in 1st person??? And by the way Ann Martin you are a VERY good writer and I have been recommending this series for YEARS. Well that's it from me and thank you for taking the time to read my review. Bye!🦄", "Star": "5.0 out of 5 stars", "Title": "So happy it came out!!!"}, {"Upvote": "7", "Review": "I am very happy to say that this is one of my favorite baby sitters club books! I am VERY exited that they are making a graphic nov about it!! Happy Reading!", "Star": "5.0 out of 5 stars", "Title": "LOVE!!"}, {"Upvote": "2", "Review": "Hey guys!It's Mintstar!Here is my review:I LOVED this book so much!I really loved the system they used to control all the kids.I have to go to a gathering!See everybody soon!Mintstar", "Star": "5.0 out of 5 stars", "Title": "Kristy's big day"}, {"Upvote": 0, "Review": "One of my daughter ‘s favorite books during these days. She collects all the baby sitters Club books and introduces them to all her good friends.", "Star": "5.0 out of 5 stars", "Title": "Excited to have it"}, {"Upvote": 0, "Review": "The new baby sitter book is pretty good because it was a bit more awesome then the 5 it was great.", "Star": "5.0 out of 5 stars", "Title": "This was awesome"}, {"Upvote": 0, "Review": "My grand daughter loves thes books. We buy them when new ones come out.", "Star": "5.0 out of 5 stars", "Title": "Great books for younger kids."}], "Star": "4.9 out of 5 stars", "Name": "Kristy's Big Day (The Baby-Sitters Club Graphix #6): Full-Color Edition", "Format": "Format: Paperback", "Price": "$9.34", "Author": "Ann M. Martin"}