{"Comment": [{"Upvote": "56", "Review": "Compared to some other reviewers, the packaging of my copy of this book was quite adequate to protect it and it arrived in perfect condition with a nicely illustrated dust cover.  The ONLY possible complaint that I might have is that while the text pages are nicely bound to a cloth backing, the book's boards are merely covered in paper.  I would have been more than willing to pay a bit more for cloth covered boards, but for only fifteen bucks, this was still acceptable.Now, as to the story itself, I first encountered this story with SkytheWood's online translations and fell in love with the story about a leader of monsters in a virtual reality game finding himself in an alternate reality after the shutdown of the game's servers.  The pacing of the story is perfect and the main character's continuing dilemma of finding himself thinking more like an evil skeletal Overlord as opposed to his former kinder self as a human is both touching and hilarious at different times.  I particularly enjoyed his trying to come up with a suitably \"evil\" reason for doing the \"good\" deed of saving a nearby village as this definitely appealed to my admittedly warped and twisted sense of humor.So I, for one, am extremely happy that this wonderful story by Maruyama Kugane is finally available in a licensed English publication and I will eagerly await each new volume that gets released in English so that I can properly support the author that up to now, I have been enjoying for free online.  I only hope that the author and Yen Press will see the online translations as the FREE advertising that they were meant to be since SkytheWood dropped this series as a project as soon as the news of this series being licensed came out.", "Star": "5.0 out of 5 stars", "Title": "Finally!  Overlord is available in a licensed English publication!!!"}, {"Upvote": "17", "Review": "The condition, I received This novel in, was outstanding! Not a ding or scratch on it and the packaging was in a box like cardboard wrap(idk what it's called sorry). There is a small pull out art page with the main characters on it and on the back is a look at all the different subterranean levels of The Great Tomb of Nazarick! Cool! There are a few pages with illustrations throughout the book and at the end there are a few pages of Character Profiles worn their states and such.The price was what got me interested in this seller, the product's, quality and the seller's fast shipping is what will keep me coming back!This series is incredibly addictive! I love the anime! It's a good story and definitely a good read for us gamers.Thank you! I love this book!", "Star": "5.0 out of 5 stars", "Title": "Perfect store quality condition! 5 stars!"}, {"Upvote": "6", "Review": "I have never read a light novel before. It was a very interesting and enjoyable experience. Lovely artwork within the book, it felt just like a novel but with the occasional picture and slightly differently done chapters. The text itself was very good for a fantasy novel and catered to my tastes and interests. I was familiar with the anime for this series and the book definitely is even better. It goes a bit more in depth and you really get a feel for the protagonists thoughts and feelings.Enjoyable story looking forward to reading the second one.", "Star": "5.0 out of 5 stars", "Title": "Very enjoyable and interesting"}], "Star": "4.7 out of 5 stars", "Name": "Overlord, Vol. 1 - light novel", "Format": "Format: Hardcover", "Price": "$16.31", "Author": "Kugane Maruyama"}