{"Comment": [{"Upvote": "112", "Review": "I received an advanced copy of The Girl Who Lived.I am a huge fan of the Jack Stratton Series, by Christopher Greyson, so I was excited to receive The Girl Who Lived. I like mystery, suspense, thrillers, and psychological thrillers in general. This book definitely fits into those categories.Although the writing style is Christopher Greyson it is a departure from the Jack Stratton Series. The Girl Who Lived is a bit darker, it deals with survivors guilt and addictions that manifest themselves after a horrendous crime and the aftermath. The main character, Faith, feels she is a broken person. She is alive, but not living. I think anyone reading this book that can relate to her anxiety, despair, and emptiness will appreciate her struggle. But you don't need to be a survivor to get wrapped up in the suspense.I was totally surprised by the ending. I didn't see it coming. But all of the puzzle pieces start to fall into place as you look back.I thought the first two chapters were a bit slow, but you really want to hang in there. I think those first few chapters explain where Faith is and why. Then the story starts picking up... and then I could not put down the book. I was reading from about 12:30am to 6:30am. I was going to read just until I fell asleep. But it is morning, my eyes are dry and bloodshot and it is time to feed the dog breakfast.", "Star": "5.0 out of 5 stars", "Title": "Intriguing Psychological Thriller"}, {"Upvote": "27", "Review": "Rugged, unbreakable, resilient, and tough as nails are just a few ways one could describe Faith. Her life was nearly perfect. Even though she didn't have her sisters looks, she seemed to have everything else. A loving family and a beautiful friendship.It was all taken. Everything she had. How can someone begin to pick up the pieces? This novel proves there is only one way... revenge.Faith was willing and wanting to give her life to put a hault to her pain. She was so fragile. Never have I seen a more marvelous transition in a character. Faith transforms from delicate to durable so quickly you contemplate rereading the second portion of the book.The spiraling of events will leave you crying, hoping, and petrified. I felt an immense amount of compassion and remorse for our protagonist. I could not set this book down!No one can be trusted. Hell, some of them might not even truly exist. Faith finds comfort in very few people and then learns they cannot be trusted either. She is exhausted with the constant internal struggle; deciding whether or not to live. If she didn't live, she wouldn't find the putrid man that stole her innocence, her childhood, and essentially, her entire life. We learn the true meaning of coward here.A huge thumbs up to Christopher Greyson. I thought this was immaculately written and beautifully finished. The ending is spectacular and non predictable. It has been a long time since i enjoyed reading something so much and I will continue to sing its praises until everyone I know reads it.", "Star": "4.0 out of 5 stars", "Title": "Her life was nearly perfect. Even though she didn't have her sisters looks"}, {"Upvote": "30", "Review": "While not the usual type of book I read (I lean more toward prepper and military books), I read Christopher Greyson books since I enjoyed his Jack Stratton series so much.  This book features a damaged young woman trying to hold her life together and solve the murder of her parents, while being disbelieved by almost everyone she meets, and having a history of being institutionalized.  How's that for a challenging plot?  It seems like as soon as she is released on the streets, she is attacked by the man she can't get anyone else to believe in, who she saw kill her family.You will cheer for her successes, sigh at her missteps and thank anyone who tries to help her.  A good read.", "Star": "4.0 out of 5 stars", "Title": "The world doesn't believe her, but she perseveres"}, {"Upvote": "15", "Review": "This was an excellent read that kept me on my toes from the first page to the last.  I am not much of a sleuth, so as I read the book I kept thinking, “don’t trust him” or “don’t trust her.”.  The ending was a surprise to me although I’m sure there are those who will say it was obvious from the beginning.  It never is to me, so I always wonder about those kinds of statements.  Anyway, this was a book about a young woman, Faith, whose father, sister, best friend and best friend’s mother were all murdered when she was 14 years old.  She was there when it happened and got a look at the killer that she dubbed “rat face.”  However, most people don’t believe her about “rat face,” and believe that her father was the one who killed all the others and then himself. She managed to run away when her sister urged her to run (at the expense of being killed herself).  Ten years later she has spent a lot of time in mental hospitals trying various medications and has just received probation.  She has a schedule to follow of attending various support group meetings and meetings with her probation officer and is not to use alcohol or own firearms.  Sometimes she annoyed me with her breaking of the rules, but most of the time I just really felt for her.  She meets people back in her home town and learns different things about how everything actually transpired as opposed to things she had believed. She is trying to find “rat face,” but it is difficult for her to get anyone to believe her or to help her.  The book just had me enthralled from beginning to end and I highly recommend it.", "Star": "5.0 out of 5 stars", "Title": "Highly recommended"}, {"Upvote": "16", "Review": "So far i’ve read the entire jack Stratton series and now this book; the girl who lived.I believe his books keep getting better. If you buy this book, it will be hard to put it down without reading the entire book. So be prepared and schedule some time to read this. You won’t be sorry.", "Star": "5.0 out of 5 stars", "Title": "Greyson gets better and better"}, {"Upvote": "39", "Review": "I did like this book and found it a real page turner with lots of twists and turns.  That being said, I'm actually more a fan of Greyson's Jack Stratton novels.  This one was just a little too dark and heavy for me.  The Jack novels have more light-hearted moments and are more of a fun read.  I do appreciate that Greyson writes clean books--no graphic sex or bad language.", "Star": "4.0 out of 5 stars", "Title": "Good, but I like Jack better"}, {"Upvote": "10", "Review": "Wow , this was a pretty powerful read as a thriller , I thought I had it all figured out by the 8th chapter, boy was I ever wrong !Great read , you won’t be sorry if you read this book !", "Star": "5.0 out of 5 stars", "Title": "Wow"}, {"Upvote": "4", "Review": "Christopher Greyson has created a thriller on par with The Girl on the Train, only with more suspects, more danger, and more agony for the young heroine. The Girl Who Lived takes the reader inside the head of a girl who narrowly escaped a massacre, complete with survivor's guilt, second-guessing, and fantasies of suicide.Ten years earlier, Faith Winters and her sister Kim were on their way to their family's cabin to celebrate Faith's thirteenth birthday with their father; Faith's best friend, Anna; and Anna's mother. On their way from the parking area, Faith noticed a creepy-looking, rat-faced man watching them. Kim entered the cabin first and emerged seconds later, bleeding from a fatal stab wound, and screamed for Faith to run.The police concluded that Faith's father and Anna's mother were having an affair. Something went terribly wrong—perhaps she was about to break up with him—which caused him to snap and kill her, with their daughters as collateral damage, and then shoot himself in the back of the head. Faith doesn't want to believe it, but her memory of the event is hazy. Except for a clear image of the man from the parking lot whom she has nicknamed Rat Face, and whose existence the police are unable to confirm.Since the murders of her sister, father, and friends, Faith's life has been purgatory. She has suffered bullying, fought addiction, tangled with the law, and been in and out of mental institutions. Her mother, a therapist, dealt with her own grief by writing a memoir, ironically titled The Girl Who Lived, which exposes Faith's struggles. The therapy exercise became a bestseller, so Faith can't go anywhere now without being recognized, pitied, and feared.When the story opens, Faith is being released from her latest confinement, trying to ease back into society under the watchful eyes of her mother, probation officer, and sponsors of several 12-step programs. Despite admonitions from everyone, she is determined to track down Rat Face and find her sister's killer. Just when she thinks she has an ally, a cloud of suspicion is cast over that character, and she pulls back. Items disappear or are moved, causing Faith to doubt her sanity. Bad things keep happening, and Faith looks guiltier and guiltier. She doesn't know whom to trust…not even herself.The author beautifully captures the raw emotions and chilling terror of the troubled heroine. This page-turner will keep you guessing until the end, because, as a reader, you won't know who can be trusted, either. And then you will be shocked.", "Star": "5.0 out of 5 stars", "Title": "A Deeply Emotional Thriller"}, {"Upvote": "3", "Review": "Christopher Greyson brings this story alive.  There are times when you find yourself thinking what would I do if this was me.  You turn page after page and find yourself holding your breath.  The story starts with a 13th birthday party planned at a lakeside cabin.  Faith Winters has spent the last 10 years of the death of her sister Kim, her friend Anna and her mother and her father in and out of psychiatric hospitals.She has been released and her mother brings her back to her hometown.  You turn each page thinking ok I have this figured out, only to find you have no idea.  If you have read the Jack Stratton series the author uses the same skill of writing in this book.  If you have never started the Jack Stratton series I would recommend you do.", "Star": "5.0 out of 5 stars", "Title": "Great page turner and totally surprise ending"}, {"Upvote": "9", "Review": "This book was ok - very readable, and I finished it in one day.  I didn't like the main character very much - she seemed to make every mistake and bad choice possible, and she wasn't very likeable, which is a problem with a first-person narrative.  While her actions, decisions and unpleasantness may make her a more realistic character, (I'm not a fan of \"Mary Sues\" either), it makes for a frustrating reading experience as we watch her make one bad choice after another - sometimes even the same bad choices multiple times!  A lot of people like this book, so your mileage may vary, but I doubt I'll read another book by this author any time soon.", "Star": "3.0 out of 5 stars", "Title": "The main character is very frustrating, and annoying."}, {"Upvote": "3", "Review": "Along with being a thrilling suspense novel, this story tells about the deeply personal path of a young woman who is moving through the most difficult transition of her life.  Her father, sister, best friend and best friend's mother were all murdered ten years earlier.  She had barely escaped with her life.  As the sole survivor, she had spiraled downward into depression, alcoholism and mental illness.  Just released from a mental institute, she is going home to face her family, friends, past and most importantly, herself.  This story was thoughtful.  It was disturbing and deeply emotional.  In the end it accurately portrayed the arc of the young woman's journey towards finding truth, recovery and the ability to trust again.  Very well done.", "Star": "5.0 out of 5 stars", "Title": "Outstanding"}, {"Upvote": 0, "Review": "The pressure to find the killer of her father, sister, best friend and her mother is relentless for Faith. From being isolated at the Brookdale Mental Hospital to coming home to an apartment paid for by her therapist mother, she never knew who to trust.She was a spitfire who charged right into finding Rat Face the man she saw the night her family and friends were killed in their lakeside cabin. The police and detectives working the case didn’t believe her statement about what happened that night. She did what her sister yelled before her death, she ran! It saved her life then but living with the horrors took its toll on her mental health.After release from the mental institution, she made a sketch of Rat Face and showed it around town. Faith’s life was in jeopardy as she continued to track the killer or killers. The mastermind behind the lakeside murders attempted to frame Faith for the murders. She wondered if she was losing her mind. Would she ever have peace about death day?", "Star": "5.0 out of 5 stars", "Title": "Bonfires – Good or Bad?"}, {"Upvote": 0, "Review": "I liked this a lot. Faith is released from the mental hospital close to the date that her father and sister, along with two other women were murdered. Her father was supposed to have murdered the women and killed himself. Faith escaped and lived but as she returns home, the real killers, one of whom she saw, begin to taunt her. Faith is a mess and all that she is doing, including drinking, makes her look more and more guilty. There is a large cast of characters but they are well developed and distinct. I had kind of figured out the end, except for one key piece. This is absorbing and well written. Kept this veteran mystery reader guessing.", "Star": "5.0 out of 5 stars", "Title": "Very good mystery"}, {"Upvote": 0, "Review": "One line in the book said \"She\" meaning the main character could laugh or cry or scream. Those were the feelings I had as I read. It was a good plot but many times way over the top which made me laugh, and if I took the story seriously I could have had a tear or two and scream I wanted to do at the author for some of the incredible happenings that went on and on and on. There were some gaps in the storylines of the characters but he tried to tie them together at the end. There are a lot of characters with backgrounds that sometimes left me hanging. I finished the book and it had some twists and surprises.", "Star": "3.0 out of 5 stars", "Title": "It was a good plot but many times way over the top which ..."}, {"Upvote": "3", "Review": "I literally could not put this book down! It was definitely a who \"done it\" and I could not figure it out till the end... I would get mad at Faith and then I would feel sorry for her, she was very complex. That one night had shaped her life, she lost so much. I won't give anything away, just read the book.", "Star": "5.0 out of 5 stars", "Title": "A thrilling ride!!"}], "Star": "4.4 out of 5 stars", "Name": "The Girl Who Lived: A Thrilling Suspense Novel", "Format": "Format: Kindle Edition", "Price": "$3.99", "Author": "Christopher Greyson"}