{"Comment": [{"Upvote": "20", "Review": "My streak of reading really good books lately continues with this one.  I took a chance when this was on sale awhile back since the story sounded intriguing and the cover art drew me in.  The story revolves around the Bird family who inhabits a comfortable home in the Cotswolds.  The mother, Lorelei, is full of a youthful exuberance that seems to be more childish than childlike at times.  The four children are raised in this \"perfect\" family, but the cracks in the foundation are felt even when not yet seen.  Told in the present day when the family is coming together to bury Lorelei, there are flashbacks to events over the years along with emails Lorelei has been exchanging with a friend she met online which give a glimpse into her final weeks.There is a feeling of tension and suspense as the reader tries to piece together what has transpired to change this family from a close-knit one to a family geographically scattered and emotionally estranged.A great read that is hard to put down once started.  Subject matter of hoarding is explored with sensitivity and a lack of sensationalism that I very much appreciated.  Loved it from beginning to end.", "Star": "5.0 out of 5 stars", "Title": "New author to me and very impressed"}, {"Upvote": "3", "Review": "This was one of the best books that I have read this year. Beautifully written, it introduces the reader to the Bird family who live in a picturesque village in the Cotswalds in a charming house. The slightly eccentric Lorelei lives there with her husband, Colin, with their four children. They appear to lead an almost idyllic existence, happy in each others company. They even have an ongoing family tradition: annual Easter egg hunts. They seem to be an almost enviable family, until one day something happens that will change each of their lives profoundly.How their lives change and what happens to them and why is revealed slowly and inexorably.The author expertly and delicately  peels the layers back for the reader, advancing the heartbreaking family drama that unfolds. Central to it all is Lorelei, whose life goes so out of control that she is unable to help her husband or her children, much less herself. This book is a sensitive look at why people end up as they are. Sometimes, they end up as collateral damage, when their mother finds herself unable to cope with the unkindest cut of all.This is a a sensitively drawn portrait of a family in so much pain, it goes off the rails. It is about how its individual members find ways of coping with that pain, even if they do not fully understand how or why they got to that point in the first place. The author brilliantly brings it all to a head in the final denouement that makes the reasons for all that happened to this family come together in one moment of startling clarity. Bravo!", "Star": "5.0 out of 5 stars", "Title": "ONE OF THE BEST NOVELS I HAVE READ THIS YEAR...BRAVO!..."}, {"Upvote": "5", "Review": "I did not want to put this book down. I would read until the wee hours of the morning. The story had my attention - but I was tired, so I forced myself to put it aside. I didn't want to finish it with only half my brain working.  The sacrifice was worth it; finding out how the Bird family becomes so fractured was compelling.The story is told through a series of flashbacks and from different family members point of view, in third person. Despite this, the story was not confusing at all.Jewell did a masterful job of creating sympathy for each of the characters - flaws (and oh, they have them) and all.", "Star": "5.0 out of 5 stars", "Title": "Made my \"best of\" list"}, {"Upvote": "13", "Review": "Throughout the reading of this novel, I wavered between a one-star rating to a five-star rating.  At the end, I gave into a three-star rating.  Some parts of the story were remarkable especially the ability of the author to bring in six (then only five) different personalities each \"talking\" about each of their own lives as children and as adults.  And what a mess of a family!  Each member could be its own soap opera.  So many issues thrown at the reader with little guidance as to how to sort through it all.  At times I simply wanted to stop reading and archive the book.  Yet somehow (due to the author's writing -- or my own sorry curiosity), I felt compelled to discover what came next with this family.  Finally finished.  I put down the book and shook my head that all seemed to be just fine.  All was sorted and forgiven as long as family could come together and love each other.  Maybe I needed more information as to how the members managed to resolve all their single and multiple issues.  Or maybe the family decided not to resolve anything -- rather simply to accept life at the present and move on.  So, compelling writing that pushed along a messy/complex plot.  I left the book thinking I learned little and gained nothing in the reading.", "Star": "3.0 out of 5 stars", "Title": "Some good writing and a messy, messy family with little to recommend it"}, {"Upvote": "5", "Review": "The House We Grew Up In is a very thought provoking, brilliantly written book! I'm so glad I found this book and will have to read Lisa Jewell's other Novels. I love British authors their wit and style of writing is straight forward and funny. However this story is about a hoarder, collector of rubbish which is a serious issue of mental illness. The book immediately draws you into this completely dysfunctional family you will not be able to put it down. I come from a detached broken family. Yet, when when mom was around in our younger years we were all so close! It was easy to relate to the Bird family . The story is heart breaking at times. No matter how bizarre things get with this family it's written in a compassionate, tender way. You can't pick your family but love and life's lessons seems to get them through all the craziness. Very unique topic which is written in a tender loving way!", "Star": "5.0 out of 5 stars", "Title": "Jewell's book is a Gem! Wow!"}, {"Upvote": "2", "Review": "Oh how I loved this story! I purchased the book as a Kindle/Audible Audio version but to be completely honest I didn't read a page. The narrator (Karina Fernandez) was so spectacular that I wanted nothing more than to listen to her weave the story with each character's individual personality and voice and had trouble pulling myself away when I had to get anything else done. That isn't to say the story itself isn't as wonderful as the narration. This was a perfect combination of an excellent story and the right narrator able to pull off the complicated emotions and circumstances it presented. The story weaves back and forth in time, from Meg, the oldest Bird child, her daughter and, eventually, her father, sister and brother Rory, cleaning out their mother Lorelei's home back to various Easter weekends over the course of their lives. When we first meet Meg in 2011 we discover that Lorelei was a hoarder (think of the worst possible episode of Hoarders and you'll have a good idea of how badly she lived). As we go back in time we see her sickness evolve from a sort of whimsical, free spirited quirkiness into a brutal, sometimes aggressive need to keep everything until there is literally walls of junk and only one chair she can sit in. She pushes everyone away and refuses to bend or compromise with anyone. This sickness, along with the tragic incident that happened one Easter, pushes each member of the Bird family in opposite directions and effects how each of them develops as a person. We get to see each character battle with their guilt and lack of control and the author really does an astonishing job of presenting the heartache and damage done to them (and that they do to each other) by the circumstances of their lives. We get to see first hand the vicious cycle of mental and, in some cases, physical damage that can cause generations to pass on this sort of problem even as they swear they will be different. The story also incorporates the email correspondence between Lorelei and an online romantic interest and it is within this correspondence that we get to peek inside Lorelei's scarred heart and mind and see how her life imploded from her own point of view. We learn what really happened that one horrible Easter and her attempts to try and fight her mental illness as much as she can. These parts really broke my heart! The narrator does such a great job of inflecting a false happiness into Lorelei's words as the listener can hear the pain and sadness crack through. Even though Lorelei had hurt those she said she loved  most, quite badly at times, I couldn't help wanting to give this fictional character a hug and try to help her. Even being done with the story I still can't get her out of my head! While I know this sounds just horribly sad it isn't all bad. We do get a sense that things could be different in the future for some of the Birds, if they are willing to get help and help each other heal and move on. Regardless of where these characters might have gone after the story technically ended, the time spent with each of them was quite the journey. I'm always amazed when an author can make me truly feel for their fictional characters and Lisa Jewell definitely did that. I am so excited to see what else she has to offer!", "Star": "5.0 out of 5 stars", "Title": "The House We Grew Up In"}], "Star": "4.2 out of 5 stars", "Name": "The House We Grew Up In: A Novel", "Format": "Format: Paperback", "Price": "$15.29", "Author": "Lisa Jewell"}