{"Comment": [{"Upvote": "287", "Review": "\" The subversive truth about love is that it really is the big deal everyone makes it out to be, and it's not some form of security or an insurance policy against loneliness. It's everything, love is. It runs the whole universe.\"A very sentimental tale that weaves heartbreak, familial love, agape love, philia love and  eros love with more than a dash of  mystical magic mojo. Some may say too sappy (and they would be right), some would say too predictable (yes that too) but overall it was sweet and light.It's the meringue of beach reads for the year.Our heroine Marnie can \"see things\" , but she can't see that being dumped by her husband of 2 weeks is really the beginning of her big, BIG life that has been prophesied over her by Blix (her fiance, nee husband, nee ex-husband's crazy aunt). Hope that makes sense. The both of them (Marnie and Blix) send out  vibes and receive them back, they kind of guide them to see who would be potential mates. Hence the Matchmaking moniker.Throw in the fact that you have neurotic mothers and MIL's, a pregnant hormonal sister who seems to have it all and a terminal illness. Whew, that a lot of stuff to cram into a book.This is book where you really suspend reality and laugh at the things that are obviously coming down the pike with more than a little foreshadowing. But I give the book four stars because it tugs at the heart and brings a little tear and some warm fuzzies too.Very mild potty language and some non descriptive sex scenes make this one you could pass along to your mom without worry.", "Star": "4.0 out of 5 stars", "Title": "Love is everything. It runs the whole universe."}, {"Upvote": "169", "Review": "That was one of my favorite statements from Blix.  I was frankly disappointed when I perused the First Reads selections for this month.  No Sci-Fi.  No Paranormal.  No interesting horror.  Just like last month (which I passed on).  Determined to read an \"ordinary' novel if I had to, I closed my eyes and picked this one.  Turns out I'm pleased to have chosen this book.Blix, the strange Great Aunt.  My favorite character in a long time.  She was wonderfully eccentric and lovable.  The first half of this book was alternating POV's , which worked rather well.  It enabled the reader to get to know both main characters and their thought processes.  Because of Blix, I was sucked into the story more easily than I would have been if things had only been told from the Heroine's viewpoint.  Because Marnie (the ?Heroine?) didn't always appeal to me.  She was a bit too emotionally damaged, and she really didn't treat Jeremy (one of her love interests) all that well.There was family drama.  There was love gone bad (and good).  There was humor--I actually laughed out loud when Marnie and Patrick attempted to cook live lobsters. ( I hate to give a spoiler, but I will say that the lobsters won).  Through it all, Blix made the entire story worthwhile, even when she wasn't physically present.  And there was even just a touch of 'maybe' paranormal, which for me, made it even that much better.  Best of all, it's a complete story.  No 'Book 1'.  No cliffhanger ending.  I'd almost forgotten just how satisfying that can be.", "Star": "4.0 out of 5 stars", "Title": "\"Whatever happens, love that\""}, {"Upvote": "62", "Review": "Marnie knows where her life is headed. She's engaged to the love of her life, Noah, and together they will create a stable, ordinary life. Yes, Marnie can see her future. The problem is that she's 100% wrong.Noah's great-aunt Blix only meets Marnie twice, but she instantly recognizes a fellow spirit, another matchmaker who can see the magic and love in the universe. She's also convinced Marnie has a big, big life in store. And it doesn't involve Noah. It turns out old Aunt Blix might have been onto something, because Noah and Marnie's marriage goes south before it even starts. Reeling from the break up, Marnie is shocked to learn that she's inherited Blix's house in Brooklyn. Just one problem: moving to Brooklyn doesn't fit into Marnie's plans. It also comes with an unexpected roommate-- Noah, of all people-- and several tenants who are struggling with their own relationships. Marnie is determined to sell the house and move back home, but, even from the grave, Blix has her way of making sure everyone discovers their destiny.This book was a bit of magic, a touch of humor, and a lot of romance. It reminded me of the chick-lit books that were popular 20 years ago but have become unfashionable, crowded out of the market by sullen women's fiction and creepy psychological thrillers. Let's just say I'm on board for the revival. I absolutely loved the author's sense of humor. And, yes, Marnie is a complete idiot most of the time, but you get used to it. This book wasn't profound literature, but it's a great summer read and a lot of fun. This is the first Kindle First selection I have honestly enjoyed. Most months, I don't even bother to download one. Don't hesitate to give this one a try.", "Star": "4.0 out of 5 stars", "Title": "A Bit of Magic. A Touch of Humor. A Lot of Romance."}, {"Upvote": "52", "Review": "Disclaimer: I got this book for free as part of my Prime membership.I enjoyed this book a great deal, but I couldn't buy the main romance.  The guy is nice enough but I didn't believe he was meant for Marnie, or Marnie for him.  It felt like they should just be good friends.  There was so much else going on in the book that did work, so it's worth reading for a nice relaxing fun time.  I think that was part of the problem, that the romance couldn't be slowly built from the start because there was a ton of other plot to get through, so it felt a bit rushed for me.  A fun read, but I won't be rereading it.", "Star": "3.0 out of 5 stars", "Title": "I enjoyed this book a great deal"}, {"Upvote": "16", "Review": "I loved this book so much! It was a super easy read. In fact, I read it in 2 days. <gasp> My work might have suffered a little as a result.  Hey, it was a real page-turner!  I love how the storyline was very different/unusual and had so many different stories all weaving into one.  I honestly didn't know how it was going to turn out until the very end, and I love a book that keeps me hanging, but just a little! I felt like we had forward movement the whole way through the book, and it just kept getting more and more interesting.  HIGHLY recommend.  The perfect vacation book, or when you need a little break from reality.", "Star": "5.0 out of 5 stars", "Title": "Very entertaining & well written!"}, {"Upvote": "23", "Review": "The premise of the story was solid,. What eventually wore me down was the relentless whining and insecurity of the main character.", "Star": "2.0 out of 5 stars", "Title": "Skipped the last 25 percent."}, {"Upvote": "9", "Review": "Ms. Dawson is a decent writer, and better than decent when it comes to dialogue. The texts and conversations between Marnie, our main narrator, and Patrick, the reclusive burn victim downstairs, are pure gold.  While I love stories with a bit of magic - I adore Alice Hoffman - this one was a bit too New Age-y for me.  I also got a bit impatient with Marnie's infinite forbearance of Noah, the charming, vacuous ex-husband. He's stealing from her right in front of her and, while the scene was admittedly chaotic, she doesn't even call for someone to stop him? Besides, anyone else would have changed the locks long before. Despite the annoying gaps our heroine's cognition, this book provides a quick, easy, pretty fun read. It's just that there are so many really good books to be read.", "Star": "3.0 out of 5 stars", "Title": "Good story, if a bit too New Age-y"}, {"Upvote": "19", "Review": "Overall, I did not like this book. I enjoyed the beginning and the character of Blix. However, I did not like the main character, which made the second half hard to get through.SPOILERI hated that the main character was cheating on her fiancé with her ex, yet we were supposed to be invested in her falling in love with a third guy.", "Star": "2.0 out of 5 stars", "Title": "Would not recommend or read again"}, {"Upvote": "16", "Review": "What a waste of time.  Main character is unlikeable.  Her 3 love interests are character tropes.  She cheats on her fiance with her ex husband, then ends up going with the neighbor who's heard their sex activities when she was cheating.  Halfway through, I just started swiping through the pages quickly.  Get this, her fiance (the one she cheats on) soounds like the perfect guy, but he's too \"boring\". Also, the author weirdly justifies cheating on your partner. Bet she did it in real life.  Lol what a joke of a book.", "Star": "1.0 out of 5 stars", "Title": "I've read doctors office pamphlets that had more impact"}, {"Upvote": "8", "Review": "I have now read a number of these: feel good, laugh out loud, romantic comedies.  I didn't laugh out loud. I didn't even smile.  The story was tragic.  If you like to laugh at people destroying there lives then this book is for you.  I couldn't wait to be done with it.  I got no satisfaction from reading it.  I was not even entertained.", "Star": "1.0 out of 5 stars", "Title": "Bewildered"}, {"Upvote": "4", "Review": "“You need to forget what society has told you about life and expectations, and don’t let anybody make you pretend.  You are enough, just the way you are – do you hear me?  You have many gifts.  Many, many gifts.”Although the book ends happily, some aspects of the story just felt wrong to me. First is Blix’s declaration to Marnie that she was meant for a “big life” as opposed to the ordinary life Marnie saw for herself – being married, domestic bliss, a job, children, etc. But by “big life”, Blix meant a life in Brooklyn in a charming brownstone with a collection of bohemian friends.  That doesn’t sound very “big” to me.  To me, “big life” means she’s going to find the cure for cancer or have adventures in the Amazon or jump out of planes. Suburbs = small.  Brooklyn = big.  I found nothing especially “big” about the life the author described.Secondly, it really grated on my nerves when Blix, and then Marnie, insisted on the introverted Patrick attending parties. The author made it seem like preferring to be around one person at a time versus lots of people as pathetically sad.  Only when he came upstairs to go to their parties was he deemed saved by their extroverted ways.  As an introvert, I found nothing wrong with Patrick preferring to hang with one friend at a time. I hate it when people insist that something must be wrong with me for not wanting to be around lots of people all the time.  This of course is my personal preference. I just saw these scenes in a different way than the author intended. I felt really bad for Patrick being forced to be sociable when he did not want to be.  Blix and Marnie should just have accepted Patrick just the way he was – the way true friends should.“There is so much fear to wade through before you get to love.”“The subversive truth about love is that it really is the big deal everyone makes it out to be, and it’s not some form of security or an insurance policy against loneliness.  It’s everything, love is.  It runs the whole universe.”", "Star": "3.0 out of 5 stars", "Title": "\"A big life\""}, {"Upvote": "5", "Review": "Fun, meaningful, beautiful, quirky, brilliant. What more can I say? I loved this bunch of characters, their mysteries, their struggles, their hopes, their loves...nothing, but nothing is more important than love, right?Brilliantly paced, and wonderfully \"illustrated,\" this author knows just how to balance character development with real depth and background, without getting so bogged down in description the reader begins to skim. I want to GO there. I want to MEET these people. I want a room in that HOUSE!If cynicism has you down and you're not sure there is anything real and lasting left in this world, this book is for you. If you like romance without all the steam, this book is for you. If you believe in magic and the power of love, this book is for you. Actually, I don't care who you are. This. Book. Is. For. You!I had no idea how badly I needed this until I picked it up as my \"freebie\" of the month. Not my normal genre. Not my normal style. But, had I known what a treat I was in for, I'd have paid full price in an instant. In fact, I'm off to buy a print copy and send it to someone I dearly love, who needs a reminder - Whatever Happens, Love That.Thank you, Maddie Dawson! I'll be watching for more from you!", "Star": "5.0 out of 5 stars", "Title": "I've been Blixed!"}, {"Upvote": "27", "Review": "This is one of those books I downloaded on a whim. The reviews seemed to indicate it would be amusing and entertaining. I suppose ro the “sophisticated” reader, it would be considered to be smart and funny. Four chapters in, I find it to be centered on alcohol abuse, extra-marital sex and adultery. I guess I’m just not that sophisticated, finding it to be vacuous. At least the price was right - free. I’m deleting it now.", "Star": "1.0 out of 5 stars", "Title": "An unentertaining read"}, {"Upvote": "26", "Review": "Once you dislike the main character the entire book looses its appeal. The heroine is weak, indecisive, shallow and without a backbone. She is just taking path of least resistance not being curious, investigative or engaged in her life. Lack of curiosity is unforgivable- it takes away the pulse, the dynamics and stands for shallow, uninteresting character that just happens to have a little magical something. Then comes the idiotic sex - from the first boy to them ALL NEXTS she just lets it happen like it is like drinking coffee. I was thinking about 3 stars but being uninvolved in her own sex was so blah!!! I can’t recommend this book.", "Star": "2.0 out of 5 stars", "Title": "I didn’t like main character"}, {"Upvote": "8", "Review": "I was not impressed with this book and didn't enjoy it at all. I kept reading hoping it would get better, but all it did was get worse. There was too much sex and sleeping around.", "Star": "1.0 out of 5 stars", "Title": "Not very enjoyable for me"}, {"Upvote": "4", "Review": "There is a bit of magic in the way Blix and Marnie can see auras and “sparkles” that lets them know what couples belong together and those that should get out of the relationship. Maneuvering those that should be together has been elderly Blix’s life work and now that she is at the end of her life she wants to pass on her “projects” to the only person she has ever met who is qualified for the task, Marnie. Reluctant Marnie finds that she is manipulated into a life that she didn’t expect.Oh my! This is a gem of a book and an absolute delight to read. I was smiling most of the way through, unable to put it down and so sorry to see it end. I’m guaranteeing one of your best reads of 2018.", "Star": "5.0 out of 5 stars", "Title": "Best Feel-Good Book of The Year"}, {"Upvote": "3", "Review": "Main character truly is too stupid and naive to be let out alone, certainly by age 30. For instance, when she evicts former husband, she does not change the locks, altho she knows that his mother wants him to find evidence to invalidate the will which left the house to her instead of him. And none of the intrusive, meddlesome secondary characters mentions that is something she should do. Then she is shocked when he comes back into house and removes said evidence along with as much of the contents as he can box up. Since so much of book, esp last half, is her voice, that grates more as book goes on. If you know Park Slope, you will wonder how these people afford to live there, although none of them seems concerned.  No more from this author for this reader. Even free is too expensive. Don't waste your time.", "Star": "3.0 out of 5 stars", "Title": "Main character TSTL"}, {"Upvote": "2", "Review": "ExcellentShort review: read itThis stand-alone is easy to follow and difficult to put down. No editing errors, violence or drag-you-down drama.Entertaining storyline with descriptive writing that draws the reader into every real life scene be it joyous, sad, snarky or cringeworthy.Believable characters with distinct personalities. Thought-provoking, humorous and memorable dialogue.'But that sums up this family’s philosophy of life perfectly: plaster over the real stuff, and slap a veneer on the top. Nobody will know. But I know.'“And it’s paid off because now I live with Houndy, who is a lobsterman, and the thing about him is that he could talk to me for four days straight without stopping about lobsters and their shells and the different tides and the sky, and nothing he ever said would bore me because the language that Houndy is really speaking in is all about love and life and death and appreciation and gratitude and funny moments.”“The subversive truth about love is that it really is the big deal everyone makes it out to be, and it’s not some form of security or an insurance policy against loneliness. It’s everything, love is. It runs the whole universe!”I may re-read this story and look forward to other works by this author.", "Star": "5.0 out of 5 stars", "Title": "Excellent"}, {"Upvote": "2", "Review": "This was a bit of an odd book. It meandered for lack of a better word. Have you ever met someone who tells you a story, one rich with details and color, but it has a bit of chaos wrapped up in its telling but still seems you tell it in a linear fashion? That is this book.While this is technically a story about Marnie, a woman who is going through what can only be called a bit if a early mid-life crisis, it is more about the characters who shape Marnie's experience. Marnie is a woman seeking the life more ordinary but time and again, she stumbles into a life less ordinary and doesn't quite know what to do with it all.While the central theme of many of the characters is romance, I'm not sure I would characterize this book in that genre. The main character does have her happy ending although I felt that ended up being a bit less developed. In fact, even the side characters have their own happy endings - kind of.So, I think this is one of those books about life choices and what happens when you decide to choose the risky and odd path instead of the normal everyday one most people experience.So, in summary, an odd book yet one I seemed to enjoy even if, at times, I wondered what the hell is this?", "Star": "4.0 out of 5 stars", "Title": "I don't know how to review this book"}, {"Upvote": "5", "Review": "I loved a lot about the book, but the main character is too stupid to be allowed out on her own. A bit spoiler-y, but if someone who you knew had keys to your house had stolen something and had voiced intentions to take more, what would you do? Change the locks? Call the police? Hide your most precious item under your pillow? You guessed it. I couldn't even make it through the last part, she kept not learning and not learning. Any hea she got was pure luck.", "Star": "2.0 out of 5 stars", "Title": "I loved a lot about the book"}, {"Upvote": "3", "Review": "A \"big life\" = living in a Brooklyn brownstone, finding a part time job, and meddling in neighbors' lives? Romance = (possible spoilers ahead) falling for a dishonest, immature, guy who consistently chooses his mother over his fiancee; a hopelessly boring but devoted guy; and a traumatized burn victim who would rather hide than so much as hold hands?The dialogue is all delivered in the same voice. I had to count lines to determine who was speaking at the time.For the most part, the characters are stereotypes and anyone who doesn't live in Brooklyn is narrow-minded, boring or devious.Maybe there is a generation gap thing at work here or maybe lapses in logic in the story did me in, but I couldn't enjoy the book. Even magic couldn't save it.", "Star": "3.0 out of 5 stars", "Title": "More Clueless Than Charming"}, {"Upvote": "2", "Review": "I thought this book was surprisingly good, as I usually read mystery/adventure/literature but not romantic stories, but it was the only free book in May that seemed like something my husband might like.  Well, I ended up reading the book in a few sittings as I had trouble putting it down.  The characters are described in just the right amount of detail to allow the reader to conjure up enough of an image without bogging down the story with unnecessary specifics.In short, it's an engaging story about a group of quirky slightly damaged people doing their best to ruin and fix their lives.  The book is an easy read, and a fun read, and the story is on the sweet side, BUT, sometimes that's what you need right?  It's like when you eat a chocolate almond bar.  You get that sweet, nutty, satisfying break from your regular routine.", "Star": "5.0 out of 5 stars", "Title": "Romantic and funny, but with just enough magic to make you wish you were part of it all."}, {"Upvote": 0, "Review": "If you have a good heart, you'll understand the message of this book and its entire intent. The message is, love (and kindness) are all that matters. Magic potions, that the story's early protagonist Blix believes in, and seeing gold stars that appear when Matchmakers observe others who are in love, may seem too flippant for some readers - but the way Maddie Dawson weaves her craft, it's a charming, lovely vacation from real life. As is the whole book. Not many authors know how to spellbind readers, but this one sure does. Pure, innate talent that some of us 'get' immediately. Some readers won't understand the heroine's choices, but if you are used to thinking along those same lines as Marnie, you'll understand immediately. I lived both the life I was expected to live, (the life Marnie's family was pushing at her), and when I found it was suffocating me and who I was meant to be, I too made choices that were unconventional. What did that lead to? I realized I wanted to write and three of my full-length novels were accepted for publication. A children's book is soon to be released and I'll have a fourth, full-length novel finished soon. I didn't want this book to end. I'm so tired of stories portraying every detail that's so 'right' by society's standards, and  nothing that's real involving the true human psyche and genuine desires that come from the heart. Thank you Maddie Dawson. Now that I've found you, I'll read everyone of your books and look for more in the future. You write like a dream...a marvelous 'take me away from this world and put me in a your world dream.'", "Star": "5.0 out of 5 stars", "Title": "Love is all that matters."}, {"Upvote": 0, "Review": "Marnie MacGraw is engaged to marry Noah Spinnaker, when she meets his eccentric, unpredictable, matchmaker great-aunt Blix Holliday. Blix takes a liking to Marnie--a liking she doesn't have for her nephew, Noah. When her marriage to Noah comes crashing down around her while they're still on what was meant to be their honeymoon trip, Marnie goes home to Florida and her family, and tries to put the whole thing behind her.Blix has other plans.Blix told Marnie she was destined to have a \"big life.\" Marnie doesn't want a \"big life.\" She wants a husband and children. She's connected again with her old high school boyfriend, Jeremy, when she receives a lawyer letter telling her Blix has died, and she's inherited Blix's brownstone in Brooklyn, NY.There are conditions, though, the most important of which is that she has to live in it for three months before getting full ownership.Marnie hasn't just inherited Blix's brownstone. She's also inherited Blix's neighbors and friends, her \"projects\" who need a little help finding their way toward happiness. Blix told Marnie several times that she shares Blix's talent for matchmaking and magic. Marnie doesn't believe it. Yet, at certain times, she sees the golden sparkles...Marnie is sweet, and kind, and wants happiness not just for herself, but for people around her. She also has a small gift for snark. This Nice Southern Girl doesn't know what to make of Brooklyn, where the buildings are old and well-worn, no one has a car and you have to shop every day, and you meet the most amazing diversity of people, just going about your daily business.Meanwhile, her family is nagging her to just sell the building and come home, and her ex-husband, Blix's great-nephew, has settled in to Blix's apartment in the brownstone with her. He says he's taking classes; he seems unduly interested in why Blix decided to leave the building to her, rather than to her niece, Noah's mother, with whom she has always had a really bad relationship.I'll just say right here that, if Marnie were a Sensible Northern Girl rather than a Nice Southern Girl, she'd have changed the locks on Noah, fairly early on. He's got nothing good to offer; he doesn't even like the dog who adopts her.The tenants, Jessica and her son Sammy, and Patrick, the curmudgeonly ex-artist who was badly burned in a gas explosion, along with Blix's friend and neighbor Lola, and the bodega owner across the street, Paco, are all great characters who add to the flavor and enjoyment of the book.This book is just a lot of fun. Recommended.I bought this book.", "Star": "4.0 out of 5 stars", "Title": "A lot of fun"}, {"Upvote": "10", "Review": "So many things one could say about this book--that the characters are so believable, the circumstances they find themselves in are so painfully real and give a twinge of those memories everyone goes through. That the laughter and tears can't be stopped while reading. After all, it is the tiny moments in life that really do define us, as we all sort of flounder through making choices. A touch of magic doesn't hurt, either! Read it. You should.", "Star": "5.0 out of 5 stars", "Title": "Matchmaking as it should be!"}, {"Upvote": "2", "Review": "This is such a great story. Really well done. I don't think I'm in the target market for this book but I like to read across a wide variety of genres and I'm so glad I came across this gem in the Amazon First Read program.The prose has a magical effortless quality about it through the first half of the novel and I realized that the metaphors and poetic quality were mostly used in chapters that featured Blix's PoV. If there's a sequel, and I hope there is, I'd love to see Marnie's PoV adopt the same qualitative difference.I've already recommended this book to several people so if you're still on the fence about it and reading reviews coz you're on the fence, dive right in. This is a wonderful novel.", "Star": "5.0 out of 5 stars", "Title": "What a wonderful novel"}, {"Upvote": 0, "Review": "Marnie thinks she has her life under control with her job in California, her fiancé, and the wedding on the calendar. And then, at an engagement party hosted by her future mother-in-law, she meets Blix, the great aunt of her fiancé. Blix is a wonder: a matchmaker, a practice of magic, a lover of life, and a terminal cancer patient. Blix takes one look at Marnie and she recognizes a kindred spirit. She sees Marnie’s magic when Marnie has not. It is not long before Marnie’s perfect life begins to unravel. I loved this book and was so sorry when it ended. It is witty, occasionally laugh out loud funny, kind, messy, sad, sentimental, and sweet. I won’t recap the plot here, because it is much better to just let everything unfold as the author intended. This book was my Kindle First selection and it was a good one for me. Sometimes you just need a happy ending even though you may not know it. The world can be so upside down and sideways, and it can be cheering to know that even when things don’t go your way, everything may work out for the best.", "Star": "5.0 out of 5 stars", "Title": "Romantic, Funny, Sad, Well-Written Story"}, {"Upvote": "2", "Review": "This novel was quirky in a good way. Marnie is a normal young woman who seeks a normal life. After meeting Blix, her fiancee's eccentric great aunt at a party,  Blix shows her that she isn't destined to have a normal life.  And so it begins... two weeks after her wedding day her marriage ends. Marnie goes back to work and to her apartment and tells no one about her impending divorce. No longer able to hide it Marnie's secret and life blows up. She moves back home and settles into the comfort of family and suburban life until her life blows up again.  This is a story about letting go of the notions of what you think you need and want from life and letting life unfold. This book was sad, sweet and hopeful.  The characters were relatable, flawed and so real.  This book makes you reevaluate your ideas of a normal, perfect life.", "Star": "5.0 out of 5 stars", "Title": "A book about the surprises that life has to offer if you are open to them."}, {"Upvote": 0, "Review": "Expect to fall in love with the cast of characters that Maddie Dawson has developed in this sweet story of discovery and acknowledgment. Don't, however, expect a neat and tidy ending with all details managed and packaged up. The story will leave you pondering, hoping, and thinking of your own friend list, how your lives are interwoven and whether you can see \"sparkles\" when you speak with them. The story opens with Blix telling her side of things but the reader quickly realizes that Marnie is the main character finding her way through Blix's long distance guidance. I found myself reading to unfold the details of how Marnie would solve each situation, predicting some but laughing through the unexpected turns of others. Truly a fun romp with Blix and her Brooklyn \"family,\" although it's still easy to love and understand the Flah-ridians. Enjoy!", "Star": "5.0 out of 5 stars", "Title": "Whatever happens. Love that."}], "Star": "4.6 out of 5 stars", "Name": "Matchmaking for Beginners: A Novel", "Format": "Format: Hardcover", "Price": "$15.99", "Author": "Maddie Dawson"}