{"Comment": [{"Upvote": "1", "Review": "I very much enjoyed Kristin Hannah character development and story. This book is written better than many books about WWII. The reader experiences the struggles and fear of those living in a Nazi occupied country. I am very, very troubled however. When I read about Isabelle organizing an escape route for airmen whose planes were shot down in France and then escorting them safely to Spain with the assistance of reluctant Basque, I had to stop because I clearly remembered reading this before. I vaguely also remember a black white movie or documentary about this. I searched and found the once read story of the Belgium, Andree de Jongh who actually did what the fictional character Isabelle did in the novel. Much, much, much of the book parallels de Jongh's true story - the description of the heroine; the number of people (118 by de Jongh and 117 by Isabelle) escorted through this escape route: this escape route having a code name (Nightingale in the book and Comet in real life); the description of the airmen's instructions on the train and staying behind the heroine when they walked in German occupied cities; de Jongh's/Isabelle father executed by firing squad; the reaction of the airmen to this female who was going to be the one who to lead them out of France; de Jongh's/Isabelle's invisibility to the Germans because she was \"just\" a woman: collaborating with the British to fund the escape of airmen from France; de Jongh's/Isabelle's capture in the Pyrenees by the Nazi's then interrogation and Nazi's disbelief and rejection of the idea that a woman was capable of doing this; and de Jongh's/Isabelle's imprisonment in Ravensbruck women's concentration camp. Why am I troubled? I searched the book, several interviews with the author and Ms. Hannah website and there was no mention of specific name \"Andree de Jongh.\" Hannah acknowledged on her website that her search led her to \"a story of a young Belgian woman who created an escape route out of Nazi occupied France.\" I strongly believe that the author should have dedicated, credited or acknowledge the name of Andree de Jongh in the book where it was easily visible to the reader. de Jongh is as invisible to the author as she was to the Germans and in a book that celebrated the bravery of women during war. Was Vianne's character based on a brave woman who also deserved bold recognition? This makes me sad.", "Star": "3.0 out of 5 stars", "Title": "The reader needs to know one of the book's main character's clearly details the real life heroics of Andree de Jongh"}, {"Upvote": "151", "Review": "Almost 36,000 reviews and 86 percent are five stars. What's THAT about, I thought. So I read the book, and now I know what the raves are all about. This book is one of the best, if not the best book I have ever read. Hannah writes like an angel. The book isn't a fast read, at least not for me, because I would go back and reread a sentence just to enjoy the mastery with which it was written. Hannah's style doesn't try to be high literature, but the result is. She writes beautiful scenery and background, but not so much as many authors do. Her characters, well, I felt like I knew them, like old friends, not without flaws, but perfectly developed.So I add my five-star review to the others. Read this book. It will take you away from whatever you're doing. This was my first book from Kristin Hannah. It won't be my last", "Star": "5.0 out of 5 stars", "Title": "A Perfectly Told Story by a Gifted Writer"}, {"Upvote": "198", "Review": "The Nightingale opens with this amazing first line:“If I have learned anything in this long life of mine, it is this: In love we find out who we want to be; in war we find out who we are.” - pg 1This story is about what it’s like to be a woman during war. The author says on her website that “In war, women’s stories are all too often forgotten or overlooked.” I had never thought about how true that really was until I read this book. Vianne and Isabelle are two sisters that we follow through World War II. One stays home and takes care of her kids and one helps in the war effort. Their story showed me that this statement is not true:“And it’s a fact that women are useless in war. Your job is to wait for our return.” - pg 26What a beautiful reminder not overlook women and their strength. Even as a woman, I'm guilty of doing that sometimes.Since this is an historical-fiction story, I felt like there should have been an afterword talking about what was historical and what wasn’t. But don’t worry I’ve googled it all for you :) The Nightingale is inspired by a real person, Andree de Jongh. Don’t go read her biography before reading this book unless you want to be spoiled. Andree de Jongh and her corresponding character in the book were themselves inspired by a real nurse named Edith Cavell who served during World War I. You should read about her too :)I love pictures and the author has some beautiful pictures of places that inspired the locations in her book.I’m a geek for any reference to art or culture, so when I saw a reference to “drab-eyed, dark-clothed people who looked like they belonged in an Edvard Munch painting.” (pg 239) I had to look it up. He’s most famous for doing The Scream.You’ll love the writing in this book. It’s beautiful. I highlighted so many good quotes that I can’t share them all. This might be my favorite one:“Lately, though, I find myself thinking about the war and my past, about the people I lost. Lost. it makes it sound as if I misplaced my loved ones;” - pg 1The Nightingale deserves all the hype and awards it's gotten. You should read it.", "Star": "5.0 out of 5 stars", "Title": "Must Read"}, {"Upvote": "51", "Review": "So where do I start with this book... Oh I know! I really didn't like this book! Now wait just a minute before you throw a shoe at the screen. I'll tell you why I didn't like this book and why I gave it the rating I did. First let's start with the rating. I rate my books on how well they are written, originality of the story line, character development, pacing of the story, among other things. This book had all these attributes by the bucket load. Exceptional writing, unique story line, complex characters. Which is why I gave it five stars.Now to the fun part. Why I didn't like this book. The honest answer is it made me feel too much. Now you're are probably wondering how can I not like a book like that? This book made me feel happy, sad, scared, grateful and a bit guilty as well. I was born to a generation and a country that didn't have to face the horrors of war. I hear about the destruction that wars bring in the news and I change the channel. Why? Because it makes me sad. This book teaches us how fragile life can be. One day you might be enjoying a beautiful day in the sun and the next something unimaginable might happen to you and the people you love.I didn't t like this book because it made me face my own inadequacies head on. How I should show the people that I love how much I love them more often. How I should treasure every minute that I am blessed to have them in my life. How I should endeavor to be brave and face the challenges that life throws my way. So be brave, love more, take chances but above all enjoy every minute of this fickle life because each and everyone of them is precious.", "Star": "5.0 out of 5 stars", "Title": "Learned great lessons from this book."}, {"Upvote": "37", "Review": "This book. Whew. It took a little bit for me to get into it because I'd learned about it from a romance blog and just assumed it was a romance. It's not. That being said, if I had known, I would have been sucked in right away. As soon as I figured that little fact out, I was sucked in.I've visited the Anne Frank house and Dachau. I've watched tons of movies on the subject. But this book is different. It explores the everyday people in a Nazi occupied country. It explores themes I've never even considered. It's inspirational and motivating but it will tear you up as well. I couldn't put it down and my poor husband had to wait 20 minutes for me to calm down before he could walk with me into a restaurant. Then I read it all the way home and cried for 2 straight hours after I finished it. I'm on the verge of tears now and I finished it months ago.I gave it to my teenager to read who mentioned it to her teacher (who wanted to kill us by the way since she ugly cried on a very public plane for the duration of her flight) and now the book is being read by the school's book club. I hope I had some small part in that decision.", "Star": "5.0 out of 5 stars", "Title": "I would have been sucked in right away"}, {"Upvote": "24", "Review": "I've read a fair amount of historical fiction (and non-fiction) about WWII. I enjoy reading about different experiences that people could have had, and the way the author conveys the characters' lives.  I worried that this book would be filled with stories I've already heard from a different author's pen.  This was not the case at all.The story focuses on alternating between two French sisters, who have a tense relationship which stems from childhood issues. Vianne and Isabelle are quite different from one another, and this offers readers the chance to follow both women on very different courses through the war.The pace of the book was relatively slow, but I think that supported the concept that the occupation of France was not quick.  It was long and drawn out, and the stress and reality of war broke many people. The slow pace also helped richly develop the main characters, as well as several supporting players.  It kept pulling me back in for more. There were a few times when I was thinking \"can anything more happen to them?\" And it did.The ending was amazing, and I shed several tears.  I hadn't thought much about how I thought the book would/should end, but of course I had a few guesses.  It was a wonderful culmination of the emotions that were felt whist coming alongside Vianne and Isabelle.This is my first time reading Kristin Hannah.  I am interested to read some of her other books.", "Star": "5.0 out of 5 stars", "Title": "Excellent WWII novel"}, {"Upvote": "11", "Review": "I was \"supposed\" to be reading another book for our book club, but a little bird was insistently calling to me, saying \"Read me! Read me!\". So, like Lewis Carroll's Alice, I picked up the little bird and read it. And could absolutely not put it down until the final page. That \"little bird\" was, of course, The Nightingale, the immensely popular best seller by Kristin Hannah.Set in France during the German occupation of WWII, the story is about the lives of two sisters, Vianne and Isabelle, who struggle to survive during the darkest of times, under the harshest and most brutal conditions. The author skillfully paints a stark picture showing the extreme differences between the ways each sister manages to cope. The unimaginable hardships they endure are described in excruciating detail, making this reader cringe in fear and revulsion while at the same time, ensuring that said reader will not stop reading.As I sat reading this book in my home with all the comforts I have grown up with, I was reminded that this 21st century American lifestyle must never be taken for granted. History has a nasty way of repeating itself and the amenities we Westerners have enjoyed during the past 7 decades could be erased in the blink of an eye. Or the flash of a nuke. And I have to wonder how many of us would be strong enough to survive the way Vianne and Isabelle--or any of the survivors of that war--did. How many of us could withstand the unimaginable cruelty and inhumanity that accompanies any world war? Heavy thoughts...but only the best writers can make us reflect so heavily on our own real lives by writing fiction about the lives of others.", "Star": "5.0 out of 5 stars", "Title": "Heavy thoughts, great writing"}, {"Upvote": "8", "Review": "The Nightingale is one of the most engrossing books I have read in a long time.  It is the story of two sisters and the circumstances that envelop them during World War 11 and the German invasion of France.  Although they appear to be poles apart in their views, they have one thing in common, courage on a grand scale that overcomes and surpasses all their differences.  Separately they make a stand against the invaders of their homeland, never losing sight of their desire for freedom even when it means their personal sacrifice.The book covers the gamut of the German invasion and the effects it had on the population - the hardships and atrocities that were a part of it.  It is unflinching in its depiction of what it was like to be a citizen of France during these years.I read this book continuously, only putting it down when necessary.  A wonderful reading experience that covered the range of human emotions from joy to grief, from elation to sadness.  It is about redemption and the power of love in its many forms.I highly recommend The Nightingale to anyone who wants to read a wonderful story on every level about the courage of the human soul.", "Star": "5.0 out of 5 stars", "Title": "A Wonderful Book that Covers all the Bases."}, {"Upvote": "16", "Review": "Admission time. I had heard about Kristin Hannah’s The Nightingale, but for some reason, I had been putting off reading it. I just couldn’t wrap my mind around it. I do love historical fiction, but I was in a mystery-thriller phase that I just could not work my way out of.Last week, however, I wanted something different, so I decided to go for it. And go for it I did. All 592 pages. Perhaps my mind knew that I would not be able to put it down once I started. Whatever it was that kept me from reading it before, I am so very glad that I finally got around to it. And I read it, ALL of it, in just over 1 day. I truly could not put it down! YES! It is that great.Two sisters. One steadfast and true. One temperamental and headstrong. After the death of their mother and the day their father sent them away, both want nothing more than to be loved again. Vianne is married to Antoine, whom she has loved and been loved by since she was 14 years-old. Isabelle has been kicked out of one boarding school after another.When news of war comes to France, Vianne remembers her father the way he was before the first Great War and how he was never the same afterward. Isabelle only remembers the man from after the war; the one who never wanted her.With Antoine called to fight, Vianne is left to care for their daughter, Sophie, when the Germans invade France. She has no idea how she will cope. Isabelle wants to fight for France. She wants to join the Resistance and do whatever possible to free France from the horrible Nazi regime.Differing dispositions and ideology separate the sisters, but as conditions in France turn into a real-life nightmare, each sister must tread her own dangerous path to survive the Occupation.This is now one of my favorite books of all time. It is historical fiction, real-life, heartache, terror, love, and forgiveness all wrapped up in a story that you will not want to put down until you make it to the final page. And then you will want more.  Unputdownable!", "Star": "5.0 out of 5 stars", "Title": "Unputdownable!"}, {"Upvote": "6", "Review": "I know this is a work of fiction. But even in fiction, we find glimpses of the truth. This book inspired me, at a time when I find it hard to find inspiration. In this time of uncertainty, disagreement, and the unknown for what lies ahead, this book has brought perspective, strength, and inspiration. One of the clear messages I got from this book, is that love must always win over hate, in order for our future to survive.  If you want to know what it takes to survive, to be committed to a cause, and to love in the face of evil, hatred and pain, then read this book. But be forewarned, it is not an easy read.  Sacrifice for love in the face of evil, usually never is easy...as was the case for the millions of people that suffered the atrocities of wars throughout our history. For me, this book brought a whole new perspective to life and to what it means to love.", "Star": "5.0 out of 5 stars", "Title": "Inspiring...the true meaning of love and commitment."}, {"Upvote": "5", "Review": "Oh my goodness, where to being with The Nightingale, the book that I received free from SheSpeaks to read and review. The main characters, two sisters, each different in her own values, morals, and spirit. The author truly captures the essence of both sisters....making you feel such heartache and hope for both of them in different ways. She also tells a story that is not readily told or taught in history teachings....the women's war during World War II, I had no idea before reading this book what women went through during that awful, tragic, and soul-breaking time. The starvation, trying to keep her children alive, the humiliation they endured, fear, and physical and emotional pain....I could feel it all through the pages. Every emotion was real, I cried, gasped, hoped, and feared along with the characters. The author also conveyed what love would have felt like during that time, when all you had were memories and the human spirit to hold on to. The Nightingale is about family, hope, love, and dreams for the future....a future that was hard to imagine during such pain and tragedy. The human spirit is strong....that's what I learned after reading this. I can't imagine enduring what these sisters endured and actually live through it. I don't know that I have that much courage, strength or determination. This author makes you think about those things and gives you a whole other side to the Nazi invasion of France. She also paints a beautiful picture of Paris, which made me want to visit even more! Wow, what a heartbreakingly beautiful novel. Get the book and read it. It will change what you thought you knew and have you cherishing every moment you live.", "Star": "5.0 out of 5 stars", "Title": "Thought-provoking, Fantastic read!"}, {"Upvote": "9", "Review": "This was a page-turner. The author kept us riveted to the story, and I did finish the book, because I purchased it. Might not have been the same if I got it from the library. In all fairness, I read this directly after I read \"All the Light They Cannot See\", which took place also (partly) in Occupied France during WWII and was far better written and researched. I am not a fan of the romance novel,nor the feminist novel, and I'm afraid that what \"The Nightingale\"  was. I found the younger sister neither sympathetic nor credible, and the plot did not hang together as it should. Looking back on dates and ages revealed a lot of inconsistencies..", "Star": "3.0 out of 5 stars", "Title": "Pretty Good. Not That Good."}, {"Upvote": "7", "Review": "The story starts with two girls, one only a young child, the other a teenager, abandoned by their father when their mother dies who has returned broken from World War I.  The uncertainty of the 1930's give way to war, and a sense of doom steadily intensifies as the Germans invade and occupy France.  The two girls have a difficult relationship and this is tested and changed as life becomes more and more difficult and dangerous.  I'm not going to say more about the plot, but it's enough to say that at times both my wife and I were in tears over this book, and it's one that will stay with us for a long time.A gripping story, both of us reached a point in the book where we just had to finish it even if it was 1 - 2 - 3 in the morning, as well as an insight into the atrocious conditions of living under Nazi occupation.  Well worth the $US7.11 it cost me to have this downloaded to my Kindle.", "Star": "5.0 out of 5 stars", "Title": "A gripping story, and an insight into life under Nazi occupation."}, {"Upvote": "4", "Review": "I've read several Kristin Hannah books and am always mesmerized by her stories; her character development is impeccable, relatable, and brilliant.The Nightingale was no different.I was unable to put this book down, engaged at every turn and emotionally invested until the last page.Vianne and Isabelle Rossignol are sisters living in France during World War II. Both girls are familiar with the spoils of war having witnessed their father come back from The Great War a changed man. Their father's inability to cope with the tragedies of war casts a shadow over the family that resonates for years to come.When news of a new war emerges, the sisters are certain that this war will be short-lived; and of course, they are very wrong.Hannah writes the story from three points of view: Isabelle's, Vianne's, and a mysterious American woman who we don't learn the identity of until the very end of the novel.I would recommend this read to anyone interested in historical fiction, strong, well-written characters, and a brilliant storyline.", "Star": "5.0 out of 5 stars", "Title": "MUST READ"}, {"Upvote": "5", "Review": "When I searched “French Resistance,” Amazon.com turned up 11,485 titles — and that may understate the number of books that have been written about a subject that is one of the most heavily researched topics in 20th Century history. Anyone who has read more than a smattering of what has been published about World War II is sure to have encountered something about the French Resistance. It takes courage for a contemporary writer to undertake yet another book on such well-traveled terrain — and surpassing skill to succeed in crafting a fresh and moving treatment of the topic. Kristin Hannah has done just that in her novel, The Nightingale.The French Resistance, writ smallHannah is certainly not the first writer to spin a tale about the topic through the experiences of one person (or in this case, two), but she is surely among the most successful. The Nightingale is the story of two French sisters, Isabelle and Vianne Rossignol. (The surname means “nightingale” in French.) Isabelle, the feisty and headstrong younger sister, is determined to serve her country when Nazi Germany invades France in May 1940. She is just eighteen and single as the war begins, having been expelled from a long string of boarding schools. Vianne, ten years older, is a married schoolteacher and the mother of a bright eight-year-old daughter. The two sisters live very different lives through the six years of war, apart most of the time but intersecting at crucial points along the way. Isabelle personifies the Resistance. Vianne and her daughter stand in for all those in France who lived and suffered at home. Both characters are well-developed and credible.A culture of crueltyUnlike some authors, Hannah does not paint a picture of all German soldiers as monsters. Also, though she celebrates the heroes of the Resistance, her treatment of the French people in general is far from kind. The collaborators who dominate the French police are merciless; one in particular proves to be a Nazi at heart. But two Nazi officers play larger parts in the story: a Wehrmacht captain and a colonel in the SS. Though a proud German and at times a willing participant in the Nazis’ vicious treatment of French civilians, the captain has a gentle and compassionate side. By contrast, the colonel embodies all the mean, vindictive traits of Hitler’s chosen few, the “Aryan” men of the sadistic enterprise known as the SS.In a world dominated by reason and compassion, the colonel described by Hannah would be considered grossly exaggerated — a figment of the author’s imagination. Sadly, the portrait is all too realistic, as there are innumerable examples of such monsters throughout the history of World War II. The SS fostered a culture of cruelty: these were not men who were “just following orders” — they were willing, even eager participants in the wanton violence and murder that Hitler’s minions wreaked on untold millions of Europeans. Yes, six million Jews were murdered; as a Jew by birth and a visitor to Auschwitz just twenty years after the end of World War II, I’m intensely aware of that fact. But so were five million other Europeans, not to mention the tens of millions of others who died as soldiers or suffered intense privation of the sort experienced by Vianne and her neighbors. The Nightingale helps us understand the breadth of the horror visited on the world by Hitler and his cronies.About the authorA former attorney who turned to writing full-time, Kristen Hannah has written 22 novels over the past quarter-century. The Nightingale is the most recent. She is American.", "Star": "5.0 out of 5 stars", "Title": "Brilliant!"}, {"Upvote": "5", "Review": "I've been reading Ms Hannah's books for years and have enjoyed every one. This novel is spectacular. I was born in 1938 at the beginning of WWII. I remember the Victory Garden my grandfather planted. I remember picking up soldiers and giving them a ride - everyone did then. I remember air raid drills and giving up butter. I remember VE Day when everyone drove down Main Street honking their horns. I remember my uncle's 21 gun salute funeral and the army officer giving my cousin the folded American Flag. I've read numerous books about WWII. But nothing moved me to tears the way this novel did. I can't believe I traveled to Paris without being aware of the history and the blood and the deprivation and the courage of it's citizens. This novel is beautifully and sensitively written. It's as though Ms Hannah walked France's streets, suffered the bitter cold, climbed the Pyrenees, led the downed English and American airmen to safety, and experienced the extreme hunger and fear that the Parisians did. No one should miss reading this wonderful piece of literature. Thank you Ms. Hannah.", "Star": "5.0 out of 5 stars", "Title": "An incredible novel!"}, {"Upvote": "7", "Review": "Neither as great nor as bad as some of the ratings. I think some of the really bad ones are from people who didn't even finish the book. I thought it a bit superficial in places and some of the historical references seemed added in gratuitously to needlessly remind readers \"it's war time in France\". However about a thrid of the way through I ignored the above annoyances and began to get hooked into the storyline.Some have stated it's a romance novel but any \"romance\" is more like a small parallel story, and not at all the crux of rhe story, of 2 women and their experiences and survival during the war.", "Star": "3.0 out of 5 stars", "Title": "Neither as great nor as bad as some of the ratings"}, {"Upvote": 0, "Review": "Since 'The Nightingale' by Kristin Hannah has been out for over three years now and is much reviewed, I won't go deeply into the plot. Rather, I'll simply point out what I loved and a couple minor things that I felt could have been lessened.To start off, I'll say that I am delighted that I discovered this book because it has made me realize that I must add Kristin Hannah into my list of favorite authors. 'The Nightingale' was the perfect book for me to get to know her body of work.The novel tells the beautiful, tragic, and triumphant story of two sisters, Vianne and Isabelle, who live in France during WWII and make starkly different but sometimes similar choices in coping with the war and its effect on their lives and on their beloved country. From the first page, I was hooked. Kristin Hannah's writing style isn't complicated, nor is it pretentious. It's beautiful and straight-forward, simple but enthralling, while concurrently teaching the reader unsavory lessons and consequences from war time. Both her protagonists and many minor characters in 'The Nightingale' are strong and admirable, while also showing a duality of vulnerability.I love historical fiction, especially those with WWII as a backdrop so the story and plot charmed and fascinated me from page one, and I felt it was done well. I loved many things about the novel but as a classically trained chef and a gourmand, one thing that many readers might miss or might not appreciate as much, was Hannah's accurate and delicious description of food and cooking that Vianne does throughout the book. It was surprising but wonderful to read it being integrated into the story in a way that was convincing. It makes me wonder if the author herself is an avid cook or perhaps she simply loves and appreciates gourmet food. Either way, this was a device and technique that was minor, but very effective and pleased me tremendously.Also wonderfully done was Hannah's propensity to write the book in such a way that it was almost cinematic, as if she intends to or knows that the book will eventually be adapted into a screenplay for a feature film (as of the writing of this review, a feature film is in development). In other words, the characterizations and descriptions are rich, immersing the reader deeply into the mind of the characters both major and minor, and vividly into the plot. While reading, I could see the searing pain and harrowing decisions the sisters had to make in order to survive. In this vein, I was emotionally wrought and gutted while reading chapters 22 and 23, in as much that I had to take a short break before continuing onto 24. The story is about two sisters but it's also about war, don't forget. Heavy stuff, made more wrenching knowing that although this book is fictional, many things that took place actually happened to real people during WWII.As much as I love the book, there are two negatives I must mention. First, is that the bravery and heroism of Isabelle was too heavy handed, cajoling. In the beginning of the book, her character is annoying, arrogant, and impetuous, with a too-big-for-her-breeches attitude. Later on, Hannah transforms her into an almost mythical, herculean, Mount Olympus Goddess type heroine whose actions although believable, were too forced, for the purpose of dramatization. Perhaps the author was trying hard for us readers to like the character of Isabelle after her initial behavior in the beginning of the book.This wasn't necessary in my opinion because even with less heroicizing, I would have still liked her. Not as much as I liked Vianne, but I would have still liked her character nonetheless.Another plot point that I felt could have been shaved off a bit was the love story subplot between Isabelle and Gaetan. It played throughout the book, which was tolerable, but it was too sentimental, maudlin, to the point of cloyingly sweet. I'm not a major fan of \"love at first sight\" type plots, nor do I like too much romance in my novels. I did like their love story but I would have preferred less of it overall. Yes, people fall in love during times of war, but the over use of plot devices like \"I will go to the ends of the earth for you,\" or \"our love is all that sustains me\" type details don't please me. To be clear, these lines are not in the book but it felt like they were. The Isabelle Gaetan love story parts of the book were too drawn out and made the pace of the book stall. Which pains me to say because the novel's overall pace is excellent.Despite those the two pet peeves, I felt 'The Nightingale' was an excellent read. The decisions that both sisters had to make, especially those by Vianne, are layered and thought-provoking. It makes me wonder what I would do in the same scenario, given little choice. My reading experience with the novel was wonderful and though the book is more accurately 4.75 stars, it deserves the full 5 stars for the effort. Highly recommended for historical fiction, WWII, and strong women fiction fanatics.", "Star": "5.0 out of 5 stars", "Title": "Beautiful, Tragic, and Triumphant: With Some Annoyances"}, {"Upvote": "2", "Review": "The Nightingale is a realistic fiction novel depicting a time when France was occupied by Nazi Germany during WWII. It tells the story of two sisters, Vianne and Isabelle who lost their mom when they were too young. You could also say, that in a way, they have lost their father too who was a broken man after the Great War. When the war begins, Vianne is working as a teacher. She's married to Antoine and they have a daughter, Sophie. Isabelle, the younger sibling, is only eighteen. She's impetuous and adventurous.Before long, Antoine is sent to fight in the war, leaving Vianne and Sophie behind. Isabelle soon joins her sister, after her father sends her away from Paris. Vianne and Isabelle have never been close. Their differences have always been noticeable. Vianne thinks of herself as weak and worries about their survival, while Isabelle speaks her mind and wants to join the fight. She wants to be part of the resistance. Their lives become more complicated when a German captain is sent to live with them. Vianne tries to keep her head down and be inconspicuous. Isabelle, on the other hand, knows she can't stay with Vianne without putting her and Sophie at risk. When the chance to join the resistance comes, Isabelle makes up an excuse to go back to Paris. Here is where the story becomes impossible to put down. The sisters' tribulations, losses, heartbreak and the always present danger captivates the reader.“A broken heart hurts as badly in wartime as in peace.”I believe The Nightingale is a story that should be read by everyone. Kristin Hannah does a great job in detailing the horrors of the war and their consequences. At times, I felt like my insides were being ripped apart. I knew it couldn't end well for them. Or at least not for both. The end was bittersweet. I would recommend having some tissues around. I was not a sobbing mess like I was with her other novel, Firefly Lane, but it was close enough.I hope the movie does this book justice. I hope to add it to prior masterpieces like Shindler's List and Life is Beautiful.“Men tell stories,” I say. It is the truest, simplest answer to his question. “Women get on with it. For us it was a shadow war. There were no parades for us when it was over, no medals or mentions in history books. We did what we had to during the war, and when it was over, we picked up the pieces and started our lives over.”Cliffhanger: No4.5/5 Fangs", "Star": "5.0 out of 5 stars", "Title": "Everyone should read it"}, {"Upvote": "3", "Review": "Since getting my first Kindle I have kept track of everything I've read - and it's been a couple hundred books to date I think.  The number of reviews with 5 stars I've given during that time... well, I can count them on one hand.  I found this book to be very well written, riveting, and something I will think about for a long time. This is the kind of book that sends me to the internet and the library to find out more about the book topic.  As I type this, it is Veteran's Day, and I am once again thinking of all the brave service men and women who have fought for our country.  To them I give my heartfelt thanks.  And Kudos to Ms. Hannah for reminding me...", "Star": "5.0 out of 5 stars", "Title": "One of my VERY rare 5-Star ratings"}, {"Upvote": "3", "Review": "The Nightingale is a historical fiction book written by Kristin Hannah. The book takes place in France just prior to the start of WWII. The two main characters in the story are Vianne and Isaebelle who are sisters. The story first starts off with an older lady packing up her possessions in her house. While she was packing up her items, she came across something that reminded her of the war and what her family had encountered. She then tells the story throughout the whole book. I agree with Vianne's choices on the personal sacrifices she made to keep her family safe. My biggest issue in the book was when the author used reoccurring descriptions to describe the pain and sorrow the characters experienced. Although there were a couple of flaws in the story, The Nightingale is still one of my favorite books. I now have a broader view of WWII and realize the hardships the French people had to face. The publisher is St.Martin's Press New York and the price is $11.59 on amazon prime.", "Star": "4.0 out of 5 stars", "Title": "The Nightingale is still one of my favorite books. I now have a broader view of ..."}, {"Upvote": "3", "Review": "I sit in stunned silence as I finish the final pages of The Nightengale. Tears stream down my cheeks and my heart feels immense grief at what I have lived through  as I read through the pages of this book. I had no idea about the sacrifices that were given by the women of the French Resistance during the atrocities of WWII! I keep shaking my head and thinking \"I had no idea!\" I find peace in the end as I applaud the women and men who gave so much to help their families, friends, and strangers during such a horrendous time in the history of this world! Thank you to Kirsten Hannah for your intense research and gifted writing. I don't think I have ever been so moved by reading a story as I have by this one!", "Star": "5.0 out of 5 stars", "Title": "Stunned silence!"}, {"Upvote": "3", "Review": "THE NIGHTINGALE was required reading for my literary discussion group, so I had to read it. One rainy afternoon, I put it on my Kindle, took a deep breath, and dug in. What a treat! Some writers put the reader in the stadium to observe activities on the playing field. Others, my favorites, invite readers onto the field to participate in the action. Hannah does that. A phone or doorbell ringing is annoying. Of course, the best thing about reading is the words will wait patiently for a reader to get back. The only disturbing thing about this book is the similarities between the rise of Nazi Germany under Hitler, and some world events occurring under leaders today. It can be thought provoking. I've recommended it to several people.", "Star": "5.0 out of 5 stars", "Title": "A Keeper"}, {"Upvote": "8", "Review": "From the  extraordinary reviews, I was expecting a higher quality of writing. The author's dialogue writing leaves much to be desired (there is a difference between printed language and how people talk in ordinary conversation!!) and characters bordered on being one-dimension.  As a result, I could never entirely forget that I was reading a book. The wrap-up ending was emotionally moving but the author put little effort into elevating it beyond a formulaic Hollywood ending. The artificiality muted its emotional impact. However, the portrait of wartime France and Isabelle's journey was personal and harrowing, and I found myself returning for days afterwards to facets of the story and that time period. With all its limitations, a worthwhile read, although not a great work of literature.", "Star": "3.0 out of 5 stars", "Title": "although not a great work of literature"}, {"Upvote": "13", "Review": "The more I think about it, the more I realize how frustratingly BAD this book was. I'm not talking about the story - that was mostly good -- but the writing was so cliched and trite, almost more romantic novel than historical. Apparently the story is actually a fictionalization of a true story about a woman who saved downed Allied pilots in WWII by helping them to hike across the Pyrenees to Spain. I was happy to read about this part of WWII history... and sometimes the writing wasn't bad, but other times, it was just pitiful. I really don't understand all of the many positive reviews!", "Star": "2.0 out of 5 stars", "Title": "If you like romance novels, this is the historical fiction for you!!!"}, {"Upvote": "25", "Review": "An Academic Reader: The Complete Guide to Reading Comprehension Strategies and Improving Vocabulary (Academic Readers) (Volume 1)While the tale itself is an excellent yarn there are some very basic mistakes that should have been caught in the editing.First the age of the sisters when we meet them is 4 and 14. When the older sister tells what happened to her at 16 she mentions her younger sister being 4. Apparently she didn't age in the same two years!But the most basic mistake was when the German officer gives the older sister antibiotics in 1942. Here I had to stop reading and check because I was so certain antibiotics were a) not called that till much later and b) not available before 1945. I was right and the story had been broken because I had had to check it out.Another problem was the change of person. The present day story is told in the First person and she is meant to be looking bad on her life and the past is in the third person from the point of both sisters. Hence not a memory of the older sister. It would only have taken minor changes to make since they weren't made the connection between past and present didn't flow.", "Star": "3.0 out of 5 stars", "Title": "Why don't editors do their job?"}, {"Upvote": "3", "Review": "Well written historical fiction that takes place mostly in the French countryside during the Nazi invasion of WWII. Story follows the ultimately heroic adventures of two sisters who in their own very different ways try to survive the Nazi occupation of France. The story starts in the future in Oregon where one of the sisters ended up  - the mystery is which sister is it? The author throws many twists and turns to make it difficult to guess which one survives. If you want insight into what it was really like to live under enemy occupation and and ask yourself what impossible decisions you would have made to keep family safe - oh and shed many tears along the way this book is well worth your time.", "Star": "4.0 out of 5 stars", "Title": "WWII French sisters survival story - tear jerker"}, {"Upvote": "2", "Review": "The book puts a spotlight on the historical fact that French women helped resist the German occupation and suffered under it.  That theme is worthwhile and important to have pointed out.  It does a good job of delving into the unique predicaments of women in an occupied country.  The problem is that the story is preposterous and absurdly melodramatic.  The main character who, with the resistance name:  The Nightingale, is a comic book superhero woman.  She can climb mountains without eating or drinking, take beatings for days and move across German occupied France like a she is invisible.  She is also burdened with a very complex family history and an absurdly romantic love interest. It is all way too much.  This is clearly a woman's historical novel and surely the situations of the female characters resonate with the women who read it.", "Star": "2.0 out of 5 stars", "Title": "Over the top melodrama"}, {"Upvote": "44", "Review": "Well, apparently I am on an island regarding my views on this book. I really did not like it. Did not like the writing. It was painful to read. I had to put it down after about 125 pages. I originally got this book based on the reviews and a recommendation from the other books I have read specifically, \"All the Light We Cannot See\" which I loved. But this one...wow. I thought the writing was immature, no deep character development, very predictable. The way the romance between the characters was written felt like a harlequin romantic novel - cheap, unreal, superficial. The dialogue between the sisters and other characters was so spot on, literal, boring; there was no subtext to make it interesting.", "Star": "1.0 out of 5 stars", "Title": "Did not like it one bit..."}, {"Upvote": "3", "Review": "This was a book of the month selection of my book club.  I am ever glad!  I probably would not have read this on my own.  I love this book.  It is my favorite book thus far from the book club.  Parts of the story are, of course, painful.  But the book is beautifully written and this was a great reading experience.I love fiction, but I am also a little bit of a history buff.  In that context, there were some minor technical inaccuracies, that in truth, bordered on minutia.  I doubt many readers will notice or care about them.  However this did nothing to diminish my enjoyment of the novel.  Conversely, most of the novel was technically accurate from a historical standpoint.Completely by coincidence, I am reading a book right now authored by Leon Uris.  The name of that book is MILA 18.  I am only about one quarter of the way through MILA 18.  Thus far it is the story of the German invasion of Poland during World War II.  There is a lot of information in that story about the occupation, the treatmeant of Jews and ration books, etc..., that parallels The Nightingale.  I don't know where that novel is headed, but I mention it in case a reader is interested in another novel that may be similar in theme by another iconic author.It is my intention to read more work of Kristin Hannah.  Thank You...", "Star": "5.0 out of 5 stars", "Title": "Excellent!"}, {"Upvote": "3", "Review": "My wife raved about this book so I felt that I needed to give it a good read.  Some of my opinion is due to the fact that this was silghtly outside of the usual genre and time period that I read, but I truly enjoyed the book.  It took me a little bit to become engaged with the characters, but as I said it was a little different than my normal reading.  Suffice it to say that by the time I got to the end of the book I think that I cried through the entire last chapter (yes, I'm a guy, but guys can cry too).  I thought that the book was well written and although fictional in substance, it had alot of factual research at the heart of the story.  I woud strongly recommed that you read it, and then decide from there if you want to pick up another of  Kristin's books.", "Star": "4.0 out of 5 stars", "Title": "Well Worth the Read"}, {"Upvote": "2", "Review": "The Nightingale is profoundly moving, beautiful and searing. It will pull you right in, and you will want to keep reading until the very end. The setting is France under German occupation in World War II. Little by little the Nazis tighten their grip. Initial politeness turns to barbarity. Nazi collaborators live comfortably and have plenty to eat. The rest of the population is close to starvation. Jews are fired from their jobs and then eventually rounded up for deportation to concentration camps in Germany.We often hear about what men do in war, how they fight, their bravery and sacrifices. However, this is primarily the story of the women left behind and the choices they make. Isabelle Rossignol, as a young rebel in her 20s, joins the French Resistance and devotes her life to helping downed allied airmen escape on German patrolled trains and then over the Pyrenees to Spain. She is called “The Nightingale” from the French, “”Rossignol”.  The Nazis, who finally interrogate her, do not believe that this young girl is the mastermind of the Nightingale operation. Vianne Mauriac’s husband is in a German prison. Since she has room in her large home, Le Jardin, a Nazi officer is billeted in her home. She wants so much to be safe and tries to make the best of her situation. But soon she sees German cruelty and cannot turn her back on what she sees. She risks her life and the life of her daughter to save 19 Jewish children from the Nazis.The relationship between the two sisters is also at the core of the novel. They struggle with feelings of abandonment, betrayal and lack of trust.  Deep within is the love they have for each other, and love finally wins. Each in turn seeks love from others. Isabelle’s love relationship with Gaetan, a partisan, is poignantly told. Vianne’s love for her husband Antoine and her attraction to the German officer Beck is there, as well.This is an historical novel, and Kristen Hannah did a good deal of research. The author based some of her novel on the true story of a heroic, young Belgian woman, Andree de Jongh (nicknamed “Dedee”) who set up the Comet network to help downed airmen (as well as civilians) escape the Nazis. The 600 mile Comet network included a series of safe houses, rides on German patrolled trains, dangerous border crossings and finally the journey across the Pyrenees to Spain. Dedee was very m  uch like Isabelle in the novel.Kristin Hannah left her law practice in Seattle to become a full-time writer. She is now the best-selling author of 21 novels and has won numerous awards for her writing. The Nightingale, published in 2015, has won the Goodreads Choice Awards Best Historical Fiction award and is under contract for a movie with TriStar Pictures.", "Star": "5.0 out of 5 stars", "Title": "Beautifully Written, Searing Story of the German occupation of France in World War II"}, {"Upvote": 0, "Review": "This novel tells the story of the ups and downs of family love in a time of war. The tragedy of the Nazi occupation of France and the independent acts of heroism of the main characters, Vianne and Isabelle and their father, eventually allows them to voice their love for each other despite years of hurt and loss.I was drawn in to this well crafted tale of the heroism of the women who were brave to resist the Nazi occupation of their beloved France. I like reading good historical fiction, especially ones like this book. Although we hope that nothing like Nazism or the holocaust would ever happen again, the current rise in nationalism in several nations, including the U.S., threatens that hate may yet again turn humans into monsters. Stories like this are important in that, if faced with similar choices between hate and love, self preservation or self sacrifice for the good of others, we may be encouraged to make the choices to overcome evil.", "Star": "5.0 out of 5 stars", "Title": "Mesmerizing"}, {"Upvote": "3", "Review": "Somewhat predictable. Slightly jarring use of flash forwards chapters that are terribly misplaced and interrupt the story. That said it is a good story that asks the essential question of \"What Would You Do?\" It is a story of choices at a time of desperation and a story of the choice to fight back and to love in spite of it all. Good, interesting characters with a feminine slant. Be prepared for some graphic accounts of the atrocities of war. Believable characters (except perhaps of stereotyped minor characters.) I called it \"hopeful\" though the word would be more frank and honest. Overall a well paced novel and I found myself drawn into the suspense at the end. The description of the behavior of one of the main characters in her old age was very puzzling based on what she endured.Read for a book club. I would not have chosen to read it otherwise because I do not like this subject matter. Also I read \"All the Light We Cannot See\" earlier this year which I think is a far better handling of the conflicts of war. Would recommend with the warning about the graphic accounts.", "Star": "4.0 out of 5 stars", "Title": "Slightly over-hyped. Decent book but somewhat predictable with jarring flash forwards."}, {"Upvote": "3", "Review": "I would give the book four and a half stars if I could.  This World War II story is really good.  It tells of the lives of women during the war,which is somewhat unusual.  The story makes clear the horrible hardships and terror experienced by the families left behind by men who went off to war.  The relationships among the women are realistic and reflect the fact that they often had no choice in their actions if they wanted to protect their families. I have a personal friend in another country, who as a toddler during this time and the struggles of the characters in this story reflect those of my friend. The weird mixture of kindness and ruthlessness of the soldiers, especially, the one who usurped Vianne's house exemplifies the sheer meanness of Hitler and his followers, which, though hard to understand, brings to mind the philosophies and actions of current world terrorist groups. The writing engages the reader to the point of physical reaction to some of the things that happen to the characters in the story.  My half star reduction results from what seemed to me to be words or phrases that would not have been used at that time in history.  It was distracting to me.  Otherwise, I liked it a lot and am very glad that I read it.  It has been a while since I finished reading the book and I still think about it from time to time.  For me, that is a good book.", "Star": "4.0 out of 5 stars", "Title": "This World War II story is really good. It tells of the lives of women during ..."}, {"Upvote": 0, "Review": "“The Nightingale” is one of those historical fiction novels that can easily be read by fans of any other genre, for it not only concentrates around the Resistance and hardships of the war but also features some beautiful, heart-wrenching romance and two female protagonists who are both incredibly strong and very relatable, even though each expresses her strength differently. The writing is truly enthralling, moving at a slower pace sometimes but in my eyes, it only sets the atmosphere befitting the never-ending struggles of the population under German occupation. The research in “The Nightingale” is also incredibly thorough and this always makes me respect the author even more for allowing me to immerse into a world of the past that not only presented without any reproach but makes me eventually lose myself in it. The great Exodus, the budding cells of the Resistance, German officials finding their lodgings with their resentful hosts, the persecution of the Jews, the sinister Gestapo threatening to uncover the carefully constructed escape route for the Allied parachutists - all this makes “The Nightingale” a truly fascinating read. Highly recommended to everyone.", "Star": "5.0 out of 5 stars", "Title": "A fascinating read!"}, {"Upvote": "2", "Review": "A master storyteller, Kristin Hannah tugs at the heart strings and twists the sinews of our emotions as the sisters, Vianne and Isabelle, defy the Nazis during their occupation of France.  The Nightingale is not a story of defeat but a story of transcendence.  Personifying the women of the Resistance, Vianne and Isabelle open our eyes to the sacrifices made for survival. Left behind by the men who fought for freedom, these sisters take two different paths but learn:  “In love we find out what we want to be; in war we find out who we are.”  Hannah‘s control of detail and emotive language enables us to empathize with Isabella and Vianne as they struggle to survive the atrocities of WWII.The resistance of these sisters during WW II propels us through the narration. Through Vianne, we become observers of the physical, emotional, and psychological challenges inflicted on the women of Carriveau as the war drags them through a quagmire of cruelty and survival.  When Vianne must prepare for her first winter alone with her daughter, Sophie, she realizes “how perilously balanced her survival was” as she begins to chop wood.  “Every chop reverberated up her arms and lodged painfully in the muscles of her shoulders.  Sweat squeeze from her pores, dampened her hair.”  Although a minute detail of daily survival skills, this metaphorically describes the relentless power of war that overwhelmed her town.At times it is difficult to tell who is narrating the story because the lives of the sisters are intertwined in their stories of survival.  Although fictional, Hannah captures the suffering and bravery of the women of the Resistance in this story.  Years after the war, Vianne observes “how gently time passes in Paris.  As lively as the city is, there’s a stillness to it, a peace that lures you in.  In Paris, with a glass of wine in your hand, you can just be.”  She has survived but at a cost.This novel details a war that most of us don’t remember.  In the world today, Isabelle’s understanding is a lesson we should take to heart: “They couldn’t touch my heart.  They couldn’t change who I was inside. My body…they broke…but not my heart. “  We need to make this our mantra to help us survive in a world being torn apart by violence.", "Star": "5.0 out of 5 stars", "Title": "The Nightingale's Song"}, {"Upvote": "2", "Review": "After reading The Nightingale, I was surprised by the polar opposite reviews. I can see some of the points of the negative reviews, but they absolutely do not warrant such scathing reviews.Here is what you need to know if you are thinking about reading this book:(1) It is slow going at first, but keep reading. I had a hard time for the first 100 pages. It wasn't that the book wasn't good or interesting, but it wasn't one of those books that grab you immediately and you can't put it down. It wasn't until I got past the first 100 or so that I couldn't put it down.(2) You will have a love-hate relationship with some of the characters. You will feel torn with between being frustrated but still understanding why the characters act the way they do. To me, these are the kind of characters I want in a book. None of the main characters are purely good or purely bad. They are normal everyday people who act immature, selfishly, do things out of fear, and then surprise you by their changes and actions. This is how people in real life are. That isn't unrealistic. In fact, it is the picture of who we are as humans. It reminds me of when you hear someone is going to be a first time parent, and you first thought is \"THEY are going to be parents!?!\" But in the end, when that baby comes and those unseemlying new parents buck up and then you are surprised to see them turn their life around because of that little new life. I imagine being in the middle of a war zone is similar in that you don't get to leisurely grow up anymore. You might fight the inevitable changes at first, but in the end, you don't get a choice about growing up. You do what you need to out of necessity.(3) At some point, your preconceived notions will be challenged. The word Nazi brings many things to mind. Mostly darkness, depravity, and horror. This book obviously did not change that, because obviously there aren't even words to describe the evil that occurred during WWII. It is hard to see anything beyond that when talking about WWII, especially having been to Auschwitz. However, The Nightingale somehow helped me piece together who Nazi soldiers were in a more tangible way. They were people with wives, children, parents, etc. Many did unspeakable things, but what were they thinking when they did them? Were they ashamed or proud? Putting this into prospective made the Nazi agenda even more bizzare to me. How the eff did this happen? These were normal people who bought into propaganda so much so as to start a world war. It is terrifying.(4) It isn't, and doesn't have to be, some literary mecca. It is an easy to read story that makes you think, especially if you haven't read many books about this era. It may spir on to learn more about the topic. Personally, I sought out more books after reading this because I wanted to learn more about the facts. To me, this marks a good book. Not advanced sentence structures or words not frequently used everyday. It encourages you to engage with the underlying story, the characters, and learn more about what this aspect of WWII was like. Winning.There are many more things I could say about this book, but I'll leave it at my points above. Overall, read this book. If you are WWII scholar, it probably isn't for you. If you are looking for a good read and something to take you out of your own little world to experience something new, you should check this book out.", "Star": "5.0 out of 5 stars", "Title": "4 Things to Know Before You Read (and You Should Read It)"}, {"Upvote": "2", "Review": "I finished the Nightingale a week ago and had to process what I had read. First of all I am a fan of Kristin Hannah's writing so I knew I would love her book, but this book was unlike any other book I have read of hers. I knew it was going to be about the war, but I tried not to read reviews before I started or even the cover of the book.Vianne and Isabelle, two sisters different as night and day, face the challenges of living in German occupied France during WWII. Both sisters are heros, they risked their lives to help others. They suffered loss and heartbreaking, life changing decisions. Kristin Hannah gives you a look into daily life under Nazi control during WWII. It really opened my eyes to details not often discussed in a history book. This book is about more than war, it is about relationships between sisters and their relationship with their father. It is about best friends torn apart, people standing up for what they believe is right. It is about love and healing, loss and pain. It left me in tears several times and I know it is a story that will stay with me. I am so glad I read this book and will recommend it to my friends.", "Star": "5.0 out of 5 stars", "Title": "Best book I've read this year! Fantastic!!!"}], "Star": "4.8 out of 5 stars", "Name": "The Nightingale: A Novel", "Format": "Format: Hardcover", "Price": "$9.98", "Author": "Kristin Hannah"}