{"Comment": [{"Upvote": "10", "Review": "“When people don't express themselves, they die one piece at a time.”I first picked up a copy of Speak at the library some time in the very early 2000s, when I wish I’d been too young to know how the world worked, the ways in which it chewed children up and spat them back out. Sadly, I was one of many children who learned these things early, and Speak made me feel acknowledged. I remember thinking, for the first time, that someone understood me, and I will never, ever let go of the special place that feeling carved out in my heart for this famous little story. When I found out that one of my favorite graphic novel artists was taking it on for a new spin, I had to have it, and I literally sat down to devour it the moment I opened the package.“I wonder how long it would take for anyone to notice if I just stopped talking.”Unfortunately, Laurie Halse Anderson speaks from a place of understanding and experience on this topic, but it shines through in how authentic the events of Speak feel. The story not only discusses the ramifications of rape and how Melinda views her attacker now – especially in a scenario when a victim is forced to continue interacting with their abuser – but it also touches on the depression that can come along with the event, and the ways those feelings manifest themselves for many victims: isolation, silence, anger, self-harm, anxiety, intrusive thoughts, and apathy for anything in life that isn’t crucial to survival.“I have never heard a more eloquent silence.”While the story itself is as wonderful and haunting as it always has been, Emily Carroll’s artwork genuinely takes things to a new level. She manages to depict small things that don’t come across as so important in the text – like Melinda’s nervous tics, or the way she views herself as an endangered rabbit when the vicious wolf (her attacker) is near. When it comes to the heaviest and darkest scenes, Emily manages to convey the hurt and fear without going overboard on graphic depictions. There is one panel, in fact, that is so subtle, but left me breathless because it so perfectly portrays the helpless claustrophobia that comes with facing one’s attacker.“It happened. There is no avoiding it, no forgetting. No running away, or flying, or burying, or hiding.”I could tell you, for those of you who haven’t experienced Speak before, that there’s a silver lining, or a lightly humorous subplot to cut through the grime, or a perfectly happy ending, but none of that would be true. Laurie Halse Anderson is too authentic for that. This isn’t a story about a girl who happens to have been raped; this is a book about rape, and the tragic things it can do to a survivor’s psyche. I recommend the utmost caution when proceeding with this story, in its original format or this new graphic novel style, but I also have to say that I cannot recommend this book highly enough.", "Star": "5.0 out of 5 stars", "Title": "Just as haunting, beautiful, and important as the original rendition."}, {"Upvote": "6", "Review": "This book changed my life when I read it in its original novel format when I was 17. It was the first book I read about rape and the first on the subject since my own rape years before. It hurt, it destroyed and it healed. I have treasured the book sinceWhen I knew it was being re-released as a graphic novel, I absolutely had to pick it up. It would be only the second time I’ve experienced the story of Speak.It was gut wrenching to get through. Reading the words was painful enough but having the added weight of illustrations to go along with it just made it a completely different kind of vulnerable journey.As hard as it is to read about the subject matter, I will never regret reading Speak in its novel form and I will be forever altered and moved by reading it in it’s graphic novel form.", "Star": "5.0 out of 5 stars", "Title": "It can be healing"}, {"Upvote": 0, "Review": "I'm so happy to see one of my favorite books given new life with visuals. I know there is a movie, but movies always deviate in some fashion from the book, and I love having the actual words from the novel and images together. I don't super love that some things were updated in the pictures (the book was written in the late 90s, when smartphones and Instagram were nonexistent, and yet they appear in the story), but they don't interfere with the story too too much.", "Star": "5.0 out of 5 stars", "Title": "New life to a wonderful novel"}, {"Upvote": 0, "Review": "I read this book for the first time many years ago and have revisited it periodically because of how much it touched me. This graphic novel version of Speak is the absolute best thing that could have happened to this book. It gave it an edgier and darker feeling, without ever feeling too dark. It updates the novel in a great way and makes it accessible to many more readers in a new generation. I can't even express how wonderful this graphic novel is. Please consider purchasing!", "Star": "5.0 out of 5 stars", "Title": "This graphic novel version of Speak is the absolute best thing that could have happened to this book"}, {"Upvote": "3", "Review": "SPEAK is one of the most important books ever written for young adults. It was a first dealing with date rape, years before #MeToo . Laurie Halse Anderson captured Melinda’s quiet vulnerability and burgeoning voice with enough sarcasm to feel authentic, making Melinda’s pain even more poignant.Because of Melinda’s artwork and art as a metaphor, SPEAK transfers seamlessly to a graphic novel. Emily Carroll’s illustrations brought the characters to life. I’ve seen the movie, listened to the audio and read the book countless times, so Carroll’s drawings could have felt “wrong” if she hadn’t imagined the people as Anderson depicted them. Carroll’s Melinda looked different than Kristen Steward in the movie and seemed different than the reader in the audio version, but she **was** just as much Melinda.SPEAK is only the second graphic novel I’ve read, so while I’m not an expert, I can say that I LOVED it. My only complaint was that the formatting on my kindle was a bit tricky. Viewing was landscape, which was fine, but I would have liked to be able to enlarge some of the pages with more ease. Even my aging eyes could read all the words, but I had to strain a bit.", "Star": "5.0 out of 5 stars", "Title": "Pitch perfect"}], "Star": "4.6 out of 5 stars", "Name": "Speak: The Graphic Novel", "Format": "Format: Hardcover", "Price": "$13.99", "Author": "Laurie Halse Anderson"}