{"Comment": [{"Upvote": "8", "Review": "This book is a funny and delightful epistolary novel, comprising predominately letters of recommendation from an English professor.  If you have ever worked in academia, studied in a university setting, or asked for a letter of recommendation, then this novel will resonate with you.  Those in academia will especially appreciate the layers of humor.Jason Fitger is a professor of Literature and Creative Writing at Payne University, a small struggling college in the Midwest.  Nothing in his life is going right.  He had early success with a novel written while he was in a graduate seminar.  Unfortunately, the novel was based on his life and love life as a graduate student.  Subsequent novels, also autobiographical of his love life, did not do as well.  His ex-wife teaches at the same university and the woman he had an affair with is also employed there.  Another ex heads up a writer’s retreat.  He is trying to champion the novel of one of his graduate students, but the student’s funding has been cut and he is floundering.  The chair of the English Department is a sociologist.  Worse yet, the Economics Department, is having a complete renovation.  They reside in the same building as the English Department.  The Econ profs are evacuated while the English profs are left to deal with the toxic air and construction noise.  In the midst of all this, Professor Fitger writes various letters of recommendation for past and present students, letters of complaint to the university, and letters of pining and regret to his ex-lovers.This book is laugh out loud and snort out loud funny.  It will really resonate with university professors.  Professor Fitger is cutting and sarcastic, but totally nails university life and the inherent politics.  For all his bluster and snark, Professor Fitger remains a dedicated and thoughtful teacher.  This book is well-written.  It is smart and funny.  It is also short and can be read in one day.  I will be recommending this to my friends who teach at the university level.", "Star": "4.0 out of 5 stars", "Title": "University Life is Hell"}, {"Upvote": "39", "Review": "I became aware of this book from a review in \"The Chronicle of Higher Education,\" which recommended it, but with the warnings that (a) the main character is a cliché, drawn from countless academic novels, of the cranky male dinosaur prof with women troubles; and (b) the novel's satire is unsupported by a meaningful vision for academe, its jokes cheapened by not being at the service of a deeper purpose.Neither of these criticisms fit my experience of this book, which chronicles a year in the life of English professor Jason Fitger through his correspondence, mostly letters of recommendations (LORs, as he refers to them). Indeed our hero is a type, recognizable both from literature and from life, of the cantankerous, retrograde English prof who clings to his oldfangled ways even as they plunge him into certain obsolescence. But those of us who have struggled with the online forms on which LORs must currently be submitted will find a freshness to the predicaments described here: e.g., to the way that Fitger's answers to the cookie-cutter questions are cut off by the forms, to his refusal to check the boxes that require him to rank students by percentages, and ultimately to his insistence on sending them via \"the picturesque blue mailbox on the corner, opening its creaking rectangular metal mouth, and dropping the envelope within.\" This kind of comedy, which Schumacher handles with aplomb, simply would not work with a different, updated protagonist.Also, despite his superannuated ways, Fitger, as it turns out, has not only a soul but a surprisingly sturdy ability to work the system, which together amount to a vision that easily sustains the satire in this novel (even if it does at times border on the sentimental). Threaded throughout the book are his indefatigable efforts to support a talented but tormented student (Darren Browles), his vain hopes of reuniting with his estranged wife (who learns of his infidelity through an unfortunate \"reply all\" mishap), and his growing, grudging respect for the sociologist \"appointed by the university warlords to rule our asylum [the English Dept.] until the inmates exhibit greater pliability and calm.\" These threads are tied together in a denouement that, while hardly wildly dramatic, exhibits that Fitger is true to his principles, ready to make sacrifices, and will persevere in the face of whatever hardship life throws his way.As an erstwhile member myself of an English Dept., I also found highly satisfying and quite hilarious the many jabs this book takes at the lavish treatment received by the Economics Dept., which resides in the same building as English just upstairs and is undergoing renovation throughout the year of this epistolary narrative. That renovation accelerates the indignities forced upon the literature faculty by poisoning them with venomous fumes, demolishing the fax machine when a portion of the ceiling collapses almost decapitating the English Department's student assistant, and leaching slick and noxious liquids onto the floor of the men's room which abuts Fitger's office. \"But never mind: I'm sure our foreshortened life spans will be made worthwhile on the day when the economists in their jewel-encrusted palanquins, are reinstalled in their palazzo over our heads.\"These are indeed hard times for the humanities. While this novel lacks the heft to qualify as any kind of masterpiece, even a comic one, and while it will probably (hopefully!) feel dated in a relatively short time, it feels really good to be able laugh along with Julie Schumacher and Jason Fitger at the absurdity of the moment in which we find ourselves now.", "Star": "5.0 out of 5 stars", "Title": "Custodian of the Comic Flame"}, {"Upvote": "5", "Review": "This is a very funny and also a very smart look at the contemporary world of academia as seen through the endless numbers of letters of recommendation written by Jason T. Fitger, a professor of Creative Writing and English at the fictional Payne University, which is located somewhere in the Midwest.Like so many other disciplines in the Humanities, Fitger's English department appears to be under siege. Its budget has been slashed; full-time tenured faculty are being forced out in favor of part-time, non-tenured wage slaves; the graduate program is in decline; the physical facilities are falling apart, and the administration apparently couldn't care less.To add insult to injury, a sociologist--a sociologist!--has just been installed as head of the English department and while the department can't even afford a working copy machine, the university is spending a fortune to renovate the floors above the English department, creating veritable Taj Mahal in which to house the damned Economics department.Poor Fitger's personal life is about as troubled as his professional life. He's divorced; his once promising writing career has tanked, and, like an academic Rodney Dangerfield, he seems to get no respect from anyone. But the guy writes brilliant letters of recommendation, the kind that many professors would love to write if only they had the wits and the guts to do so. Through the letters he pours out his commentary on the state of affairs, academic and personal, and those who have spent any time at all laboring in the academic vineyards will sadly nod their heads in agreement--that is when they're not laughing out loud.", "Star": "5.0 out of 5 stars", "Title": "An Hilarious Look At the Contemporary World of Higher Education"}, {"Upvote": "4", "Review": "Schumacher's professor, the inveterate writer of recommendation letters, is jaded, tired, snarky, caring, and unable to keep his thoughts and emotions in check. In addition, he is a Luddite in a world of automated online recommendation systems, mobile phones, and the inescapable email. His LORs are at times hilarious, touching, slightly insane, and occasionally completely deranged. His horrible brush with the accidental reply-all email is inevitable. Solely through his recommendation letters, we learn of his development as a young writer, the birth and demise of his marriage, his love affairs, his better students and the other sort, his colleagues, and his employing institution. As well, we learn of his private and not so private thoughts on many subjects. He is rather a bitter man, but also erudite and penetrating.This is a fun read, particularly for an old academician like me, but also for anyone wearied of the endless and mostly thankless job of writing letters of recommendation.  It is also humorous for anyone who has been in academia long enough to recognize its foibles and limitations.", "Star": "4.0 out of 5 stars", "Title": "Hilarious and a bit insane - perfect for the academician needing escape and validation"}, {"Upvote": 0, "Review": "This is one of the most delightful works I've read in ages. A wonderful wry takedown of a university English department, its personalities and politics. It consists of many pieces of correspondence by one cynical and jaded English prof who must deal with an endless series of requests for letters of recommendation from many less-than-stellar students. His forbearance is remarkably funny while he does what he can for them. Yet there is one student he feels is brilliant and steadily tries to find him some kind of paying work so the young man can finish his novel. Between these epistles, he struggling to save his department from being demolished while another more worthy department gets everything but gold toilets. Offsetting the snark is a touching thread of the professor's humanity and compassion.If you've ever lived in the tight little world of a university department, you must read this!", "Star": "5.0 out of 5 stars", "Title": "Wickedly funny"}, {"Upvote": "2", "Review": "Over the course of an academic year, Jason Fitger, a beleaguered, defensive professor of creative writing and English at Payne University, works out his bureaucratic rage, personal relationships, and professional frustrations in a series of letters of recommendation.  He also manages, on occasion, to actually recommend current and former students in those same letters, although at times (well, most of the time) that seems secondary to his venting agenda.  I was looking forward to reading this for some time, and I thoroughly enjoyed it—every page.  It was a very pleasant diversion, a masterfully done, crazy-funny epistolary novel.  It’s hard to imagine it being fully comprehensible to anyone not deeply familiar with academe, its particular lexicon, and its carefully cultivated idiosyncrasies, but for those who are, or who are looking for further reasons to question the overweening self-importance with which so many in the academy choose to make their pronouncements about the enterprise, it’s a good bit of fun.  Julie Schumacher has not only found the perfect voice, she has managed to develop an actual story line (or really, more like several sub-lines) and a hint of protagonist character development entirely through the vehicle of one professor’s letters.  If you are the right audience for this novel, expect to smile many knowing smiles, and perhaps to recognize a number of people you know.", "Star": "4.0 out of 5 stars", "Title": "A Year in Letters"}], "Star": "4.4 out of 5 stars", "Name": "Dear Committee Members", "Format": "Format: Paperback", "Price": "$12.30", "Author": "Julie Schumacher"}