{"Comment": [{"Upvote": "63", "Review": "Watchmen is, in my opinion, the greatest literary achievement of the greatest comic writer ever. In the mid 1980’s DC Comics reached its absolute artistic peak. From 1984 to 1986 DC handed Swamp Thing over to Alan Moore, released Crisis on Infinite Earths, published Frank Miller’s Dark Knight Returns and in one final magnificent achievement gave to the world Alan Moore’s Watchmen. I was 15 years old when Watchmen was published and it was an absolutely mind blowing series. This is a REALLY dark story and I mean that in the sense that it can be downright depressing particularly for someone raised on superhero comics.There are currently three different versions of Watchmen books currently available. There is the Absolute Edition which I own but have never actually unwrapped. It’s more of a collectible for me and the giant size of the Absolute Editions make them unwieldy for a little bedtime reading. There is the paperback version which is easily the least expensive and there is the Deluxe Edition. The Deluxe Edition hits the sweet spot. With a hardbound cover it’s more durable, the quality of the paper is much higher than in the paperback and the colors are more vibrant. The Absolute Edition may be the pièce de résistance of Watchmen books but I’d rather curl up with the second best looking book if it means holding 2.2 pounds rather than 5.9. The Deluxe Edition contains 32 pages of extra material not present in the paperback edition including sketches and notes on Watchmen. It’s not super thrilling but it’s nice to have some extras.Watchmen is the greatest usage of the comic medium I have ever seen. Creating a 12 issue mini-series is a difficult task in trying to pace out the story but Alan Moore’s nails it. The story perfectly fits, never drags and never feels rushed. It’s like every panel and every sentence is crucial to the story. Perhaps Alan Moore’s crowning achievement is the creation of Adrian Veidt who is in my opinion the greatest adversary in the history of comics. Comics are rife with hyper intelligent super villains and heroes, the problem is they are written by non-hyper intelligent writers. Adrian Veidt is the first comic character that legitimately seemed to be on an intelligence level beyond the rest. I never felt that way reading Lex Luthor or Doctor Doom or Brainiac. I encourage people to read all the extra material that appear between issues to get an even greater sense of Veidt.Veidt may be the crowning achievement of Alan Moore but it’s hard to argue that the Comedian, Dr. Manhattan and Rorschach aren’t his near equal in amazingness. Some may find one or more of them to be superior to Veidt. Rorschach in particular shows the strength of Moore in that he was capable of creating a compelling and sympathetic character despite having the polar opposite political views. Right leaning writers like Frank Miller and Steve Ditko would never EVER being capable of giving a left leaning hero such honest treatment. Not in a million years. Dr. Manhattan is as close as any writer has come to creating a character who exists beyond space and time. Grant Morrison did a pretty good job with Captain Atom in Multiversity but Dr. Manhattan remains the king.Any comic fan who has never read Watchmen is missing out on the greatest graphic novel ever. This is a book I could read every year for the rest of my life and I have no doubt I would be amazed with each reading. It’s nearly 30 years since its publication and nothing has even approached it. I always search for the next Alan Moore and I never find one. Even the recent works of Moore have moved further and further away from the quality of Watchmen. Maybe we have seen the best there will ever be and maybe this is the most reasonable version given price and portability. If so go buy it. NOW!!!", "Star": "5.0 out of 5 stars", "Title": "The Single Greatest Graphic Novel Bar None"}, {"Upvote": "14", "Review": "Describing Watchmen is very hard. The story itself is less important than the themes that story unearths and the backdrop. Watchmen is about morality, it's about politics, it's about humanity, it's about what being a superhero is, it's about comics in general, and it's about power. I don't want to put down the plot, but like art-films, you don't read this for the story. You read it for the elegance through which the themes are developed. It's a slow burn story that packs one hell of a punch in the end, but isn't necessarily something you'll care about for the majority of the book.The big question is whether it's a good place to start in comics. I wouldn't recommend this as the first thing you pick up due to how dark it is, and how you should have some idea of how comics function normally to see how well they're being subverted and twisted here. Of course, since pop culture is stuffed full of superheroes right now it's not something you really need to worry about if it is the first thing you pick up.The biggest problem that would stand if you picked this up for the first time is that it doesn't really introduce you to the wider world of DC comics. Yes, it's a wonderful story, and if you want to add diversity to your shelf and play around in the corners of the comics world, it's wonderful. But if you want to read superhero comics and want an introduction to that world, this is the wrong place to go. I do understand there was a set of prequel comics released at one point, but they aren't written by Alan Moore (and he actually hates that they happened, if I understand it correctly) and didn't last very long. I, personally, have no plans to read them since I'm not really interested in seeing what happened before this book.My opinion of the whole graphic novel: wow it was amazing! It was not what I expected but I loved it all the way through. In no way did I expect it to take me this long to read, and it does disappoint me that it did, but every second really was a pleasure. If it's been something you've debated I recommend picking it up sooner rather than later, even if it's just from your library.TL;DR? It's not the best place to start, but is a wonderful book I recommend everyone read at some point in their lives.", "Star": "4.0 out of 5 stars", "Title": "Read it before you die"}, {"Upvote": "8", "Review": "There is very little I can add to the reviews - stellar or otherwise - about Alan Moore's _the Watchmen_ in terms of plot synopsis and cultural impact.  When I was a boy, I loved reading comics, but the larger questions (were one to do away with the suspension of belief) are never asked.  In the _Watchmen_ Moore raises some really intriguing questions: what is it that makes a person become a \"super hero?\"  \"What happens after all the bad guys are defeated?  Where do you go - and who are you now?\"  And most intriguing of all, \"what if there were a superhero of supernatural strength, intelligence or power?  How would this change international dynamics?\"The characters and their origin stories are archetypal - a family tragedy, a scientific accident, a wealthy magnate seeking to do good ... the human side of these super-heroes is what made this such an enjoyable and intriguing read for me: how power and fame warped some, how the government sought to manipulate and use these people, and what happens to them when they inevitably get old?The conclusion was a bit of a let-down - it felt to me as if Moore had written himself into a corner and wasn't sure how to get out of it; that said, the characters remained true to their nature; perhaps given the story arc there was no other way to wrap things up.  To his credit, Moore didn't \"cheat\" readers with a last-minute change of heart of a sudden catharsis that took characters in a different direction in order to provide a happy, tidy ending.For comic book fans, this is a must read.  As a cultural touch-stone and commentary on the nature of power and reflection of 20th century western values and mores, its an interesting commentary.  For those seeking a fun and entertaining read, this will be a hit.", "Star": "5.0 out of 5 stars", "Title": "\"Who watches the watchmen?\""}, {"Upvote": "8", "Review": "this is by far one of the greatest stories ever written. and i'm not even exaggerating. it's a thought-provoking, superbly detailed, philosophical gem. i would recommend it to any and everyone. this revolutionized comicbook storytelling. and the story? what an amazing one it was. you really have to read it to appreciate it. and i watched the movie before i read the graphic novel. and though i'd enjoyed the movie before, it doesn't even come close to the graphic novel.", "Star": "5.0 out of 5 stars", "Title": "must read (and i rarely say that)"}, {"Upvote": "3", "Review": "While I don't read a lot of graphic novels, I was told that this was one that could not be missed. I must say I wholeheartedly agree with that sentiment. The story is gripping, the characters feel like they are truly real, and the artwork is fantastic. There is definitely a lot to take in, as the book features stories within stories, articles and other information that is not strictly part of the \"main plot\", but it all helps to develop a cohesive world. I would say that this book would be required reading for anyone trying to get into graphic novels. Skip the movie (the movie changed too much of the plot for my liking, especially the ending), and start here instead, especially as the Watchmen become a part of the overall DC universe.", "Star": "5.0 out of 5 stars", "Title": "The classic"}, {"Upvote": "5", "Review": "I had collected comics since the sixties, owning many originals; over the past eight years I've been giving just about everything away, including my collection of thousands of comics.Marvel was always my favorite but it was two DC comics; The Watchmen and The Dark Knight series in 1985 that were so well done, I decided to stop.The Watchmen was extremely well thought out with the storyline and a suburb job with the art, after watching all versions of the movie so many times I thought I'd pick up the graphic novel for a re-read.  I'm damn glad I did, it still has held up very well and with the U.S. now in Afghanistan it is even more surreal.", "Star": "5.0 out of 5 stars", "Title": "Surprising to start reading graphic Noel's again"}], "Star": "4.7 out of 5 stars", "Name": "Watchmen", "Format": "Format: Paperback", "Price": "$14.77", "Author": "Alan Moore"}