{"Comment": [{"Upvote": "8", "Review": "I've used Blake's Save the Cat! structure for years (having adapted it from the original screenplay method to use in writing my romances and time travels--you should see my plotting charts!). So, when I saw Jessica's book advertised, I pre-ordered it and it arrived today....just stopping my reading long enough to add my 5-stars and to say, \"Buy this book!\"  Trust me when I say this is a foolproof method. Truly. Max-the-Office-Cat from JanetWellingtonBooks (that's me!) agrees!!", "Star": "5.0 out of 5 stars", "Title": "(Save the Cat!) Save Your Novel!!"}, {"Upvote": 0, "Review": "I bought this audiobook on a recommendation from another author. As a \"pantser\", I've never been fond of plotting.  I've only had the book a week and have read it a dozen times. Not only did it save my work in progress, it helped me plot my next book in only a few hours. I'm going to purchase the paperback as well. Do yourself (and your readers) a favor, and get this today!", "Star": "5.0 out of 5 stars", "Title": "Saved by Saved the Cat!"}, {"Upvote": "2", "Review": "Never have Blake Snyder's beats and genres been so accessible! What a great read!! I'm off to my typewriter!!!", "Star": "5.0 out of 5 stars", "Title": "So Easy to Understand"}, {"Upvote": 0, "Review": "Great addition to the Cat series. Love the beat sheets!", "Star": "5.0 out of 5 stars", "Title": "Great addition"}, {"Upvote": 0, "Review": " Just WOW!! As an author I've read and studied the original \"Save the Cat\" book a TON, but this version specifically for novelists is INCREDIBLE!! It blew me away and I couldn't put it down! Jessica Brody's writing style is so fun and easy to read and she takes all of Blake Snyder's beats and tips to a whole other level! She elaborates so much more, applying everything to novel-writing, and I also so appreciated the super-detailed Beat Sheets for 10 very diverse best-selling novels. This was seriously the most comprehensive, engaging & applicable book on novel writing I've read to date! It's something that has already helped me improve my current WIP and helped me outline book 2! With how much information is packed in here, I will be pouring over it again and again and using it as my novel-crafting-manual from here on out.", "Star": "5.0 out of 5 stars", "Title": "Most comprehensive, engaging & applicable book on novel writing I've ever read!"}, {"Upvote": 0, "Review": "I think this is the best writing book I’ve ever read. It really delves into story structure and made me rethink my own plot. I ended up restructuring the second half of my story. It’s so true that it doesn’t matter if you’re a plotter or pantser, at some point you’re book needs structure and Save the Cat will definitely help you with it :)", "Star": "5.0 out of 5 stars", "Title": "Every writer should read this book"}, {"Upvote": "5", "Review": "If you're a new novelist or NaNoWriMoer looking for a single book to help you write your novel, this is the one. Even pantsers will find the structure presented in this book to be extremely useful.The original \"Save the Cat\" beat sheet for screenwriting has been widely used by writers of all kinds for years, so when I saw that Jessica Brody was writing a \"Save the Cat\" for novelists, I pre-ordered it immediately. I was not disappointed. \"Save the Cat! Writes a Novel\" broke down each \"beat\" with clarity and an easy-going writing style that made it fun to read as well as useful. Each beat was easy to understand, and her method of breaking the structure down makes it possible to absorb the book in smaller chunks if you don't have time to read it in one sitting. I already find myself going back to read over different sections, and I find new, helpful tidbits each time.I have only read through this book completely once, but it has already helped me identify flaws in my current novel that I couldn't quite put my finger on before. Its format makes it easy to use and refer back to while writing. This book will have a permanent place on my work desk.The only con is that the print edition isn't the highest quality. The print is very light in places and difficult to read in low light. This might be a flaw with my copy, but it's worth mentioning for anyone who wears glasses or has other visual disabilities. I might purchase the Kindle edition as well since text size and print quality won't be an issue in an e-book.", "Star": "5.0 out of 5 stars", "Title": "Every new novelist should begin their learning process with this book."}, {"Upvote": 0, "Review": "I've been a fan of Blake Snyder's Save The Cat books. The author of this one does a great job of filling in some of the details the others don't focus on. She appears to have a background in teaching Save The Cat classes and I think her experience teaching the classes helped make this book that much better. Five stars from me!", "Star": "5.0 out of 5 stars", "Title": "Among the best of the Save The Cat Books"}, {"Upvote": "11", "Review": "While this book takes on the formula of Save the Cat from the screenwriting books it still has a very different soul. I've used the Save the Cat method to write my books for years, and was thrilled when I learned this book was coming. I read it all in one sitting, and despite many books built with the same 15 beats, I still managed to tag the thing to oblivion with new pieces of information that will make my novels better. Ms. Brody takes the tried and true methods and adapts them for the novelist. I will keep this on my desk and consult it before starting every single one of my books in the future.", "Star": "5.0 out of 5 stars", "Title": "Finally, Save the Cat Fits My Books"}, {"Upvote": "7", "Review": "I've been using Blake Snyder's Save the Cat! model for years in my written stories. As others have said, it adapts extremely well from screenplay to novel writing. I've seen a substantial improvement in my novels since I read the original Save the Cat! book.Jessica Brody has (in cooperation with Snyder's publisher) made an outstanding edition of this for novelists. I was pleasantly surprised to find many new insights that had not occurred to me. I am quite convinced it will help me further.If you are unfamiliar with the Save the Cat! method, get this book!  If you are familiar, it is still worth it, for those new insights and more directly novel-oriented approach.As a long-time pantser (one who writes by the seat-of-the-pants instead of using a preplanned structure,) I was skeptical of the model. Yet I found it helped me to understand where I was going with my story, even when I didn't know where I was going in a scene. I no longer consider myself a panster, partly because this method has helped me comprehend my creative flow well enough to write with that flow inside the structure I have planned.I've also combined a beat sheet based on Snyder's Save the Cat! book with one based on Randy Ingermanson's Snowflake Method, which I've put together in Scrivener. I look forward to updating that with the new insights from Jessica Brody.All in all, this is a book that every novelist of every genre and skill level should read.", "Star": "5.0 out of 5 stars", "Title": "Outstanding Edition for Novelists"}, {"Upvote": "2", "Review": "I'm only a fraction of the way into it, and I'm already finding SO many amazing tips to help make my novel better, I LOVE it!!", "Star": "5.0 out of 5 stars", "Title": "Every writer needs this book!"}, {"Upvote": "6", "Review": "I've read the original Save the Cat!, Save the Cat! Goes to the Movies, and Save the Cat! Strikes Back, and--even though they are geared toward screenwriters and I'm a novelist--they were the best books on story structure I'd ever found...until now.Let me explain. As I began to plot my novel in preparation for Nanowrimo next month, I wondered: Do I need another book on the Save the Cat! method? Is there anything left to add?The answer is a resounding yes! Save the Cat! Writes a Novel not only does a woderful job of translating the Save the Cat! method to the novel format but also expands upon it, contributing elucidation as well as insights all of its own. My favorite is a concept called \"shard of glass\".So whether you're already familiar with the Save the Cat! method of story structure or it is completely new to you, I highly recomend Save the Cat! Writes a Novel. It is indeed \"The Last Book on Novel Writing You'll Ever Need\"!I also recommend the Audible audiobook version. The author does a wonderful job narrating. I have purchased and am learning from the book in both formats, and I am so stoked to get my novel plotted and outlined, put fingers to keyboard, and kill it in this year's Nanowrimo challenge!", "Star": "5.0 out of 5 stars", "Title": "The ultimate Save the Cat!, truly \"The Last Book on Novel Writing You'll Ever Need\""}, {"Upvote": 0, "Review": "I love \"Save the Cat\" as a story writing methodology. Jessica Brody's book narrows in on the brilliance of that strategy and puts it into such an easy to follow structure for writing a novel. Every author will want a copy of this book.", "Star": "5.0 out of 5 stars", "Title": "The book every writer needs to have in their library!"}, {"Upvote": "2", "Review": "I'm a full-time writer and I've always dreading the plotting of my books. My process is chaotic and I never work well within the confines of too much structure. Enter: Save the Cat! Jess Brody has written about about organizing your writing that works for a 'pantser' like me. Her beat sheets work perfectly, offering a way to plan without feeling bogged down. She uses wonderful examples for each type of plot. Bonus - her voice is funny, engaging, and I felt like a had a friend cheering me on as I plotted out my next book.", "Star": "5.0 out of 5 stars", "Title": "I hate outlining, this book is amazing!"}], "Star": "5.0 out of 5 stars", "Name": "Save the Cat! Writes a Novel: The Last Book On Novel Writing You'll Ever Need", "Format": "Format: Paperback", "Price": "$10.99", "Author": "Jessica Brody"}