{"Name": "The Forbidden Door: A Jane Hawk Novel", "Author": "Dean Koontz", "Price": "$18.30", "Format": "Format: Hardcover", "Star": "4.5 out of 5 stars", "Comment": [{"Review": "This series is a bloated monstrosity, it's  like the author has run amok with no editor daring to rein him in due to his notoriety. All the books need to be read in order as one begins where the last book ended. At least this book doesn't have embellished side plots that go nowhere. It's nonstop action where Jane is rushing to Travis, her 5 year old son, before the Arcadians find him. The story ping pongs between the Arcadians, Jane, Travis, and her in-laws.  My biggest complaint is the Arcadians hunting them are nuts and it's hard to believe that they have been successful infiltrating government organizations to further their cause of taking over the world. They are such loose cannons that they should be taken out by their own people for jeopardizing the mission and should have been at the top of the Arcadian's List to be eliminated. By now with this fourth book, it was depressing to continually read about the Arcadians using their nano machine brain implant on innocent people, ruining their lives.  This series has been drawn out way too long . The author really gets his kicks writing about the sadistic ways you can dehumanize, torture and kill people in the worst way turning family members against each other in a killing frenzy.  I hope the next book is the last one. I'm only reading this never ending story because I want to know how Koontz is going to wrap it up.  Better than the last novel , it is a compelling read hence the four stars. I said I would bail if there was a fifth book, but I'm hoping the end is in sight so am sticking with it for now.", "Upvote": "21", "Title": "Terminator Jane", "Star": "4.0 out of 5 stars", "positivity": 1}, {"Review": "I've been reading Dean Koontz's books since Lightning was published in 1988.  If you haven't read it, give it a try.  You won't be disappointed.  What I love about his style of writing is he's like a literary juggler--he always has several genres up in the air when he's telling a tale.  You get horror, suspense, humor and human emotions all in one book because, seriously, that's how real life is.  He tells a riveting story while making you fall in love with the main character and detest the villains.  The Jane Hawk series is wonderful.  In this fourth book, Jane is still up against the Techno Arcadians and she still hasn't gotten to the head of the snake yet.  Cut off the head and the body dies.  This book has her racing against time to rescue her five-year-old son, Travis, before the Techno Arcadians can get to him.  The agents of that evil organization, some of whom are certifiably insane, commit numerous atrocities while trying to run Jane down.  I really couldn't take any more innocent people being injected with their vile nanotechnology serum.  I can't wait until Jane finally locates their leader and punishes him/her for all the misery the Techno Arcadians have caused.  I enjoyed the fact that there is a growing community of good guys in the series now, and they're taking action to stop the bad guys.  I loved the following characters: Travis, Jane's little boy.  Bernie Riggowitz, the Auschwitz survivor.  Cornell Jasperson, app inventor with a touch of autism and Luther Tillman, ex-cop and freedom fighter.  Go, Jane!  I can't wait for book 5, The Night Window, coming in May 2019!", "Upvote": "10", "Title": "A mixture of horror, suspense, humor and pathos...Koontz at his best!", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "This book picks up where The Crooked Staircase left off. Jane is racing to get her 5 year old son Travis out of danger. The people who are after her are closing in on Travis. They know she will do anything to keep him safe. Jane and Travis have lost so much.Will Jane get there in time? If she manages to get him will she be able to keep him safe?I love Jane! She is strong and fights for what/who she believes in.I cannot wait for the next book in this series!", "Upvote": "7", "Title": "Jane Hawk is one of my favorite female characters!", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "This one wasn't as good as the first three in this series.  Thought the story was going to end, but evidently, there is another installment.  Maybe more?Koontz wondered away from the story several times in the first half, to meander through the minds of some of the TechonoArcadians.  Didn't really move the story along and hard to get through.  If I wasn't a die hard fan, might have stopped reading.  The second half picked up somewhat.", "Upvote": "5", "Title": "Not his best", "Star": "3.0 out of 5 stars", "positivity": 0}, {"Review": "I have read everything Dean Koontz has ever published and loved every single book, until this series.  Even the main character, Jane Hawk, is very under developed.  Most of the story is taken up by the convoluted conspiracy that meanders without really having a point.  Her relationship with those closest to her lacks any depth or emotion, and there never comes a time when you find yourself swept away into the story.  I know we have one more to endure, but then I genuinely hope Mr. Koontz gets back to writing about characters that you feel like you know from the first few pages. I would like to know the backstory behind this series.  Does the author even like these books?", "Upvote": "4", "Title": "Very disappointing", "Star": "2.0 out of 5 stars", "positivity": 0}, {"Review": "Dean Koontz has always had a special ability to make insightful commentary on the world around us with his fictive dream. Odd Thomas was my favorite series of all time-and Koontz my favorite author. At first I was disappointed that this series was not another Odd Thomas-styled novel. However, the more I read, the more I recognized truth in the words. His characters--some more than others--have depth, and even humor in a horrible situation. In this series, especially The Forbidden Door, Koontz has taken more liberties with his antagonists and dared to make them humorous, dared to give them more word time and personality so that when they are thwarted we are entertained.  I hesitated to purchase this latest novel because of what was said in poor reviews. I'm so very glad I went with my gut.", "Upvote": "7", "Title": "Digging Deeper", "Star": "5.0 out of 5 stars", "positivity": 1}]}