{"Comment": [{"Upvote": "2", "Review": "It has been a while since I have found a book that I wanted to read slowly so that I could soak in every detail in hopes that the last page seems to never come.When reading the synopsis of this novel, I never imagined that I would feel so connected to a book where one of the main characters is blind and the other a brilliant young German orphan who was chosen to attend a brutal military academy under Hitler's power using his innate engineering skills.This novel was so much more than the above states.  The idiosyncrasies of each individual character are so well defined and expressed in such ways that come across the page almost lyrically.  I was invited into the pages and could not only imagine the atmosphere, but all of my senses were collectively enticed from the very first page until the last.I was so amazed with the way that the author was able to heighten all my senses in a way that I felt like I knew what it was like to be blind.  In most well-written books you get of a sense of what the characters look like and follow them throughout the book almost as if you are on a voyage, but with this novel, I could imagine what it was like to be in Marie-Laure's shoes.  The descriptives were so beautifully intricate that I could imagine the atmosphere through touch and sound.  It was amazing, really.There were so many different aspects of the book that are lived out in separate moments and in different countries that find a way to unite in the end.  What impressed me most was that I could have never predicted the outcome.  It was as though all cliches were off the table and real life was set in motion.  Life outside of books can be very messy and the author stayed true to life but in a magical and symbolic way.I have said in other reviews that just when I think that I have read my last book centered around the Second World War, another seems to pop up.  I should emphasize that this book created an image of war in a way that I have never imagined before.  I truly got a sense of what it must have been like for children who lived a happy life and then suddenly were on curfew and barely had food to eat.  It also showed the side of young children who are basically brainwashed by Nazi leaders and made into animals who seem to make choices that they normally wouldn't in order to survive.  And by survive, I mean dodging severe abuse by their own colleagues.This book may haunt me for some time.  I can't express enough how beautifully written the pages are.  I highly recommend this read as it is my favorite so far for 2014.", "Star": "5.0 out of 5 stars", "Title": "The light within"}, {"Upvote": "30", "Review": "Tough to review. There's no doubt this is a fantastic book. Beautifully written, palpable characters, fantastic backdrop. I can see why it's recieved so many accolades.But all that said, I didn't find it enjoyable to read.It took a while to figure out why. Even while reading it I'm thinking to myself \"This is so good\", but at the same time wondering why I'm bored and looking forward to the next book.Finally I think I nailed it. Nothing really happens. It's all set in amongst the background of a lot happening, but other than hearing about it, there's not much that really goes on with the characters that so much time has been spent making us love.This feels like all the parts of a fantastic book that happen BETWEEN the major plot points.I spent the majority of this book waiting for something to happen, and when it doesn't it feels like there no payoff for the time invested in these characters.Maybe this is what literary fiction is about. I can see why people may like it. It's life through the eyes of others.But books are a form of entertainment. This wasn't entertaining to me, and I couldn't wait to start a new book.", "Star": "3.0 out of 5 stars", "Title": "There's no doubt this is a fantastic book. Beautifully written"}, {"Upvote": "65", "Review": "The writer is obviously a very talented storyteller who devoted a considerable period of time to writing this novel (10 years). It is quite vivid in detail. Those who like literary fiction will enjoy it immensely. Those who like a story that is plot-driven, not so much. I kept reading, because I wanted to see it to the end, but at any time, I could have put this book down. I kept checking to see how many pages I had left to wade through. Not a good sign. I never really connected to the characters, particularly Werner, who played his one string of homesickness for all it was worth. I think the story would have worked much better if it had been arranged in chronological order. All the flashbacks at the beginning were distracting. Frankly--irritating--particularly when they occurred during a \"present\" scene, when the reader was quite unwilling dragged away from the action for a lengthy flashback. The flashbacks were also confusing (time-wise), since the book was written entirely in present tense. Dates were posted before the chapters, but they were hard to keep in mind when everything was happening right now. One last word on detail before closing. This book is RICH in detail. The problem, for me--and you may come away with an entirely different take on this--reviews are only opinions, after all--was finding a detail that would stick with me. The story was just too busy--noisy--for me to pick up something that resonated personally. If you boil away all the detail, what are you left with here? A somewhat improbable, and disappointedly brief, intersection in the lives of two persons that apparently had no lasting effect on either. I need more from a story than that to enjoy it. But other readers will come away with an entirely different experience.", "Star": "3.0 out of 5 stars", "Title": "Rich in detail. Perhaps a tad too rich."}, {"Upvote": "19", "Review": "I cannot recommend this book highly enough! It has quickly become one of my absolute favorite books...it's truly captivating and well written.Call me old-fashioned, but I used to love browsing bookstores in person, and the rise of the internet has made it all too easy to find and purchase subpar (albeit popular) books. There are so many entertainment alternatives that many truly great stories go under the radar...until it's announced that they'll be made into a movie (in fact, many read like screenplays, as if the author anticipates that's where the paycheck is). And yes, the characters and the interwoven storyline and the dramatic WWII backdrop could make for a blockbuster hit.But. This is a book you really should read, and relish. (I read this on my kindle and hid the progress percentage because I didn't want it to end.) Doerr writes with absolutely beautiful imagery. It's emotional and vivid and earnest. A wonderful reminder that books were written to provide a unique insight into how others think, and feel, and live, and love.", "Star": "5.0 out of 5 stars", "Title": "A must read!"}, {"Upvote": "20", "Review": "All the Light We Cannot See takes place during WWII in France and Germany.  One protagonist is a young, blind girl who travels with her father to a small village to stay with a relative after the German soldiers invade Paris.  The father carries with him a precious stone which belongs to his employer, a museum.  This stone is sought by a German officer, and he does all he can to find it.  The other lead character is a young German orphan who lives with his sister in a small mining town in an orphanage.  Through a series of events, it is discovered that he a talented mathematician who understands electronics,  He is sent to a school to be trained as a soldier, but because of his gifts, he becomes a radioman.  The insanity and horrors of war are visited upon all the characters in this book.  It was a sad read but a good one.", "Star": "5.0 out of 5 stars", "Title": "It was a sad read but a good one"}, {"Upvote": "6", "Review": "I find this review a bit difficult to write because honestly, I don’t know where to start!  All the Light We Cannot See is like no other book that I’ve read before. On its surface, this book is about a young German boy with a talent for fixing radios and a blind French girl who possesses a curiosity and courage way beyond her years – both thrown helplessly into a world torn apart by war and devastation and the impact this has on their lives. But this book is so much more than that! It is about survival, love, courage, family, friendship, etc but on a deeper level, it is also a \"study\" on human nature and what it means to \"do what is expected\" versus \"do what is right.\"The author Anthony Doerr has a masterful way with words – the richness in detail with which he describes every character / event / scene in the book paints a vivid picture of what life was like in the midst of war, yet he does so in a manner that does not take away from the story itself. He does not bog the story down with long, tedious paragraphs or pages and pages of detailed description that make readers like me want to just skip ahead to the actual story and not bother with the details. Instead, he uses brevity as a powerful tool – in just a few words, short phrases, sometimes not even complete sentences, he is able to bring to life not only his characters and the situations they encounter, but also draw the reader into their world to experience it for ourselves. As I was reading, I actually felt like I was being transported back to that time period (mid 1930s to 1940s), walking alongside the characters, seeing what they were seeing, feeling what they were feeling. The atrocities of war described in the book were very harsh and very real, despite this being a work of fiction. I actually winced during some of the parts where an atrocity was being described and had to set the book aside for a few minutes to calm myself. I’ve read other books in the past about his time period, about World War II and the atrocities of war, but none of those books had the impact this one did. Thinking about it now, I realize why: those books either use WWII merely as a backdrop without going into much detail or if they do, the events are portrayed in a way that makes it feel like a story or a recounting of history – as a reader, you are told what happened during that time period but don’t really feel a connection to it. This book, in its uniqueness, actually makes you LIVE that history rather than just read about it.The other unique aspect to this book was the storyline involving the cursed stone, which brought an unexpected element of suspense that still blended in perfectly with the rest of the story. In the hands of a less capable author, incorporating this part of the story might ruin the book entirely, but with Doerr, this is definitely not the case – he is consistent with the details as well as the storytelling and incorporates this arc seamlessly throughout the book. I found myself at the edge of my seat at certain points wanting to find out what happens next -- whether the stone would be found, whether certain characters would get caught, etc. I enjoyed this part of the book immensely!My only “complaint” about this book would be in its structure, as the story is told in different timeframes and switches back and forth after every couple chapters. This interrupted the flow a bit and did slow me down at times when reading, since I had to go back and re-read certain parts in order to remember where the previous timeframe left off. It also caused a little bit of confusion for me initially with some of the characters who were already part of the story when the book opens but then are introduced for the first time when things switch back to the earlier timeframe, then it picks up with what happens to that character from the later timeframe when it switches again. Not a show-stopper by any means of course, but I think the book would’ve been easier to get through if it didn’t switch back and forth. I'm pretty sure there was significance to structuring the book this way but unfortunately it was lost on me.Despite this long review that I just wrote, I actually don’t feel like I did this book any justice. In fact, no review can do this book much justice because it is a book that can’t just be “described” -- you basically have to read and experience it for yourself. For me personally, I loved this book and I know this is a story that will stay with me for a long time to come. I can totally see why this book won a Pulitzer Prize – absolutely well-deserved!(Read in January 2017)", "Star": "5.0 out of 5 stars", "Title": "One of my favorite reads this year!"}, {"Upvote": "8", "Review": "I was encouraged by several friends who loved this book to give it a read. I’m in 100 pages and it’s hitting the donate pile. Slow read. Short segments are nice though so I don’t feel rushed to finish a chapter. Sadly can’t get into this book, I had very high hopes for it.", "Star": "1.0 out of 5 stars", "Title": "Slowwwww"}, {"Upvote": "10", "Review": "I read this book because of all the rave reviews.  I was very disappointed in it.  I never became engaged in either of the main characters or in the story itself.  The writing is beautiful, but I felt I only knew what the characters did, not who they were.  He never described their thoughts or feeling to any great extent.  This was not helped by the author's writing one short chapter on Marie-Laure and the next short chapter on Werner, so you never really get into either one before switching to the other.  This is compounded by switching frequently to different points in time.  Eventually I realized I was totally not invested and stopped reading it.", "Star": "2.0 out of 5 stars", "Title": "DISAPPOINTED"}, {"Upvote": "6", "Review": "Minimal Spoiler Alert: The author's unique style and strong writing skills are very evident throughout the reading. However, the plot and closure were lacking. After the first half of the book, it was fairly predictable how the two main characters would eventually connect and be affected by one another. Another disappointingly predictable moment at the end reminded me of Titanic (Heart/Jewel of the Sea). I was looking for a book that would evoke strong feelings, but this book fell far short of what I was anticipating. Perhaps because I recently completed reading The Nightingale by Kristin Hannah (Amazing read!), I clearly had high expectations for a connection with characters and strong feelings  while reading All The Light We Cannot See. If you are an avid reader, then I recommend the book for you. However, if you are a selective reader who expects deep connections and a relationship with a text, you may want to consider selecting a different book.", "Star": "3.0 out of 5 stars", "Title": "Cleverly written but predictable plot"}, {"Upvote": "3", "Review": "As many here have already acknowledged - from a literary perspective, this is a beautifully written book.  The writer is very gifted at using words to paint elaborately detailed word-images of what is going on in his story.  It is through these carefully crafted word-images that Doerr draws his reader in and I suspect that it is this use of word imagery and his ability to make his readers \"see\" what he is trying to convey that those who gave the book five stars identity with.What Mr. Doerr is not so adept at, and I would go so far as to say where he, or at least where the book fails (more on this in a moment) is storytelling, particularly in the areas of giving the book a well-defined plot, characters that the reader can identify with and care about, and a storyline that draws the reader in, making them want to read on to see what happens next.From the way the book is written, it is impossible to tell if it had all of these qualities which were then lost during the editing process or if they were never there to begin with.Earlier I mentioned that either Mr. Doerr or the book failed. Let me elaborate.First of all the book is written in very short chapters. I almost hesitate to use the term \"chapter\" since most consist of only three or so pages. This is barely enough for the reader to get a full grasp of what is going on in the chapter before they are whisked away to another character and often an entirely different time-period. This constant whipsawing from subject to subject, character to character, and time period to time period does not make for enjoyable reading.  Tiresome and confusing might be better words.This approach also makes it virtually impossible for us to identify with the characters at any meaningful level much less empathize with their situation.Perhaps the most annoying aspect in all of this is the way the author jumps back and forth in time period.  Now I think that a certain amount of time-shifting in a book is fine, say if a character is thinking back to a previous time in their lives or to recall earlier events in the plot, but only if it adds to the storyline. But Doerr shifts from year to year for no apparent reason that couldn't have been accomplished had the events been presented chronologically.It almost appears as though Doerr wrote the book in chronological order and then either he or an editor came along and said \"ok, now we're going to tear this into tiny pieces and reshuffle the chronology\".  The result is a book that is fragmented, difficult to follow and while incredibly well written and is visually impressive, doesn't flow and impossible to extricate any sort of plot from.  I wanted so to identify with these characters & empathize with their situation, but this hackneyed approach made it very difficult to do so.I found myself confused and flipping back and forth in an attempt to try and sync my understanding of the story with the timeframe and where the characters fit into both.Again, none of this did anything for my reading enjoyment & pleasure and, after all the whole reason I read fiction is for enjoyment.The other aspect of this book that is aggravating is the plot, or perhaps I should say the lack of one.  I think that maybe there is one hiding in there somewhere. The potential certainly exists, but it's difficult to see it amidst all the fragments and the only real evidence we see of one existing is in the last 60 or so pages.And then there is what one might call a \"plot anomaly\", that being the mysterious jewel.  Throughout the entire book the reader is led down a path centered around a jewel having unusual & mysterious qualities. In the end nothing comes of it - at all.  So why bother to include this element in the story? It adds nothing to the overall plot.The end of the book left me feeling let down & empty.While beautifully written & visually impressive, a book that provides the reader with great literary writing but fails to deliver on a cohesive storyline, plot and characters the reader can identify with, I can't reasonably recommend this book to anyone.", "Star": "3.0 out of 5 stars", "Title": "Beautifully written, fragmented, story without a cohesive plot"}, {"Upvote": "59", "Review": "Mr. Doerr, much lauded for this work, is clearly a brilliant writer who crafts an exquisite plot, finely detailed characters, and vivid atmosphere that engaged my mind and sense of wonder on many levels. But I felt saddened when, in the last 50 pages, as the tears welled up behind my eyes, the writing didn’t carry me into the emotional realms I’d been waiting for for more than 500 pages. Perhaps it’s because I was reading this book as I wandered the real Normandy Beaches and deeply affecting grave sites where the actual conflict took place, and as I explored the stubborn little walled city of St. Malo that provides the denouement locale for this work. Mr. Doerr brilliantly details the mental carnage of this World War II tale of valiant children on either side of the horrific conflict. But when at last we reach the moment when insight might have seared my reader’s heart like a branding iron and given me hope for facing my own demons, my tears stalled and my mind wandered. I longed for a final 50 pages where we learn the insights of a puzzled heart unlocked through anguish, pain, and finally empathy--the insights that forged a human connection against all odds. I would recommend reading this book certainly. I just wished for illumination as in the movie “The Natural,” where the tragically-thwarted main character, broken but not defeated, his mission clear and synthesized, hits a home run through the lights, not just for himself, but for us all.", "Star": "4.0 out of 5 stars", "Title": "Exquisite Work with Muted Pay-off"}, {"Upvote": "3", "Review": "I liked this story, it wasn't my favorite because it was difficult for me to really get into the story line but it was an interesting read. I thought it was interesting because it brought up the story of a girl who is bling during WWII, that's not a perspective we usually hear about. I really enjoyed her journey and how the author connected the two stories. It was hard to remember that Werner was a Nazi, the author brought in yet another perspective on WWII from Germany's side. Werner wanted to learn and grow his talents and the only way he would have that opportunity was to go to the military school. While he hated doing a lot of what was asked he knew there was nothing better waiting for him. I think some authors depict WWII as one sided but seeing Wener's point of view was interesting. I like how the author expanded the story to tell what happens after. I always love when they do that.", "Star": "4.0 out of 5 stars", "Title": "Interesting Read and Storyline"}, {"Upvote": "5", "Review": "I really liked the set up of this novel. Mr. Doerr can use words like artists can use colors on the canvas before them. There is no doubt he is a master of coaxing feelings from colorful descriptions of settings. The scenes almost move before the readers' eyes.  I enjoyed discerning \" which light \" he is talking about we cannot see. Is it the light that never reaches our young blind girl or is it the wavelengths of the electromagnetic spectrum our vision is not sensitive to or the wavelengths of radio waves that carried messages through the air to the resistance? I guess in the end I believe it is up to me and I choose all. So why 4  stars and not 5? I think it is because I am a bit of a coward when it comes to facing this era in our world's history . The extreme evil that permeates that time, I think I always have wanted to turn away from it. I just don't want to think about it long. It is too horrible. So, when I get the opportunity to read novels of this era, I tend to back away and avoid them. That is on me. Mr. Doerr's novel is filled with so much finesse and beautiful descriptions I kept waiting a for a uplifting ending, some victory or conquering love story. Instead the novel seemed like life - a few good moments in a long grind. I normally don't do this, but I want to describe one small aspect of the novel I felt fell short on what could have been. There was a scene where Marie- Laure is teeing up a record of Clare de Lune to play over the air waves in a most desperate moment. Maybe he did achieve this but, it seems he could have ( using his wonderful crafting of words) given the music \" sound\" that fell on many people on all sides of this terrible war at the same moment. It would have provided a brief moment in time where all the chaos would stop and all the characters would pass by the readers' eye. We could  have a vision of all the inhumanity at once being overridden by a song of beauty. All in all, I think this will be a novel that haunts me, revisiting my mind's eye many times in the coming days and eventually wishing I had given it 5 strong stars. This novel is life at its harshest and most loving moments. It tortures the heart to find hope in the dark and grace in the light.", "Star": "4.0 out of 5 stars", "Title": "Not really understanding why I'm giving 4 instead of 5 stars"}, {"Upvote": "22", "Review": "I thought this book would be a no brainer.  10,000+ reviews on Amazon with an overall 4.5 star rating.  Unfortunately it didn't work for me.My main complaints:(1) author was overly wordy - this book could have been half the length it is(2) slow moving story.  the book is divided into multiple quick chapters that alternate between characters, but it still drags(3) terribly disappointing ending.  I won't spoil it for you, but I felt let down when I reached the end.I seem to only review books on Amazon that I either loved or hated.  Unfortunately, this one seems to fall in the latter", "Star": "2.0 out of 5 stars", "Title": "Maybe my expectations were too high?"}, {"Upvote": "2", "Review": "I have just finished this book, three years after it was published and am rereading it. I will now write my own review, hoping not to duplicate any of the 26,000-plus other reviews. I am pleased to learn that the book has been optioned for a film project by 20th Century Fox.Rather than rehash the plot, which has been adequately covered, I thought I'd reply to a few criticisms of the book.Some reviews by Amazon customers have complained about the difficulty of comprehending the various cuts back and forth in short flashbacks. On the contrary, I found this method fascinating and not difficult to follow. They demonstrate beautifully how the lives of the various characters gradually become interwoven.Others have said that the ending let them down. Without throwing in a spoiler here, I think that the private thoughts of the aging Marie-Laure (86 years) reflecting on how the war warped the lives of all with whom she came in contact, but somehow it has given a few a sense of purpose was all the denouement we need. It showed how the world outside goes on as if nothing had happened--people rushing to a from shops, between home and work.Finally, I want to respond to what I feel was an  unduly harsh review in the New Republic, the main thrust of which was that the book was overly sentimental and tried to \"normalize\" Nazi barbarity by some kind of moral equivalence where the Allied bombing of St. Malo was said to counterbalance Nazi atrocities.I can't see this at all. The book's tone is very matter-of-fact, hardly sentimental at all. There is no indication that the author meant to imply that the Allied bombing was as cruel as the deliberate Nazi crimes against civil society.Werner, the German boy, is a victim of the war. He wanted only to pursue science in the hope of bettering his world. Unlike some of the Hitler Youth and Waffen SS that volunteered inspired by Nazi super-race propaganda. He shows Werner repulsed by this mentality, cowed into doing nothing to oppose it and in the end, regretting his failure of nerve, in contrast to Marie Laure. He can't accept his belated assistance to her as atoning for his earlier inaction---that is the light that HE cannot see, but which the blind Marie Laure can.This book has moved me deeply and gave me a new window on the well-trod Second World War themes.", "Star": "5.0 out of 5 stars", "Title": "The Sighted Led by the Blind"}, {"Upvote": "6", "Review": "I don't even know how to express how excellent that is the writing style of this book.  It is obvious to me that Doerr worked over the manuscript over and over again, perfecting it along with the editors.  The writing itself is one of those classics that to me comes across as poetic.  Sometimes I would read a few lines and then just sigh and reread them with great appreciation.  He is masterful with the english language.  This is more than just your typical novel.  It deserves any and probably more awards than it gets.I was also apprehensive because it is a WWII book.  I didn't want another Saving Private Ryan-type story.  It was nothing like that.  It was nothing like anything I've ever read, which is saying something.  Somehow he brings out the inherent innocence in all of us, and the desire to maintain that innocence and purity in all of life.Highly recommended.  Two separate people recommended this to me and I will recommend as the best book I have read in a long, long time.  Including classics.  Nice work Mr. Doerr!", "Star": "5.0 out of 5 stars", "Title": "There are no words that will show this book the appreciation it deserves"}, {"Upvote": "3", "Review": "Want to write masterfully? Read masterful writing. For example, open a Doerr—something written by Anthony Doerr, that is. His \"All the Light We Cannot See\" is the opposite of a page turner. What would you call that … a page lingerer, maybe? As I read this story, over and over I set aside my curiosity about what happens next to slow down, reread, and savor the language.For one thing, Doerr’s verbs nail the action in arresting ways. Bombers “shed” altitude. Pigeons “cataract” down a cathedral spire and “wheel out” over the sea. Teacups “drift” off shelves, and paintings “slip” off nails. Dread “trundles” up from the blind girl’s gut. Car horns “bleat.” Snowflakes “tick and patter” through trees.This prose begs to be read aloud or at least heard by your inner ear. Consider these snippets:“…the low moonlit lumps of islands ranged along the horizon.” (Oh, the consonance—all those lush l’s, not to mention the two soft m’s woven in: “moonlit lumps”!)“…the last unevacuated townspeople wake, groan, sigh. Spinsters, prostitutes, men over sixty. Procrastinators, collaborators, disbelievers, drunks. Nuns of every order. The poor. The stubborn. The blind.” (Oh, the rhythm—you can practically see the conductor’s baton twitching to the beat of “wake, groan, sigh.” My toe is tapping at the next line: “Spinsters, prostitutes, men over sixty.” I’m clapping along as if to a jumprope chant by the time we get to “Procrastinators, collaborators, disbelievers, drunks. Nuns of very order…”)”…each storm drain, park bench, and hydrant…” (Each DAAH-dum, DAAH-dum, and DA-dum!)“Cold fog hangs in the budding trees.” (Each of the first three words—“Cold” and “fog” and “hangs”—takes a full beat, slowing the sentence down, defying forward movement. It’s as if these three words themselves are hanging there—BOM BOM BOM—in the budding trees.)No wonder this novel took me so long to read. I read it for the poetry.Whether or not you read for this singular kind of pleasure, you’ll find this story a timely reminder of humanity during a time of inhumanity.And you’ll write more masterfully for reading it.", "Star": "5.0 out of 5 stars", "Title": "Reading this novel will make you a better writer"}], "Star": "4.6 out of 5 stars", "Name": "All the Light We Cannot See: A Novel", "Format": "Format: Paperback", "Price": "$13.60", "Author": "Anthony Doerr"}