{"Comment": [{"Upvote": "96", "Review": "4.5 starsFiona Davis’s new novel focuses on The Dakota in New York City.  The title is cleverly drawn from a review of the building following its opening in 1885 in which the reviewer stated that “the Dakota will undoubtedly be known as ‘The Address’ of New York’s West Side.”  Davis melds historical events with a spectacular tale of greed, passion, love and sacrifice told in a dual timeline format alternating between the mid-1880’s and 1985.  While I enjoyed both stories, I preferred Bailey’s in 1985 because I found poor Sara’s story so sad.  The ending of The Address was spectacular because Davis cleverly connects the two tales and includes a surprise I never saw coming.  It was perfect.My favorite part of the book was the inclusion of so much historical detail regarding The Dakota.  It is fascinating to me that the walls are stuffed with thick horsehair and the space between each floor contains three feet of mud.  Davis explains why each apartment is shaped differently, and the complex effort it took to accomplish that feat.  She also mentions the ghosts that reside there, and the numerous famous people that lived there over The Dakota’s life.  She includes so many more fabulous stories and descriptions, but I do not have enough time nor space to include them all.  Her Author’s Note at the end was welcome as she explained the events she altered a bit for the sake of her story.  I always appreciate when an author takes the time to elaborate on his or her inspiration and to clarify purposeful historical inaccuracies.The Address is a superb read.  I look forward to my next trip to New York City when I plan to walk by The Dakota and pay attention in person to the many details I learned while reading this wonderful book.", "Star": "5.0 out of 5 stars", "Title": "Such a wonderful read!"}, {"Upvote": "59", "Review": "Fiona Davis’ novel THE ADDRESS tells a captivating story about life in Manhattan’s historic Dakota building. Set in the late 1800s and in the 1980s, two tales told back and forth, about the tangled web created by Theo Camden, one of the fictional architects of the building, and how the unfortunate circumstances of his involvement with the building in what was then the new frontier of the Upper West Side. Mr. Camden lured Miss Sara Smthye from her job at the London’s exclusive Langham Hotel to a new position at the soon-to-open one-of-a-kind apartment building and she took a chance on what would be an adventure that was much more than she bargained for. Flash forward to the 1980s and we read about the descendants of Mr. Camden, one legitimate and one not, who are in their own fine mess. Bailey, just out of rehab is trying to turn her life around and her ‘cousin,’ Melinda, who could use a stint of her own, or at the very least a lesson in kindness, instead she is making a design mess of the gorgeous apartment she inherited at the Dakota where her long lost grandfather once resided.There are so many juicy characters in the storyline and both eras are filled with life. Davis is a magnificent storyteller and adds much richness to both setting, intrigue, and character development. Settle in for the lively history of a bygone era and get lost in the halls and walls of this iconic building while imagining how the residents who once called it home lived.", "Star": "5.0 out of 5 stars", "Title": "who are in their own fine mess. Bailey"}, {"Upvote": "8", "Review": "I am so fortunate to have a very good friend who owns an apartment in the Dakota and therefore I have stayed there many times when visiting New York.  It's  a magical place.  Years before I'd met my Dakota friend I'd read \"Time and Again\" by Jack Finney (a must read, BTW) and had always hoped to see the inside of the building because I loved the book so.  And then several years later I ended up becoming a good friend of a long time owner of one of the largest of the existing apartments.  It has never been subdivided since the Dakota was built.  As for the book, I thought it brought to life what the Dakota is and was.  The author told an interesting tale, one that started a bit slowly for me, but tension built pretty quickly, especially in the sections where she is telling the story that takes place in the 1880s.  In the end it's a tale of love, betrayal and murder, which holds the readers interest and the suspense does build towards the climax.  A quick, enjoyable read.", "Star": "4.0 out of 5 stars", "Title": "You can get into the Dakota by reading this book...and enjoy an interesting murder mystery along the way."}, {"Upvote": "5", "Review": "I'd more accurately give this 3.5 stars, but it didn't rise to the level of a full 4. Unlike many other readers, I didn't find the mystery that engaging and the characters never got beyond cliched. The writing was more amateurish than I'd expected, so the whole thing had the feel of a hastily penned potboiler with uneven dialogue, somewhat unbelievable characters (acting in unbelievable ways), some historical people popping in (Nelly Bly) and an otherwise fairly conventional storyline that culminates in one surprise, albeit not a very interesting one.", "Star": "3.0 out of 5 stars", "Title": "Pass this address by"}, {"Upvote": "3", "Review": "Sara comes to New York from England to be the managerette ( a term I had never heard before) of the Dakota which is getting ready to open. The book spans 2 time frames, 1884 and 1985 and the stories of the 2 main characters, Sara and Bailey are intricately tied together. Bailey has been in rehab, paid for by her former employer. Melinda, her cousin, offers her a place to stay in her apartment in the Dakota and Bailey will oversee the horrific renovation that Melinda has initiated.The book is full of interesting history as it relates to the Dakota and some disturbing history as it relates to prisons in New York in the 1880's The book starts out slow but definitely picks up. My one issue is that I would have liked Melinda's twin brother Manvel's character to have been more developed in the book.It is quite fascinating at the end when the reader discovers that 2 of the characters are not at all what they seemed during the majority of the book. (think good guy/bad guy which applies to both a male and a female character)If you enjoyed \"The Dollhouse\", you will enjoy this book.", "Star": "4.0 out of 5 stars", "Title": "For fans of \"The Dollhouse\", this is a book for you"}, {"Upvote": "5", "Review": "I enjoyed this book immensely and also read her debut novel, \"The Dollhouse\". The author, Fiona Davis, writing style is quite enjoyable. I really like the way she goes back and forth between the past and the present, which she also does with \"The Dollhouse\". IF you are looking for a good story about The Dakota and 1880's NYC, read this book. And \"The Dollhouse\" which is about The Barbizon Hotel in the 1950's is also an excellent read. I honestly couldn't wait to pick up the book after work and read it each night.", "Star": "5.0 out of 5 stars", "Title": "An Excellent & Enjoyable Story"}, {"Upvote": "3", "Review": "I love historical fiction and this book delivers. The story moves back and forth between 1885 and 1985. It was an enjoyable read with a plot that made you want to figure out the mystery and connections between the generations.  I was shocked and disturbed to see how easy it was to have a woman committed to an asylum in the 1800's and to learn of treatment of people and horrible conditions found there. Women were really 2nd class citizens. Learning of the  Dakota and it's start was interesting. Also the plight of immigrants to America and life in NYC.  If you are a fan of genealogy and discovering your family history, you will enjoy this book.", "Star": "5.0 out of 5 stars", "Title": "Family, Ties that Bind"}, {"Upvote": "2", "Review": "This story goes back and forth between the late 19th century to the mid-1980s. Although the 1885 part is more melodramatic than the 1985 story, I preferred reading about that older period more than the recent one. The historical facts about the building of the Dakota and its early years is fascinating. Nineteenth century New York mesmerizes me, and this part of the tale was rich with period detail. The newer drama was fairly contemporary, but a few of the characters are astonishingly selfish and obnoxious. Not all the main characters end up well, and that aspect of this might make the story more plausible. But I felt too much time was spent on Blackwell's Island; that was unnecessary. Still, historical NYC and the Dakota provide atmospheric settings to an interesting story. All in all, a very good read!", "Star": "4.0 out of 5 stars", "Title": "Historical New York City"}, {"Upvote": "3", "Review": "Captivating historical fiction.  This story draws you in from the first chapter.  Sara is a immigrant from England who is hired as head housekeeper and then manager of the newly opened Dakota apartment house in New York City, where she soon falls in love with the Dakota's architect, and her life spirals down from there.  Very interesting for anyone who enjoys historical fiction at its finest.  Highly recommend this book.  The author's previous book, The Dollhouse, is also a great historical read!", "Star": "5.0 out of 5 stars", "Title": "Thoroughly Enjoyed"}, {"Upvote": 0, "Review": "Loved it. Just now finished it - and I'm mad with myself that I'd actually bought it in August and somehow hadn't read it (maybe *The Resurrection Of Joan Ashby by Cherise Wolas interfered). Anyway - what a good romp through the neighborhood in which I live, eighteen blocks up. I've always loved The Dakota (Time And Again by Jack Finney whetted my thirst - EVERYone should read it if they haven't. )(*AND everyone should read Joan Ashby if THEY haven't). So it's a history romance with if not actual time travel, then at least a time flip. Great details about the building we all know, love and speculate about. OK, yes, I had guessed the connection early on but I'm a frustrated detective - so sue me.Put it in a theme pile that also contains The Interestings and Marjorie Morningstar, and you'll have a wonderful time.", "Star": "5.0 out of 5 stars", "Title": "Book soup - very good, excellent soup"}, {"Upvote": "2", "Review": "I loved this rich tale of history and mystery woven together through the lens of two very different women's experiences living in the iconic Dakota apartment building in New York City. Davis's language is approachable, even when her subject is lofty--readers who enjoy architecture and NYC history will enjoy her take on one of the most famous buildings in the city, not to mention the intriguing Blackwell's Island asylum. The book even features a cameo by pioneering investigative journalist, Nelly Bly!", "Star": "4.0 out of 5 stars", "Title": "I loved this rich tale of history and mystery woven together ..."}, {"Upvote": "2", "Review": "Very good book!  It was one I couldn’t put down! I love the flipping back and forth between the women 100 years apart. I never became confused in the story line, as happens sometimes when authors do this type writing. I kept me hooked trying to figure out how the women would be connected. The ending held a surprise I never considered and was wrapped up in a way that left me fulfilled. I’m thinking about reading The Dollhouse now by the same author.", "Star": "5.0 out of 5 stars", "Title": "Good read!"}, {"Upvote": 0, "Review": "A somewhat maddening historical work of fiction. Maddening in the sense that a woman could be so naive. The book shows parallel lives a century apart of two young women at the same famous hotel address . Although I like to think that young women today are much wiser and would not be taken in by men in the same way, I can see that my age has an advantage and that young naive women will always be prey for the wolves of this world. It was good to see that education and enlightenment can save us from our innocence and perhaps keep us safe or at least help us to survive our mistakes. Good book.", "Star": "4.0 out of 5 stars", "Title": "The Address: A Novel"}], "Star": "4.4 out of 5 stars", "Name": "The Address: A Novel", "Format": "Format: Hardcover", "Price": "$15.85", "Author": "Fiona Davis"}