{"Comment": [{"Upvote": "5", "Review": "If you are looking for more sausage from Ainz in this book, you won't see it. This volume instead concentrates on developing some of the minor characters in the Overlord universe. And I found it to be quite entertaining as more information on lesser characters is something that many authors fail to include in their stories. But Kugane-sama is very good at fleshing out secondary or even tertiary characters in such a way as to really give you an excellent feel for the world that he has created. A rare talent for most authors. This merely adds more to how much I can recommend this series to others. Not to mention that I love the fact that this series is being published in a hardcover format that looks beautiful sitting on my bookshelf. My sole complaint is how far behind the Japanese releases this series is for English readers, especially since volume 12 has just been released in Japan. At least Yen On has been fairly regular in their releases of the English volumes at about one every four months, but I do wish that they would hasten their output.", "Star": "5.0 out of 5 stars", "Title": "Sebas, Climb and Gazef shine in this volume! Can't wait for volume 6!!!"}, {"Upvote": 0, "Review": "This book is primarily setup for the next book, but it's some amazing setup. This book feels like it has some serious stakes mainly by making the problem something the main characters can't simply punch to death (or at least they can't without some major consequences). It also shifts the focus more towards world building and establishing the characters that populate this world making it feel more real and lived in.This is the book where the story starts to kick into high gear and get really good", "Star": "5.0 out of 5 stars", "Title": "Best volume in the series so far"}, {"Upvote": 0, "Review": "If I'm being honest, this book in the series has me skipping a lot of pages when I re-read the series, which I do religously. The series earns a 10/10  5 star rating from me in all aspects. But I find the lack of time spent in Ainz samas shoes to be a tear filled experience. This book spends a lot of its time observing lower life forms, however if you like Sebas, he appears a lot.The physical quality of the books is amazing, I'm getting all the books in hardcopy because they just look great. Get all the books because they're great, just do it.", "Star": "5.0 out of 5 stars", "Title": "I find the lack of time spent in Ainz samas shoes to be a tear filled experience"}], "Star": "4.6 out of 5 stars", "Name": "Overlord, Vol. 5 (light novel): The Men of the Kingdom Part I", "Format": "Format: Hardcover", "Price": "$13.59", "Author": "Kugane Maruyama"}