{"Comment": [{"Upvote": "13", "Review": "Are Kira and Werner star-crossed lovers? That’s what I asked myself as I clung to each page, wanting to know. This is no ordinary love story. It’s so much more. A thrilling read that starts with an interview with a Russian hero brings the interviewer in contact with a woman. When they sit down to learn about the story behind a photo that shows a girl holding a rifle on the war front in Russia the plot moves back in time to Poland 1939. This is when Kira and Werner meet and fall in love. They are from ally nations, Russia and Germany, but with the Nazi regime’s aggression escalating and Hitler’s desire to conquer the world all peaceful bets are off and Stalin, the leader of Russia, becomes his enemy throwing the two countries into war.  During this interlude Kira and Werner continue their long distance romance and become engaged, much to Kira’s father’s dislike and forbidden orders. Once war breaks out Kira works as a translator and Werner is in the German army bound for the icy winter of Russia. When Kira gets word that her father had been shot during battle her life takes a dramatic turn. She joins up to go to the frontline to become a sniper. There is no lack of conflict and tension in this incredible read where the reader is thrust forward wondering, as Kira does, if she will end up killing the man she loves.  This is a story as much about the devastations of war as it is about the power and connection of love. It’s painfully gripping in detail and beautifully written. The level of research and factual detail of the battles, the conditions in the wintery devastating cold in Russia are brilliantly described, the Nazi’s advancements and background historical data is spot-on.  It’s a novel story in which the author places a woman on the fighting front in a time when women rarely did much in war times than supportive at home activities. Our heroine is believable and authentic as is her lover. I absolutely loved this read right down to the gut-wrenching surprising ending. Destined to be a classic!", "Star": "5.0 out of 5 stars", "Title": "Great book"}, {"Upvote": "9", "Review": "I like historical fiction, and I read a lot of it. And I read tons of World War II books. This is truly one of the best war books I've ever read. Yes, it's a beautiful and poignant love story, like many other reviewers have noted, but that's not what makes this book so amazing to me. And, while absolutely admirable, the amount of historically accurate details also isn't what I liked best.What is absolutely incredible about this book is Ellie Midwood's portrayal of the devastating effects of war on everyday people -- and that's who Werner and Kira are. They belong to different countries and to governments that are at war, and Ellie Midwood shows them as real people, both sympathetic characters, thrown into the chaos and devastation of war.They both do things that are unthinkable to us in our peaceful lives and that were unthinkable to them before the war started, yet each of them remains a human being with dignity, self-respect, and respect for others, no matter how hard the circumstances are. And their circumstances are incredibly hard. The alternating perspectives of Werner and Kira telling their side of the story make them both believable and relatable.This is one of the best books I've ever read, and I read a lot of books. You have to read this book!", "Star": "5.0 out of 5 stars", "Title": "Amazing World War II story"}, {"Upvote": "4", "Review": "Every time I pick up a book by Ellie Midwood, I know I'm in for a special treat. This woman is the queen of WWII era historical fiction for good reason--her stories resonate across the decades, filled with beautifully researched settings and compelling, unforgettable characters. Somehow, no matter what country her characters are fighting for, she manages to show humanity in all its facets--raw, beautiful, ugly and terrifying--and how love can survive against all odds. A Motherland's Daughter, A Fatherland's Son is just such a story. I found myself immediately drawn into the tale of star-crossed lovers, Kira and Werner, who meet and fall in love just prior to the war. Before they can be married, war tears them apart. Werner, a German, is sent to the front and ends up an officer. Kira, a Soviet sharpshooter, enlists as a sniper and is sent to the front as well. The horrors of war scar them both, taking them to the depths of hell, yet both cling to the memory of the love they shared in a more innocent time. I found myself completely riveted to this story, cheering for them both to survive, and to make it back to the other. I won't give away the ending but I will say it had me in tears! This book was so well done. I recommend it to all historical fiction lovers!", "Star": "5.0 out of 5 stars", "Title": "heartache and triumph"}, {"Upvote": "3", "Review": "Ms. Midwood does it again by bringing an amazing story to life. She has a way of weaving together fact and fiction pretty much seamlessly. This is one of the things that I love about her writing. This book is very well written. I love how she uses both Kira’s and Werner’s points of view to really tell a story that pulls at your emotions. I have gone from wanting to strangle the main characters to wanting to just comfort them. The roller coaster ride from one emotion to another goes quickly and takes you through multiple turns and twists. In A Motherland’s Daughter, A Fatherland’s Son you can see a portion of WWII from both the German side (Werner), and the Russian side (Kira). Ms. Midwood really did her research with this one, and in such a way that one point of view does not overshadow the other. She didn’t shy away from exposing atrocities committed by both sides. Let’s face it, war is ugly, but Ms. Midwood brings you a beautiful tale through that ugliness. I won’t lie. There are some parts even I got a little squeamish with. This is one book that is a must read for all people that have an interest in the WWII era. You will learn something different, and while much of the story is fiction, there is still quite a bit of fact thrown in. All in all, I absolutely loved this book, and I feel like this is one of her best works to date.", "Star": "5.0 out of 5 stars", "Title": "A Must Read"}, {"Upvote": "2", "Review": "I have had the pleasure of reading two of Ellie Midwood's books previously and enjoyed them thoroughly, and A Motherland's Daughter, A Fatherland's Son is no different. Reading one of her books is a total-immersion experience into life during World War II. Midwood's vast knowledge of that time period is remarkable and is a big part of what gives her stories depth: the intensity of the backdrop of a horrific war. She doesn't skimp on the details of the brutality of war, either. What she writes is gut-wrenchingly real.The second element that gives her stories amazing depth is her characters. She develops them to such a degree that I cannot help but laugh, cry, and scream with them. In this story, we follow the lives of lovers Kira and Werner, a Russian woman and a German man who fall in love in 1939 right before Germany declares war on Russia.The story is told in an alternating point-of-view style, where one chapter is told from Kira's point of view and the next chapter from Werner's. From this first-person perspective, I get into the head of the characters even more. They start out as idealistic young people, who believe in love and that they have their whole lives ahead of them to do what they wish. They will marry and be happy. The war devastates their lives, throwing them into the pile with millions of others whose lives are also being ruined by the horror of war.Can they still come out of all this after the war is through as the same people? After seeing and performing awful deeds? After experiencing some of the worst moments of humanity and their own lives? Lovers whose countries dictate they are enemies?Kira is enlisted as a sniper in the Red Army. Werner serves as a lieutenant in the Wehrmacht. The story follows the events of the war through its end in 1945 on the eastern front. It's easy to look back at history and want to blame the Germans, to mark them at the bad guys, but when you realize that many of these soldiers were just young man, pretty much boys, it breaks my heart. So much loss of life for both sides, which is clearly shown in this story. So much senseless death. It's no wonder both Kira and Werner question if they are who they were when they met, if love and hope still hold any meaning in a world shattered by such darkness.The stakes are high, ridiculously, impossibly high. I kept turning the pages because I needed to believe that the inherent goodness in people, especially Kira and Werner, would win, that victory of the Allies during the war is one thing, but getting down to the level of person-to-person, victory of the heart matters, too. Love wins, right?I happily give this book five stars!", "Star": "5.0 out of 5 stars", "Title": "A Heart-Wrenching World War II Romance"}, {"Upvote": "4", "Review": "🌟🌟🌟🌟🌟As though love and war aren't enough, imagine being on the opposing side fighting against the man you love! Torn between love and war, desire and fear...this book was such an intense read for me. It evoked so many emotions - what a ride this book has been! Some of the scenes had me literally on the edge of my seat, cringing with horror and feeling like I'd just been gut-punched. And then on the flip side, there are other scenes handled so delicately, with a feather's touch. So much research, time, and thought went into this story, and I really commend the author for this -- to create something so beautiful based on such horrifying true events, and to show us all sides of the story so masterfully, was brilliant! I loved the characters and plot. This is not my first read by Midwood, but it is, hands down, my favorite! And that is saying a lot because The Girl from Berlin series is one of my all-time favorites. I wasn't ready to see this one end!", "Star": "5.0 out of 5 stars", "Title": "Midwood's best yet!"}, {"Upvote": "2", "Review": "Turning her pen and focus on the eastern front, author Ellie Midwood has written what is sure to be a timeless tale of love and war.The main characters, Werner and Kira, are absolutely perfect.  You can't help but like them.  And the author does a masterful job of evolving them, maturing and hardening them as their nations, which they love, force them to grow up quickly and fight for them.Werner (German) and Kira (Russian) have fallen in love at the one of the most inopportune moments in history.  They believe, however, the war will end soon and their budding relationship can survive the brief separation since there is an alliance between their two countries.That hopes nearly fades to darkness when the alliance ends and Germany and Russia war against one another.Nobly, on either sides, shooting at strangers across the lines, worried their love is over there, Werner and Kira cling to that tether of normalcy, each believing their love is the only sane thing left to get them through the cruelty and horrors.  And there are plenty.  The author has done her homework and the writing is crisp, quick and powerful.  The history impeccable.  The reader in drawn right into the bowels of terror and death.  It is grim, harsh and real.I've read several other works by author Ellie Midwood and this book is now my favorite.  Absolutely marvelous.", "Star": "5.0 out of 5 stars", "Title": "Love And War"}, {"Upvote": 0, "Review": "Love conquers all in this action (and tragedy) packed offering from one of my favorite historical authors-Ellie Midwood. The prose is so vivid and precise, I felt the devastating horrors of war as surely as did the characters of Kira and Werner. Their star-crossed love provides the fuel for the historic WWII plot (a love that cannot be allowed to come to fruition).  Shortly after finding each other, the lovers are pushed into opposing sides of the “war to end all wars.” Their union is one that can only end with suffering, pain and loss. Can they find their way back to each other? Will anything ever be the same?As is the case with other books I’ve read by this author, the plot twists keep coming with the rapidity of machine gun fire creating a tension that is palpable. The characters are relatable and “real”-something essential for any good story.Ms Midwood’s novel will satisfy lovers of both historical fiction and romance with a page turner that they won’t soon forget. Easily one of the best books I’ve read this year. I highly recommend it!David W. Thompson Legends of the Family Dyer", "Star": "5.0 out of 5 stars", "Title": "Awesome tale!"}, {"Upvote": "2", "Review": "This is historical romance at its best! The plot had me sold after discovering both main characters falling in love but being pulled apart by the biggest conflict in human history, World War II. There is so much depth in this book, so much drama and romance that I was overwhelmed a couple of times having to close the book, take  breather and go back at it again. Kira and Werner are a perfect imperfect match that stays with the reader long after the book is finished. The author was successful in bringing a story alive and make us live through them this horrific time in history. This is a must read!", "Star": "5.0 out of 5 stars", "Title": "Looooved it!"}, {"Upvote": 0, "Review": "This gripping tale began as a romance and quickly evolved into an exploration of what it means to  be human. Predominantly a love story that unravels on the raging front lines of WWII battle, the reader is brought face to face with the capacity for utter depravity, malice, and generosity of spirit of which we are all capable.Kira and Werner, lovers separated by their uniforms and allegiances to the Motherland and Fatherland, respectively, enter the war not more than mere children themselves. And as Kira observes of the enemy SS soldiers advancing on Soviet borders, they're only boys themselves. Yet the atrocities of war create the backdrop against which these two characters are shaped, both eventually yielding to the same instincts. \"Maybe it’s better that we don’t have mothers anymore; they wouldn’t have recognized us when we returned,\" Kira observes. The expertise and ease with which she's become a heroic killing machine is her new identity.Amidst the devastation, ruin, and loss of who they once were, can there be redemption? Ironically, while friends and family have been lost in service to their homelands, there is no home left to which to return. And when once-lovers don uniforms that now denote them as enemy combatants, can the human spirit triumph? I will not answer that question here. This absorbing book is well worth reading to find the answer.I highly recommend this historical novel and look forward to exploring this author's work in far more dept. As far as the WWII novels I've read this year, Ellie Midwood's brilliant and intricate account is by far the most unique and most enjoyable read thus far.", "Star": "4.0 out of 5 stars", "Title": "Predominantly a love story that unravels on the raging front lines of ..."}, {"Upvote": "2", "Review": "A wonderful story written by a great writer. I’m not a fan of wartime stories but I couldn’t put this one down. The most heart touching romance I’ve read. The writer focused on the human aspects of the war: love within hate, and good among evil. Kira and Werner survived the grisly war by holding on to the hope of seeing each other again, and I as a reader suffered through the gruesome details of the war in order to see their dream come true. Besides her superb storytelling skills, the author has also done a good job researching and the details feel real and believable.", "Star": "5.0 out of 5 stars", "Title": "A wonderful story!"}, {"Upvote": 0, "Review": "Shakespeare once wrote, \"Tis but thy name that is my enemy. What is Montague? It is not hand, nor foot, nor arm, nor face, nor any other part belonging to a man. Oh, be some other name.\" Talk about your star-crossed lovers. A Motherland's Daughter, A Fatherland's Son deals with the harsh reality that often occurs when two people from different walks of life fall in love. When Kira, a sniper and skilled sharpshooter for the Soviet army, falls in love with Werner, a German officer, the stage is set for just that. When the two of them end up fighting opposite each other in the trenches of war, their love is put to the test. Scarred by the horrors of war, both cling to their love for each other as best they can, but will it be enough? I highly recommend this historically accurate account of a troubling time in our history and the human factor that shapes these wonderful characters. Truly an exploration of humanity in the grimmest of times.", "Star": "5.0 out of 5 stars", "Title": "AN EXPLORATION OF HUMANITY"}, {"Upvote": 0, "Review": "This is a hard novel to categorize. It’s historical fiction and wartime fiction for sure, going deep into the atrocities that happen in war. But it’s also an epic love story with the kind of Deus Ex Machina coincidences you get in a romance novel. And of course it’s a coming of age story for two young soldiers during WWII, Werner and Kira.I liked this novel a lot because it’s really well written- heartbreakingly, viscerally so. Both protagonists are incredibly strong characters, neither of them is perfect, both of them commit atrocities- in fact, at certain points in the novel, it’s almost a competition of who has bloodier hands, but no matter what, you never lose your sympathy for two young people caught up in a war not of their making and trying to survive.I feel like the ending was a little too convenient and rushed and not as creative as the rest of the novel but overall this tale of star-crossed lovers was a really interesting historical depiction of the Soviet-German conflict during World War 2. This is not a novel that makes a specific judgment call on the Nazis or the communists as being bad or good. Obviously, there are references to the racist and fascist regime of Nazi Germany but this book doesn’t necessarily therefore make it that the soldiers of Nazi Germany were the villains of the novel. This is a novel that portrays how devastating war is even to those who volunteer to serve and protect their countries and how far removed these soldiers are from the ideologies and strategies they are made to fight for. This novel is also a cautionary tale against war and violent conflict. I recommend it highly.", "Star": "4.0 out of 5 stars", "Title": "Wow."}, {"Upvote": 0, "Review": "A fascinating insight into love and war. When the novel begins, we’re thrown into the story behind a photograph and see our star-crossed lovers thrown together. In the beginning, everything seems straightforward, but as Hitler progresses in his Nazi regime, all bets are off.I loved how much research the author did because all the details of the war, country, and situation were very realistic. The heroine in our story was brave, choosing to fight on the front lines rather than to hide. I can’t imagine how the story would’ve progressed with a different heroine.While historical fiction isn’t really my cup of tea, I thoroughly enjoyed this book from start to finish.", "Star": "5.0 out of 5 stars", "Title": "Fantastically Realistic"}, {"Upvote": 0, "Review": "As if the war isn’t bad enough, the Germans go back on their promise to the Russians and the cold conspires to freeze them all. Then two lovers are forced to fight on opposite sides of the battle. Kira is a sharpshooter with a deadly aim. Werner could be out there, somewhere. If her target has blue eyes will she take the shot? Only if she’s threatened with the firing squad.  Such is how it starts.  Seasons change and battle lines move back and forth across devastated landscape and disrupted lives, while Kira and Werner struggle to survive in a world gone mad.  Midwood’s storytelling skill puts the reader straight into the action and emotion of small victories that survive in a terrible war.", "Star": "5.0 out of 5 stars", "Title": "Another excellent WWII Historical from Ellie Midwood"}, {"Upvote": "2", "Review": "I love the way Ms. Midwood has the gift of bringing her characters to life!  Once again, as I have experienced with other novels she has written, I feel I've gotten to know the characters so well that there must be other books about them that I could find to read!  I want to research and determine if they really did live! It's painful that I have to come to grips with the truth that this \"is just a novel\" not a true story!  Thank you Ms. Midwood for your talent of writing!", "Star": "5.0 out of 5 stars", "Title": "Another great read by Ellie Midwood!"}, {"Upvote": 0, "Review": "A riveting story about a young Russian woman who becomes a sniper for the Soviet Union’s Army during WWII who falls in love with an officer in the German Army. On opposite sides of the brutal war between those two countries, the sweethearts try to hold onto their humanity and their love for each other. But the obstacles are ghastly. The battles and atrocities nearly unthinkable in their brutality.It’s a World War II romance filled with lots of heartbreaking descriptions of savagery on both sides. So many people died, young and old, military and civilian, that Kira and Werner become disgusted with life, fearing they may end up shooting at each other. The reader grows weary, as the two main characters grow weary, of such a cruel war.", "Star": "4.0 out of 5 stars", "Title": "Riveting, but not for the queasy"}, {"Upvote": "3", "Review": "A Russian young woman and a German young man fall in love at the beginning of WWII.  This book describes the hardships, atrocities, and grief both experience when Germany declares war on the Soviet Union and they end up fighting in the trenches opposite each other. One of the best books I have read on the tragedies of war.", "Star": "5.0 out of 5 stars", "Title": "Love survives in spite of the worst of wars"}, {"Upvote": "3", "Review": "I say this read is a treasure...that is exactly what it is.  Through Midwood's words....I was there.  The daughter...and the son.  The love..the hate...the very cumulative of good versus evil...the courage of love and commitment overcoming all.  I couldn't wait for this book to end....yet, I didn't want it to end.  Kudos to you, Ellie Midwood...Keep on..keeping on.  😘", "Star": "5.0 out of 5 stars", "Title": "Ellie Midwood's Treasure"}, {"Upvote": "2", "Review": "Ms. Midwood has succeeded again!  Her ability to place the reader in the heart of the action and feel as though we are part of the story is simply amazing.  She takes us to the eastern front in WW2 and we experience that surrounded by intensely developed characters who are trying to survive. Despite the horror witnessed in such a setting (that was unimaginable to me prior to reading this book), Ellie somehow manages to make us feel grateful for being human when this thrilling ride concludes.", "Star": "5.0 out of 5 stars", "Title": "Superb work.  Another must read for Midwood fans and anyone with a curiosity about \"life\" on the eastern front."}, {"Upvote": 0, "Review": "This is my first book by this author, but it won’t be my last.I was reading this book on a warm sunny Sunday afternoon with goosebumps all over my body. It is a very intense, realistic and harrowing tale of two young people forever changed by WWII.  It easy to forget that most of the soldiers were  just kids going to war with hope and dreams until the  gruesome reality hit. It is shows the horrors and the toll it takes on the soul, bt there is also hope and kindness in the most unexpected places.An amazing read.", "Star": "5.0 out of 5 stars", "Title": "a must read"}, {"Upvote": 0, "Review": "Author Ellie Midwood’s research of the subject of her novel reveals itself on every page as extensive and intense. The quality of the prose is quite good. The largest part of the reader’s experience is spent on the horrific killing fields in Russia during Germany’s invasion of its former World War II ally, and woven among the story is a Romeo and Juliet type of love story. Midwood’s graphic depictions of the actual fighting between the two countries are remarkable, and her lovers, while caught up in the mayhem on opposing sides, are brave and determined and tender. The magnitude and explicit portrayals of the battle scenes do not make for an easy reading experience, nevertheless, fans of historical fiction based on World War II will find it a worthwhile one.", "Star": "4.0 out of 5 stars", "Title": "Extensive and Intense Research"}, {"Upvote": 0, "Review": "I acquired this book because WW2 interests me. Once I started reading I couldn't put this book down.  A love begun before the war starts somehow endures all the horrors of that war. Told by the lovers in alternate chapters the war comes alive in tales of love, pain, and acts of kindness and depravity. A wonderful read for anyone interested in how the soldiers on both sides endured the war or if you just enjoy reading a story of a love that endures all.", "Star": "5.0 out of 5 stars", "Title": "Love conquers war"}, {"Upvote": "2", "Review": "This is a compelling story of two lovers fighting on opposing sides of WWII. The places and peoples of their stories are vibrant in detail. War is an act of patriotism that is primarily fueled by hate. But the fragile heartbeats of love are stronger than hates devastation.", "Star": "5.0 out of 5 stars", "Title": "A story of love and war"}, {"Upvote": 0, "Review": "A great love story between a German boy (werner) and a Russian girl (Kira).  Set during World War II both soldiers fighting on opposite sides their love endures the horrors of War.  The story is told with striking reality as to the violence of war and the human suffering of the heart due to the loss and horrors faced by the soldiers fighting on both sides. It is also the story of a love that survived these horrors.  Very good book, I would definitely recommend it.", "Star": "5.0 out of 5 stars", "Title": "True Love Survives All"}, {"Upvote": "2", "Review": "I say this every time I read one of Ellie’s books, “This one is my favorite.” Until I read her next new book, and that one is my new favorite.  I LOVED Kira and Werner’s story so much.  The story is pretty violent, but sometimes you have to go through ugly things to see something beautiful at the end!  Give this book a chance, you won’t be disappointed.", "Star": "5.0 out of 5 stars", "Title": "“This one is my favorite. ” Until I read her next new book"}, {"Upvote": 0, "Review": "I was hooked from the beginning with this love story between a German and a Russian set in WW2 that you know will only end in tears. The book is at times painful to read, it’s so well written that you feel so much for what is happening in the story. I couldn’t put this one down, congratulations Ellie Midwood for another great piece of historical fiction.", "Star": "5.0 out of 5 stars", "Title": "5 stars..."}, {"Upvote": 0, "Review": "I purchased this book because I read 2 books by this author.  The INDIGO series was excellent.  This book started and ended in a love story.  At first I was disappointed because I thought it was historical fiction.  The story did pick up and it was historical fiction. Russia vs Germany in WW11.  Such a difficult time.  Interesting read.", "Star": "4.0 out of 5 stars", "Title": "GOOD HISTORICAL FICTION!"}, {"Upvote": 0, "Review": "I was unable to put the story down. Ellie Midwood takes on a long, emotional, graphic journey of two star crossed lovers. The reader travels through the war experiences of the two characters, torn apart by the madness of Hitler's atrocities and each one's sense of duty to their respective home lands. It's a riveting love story. Well done!", "Star": "5.0 out of 5 stars", "Title": "Amazing love story"}, {"Upvote": 0, "Review": "If you like to get down and dirty in the nitty-gritty of a battlefield, this is your book. It  is the love story of a Russian woman and a German man, but don’t expect the pages to be filled with romance. Love is in the heart. The lovers are on opposite sides. The concept is often more interesting than the execution.", "Star": "3.0 out of 5 stars", "Title": "Unusual WWII Love Story"}, {"Upvote": 0, "Review": "Wars are terrible and a few arrogant selfish people can cause so much damage to the whole world. I am so glad the love these two had for each other kept them going until they could find each other. There were very bad people on each side and they used the power of rank as a way to make good people do horrible acts. I enjoyed the book. Thank you", "Star": "5.0 out of 5 stars", "Title": "LOVE"}, {"Upvote": "2", "Review": "Have not read many historical novels regarding the German/Russo interactions.  This was a memorable read of the military, political and personal travails of both sides.", "Star": "5.0 out of 5 stars", "Title": "OUTSTANDING!"}, {"Upvote": 0, "Review": "Ellie never disappoints in this historical wartime fiction genre. Beautiful, sad, inspiring all in one well written and hard to put down novel.I love the way Ellie always makes me want to read up and discover more about the history that inspires her novels.", "Star": "5.0 out of 5 stars", "Title": "Heart breaking and Heart warming in one fabulous read."}, {"Upvote": "2", "Review": "I throughly enjoyed this book from beginning to end.  There would be no wars if there was more love on everyones part.  Anyone would love this book!", "Star": "5.0 out of 5 stars", "Title": "Wonderful Book"}, {"Upvote": 0, "Review": "Ellie Midwood gets better and better with every book of hers I read. This is another great book that perfectly intertwines history with the story. Her characters are unique, three dimensional. Trust me, you'll love this story.", "Star": "5.0 out of 5 stars", "Title": "Ellie Midwood gets better and better with every book of hers I read"}, {"Upvote": 0, "Review": "Brilliantly researched. The tale is brutally honest as the time and the place itself. The characters real and authentic. And though the story has a happy ending, the aftertaste from the portrayals of the ugly horrors of the War is overwhelming.", "Star": "5.0 out of 5 stars", "Title": "Compelling from the beginning"}, {"Upvote": "2", "Review": "This book is amazing!  Such a beautiful story and such a vivid decsprition of the war from the eyes of two ordinary individuals who had to face insurmountable odds of survival everyday. To see the war from their perspective gives you new insight as to what everyday people went through.", "Star": "5.0 out of 5 stars", "Title": "Loving someone against all odds"}, {"Upvote": 0, "Review": "This is an incredible story of love, war and hope.  Beyond all odds, love wins out.  The horrors of war, both on the German and the Russian sides, were very explicit but necessary to tell the true story.", "Star": "5.0 out of 5 stars", "Title": "Fantastic Story."}, {"Upvote": 0, "Review": "This book was absolutely spell binding. I knew so little about the German Russian World War II and was surprised to read about this perspective. I was transported back in time with the author's characters. I would recommend this book to any age group. Brilliant writing.", "Star": "5.0 out of 5 stars", "Title": "Spell binding"}, {"Upvote": 0, "Review": "I liked the book.  It was an interesting story and the pain that comes from war.  The prime characters, Kira and Werner were very well developed.  It’s always good to have a happy ending.", "Star": "4.0 out of 5 stars", "Title": "I liked the book"}, {"Upvote": "2", "Review": "Great book  keeps your intrest great love story also tells you how horrible war, is and there are good and bad on both sides", "Star": "5.0 out of 5 stars", "Title": "Excellent"}, {"Upvote": "2", "Review": "It is like. No other. wELL book I have ever read.  It filled me with such emotion, pain, love and a new stronger  hatred of war.  I found myself unable to put it down.  It 4 am and it is finished.", "Star": "5.0 out of 5 stars", "Title": "May well be the best book I have ever. Read"}, {"Upvote": "2", "Review": "True love overcoming the horrors of war gives me the impetus to strengthen my marital relationship in overcoming the trivialities of today’s modern and fast paced lifestyle for the one I love.", "Star": "5.0 out of 5 stars", "Title": "Simply awesome"}, {"Upvote": 0, "Review": "This is truly a loving,story that through all the evil,death,and misery,their love stayed true,thank you for his novel,write more like this,", "Star": "5.0 out of 5 stars", "Title": "Beautiful"}, {"Upvote": 0, "Review": "A tender story about a brutal time of killing, death and destruction.  The true story of love and beauty with the confines of WWII.", "Star": "5.0 out of 5 stars", "Title": "Beyond beautiful"}, {"Upvote": 0, "Review": "A compelling story of the atrocities and mans inhumanity to man between Germany and Russia during the second world war. It's amazing that there was anyone to fight at,. the end.. The love affair between Kira and Werner was something for the ages", "Star": "5.0 out of 5 stars", "Title": "Love and war"}, {"Upvote": 0, "Review": "Loved the book. Didn't want to put it down. I don't understand why we have to have a review with this many words.", "Star": "5.0 out of 5 stars", "Title": "Excellent"}, {"Upvote": 0, "Review": "We’ll written historical book showing both sides of the war  and what the fighting men had to live through.", "Star": "5.0 out of 5 stars", "Title": "We’ll written historical book showing both sides of the war ..."}, {"Upvote": 0, "Review": "This was an incredible book.  A part of fiction/history and life that never should be forgotten.  I relished the story and just as important the writing.", "Star": "5.0 out of 5 stars", "Title": "Amazing story."}, {"Upvote": "2", "Review": "This was an interesting read.", "Star": "5.0 out of 5 stars", "Title": "Five Stars"}, {"Upvote": "2", "Review": "This book was extremely interesting.  I enjoyed reading about the two sides of the war from a man and a woman.  The writer is very skilled", "Star": "3.0 out of 5 stars", "Title": "Good read"}, {"Upvote": 0, "Review": "Excellent read", "Star": "5.0 out of 5 stars", "Title": "Five Stars"}, {"Upvote": 0, "Review": "Very good book I really liked it and would recomend it anyone!!", "Star": "5.0 out of 5 stars", "Title": "Five Stars"}, {"Upvote": "2", "Review": "This story kept me on the edge of my seat the whole way through. It was perhaps the best love story I've ever read.", "Star": "5.0 out of 5 stars", "Title": "Excellent read"}, {"Upvote": 0, "Review": "This book honestly revealed the atrocities of the war between the Germans and the Russians and how it broke the spirit of it’s young people.", "Star": "5.0 out of 5 stars", "Title": "This book honestly revealed the atrocities of the war between ..."}], "Star": "4.6 out of 5 stars", "Name": "A Motherland's Daughter, A Fatherland's Son: A WWII Novel", "Format": "Format: Kindle Edition", "Price": "$3.99", "Author": "Ellie Midwood"}