{"Comment": [{"Upvote": "49", "Review": "I found this story fascinating and complex with many unexpected elements.  The time period matches when enterprising Dutch traders traveled the world including coming to America among the first founding families.  Most activity was controlled by guilds with strict rules about trade, just as daily life was controlled by strict religious rules.  Manner of dress and activity was all dictated as well so there was little room for a free spirit of any kind in Amsterdam.  Into this world enters young Nella who comes from the far freer countryside but because of her revered old family name has been successfully married off to an older and successful business man who seems likely to provide her a good life.  He gives her a huge cabinet sized doll house for a wedding present which she is expected to furnish and through it learn the ways of running the big house she finds herself mistress of.  It's not as easy as it seems though.  Nella finds herself in the midst of unusual and strong willed characters she struggles to understand, not the least of which is the mysterious miniaturist who delivers pieces for her house.The writing is as detailed and precise as a painting by Vermeer and was the perfect style to tell this story.  I thoroughly enjoyed it and stayed up late into the night reading.  This is not a quick beach-read sort of book, but the type to sink into before the fire on a cold winter night.  It's also surprisingly relevant to modern times.", "Star": "5.0 out of 5 stars", "Title": "A different sort of story, well told"}, {"Upvote": "76", "Review": "Had a read this book first I would not have bothered with The Muse, a novel with twists, development of characters and conclusion.  I got to the end of this book and wondered what it was about.  It was incredibly detailed about the time it was set it, Holland in the seventeenth century, but it I felt it was trying to go too many places at once; women and their limited role, sexual freedom, merchant trading all tied up with some allusion to the supernatural.  The miniaturist of the title is alluded to as having some sort of 'power' but just what that is is never really explored.  And why she should be bothering is never answered either.  I read to the end hoping to find out and left disappointed.", "Star": "2.0 out of 5 stars", "Title": "I read to the end hoping to find out and left disappointed."}, {"Upvote": "24", "Review": "I was SO excited to start this book. The storyline sounded great, especially if you love historical fiction. I assumed this would be a new favorite of mine. That's why it's so frustrating that the author did not write this book....well....better. At first, the story was great. Well-written, captivating, again-great storyline. However, I gradually couldn't stand the fact that Petronella was 18 years old and basically a country bumpkin. And yet, she somehow garnered the attention and respect of this household in just a chapter or two. One minute, Marin and Cornelia hate her, and the next, they bow down to everything she says and does. And yet nothing she says or does is particularly brave, smart, or noteworthy. Plus, she was only in the house for a whole...4 months? I find it hard to believe that after just 4 months Petronella would have been so invested in this family, even if it's technically now her family and she is the lady of the house. Johannes totally humiliates and betrays her. Marin treats her like crap, and yet she risks everything to save them after knowing them for a few measly months. Just couldn't get over details like this. Such high hopes for this one. Disappointing.", "Star": "3.0 out of 5 stars", "Title": "Disappointment for historical fiction lovers"}, {"Upvote": "22", "Review": "Initially reminiscent of Rebecca, this is the story of a young wife thrust into a situation beyond her control and outside of her realm. Nella is an outsider and a newcomer, just 18 years old and in completely unknown territory as she finds her place in an established family, strives to become mistress of a home that is not hers and a navigates the streets and customs of a new city, unsure of her friends and unaware of her enemies.The story was intriguing from the start and quickly proved to have its own unique set of mysteries  and dilemmas. It read quickly and though there was enough foreshadowing to allow some assumptions, it also kept me guessing as new obstacles presented themselves. It was not tidy and clean nor dismal and dreary. It touched upon heavy subjects but didn't insinuate itself in judgment. I really enjoyed the book and felt like it had the perfect balance for a captivating weekend read.", "Star": "4.0 out of 5 stars", "Title": "A Tiny Treasure"}, {"Upvote": "27", "Review": "An outstanding read. I devoured this book in two days, even falling asleep over it one night, unwilling to put it down. In reading other reviews please be aware that this is a LITERARY historical novel, not a romance or women's fiction. It also contains magic realism which seems to have thrown some readers off. The setting is 17th century Amsterdam, and the author captures perfectly the conflicting sides of the Dutch personality at the time, perfectly describing it as a pendulum between God and guilder. This is the Amsterdam of the Dutch conquerors and the merchants who build their wealth on Eastern trade. It is the Amsterdam of Calvinism, staunch, suspicious, unyielding, unforgiving. Into this city Nell merges as a new bride, eighteen year old and fresh from the country. Her new husband is a wealthy merchant, charming and well liked. For a wedding gift he gives his young bride a cabinet house (doll house) which she begins to fill with minatures. As the story unfolds unsolicited additions arrive from the miniaturist, additions that foretell events in the household before they even happen. Nell attempts to find the mysterious miniaturist while trying to understand the complex characters of her new husband, his strong-willed sister, their maid, and the Black man her husband treats as an assistant in a city in which Blacks are curiosities and inferiors. So many twists and turns in which the character of Amsterdam itself unfolds with the individual characters. Beautifully written and fully realized. A lovely, lovely book.", "Star": "5.0 out of 5 stars", "Title": "Outstanding Read"}, {"Upvote": "45", "Review": "Why bother to title the book, \"The Miniaturist\" when the story has almost nothing to do with the miniaturist? One and a half pages to tell her story, as if revealing that much would be enough. The Miniaturist carves figures that seem to predict future events about the characters lives, but we never know why or how they're carved, just that they are. For 1-2 pages. And why bother to flesh out the contents of Marin's bedroom if they serve no purpose? Marin, Nella's sister-in-law, has a bedroom that is full of maps and documents and secret things that we are led to over and over. Why did she have them? What was she charting? Did it have to do with her brother's business, Otto's travels, places she'd been to, would like to go to? Nothing in the book serves any purpose to the story. It should have been titled, How Homosexuals Were Persecuted in 16th Century Amsterdam, for the book was nothing more than unanswered questions and loose ends leading nowhere in order to showcase the constant the sorrow of hiding homosexuality. What a waste of what cold have been a really awesome mystery.", "Star": "1.0 out of 5 stars", "Title": "Nothing to do with a Miniaturist. Should have been titled Homosexual Persecution in 16th Century Amsterdam"}, {"Upvote": "79", "Review": "What a peculiar book! The story itself has a lot of potential, but the author can't seem to decide what to do with her materials. The setting is Calvinist Holland in the late 1600s, and the author has obviously done a lot of research about the culture, religion and customs of the era.At first the novel seemed like a conventional but interesting tale of a naive young woman from the countryside married off to a wealthy older man in Amsterdam, a husband who, insultingly, gives her a large dollhouse to play with, as if she were a small child. But then the dollhouse starts to take on peculiar, almost supernatural powers. It's an exact replica of the house the young wife lives in, complete with the same inhabitants, and the figures seem almost alive, predicting events that will occur within the actual house. WHAAAAT???This silliness and further vague, ridiculous stuff about the mysterious miniaturist herself-- material that is never resolved for the reader--make the novel an uncomfortable hybrid: neither straight-out fantasy nor something fully based on factual material.The two elements do NOT combine well at all.Really-- the author has plenty of  compelling themes and plot-lines to works with, so I don't understand why she felt it necessary to include this fantasy element that undermines the credibility of the entire book.", "Star": "3.0 out of 5 stars", "Title": "A book that can't decide what it is!"}, {"Upvote": "135", "Review": "I really wanted to like this book. It could have been a great story. The author wrote this like she had taken a bunch of notes to herself and strung the notes into a paragraph. It made reading the book uncomfortable. It also made it seem incomplete.There was so much of the story that seemed  unfinished and way too much was left up in the air. Again making the story seem extremely incomplete. As others, I'm not really sure why it was called the miniaturist because it was less about the miniaturist than about Nella. I did read it to the end because I kept hoping that it would get better and there were some parts of the story that were ok but I like a story that has an ending, has closure, answers the questions and doesn't leave things to the imagination of the reader. Sorry, I wish I hadn't wasted my time reading this one.Read only if you like much of the storyline left to your own imagination.", "Star": "1.0 out of 5 stars", "Title": "Don't bother with this one."}, {"Upvote": "20", "Review": "A sad tale where none of the characters had any self worth, dimension or life to them. You didn't really care what happened to them as the story progressed. None of the characters or events seemed plausible or interesting. No real ending to the story. Sorry I bought it", "Star": "1.0 out of 5 stars", "Title": "Dismally dark characters, flat, with no dimension in a story that is implausible"}, {"Upvote": "6", "Review": "I watched the first installment of the series on PBS. The ending of the episode drove me to buy the book.to find out what happened next.I finished it the next daySo much hypocrisy and cruelty in 17th Century Amsterdam, so many secrets in a 17th century Dutch merchant family:  an innocent young bride, brought into a marriage of convenience (as it turns out,on both sides) with a handsome mysterious older husband who is seldom at home. In spite of a fatal and ultimately tragic flaw as it was seen in that time and place, Johannes was yet grateful to the young wife who came to love, defend, and try to understand him in spite of her disappointment. Johannes was apologetic, kind, and loving in his way, despite the fact that he had married against his inclination. I fell a little bit in love with him. Then there is the austere, controlling sister-in-law  whose stringent religiosity conceals a guilty secret. Two servants who conspire with the family to keep secrets, but are permitted unusual, for that time, latitude to speak their minds within the family complete the picture.This is a novel with so many unexpected twists that at times my heart was racing to get to the next revelation.At the end, though, after secrets are revealed,and tragedies almost destroy the family, one mystery remains: who is the Miniaturist?", "Star": "5.0 out of 5 stars", "Title": "An Unputdownable (yes,I know that's not a word) Story!"}, {"Upvote": "6", "Review": "I began reading this book because a film version of it begins on PBS this weekend, and I prefer to read the book first. I literally read 3/4 in one day because I couldn't put it down. Historical fiction set in 17th century Amsterdam, it's full of vivid descriptions, interesting characters, mystery, and an intriguing plot that explodes about a third of the way in. I hope the film version stays true to the book.", "Star": "5.0 out of 5 stars", "Title": "Captivating Potboiler"}, {"Upvote": "7", "Review": "Don’t bother. Loose ends, gratuitous salacious taboos tossed with some interesting social history. Not worth the trouble. Oh well, and I was so looking forward to it. I usually love historical fiction.", "Star": "2.0 out of 5 stars", "Title": "Period piece soap opera."}, {"Upvote": "6", "Review": "I watched the Masterpiece Theatre production of this novel. I wanted to read the book after. I am  a little disappointed in the storytelling. For one the mysterious identity of the miniaturist is left hanging, the motivations of the characters are also surface like. Just thought that the book would be better.", "Star": "4.0 out of 5 stars", "Title": "Theatre"}, {"Upvote": "7", "Review": "The story begins in 1686 when young Nella Oortman arrives in Amsterdam from her country home.  She goes to the house of her husband Johannes Brandt who is a merchant trader who may or may not be wealthy.  It soon becomes apparent to Nella that there is something strange about Johannes and his sister Marin.  Although Johannes is kind, he is distant and Nella sees little of him.  His sister seems snippy and bossy and acts as if the house belongs to her.  Johannes brings Nella a cabinet with a very large dollhouse as a gift.  It is a replica of their house and Brandt tells her she can furnish it.  She orders some pieces from a miniaturist who not only makes exquisite pieces but sends other pieces that are exact replicas of those in the Brandt's house without ever having been in the house as far as the Brandts know.The novel has almost a gothic aura.  It is certainly mysterious and has a number of twists.  The first twist was predictable but others were not.  I enjoyed the plot and character development of Nella, Johannes and Marin in particular.If you like historical novels and mysteries, you may enjoy it as much as I did.  If you dislike ambiguity, you may not like this book.", "Star": "5.0 out of 5 stars", "Title": "Historical Novel Set in Amsterdam in the 17th Century"}, {"Upvote": "9", "Review": "I love historical fiction and there was so much promise in this book, but, ultimately, I was disappointed.  The characters were well-drawn and interesting.  The idea of a young woman learning that she can be strong and do things she never imagined is a good underlying theme.  The plot point of a miniaturist who appears to see (and predict?) the future is intriguing.  Sadly none of these ideas or themes were fully fleshed out, and the book ended abruptly with very few of the loose ends pulled together.  I wish there had been another draft and a stronger editor guiding the author.", "Star": "2.0 out of 5 stars", "Title": "Does not live up to its promise"}, {"Upvote": "3", "Review": "The writing is beautiful. The author has a genuine talent for creating lovely, descriptive sentences and immersing readers in a different world. Unfortunately, the sentences must converge to create a story with a recognizable arc and ultimate resolution. I came to the end of the book with more questions than answers. There is no resolution at all! The title character, the “Miniaturist” has next to no part in the story at all, except to build tiny duplicates for the protagonist’s cabinet that eerily seem to suffer the same misfortunes as the real life version. Clearly, this is intended to have some significance to the story, however readers are left scratching them heads. One would expect that in a book titled “The Miniaturist”, that character would play some part in the events taking place! But if so, they completely escaped me! Try as I might, I cannot even come up with a deeply symbolic interpretation! I also had a hard time feeling much sympathy for the protagonist; she seemed childish and silly, as well as not believable. Actually, none of the characters were particularly compelling. But the beautiful language kept me reading on with the expectation that all the different threads would eventually tie themselves together to divulge the author’s theme, but no. All the beautifully constructed language in the world cannot overcome the lack of unifying theme, story arc, and resultion. Without those crucial elements, it’s just window dressing! Disappointing!", "Star": "2.0 out of 5 stars", "Title": "Disjointed, Incomplete and Disappointing"}, {"Upvote": "8", "Review": "This story takes place in late 1600's Amsterdam, when life was ruled by the guilds and a punishing church.  Young Nella leaves her rural town to marry a wealthy somewhat older man.  She arrives at his house and is greeted by his aloof sister and an impertinent maid, but no husband.  Nella tries to make sense of her new life and in the process grows up fast.  She also discovers multiple family secrets that ultimately destroy them.  The title comes from a gift from Nella's husband.  In an effort to keep her busy and distracted, he buys her a \"cabinet house.\"  This is a miniature of her new home.  She hires a miniaturist to furnish it with poppets and household items.  The mysterious miniaturist is never seen and only communicates through items; not all of them requested.  Is the miniaturist a spy or can she foretell the future?I enjoyed the twists and turns in the book and a couple of them were a complete surprise.  There is tragedy and travesty.  Not all questions are answered, which doesn't usually bother me, but it did with this book.  The story was still interesting.  I gave it three stars because I thought some character development was sacrificed for a lot of plot lines.  I was most bothered by the light treatment given to the 1600's.  I could have been reading about any city in the 17 or 1800's.  To me, it lacked believable atmosphere and language.  A pleasant enough way to pass the time, but not a great book.", "Star": "3.0 out of 5 stars", "Title": "Enticed by the beautiful cover"}, {"Upvote": "6", "Review": "There are books that are masculine and there are books that are feminine, and this is decidedly a feminine book. Set in 1686 Amsterdam, the book tells the tale of eighteen year-old Petronella Oortman’s new life when she arrives at her new merchant husband’s home. The green flags are where I have marked the book’s “mysteries.”What secrets are kept by her new sister-in-law Marin? Who is the Miniaturist and why does she do what she does (Alas, we are never told the answer to this question, which was a bit unfulfilling, and I have to guess that the Miniaturist is some sort of psychic and uses her powers through her art to try and help or warn her clients). Lastly, why is her new husband, Johannes, so detached from her? This is a book of mysteries, but more importantly than that, this is a book about relationships, love, forgiveness, betrayal, and perseverance. Life marches on, and so does Nella.The story line between husband and wife was one I certainly was not expecting, and not one I could relate to or want to relate to. Why does Nella care about him after finding out what he did/who he is? I would have left the sucker to rot in prison, and let him march forward to his execution alone. She was not without resources or family, so she could have left, but Nella is not me, so Nella stayed and supported him. Should his punishment have been death by drowning? Certainly not, and the trial proceedings are chilling. Dangerous times.I did enjoy the character of Nella and the things she persevered through and overcame. The book was a page turner, and kept me reading to finish the 392 page book in about two days. The story did make me think about how awful it would have been to be a woman in that period of time. I am glad I wasn’t, or if I was, that I have not retained hard memories of it now. Even the wealthy women were just property and slave puppets, mostly. Just an awful, awful time.Interestingly, Petronella Oortman was a real Dutch woman who had a cabinet house. Today, it is on display at The Rijksmuseum in Amsterdam.", "Star": "4.0 out of 5 stars", "Title": "love, forgiveness"}, {"Upvote": "10", "Review": "After several attempts to get through the first chapter of this rambling, disjointed mess, I gave up. There are too many good books to be read to waste a minute more on this. The good reviews honestly mystify me.", "Star": "1.0 out of 5 stars", "Title": "Couldn't do it"}, {"Upvote": "4", "Review": "I will admit having a hard time getting into this book. For the first third of the book, I get as miserable as Nella, and I don't think the reader is supposed to empathize with the characters to that extreme. I thought about putting it down several times, but I stuck with it, and I'm glad I did. Overall, an interesting, compelling, and heartbreaking story. I also enjoyment authors telling stories of other time periods and cultures include footnotes, glossaries, or appendices to better acquaint the reader with the setting, and I thank Ms. Burton for including them in hers. Looking forward to seeing the adaptation now.", "Star": "3.0 out of 5 stars", "Title": "A slow start turned into a good story"}, {"Upvote": "8", "Review": "Nella Oortman is whisked away from her small Dutch village to big city, Amsterdam by marrying a man she barely knows.  Her family has fallen on hard times financially and Johannes Brandt is a wealthy merchant.  In the 17th century, her family sees him as a good match for her.  She arrives at the Brandt home with her parakeet and not much else.  Her new sister-in-law, Marin immediately sets out to make sure the young and naive, Nella, knows who's in charge of the household.  It will not be the new wife.When Johannes eventually returns home from his travels, he brings his wife a replica cabinet house as a wedding gift.  Nella sets out to furnish the house with miniatures.  The items are small and detailed, matching the Brandt home furnishings perfectly. Additions to the cabinet begin arriving which Nella has not ordered.  She becomes drawn into a dark web and deception of her new life through the tiny items she finds neatly wrapped in brown paper.The setting of late 17th century Amsterdam was very well developed in The Miniaturist. The historical backdrop of Dutch life drew me in completely.  Nella held my attention, with her attempts to fit in a strange place and find her place as a wife.  Though only eighteen, she had a strong will.  Marin, hiding a secret of her own, tried to break her, but in the end, it was Nella she needed most.I'm on the fence about this novel.  Many things about it, I loved.  The writing is good, the story moves quickly and I never felt bogged down in it.  The historical aspect of the story is interesting and keeps the plot line grounded.  But when I got to the last page I felt let down in a big way.  The miniaturist, herself, had such a small role yet commanded the title of the book.  Nella deserved much more from this story than she got.  But I might not have read it if the title had been different.  The Miniaturist serves as a double edged sword much like the story inside the cover.", "Star": "3.0 out of 5 stars", "Title": "I'm on the fence about this one."}, {"Upvote": "9", "Review": "I enjoyed this immensely. What a great story. The characters leap off the page. The detail is beautiful and rich without being tedious. I read this in two nights. I couldn't put it down. I highly recommend this book. It is completely entertaining and sad and fun and frustrating and compelling. I thought this would be a tough read seeing as it is set in Amsterdam in the 1600's but it flowed beautifully. I was captivated! Read it!", "Star": "5.0 out of 5 stars", "Title": "Amazing!"}, {"Upvote": "20", "Review": "Having  read and much enjoyed other books set in the Netherlands, and reading mixed reviews on this one, my recommendation is not to waste your reading time. This story seems to lose track of itself. The plot meanders, the characters lack depth and there is really very little in the way of historical information. If you are interested in a captivating read with interesting, well developed characters and plot , told in an engaging manner, and much historical information, read The Girl With The Pearl Earring, The Coffee Trader,  Tulip Fever, or Girl in Hyacinth Blue. Any of these are better written and more satisfying.", "Star": "2.0 out of 5 stars", "Title": "Disappointing"}, {"Upvote": "11", "Review": "It's exquisite like fine china. The Miniaturist by Jessie Burton is also a well patterned garden maze. A reader might find themselves lost in streets because there are many lives to live here. More than one life story lives in each character. It is uncomfortable to read about one household's days of chaos.A large cabinet house bought by Johannes, the husband, for his bride, Petronella, will become more than an upright toy. For a while, it is a child bride's safe haven. The household is full of puzzles and whispers. So are the streets of Amsterdam. In this novel, words and deeds are like \"water.\" What is spoken or done inside flows outside and is judged.Very interesting is the seemingly magical appearance and disappearance of the miniaturist. A girl or woman who in some way gains the hearts of the women in the city. She is like an invisible fortune teller. She can foretell the death of a much loved family pet. Was the miniaturist real or just my imagination? Her comings and goings left me perplexed. One thing real for sure is the stiff religious garments worn by the neighbors and Pastor Pellicorne. Without rose colored glasses one can see that it comes down to who owns the worse bag of sins It's The Scarlet Letter of our time.I am left wanting to know more about Amsterdam: It's history. It's people. Perhaps, this is the skill of a good author. She or he leaves us wondering where does truth begin and where does it end. Is there a need to know the truth of a place? Sometimes.The novel begins in the 1600's. The characters seem real. Their emotional pain overpowering. With all of the anxiety there is time to breathe for a moment. This is when there is a quiet wish made that doll houses were real because toys never judge. Toys only give pleasure.", "Star": "5.0 out of 5 stars", "Title": "One Person Leads More Than One Life"}, {"Upvote": "4", "Review": "Conflicted about this novel. Interesting subject matter with twists and turns. Fairly well paced, especially half way through the read; however, the author should have developed the title character, which she did not. I kept waiting to really see who, what, when, where and how regarding The Miniaturist, but was left wanting. Its hard to end a story in a satisfactory manner and I felt this one wrapped up fairly well regarding the other main characters. There are a couple of graphic sexual encounters which could have been done a bit more tastefully but it seems authors today feel the need to be as graphic as possible. I zipped through the book very quickly.", "Star": "3.0 out of 5 stars", "Title": "Conflicted"}, {"Upvote": "3", "Review": "I was really excited when I saw a movie was being made from this book, so I bought it to read first. It was strange. It caught me right up in it, and I couldn't put it down. Having little knowledge of the location or time period, it was interesting. And it was mysterious. What the heck was going on here? Who were these people? I couldn't wait to find out.Without giving away anything, I can only say I was let down. There were no answers, and I was left hanging.Maybe there will be a second book with all the answers? But dang it! I wanted to know was going on here!I'd really like to have given it more stars but I finished it being disappointed. I wonder how they'll do this in a movie. We'll have to wait and see.", "Star": "3.0 out of 5 stars", "Title": "Fascinating read but no answers."}, {"Upvote": "3", "Review": "I bought this book because I didn't know the book existed and I saw an ad that PBS has made the book into a series. I build miniatures, so I was so excited to get the book. I loved the story. It was very well done and now I will watch the series when it's out this winter and probably spend the entire season comparing it to the book. Lol", "Star": "5.0 out of 5 stars", "Title": "Great story"}, {"Upvote": "6", "Review": "The mysterious cabinet and the furnishings was a masterful strategy.  I could not put the book down.  I love books that are. Clever and with historical society to  color the. back story.  Thank you for writing this novel and teaching me a lot more of EUROPEAN history.", "Star": "5.0 out of 5 stars", "Title": "Great Read"}, {"Upvote": "2", "Review": "I loved the historical aspects of the story, learning about Amsterdam in the 1600s.  I also liked that the issues that the characters dealt with, homophobia, and religious oppression and feminism, for example are so relevant today.  The author left a lot of questions unanswered, such as, who exactly is the miniaturist?  Perhaps that was intentional, but everyone in my book group felt that that was a flaw in the book.  I also thought the main characters could have been better developed.  But overall, it was a good read and I recommend it to anyone who enjoys historical mystery novels.", "Star": "4.0 out of 5 stars", "Title": "Good historical novel"}, {"Upvote": "6", "Review": "I am somewhat conflicted about my feelings at the end, but after a slow start, it was a page turner and so well researched as to time peiod and mores. I always admire the research done by good authors. It was a surprising story of the strength of women when they doubt themselves.", "Star": "5.0 out of 5 stars", "Title": "Good historical writing, good character development."}, {"Upvote": "3", "Review": "What an unusual story set in a 17th century era.  I learned so much about the hierarchy, customs, religious attitudes, business dealings and even the foods eaten at this time.  I knew about Dutch art and its symbolism but this brought a new perspective to the lives of Dutch merchants, and the haves and have nots.  Even though the story is fiction, the research of this author is extensive.  The story line isn't for every one as it can be difficult to deal with, but I felt the writing was so unique that I  couldn't stop reading this book.", "Star": "5.0 out of 5 stars", "Title": "Exceptional  writing"}, {"Upvote": "7", "Review": "The book sounded intriguing enough for me to try a kindle sample...usually if I read the sample and try to turn the last page to keep reading I am fairly confident I will enjoy the book and purchase it.  I did want to continue with this book - mostly because I was curious about all the mysterious stuff going on (with her husband, sister in law, and ultimately I knew some paranormal miniatures would come into play) unfortunately once all the \"mysteries\" are revealed I was pretty underwhelmed and let down.  The fact that I cared enough to have closure & finished the book  warrants a star; the effort the author put into the time period and setting of the book is worth a star as well.  I wouldn't recommend it to anyone personally and I will most likely avoid this author in the future.", "Star": "2.0 out of 5 stars", "Title": "Two stars for ...."}, {"Upvote": "3", "Review": "So the hook to read Jessie Burton’s novel The Miniaturist was the miniatures. But the fascinating story about sixteenth century Amsterdam kept me reading long into the night. Nella Oortman arrives in the city after a rather hasty marriage to a wealthy merchant in the Dutch East India Company. Johannes Brandt was older and kept a surprising distance from his beautiful young wife. Nella is confused—her mother had prepared her for her wedding night, she dreamed of the babies to come … but Johannes takes no interest in Nella as a wife. Instead, she is left alone to navigate her relationship with her controlling sister-in-law Marin while Johannes spends long hours working and traveling.As something of a consolation prize, he has an incredible wedding present made to keep Nella occupied: a tall cabinet re-made into a replica of their home. Along with what is essentially a doll’s house, Johannes provides Nella with a line of credit so she can furnish it. Nella hires a miniaturist and commissions a few pieces--a betrothal cup, lute, and marzipan, but is chilled when the unknown craftsman includes extra items that are miniature duplicates of objects in their home.Nella becomes more frightened when the miniaturist continues to send items that seem to indicate he (or she) knows more about the Brandt household than is prudent; she gradually learns that certain secrets might best remain hidden. And as Nella begins to discover more about the Brandt family, she begins to understand her own strength and purpose, as well.The Miniaturist is a peek inside a time and place I knew little about and a cautionary—yet hopeful—tale about a young woman coming into her own.[read more at thisismysymphony.net]", "Star": "4.0 out of 5 stars", "Title": "Small packages"}, {"Upvote": "9", "Review": "I truly wanted to enjoy this book but found the characters very uninspired and the storyline a rehash of many other books.  The poor country girl marries the wealthy distant businessman, his secretive spinster sister and the usual cohorts of house help. The only new addition to this story was the thin storyline of the miniaturist.  At times, it did add new aspects of intrigue but the miniaturist storyline had a very anticlimactic conclusion.", "Star": "2.0 out of 5 stars", "Title": "I truly wanted to enjoy this book but found the characters very uninspired and ..."}, {"Upvote": "13", "Review": "I could not put this book down, but was ultimately left waiting more. The characters came alive for me, as did the city of Amsterdam, and the story is an extremely well-told tale of mystery and intrigue - almost cinematic in its breadth.. Unfortunately there came a point at which I started to suspect that the payoff was not going to be nearly as interesting as everything that was leading up to it and it was a real let down when I realized that my suspicion was correct. I kept reading because I kept hoping that the author would find some way to make this a more perfect story, but in the end it didn't happen.Still, I was absolutely compelled to read the book until the end, which is a testament to the talent of the author and something that hasn't happened to me in quite a while.", "Star": "3.0 out of 5 stars", "Title": "Couldn't put it down. Tremendous writing, but the plot falls short."}, {"Upvote": 0, "Review": "THE MINIATURIST by Jessie Burton is an intriguing novel, but it comes to no ultimate point. There are far too many unresolved issues remaining when the reader falls off the last page into the sea. For one thing, the title character never actually enters the story, and the point of the figures and miniatures she creates comes to no conclusion. All sorts of loose ends bob in the Dutch tides, as for instance what becomes of the sugar? Why did the hero pull such a raw deal on the heroine in the beginning? He doesn't seem to be such a rotter later on. What's the point of making an anagrammatic joke out of Otto's name by calling him \"Toot\"? The book is an enigma buried in a gamine wrapped in imagine!", "Star": "3.0 out of 5 stars", "Title": "To No End"}, {"Upvote": 0, "Review": "The book starts with our main female protagonist seeming like this meek and mild young women. Nella is on her way to meet her husband who she has meet only a few times when one of those times when they were married. I really felt for her she was going into this marriage with so much hope. Yes her husband Johannes was older than her but she looked forward to being married and leaving home to a new adventure. Her marriage wasn't anything like she thought it would be. Nella barely saw her husband and had to deal with her miserable and stern sister-in-law. Throughout the book many twist and turns occur, which in turn make Nella stronger. At first reading this book I wasn't sure how I was going to like it. But the mystery of the miniaturist and the strangeness of the house sucked me in. I would definitely recommend this book, especially if you like historical fiction with a mysterious twist.", "Star": "4.0 out of 5 stars", "Title": "Mysterious with quite a few twists"}, {"Upvote": "2", "Review": "For me this book fell somewhere in-between a historical novel and a fantasy.  The writing was superb but I found myself uncomfortable with the many times that author Jessie Burton asked me to forgo common sense and accept the wild outrageous plot points that this story depended upon.While I loved the descriptions of the life and times of seventeenth century Amsterdam I questioned the ability of the miniaturist to foresee the future.  Who was this person?  How did the miniatures get altered?  This was never explained. Why did she vanish half way through the book? Maybe there was something I missed.  Did Johannes actually have a carnal encounter in an alley?  Wasn’t he smarter than that?  The father of Marin’s baby seemed obvious to me from the first mention that she was with child.It is hard for me to explain my feelings towards this book.  Nella, Marin, Cornelia, Otto, Johannes all seemed to be operating independent of each other yet somehow the book held me captive.  I fell into their lives and time from the oppression due to the religious fervor of the period to the description of Marin’s fur underpants (now there is a whole research project in Literature 101).I think that if the author would have locked down her genre I’d have given this book more stars.  There is very good writing in search of a genus.", "Star": "4.0 out of 5 stars", "Title": "Very good writing in search of a genus. 3.5 stars"}, {"Upvote": 0, "Review": "The prose is beautiful, but the story read like it was a draft--a pastiche of ideas with too many holes. The storyline of the Miniaturist was barely tied in. Also, many occurrences are modern day thinking/behavior imposed upon history, and that heavy-handed ending made no sense to me. I read this in Amsterdam, a place I frequently visit and I enjoyed the parts of the book that I could. I also loved seeing the dollhouse a few times.", "Star": "3.0 out of 5 stars", "Title": "Read like the plot got away from the author"}, {"Upvote": "3", "Review": "I loved the uniqueness of this book.  It held lots of suspense.  In a country and a time I knew little of I found it fascinating.  Burton is a very imaginative writer and she obviously did tons of research for this time period.  The characters, every one of them, were odd and purely individual: This and the story line which had a few twists kept me reading  I was a little disappointed at the end when the protagonist's response was a little unemotional towards her husbands situation.", "Star": "4.0 out of 5 stars", "Title": "Dark and strange but worth it."}, {"Upvote": "4", "Review": "I wasn't really thrilled with the ending as I would have liked to known more about the Miniaturist....but, I couldn't put the book down as I needed to know what was happening.  Read it in two days.", "Star": "4.0 out of 5 stars", "Title": "... really thrilled with the ending as I would have liked to known more about the Miniaturist"}, {"Upvote": 0, "Review": "The Miniaturist by Jessie Burton takes places in the late 1600's in Amsterdam. The \"heroine\" of the story is Petronella, an 18 year old country girl who married Johannes Brandt, a wealthy trader. As a wedding gift, Johannes gives Nella a miniature house, a replica of the one they live in. For some reason, he thinks that Nella will devote her time to decorating this miniature instead of making demands on him. Nella makes her first order for pieces to add to the house. Following that, eerily, pieces keep arriving, unordered, that prophesy happenings within the home. That is the best part of this entire book: the mystery of who is making the pieces and how they know what is going to happen. The rest of the book just dabbles in too many things: racism, homosexuality, slavery, class division, religion run rampant. These topics are introduced but never fully developed nor are the issues put to rest, they just hang there and are never finalized. I'm glad I read the book, but it will not go on the re-read pile. 3 1/2 stars.", "Star": "3.0 out of 5 stars", "Title": "That is the best part of this entire book"}, {"Upvote": "30", "Review": "I didn't find it particularly well-written. It is a personal pet peeve of mine when stories are written in the present tense, but that is a personal preference. Furthermore, I didn't care for the sexual content of the story.", "Star": "1.0 out of 5 stars", "Title": "I didn't find it particularly well-written. It is a ..."}, {"Upvote": "2", "Review": "I wanted to read \"The Miniaturist\" before the movie came out.  I liked it and I wanted more.  The ending was not satisfying....there should be a sequel or at least another 10 chapters to bring it to a better close.  Never read a book about Old Amsterdam before and that was good history lesson, the subject matter was also surprising...didn't expect that. Disappointed that the book did not go into the background of the miniaturist more.  I did enjoy the book and do recommend it. It is NOT for children.", "Star": "4.0 out of 5 stars", "Title": "Good read"}, {"Upvote": 0, "Review": "I have had this book for some time and was inspired to dig it out of my Kindle after watching an episode on PBS’s Masterpiece production of the novel. Better late than never! It is a well written engrossing story and history lesson set in an Amsterdam of long ago when the merchant class reigned amid stern religious repression.", "Star": "5.0 out of 5 stars", "Title": "Finally Read This"}, {"Upvote": 0, "Review": "This book paints a portrait of life in Amsterdam in the 1600’s.  The characters drawn by the author are compelling and the plot moves right along.  Through the story there are several themes being explored including the inhumanity of mankind, the rights of government as opposed to the rights of governments, and how much control we actually have over our own lives.  In the end, the book is both encouraging and very dark.", "Star": "4.0 out of 5 stars", "Title": "Miniaturist"}, {"Upvote": "3", "Review": "This simple title and description fooled me. It seemed a light read, probably entertaining. Instead, the author guided me room by room through lives that were each surprising, poignant, and dear. The details pull the reader through an oiled surface into honest humanity. This story was such a welcome change in its depth of characters, showing how few simple answers there are while navigating life. Somehow, the characters were flawed, unexpected and entirely welcome because of their unvarnished portrayal. Special thanks to Burton for pulling this off.", "Star": "5.0 out of 5 stars", "Title": "Honest. And thank you for that."}, {"Upvote": "3", "Review": "I enjoyed this book very much. The premise is very intriguing. The characters are well-developed and interesting and the descriptions are well-drawn without being over-done. The plot bogged down a little in the middle and the ending sort of fizzled out, instead of closing with a bang. But my biggest complaint was the lack of exploration of the title character, the miniaturist. I would've loved more explanation about her. Still, this is an enjoyable read.", "Star": "4.0 out of 5 stars", "Title": "Intriguing Premise that Doesn't Completely Deliver"}, {"Upvote": "2", "Review": "Every so often, alas, not often enough, an author comes along whose writing is far superior to the drivel that is printed in our era of self-printing.  Burton is such a writer. She is not only a talented writer but a writer who can create original characters and a fascinating plot. From the opening pages of \"The Miniaturist\" to its closing, the reader is caught up in a story that unfolds as part mystery, part fantasy, and part coming of age. The main character, a young woman in an arranged marriage begins her married life in late 17th century Amsterdam, a city of enormous wealth. Its citizens are torn between covetousnes and the horrific Calvanistic prejudices practiced by the city fathers and condoned by the church.  Gorgeous prose and engaging characters kept me glued to the book despite the slightly off-beat plot, and it is offbeat.  Ms Burton is a writer to watch.", "Star": "5.0 out of 5 stars", "Title": "Along Comes a Writer . . ."}, {"Upvote": "35", "Review": "This book was a major disappointment. The title character is viewed from a distance and largely unexplored, certainly from any personal or emotional point of view, and a relationship that results in a pregnancy is never explained despite the fact that it occurred between a servant and a member of the illustrious family. The destruction of the doll's house seemed bizarre to me, not least because earlier this year I admired it in the Rijksmuseum in Amsterdam (thus my interest in reading the book). The abundant praise this book has received is, for me, largely undeserved. It is atmospheric if emotionally unengaging, and although I must admit that I did finish it, it was mostly in the hope that some of the loose issues would be eventually resolved... but, alas, they were not.", "Star": "1.0 out of 5 stars", "Title": "This book was a major disappointment. The title character is viewed from a distance ..."}, {"Upvote": "6", "Review": "The setting of 17th Century Golden Age Amsterdam is richly described through the atmospheric neighborhood, the roles between the sexes, the Calvinistic obsession with sexual mores, the artistic heritage of this country so heroic on the sea and so detailed in design and aesthetics as the exemplified by the Miniaturist. The novel weaves texturally like the carpets that warmed the rooms of their mansions, like the miniature house cabinet comes to life when the protagonist is given it as a wedding gift. Lush descriptions of the perceptions of the people of that era, the main characters are a selection of odd people united in their secrets, the new wife, the controlling sister-in-law, the intersection of colonial business and intimate marriage contracts and the drama of scandal and crisis of justice and punishment. A remarkable book that builds slowly like a constructed home and community and builds speed with mystery and suspense. For some the ending was passionless, almost stark but I felt that was a neatly constructed completion coming at the end of chaos, much in context with the needs of the time.", "Star": "5.0 out of 5 stars", "Title": "Amsterdam's Golden Age is an Artful Setting for Mystery and Suspense"}, {"Upvote": "2", "Review": "Although this is well written, I would not recommend it. I found it difficult to believe that a minaturist could influence so many people in such a profound way, without having any explanation of how it was done. We never know why she creates what she does. The heroine is really dumb and naive. Even then, it must have been something for a young girl to have known as little as she did. Yet, she acts with wisdom and insight in many matters, other than her marriage. I could have done without the details of her husband's torture. The plot is gloomy and gets gloomier as the book progresses. The stars I have given are for the excellence of the technical writing, not for any storytelling, character development, compelling plot line or anything other than the quality of writing.", "Star": "3.0 out of 5 stars", "Title": "I would not recommend it. I found it difficult to believe that ..."}], "Star": "3.9 out of 5 stars", "Name": "The Miniaturist: A Novel", "Format": "Format: Paperback", "Price": "$14.01", "Author": "Jessie Burton"}