{"Comment": [{"Upvote": "43", "Review": "My dear correspondent,I’ve always had to wonder when I read a novel comprised entirely of letters. I think, well, it’s either going to be very, very good or will peter out after the second chapter and become tedious, repetitive, and boring.I’m happy to say that “The Guernsey Literary and Potato Peel Pie Society” by Mary Ann Shaffer falls definitely into the former and not the latter category. It is very, very good, and (if I had to assess why) it’s because Shaffer tells a story and stays in command of the story to the very end. And the story itself is a dramatic one and based upon a recent historic event – the occupation of the Channel Islands by the German army during World War II.The Channel Islands lie just off the coast of France but have allegiance to Great Britain. Technically, they are not part of Great Britain, but their inhabitants sound (to an American ear) as British as any Briton. They were owned by Duke William of Normandy, who retained ownership after he invaded and won Britain in 1066.Because of the proximity to France, the British Army and Navy couldn’t defend the islands, so they became as much German-occupied territory as France and the rest of Europe. Their people were treated much the same as the rest of Europe. Which means very badly indeed.But it’s now 1946, and writer Juliet Ashton, fresh from a rather surprising success as the author of a collection of her funny wartime columns for the Spectator, is casting about for a new project. She’s previously written a biography of Anne Bronte, which wasn’t exactly a bestseller. So, the success of her collection of columns is welcome news indeed.Juliet receives a letter from a Guernsey resident named Dawsey Adams, a pig farmer interested in, of all things, the 19th century writer Charles Lamb. He has come to own a book of Lamb’s writings originally owned by Juliet (her name and former London address – bombed by a V2 rocket late in the war – is written in the inside cover. She begins a correspondence with Mr. Adams, and soon finds herself writing to other members of The Guernsey Literary and Potato Peel Pie Society, a reading group formed rather hurriedly (as in, on the spot) when the Germans found a group of Guernsey residents out after curfew.In London, Juliet finds herself being amorously and rather relentlessly pursued by a wealthy American, but she isn’t sure if she’s interested or not. So a trip to Guernsey is just the ticket to work on a book and escape the would-be lover. And it is on Guernsey that Juliet discovers but never meets the founder of the society, Catherine McKenna, whose story becomes a story of the war, how people survived the occupation, and how they didn’t.Shaffer, who worked as an editor and librarian and also in bookshops, died in 2008. The novel was completed by her niece, Annie Barrows, the author of the “Ivy & Bean” and other children’s stories and the novel “The Truth According to Us” (2015). And while I want to tell you that you always want to see an author enjoy a well-deserved success, there is something about all of this that fits the author’s story and the story she tells.“The Guernsey Literary and Potato Peel Pie Society” will make you laugh and make you cry. You will be struck silent at times. You will see how people cope in horrible circumstances, and what they to do help (and hurt) each other. And you will learn the difference books can make (including being used for kindling, but that’s another story for another letter).Oh, before I forget, the book’s been made into a movie of the same title, coming soon (I hope) to a theater near you! It stars Lily James (of Downton Abbey and Darkest Hour fame) as Juliet, and there are several other Downton Abbey stars in it.Sincerely and with warm regards,Glynn", "Star": "5.0 out of 5 stars", "Title": "very good or will peter out after the second chapter and ..."}, {"Upvote": "45", "Review": "I forgot how much fun it is to read good, old-fashioned correspondence. These letters, especially the ones written by the central character, are jaunty, naughty, full of personality and spunk. Her response to a dinner invitation, for example, is “Yes, dinner with pleasure. I’ll wear my new dress and eat like a pig.”Pigs end up playing a major role in this wonderful little book when the author connects with some villagers on Guernsey Island, who have recently emerged from German occupation during World War II. She learns how they outsmarted the Germans, who were fussy over farm animals, according to one explanation of how The Guernsey Literary Society came about in the first place. Spoiler alert: it was because of pigs.Their mischievous pig roast compelled them to keep up appearances as the literary society they indeed were not. Yet, as one of the inciters of the pig roast writes, “Once two members read the same book, they could argue, which was our great delight.” Their original naughtiness eventually morphed into a sweet band of friends who “read books, talked books, argued over books, and became dearer and dearer to one another.”The characters are vivid and easy to love, like the characters in Foyle’s War and 84 Charring Cross Road, carrying on despite the undertow of war rumbling beneath them. The writing delighted me, because so much of it made the familiar, ordinary things of life fresh and beautiful and fun (like when the author confesses really like to leave London to live on Guernsey instead). She writes, “The only thing I’d truly miss about London are Sidney and Susan, the nearness to Scotland, new plays, and Harrods Food Hall.” Refreshing: a little bit naughty, a little bit spice. My favorite line in the whole book is her contention that, “Reading good books ruins you for enjoying bad books.”I consider it a compliment to say that this was such a good book, it may have ruined me for whatever one’s next!", "Star": "5.0 out of 5 stars", "Title": "Thank Goodness for Pigs!"}, {"Upvote": "45", "Review": "Heaps of reviews so not much I can add here...but....Lucky me, I got to read it while visiting Guernsey!Was this book worth the Kindle Price?  $8.63 USD.  Yup, absolutely!Is it a page turner?  Yes.Did I want to be reading this book when I wasn't reading this book?  Yes.Did I learn anything from this book?Yes, loved all the information so subtly provided about the German occupation.  It's like a history book without the boring bits.Did I think about this book after I was finished reading.Yes, it has stayed with me.  It's been a month since I put it down but I still do think of it.  Luckily, I was able to get a fridge magnet of the book cover while in Guernsey.My only negative comment - now this may sound petty as I really did enjoy all the books and all the characters!  But I did notice they all have the same voice.  We don't all write letters in the same style and this was not reflected in the book.  All the letters were written in the same particular witty style.  Made for good fun reading but I did find that a bit strange as like I said, we do all write differently!", "Star": "5.0 out of 5 stars", "Title": "A joy to read"}, {"Upvote": "18", "Review": "At the risk of sounding like everyone else, I so badly want to go to Guernsey!! I should actually say that I want to go BACK to Guernsey because I feel like I've just returned home after a long visit there with all of my dear friends. And, in a strange way, I feel a little shell-shocked inside because of all that occurred while I \"was there\".\"The Guernsey Literary and Potato Peel Pie Society\" is a book that took me by surprise. Being an epistolary novel, I wasn't expecting an abundance of detail or character development. I suppose I was expecting a chatty and carefree book that just skimmed over the tops of things. It was chatty and it was carefree in parts, but oh, it was so much more.The characters didn't just write letters that barely touched on their experiences during the German Occupation (in Guernsey), what had happened during the war in London or with what was going on in their current lives. They delved right in and gave a tremendous amount of details. Some stories made you laugh out loud, some made you furious or shocked and some even brought you to tears. I think what touched me the most is that these types of stories really DID occur during WW2. They aren't far-fetched situations that would never have happened - they DID happen. THAT'S what brought me to tears on more than one occasion.There is just so much that I could say about this book. Lol I don't even know how to express properly how awesome I truly thought it was. It is a multi-faceted gem that I am thrilled that I FINALLY discovered.", "Star": "5.0 out of 5 stars", "Title": "What a Journey!!"}, {"Upvote": "8", "Review": "This is a different sort of WWII novel in that it takes place post-war but relates events from the war.  It is an epistolary novel and one has to get used to the various  letter-writers. The chapter headings indicate a change in narrator but the voice is not always that different and so the events within in the narrative have to remind the reader of who is talking.  Eventually that is not much of an issue as the narrators become fewer.  The story is original and at times amusing and/or poignant.  The literary references are fun...the more one has read, the more one has insights into the ironies or asides.  I recommend it highly as an original, interesting, historically unique perspective on WWII.", "Star": "4.0 out of 5 stars", "Title": "Amusing and Poignant tale of WWII - post-war"}, {"Upvote": "6", "Review": "I didn’t think I’d like this book, as there is no dialogue and nothing happens in real time.  It is composed of letters and telegrams only.  However, I decided to try it when it became a Kindle Daily Deal and liked it much better than expected.  It deals primarily with the lives of people living on Guernsey, a Channel Island during World War II beginning with the German occupation.  It has romance, humor and sadness.  Most of all it shows us the effects of the occupation on ordinary people and how they coped with the deprivations.", "Star": "4.0 out of 5 stars", "Title": "Didn’t Think I would Like It"}, {"Upvote": "6", "Review": "I really wanted to love this book, but it was just \"ok\" for me. I did not enjoy the format of it, although many would not really care about that aspect. It is written as correspondence between many characters. I did really enjoy the characters, though, and did not have any difficulty following the story. However, I really wish there was a bit more discussion of Juliet and Dawsey's relationship. It just seemed to come out of the blue, with no real excitement leading up to it. I didn't get much satisfaction out of it, for that reason. It was a very cute book, though, and I love a book about books and reading. Very well-written. I will definitely watch the Netflix adaptation - I have a feeling this is going to be one of those instances where I like the movie better than the book, and those times are rare.", "Star": "3.0 out of 5 stars", "Title": "Very cute book, well-written, but was just \"ok\" for me."}, {"Upvote": 0, "Review": "With Europe just coming out of WWII, Juliet Ashton is looking for something to write about. She receives a letter from someone on Guernsey who belonged to The Guernsey Literary and Potato Peel Pie Society during the occupation. From there Juliet begins corresponding with several members of the society. Eventually she goes to Guernsey to meet the people that she has been corresponding with and not only falls in love with them, but also with Guernsey itself. Written in letter form, Juliet corresponds with several members of the society and with her editor about what happened on Guernsey during the occupation. When Juliet arrives on Guernsey she is at a loss as to how she wants to write her book, but eventually she finds her purpose and her goal and a new life for herself.Okay, how had I not heard about this book?! My sister told me about it and said I must watch the movie. Well, I don't get Netflix so that wasn't going to happen, so she told me to get the book. I did, just to appease her! I AM SO GLAD I DID!!!! I absolutely loved this book! I fell in love with Juliet, and I definitely fell in love with all of the characters in Guernsey. Most of the time I chuckled through their antics, but the book isn't all that light-hearted. There are many stories that hurt the heart about the German's occupation. I loved how accepting the characters were of Juliet and how much she became a part of their group. This book warmed my heart and the characters will stay with me for a long while. Definitely a top favorite of books I've read this year! Now to get my hands on someone's Netflix account!!!", "Star": "5.0 out of 5 stars", "Title": "the guernsey literary and potato peel pie society"}, {"Upvote": "4", "Review": "A different take on WW II as seen by a youngish woman journalist in London who makes contact with the natives of Guernsey, a UK island in the English Channel and how they dealt with the occupation of their small community by German troops through the entire term of the war. The entire book is the exchange of letters from the female journalist with her long time friends and, as the story develops, the exchange of letters with a variety of the members of  The Guernsey Literary and Potato Peel Pie Society, telling how the name and society came about, about their lives during war-time and shortly after the war of five long years has ended.  This was a different look at WW II than I had seen it before and became more aware of what the people had to deal with and endure though they only were under bombing attacks as actual fighting across the Channel in France was drawing to a close.  The book was recommended to me (albeit after I had already begun reading it), I enjoyed it , and I recommend it to others.", "Star": "5.0 out of 5 stars", "Title": "A bit of a different view of a segment of rural England during World War II"}, {"Upvote": 0, "Review": "A serendipitous stroke of fate brings Guernsey islander Dawsey Adams and Juliet Ashton into the same orbit. Their acquaintance begins with letters just as Juliet is searching for a subject for a new book to write as World War II has ended. Through letters alone, we are introduced to Juliet and a wide range of characters from a brash young American publisher, Juliet's British publisher, her best friend, and a host of eccentric but endearing personalities on Guernsey, an island in the Channel Islands. The book mostly concerns the German occupation of the Chanel Islands (of which, I'm ashamed to say, I didn't know about). Even the Germans, tangentially, are characters, through their cruelty and also through their decency. On the side, the book is a love story in so many ways.I can't say enough that you should read this book. The characters blaze with life and the story is one that should be told about a time we should not forget. If I could give this book 20 stars, I would!", "Star": "5.0 out of 5 stars", "Title": "I wish there were more stars to give this great book!"}, {"Upvote": "8", "Review": "This book came recommended from some friends and so I bought it and let it sit for a while.  It caught my eye again when looking for something light after a bit of a heavy read and filled the space perfectly.The story takes you back to a place in time when the people who have survived a very serious darkness are in need of some soul searching and saving.  Touching, but with some bitterness, some troubled waters, we are delivered to a small bit of fresh air and perspective in an island town with a story to tell.  Through the pages of letters and telegraphs we are introduced one by one to our endearing author and all of those she holds dear, and a few she does not.  We learn the history of their sufferings and the salves of their healing as she finds her own story in the pages of her yet unwritten book.Though mostly a romance, this story is not the heart bleed or flesh driven frenzy often found in the romance section and the love story is much more encompassing than just a girl meets boy dynamic.  There is also quite a bit of history, marginalized as island culture often is.  I enjoyed the format of the letters and notes as it gives so many perspectives and provides me, the reader, with plenty of stopping points (though it also makes it that much easier to read just a tiny bit more).  However, without an in-depth character voice, it also kept the book from getting deeper, more serious in some parts, but perhaps for the better as some of the subject matter could certainly have gotten heavy and severe.  As it was, it remained a quick and easy feel-good read that left me smiling.", "Star": "3.0 out of 5 stars", "Title": "Sweet and Swift"}], "Star": "4.7 out of 5 stars", "Name": "The Guernsey Literary and Potato Peel Pie Society", "Format": "Format: Paperback", "Price": "$13.39", "Author": "Mary Ann Shaffer"}