{"Name": "Overlord, Vol. 8 (light novel): The Two Leaders", "Author": "Kugane Maruyama", "Price": "$13.52", "Format": "Format: Hardcover", "Star": "4.7 out of 5 stars", "Comment": [{"Review": "To my understanding, the volume takes place during volume 5 and part of 6. Which is why when others are thinking about Ainz's alter ego Momon, people reference his feats from volume 2 instead of 6. The book itself is split between Enri's story, Ainz's with some events overlapping but from their perspectives, and some of the beings from Nazarick.As for the book itself, while it doesn't advance the story, it still is a wonderful read. There was a bit of humor towards the end that really made me laugh harder than anything else in a while. While you usually get to see Ainz's thoughts throughout all the books, this book is a great example of what goes into being the leader of Nazarick is like for him. There are also hints of what his changing perspectives about the world around him have become and where it will lead him come future volumes.", "Upvote": "2", "Title": "A short snacky side story to enjoy!", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "I need faster releases. This is such a great series, the publisher need to make it one of its main releases to focus resources on!The Overload series stands out amid so many cookie cutter animes, manage and novels because of the characters. I love that the author makes no bones (hehe) about the fact that the denizens of the Tomb of Nazarick are evil. They are not the bad guys, but they're definitely evil, LOL. And Momonga, now Ainz, doesn't even realize how evil he has become as he grows into his role as a Ruler.IAfter Overload came out the can been so many series trying to get in the niche it helped, but Overload is a lot to live up to. It manages to deliver without having to rely on fanservice, though you many find some here and there, and in some offical artwork.IAnyway, pick this series up if you haven't already. If you're thinking of dropping it don't! There is some fun excitement in store for the next volumes.", "Upvote": 0, "Title": "Eagerly awaiting the next volume", "Star": "5.0 out of 5 stars", "positivity": 1}]}