{"Name": "Blackwaters (A Kate Reid Novel Book 4)", "Author": "Robin Mahle", "Price": "$4.99", "Format": "Format: Kindle Edition", "Star": "4.5 out of 5 stars", "Comment": [{"Review": "This book left too many unanswered questions about the killer's childhood.  I felt cheated after so many hints but no answers.  I wasted my time reading this book.The plot was good but was incomplete without the details of what had actually happened during the killer's childhood.Also the author called the sister Charlie/Charlene in the beginning but later called her Janelle.", "Upvote": "11", "Title": "A most unsatisfying read", "Star": "2.0 out of 5 stars", "positivity": 0}, {"Review": "Just finished this book today, and I couldn’t put it down!  Robin Mahle writes extremely well.  The plot moves along quickly, and the personalities of the characters are brought out very well during the telling of the story.  Kate Reid is working on her first FBI case as a full-fledged FBI agent, and the killer is incredibly evil.  She’s working this case with Agents Dwight and Nick, along with a very personable local police detective.  It’s interesting to see how Kate’s heart tries to find its home while working on this case.  Very good read.  I can’t wait for Book 5 to be published!", "Upvote": "12", "Title": "What an evil murderer!", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "Except for a few misspelled or forgotten words this is another great book in the reimagined life of Kate Reid.  Kate is through the FBI training and is assigned to the Washington office but without Nick.  He is on administrative leave until the details of the last case are finalized.  Dwight Jameson is to be her mentor in a new case of dismembered young women.", "Upvote": "6", "Title": "Blackwaters (A Kate Reid Novel Book 4)", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "I truly love Robin Mahle's writing  , every book so far , this is 4 , just keeps the same momentum going. Kate Reid is a hero, to have been where she started, to Newbie FBI agent and still has plenty to come. Robin is a genius.", "Upvote": "8", "Title": "Kate Reid keeps me involved.", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "Kate has matured, still dealing with the lost of Marshall, decisions of getting rid of the car. Working with Dwight on a case, trying to spread her wings. The reinstatement of Nick, who she stood by for his 2 months while the board decided. A lot  of changes, she is having to deal with, and as readers we enjoy her character and following her steps. Good series, and looking for next book.", "Upvote": "5", "Title": "A BAFFLING CASE FOR KATE", "Star": "4.0 out of 5 stars", "positivity": 1}, {"Review": "I have read books one thru four! Going to find book five! Each story builds on to the other and love the characters. Can't wait to start the next. Thank you!", "Upvote": "6", "Title": "Blackwaters", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "Love this Kate Reid series.  She's proving herself while still dealing with her personal doubts and sadness.  This was one weird, crazy, bad killer. It's sad to think there's people like him, no heart, just revenge at any cost. The story moves nicely along keeping your interest the whole way. Read it in one sitting.  Seem to think something might be progressing between Kate and Nick. The story is so well written you feel the same emotions as if you're right there too.", "Upvote": 0, "Title": "A REALLY GOOD MYSTERY , EXTREMELY GOOD", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "A fast, easy, hard-to-put-down read. Even though I haven’t read the previous book in the series, Ms. Mahle made it easy to pick up the gist of what happened without being obvious. Th characters are strong, with enough flaws ti make them believable. I’m looking forward to reading the next book, and might go back to previous ones just to fill in the blanks.", "Upvote": 0, "Title": "A fast read.", "Star": "5.0 out of 5 stars", "positivity": 1}]}