{"Comment": [{"Upvote": "544", "Review": "Review for The Lord of the Rings.I'll keep it brief, this is not a review of the actual story but of this specific edition. I have attached many pictures that I hope help you decide if this is an edition you want to buy.Pros:- The font is big and easy to read.- 65 beautiful illustrations by Alan Lee that bring the story to life.Cons:- Slipcover is an opaque plastic, whit a modern look that I think doesn't complement the book.- One or two blank pages before and/or after each illustration.Overall I think this is a great edition and it's worth buying.", "Star": "5.0 out of 5 stars", "Title": "A great edition for the price"}, {"Upvote": "72", "Review": "I have never read the lord of the Rings before but I have watched the movies and played the games and I loved them. However I was always confused at what was going on at times but after reading the books everything makes so much sense now. I honestly liked the books more than the movies and although they are similar the books have way more content and details in them. So if you loved the movies I would 100% suggest getting the books.Speaking of the books I got the paperback version and they are beautiful. Although they are simple and the covers are one plain color per book it still has that sense of style and simplicity. They covers and case are thick and well made. Although their were points in the books where the words were slightly faded I still has no problem reading them.I'm not even going to talk about the story since just trust me when I say its one of the best series ever. I have never read or even considered reading a series twice but I honestly think that I might read this one a second time that's how much I liked it.So if you liked the movies and aren't sure about reading the books I would say go for it and get them since you wont be disappointed. If you never watched the movies then get both them and the books:)", "Star": "5.0 out of 5 stars", "Title": "Its no wonder the Lord of The Rings is so popular, it truly is worth reading a second time"}, {"Upvote": "19", "Review": "What can you say about a classic?  I'd never read these books all the way through before, and was determined to try, despite remembering what I had read as being tedious and somewhat purple-prose-ish.  I apparently remembered wrong - coming back as an adult, these are beautiful books, very well-written and of course true epic fantasy.  It may be that my tastes have changed, or just that I've matured, but these will definitely be reread many times.My only issue is that with the Kindle version, the footnotes seemed to be messed up.  Many of them only bring up a page number (with no link), which may be how it was in the original books, but others seem to apply to footnotes further down the page, or just not at all to the thing they're noted from.  Frustrating.", "Star": "5.0 out of 5 stars", "Title": "Epic fantasy by the master."}, {"Upvote": "12", "Review": "I have always loved medieval sort of books and movies. But I had never seen or read any of the LOTR.  Over this summer i planned on reading all of them and i have just finished them. What i can say is that these are amazing.You always hear about how much of a world J.R.R Tolkien creates but you never understand this until you read the book.The story and the characters let you fall into the midsts of the book with every turn of the page you wonder what will happen next.Also for people who haven't read or watched the movies it is amazing to watch the movies after you read the book.Best quote\"One ring to bring them all and in the darkness bind them.\"I only hope I can find another book to live up to the quality these did.", "Star": "5.0 out of 5 stars", "Title": "The Ring"}, {"Upvote": "479", "Review": "Having only an old 1994 worn paperback edition of the Lord of the Rings, I wanted to purchase a version that I could read and display for many years to come.  I did a ton of research and decided upon this version (ISBN 116-1749849-2513827), illustrated by Alan Lee and published by Harper Collins in June 2014  (I am adding these details because the Amazon.com site does not make it clear what this version is).  Please note that this particular printing is NOT available in the US but any Tolkien or LotR devotee should not be deterred (Frodo wouldn't have been!).  I must say that this is the finest published one-volume version of the LotR that I have ever laid eyes upon, and is well worth every penny.  It includes approximately 50 high-quality color illustrations by Alan Lee, which even for a 30-something like me makes the reading experience exceptional.  The front and back covers are made of durable, high-quality cloth (as shown), with a strong and handsome turquoise binding.  The pages -- not just the illustrations but the entire book -- are glossy and made of \"whiter\" paper than you generally find, the margins large, and the typeset easy on the eyes.For those who care about such things, the printing is based on the 2004 corrected text, with even further corrections.  There are updated introductions/forwards by Wayne G. Hammond  & Christina Scull, authors of the authoritative \"LOTR Readers Companion,\" as well as by Douglas A. Anderson, who provides a detailed publication history of the Lord of the Rings.  The full appendices are included.Two-page red and black maps of Middle Earth and of Gondor/Rohan/Mordor adorn the front and back covers, with a map of the Shire before the first chapter.  Also present are other essentials such as the Doors of Moria and the Tomb of Balin.  The only drawback is that the facsimile pages of the Book of Mazarbul was not included, which I found to be surprising and a bit disappointing Also, the ring inscription and the Gandalf \"rune\" are printed in black rather than silver and red.  Probably the main issue is the clear plastic slipcover, which is barely bigger than the book itself, and it is difficult to slip the book back inside it after taking it out.  You are more likely to scuff the corners of the book.  That being said, these are far from dealbreakers, and the joy to be received from owning this edition far outweighs these issues.", "Star": "5.0 out of 5 stars", "Title": "Stunning Collectors Edition"}, {"Upvote": "10", "Review": "I bought it as a gift for my best friend, and the book is absolutely gorgeous! The cover has nice fabric-like texture, the pages are white and smooth, it has lots of illustrations. The book is big and heavy, so you won't be able to carry it around with you, it's designed for home reading. Can't recommend this edition enough: either as a gift or an addition to your library, it is a great buy.", "Star": "5.0 out of 5 stars", "Title": "I bought it as a gift for my best friend, and the book is absolutely gorgeous"}, {"Upvote": "9", "Review": "The hard-copy versions look nice and all, but I wanted to know more about the Kindle edition. And I wasn't looking for reviews of the story. That's been the subject of glowing praise for decades. I got tired of trying to find a review that would answer the only question I had. Couldn't find one, so I finally broke down and BOUGHT the Kindle one-volume edition. And the answer is: Yes, the table of contents is all bundled together at the beginning, as opposed to having a separate T-o-C for each \"volume\" (stop sneering, I've seen other one-volume e-books where you have to skip through the whole first section to get to the table of contents for the second section). More importantly, the T-o-C actually works. That's right, I can go straight to any chapter by tapping that chapter on the T-o-C (again, other e-books had a static T-o-C where no amount of tapping would take me anywhere and I had to keep flipping pages to get to the chapter I wanted). Everything else seems to be functioning without problems. Dictionary, highlighting, synching between my Kindle and my phone, etc., all work perfectly. And in addition to being about half the cost of the three separate volumes, the one-volume edition helps to keep the scrolling at a minimum when searching through my library.", "Star": "5.0 out of 5 stars", "Title": "Table of Contents works perfectly (Kindle edition)."}, {"Upvote": "10", "Review": "My wife and I decided we wanted a good set of the Lord of the Rings stories. We were poking around and really felt like their were only two options: some unexciting paperback editions or expensive collectors editions. Neither was terribly appealing, which is why we were so excited to find this set.The books are bound in a faux-leather material that's very pleasant to look at and to hold. They are each 'engraved' with the title, the Tolkein symbol, as well as his name. On the spine, you'll see something similar. The set comes with a display holder which holds all four books.Our original order actually came with a tear on one of the pages. Amazon replaced it quickly and easily. Kudos to them!Beyond that we have thoroughly enjoyed the quality of the books. Be warned, these are small! The books are smaller than my hand (6'2\" male), and the print could potentially be challenging for those who may not have excellent sight. That would definitely be worth consideration before sinking money into this set.I'm extremely happy with our choice of this set. The stories are, of course, incomparable. The quality of the books themselves are superb and visually appealing. I'm very happy to give this one 5 stars.", "Star": "5.0 out of 5 stars", "Title": "Absolute must-have for semi-collectors"}, {"Upvote": "2", "Review": "The Hobbit is one of my favorite books since childhood, and like many I reread it every couple of years.  Tolkien's rich tapestry changes with one's perspective, yielding new designs and colors from the vantage point of age and experience.  However, after a reader has come to know the work intimately, it becomes fun to experience some extratextual analysis from a scholar who loves the book as much as you do!  That's just what this annotated edition of The Hobbit provides.Douglas Anderson has provided rich marginal annotations, presented alongside the original text of the story.  These include references from whence Tolkien borrowed many of his creations--offering a window into Tolkien's reading life, etymologies of words, and textual differences between the various editions of The Hobbit.  The first edition was most different from the others, particularly in the Riddles in the Dark chapter, the first meeting with Gollum, which unfolded much differently.  Other than that, I found it striking how similar the editions were, how little Tolkien would have changed and how in keeping with his broader works the Hobbit already was.  There is much biographical information about Tolkien.  For example, we learn that he loved the works of poet Francis Thompson.  The margin also includes many charming illustrations from all the illustrated editions of the Hobbit that have been done throughout the world.  There is a centerfold of colored illustrations in the middle, including all of Tolkien's own art related to The Hobbit.  I like Tolkien's the best in most cases!  How could one man have had so much talent?The appendix offers the most complete version of the Quest of Erebor, Gandalf's recounting of the story, previously published incomplete in Unfinished Tales(hence the title, duh).  All in all, this fine book offers a fun and rewarding way to re-experience The Hobbit for even the most jaded Tolkien fan.", "Star": "5.0 out of 5 stars", "Title": "Great Way to Re-experience The Hobbit"}, {"Upvote": "2", "Review": "I have a friend who's been trying to get me to read this series, and I have resisted her suggestion quite strongly, as I had already seen the movies, and was worried that they would spoil the books for me, nor did I think that I would like the series, although, I had seen the movies, and thought them very well done, I didn't think the book series was for me, as I am very picky, especially when it comes to fantasy. But I was completely blown away by this first book in the series, there's some great world building, and and it doesn't take much to come invested in the story, to come to root and care for and about the characters. Now, I'm only wondering why it took me so long to read this. Well worth the read, one I'd highly recommend, now I can't wait to see what happens next.", "Star": "5.0 out of 5 stars", "Title": "Believe It Or Not(What Took Me So Long)"}, {"Upvote": "29", "Review": "I don't know how to write a review that would ever be able to adequately express all the wonder that is Tolkien's Middle Earth so I'll just share this:If I ever figure out how to add a picture to a review I will take a picture of my first copy of this book, the paperback version of the 50th anniversary edition, and add it to this review. It is split completely in half, the spine is ripped almost entirely off, and there are pages trying desperately to escape the confines of the super industrial-strength rubber band holding everything intact. (FYI: Do not try to use hot glue to reattach sections of a book back to a book's spine. It does not work.) I truly believe if potential readers could see how well-used my book is from all the times I've read it those readers would be frantically hitting the One-Click Purchase button on Amazon.Of course, if seeing my beautifully wrecked paperback didn't convince them to read it, then maybe the fact that I eventually had to replace it with the same edition, only hardcover, would do it. Or the fact that for those times I just can't lug around the real deal, I also had to download the ebook (though a different edition which my OCD thinks sorta sucks).In an interview with Christopher Lee, the actor who portrayed Saruman in the Peter Jackson film adaptations, he shared how he re-reads The Lord of the Rings each year. If I could get you to read it even once in your life  I would be happy. And so would you!P.S. For those people who think video games are the root of all evil, I would have to beg them to make an exception for an Xbox game called Shadow of Mordor. Now, I know diddly squat about gaming but my hubby and our son play that game together. Imagine my thrill when my 10 year old came asking all kinds of questions that had us mining the appendices at the end of the book for answers. He's not up for reading the book just yet, but the spark is there. Of course, it didn't hurt that I earned some massive cool points for knowing what was going on in his game world!", "Star": "5.0 out of 5 stars", "Title": "All the wonder that is Tolkien's Middle Earth"}, {"Upvote": 0, "Review": "I last read Fellowship just before the movies came out. I can't believe it has been almost twenty years. I first read them in the early 80's, probably in Middle School. I recently bought the trilogy as a special on Kindle.I've loved them each time I read them, although they aren't perfect. I find the lengthy songs and poems to be grating. The archaic word choice sometimes requires a trip to the dictionary (which the Kindle makes very easy).As for the Kindle edition, it is great. I found two flaws. Each chapter heading is a hyperlink back to the Table of Contents. I accidentally clicked them more than once. I just can't imagine who is flipping back to the Table of Contents like this. The second is the maps are too small. I've found in other fantasy books that the maps have a high resolution version you can zoom and pan around. I was disappointed that this wasn't present in this edition.There's a long history and forward on the series, which I found interesting. Who knew these books went through so many revisions over the years.If you like Epic Fantasy, this is a must read.", "Star": "5.0 out of 5 stars", "Title": "I've loved them each time I read them"}, {"Upvote": "5", "Review": "I have several versions of The Hobbit, which I've accumulated over the past 4 decades.  Not that I have all of them, not even of the English speaking versions.  Naturally the artwork of the movie trilogy eventually led me back to wondering if I've missed out on some great newer book version, and I ended up buying 2 more copies, this being one of them.Since the words in every English edition of The Hobbit are all the same, having been written by the same guy, it's the extras like the artwork, the commentaries, the bindings and the what-nots that may lead you to love one edition more than another.I must admit there is a lot to like about this edition.  Principally the annotations, which very much like the annotated Alice in Wonderland continue upon every page, with fascinating stuff not found in the actual text of the novel.  But the illustrations are also quite good.  From the standpoint of illustration alone, I think my favorite remains the 1984 edition with illustrations by Michael Hague.  Hague's illustrations were hardly on every page, but neither were they sparse.  What makes them nice is that they take up the full page, they are in color, and they are scattered about from beginning to the end of the book.In The Annotated Hobbit, besides the wonderful annotations, there are a large number of <alas> black and white, and partial-page drawings by various artists.  The drawings are quite good (and I am sure would be absolutely splendid in color and full-page).  Thankfully though this is NOT ALL.  In the center of the book are 8 full color pages of illustrations by 7 different artists.  Mostly they are two illustrations per page, and mostly they are Tolkien's own, but nicely supplemented by the visions of 6 other skilled artists.I guess, all things considered, this might be the nicest overall edition I own.  One can always wish for MORE full-color illustrations, and indeed I seem to have fully lost track of one other, really luxuriously illustrated though soft-backed edition.  But if you want the fine bonus of the annotations plus both B&W and full-color illustrations by 7 artists, this version should be yours.", "Star": "4.0 out of 5 stars", "Title": "Great combo of annotation and illustrations"}, {"Upvote": "2", "Review": "I cannot tell you how many times I have read this book. While Tolkien is not my favorite writer by any means, this is my favorite novel of all times. I believe that Tolkien's talent lies in character, relationship and world building and that's what makes books go from GOOD to GREAT to AWESOME. I really adore the characters in this book and Bilbo will always have a place in my heart. I 100% recommend picking up the audiobook as well. My favorite thing to do after a hard week is to put on the audio book and bake bread while I delve into words I've practically memorized. The audible audio book has little to no frills and the narrator does a phenomenal job at keeping to the heart of the series. You can tell who the different characters are by the subtle changes in his voice, yet he's not so drastically different that it's disorienting.There's really not much I can say here that hasn't already been said. The Kindle Version is JUST like the old tattered paper back I have in my bookshelf (I actually purchased the deluxe set to replace said tattered copy). I'm really glad I have this as apart of my kindle library! It definitely held up to the paper back and kept the magic of Tolkien with little to no changes in the editing.", "Star": "5.0 out of 5 stars", "Title": "Recommend to any book lover! Even those that HATE LOTR"}, {"Upvote": 0, "Review": "1. The text size in each book is set to keep the book as small as reasonably possible. This will cause difficulty for people with impaired vision. Most readers shouldn’t have an issue when you consider how comfortable the book is to hold in one hand.2. The pages are thin but still quite durable with the outer corners of the pages clipped/rounded. The binding seems very solid.3. The outer cover is where this edition really shines. It’s a matte vinyl material that has a leather feel with recessed and stained cover lettering. After reading The Hobbit, with no special care, there were no creases in the outer binding. I could hardly tell I had used it even though there were many nights where I only moved my bookmark a few pages.4. Price is a bargain for what you get. It’s a well made set that just feels right in your hands. It will FAR outlast any comparable paperback version and looks great on the shelf as well.5. REGRETS- only that I didn’t buy this edition  sooner.", "Star": "5.0 out of 5 stars", "Title": "Excellent quality and portability"}, {"Upvote": "3", "Review": "So, I finally decided to read this book. I love the movie, and I love the story and fantasy and science fiction as a whole... But Tolkien's writing is not my cup of tea. He is a brilliant linguist, and the story and world he has come up with in this book is amazing, but his writing is not engaging at all. He will spend pages and pages discussing the landscape and geography, or the minute details of a character that is only present for a few moments in the story... But then gloss over major events in the story in a couple of sentences. He'll write for a long time about songs being sung (sometimes in his made up languages), but barely develop some of the main characters.There are things I thought the movie didn't do justice, of course... But overall, the movie was so much more entertaining and well-written than the book.I'm really only giving it even 2 stars because I had the movie to frame the story before reading it. Without that, I feel I would have lost interest very early in in this book.Again...I don't want to take away from the brilliance of Tolkien himself and the world he created... He just couldn't convey it in an engaging way to me.", "Star": "2.0 out of 5 stars", "Title": "Brilliant linguist and incredible mind... But..."}, {"Upvote": 0, "Review": "I have loved, taught, and savored Tolkien's \"The Hobbit\" for almost forty years. In many respects it is a perfect novel. In no way should it be considered simply as the prologue to The Lord of the Rings. Tolkien draws heavily upon his scholarship of Old English and other Germanic heroic poetry in composing this flawless gem. He also explores and gives reign to his passion for the study and invention of languages. Written at the commencement of the events that witnessed Hitler's (read the Necromancer) rise to power in Europe, The Hobbit offers a new hero more in the mold of mid-twentieth century humanity, the accidental, if not reluctant burglar/adventurer who discovers his potential for courage and self determination as the (many) opportunities for learning and growth arise during the course of his journey, the request to restore the ancient treasure to Thorin Oakenshield and his twelve companions, by wresting it from the clutches of the evil dragon, Smaug . Bilbo Baggins' moral code rejects the premise that success is based on possession of wealth. Several times he rescues his companions using his own wit and strength of character. he acquires a sword, which he learn to wield against foes like the cannibalistic Gollum and the omnivorous spiders. He acquires and dispenses treasure during the course of his year long journey there and back again. He eschews cupiditas, the lust for treasure (which St. Paul identifies as the radix malorum, root of evils) that motivates almost everyone else in his narrative, except magical folk like Gandalf and Beorn, and heroes like Bard. He does keep his ring of power that he discovered in the Goblin Caves beneath the Misty Mountains, and does not return it to Gollum, but hey, nobody is perfect. Tolkien balances traditional narrative elements of early medieval heroic poetry with the moral and emotional needs of twentieth century humanity in his tale of Burglar Bilbo Baggins. Read it and discover the novel's enchantments for yourself.", "Star": "5.0 out of 5 stars", "Title": "I have loved, taught"}, {"Upvote": 0, "Review": "(Spoilers Contained Inside)  A classic! I have read it myself and to my children.  I love the Hobbits, they are my favorite fantasy characters and Bag End of Hobbiton my favorite fantasy place.  I found myself wishing with Bilbo to return to his hole in the ground and have a pipe by a crackling fire.  The book really flows well and does a nice job of developing characters and their relationships up until the end.  The entire novel builds suspense around the Dwarves and Co retaking their home and their eminent meeting with the fiery beast of Lonely Mountain.  However, I felt there could have been a bit more in the parties interaction with Smaug and with his demise.  It seemed rushed and forced a transition into the conflict at the end of the novel.  As much as it may surprise people who have read Tolkein before, I think he could have spent some more time developing Bard, the Master, and the whole story surrounding that particular area of Smaug's desolation.  I didn't really feel connected to the people and their problems.  The end of the story made up for what I feel are some shortcomings leading up to it.  I liked Thorin's turn and the interactions with the Elves and men.  I liked much of what Gandalf had to say and his part at the end.  I enjoyed the death of Thorin and the sadness I shared with the rest of his party.  Ultimately, I left feeling like I had been on a great adventure and along with Bilbo needed to retire to a hole in the ground, where of course, there lived a hobbit.", "Star": "4.0 out of 5 stars", "Title": "I love the Hobbits"}, {"Upvote": "2", "Review": "The book The Hobbit is a fantasy/adventure by J.R.R Tolkien that takes place in the fictional world of Middle Earth, which is the setting of most of the author’s works. The hobbit tells a fantastic story of adventure, danger, friendship, and courage, and serves as a prequel to the even more immersive and epic book series, the Lord of the Rings. This book shows that even the littlest of people can be the biggest heroes. I loved this book. It is set in a large, detailed, and lore-filled world that made me feel like I was there while I was reading it. The book also has many likable characters. The Hobbit starts out showing the life of Bilbo Baggins, a hobbit. A hobbit is much like a human. The differences between a human and a hobbit is that a hobbit only stands about 4 feet tall, and all hobbits have long and curly hair. One day while minding his own business, a wizard he knows named Gandalf the Gray shows up with a party of 13 dwarves, led by Thorin Oakenshield. While everyone eats dinner at Bilbo’s house, he finds out that Gandalf volunteered him to help in their quest to retake their home in the lonely mountain, which was taken from them by the dragon Smaug. Bilbo initially declines the offer to join the party, but changes his mind the day after they leave, and he catches up with them. The group embarks on a long journey through the misty mountains and mirkwood forest, making enemies and allies along they way.This book introduces many characters. Bilbo Baggins is a Hobbit who like nothing more than staying in the comfort of his own home and smoking his pipe. These qualities become evident throughout his adventure, as he grows very homesick. Perhaps his best quality is his courage, which shows, as he sticks by everyone until the very end. Gandalf is also a great character. He is a 5,000 year old wizard, and throughout those 5,000 years he has grown very wise and powerful. He knows all the ropes of Middle Earth, and is always there to offer some wisdom or fatherly advice.The author, J.R.R. Tolkien has a somewhat lighthearted and quirky way of writing. He always takes the time to explain things in the story. He also has built up one of the best fantasy worlds in all of literature, and has a way in his writing that makes your feel like you’re there. The Hobbit (and also Lord of the Rings) is set in a land called Middle Earth. It is filled with forests, mountains, and fantasy creatures of all types. Middle Earth is a fantasy world, and, like other similar fantasy worlds, everything is somewhat primitive. While there are big and beautiful structures and cities in Middle Earth, there are no technology or electricity. The main races; elves, dwarves, and mortal men, all have unique cultures. In conclusion, I believe that The Hobbit is absolutely worth reading. It is a fantastic journey of bravery, friendship and courage, that is set in a beautiful, massive, and lore filled world. Perhaps the best part is that it is just the beginning of The Lord of the Rings, an even bigger and amazing story.", "Star": "5.0 out of 5 stars", "Title": "The hobbit tells a fantastic story of adventure"}, {"Upvote": 0, "Review": "I know they're standard questions for all book reviews, but the \"How is the author's writing?\" question made me chuckle since I think most would agree that J.R.R. Tolkein's Lord of the Rings trilogy is one of the best-written, imaginative, epic tales of adventure, loyalty, friendship, magic, and good vs. evil that has ever been published.This third book of the trilogy follows hobbits Frodo and Sam to their end goal of returning the ring to Mordor, while the combined group of their hobbit, human, elf, dwarf, and wizard friends all play separate parts to help them get there.  They must all engage in strategy, and in battles to overcome the evil Sauron and Sauriman.The LOTR trilogy is a classic, and it's a series I recommend everyone read before seeing the movies.  It is just an amazing story.  (Peter Jackson does a fantastic job of translating these very imaginative and detailed books on to the big screen, and it's one of the few examples of cinematic versions of books that left me feeling good about how the story was handled as a film.)", "Star": "5.0 out of 5 stars", "Title": "J.R.R. Tolkein's LOTR Trilogy is a must read for all!"}], "Star": "4.7 out of 5 stars", "Name": "The Hobbit (Graphic Novel) with a subtitle of An illustrated edition of the fantasy classic", "Format": "Format: Paperback", "Price": "$17.00", "Author": "Charles Dixon"}