{"Comment": [{"Upvote": "5", "Review": "I.loved this book which was eloquently written.  The characters are nuanced and complex.  Set in New York, following World War II, we, the readers, are constantly transported between two women from different worlds.  We see shades of blatant anti-Semitism, each struggling with their own burdens.  Perhaps we also see that Eleanor,the Jewish character has pre-conceived ideas about the Gentile world.  Sometimes we see that bridges can be crossed when misconceptions are acknowledged and healing begins.  Please read this book.  I do not think that you will.regret it.  Kudos to the author for an extraordinary tome.", "Star": "5.0 out of 5 stars", "Title": "Engrossing and Deep"}, {"Upvote": "10", "Review": "As a Jewish person myself I could really relate to Eleanor, who in this book is also Jewish.  This book is about ignorance, how deeply ingrained it is, how it's passed down from generation to generation, about breaking down barriers.  This book takes place shortly after World War II, but what is really sad is that some of the same ignorance expressed in this book about Jewish people is still alive and well today.  Despite the saying that ignorance is bliss, it's not!  There's no reason to be ignorant in this day and age!I really liked Eleanor, she is honest and direct, stays true to herself, she marches to her own drummer, which I could so relate to!  The path she followed was not the norm for the time period.Anyway, this is a story about Eleanor, who is an educated, smart woman, a teacher, who meets Patricia, a WASP, they meet one day when the taxis they are in collide.  Patricia has a daughter, Margaux who is 13, she is in need of a tutor, which Eleanor becomes.  Eleanor and Margaux become close quickly.  How quickly Eleanor becomes ingrained in their lives, which also includes Wynn, a leacherous, vile man, who is Patricia's husband, and Patricia's brother, Tom, who is a charming flirt.I read this book in a day.  Basically once I started reading it I couldn't put it down.To me this book rings true.  Even tho this book takes place shortly after World War II, it could of just as well taken place recently. That's the really sad part!", "Star": "5.0 out of 5 stars", "Title": "This Book Really Spoke To Me"}, {"Upvote": "3", "Review": "Kitty Zeldis, Author of “Not Our Kind” had me captivated and mesmerized by her vivid and thought-provoking images and descriptions of the characters and landscape. The Genres for this Novel are Fiction, Women’s Fiction and Historical Fiction. The time period of this novel is set two years after World War Two, in both New York City and Conneticut.The author describes her colorful cast of characters as complex and complicated possibly due to the circumstances in this story. Eleanor Moskowitz,a young Jewish teacher is headed in a taxi in New York City for a job interview. Eleanor is a Vassar graduate, and has left her other teaching job for personal reasons. It is raining, and traffic is exceptionally slow. Suddenly another cab, hits the taxi that Eleanor is in. Eleanor’s lip is bleeding, and now it looks like Eleanor has missed her interview. It seems like fate when a kind stranger steps in. Little does Eleanor realize how this encounter will change her life forever. Patricia Bellamy invites Eleanor to her home which is close by.Patricia Bellamy is a wealthy, attractive and stylish woman. She lives in a dignified, elegant, older deluxe apartment house on Park Avenue. Patricia is a WASP, and hasn’t had Jewish people come to her apartment. Margaux Bellamy, her young daughter has recently recovered from Polio, and is left with a disfigured leg and limp. Margaux’s last tutor has resigned, and now a new one is needed. Margaux likes Eleanor immediately and requests that her mother hire her as a tutor.Eleanor feels uncomfortable in Patricia’s home. Eleanor’s mother is a gifted hat-maker, and they live in smaller crowded dwellings. Eleanor somehow feels an attachment to Margaux and takes the job. Eleanor now finds that she is using the last name Moss instead of Moskowitz, when she enters the building. Another problem is that Patricia’s husband is anti-semitic.Kitty Zeldis has written a novel that makes one think. I appreciate that the author writes about significant problems of the historical period, the aftermath of the war, the epidemic of Polio , differences in class, and religion, and discrimination. Is it possible for people from different backgrounds to be friends? The author also discusses family, traditions, friendship, love and hope. I loved everything about this book and highly recommend this to readers who enjoy the historical time period after World War Two, and the set of challenges it presents. I received an Advanced Reading Edition from the Publisher for my honest review.5 likes", "Star": "5.0 out of 5 stars", "Title": "Enjoyable Novel"}, {"Upvote": "7", "Review": "3.5 stars  This is the story of two women who meet in a taxi accident two years after WWII ends in NYC. One is a young woman, Eleanor, just starting out on a teaching career and is Jewish. The other is a middle aged, rich WASP woman, Patricia, who has a daughter suffering from polio. The 13 year old daughter doesn't attend school so she needs a tutor. Patricia  hires Eleanor and the three of them form a friendship.  The problem is Patricia's husband, Wynn, who is a bigot and an aggressive womanizer. Patricia puts up with the bigotry but is seemingly unaware of Wynn's lechery. She puts it down to drinking too much. Eleanor goes with the family to their summer house and has her own cabin. She meets Patricia's dashing brother, Tom, and falls in love. There is an incident that changes all their lives.  I didn't much like the characters including the saintly, Eleanor.  I found many of her actions inexplicable including letting a man into her room while she's wearing p.j.'s and then dancing and drinking with him and then wonders when he makes a pass at her. I am not giving the man a pass on his actions which were terrible but a little common sense could have helped. I think Patricia was in denial way too long about her marriage. Mostly, I just got tired of them.And, frankly, I just got tired of the book which I found predictable.", "Star": "3.0 out of 5 stars", "Title": "Characters Tiring"}], "Star": "4.2 out of 5 stars", "Name": "Not Our Kind: A Novel", "Format": "Format: Hardcover", "Price": "$17.70", "Author": "Kitty Zeldis"}