{"Comment": [{"Upvote": "21", "Review": "I LOVED Baby Sitters's Club as a kid. I recently found a huge stack of the originals at a used book store and picked them up for my daughter. She was almost 10 at the time. We started to read them together and she just couldn't get into them. I noticed how boy crazy the girls were in the books as we read. She is not interested in that at all yet (which is fine by me!!). But some how the graphic novels are a bit different, they focus much more on the friendships and other relationships. It's perfect and she's re-read these 4 many times! I only wish more were available.", "Star": "5.0 out of 5 stars", "Title": "Great update to the books"}, {"Upvote": "10", "Review": "My 10 year old and 12 year old love these books...I hope to purchase more sets in the future.", "Star": "5.0 out of 5 stars", "Title": "Five Stars"}, {"Upvote": "7", "Review": "My daughter was so happy to get these as soon as they were released.", "Star": "5.0 out of 5 stars", "Title": "Five Stars"}, {"Upvote": 0, "Review": "This series is my granddaughter's favorite!  She was delighted Christmas morning.  Her age: 11Her daddy, (my son), read this same series when he was her age and loved them!", "Star": "5.0 out of 5 stars", "Title": "This series is my granddaughter's favorite! She was delighted Christmas morning"}, {"Upvote": "2", "Review": "My teenage daughter loved these books and now has passed it down to her younger sister. They both love them.", "Star": "5.0 out of 5 stars", "Title": "My teenage daughter loved these books and now has passed it down to ..."}, {"Upvote": 0, "Review": "Fun, light, enjoyable read. 9 year old daughter loves these books. Sometimes we read them together with voices for each character. I really enjoy the entrepreneurial discussions about how to run an effective club. Fun to see the female characters run their own little business!", "Star": "5.0 out of 5 stars", "Title": "Fun, light"}], "Star": "4.8 out of 5 stars", "Name": "The Baby-Sitters Club Graphix #1-4 Box Set: Full-Color Edition", "Format": "Format: Paperback", "Price": "$32.97", "Author": "Raina Telgemeier"}