{"Comment": [{"Upvote": "15", "Review": "I loved this book on several levels: 1. Great setting, something different from the standard. Western Michigan on the lake. 2. Fantastic characterization. By the end of the book, I was in love with the characters and would have wanted to live with all of them as well. I don't know if they were based on real people, but the author really did a good job of creating characters that leave an impression. 3. Writing humor is very, very difficult, and Brogan's humor was refreshing and truly funny. I re-read some of the more clever lines in hopes of remembering them, and that's saying something for all the reading and writing I do. 4. A strong plot supported by interesting subplots that made sense and moved the story along. It wasn't face-paced nor did it drag. The momentum was consistent and everything came together in the end.I had the advantage of reading this book after one that tried to be funny but wasn't. There is a distinct difference. I loved this author's writing style and see her as a true talent. Highly recommend!", "Star": "5.0 out of 5 stars", "Title": "Truly funny and fun book"}, {"Upvote": "24", "Review": "My summer reading goals include some historical fiction titles and literary classics, so I like to add some light mysteries and pool reads to the list. This book had some laugh-out-loud moments but was Lifetime-Movie predictable from beginning to end. I felt the biggest distraction was the author's display of her political preferences and attempted humor directed at religion that more than hinted at disrespect.If the context had remained the same, but words changed to a race or another religious belief - I'm sure the author would not have utilized that to attempt humor.If you're into light reading - get a rock to anchor the book to your table.There are plenty of fun reads out there. I won't be seeking out this author again.", "Star": "1.0 out of 5 stars", "Title": "Junk food....."}, {"Upvote": "112", "Review": "Sadie, late 20's, divorced mother of two young kids, decides to spend the summer by Lake Michigan with her kooky aunt and assorted grown-up male cousins. There she meets Des, 36yo Scottish doctor, and an offbeat courtship/relationship ensues.This was a pretty quick read. Although it wanted to be really funny, it came off more as ridiculous in my opinion. I've read other romances where I actually laughed out loud (some books by Sophie Kinsella, for one) but this was not really one of them. However, it was still an enjoyable read--Des was totally HOT and a nice guy without being a wuss or a control freak--best case scenario.Sadie JUST skirted the edge of being one of those heroines who says, \"I don't know why he would like me, I'm such a mess\" and you find yourself agreeing with her. She pulled back just enough between the ridiculous acts of craziness that I wasn't totally annoyed with her. Although, strangely, I never really got a sense of what she looked like. Brown hair and eyes, and she denigrated herself at every turn. But others said she was beautiful, even her ex and he was a total narcissist who would probably never be caught dead with anyone rating less than a 9. She said she had worked out like crazy to try to \"help her marriage\" before the divorce so her body was great, but a few pages later, she'd be saying how she had to stand up straight and suck in her gut when Des was near. She just never came into focus.There's a bit of sex in the book but none of it is graphic or even detailed. Even so it didn't bother me. I would have liked to have seen more of Sadie and Des as a couple among other people. It seemed like almost every time they were together and happy, it was in private. Any other time they were shown in public something ridiculous happened. Ridiculous was a running theme in this book. When they went sailing with Des's friends, it was the only time they were out among others that some kind of zaniness didn't occur. Truthfully, I spent the whole chapter waiting for her to fall in the water or something.In any event, the reason I decided to write this review is because if I had known before reading what I found out on THE LAST PAGE I would not have bought the book:SPOILERS*********************************There seem to be whole chapters missing in the end. Sadie never has any kind of real understanding or communication with her mother. It was like her mother was just a one-dimensional prop to show Sadie what she could turn into, without explaining why or how she got there. At one point, Sadie's aunt sums the mother up in one line--someone must have disappointed her at some point and it made her not trust anyone. Could she be any more vague??We don't find out if Sadie's aunt will be okay. Although, that vagueness didn't bother me as much as the first.BUT, the biggest problem for me, was the fact that AT NO TIME, not even when Des comes back and tells Sadie he needs her and she makes him \"flustered\" does he EVER say, he loves her. And she doesn't either. As a matter of fact, Sadie says a couple of times that she isn't in love with him, or she might be falling for him. The only time she actually says she loves Des, is when she's lying to her ex.I was so floored. It was bad enough the author waits until the last 2 friggin' pages to get them back together. But then to not even reach the finish line (in these books, the L word is the finish line IMO), was completely disappointing. I was so annoyed, I reread the last few pages to make sure I hadn't missed it. But--no! He never says he loves her.END SPOILERS******So there you have it--ridiculous zaniness with some amusing side characters and a hot leading man but, in the end, unsatisfying--for me, at least.", "Star": "3.0 out of 5 stars", "Title": "Would have been a four except for one, BIG problem"}, {"Upvote": "5", "Review": "I have to say that anyone who would give this book only one star has absolutely no sense of humor!  You poor things.As a constant reader nearly my entire life, I found this to be one of the funniest books I've ever read, which is saying a lot.  I've lost track of how many times I've laughed out loud.  I love this book and I'm only a little over a fourth of the way through it, and can barely put it down.  I've never read Tracy Brogan before, but I had downloaded three of her books, thank goodness, all Bell Harbor novels.  I got them for a bargain price of $1.99 each.  I only wish she'd already written a bunch of books rather than just a handful so far.If the other two books I downloaded are anywhere near as enjoyable as this one, I am looking forward to a lot more from Tracy Brogan.Now back to the hilarious Sadie, her funny Aunt Dody, and that adorable Des, not to mention those \"carbuncles\" on the bottoms of ships.  Oh, and right after I sent in this review and went back to the book, I read that Sadie's daughter loved to read, \" a product of being named Paige Turner.\"  Another laugh out loud moment.  Thank goodness we can edit our reviews!", "Star": "5.0 out of 5 stars", "Title": "Hilarious!"}, {"Upvote": "3", "Review": "The story was a predictable light romance and an easy read. I read it while on vacation and although the overall story was OK, there was too much emphasis on the character's episodes of self doubt and insecurity. I get that she was treated badly by her first husband and had self doubts, but this aspect of the story was overdone. After the first couple of self doubt episodes I skimmed over them to get to the real story and this made it a very quick read. Although larger than life and very eccentric, some of the supporting characters were fun. The author is good at writing dialogue but their stories would be better if there was more depth. I probably wouldn't buy this author's books again unless I read a review which told me their work had evolved a bit more.One comment; the author obviously doesn't know much about cats and dogs. The descriptions of the animals in the story lend me to feel they have little experience with animals and don't care to. My suggestion for future books is they leave animals out of the story. Animals have as much character and in some cases more and better character than some people, but as with people, you have to take the time to get to know them. They like people, develop from the treatment they receive from others and in the case of domestic cats and dogs; the way people treat them is directly proportional to how they behave.", "Star": "3.0 out of 5 stars", "Title": "A very light read with a couple of fun characters"}, {"Upvote": "8", "Review": "Sadie Turner had the house, the two kids, and the successful husband. Unfortunately, her husband liked to have other women. That's how Sadie finds herself divorced and floating through life, not sure what she wants to be when she grows up. Which isn't good considering she's well past the age of grown-upness.While considering her options, Sadie decides to spend the summer at eccentric Aunt Dody's place on the lake where she comes across a neighbor practically sent by the gods to be the perfect summer fling. The perfect man (doctor, HAWT, Scottish, straight) to bring Sadie's self-esteem back to recognizable levels.Unfortunately, two cousins, two slobbering dogs, two kids, one over-the-top aunt, one louse of an ex-husband, and a basket case of insecurities throw all kinds of kinks into the works. This book is about a woman overcoming the crap hand life has dealt her, finding the good in herself and others, and finding love along the way.Best of all, this book will make you laugh out loud. Not the LOL! thing we all put in our emails that really means a chuckle. Literally. Laugh. Out. Loud. This book should get an award for the best use of sarcasm ever. The heroine is flawed but trying. Definitely relatable. The hero is dreamy but human, and there is this one part that will absolutely break your heart.I HIGHLY recommend this book.", "Star": "5.0 out of 5 stars", "Title": "her husband liked to have other women"}, {"Upvote": "3", "Review": "I actually laughed out loud several times during reading this book.  This was a easy to read, funny story about a newly divorced mother of two young children who decided to accept the invitation of her eccentric aunt who lives by a lovely lake in a small town that caters to summertime tourists.  She thinks this will give her a chance to hide away and lick her wounds while she figures out what she is.going to do with her life .  Because she had discovered her husband had been cheating on her, she has determined that she will never put herself in the position of being so hurt ever again. So she has sworn off men.  Tracy Brogan is a very funny author and she does a good job.  It is a girly story, but only because the ladies' can easily relate while the guys probably can't..It is a definitely a delightful way to spend a rainy afternoon..", "Star": "4.0 out of 5 stars", "Title": "A chuckle on every page."}, {"Upvote": "3", "Review": "The book started out good, funny, a character you could relate to. But then the funny elements just kept on and on and became trivial. The characters stayed superficial and the male hunk didn't have any character to him at all.  Sadie, our female protagonist, has no common sense and is constantly surrounded by annoying drama.The major flaw of this book is it lacks depth. Both in character development and how the relationships between characters are described. Without depth it quickly becomes trivial and irrelevant.", "Star": "2.0 out of 5 stars", "Title": "Lacking"}, {"Upvote": "3", "Review": "Winning romance writer awards and hitting bestseller lists is impressive. So is the fact that this novel has received more than 2,400 customer reviews on Amazon. That is Stephen King- and Dan Brown-like numbers. Brogan, a new author, has developed a huge following in short order.In Crazy Little Thing, we meet Sadie Turner recently burned by a cheating husband. Stung, short on confidence, and lacking a plan, she visits her quirky aunt Dody's pink clapboard lake house in Bell Harbor, Michigan. This is a place where no one knocked before entering or locked their doors. Sadie is drawn by the nostalgia and comfort, \"The scent of hot sand tinged with tanning oil and lilacs reminded me of carefree summers, back before I cared about damaging UV rays and toxins in the lake.\"Her plan is to escape men but that is not to be for both romantic and humorous reasons. Suffice it to say there is some dating with a \"dreamy\" doctor and more than a few absurd mix-ups reminiscent of an episode of Three's Company. Brogan employs an overriding metaphor throughout relating to cleaning up clutter. As such, she provides Sadie with a new and convenient career that allows her to create order from life's frequent chaos.The supporting characters are there to help Sadie too including a psychic advisor who says, \" We can't control events in our life, Sadie. Sometimes we can't even control our reactions. But the harder we fight against the waves, the more exhausted we become. Control is an illusion, you know.\" On the lighter side Aunt Dody is described as \"a tsunami in fuzzy slippers\". Dody is full of eccentric musings like wishing her husband had fixed the screen door before he died years earlier.It is definitely a light beach read. And while the dialogue is too clever by half and the ending a bit too clean, it will add to a sunny afternoon or pass a rainy day more pleasantly. I am reviewing books set at beaches and lakes for a cottage community paper in Canada and so far there is a theme as each has mentioned the joys of gin and tonic.", "Star": "3.0 out of 5 stars", "Title": "Read with a G&T"}, {"Upvote": "2", "Review": "I'd love to give this book five stars as I did 'Jingle Bell Harbor '. The book sputtered at first as if the author couldn't quite find her footing which was odd. I felt as if it didn't come to life til around chapter three. So don't give up on it. The characters were great and I enjoyed hanging out with them throughout the book. The story could have moved a little faster and been a little shorter but I will still read the two following books. I really like this author. Her characters are realistic and I loved the town. Thanks for the 'vacation'!", "Star": "4.0 out of 5 stars", "Title": "Mini Michigan vacation."}, {"Upvote": 0, "Review": "God, why did I actually wait so long before reading this book? This was on my Kindle for months now, and I only just read it now. It is, indeed, as the first reviewer described it, the kind of book that makes you feel comfy, warm and fuzzy after a cold day!Anyways, it is a charming read and basically the story is about a newly divorced ladie in her thirties (Sadie), who is taking some time out with her 2 kids and thus moving to her crazy aunt's house in Bell Harbor over the summer. Aunt Dody is totally crazy and messy, and drives Sadie (who is a neat-freak) totally nuts. Sadie teams up with her gay cousin Fontaine to get over the divorce and one day, while drinking coffee on their backporch, both of them notice an overly sexy jogger passing by the beach - and that guy is going to become the center of everyone's attention and matchmaking intentions.Well well, it took me a lot of time to finish this book because I had to laugh out loud at almost every page. This book is ab-so-effing-lutely hilarious - it is full of humour, sarcasm and misunderstandings. It's exactly the kind of book that should be turned into a movie...The end was \"okay\", because it leaves you longing for more, but I understand that there is another Bell Harbor book due to be released. I will be watching its release date slowly, believe me.Oh and this one belongs into my Book Of The Year 2013 selection - definitely.", "Star": "5.0 out of 5 stars", "Title": "5 out of 5 Stars"}, {"Upvote": "3", "Review": "With the witty characters in this book, you really cannot go wrong with purchasing a copy.  I will say this, though.....Every woman seeking the right push to moving forward in life needs a Fontaine of their own!  He was a stitch to read!!  I won't tell you why, but I will tell you that he is the sunshine on a rainy day!!Of course, who could complain when there is an attractive Scottish doctor as the hero that has a way about him.  Really, the heroine of the book, Sadie, did not have a fighting chance to not fall for this guy,  Heck, I would fall for him in a heartbeat.As for Sadie's ex-husband?  I did not like him all that much and he was definitely portrayed as the slimeball that he was.  Aunt Dodie?  She was the quirky character that can make your eyes roll and laugh at the same time.  Really, I could go on with the other characters, but why spoil your chance to read something enjoyable?Cute, funny, witty, and not overly filled with forced sizzle between the sheets is what this book offers.  Well, also a reasonable amount of thought about family, love, and taking chances.  This is something I will read again.  The humor might seem a little slapstick to some readers, but it is definitely a fresh breath of air to read a light story that does not weigh you down.  I look forward to more from this author.", "Star": "5.0 out of 5 stars", "Title": "Best humor in a contemporary romance novel....."}, {"Upvote": 0, "Review": "Upon starting this book, I really wondered if I was going to like it as it seemed more about healing.  At least at the beginning of the book.  But Ms. Brogan was merely laying a solid foundation.  I'm so glad I persevered as this story was unlike any romance I've read before.  Most romance novels deal with two people meeting/connecting, falling in love...hawt intimacy then breaking up, and after working out their issues, getting back together...usually.  But I especially liked this story as it dealt a lot with moving on after a divorce...healing from that stressful situation and how this main character, Sadie Turner, simply \"deals\".  And this story was so much more...it was about the journey and the arrival.POSSIBLE SPOILER:After a stressful and ugly divorce from her philandering husband, Sadie Turner heads to her Aunt Dody's home in Bell Harbor, Michigan, with her two children, for a much needed summer vacation.  She simply needs time to vedge and heal.  Sadie is insecure and vulnerable as she comes to terms with the wasted years she devoted to an uncaring man.  She has a poor self image and an even poorer outlook on life in general.  Her ex and his oppressive treatment of her for eight years makes Sadie second guess just about everything...but most importantly, ever committing to another relationship...ever.  Until she get's to know Dr. Desmond (Des) McKnight.Des is everything opposite of what Sadie has been accustomed to.  He's cordial and polite...he's kind, patient, sincere and caring.  When he shows more than a casual interest in Sadie, she finds it hard to believe (she does, afterall, have trust issues).  I loved Des.  He's the epitome of the perfect, non-arrogant alpha male.  A major \"rawr\".. yowza factor.This story was such fun to read...at times it had me laughing so hard I had tears streaming down my cheeks and my hubby going \"what?  what??\"...(and I'd have to stop and explain)...I loved Aunt Dody...a loving free spirit and Fontaine who's antic's and vernacular wit had me rolling in the aisles.If there was a downside to this book (for me) it would be that character descriptions sort of \"trickle\" in as you read the book.  The Author doesn't stop and devote a paragraph or three in just describing a person...descriptions filter in through dialogue and narrative...which isn't a bad thing...but can be distracting when you're trying to get into the plot.  I was often distracted, wondering what color eyes, or hair, or size, or height so-n-so had/was when I could've been concentrating more on what was happening at the moment.  But it all comes in time.  :)Still all in all this was a delightfully delicious, and often hilarious story.  No holes or loose threads...it never unravels or disintigrates.  Strong emotional dimension that the reader will easily connect with and become emotionally invested with in little time.  Deep tacit messages of healing, starting over...the journey and the arrival of finding that one special person in your life.  A fabulous story of getting your priorities straight and realizing what really.....reallllly...matters in life.", "Star": "4.0 out of 5 stars", "Title": "Realistic and hilarious romance.."}, {"Upvote": 0, "Review": "This was the first book by Ms. Brogan I've ever read ( I ordered the rest of this series before I even made it to chapter two lol) I've never laughed out loud so much while reading a book. If you've ever been in a relationship like Sadie's and Richard's you will totally relate and understand the trial and tribulations of the characters if you haven't then you may not relate as well as someone who has. It was such an enjoyable quick read and I can't wait to see what happens next in Bell Harbor!", "Star": "5.0 out of 5 stars", "Title": "If you've ever been in a relationship like Sadie's and Richard's you will totally relate and understand ..."}, {"Upvote": 0, "Review": "Not since I started reading Janet  Evanovich's Stephanie Plum novels has a book made me laugh out loud as much as Crazy Little Thing by Tracy Brogan. I laughed throughout the book, snorting embarrassingly at times.The woman is crazy (funny, not psycho) and I'm not sure if I'm talking about Sadie Turner, the heroine, or Tracy Brogan the author. One thing I do know is that Dody, Sadie's lover of life aunt is a nutcase and a half, but in a  good way. So many times throughout the book  I shook my head and said out loud, \"That's horrible,\" while laughing.The first couple of chapters had me thinking that the book was chick lit especially because it is written in the first person, but then Desmond  stepped into the picture and the romance was on. I thought Kyle was actually going to be a romantic contestant for a second there until...let me just say that laughter ensues with that situation.I love Desmond. I mean I want to meet him, steal him away from Sadie by any means necessary and have his babies. He is hot, funny, intelligent, kind, and has a paying job (he's a doctor).  The attraction between Sadie and Desmond is...well, all I can do is smile.Sadie gets herself into some embarrassing situations which turn out to be hilarious. I was proud of myself for `getting' most of the pop culture references which made the book that much more interesting.Tracy Brogan has written a funny romance story about a woman who has been so hurt by love that she is afraid to love again, not an uncommon tale, but her writing style makes me think it's the first time I've ever heard of it.", "Star": "5.0 out of 5 stars", "Title": "Funny, funny book"}, {"Upvote": 0, "Review": "This is really, really, really light reading. There's nothing deep here, and some of the characters and situations are just plain silly. The theme seems to be that if sex is great, of course the relationship will be great too. I'd rather read more thoughtful chick lit, with better developed characters and plot lines. But if you want light escapist brain candy, this is fine.", "Star": "3.0 out of 5 stars", "Title": "The theme seems to be that if sex is great, of course the relationship will be great too"}, {"Upvote": 0, "Review": "I chose to read this book after reading only the 1-star reviews, and I quite enjoyed it.  That doesn't mean I didn't want smack Sadie upside her head at least 12 times, but I found myself continually laughing out loud, and when I put the book down, I looked forward to picking it up again.  I enjoyed all of the characters except Dody, but I would have liked to learn more about Sadie's mother's backstory.", "Star": "4.0 out of 5 stars", "Title": "4 stars - I liked it"}, {"Upvote": 0, "Review": "I am known to love the good crime thrillers, full of suspense, so this was definitely one of my \"getaway from it\" book selections. I need some nice, relaxing, light, and enjoyable reading from other avenues to balance my love of reading.  This was definitely a great selection!  It presented a woman and her family moving to a remote location to live with a rather \"ditzy\" aunt, and share her friendships with some rather unusual and funny neighbors.  The scene and the selection of people involved were perfect to complete a fun, relaxing, read.  As the read itself provided many smiles, they added a light touch of romance and the subsequent pain of old romance vs. new to make it a delightful read.", "Star": "4.0 out of 5 stars", "Title": "I am known to love the good crime thrillers"}, {"Upvote": "6", "Review": "This was a light, mildly interesting fluff piece with no depth or complexity. Basically, a Lifetime rom-com movie. It was just interesting enough to make me want to stay with it to see how it ended. And the ending was predictable. Good for the airplane or waiting room at the doctor's office. I won't be reading any more by Tracy Brogan.", "Star": "2.0 out of 5 stars", "Title": "Superficial rom com."}, {"Upvote": 0, "Review": "I love this book!  I just reread it getting ready for the 2nd in A Bell Harbor series, and I loved it just as much this time.  The story is made up of a cast of crazy, funny and endearing characters.  This is one of the few books I've read that I love the other characters as much as the Hero and Heroine.  The writing is snappy and fresh urging you to get to the next page.  The story is full of hilarious banter and situations where you find yourself smiling and laughing out loud.  The Hero, Des, was swoon worthy and the chemistry was certainly good with Sadie.  I also have to say that I usually like a little more steam in my books, however, the love scenes were PG and when done right is just as good as a R rated love scene.  You can't ask for more in a romance-humor, great characters and a hot hero.  I would definitely recommend this book!", "Star": "5.0 out of 5 stars", "Title": "Chick Lit at it's Best"}], "Star": "4.3 out of 5 stars", "Name": "Crazy Little Thing (A Bell Harbor Novel)", "Format": "Format: Paperback", "Price": "$9.99", "Author": "Tracy Brogan"}