{"Name": "Overlord, Vol. 6 (light novel): The Men of the Kingdom Part II", "Author": "Kugane Maruyama", "Price": "$13.59", "Format": "Format: Hardcover", "Star": "4.6 out of 5 stars", "Comment": [{"Review": "Surprised to see the quality of the book itself, was expecting something much thinner and of lower quality. This is the first book in the series I've purchased, been watching the anime and could wait no longer for the story. The books are by far better than the anime, but the anime helps to give a visual on all the characters. Loving this series, rest of the books on order. If you really like the anime and don't mind reading a book, not manga, then this is a must by imo. Book 7 needs to come out already. If there's anything to dislike, it would be that book 7 comes out in May. Needs my fix.", "Upvote": "3", "Title": "Better than expected.", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "Having seen Overlord anime season one and keeping up with season two on VRV, I was stoked to read the light novel for the first time.  I was pleasantly surprised to discover the depth that the author went into the details regarding the characters and their backgrounds.  The writer took full advantage of the novel format and there were many secrets and revelations which apparently 20+ minutes episodes cannot cover.The Overlord light novel series is a must read for fans of the Overlord anime show.", "Upvote": "3", "Title": "Action-Packed & Very In-depth", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "Another absolutely amazing addition to the Overlord series. It feels like it's been a while since we've seen Ainz in action and he certainly comes back with a bang. This volume has a ton of action scenes from the perspective of various characters, and is enjoyable the whole way through.If you've made it this far into the series there should be no doubt about picking it up. And even if you were thinking about dropping it this novel there's a high chance this volume will draw you right back in.", "Upvote": "4", "Title": "Proof that this series just gets better and better!", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "This is not my first time reading vol6. But it's the first time I read the official version of vol6. This book surprised me when I received it. The printing is of high quality, especially of the colored illustrations. I am really satisfied because I'm a big fan of soubin. If you are looking at this Vol6 that means you already know something about Overlord. All I can say about this volume is that it is not only the volume with most pages (up to vol6, vol13 will have the most pages overall), but also the most interesting one so far. This volume demonstrates pretty much Nazarick‘s first play in dealing with the main powers in the new world. Most set-ups in the kingdom are put into execution. The struggle of the new world habitants is intense. So if you like the series of Overlord, this is definitely worth reading. And just read on as the story only becomes more interesting later on.", "Upvote": "2", "Title": "A Book with Good Printing Quality. Really Nice to Have", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "I read this book in a single evening because I could not put it down. I wanted to pace myself to make waiting for the next volume a bit easier BUT IT WAS JUST TOO GOOD! Chances are if you stuck with the novel for this long you're gonna love the pay off of Sebas being in the capital. Can't wait to watch this part in the anime. Hoping for a season 3!", "Upvote": "3", "Title": "I wanted to pace myself to make waiting for the next volume a bit easier BUT IT WAS JUST TOO GOOD! Chances are if you stuck with the novel ...", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "Stunned to see the missing illustration art that was supposed to be in book 5 is in book six. Well if the writer says that this is part 2 I kinda had a feeling it'd be here. Genuis as to how we're getting a look at every guardians viewpoint. Cant wait to see Aura's and Mare's more in depth. Hopefully we get a Book focusing on them making the false Nazarik and helping out. Cant wait to see if they go back into they're past as to what it felt like when they were killed when the world was still a game. If we get story depicting the events that transpired then i'd be extremely grateful for it.", "Upvote": 0, "Title": "Genius", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "Watching the TV show made me interested in buying the books and I've read through volumes 1 through 5 already just love the franchise. I recommend these book series for anybody.", "Upvote": 0, "Title": "... I've read through volumes 1 through 5 already just love the franchise", "Star": "5.0 out of 5 stars", "positivity": 1}]}