{"Comment": [{"Upvote": "100", "Review": "I've loved Alice Hoffman's stories since Practical Magic, which still stands out as one of my favorites of all time. I was excited to learn more about the family and go back in time a bit. This book immediately pulled me in. I couldn't put it down! I love the siblings, Jet, Franny and Vincent. They're well-woven characters with good dimension to them. Sometimes you wonder if you like them at all, and I think that's a sign of excellent character development. They make mistakes but also learn. When reading a typical thriller, I sometimes skip around to dialogue when I get kinda bored. With Alice Hoffman books, you want to read every.single.word. No skipping. She's a really an amazing writer with a knack for great storytelling. This book spans a good amount of time and I never once got bored. I like that there's a cool Aunt in Massachusetts at the same house, just like the two in Practical Magic. Great read.", "Star": "5.0 out of 5 stars", "Title": "Awesome!"}, {"Upvote": "11", "Review": "This prequel seemed a bit 'phoned in'. The writing lacks the lyrically spellbinding stylings of it's earlier released Practical Magic, and for me did not stand on its own. Redundant, and poorly edited, the 'magical' part was reduced to a less enchanting version of it's earlier iteration.The characters were hard to relate to and for the most part not that interesting. Not much happens for a book that spans around 6+hours of read time.I wanted to be sucked into the delicious, sensual and delightfully surreal world that at one time, only Alice Hoffman could create.If you enjoy this genre, I highly recommend her earlier works Seventh Heaven, Fortune's Daughter and of course Practical Magic.", "Star": "3.0 out of 5 stars", "Title": "Couldn't wait for this prequel, now I can't wait till I've finished it."}, {"Upvote": "20", "Review": "Did Alice Hoffman write this book?  Any Alice Hoffman fan should skip this one, it's heartbreakingly bad.  If you appreciated Practical Magic, this book is particularly painful. The cannon is revised, ignored, and in some places simply forgotten, a real punch in the gut for those who read and loved Practical Magic long before it was a movie. (Love the movie, but it is vastly different from the original novel).  Hoffman has always been one of my favorite authors; The Marriage of Opposites is transcendent, and should not be missed. The Rules of Magic should be skipped at all costs.", "Star": "1.0 out of 5 stars", "Title": "Who Wrote This?"}, {"Upvote": "5", "Review": "This was my first Alice Hoffman story and I am not disappointed in the least! The writing and pacing was fluid throughout the story and it had a character-based approach to the story. You find yourself falling in love with the characters (slight pun here). The story follows a group of Owens siblings as they learn of their magical powers as witches and also of the curse that has burdened their family for many years. The curse of the Owens family is that anyone they love is doomed to death. Therefore, love is forbidden and these three siblings, Franny, Jet and Vincent, must find ways to live life without ever falling in love lest it be their own downfall.Throughout the story, you see the growth of each character and in that growth you see them all tempt fate with attempting to love someone deeply. You’ll follow their downfall with trepidation because of it. While this story is a dark look at love, there are bright spots that show that life isn’t worth living if you’re not loving. The moral to the story is very succinct and relevant. Hoffman does a great job of masterfully weaving characters fate together without a hint to the readers as to what big event will happen next.The story lulls in some points though. While the writing is superb and fits the timeframe of the story perfectly, there are moments that are filled with too much history and ambiance and “other” things. You’ll have a great visual of the home(s) and their cities and towns. But you will also get a heaping dose of history throughout the story which at face value is an added bonus but by midway through can be a bit challenging when coupled with the other visuals… you’ll just want to know what will happen next at that point. Maybe this is a good idea now that I think about it…maybe Hoffman wanted to build that rising angst in us? No matter, the story was wholly enjoyable and character-driven which to me are the most memorable.", "Star": "4.0 out of 5 stars", "Title": "Pretty Good"}, {"Upvote": "5", "Review": "I bought this because it's related to Practical Magic, which was a doable read, and I like the subject matter. However, as with Practical Magic and Faithful, I had a hard time getting through it.While the story is unique and sweet, the characters are extraordinarily difficult to get involved with and there's zero depth to them. They could be picking posies, climbing Mt. Everest, or attending a funeral, and I just wouldn't care.There are several deaths in this book (the story spans many decades) and not one of the deaths managed to garner much more than a \"oh, that's too bad\" feeling. Because none of the characters seemed.. real.Several other popular writers are able to truly create long standing characters that pull you in, that make you want more, that leave you crying for every loss in their lives (even if they are fictional), that have you rooting for their success and joy - but not here, not with Hoffman.I tried to get into their lives but that's just not happening with Hoffman's style of writing - it's the way she writes her characters. Good for a sunny day, poolside/beach like day where getting distracted from the book is possible and acceptable. But it doesn't hook me in AT ALL.", "Star": "3.0 out of 5 stars", "Title": "Quick, easy, good for a summer read"}, {"Upvote": "14", "Review": "Is this book really meant for adult readers??? It feels like it is written for a 16 year old. Characters are shallow and hard to relate to no matter what your age is. I would not recommend this book to an adult. Maybe, ok for a young adult.", "Star": "2.0 out of 5 stars", "Title": "This is not a good book for adults!"}, {"Upvote": "13", "Review": "I am a huge fan of \"Practical Magic\". I've read the book and seen the movie many times. I cannot believe how BORING this prequel is. The characters are not interesting and there is no story just a lot of events that are \"connected\" to the Owens family but NO POINT. As another reviewer wrote: \"...did Ms. Hoffman actually write this?\" Very disappointed. Save your money and time and skip this one.", "Star": "1.0 out of 5 stars", "Title": "Not even close to being as good as \"Practical Magic\""}, {"Upvote": "8", "Review": "\"The Rules of Magic\" is a beautifully written book but it was challenging to get through. At times, the story felt repetitive, almost as if we were going in circles with these three lovely characters. I'd have to put down the book for a break, pick it back a day or two later, and so forth. It took me quite some time to finish this novel.The book is about the three Owens children: Franny, Jet, and Vincent, as they grapple with the family curse, which began in 1620 with Maria Owens, who dared to fall in love.\"Beware of love,\" Maria Owens had written on the first page of her journal. \"Know that for our family, love is a curse.\"But of course, who wants to listen to the ramblings of a woman who has been dead for 350 plus years?Growing up, the three did their best to break all the rules assigned to them by their mother, with the exception of this hard and steadfast rule. After a summer in Massachusetts with their Aunt Isabelle, the three teenagers head back to New York City to navigate their separate journeys, stumbling on their own forms of love. This is where the story became bogged down for me. There was too much indecision for me, too much going back and forth about doing the right thing, etc.Whether the character chose courage or caution, nothing seemed to work out for him or her, anyway. It was rather depressing that they couldn't have some happiness without it being taken away. The pacing of the novel was also too slow for my taste, because there was too much emphasis on the day-to-day routine, which was kind of boring. Nothing really happens in those pages for it to be chronicled. I couldn't connect with the characters, which made reading it harder as well.I found myself skimming to get to the end. It was rather underwhelming.", "Star": "3.0 out of 5 stars", "Title": "\"The Rules of Magic\" is a beautifully written book but it was challenging to get through"}, {"Upvote": "6", "Review": "Last night I finished The Rules of Magic, by Alice Hoffman, her new \"prequel\" to Practical Magic. Meh. No comparison to the earlier book. Carelessly written and edited, I thought, though compelling enough to finish. If you loved Practical Magic, don't bother with this one.", "Star": "2.0 out of 5 stars", "Title": "No Comparison to Practical Magic"}, {"Upvote": 0, "Review": "I read Practical Magic years ago, close to 20 years I think.  I had forgotten most of it and so this was all new to me. It was great fun!  I love the Rules and the sayings and the practices! I don't think that I have ever highlighted this many passages in a single book before. I loved the story and the characters, and I really so enjoyed the characters during the years of the 6o's and the trip to San Francisco.  I've recommended this one to my friends and family, and my daughter Betty is borrowing it from the library this week. I just know she'll love it too.  It was not until the last chapter that I realized that the kids who would become the two old aunties in Practical Magic had just been introduced.  I had to laugh.  Run out and get a copy today - you'll be glad you did!", "Star": "5.0 out of 5 stars", "Title": "Lots of Fun - A Great Beach Read"}], "Star": "4.4 out of 5 stars", "Name": "The Rules of Magic: A Novel (The Practical Magic Series Book 1)", "Format": "Format: Kindle Edition", "Price": "$11.99", "Author": "Alice Hoffman"}