{"Comment": [{"Upvote": "936", "Review": "A Kindle First selection that is masterfully written with complex characters and heart-pounding scenes.  It takes place in Italy -'the forgotten front'- during WW II and the reader is drawn into a web of intrigue.  Pino Lello, 17 years of age, is wise beyond his years and intelligent, as well.  It is a gripping story of resilience, the indomitable spirit of a young man that knew no boundaries and courage that sustained him during dark hours.When reading the first portion, I was wondering if (and how) this intense pace would continue.  The climbing scenes through the mountains gave me a real shot of adrenaline.  I felt as though I was one of the climbers and not a reader.  This is also when the echoes of 'Nessun Dorma' were played with such passion.  For me, this is one of the underlying themes in the story - 'none shall sleep'.  And, Pino Lello has taken that to heart for the remainder of this story.The action intensified throughout the remainder of the book, and one is allowed a rare glimpse into the mind of Il Duce  - Benito Mussolini - plus the inner workings of the German High Command.  Becoming a driver for Major General Hans Leyer allows Pino access to a man that is two steps from the Fuhrer.  Pino Lello witnesses atrocities he wishes he could forget but keeps soldiering on...wisely...Just a gripping and harrowing Kindle First selection which I feel is the best one I have read.  Full of action and suspense which will keep you on the edge of your seat for the duration.Most highly recommended.Please note that this is my Kindle First selection for April 2017.", "Star": "5.0 out of 5 stars", "Title": "~~Action/Courage/Resilience - set in Italy during WW II~~"}, {"Upvote": "614", "Review": "I've read nearly every word Mark Sullivan has ever published - so I can say with authority that this work, Beneath a Scarlet Sky, stands as the ultimate fusion of his Pulitzer-nominated journalistic skills and his mastery of the thriller genre, which he's honed at the keyboard he sometimes shares with James Patterson.  He takes us deep inside the love story of his discovery, the unknown hero, Pino Lella, and he crafts an epic tale set against the backdrop of Nazi-occupied Milan and the Italian Alps during World War II that is as intimate and tragic as it is thought-provoking and triumphant.  Every page, every step crackles.  Each twist, rooted in years of first-class reporting, shocks you anew.  Through Sullivan's gripping cast of characters, the unreality and brutality of war meets its match in the guts and wits and soul of Pino Lella, his family, his friends and cohorts.  This heretofore untold story has been etched in my heart and mind with a telling that is equally cinematic and literary.  With this, perhaps his masterwork, Sullivan has reached a pinnacle in storytelling - and readers everywhere, like me, will be better for living it through his words.  Of course, it is Pino Lella we must also praise and thank - for what he did with his young life, his uncommon bravery, his story and letting Sullivan share it with us.  I wish I could read it again for the first time.", "Star": "5.0 out of 5 stars", "Title": "Sullivan's Pinnacle of Storytelling"}, {"Upvote": "89", "Review": "I love historical fiction. I have been reading a lot of WWII historical books lately. I was not really wanting to read 'another' one. But, we were traveling to Milan, and this true story took place in Milan. So, I bought it, and started reading it a few days before the trip. Once we were in our hotel on the street Corso Matteotti, I was amazed to find out that Pino Lella grew up in that area and at onetime lived on that very street! A very well written book. A very amazing life Pino lived. I did not know that Milan was affected so much by WWII.  I definitely recommend it. Pictures are of the church San Bbila - the neighborhood where Pino grew up, and of where his parent's purse shop and his uncle's leather shop used to be.", "Star": "5.0 out of 5 stars", "Title": "Amazing!"}, {"Upvote": "501", "Review": "I cannot add more to the excellent reviews previously posted other than to say I read this book in one sitting not being able to put it down until 4:00 AM!  It gripped me emotionally and I'm still thinking about it the next day.  Rarely does even a good book have the depth and character development than this one did.  I will be looking for more from this amazing author!", "Star": "5.0 out of 5 stars", "Title": "Don't start this one late in the day!"}, {"Upvote": "26", "Review": "One of the most interesting books I've ever read and I have read dozens if not hundreds.  This book was both hard to put down and hard to read too much at a time-both for the same reason-it was so breathtakingly good!  This is one of those rare stories I hope everyone reads and wish everyone had to.  It's intriguing, entertaining and puts you right there.  My tummy was tight with fear, I laughed out loud and I hated what the Greman Nazi's did to Italy and especially to its people.  I had heard before that Italy saved more of it's Jewish population than any other country in Europe and I was glad to be reminded of that.  They deserve to be recognized for their humanity and bravery.  This story was extremely unique in its view of WWII and the German invasion.  I will read it again, it was that good.  Please read this book yourself.  It's not gory but intellectually manages to still give you a real look at that time and place-something we all should never forget.  I highly recommend this book to all!!!  :)HIGHLY RECOMMEND!!!  :)  :D", "Star": "5.0 out of 5 stars", "Title": "SHOULD BE RE-READ A MILLION TIMES!"}, {"Upvote": "15", "Review": "The plot is based on the events happening to Pino Lella, an eighteen years old Milanese boy, in between 1943 to 1945, during the nazy occupation of northern Italy. The first part of the book is fully credible, as Pino, his brother Mimo and 40 other young boys are sent by his parents to Casa Alpina, a Catholic retreat and school at the foot of the Italians alps, to scape the allied bombing of Milan. The Catholic church has set an escape route into Switzerland, around  The Groppera peak, to smuggle Jews, refugees and down allied pilots out of the Nazi's hands. During the course of several months in 1943, Pino leads a score of people into Switzerland, risking his life to do it. But he's turning eighteen, and subject to the mandatory draft, and his parents have devised a scheme to prevent him from being sent to the Russian front. He enrolls Organization Todt, a Nazi Corp in charge of building infrastructure. And here is where an endless string of coincidences start happening to Pino, beginning with his chance encounter with General Leyers, the second most powerful Nazi on Italy. Pino becomes Leyers' driver, and through his eyes, we learn about all the Nazi atrocities and the allied advances to liberate northern Italy. No question the first part of the book must be true, but so many coincidences happen to Pino, several on a single day on various occasions, that is hard to believe all the rest of the story really happened the way is told by the author. The book is worth reading and it is in kindle unlimited.", "Star": "4.0 out of 5 stars", "Title": "A true Story  or fiction?"}, {"Upvote": "12", "Review": "I have heard and read stories from the aftermath or World War II. My father was at the push to liberate France.  What the young man in this story accomplished in that war, his bravery, pain, and his silence for so many years will stay with me forever.The author of this book did me a favor in describing the true heroes of the that war few will ever know about.  My father maintained silence for decades as did many other veterans because of the atrocities.  This book is a call to all of us here and now to truly appreciate the freedoms we have because of so many who gave everything they had to end that war.  An amazing story recounted by a truly gifted author.", "Star": "5.0 out of 5 stars", "Title": "Absolutely astonishing!"}, {"Upvote": "18", "Review": "Worth reading, but be prepared for somewhat of a confusing mix of true story and novel writing. To me that was the biggest problem, not knowing what was actually the real true story as lived by a teen named Pino and what was artistic license taken by author. He does post a warning of sorts at the opening that he used some freedom and liberties in the telling, retelling from actual events by the main character, and filling in holes with his own/writers words or interpretations.It is a good story of events during the last two years of WWII in Italy, most of it and is focused primarily in northern Italy, Milano and surrounding areas. As such it is a very limited piece of WWII history of Italy because it reads more like a love story which happens during the last and worst two years during the war. It felt like the actual teller of this story Pino is giving us an adolescent view into that first need for  the love of a woman, even though it was just a fantasy at first, and his experiences of life from the perspective of a teenager and that in his telling he left too much to the author to fill in. There are however several important characters in this story that cannot be overlooked, important to WWII history and the horrors of the Nazi and the fascists. Since the story is actually being told by a teenager it is rather difficult to accept as historical.  Unfortunately one of the main and historically important characters, Genaral Leyers  for one, we know very little of and that little is rather confusing and unfinished. Sullivan finished the story leaving us hanging with so many unanswered questions, which he tried to rectify with an addendum with some rather sketchy information pertaining to general Leyers. In my opinion there is not enough informaion given to finish the story. The whole story which features Leyers prominently, is such a disappointed because the truth, the history, is not being clarified. It's sort of a muddled ending leaving the reader puzzled. It would seem to me, that some good investigating should have brought the truth to the surface and given the book a believable ending.  all that the top Nazis did during the war is never something just mentioned in passing. Pino and Leyers were intimately involved throughout the story, and by Pino's telling, which is the story here, General Leyers did atrocious acts and gave orders for slavery and the horrendous mistreatment of these slaves or prisoners, just to mention one atrocity. That is historically important facts but unfortunately are only touched upon in the book. General Leyers was arrested, but then under confusing circumstances is shipped across the borders of Italy, presumably into freedom of Austrian border carrying a heave briefcase which supposedly contained gold billions he had stolen. Then he suddenly is imprisoned with war  criminal prison, was also handled by a court, not Nuremberg, and released after only 23 months. Nothing is told us about details of trial, records from his incarceration, why he was released at all when Pino made such a credible witness against him. Pino was his driver and translator and even allowed in the generals home to co-mingle with their maid who was his love interests. So there is supposedly plenty of witnessed horror as told in  the story but nobody asked this young man about this war criminal?My final conclusion to what I gained from this story is not so much a WWII horror story involving a Nazi war criminal, but a love story between a very young and inexperienced teen and a mature woman, which was mostly a fantasy for the boy but over the course of the story and his persistence turns into  real but sweet young love during  the last two years of WWII in northern Italy. During those two years we are traveling along with a very immature teen through his life experiences. Part of that experience i s his becoming the driver and translator for the Nazi General Leyers.I guess I am most disappointed in the lack of facts, historical facts, which are not followed through to a believable conclusion. Without that conclusion all we have is a love story which isn't exactly history making,  True, this love story unfolds in the middle of life during the final two years of WWII in Italy. In spite of the story touching on the atrocities committed by Nazi and Fashist factions it's still a teen love story. Anything else is simply left unfinished, unresolved and left me confused and very let down.I still think this could be a fantastic piece of previously uncovered WWII history of great importance if only Sullivan had done more investigative work and less memoirs, had actually finished the work.Other than that I found the writing somewhat tediously detailed, especially trying to explain locations in Italy, like trying to write a map with words. Including a map of Italy would have made it so much more visual and less wordy.", "Star": "3.0 out of 5 stars", "Title": "A great idea not seen through to a believable conclusion. Definitively a Novel."}, {"Upvote": "6", "Review": "This story takes place in Italy during the last two years of WWII.  It's a well-written historical fiction based on a real-life 17 year old hero, whose story until now, was largely unknown.Pino Lella was only 17 in 1943 when he began leading Jews over the Alps to safety in Switzerland. He went on to become a spy for the Partisan Resistance Movement in Italy while serving as the driver for a top Major General in Hitler's High Command. Pino risked his life repeatedly, gathering information for the Resistance and Allied forces until the war ended.While this book is historical fiction, it is based on in-person interviews the author Mark Sullivan had with then 79 year old  Pino Lella, as well as other extensive research he did over a ten year period. (Pino Lella is still living in Italy, and in his nineties.) Originally Sullivan planned on writing a nonfiction biography of Pino, but the Nazis so thoroughly destroyed their files in the last days before surrendering to the Allied forces, making a complete and accurate story virtually impossible. Sullivan felt Pino's story was so compelling, he decided to write it in a fictional format for posterity rather than not write it at all.This truly is a compelling story. It's the story about the war, but one we haven't heard before. It's about the atrocities, but also about heroism and bravery. And there's a poignant love story that should touch even the most stoic among us. The writing is very straightforward.  It doesn't go back and forth in time, and it doesn't switch from one character's p.o.v. to another's. It's the story from Pino's eyes, told vividly and simply.I think it's definitely worthy of 4.5 stars.", "Star": "5.0 out of 5 stars", "Title": "Compelling story, written in a simple and straightforward way"}, {"Upvote": "16", "Review": "I'm not sure why I am bothering with this review -- with 4,000+ other reviews, my thoughts don't count.  However, here I am -- I review books and music (and occasional other things) on Amazon.com, so why not?\"Beneath a Scarlet Sky\" is not a well written book.  It's kind of like a graphic novel without the graphics.  His prose is basic -- functional, but not at all elegant -- and there's no subtlety or nuance in what he writes.  Yet, like a cartoon, it's action packed and easy to read, and the story he tells definitely falls into the category of \"amazing but true\".  The saga of Pino Lella, who served as a chauffeur to (and partisan spy of) the second in command of Nazi-controlled Italy towards the end of WWII is literally incredible, but it is true, and it's filled with the \"Bams!\" and \"Pows!\" that any good action cartoon should have.  It also contains lots of sweetness -- often too much so -- when the author discusses Mr. Lella's family, the love of his life, his passion for the terrain of northern Italy, and so much more. I must also say that the book is so action-packed that I finished all 500+ pages in three days.  One unexpected plus of the book is that it doesn't attempt to wrap up his life in a neat package with a bow; he was what he was, and the book sort of ends without an ending.  I can say no more.So, \"Beneath a Scarlet Sky\" is poorly written, saccharine and cartoonish, but despite all that, it's a terrific read, and one that I suspect will stick with me for quite a while.", "Star": "4.0 out of 5 stars", "Title": "Poorly Written, But a Terrific Read (and It's True, Too)!"}, {"Upvote": "6", "Review": "What a story!  This is an amazing look at the devastation of war, a good dose of the horrors of naziism, and the uplifting fact that one person can make a difference.  Although Pino seems to have the luck of the Irish instead of the Italians, I was wiling to suspend reality a little to follow his adventures and nail-biting escapes through Italian streets and countryside littered with German soldiers.  However, reality returns after the war when Pino's real test of courage isn't spying or daredevil driving, but the personal challenge he struggles with for most of his life.There's a lesson for everybody in this well-written and thoroughly researched novel, from the brave Italians who worked against the nazis, the fearless religious leaders that helped thousands of Jews to safety, and the endless bravery of one man who chooses to live life to its fullest.", "Star": "5.0 out of 5 stars", "Title": "Must read!!!!"}, {"Upvote": "3", "Review": "It sounds like a crass thing to say, but wars do bring out some great stories. There’s something about a combination of tragedy, espionage, romance, late-night bombing raids, and the overwhelming fear of death that has given many a writer great ideas for tales. This book is actually based on a true story. What makes it somewhat more appealing is that the story takes place in Italy. What other World War II  stories do you know that have taken place in Italy?  Not many. What exactly was Italy’s role in World War II anyway?  Weren’t they one of the three ‘bad guys’ headed by the unstable fascist Il Duce (Benito Mussolini)?True, but by 1942, Italy was already ‘conquered’ and the majority fled their lukewarm allegiance towards Hitler and the axis and then turned towards the allies.  By 1944, when this story starts, the country, however, was filled with black-shirt fascists who never turned, as well as German Gestapo agents everywhere.  It’s in this environment that we meet our protagonist, 17-year-old Pino Lela. Like most boys 17 thrown in a middle of war, he’s obviously having to grow up quite fast. All he wants to really do is find a girl and fall in love. He makes an attempt to woo a stranger on a street – beautiful 23-year-old Anna – who halfheartedly agrees to meet him at the cinema later in the evening. It’s quite obvious she’s just trying to get rid of this testosterone filled adolescent and move on with whatever she’s doing.It’s a good thing she stands him up, as the theater is bombed during a night raid. Pino finds himself thrust into the war at this point. It’s high time for him to do something to help the cause. We then see Pino recruited for a couple of dangerous missions that basically take up the bulk of the book. His adventures aren’t really connected, but it’s still quite the adventure.  Of course, every few pages, we read about his fascination with Anna – the girl he met for a total of about two minutes. He can’t stop thinking about her. Well, this IS a somewhat true story, but when we read about Anna so often, it’s obvious that she’s bound to show up again in our story.So, yes, our war tale contains a fair bit of romance along with tragedy. To be frank, the tragedy and travails of a world war seem a bit toned down in this book. My guess is the author didn’t want to gross out any of his readers. So even though we read about citizens being murdered by firing squads, forced slavery, and trains filled with Jews heading to Auschwitz, I never really felt the pain and remorse that I think I should have felt. Pino seemed a tad too lovestruck throughout the pages for his surroundings to ever appear too grim.  The book seemed ‘PG’ rated when I felt it should have been a hard ‘R’ for the emotions to really sink in as they should.I also felt that had this NOT been a true story, I would have enjoyed the last quarter of the book better. We must remember that real life doesn’t always give us stories the way we wish they would be told, so I need to give the author a ‘pass’ when certain events didn’t happen the way that I was hoping they would.Truth be told, the story is told very well, so one can easily forget that we’re reading about a true account. The very end of the book does a good job summing up the ‘Where are they now?” portion of the main figures that survived the tragedy.  Again – some unanswered questions and some events unfolding a bit differently than one would want. As I write this review, the book is supposedly being made into a mini-series.  I’m thinking it will be a good one. It’s definitely a bit too varied to be summed up into one nice, neat movie.  Somehow, I’m guessing the nastier elements of the war will be toned down as well. I guess that’s probably a good thing – if that’s what most people want.", "Star": "5.0 out of 5 stars", "Title": "\"But the world's focused on France, and forgotten Italy\""}, {"Upvote": "5", "Review": "First book written by Mark iv'e read....wont be the last !.....Thanks to kindle for listing New York times bestsellers.......Would have loved to have visited Milan in 2011, all I saw was the interior of the rail station at night, that in itself was exhilarating......no other rail station we saw like that.Unsure of a writer's style and would I like the book, I plunged in, one page after another the story unfolded, and I felt this is the best novel Iv'e read this year and Iv'e read some very good ones.I liked how the true story of Italian patriots further modified my views from my early youth of giving an ear to bigots as to the Italians being enemies of the allies during WW11. I felt the injustice the Australian Italians must have felt when they were rounded up and incarcerated.I liked the way the Catholic church supported the people, using their position in the Italian community to help Italians, jews and others, the portrait of father Re and others, again remembering unfair and negative comments long ago.The happenings to Pino took the reader on a journey, so not to spoil the story for an intending reader,I'll just say there is a rollercoaster of emotions.Historical novels are my favorite reading....Well done Mark, look forward to reading your next book.", "Star": "5.0 out of 5 stars", "Title": "LOVE TRIUMHS OVER HATE IN WARTIME ITALY"}, {"Upvote": "5", "Review": "I like to read right before going to sleep. I chose this book as one of my free selections with Prime.  I love historical fiction. This book however, is based on fact from real interviews with the main character.  The writing takes a bit of getting used to as it is what I would call bare boned, but that means there are no boring parts.  Very fast paced.  It also took a bit to get going, but when it did, it was difficult to stop reading, the story develops and quickens.  There are shocking plot turns.  Then near the end... (and while I'm not giving any details away, if you want to know nothing of this book, read no farther)... knowing that this book is historical fact, that the story is true and really happened...one of the plot twists absolutely tore my heart out and ripped it to shreds.  I lay in bed sobbing.  Took me hours to finally get to sleep and it was days before I could finish the book.  I greatly enjoyed this book, but if you are looking for happy endings, I do not recommend.  If you want to learn very interesting history and would like a very powerful and incredible story of a man's life, then this is a must read.", "Star": "5.0 out of 5 stars", "Title": "I like to read right before going to sleep"}, {"Upvote": "21", "Review": "Maybe I'm being too critical, but I have been struggling with this story for a while now. Originally I was attracted to this novel by its never-before-told aspect along with its emphasis on Italy and the often-overlooked heroes within that country. I had previously read \"From Sand and Ash\" which first introduced me to this branch of WW2 history even though it was a completely fictitious story. I expected \"Beneath a Scarlet Sky\" to provide a more accurate account of a real-life person who had been involved in these events. Unfortunately, I have been incredibly disappointed.First, let me say that regardless of how much of this is actually true (and I have my doubts), this fictionalized version of Pino Lella is so unrealistic. Essentially, he's a seventeen-year-old prodigy who can do no wrong. He is strong, clever, exceptionally skilled at pretty much anything he attempts, and he doesn't seem to have any real conflict with or animosity toward anyone (well, except the Nazis). He is quite possibly one of the most unrelatable characters that I've ever come across in a literary work. Just as ONE example, here is a future race car driver complimenting Pino on what a gifted driver he is, because of course he is:\"Pino allowed a mild smile. “You catch on fast. I wish I could have finished my driving lessons.” “You are already very, very good, Pino,” Ascari said. “You have the touch, the feel for the car that is rare.” Pino basked in the praise.\" p. 163 (Kindle edition)Since all the attention is given to Pino and his amazing accomplishments, the supporting characters are extremely bland and indistinguishable. The only thing I really knew about each character was if they were \"good\" or \"bad\" (and this was primarily based on whether or not they were German).Second, I was surprised by the simplicity of the writing. At times, the text reads like a middle-grade textbook as it lists off names, facts, and dates. The dialogues felt very stilted and occasionally only consisted of a couple of lines before ending abruptly. If it was going to be so concise, did there really need to be a dialogue at all?While I normally get frustrated with authors who insist on including excessively detailed descriptions of the characters and their surroundings, this book had almost none. This made it hard for me to immerse myself in 1940s Italy. At first, I assumed that perhaps this author just doesn't care to spend a lot of time on superfluous descriptions. However, the passages about Pino hiking went on and on FOREVER! Here were the descriptions I wanted back when I was first introduced to the characters in Milan, but now they were unnecessarily lengthy and only focused on a single character and his \"treacherous\" hikes through the Alps.Third, precious little in this book actually feels plausible or authentic. There are so many instances of characters (especially Pino) who just happen to be in the right place at the right time. The moment where this novel lost ALL credibility was when Pino, after almost single-handedly digging out from an avalanche, goes skiing with a pregnant woman clutching onto his back. This woman, who had been spotting blood only moments before and felt so weak she couldn't go on, lets out a \"Wheeeeeeee\" as they race downhill and then plays her violin for him after they reach safety. Ummmm, no. I've read historical fiction with completely fabricated characters and situations that have felt less fictional than this.It grieves me so much - especially considering this is based upon real heroes - but I can neither continue this nor recommend it to others. If you've read it and know that it gets better, let me know and I may give it another shot. But for now, I'm done.", "Star": "1.0 out of 5 stars", "Title": "How is this so popular?"}, {"Upvote": "4", "Review": "The characters, the tragedies of WWII , the atrocities of war-torn Milan all come alive to the reader. Within this story, the reader is thrown into a vast array of emotions wondering how such horrors could be done and so little known of the heroism of a few. From the Prologue to the Epilogue, the reader feels the desperation and the courage of those who risked and lost so much. This author and his story should be shared with all the many historical fiction writings. One will remember and reflect on the character, Pino, thanking him for his courage and ability to stand up to the horrors of the time. In total, one can embrace all those who risked and sacrificed their lives! Mark Sullivan has captured my interest so much so to want to read more of his writings.", "Star": "5.0 out of 5 stars", "Title": "A Piece of the Unknown History of Italy’s WWII Conflicts"}, {"Upvote": "4", "Review": "It’s not for the feint of heart, this book. Parts of it remind me of Hemingway’s A Farewell to Arms, which also was set in Italy in a different world war. Pino Lella had been helping Jews escape from Italy to Switzerland. He was about to turn eighteen and be drafted into the Italian army. Instead he enlists in the German army and ends up being General Leyer’s chauffer which then causes him to be recruited by the intelligence arm of the Italian resistance. Most Italians think he is a traitor, not knowing that, in reality, he is a hero taking a great risk for his countrymen. One of his few confidants is Leyer’s maid and Pino’s lover, Anna. The risk becomes even greater, and the action even more tense the closer it gets to an allied victory. The characters in this book are real, and the tale closer to what really happened than is usual in historical fiction.", "Star": "5.0 out of 5 stars", "Title": "he is a hero taking a great risk for his countrymen"}, {"Upvote": "3", "Review": "It has been over 5 years since this avid reader has been impressed by a novel to this level. Wow, the 13,000+  five star reviews, also listed 13 among the most read, and it isn't a trend novel like Harry Potter? See how this gem sparkles among that list? How could it get a better resume? I'm not going to tell you the story, in fact I recommend you read very little of it because nothing is exciting if you already know what will happen. Based on my desire to read adventure novels, and novels of survival during WWII, and the review numbers and most read status, I knew I had to get it. And, I'm sooo glad I did. Don't hesitate, it doesn't drag, it isn't too long, there is never a dull moment where I put it down. If I put it down, it's because I want to savor the moment and pace my enjoyment of reading such a great novel.", "Star": "5.0 out of 5 stars", "Title": "It has been over 5 years since this avid reader has been so impressed and so moved by a novel."}, {"Upvote": "3", "Review": "Wow... this is the most potent and gut wrenching story I've read to date.  And that's saying a lot.  The story itself is based on true biographical events that occurred in Italy during the last two years of WWII.The cast of characters are well developed and the story line, thrilling as it is, never seems to stop.  From the death defying acts of smuggling Italian Jews through the Swiss Alps; to an 18 year-old, (Pino Lella), and his covert spying, (code name,  \"the observer\") on Nazi Maj Gen Hans Leyers.The insanity of war and its yoke of despair are on full display.  Relationships of key members are explored and a glut of raw emotions percolate throughout.Kudos goes out to author Mark Sullivan for shedding light on such an exemplary, epic tale.  I look forward to the movie that's in the works by Pascal Pictures.  A block buster surly is in the making.Also I tip my hat to my oldest brother Bill.  After reading his \"6 star\" Amazon review, I had to \"pony-up\" and order a copy for myself.  Feel free and do the same, as you won't be disappointed, I assure you!", "Star": "5.0 out of 5 stars", "Title": "Pino Lella and his extraordinary WWII  heroics are explored"}, {"Upvote": "4", "Review": "I found this to be a fantastic story! I was drawn in immediately by the main character, a happy go lucky, teen in Italy. As the story develops he finds himself deeper and deeper in the middle of WWII. I could feel the emotion he must have felt through his interpersonal relationships as the war went on. As the story drew to a close I found myself wanting to know more! I read the information at the end regarding what happened to the people after the war, and Pino was an amazing individual! I can only imagine what it must have been like to sit down and talk with him as the author of this book.I'm the type of reader that doesn't really give a book a chance, if I don't like it by the end of the first chapter then I won't finish it. This one was a binge worthy read, at night before bed, coffee breaks, lunch breaks, I had to know what would happen next.", "Star": "5.0 out of 5 stars", "Title": "Binge Worthy Read"}, {"Upvote": "3", "Review": "So today I'm writing about a bestseller. A book that won attention from the entire reading world, really. In the words of a fictional character I love, \"We're all stories in the end...\" Pino Lello definitely made it a good, and heroic, story. Beneath a Scarlet Sky follows the life of Pino Lello, his family and some of the people he knew during WWII in Italy. The book weaves a fabulous tapestry of a family, who showed courage in different ways, resisted in a thousand different acts, and persisted despite the horrors around them. This book comes reviewed by thousands of people, and rated very highly overall. It deserves every bit of praise it has received.Disclaimer: Beyond this point you can argue that there are spoilers, though not specific ones. If you don't want to read about them skip the rest of the review, but know that I whole-heartedly recommend this book to anyone who likes reading historical fiction, and works based on real-life events. This book reads like a spectacular tale of historical fiction, and the writing is on par with another of my favorite books, The Nightingale. -----------------------------------------------------------------------------------------------------------------------------------------The book opens with Pino in Milan, where he grew up, in the fashion district. His family are craftsmen, designers, musicians, and these colorful influences informed Pino's identity. Maybe it was those crucial moments who shaped the boy Pino was and the man he became. Either way he used those moments to do what needed: to help. Pino's parents know the war is coming, and soon after the bombing began sent Pino to a remote Catholic school in the Italian Alps where they had vacationed and traveled before. Pino is experienced in the terrain, he knows the conditions, and before he even realizes it the Father there is training Pino to help people get out of Italy and into Switzerland. From there it is a chain reaction decisions, actions, and coincidence that led to Pino become an important spy in the fight against the Nazis.The prologue shut me up, and made my inner cynic sit down for a while. I didn't know until the Prologue that it was about an actual man, before that I was all set to write a snarky review about the luckiest fictional spy WWII ever saw. That sounds horrible now, given what Pino witnessed and suffered, and I can't explain it without spoilers, but trust me that I do know that this great man saw true horror.The ugly truth is, as in any war, a person is lucky just to make it out. Whether they kept their heads down or if they spent years resisting their conquerer's efforts, people were lucky to survive. Somehow that wasn't the case for Pino, this book and it's prologue make it obvious that Pino didn't just survive the war, he found ways to live during it. That's part of what makes the story seem so unbelievable. If it took skill and cunning to survive, what did it take to live and find an enduring love during war?", "Star": "5.0 out of 5 stars", "Title": "Powerful enough to make a cynic sit down and shut up."}, {"Upvote": "3", "Review": "Reading this beautifully written book gave me insight and understanding into what had happened in Italy during WWII. It both won my heart and broke my heart. The characters came alive and the descriptions of the beauty of Italy were breathtaking.When we meet Pino Lella, he is loving his life, his family and his country. As WWII came to Italy, Pino's life began to change and it never stopped changing.Through a complicated arrangement, Pino enlisted as a German soldier and became a personal driver for a high ranking German official, General Leyers. General Leyers always seemed to be playing a game of favors and shadows.The war had left devastating and deep scars all through Italy; on it's buildings, it's landscape and it's people.After living through and observing the never ending brutalities of war, Pino came to realize that the Nazi's were not the only savages. During and immediately after the war, death was indiscriminate and pervasive and yet strangely exclusive.Pino witnessed and suffered loss after heartbreaking loss. He had to continually find new reasons to choose life and living.Pino was given many years on this earth. Years filled with youth and adventure, bravery and heartache, love and passion, surprises and changes, and choices and consequences.Such a well written book that was obviously a labor of love for the author. This was a story that needed to be told, experienced and remembered. I don't think that I will ever forget Pino Lella.I received a copy of this book through a GoodReads giveaway.", "Star": "5.0 out of 5 stars", "Title": "Read, Experience and Remeber"}, {"Upvote": "4", "Review": "I received this book from Kindle First, and although it already had strong reviews, I am enthusiastically happy with how good this book is.  The story follows a 17 year old man beginning in July 1943 in Milan Italy.  The Allied advance has stalled around Rome in its northward push, and the German army is tightening its reins on the remainder of Italy.  Pino, the main character, is part of the Resistance throughout the story, and is a spy acting as a driver for a German general during a large part of the story.The author, Mark Sullivan, spent almost a decade researching records in the US, Germany and Italy in preparation before writing this book.  With the wealth of factual materials he found, he has written a story that is fast paced, engrossing and one of the best books I've read in years!  I would encourage readers to not miss the preface before starting the story, then the aftermath section once the story is completed.  Both contain research that contributed to the story base.", "Star": "5.0 out of 5 stars", "Title": "One of the best books I've read in years!"}, {"Upvote": "3", "Review": "What a story! At the beginning, it seemed a bit dry, like a diary. However, I was taken away by the story! I have a 17-year-old son (joining the US military this summer) and wonder at how a boy becomes a man so quickly when faced with life and death struggles. Pino doesn't think himself a hero, but I think heroic events happen when ordinary people step up and selflessly do the right thing in difficult and dangerous times. I especially liked the scene (vague not to spoil) when he's trapped with others and wants to just curl up and cry. \"I'm only a 17-year-old boy\", yet he sees responsibility to others & overcomes his crippling fear.This story made WWII become real to me. It's one thing to read facts about it (which this book has plenty of -- some I just skimmed over because it was too much for me, though did get me interested in Italy), but another to hear a personal eyewitness's description. I understand the \"amnesia\" to try to forget the horrific atrocities of this time, but I think it's important to know what happened; the reality of evil, the good in the midst of bad, the importance of people met along the way, the danger of mob mentality, and so many other lessons to be learned from history.Thank you, Mark Sullivan, for pursuing this story. Thank you, Pino Lella, for sharing it. Pino, if you are reading this, know that we don't all have heroic moments, but we all have regrets. Trust in Jesus' heroic sacrifice completely for forgiveness, grace & ultimate salvation. God bless you.", "Star": "5.0 out of 5 stars", "Title": "Amazing"}, {"Upvote": "3", "Review": "The author writes a masterful, historic biography of a Milanese citizen who undertakes numerous missions while Italy is under Nazi occupation. First in the Italian Alps and then in the uniform of a quasi German army unit. The hero, Pino Lella is a teenager when he begins his harrowing escapades under the direction of a righteous priest at summer camp high in the Dolomites. It's just the beginning of many courageous, but very dangerous missions by Pino, code name the \"Observer,\" all while acting as German officer General Leyer's  official driver. Along the way, we meet Pino's  little brother Mimo, the fiercest of resistance fighters, their family and friends who become entangled in the \"occupation's web.\" We also meet the beautiful Anna, who becomes the love of Pino's life. This is great read, giving us insight into the war's affect from the Italian citizen's perspective. If you're a lover of WWII history, you'll appreciate this terrific story.", "Star": "5.0 out of 5 stars", "Title": "WWII's Italian Hero"}, {"Upvote": "3", "Review": "Mark Sullivan has given a gift to the world with this book. It is a must-read for anyone who loves great storytelling about people who not only survived the Nazi terror of World War II, but are responsible for saving countless others. Too long have the stories of the Italian saviors been untold and I was surprised in my own writing and research to discover how many Italians did not know the stories of when the Holocaust came to Italy. Time is passing for us to learn firsthand accounts of the people who rose above the unspeakable horrors of the Nazi occupation of Italy. We are living in a time when the Italians are beginning to speak of Nazi reign of terror between September 1943 and May 1945 and writers like Mark Sullivan are digging deep into archives - where there is so little left after records were destroyed before the Nazis poured into Piemonte - to uncover the stories. Beneath a Scarlet Sky will leave readers asking if they could rise to the occasion to save the lives of the pursued and persecuted.", "Star": "5.0 out of 5 stars", "Title": "Simply said, A MUST READ!"}, {"Upvote": "25", "Review": "A very engrossing tale and a serious telling of the heroic participants standing up to the Nazi regime in Italy, a WWII location history seems to have forgotten.  Pino Lella was a very interesting protagonist. Some have wondered if his experiences were embellished but knowing the pervasiveness of the German war machine it's hard not to believe if not personally experienced, he may have been remembering experiences of others he knew. An extraordinary teenager determined to do what was right in the face of personal peril. I did enjoy the novel and appreciated learning of the Italian war history.  What I tired of was the simple writing and somewhat cliche dialogue.  The story itself deserved a more serious approach on the part of the author but all in all a serious historical saga.The section at the end titled, Aftermath, was greatly appreciated to explain what happened to some of the people so important to Pino's experience.", "Star": "3.0 out of 5 stars", "Title": "WWII Italian History"}, {"Upvote": "3", "Review": "Riveting! Talk about being immersed in history! Based on the memories of a true remarkable survivor of a Nazi invasion of Italy during WWII  I could not put the book down. After Pino leads several Jews out of the country he reluctantly submits to spying (no James Bond here) for the resistance as a chauffeur for a Nazi General. Pino uses his position by observing the goings on during the Generals rounds to Nazi occupied places and meetings and sends his collective info to the Americans via radio. It is simple but effective but Pino faces criticism and abuse from friends and some family for not joining the ‘fighting’ hence he feels guilty like he’s not doing enough to help the war effort.  I cheered for Pino and empathized with Pino. Repeating thoughts in my mind was what would I have done in Pino shoes to survive and be able to live with those decisions after the war. Seemingly unimportant choices that are made have consequences for the rest of our lives. Does kindness during the war really pay off even after the war? Were the people Pino associated with really who they claimed to be? Another true hero who finally gets to tell his story of love, war and survival.", "Star": "5.0 out of 5 stars", "Title": "Once you pick up this book you’re in it to the end!"}, {"Upvote": "3", "Review": "I found Mr. Sullivan's novel informative, entertaining and deeply moving.  If even half of what is in this novel is true, the story is incredible. I have heard stories and have attended a lecture regarding how Italians, in many instances, saved and protected their Jewish friends and neighbors. The talk was given some years ago at a local college and attended by the survivors and those who helped them. It is somewhat disconcerting and sad when some reviewers dismiss this history as proof that the events told are untrue. Life can be and often is stranger than fiction. I was deeply touched in the end by Mr. Lella's faith and by his view of life and its moments as a gift.  The story told in the novel is a testament to humanity's capacity for evil but also for our capacity for selflessness and love. There are lessons here, particularly regarding how foolish and tragic it can be to judge an individual too quickly as well as the dangers of the mob mentality. Thank you Mr. Sullivan and Mr. Lella for reminding us all of these truths. Most especially thank you Mr. Lella from this American of Italian descent who recently lost his twin brother Joseph, for reminding him ultimately of God's Goodness and Grace and the many gifts that he gives us if we just take the time to notice them.  I would highly recommend this novel (and have done so) . God Bless you Mr. Lella and thank you for sharing your story with all of us through Mr. Sullivan's fine work.", "Star": "5.0 out of 5 stars", "Title": "A Moving Epic"}, {"Upvote": "3", "Review": "Undoubtedly, one of the most interesting stories I’ve ever read.  I’m a big fan of spy thrillers and action stories, and I thought this was going to be one.  It turned out to be so much more.  The writing style isn’t on a par with my favorite authors.  But, then, it was actually a biography, written by a journalist.  And a more compelling story could never be imagined by a fiction writer.  Amazing!About a boy who found hiimself helping Jews escape from Italy when he was 17.  Then, when he was about to turn 18, his mother insisted that he join the German nazi army, rather than the Italian fascists, to prevent him from being sent to the Russian front for slaughter.  He did not want to do it, but she made him.  Then, through some most unusual cirumstances, he found himself at 18 being a spy for the resistance.  (With no formal training for such an endeavour.)  He also found love in the midst of a horrific war setting.  And the events!  Emotionally, within a 24-hour day, he would find himself at the top of a mountain, then falling into the pits of hell at what was going on around him.  Almost every day.", "Star": "5.0 out of 5 stars", "Title": "A most intriguing story, the likes of which I've never read!"}, {"Upvote": "3", "Review": "This is a fantastic book about a little known hero from World War II. The author was able to spend time talking to this hero, who is still alive today, and did extensive research on the history during this time. The result is a page turner thriller that will keep you reading to find out how the story ends.Pino Lella is a typical teenager in Milan in the early 1940s. He in interested in girls and music and girls. He pays little attention to the Nazi occupation until the Allies start to bomb the city on a daily basis. His parents decide to send him to a boys school in the mountains that he has been to before, to keep him safe. He is anything but safe when he starts leading downed Allied pilots and people escaping from Italy to safety over a treacherous mountain route to Switzerland. He is called home by his parents who insist that he join the German Army - they felt it was safer to be in the German Army than the Italian Army and despite his misgivings, he follows his parents orders. Once again, he puts himself in danger and works for the resistance while he is a member of the German Army.This is wonderful novel about a brave man during the war and its also the coming of age story of his life from being an innocent teenager to a young man who is searching for love and a peaceful life.", "Star": "5.0 out of 5 stars", "Title": "Beneath a Scarlet Sky"}, {"Upvote": "3", "Review": "A well written story of one of the heroes that you never hear about because their heroism had to remain in the dark but they risked their lives and their families every day to rid their country of the horrors of war and the atrocities that follow them. Italians saw a collaborator behind every bush toward the end of WW II and after years of abuse from the Nazis took their aggression out on their own countrymen and slaughtered hundreds of them based on a person's claim without any actual evidence. It is a sad documentary of humankind that followed all wars throughout history and how it affected the survivors. Like Pino time can never completely fill the void left by such senseless carnage and his life was forever altered despite what he did unselfishly for others. I would recommend this book to everyone for them to see true character in a world that is slowly losing theirs.", "Star": "4.0 out of 5 stars", "Title": "The unsung heroes."}, {"Upvote": "3", "Review": "This is an incredible story, especially because it is based on actual events, people, and places. It is one of those stories that you can't stop thinking about even when you put the book down. I found myself wanting to talk with someone about the atrocities Pino witnessed, the improbable coincidences, miracles and twists and turns his life took, and the range of raw human  emotions described throughout the book: indescribable joy and triumph, pure terror, crushing guilt, murderous rage, utter and complete despair and redemption. The reader walks alongside Pino through every one of these human feelings we are blessed and cursed to experience. It is exhausting at times. This book is more than mere entertainment, it is a portrait of a man that puts the Dos Equis beer \"most interesting man in the world\" to shame. (And he's not even fictional) I don't think anyone could make up a more heart-wrenching, miraculous, and fascinating story. It would seem too far fetched.", "Star": "5.0 out of 5 stars", "Title": "Fascinating and heartbreaking"}, {"Upvote": "3", "Review": "I could not  put this book down.  It was never slow or boring.  I was horrified by some of the things that went on in Italy during the last two years of WWII.  The things that people had to do to stay alive was incredible.  The cruelty, the disdain and hatred by the Germans had me closing my eyes and covering my mouth in disbelief.  The fear the Jews  felt was made to be real by the author.  Thank goodness there were people that helped them escape but the means of escape was sometimes death defying.  Can you imagine living each day with the fear of discovery, of hunger, of not knowing what the day may bring.  The author of Beneath a Scarlet Sky had done his research on the events of Pino's life.  I loved how at the end he told the rest of the story of the main characters in the book, like what happened to them after the war was over.  I was most amazed at how the last few days of the war went, such savagery and emotion was displayed.  I highly recommend this book.", "Star": "5.0 out of 5 stars", "Title": "I highly recommend this book"}, {"Upvote": "5", "Review": "Having been constantly reading for the past 20 years you find most stories readable but  rarely memorable. I am fortunate that I read this book. All the while I was reading I was in Biblio, Casa Alpino, The Duomo  in Milan, Lugano etc. having previously visited many of these places in Italy, I was back, but during WWII.  Never have I been more engrossed in  reliving events that were so very well written, without any fillers or flashbacks. My absolute honor to become acquainted with Pino Lella through the hand of Mark Sullivan. For me, I will never find a more moving or engrossing writing. I wished this story would never end.", "Star": "5.0 out of 5 stars", "Title": "The most moving narrative ever"}, {"Upvote": "4", "Review": "This book reveals so much history from the not too distant past.  Totally engaging, chapter after chapter.  While some of the storyline may have been fiction, the book was filled with historical facts that answered some questions that I have wondered about for years.  Sometimes the history was so devastating that it was hard to imagine the depth of such  cruelty. Having family members that escaped Germany through Austria and eventually fought in WW 1 & 2, I found this book to be educational and fascinating, and difficult to put down.  Awesome!!  Thank you.", "Star": "5.0 out of 5 stars", "Title": "Totally engaging!"}, {"Upvote": "3", "Review": "Here is story that is quite literally too astonishing to be altogether true, but the basic outlines of the tale are quite true indeed. This is a novel with obviously fleshed out dialogue and scene, but the whole is based on conversations with many who witnessed the events, and most especially conversations with the protagonist himself, who still lives in his ninth decade in Italy. While a teenager in occupied Italy in 1943-45, our hero performed deeds of valor, involving harrowing daredevil actions through ice and snow covered mountains in order to save Jews and others from the Nazis. The book rolls along on a tide of actions and decisions that beggar description in our time. I thoroughly enjoyed the ride, however painful many of the scenes turned out to be. I understand that the tale is being made into a movie; I have mixed emotions about that, since movies have a way of truncating and simplifying the complexities that only a novel can provide. Read the book now before the movie taints your reactions! I should add that the afterlife of the hero is in its own way as fascinating as his war days, so read the whole book for the full effect.", "Star": "5.0 out of 5 stars", "Title": "Read before the film appears!"}, {"Upvote": "4", "Review": "I had never read any accounts of World War II in Italy and was totally fascinated by this book.  The main characters are  ones who really lived, with the author  filling in to heighten the story and to smooth out rough edges when needed, which is what makes it historical fiction.  He actually interviewed the main character, Pino, among others, over a period of several years, after Pino was over 70 years old and was somewhat reluctantly ready to discuss the events that took place over the two-year period that he acted an as undercover spy for the Allies in Italy.  The resulting book is totally intriguing, well written and mind boggling.  I have read a number of Kindle free books first available on Amazon Prime and this book is by far the best one I have ever read.  In fact, it is so good that I bought a paper back copy to pass around to family and friends.", "Star": "5.0 out of 5 stars", "Title": "Amazing View of World War II Italy"}, {"Upvote": "3", "Review": "Many WW II stories are about Allied victories on the Western Front.  And the stories are usually told by the generals (or sometimes by the soldiers who fought in the trenches).  This book has a refreshingly different perspective.  The protagonist, Pino Lella, is a teenager boy – and so a civilian living in Milan Italy, a town that fell under Nazi control after Italy surrendered to the Allies.  Though a work of fiction, the story conveys a sense of realism -- and that’s because Pino Lella was a real person and the story is based on (and extrapolated from) Pino’s recollections of his experiences in and around Milan during WW II.  Occasionally, the story seemed a bit exaggerated; although I cannot say whether that was based on the author’s own embellishments, Pino’s memory of decades-old events or just my own overly-skeptical nature.  Still, the book is an interesting/horrifying/sad/uplifting/valorous view of life as a civilian in a war zone.= = = = = = = Updated Oct 16, 2017 = = = = = = = =Based on Mike Lella’s (Pino Lella's son) comment on my review, I should have called this book a work of HISTORICIAL fiction (rather than just fiction) as it is based on the recollections of a real person (and a real hero).  I should probably work on my overly-skeptical nature, too.", "Star": "5.0 out of 5 stars", "Title": "Moving story of WW II from a civilian’s perspective."}, {"Upvote": "38", "Review": "A well written story dealing with the diametrically opposite qualities of human nature. I soon felt that I knew the characters intimately and that I shared their experiences.I am sure that countless heart-rending stories from the great war are lost to us; we are lucky that this one was found!", "Star": "4.0 out of 5 stars", "Title": "A remarkable story and person during a tragic era."}, {"Upvote": "4", "Review": "I thoroughly enjoy historical fiction, and this story is even better given that it is based on the life of someone who lived through this period.  The adventures this man (still a teen when it starts) are amazing!  If I hadn't read the prologue to know the main character is still alive, the heart stopping moments would have lasted even longer.The author does an excellent job describing scenes, building characters, and keeping me turning the pages.  The horrors of war become personal in this tale, with the losses experienced by those who had fighting hit their territory, their home.  I'm fascinated by how people go on, enduring the losses and finding ways to live well despite what has happened to them-and Mark Sullivan does an excellent job portraying this in his book.", "Star": "5.0 out of 5 stars", "Title": "I loved it!"}, {"Upvote": "2", "Review": "You've heard many stories about WWII, - but not this one.  I have read several books and seen many more movies about World War II.  I thought I had a fair grasp of the overall situation.  I did not; and I learned some things from this book.  This book is a \"mostly true\" story about a real-life hero named Pino Lella.  Never heard of him?  Me, neither.I originally bought this book (the Audible book) because of the tremendous number of 5-star reviews.  I had never seen such a large number of 5-star reviews for a book on Amazon.  I was impressed.  Must be something to it if so many people all think so highly of it, right?  I mean, the internet is a vast wasteland, and it is very, very hard to find that many people who actually agree on any book!  So, I generously shelled out the $3 for the book.  What the heck.  I'm a big spender.I am so glad I bought this Audible book!  I will remember it for a long, long time.  Please buy this book.  You won't regret it.While I was listening to the book, I spent a fair amount of time on my computer Googling the locations and the events that were mentioned in the book.  So, after finishing the book, I realized I had inadvertently learned so much more about World War II than I knew before, -- and I love learning new things about history, particularly when I learn it in such an emotional way.  I was totally engaged, and I loved the characters.  The author, Mark Sullivan, did an outstanding job on this book.", "Star": "5.0 out of 5 stars", "Title": "You've heard many stories about WWII, - but not this one."}, {"Upvote": "3", "Review": "In a similar vein to \"A Beautiful Life\" in many ways, this is a story of an optimistic protagonist who does what he needs to survive tumult that most of us cannot fathom.  The story reads with all the twists and turns of a good suspense novel with the added bonus of being so heavily based on a true story.  For what it is worth, the words \"historical fiction\" often frighten me away, leading me to believe the story will be too complex or mired in historical detail.  Beneath a Scarlet Sky manages to tread the line perfectly between offering historic detail and developing plot and characters.I am typically a generous rater, but this is one book that truly stands out - if I could offer more than 5 stars, I happily would!  I could easily see this adapted to the big screen...", "Star": "5.0 out of 5 stars", "Title": "Historical Fiction, Amazing Suspense"}, {"Upvote": "2", "Review": "I did enjoy this book by Mark Sullivan and I am sure it would appeal to a wide reading public.The story is centred around a true story of a young Italian man, Pino Lella who lived in Milan during the time of the Nazi occupation and the installation of Mussolini as a puppet dictator in the north of Italy.Pino's life is described as he undertakes dangerous missions to escort Jews across the alps into Switzerland... his joining a branch of the German army at the suggestion of his parents, in an attempt to protect him, and lastly as a driver for the Italian Second-in-Command of the German forces occupying Italy.The story is fast paced and well constructed with many tense moments as Pino walks the line between spying for the Allies and assuming allegiance to the occupiers.His ongoing love for a woman eight years his senior is a large part of the emotional impact of the book and leads to an event that will affect Pino for the rest of his life.A time of brutality, and deep emotion is conveyed within these pages about war, and the devastating fallout that follows for all involved.I recommend this book for all those who like easy, fast paced historical fiction based on fact, that has depth, authenticity and many other strings to it's bow.", "Star": "5.0 out of 5 stars", "Title": "Great Fast Paced Read."}, {"Upvote": "2", "Review": "Mark Sullivan has, with fine insightful detail, captured the incredible life of a real hero the world needed to know about. It describes how one young man's life was forever changed in a small Italian village during WWII.  Pino Lella,  an unknown and unsung hero of that time, was full of life with all the cockiness  and bravado only the young can have.  An accomplished skier and mountain climber from a young age,  Pino is enlisted to guide Jewish refugees over the mountains in a harrowing tale of extreme danger and terror.  He will eventually become involved as a driver for a powerful Nazi General in occupied Italy, gathering valuable information for the Allies.  The Nazi General uses Pino as not only a driver,  but as an interpreter, exposing him to men of the highest authority, including  Mussolini himself.  It is during this time of great danger of exposure as a spy, that Pino meets the love of his life, the maid to the General's mistress!  This book is so well written,  the reader  (me) becomes totally engrossed in this story.  If you have any interest in high intrigue,  suspense, family and love, read this book.", "Star": "5.0 out of 5 stars", "Title": "AN AMAZING TRUE STORY"}, {"Upvote": "4", "Review": "I love Italy and skiing and, while searching for something to read, the publisher's pitch for this wonderfully written story, caught my eye.THANKFULLY!Whisked through it in a day and a half.  Couldnt put it down even though i was sure there were tears ahead. IT is one of the best stories I've ever read and recommend it to all who are looking for that \"find\"...that something special that grabs you, rips a whole in your heart, but ultimately  leaves you grateful for having been one of the fortunate to share such a complete, satisfying life.As i wonder if perhaps our paths might have possibly, unknowingly crossed on the slopes of Mammoth Mtn, at the same time I pray I find the peace and wisdom that PINO has clearly found....enjoy...I envy YOU your journey.", "Star": "5.0 out of 5 stars", "Title": "Great Surprise"}, {"Upvote": "2", "Review": "This was a fascinating book. I have read many stories about World War Two but none about the war in Italy against the Nazis and the Fascists. The story of an eighteen year old Italian boy who was drawn into the war, first by helping refugees across the high mountains to safety in Switzerland and then to become a spy for the resistance, read like an action thriller and yet it was based on a real individual. I started reading it in December but because we are packing and getting ready to move I was only reading a few pages here and there. Decided this book needed more attention so went back and started over to do it justice. I seldom reread books but this one will stay with me and will need to be resisted again in a year or two. I highly recommend this book.", "Star": "5.0 out of 5 stars", "Title": "Based on an actual hero of the war in Italy during World War II"}, {"Upvote": "4", "Review": "This jewel is so fascinating, engaging, well written, and a joy to read.  It hooked me on the first page and I hated to see it end.  Plus...it is all true.  I am a 71 year old female with little interest in WWII.  I never expected to love it and have purchased 10 to give away.  Everyone whose read it loved it.A huge thank you to everyone who helped the writer pull all of the pieces of the puzzle together.  And, to Mark Sullivan for taking all those years tracking down facts, visiting the areas and engaging with our hero.  I'm sure Mark wanted to give up but I personally thank him for sticking to it.", "Star": "5.0 out of 5 stars", "Title": "If you haven't read it yet, do yourself a favor.  Historical, emotional, a true adventure"}, {"Upvote": "2", "Review": "Sullivan masterfully crafted an important book based on true events in Italy during WW2.  He combines information gleaned from personal interviews with the protagonist and others with extensive research.I'm saddened when a few of my reader friends say \"we don't want to read any more WW2 books.\"  Reading this book might change their minds.Beneath the Scarlet Sky is based on a real 18 year old's (Pino Lella) life.  He never asked for the hand he was dealt. He didn't want it.  Yet he became a hero because he never quit.I was amazed at his outstanding courage, his love for Italy, Anna, his family and friends.  But it was his ability to always continue despite the horror and heartbreak he witnessed that astounded me.Sullivan captured all the terrible wrongs that happened during the war in Italy.  But equally important, he captured the good that so many people demonstrated at the risk of their own and loved one's lives.Interspersed in the book are word of wisdom that are pertinent today.Bottom line:  Kudos to Sullivan for bringing this almost forgotten piece of history to our attention with a writing style that keeps the reader thinking \"I'll just read one more page---one more page---one more---!\"", "Star": "5.0 out of 5 stars", "Title": "An Important, Beautifully Written Read..."}, {"Upvote": "2", "Review": "I chose this book among others offered by Amazon at a special Prime price because it sounded more interesting than the others.  How glad I am that I did.I consider myself an avid reader and am very choosy about the style of writing, grammar, lack of typos, etc of the books that I read.  I was uncertain about this one because I wasn't familiar with the author and generally don't care for war stories (or movies) with a lot of blood and gore. However the premise of the story caught my attention, so I thought I'd give it a try.This ended up becoming one of my favorite books ever. It is a very well written documentary of a part of WW11 that no one has ever heard about, with an intriguing hero and unforgettable characters, who happen to be real people. I literally could not put this book down until the end.I will not give any spoilers as to the plot and story, you'll just have to trust that it grows on you after the first couple of chapters and you become mesmerized by the story.This book should become a movie. The world needs to know this story.  I sure wish I could meet Pino Lella.", "Star": "5.0 out of 5 stars", "Title": "An Inspiring Story"}, {"Upvote": "2", "Review": "There are many dimensions to this story. First there is a close up look of tWW II in Northern Italy and the suffering caused by  the Nazis and Facists of the time. This is the head story.  Then there is  the incredible story of Pino a young man whose adventures of heart and in the physical world are revealed to us. These touch the heart deeply.  Finally, this a story of  faith  and trust in God and touches the soul.Thank you Mark Sullivan for your research and for the respect with which you revealed the story of Pino  and Anna and all that transpired in Northern Italy during those last years of the war. I wish it had ended differently. I am saddened by the human capacity to destroy the lives of others. But I have to believe with the Cardinal and Father Re and Pino that most people are good and that by having faith much can be overcome. Thank you!", "Star": "5.0 out of 5 stars", "Title": "A story for the heart, the soul, and the head"}, {"Upvote": "2", "Review": "I can't remember the last time I gave a five star review of a book.  I'm  very tough critic, but this book deserved it.  It's a lovely story inside a tragic setting that is both bittersweet and triumphant.  There are untold horrors and amazing graces of human spirit.  The writing style makes this an easy book to read, even with some tough subject matter.  I very much liked how the story was based on facts but did not read like a lot of war stories that get bogged down in the minutia of every detail.  There were enough characters to keep the story interesting without having so many that you lost track of who was who.  I highly recommend this book to anyone. This is a piece of world war II history seldom if ever heard about as it centers in Italy.  The story is poignant and heartfelt.", "Star": "5.0 out of 5 stars", "Title": "Best book I've read in along time."}, {"Upvote": "2", "Review": "This is the true story of an ordinary family doing heroic things in the city of Milan during the Second World War. By thorough investigative  procedures, Mark Sullivan followed the family of Pino Lella in their amazing journey to save the lives of many Jewish people and preserve the dignity of Milan. Pino's family and members of the Catholic Church were able to save from arrest some 41 thousand  Jewish people by escorting then over treacherous  Alps to safety in Switzerland. This was the underground railroad to safety created by the Catholic Church h. Sullivan brought to light a German group called \"organization Tort\" who systematically created unspeakable atrocities against the Jewish people. Pino Lella became a driver for the man who was in charge of this group, one General Hans Leyers and was able to keep the approaching Allied forces aware of the movements as well as plans being considered by the Germans.  Sullivan followed up by revealing the turns that life took by all of the people who made such a huge difference in the lives of so many people.", "Star": "5.0 out of 5 stars", "Title": "Informative surprise.  This book- Sullivan's passion for the unwritten will stay with me.  Thank you for sharing.💖"}, {"Upvote": "4", "Review": "Great book of an unlikely hero.  This book delivers for lovers of historical fiction.  Blending fact with fiction the story weaves through a fictionalized coming of age story of Pino Lella.  It explores the complexities of war for the son of a wealthy Milanese family.  Pino plays the role of a teenage mountaineer, soldier, spy, lover, translator, and more.  All this occurs with the backdrop of the German occupation of Italy during the second world war.  Not much more can be said without spoiling the thrilling read.", "Star": "5.0 out of 5 stars", "Title": "Great history about a forgotten front in WW2"}, {"Upvote": "3", "Review": "Wow, just wow!!  This story is incredible.  It reads like an action novel and yet it is based on truth.  Some of the incidents seem almost fantastical, and yet such can be life.  I am left with a heavy heart for Pino and his loss and the way the rest of his life was colored and continuously affected by those events.  The awful cruelty we as humans are capable of.  The Nazis were beyond belief and I cannot imagine living under that and losing so much, and yet there were so many who had their own time of cruelty once freedom came, maybe not on that scale, but atrocity none-the-less.  I am made aware again of how thin the veneer of our civilized lives really is; how close the potential for horror in the awfulness of war.", "Star": "5.0 out of 5 stars", "Title": "Potential for deep philosophical thought, yet reads like an action thriller"}, {"Upvote": "2", "Review": "By far this was the best Kindle First offering yet!  I enjoyed this book almost as much as the best-selling Unbroken. Thank you Amazon Prime!If you like WWII stories of courage, loss, and how common people do remarkable things under duress, this will be a rewarding read.  The story is a true one, but not one most are familiar with, since the war's impact on Milan is not as well-known as stories about the Resistance in Paris.  There was a resistance in Milan, and many people found themselves having to choose sides, at great cost no matter the choice.  Saving Jews from the Nazis is so heroic that any story about it is worthy of reading.  The hero of this historical novel was a real person who did amazing things he never dreamed would be required of him.The writing is very good, and aside from a very few unnecessary profanities that seemed thrown in just for effect, bordered on excellent prose.  There aren't many, only a handful.Having traveled extensively in Italy I loved the descriptions of towns and street names and landmarks that evoked fond memories for me.  There were many heroic Italians in WWII and you will meet several key figures in the pages of this historical novel that takes a true story and presents it like a spy/action novel, entertaining, sobering, and uplifting.  Humans endure a lot in war time, but our humanity emerges brightly when there is a need for service and sacrifice.  Pino Lella was a common man who became a hero that few in the world knew was one.  After finishing the final chapter recounting his post-war life, he might get my vote for World's Most Interesting Man, more substantive than the guy in the TV commercials.  I had never heard of Pino before this book, but I'm glad I learned of him and what he experienced as a witness to history and as a maker of it.", "Star": "4.0 out of 5 stars", "Title": "Facet of WWII most have never read about, but should!"}, {"Upvote": "3", "Review": "This was a wonderfully written book.  I did not know much about Italy in World War II, so it was very educational for me.  Educational, yet a very compelling story.  His research was amazing, and to end the book describing what happened to the  real characters was so informative.  I am not sure how much of the added 'strory line\" was true, but he had me sold, and I do believe the historical events.  Whether you want to read for historical education or just for the fun of reading, this is a #1 book.  I always say that, as a kid, if the teachers had let us read these historical novels and then filled in the facts, I might have enjoyed history more.  Bravo to the author for doing this for me!@", "Star": "5.0 out of 5 stars", "Title": "A must read -both for enjoyment and education"}, {"Upvote": 0, "Review": "So many times I wanted to put this book down. I alternated between the Audible and Kindle versions. I also had to remind myself that Pino Lello was just a boy when the war started. So many of his actions were heroic but they are also ones of survival. A story of surviving 'in the moment' - without thought sometimes and I think many people who experienced the war will understand. Toward the end (no spoilers) I was horrified and angry and put the book down.  When I started up again and persevered to the end then heard the Authors comments after, I was better able to digest all that had happened. In saying that - I was an outsider in the process. Imagine having gone through all that! I have the utmost respect for Pino Lella. At times the lack of emotion could only have been a 'compartmentalising' factor - survival by cutting off feelings and opinions on the subject in case he broke down. The book was well written and thanks to Mark Sullivan's passion in getting the whole story from Pino Lella as well as the research and time he took before finalising the book is admirable. We cannot judge another's story if we were not there to feel their pain.", "Star": "4.0 out of 5 stars", "Title": "Tragic but Inspiring - well worth the read - or listen on Audible"}, {"Upvote": "4", "Review": "WOW! Five Stars!I have learned so much from this book. Each event that was mentioned I was doing my own research. This book was very accurately told on the Nazi takeover in Italy. I love that this book was fiction, but was basically non fiction. The characters felt so real, with their own intricate personalities. Funny thing is they are real people! If you are looking for more information about the fall of the Nazis, this book is for you. If you are put off by long history textbooks, this book is for you.", "Star": "5.0 out of 5 stars", "Title": "Great read!"}, {"Upvote": "3", "Review": "It didn't take very many pages to see what a labor of love this book was for Mark Sullivan to write. The story is incredible and it's imagined perfectly and told expertly by the author. It's full of suspense, intrigue, heartbreak, twists and turns in a way that only a true story can be. Yes, it reads like a novel. Yes, it's a page-turner that is immensely entertaining. More though, it's inspiring and challenging. I consider Beneath a Scarlet Sky to be one of the 5 best books I've ever read. Thank you Mr. Sullivan for telling this story... and telling it so well.", "Star": "5.0 out of 5 stars", "Title": "Page Turner"}, {"Upvote": "2", "Review": "This is the amazing true story of a 17-year-old Italian boy, Pino Lella, who performed heroic deeds during the last 23 months of World War II, first leading Jewish and other refugees over the Alps from Italy into Switzerland to escape the Nazis, then gathering vital intelligence for the Resistance while serving as the driver for German General Leyers. The author should be congratulated for the many years he spent gathering as much information as possible before writing this compelling story.  He tracked down and interviewed Pino in his old age, Holocaust historians, priests, partisans, eyewitnesses, descendants, and friends.  He visited the sites in Milan and the Alps where the story occurred.  He found scant physical evidence, as many wartime documents had been burned.  Therefore, according to the author, this is \"a novel of biographical and historical fiction that hews closely to what happened to Pino Lella between June 1943 and May 1945.\"  It is exciting, inspiring, and well worth reading!  This is also a story of family and friends, young love, enthralling adventure, and several horrifying instances of wholesale slavery and slaughter of Jewish captives.  The whole is beautifully and skillfully written.", "Star": "5.0 out of 5 stars", "Title": "Exciting and Moving True Story"}, {"Upvote": "2", "Review": "I have said books are beyond words before, but this is soul searing, and a book you will never forget. It is heart aching and inspires you to want to be more. It breaks your heart, and gives you hope. A magnificent look into what happened during WWII in Italy, and the bravery of one young boy who took on, saw, and overcame more than any 17 year old ever should. And while he struggled, he shows how you can find amazing things in a dark and scary world. Truly a book that will touch your soul, change your perspective, and remind you of the person you want to be.The way this book is written, the painstaking research and attention to detail, only enhances the authenticity and emotion that I am sure was expressed when Pino told his story. The author is able to paint both physical and emotional detail like a master of his craft should.I cannot recommend this enough. 5 stars just doesn't do this book justice.", "Star": "5.0 out of 5 stars", "Title": "I cannot recommend this enough. 5 stars just doesn't do this book justice."}, {"Upvote": "8", "Review": "For some (illogical) reason I thought this book wouldn't be great, since it was priced at $1.99. and I've read lots of Nazi/WWII books this year, but the author's background comments prompted me to download it, and boy am I glad I did. This is a whale of a book, one you will get hooked on and read it well until the night until you're finished. It is a fantastic book in so many ways. One, you will learn about WWII in Italy, which not many historical novels cover. Second, you will be treated to a magnificent story based on the true life experiences of \"Pino\" Lella, who until this book was written was an unknown hero, and follow his amazing story throughout the latter part of the war, when Germany \"occupied\" Italy (the Italy fascist leadership, led by Mussolini, was aligned with Hitler).  Pino is a nondescript 17 year old, son of upper middle class parents, whose primary focus in life (as most 17 year old young men) was to have a good time with his friends and begin to enjoy the companionship of young women.  As events unfold,  Pino is nearing the point when he must take part in the war (enlist or get drafted/conscripted). If he joins the Nazi's, he will be sent to the Russian front where the survival rate is about 50%, so his parents encourage him to join the \"Organization Todt\", where Italian men stayed in Italy supporting the German war effort in building trucks, weapons, ammunition, and other supplies to aid the Nazis.  Pino is vehemently opposed to helping the Nazis, whom he despises, but his father convinces him by telling him he can do more good as an \"observer\" (spy), passing inside information back to the Italian partisans resisting the German army.  As it turns out, he has acquired expert driving skills, and through serendipitous events he is assigned as the \"driver\" for German General Hans Leyer, the #2 Nazi leader in Italy, with close ties to Hitler. Much of the book details his travels and service for General Leyer, and he is able to pass valuable intelligence back to the partisans. General Leyer has lodgings in Milan, and Pino meets and falls in love with the General's Italian maid, Anna. That story line, their romance, is well written as well.  As it begins to become clear that the Allies are making significant progress, General Leyer realizes that Germany will be defeated, and he begins to put in place records that will portray him as an American sympathizer, while still dutifully supplying needed equipment and food to the Nazi war effort. No spoilers here, but the end game in the book is extremely well-written, and through both tragedy and the joy of finally freeing Italy of the Nazis we have an eyewitness account of how the retreating Nazis, their fascist collaborators, and the partisans ultimately play significant roles in the final months and days of the war. The author is a true master (while relatively unknown, he is a frequent collaborator with James Patterson on many of his bestseller books).  You will not laugh, but you may smile, and you will certainly be saddened. This is an epic saga that is movie worthy, and I just found out prior to writing this review that the movie has already been cast and will be released (most likely) in 2018. I loved this book. It was educational while also being a moving and compelling story. You will enjoy it on many levels, as I did, and I highly recommend you add it to your reading list. Again, one of the best books I've read this year, and in this genre, one of the best books, period.", "Star": "5.0 out of 5 stars", "Title": "A marvelous tale of adventure, love, and the final portion of WWII. Read it!!! 6 stars if I could give it."}, {"Upvote": "2", "Review": "Beneath a Scarlet Sky, by Mark Sullivan, is a very worthwhile read. A thriller set in Nazi-occupied Italy, it’s based on a young Italian boy’s actual experiences during the occupation. Pino comes to act as a spy on a Nazi leader even as he falls in love with a young woman caught up in that leader’s web. So there’s love and war~perfect.I was easily carried two thirds of the way into the story with good characterization, setting, and plot. At some point then, the story slowed for me, and I put this down to the plot which no doubt conformed to the real life experiences of Pino. In other words, life got in the way of a fictional thriller that grabs you by the throat and carries you through to the end. I did enjoy the finish, however, as well as the “Aftermath” that lets the reader in on the rest of Pino’s life.", "Star": "4.0 out of 5 stars", "Title": "A once-unknown hero~"}, {"Upvote": "2", "Review": "Beautiful, heartbreaking, horrifying story that I couldn't put down.  This book tells of the \"forgotten front\" of World War II, Italy, and the people of Milan and how they suffered, lived and died.  It is a brutally honest book, based on a true story, about the fascists, the Nazis and the partisan underground who were occupying Italy.  It is told through the life of Pino, a man who lived through it all and who, as a teenager, led. parties of Jews across the Alps into Switzerland.  From there he became the driver for a top ranking Nazi and through this role became a spy for the Italian underground.The story unfolded seamlessly which encourages me to read more books by Mark Sullivan.  If you love well researched and well told history, as I do, then buy this book and be prepared for a wonderful, enlightening read.  I learned things that I never knew about the Italian campaign, especially the role that the Catholic Church played in saving Jews from the Nazis.", "Star": "5.0 out of 5 stars", "Title": "ABSOLUTELY AMAZING"}, {"Upvote": "3", "Review": "Terrific thriller dealing with a part of WWII history that is hardly written about: the last months of the war in Northern Italy: the deep conflicts within Italian society on fascism or opposition to it, and the degree of collaboration or resistance to the Nazi occupiers  Also a part of this story are the heroism of many in rescuing Italian Jews who were under threat of deportation and death.  It is interesting to note the number of Catholic clergy honored in the Israeli museum of non-Jewish heroes who saved Jews at great risk to themselves: the museum called Yad VaShem.  Of  course, this review is hardly in the minority: just about every reviewer thought the book is splendid.", "Star": "5.0 out of 5 stars", "Title": "Terrific thriller dealing with a part of WWII history that ..."}, {"Upvote": "3", "Review": "I wasn't sure what to expect with this book and was pleasantly surprised. What a story of a young Italian teenager forced to grow up during WWII and seeing things that no one, much less a young man, should see. From meeting a beautiful young woman, watching his beloved city of Milan destroyed by the Nazi's and their collaborators, being the driver for a Nazi general and helping Jews escape through the Alps, this is a true story of heroism and heartbreak that needed to be told. While the writing was a bit awkward at times, the story is well told and keeps the interest level high. I would definitely recommend this book to anyone who is a fan of history and loves stories of ordinary people who find themselves in extraordinary times.", "Star": "4.0 out of 5 stars", "Title": "A true story of herosim"}, {"Upvote": "2", "Review": "I'm astonished I read it so quickly.Compelling memoir/story of a young Italian boy-man who seems like a Forrest Gump in late WWII northern Italy: NOT because life is like a bowl of chocolates, but because our hero finds himself \"everywhere\" where the action is.We accompany 17-year-old Pino Lella as he leads Jews out of harm's way by a tortuous route over the Alps. We accompany him as he is ushered into the halls of power and influence . . . and finds himself seeking to do \"the right thing\" in the midst of carnage on fields of battle. We are present as he pays the enormous personal and emotional cost associated with being seen by those he loves most--in whose behalf he operates as a spy--turn their backs on him and determine to banish him from their lives forever. We watch as human beings we love--little children and young men and women in the prime of life--have their lives snuffed out in moments of unexpected violence.Perhaps most affecting of all, we find ourselves present during the confusing last moments of a most cruel war, as the defeated armies seek to retreat, and the victors seek revenge: justice and injustice intertwined in the most distressing ways imaginable.Oh. And I didn't mention the love story: the additional fuel that, somehow, kept our hero sane in the midst of an insane period of world history.A book to meditate on even as one inhales the story.Hats off to Pino . . . and the author who brought him to life. I wish all history was written so vividly.", "Star": "5.0 out of 5 stars", "Title": "Stunning, beautifully wrought story"}, {"Upvote": "3", "Review": "An amazing story about a young Italian teenager making his way through the hardships and horror of World War II. Young Pino is sent to Casa Alpina with his younger brother Mimo to keep them safe from the nightly bombings to their hometown of Milan. Father Re, the spiritual leader of Casa Alpina, sends Pino on hikes through the Alps without revealing his true mission at first. When his mission is revealed Pino must choose to take part or to sit by and do nothing. Pino is put through extraordinary situations throughout the war where his faith and determination are truly tested. The people, places and circumstances are vividly described exposing the plight of the Italian people during the war. I highly recommend this incredible story!", "Star": "5.0 out of 5 stars", "Title": "Amazing untold story from WWII"}, {"Upvote": "2", "Review": "The title doesn't really give you any sense of what it is about, so let me tell you -- it is one of the best books I have read in a long time. The incredible but true story of Pino Lella in Italy during WW2 is riveting. The fact that it is all true and that the author has done meticulous research to make the story come alive makes it a real page turner. It is heartwarming yet suspenseful; informative yet extremely entertaining, and utterly fascinating. The bravery and selflessness that Pino Lella and others in Italy displayed during the Nazi occupation is an inspiration, and his exploits, ranging from guiding people through the Italian Alps to escape to Switzerland to actually being a spy in the room with Mussolini should be legendary. I only hope that this book will bring him the attention and thanks he deserves. Salute, Mr. Lella, one of my new heroes! A life lived \"con smania\" indeed.", "Star": "5.0 out of 5 stars", "Title": "A Riveting WW2 Story Written \"Con Smania\" (With Passion)"}, {"Upvote": 0, "Review": "I love true life stories and this is one of the best.  We travel to Italy during World War II and follow the exploits of a young man as he goes from a carefree boy, dreaming only of girls and music, to a young man who has had to face the horrors of war.  At 17, his father sends him to a mission in the mountains to keep him safe from the Nazi's and the bombings where he ends up guiding Jews into Switzerland and safety.  He is called home when German Nazi's move into the apartment below his parents, Close to turning 18, his parents fear he will be drafted into the Fascist army where new young Italians are being sent to the Russian front and almost certain death. However his Uncle has connections that, if he enlists, will ensure his entry in the \"Organization Todt\" who are not fighters.  A set of circumstances propels him from there to becoming the driver for a close aide of Hitler from which position he can report important information to the Allies. A wonderful story of courage.  I highly recommend this book.", "Star": "5.0 out of 5 stars", "Title": "A fascinating story based in truth"}, {"Upvote": "3", "Review": "I was excited to read this book based on all the 5 star ratings and its comparison to the \"The Nightingale\" and \"All the Light We Could Not See. \" Those books were so well written, and had so much heart and soul, that I will forever remember them. I was very disappointed in this book because it never lived up to the ratings; there is no comparison between those two books and this one, other than they all are stories about WWII.I'm glad I read the book - not because I enjoyed reading it, but because I finished it, and now I can leave it behind. I have decided to consider more 3 star reviews when considering 4.5-5 star books.", "Star": "3.0 out of 5 stars", "Title": "Interesting Story"}, {"Upvote": "4", "Review": "While this is a story based on  real life experiences, it is so suspenseful it's hard to believe it's not fiction. Mark Sullivan writes about the life of a 17 year old Italian boy during the Nazi occupation. Based on copious research and personal interviews (including the protagonist himself) we see Italy as it was seen and felt by those who endured there during that perilous time.I give it five stars because it's undoubtedly the best I've read in ages.", "Star": "5.0 out of 5 stars", "Title": "More than Five Stars"}, {"Upvote": "2", "Review": "Like many first person stories of WW2 this story was almost never told and was miraculously suggested to this author by a chance meeting. From there the story unfolds of all the elements found in any War account: espionage, brutality, senseless killings, intense love and good vs. evil. Apparently the war in Italy is not covered as much in literature such as this; therefore, making this account very valuable. It includes the Catholic church's involvement in saving many Jewish lives and the intense civil war occurring between the Fascists and the Partisans along with entanglement with the Nazis. As always it highlights the heroic acts of those who came into contact with all of these elements often with brutal results. This account was very insightful and gave me yet another glimpse into this terrible war of which my father survived (Pacific theater.)", "Star": "5.0 out of 5 stars", "Title": "Unique WW2 Account of the War in Italy"}, {"Upvote": "41", "Review": "This was written as a true story even though the author admits in the introduction there was no means to verify the accuracy. I'm sorry, but there were too many coincidences for me to believe this isn't fiction. Maybe I could believe Pino helped Jews escape across the Alps due to his amazing skills as a mountaineer and skier. I might even believe that he agreed to work for the Germans at his mother's demand, and then became the driver for the most powerful Nazi general in Italy because he could fix cars. It gets deep when the young woman he had fallen for just happens to be the maid of the general's mistress. Pino just happens to witness the death of his best friend's father, a freedom fighter called Truillo, his cousin, and of course, the maid (all at different times). By the time he is selected to translate for the first Americans to arrive in Milan and is asked to set up a great party for them, I'm fairly certain this is a tall tale. But wait, Pino also happens to be a talented pianist and entertains the Americans all night with his jazz prowess. For only 17/18, Pino is quite the renaissance man. As fiction, the story is a three star. I deducted one star for the pretense of truth.", "Star": "2.0 out of 5 stars", "Title": "This seems more fiction than truth"}, {"Upvote": "4", "Review": "This was good story poorly told. This is a “true” story  written as fiction. It is a recounting (reimagining) of Pino Lella’s war experiences. The writing is melodramatic, a bit juvenile and in desperate need of an editor. The final section, “Aftermath”, gives us a clue as to a style that might have worked for this tale.", "Star": "3.0 out of 5 stars", "Title": "Missed Opportunity"}, {"Upvote": 0, "Review": "Given that there are over 4000 reviews on Goodreads and 13500 reviews on Amazon there is little that hasn’t already been said about the quality of this book. I’ll just say that Mark Sullivan was very fortunate to have come across this story when he was in need of something to lift him out of the dry spell he was experiencing in his writing career. The subject of his tale is a true story about the life of Pino Lella as he came of age in Italy during the Second World War. Pino is a character larger than life who experiences the extremes of danger, accomplishments, love and hate. He appears to have no regard for his personal safety when leading Jews over the mountains to Switzerland and becoming a spy as the driver for General Hans Leyers one of Germany’s top commanders. Ironically Pino shows that he has overwhelming fear for his life when he can’t put himself in danger in order to save Anna the love of his life. Though not the very best of writing the biography is compelling and fascinating and certainly keeps you entrenched in the narrative till you reach the last page. The book highlights the fact that for most of us life is not easy and all our questions are not answered but we invariably choose to keep on living.", "Star": "5.0 out of 5 stars", "Title": "Coming of age during WWII"}, {"Upvote": 0, "Review": "So, I got this book as a possible book club pick and at first didn't know if it would make the cut for the simple reason, it appeared to be too easy a read for my sophisticated ladies. I continued reading for my own enjoyment and was pleasantly surprised at how the book developed. The author begins the story in the voice of a naive 17 year old who is largely unaware of what is happening around him. The earliest part is easy enough and innocent enough for a 5th grade class to read as a class assignment.  Sweet, but not impressive. The story gets richer, however, as the plot thickens and the main character begins to grow into manhood. His interest in women and in the resistance intensifies as he loses control over events and the part he ends up playing in them. So much happens to stagger the mind and sensibilities, that you can't even believe all of this really happened to one man.  (If not for the epilogue affirming that it did indeed, one would have to wonder.) By the end of the story, I had to pause because I just couldn't bear the suspense or take in the latest turn of events. I heard myself gasping out loud or shouting 'No!' (Warning: Don't read the last chapters of the book in the dentist/doctor's office.) So, this book will stick with you for a long time. Learning what became of the various people after was also very interesting. A worthwhile read.", "Star": "5.0 out of 5 stars", "Title": "My next book club pick!"}, {"Upvote": 0, "Review": "An incredible, sad epic. The author was fortunate in hearing about this story and I salute him for following it up and doing the research needed to bring it to fruition. I am also impressed by the author's humility. It is not great writing but the story itself carries the reader through.Early in the book, the descriptions of personal interactions are trite and superficial. They do improve as the story unfolds.One thing that disturbed me is that the book makes apologies for the Pope's silence regarding the Holocaust. The author points out that the Vatican was surrounded by German troops and tanks and secretly made arrangements for transporting Jews out of the country. But, even after the Germans were pushed north of Rome and the German threat disappeared, the pope maintained his silence. The play \"The Deputy\" by Rolf Hochuth addresses this poignantly.Altogether, a vivid story of bravery and loss. Well worth the read!", "Star": "4.0 out of 5 stars", "Title": "Good story, but..."}, {"Upvote": "2", "Review": "A truly amazing man, and a story that needs to be shared. This is an intimate look into a young man's extraordinary life experiences during the war. He led people to freedom, risking his life, (against not just Nazi's but Fascists and rebel fighters as well-not to mention the extreme weather dangers of the mountain terrain) when he was just 17 years old, he saw horrors no one should ever see, he risked his life time and again to spy on the Nazi's (even appearing a traitor to his own family for the cause), this is an exceptional individual. I would recommend this book to anyone interested in the war, history, or just as a good read-it is truly an AMAZING STORY!", "Star": "5.0 out of 5 stars", "Title": "AMAZING STORY!"}, {"Upvote": "2", "Review": "Like so many others here I cannot say enough about this wonderful book. I have read extensively on the topic of WW2 but the Italian story is often a footnote in history. I could tell just from the brutal honesty of the author in the Preface that this would likely be a special book but I really had no idea how special it would be to me.It is hands down one of the finest books I have read in a very long time. Pino Lella was a genuine hero. Whether it was just circumstance or his own desire to become such a person is beyond me but, however it came to be, there are whole families that are alive today because of his heroics as a young man. In so many ways it seems that his heroics couldn't help him avoid the tragedy of war that was brought upon him personally.The story of Pino Lella has finally been told. Please take the time to read it. I assure you that you won't be disappointed that you did.", "Star": "5.0 out of 5 stars", "Title": "I Laughed and I Cried and I Feel So Much Better For It."}, {"Upvote": 0, "Review": "I love this book. I think the length of Scarlet Sky may scare some people away, but it flies by, not unlike a good night’s dream—so much packed into what only seems like fleeting moments once it’s over.  And it stays with you. All the experiences of war: the courage, the losses, the lessons, the simple joys, the sustaining power of love during darkest times, the sudden scarcities of what we thought everyday life would always hold for each of us, the fearful choices we hope to God we’ll never have to make. This book is outstanding movie material, and I am looking forward to seeing what Pascal Pictures has done with it. My sincere appreciation to the author, Mark Sullivan, for this gift to the literary world. Thank you for ALL your hard work in bringing this to us. And to Pino, may you be blessed forever for your great passion, unselfish courage, and undying love. You’ve given us all much to ponder, and, hopefully, we each feel deeper compassion for those who have served,  suffered, and/or died during the atrocities of WWII. 💗", "Star": "5.0 out of 5 stars", "Title": "What an amazing, unforgettable story!"}, {"Upvote": "4", "Review": "I really enjoyed the history of Italy's resistance in WWII. The author was quite clear that it was not a true biography but based on a combination of recounted oral history of the actual protagonist and filling the story out with other source material. I appreciate the truth. Some of the feats seemed fantastic and I might have questioned the possibility that it occurred as told but it made it easier to suspend disbelief and just enjoy the story. And, who knows maybe it happened exactly as told.", "Star": "4.0 out of 5 stars", "Title": "I really enjoyed the history of Italy's resistance in WWII"}, {"Upvote": "2", "Review": "A true story about people who survived and who died at the hands of the Nazis and and the Fascist regime in Milan Italy. This story had never been told.  Milan is a city destroyed by the Nazis and occupied because of it’s proximity to the Alps. Crossing the Alps was the way for Jewish families to be transported to Switzerland for safety.  The hero of the story Pino Lella, along with his family and friends and the priests and Cardinals of Milan risked their lives to save people and help the resistance and the Americans defeat Hitler.  It is a story of faith, courage, and love for family and humanity.", "Star": "5.0 out of 5 stars", "Title": "Faith and Courage"}, {"Upvote": "2", "Review": "This is an amazing story, a definite page-turner based on the true story of an Italian boy during the WWII years of 1943-1945.  There are many labyrinths to this story: a combination of rescuer, spy, devout Catholic, and his relationship with clergy, a woman whom he loves dearly, friends, family, partisans, and including a Nazi General and other Nazis.  It all comes together with suspense and intense description that captures the imagination. Throughout the book, the reader can vividly imagine the beauty of northern Italy so adeptly described by the author.  In the end, there is a brief summary of what occurs to the boy as he ages, as well as whom he will meet. He, including others mentioned in the book, will eventually be recognized in Yad Vashem's Righteous Among the Nations.", "Star": "5.0 out of 5 stars", "Title": "Page-Turning Incredible True Story"}, {"Upvote": 0, "Review": "We apply the word \"hero\" to so many undeserved recipients that the term has little relevance anymore.  A basketball player is a hero when he hits a 27-foot shot to win the game.  Finally, we meet a true hero as told in the book \"Beneath a Scarlet Sky.\"  His name is Pino, Pino Lella to be exact.He's a teenager in Milan, Italy during WW2. The story takes place during the last two years of the war and it tells the story of this young man who sees the atrocities committed by the Nazi occupation and is drawn into taking action of his own to help his countrymen.  He assists a number of Jewish Italians to escape the Nazis by guiding them across the Alps into Switzerland under the guidance of a local priest.His parents insist he volunteers for a position in the German army in a non-combatant role to avoid being forced into a combat position.  His parents seemingly belong to the resistance and Pino provides them with information helpful to the Allies.  In the interim, he falls in love with the maid to the whore of his immediate commanding officer who is the second highest officer of Nazi forces in Italy.His exploits, his bravery, his spirit and, yes his vulnerability makes one so proud of this young man.  The atrocities he witnessed would be life enduring.We meet a group of characters that we really care about and cry at their fates but Pino leaves a lasting memory.  The book is based on actual events and it's one you will remember long after the last page.Also, thanks to the author for following up on some of the players.  It was quite interesting when he met Pino, who lives in Italy after spending much time after the war in the US.  He's in his nineties and was so thankful the author brought him up to date on the fate of some of those he met along the way.  It provided a final chapter to an extraordinary life.The only other book I rated so highly was \"The Nightingale\" which in itself was also a remarkable read.Get this one and revel in the majesty of the human spirit.", "Star": "5.0 out of 5 stars", "Title": "A remarkable story.  Don't miss it!"}, {"Upvote": 0, "Review": "Pino’s story of his experience during WWII in Italy is truly incredible and riveting. The author is a gifted story teller. Do not skip the prolog-it is vital for the reader to understand the genesis of this book before they begin. I was fully captivated from chapter one and stayed up all night reading. Reading this book is like listening to your grandfather telling tales of his life experiences.The fact that this story is true is astounding. This book reminds us of all those that suffered the horror of war and all the unsung heroes who risked their lives to selflessly help their fellow man. I cannot imagine living through those years of horror. I appreciate the author’s extensive research to present the most accurate information he could gather and then going the extra mile at the end, telling us what became of all the characters after the war. Without spoiling the story I will say I was shocked and dismayed to learn how life turned out for one of the primary characters.", "Star": "5.0 out of 5 stars", "Title": "Epic"}, {"Upvote": 0, "Review": "I could hardly bring myself to put this book down and attend to other business. My wife had read it and recommended it to me. She hadn’t mentioned that it was the story of an actual person’s life during WW2 and I had just jumped into reading it on Kindle without looking at the prefaceany or reviews. It read like a compelling novel of action and intrigue and, as noted, one I hated to put down.  To my surprise, when I said how much I was enjoying the book, she remarked that it was an amazing tale considering it was based on real life events. The author’s preface and his comments at the end of the book provided a much more detailed and very interesting account of how he came to write this book as well as the circumstances and the lives of the story’s participants after the war.  So I would recommend this book to readers who love exciting fiction about WW2 or well-written accounts of actual events in a fictional mode.", "Star": "5.0 out of 5 stars", "Title": "A Riveting Account"}, {"Upvote": "3", "Review": "The heroism of this young man in WWII is amazing and the telling of the story by Sullivan is first-rate. When you first see a book with so many 5-star reviews, you have to wonder if the writing and storyline live up to that. It is a solid five-star account of an amazing man who helped rescue Jewish people in northern Italy, convey critical information to the resistance movement and spy on one of the top officials of the Nazi occupying forces in Italy in 1944 and 1945. I highly recommend this to anyone who wishes to better understand the amazing efforts it took to defeat Hitler and Mussolini.", "Star": "5.0 out of 5 stars", "Title": "Amazing True Story Well Told"}, {"Upvote": 0, "Review": "“Beneath a Scarlet Sky” is a historical fiction based on the true exploits of an Italian teenager during WWII.  I’ve read lots of books about WWII, but this novel gave me an insight into something that I knew very little about - the Italian partisan resistance against Nazism and Fascism; the smuggling of Jews out of Italy; the hardship and fears of Italian civilians under Nazi and Fascist rule; the brutality that Italians inflicted on each other; the involvement of the Catholic church; etc.I thoroughly enjoyed this novel.  Once I started, it was a novel that so totally engrossed me that when I stopped reading to sleep, the urge to wake up and start reading again was strong.The main characters and location scenes in this novel are so well developed that it felt that I knew them or had been at that location personally.  There is tear jerking sadness in the death of one of the main characters.The research Mark Sullivan did on this novel is extraordinary.  Sullivan’s recounting of what happened to the major characters who survived the war really helped bring closure to the novel for me.", "Star": "5.0 out of 5 stars", "Title": "A truly amazing historical fiction based on the true exploits of an Italian teenager during WWII."}, {"Upvote": "5", "Review": "Very moving book. I am sorry to say l did not know about the things that happened in this country.  Things keep disappearing from history.  That shouldn't happen. If we don't know about it then it makes easier for it to happen again. Well written.Wil recommend to friends and family.", "Star": "4.0 out of 5 stars", "Title": "Wil recommend to friends and family"}, {"Upvote": "2", "Review": "This is one of the best books I have read...and I read many books.  I especially liked the story of how the Jews were taken over the Alps by the young men into Switzerland.  The trip was so treacherous I could feel every step and the bitter cold and ice.  The dig-out from avalanche was vivid written also.along with the characters involved.  The book had to have a love story and it was touching although the ending of that love story was most tragic.  The family that was involved in the Resistance was a brave and powerful one.  The young seventeen year old was above brave and so was his younger brother.  The Catholic church played an important part in the saving of many Jews and spiritual support of the family.I would recommend this book to anyone who enjoys true stories of the World War II madness.  The General and his Driver had a most dramatic relationship!", "Star": "5.0 out of 5 stars", "Title": "Beneath The Scarlet Sky:  A Novel"}, {"Upvote": "2", "Review": "This is a brilliantly told story about the life of Pino Lella. I'd never heard of this man or his life prior to reading this riveting book. The author had my full attention with the foreword in which he tells how he heard, by sheer happenstance, about Pino's heroic, adventurous and romantic life. Not for a moment did I doubt the depth of Pino's love for Anna. And I was so drawn in by the author that I easily felt the height of his joy and the depth of his despair. Certain parts of the book, such as Pino's Alpine skiing heroics, would have made an excellent standalone story. But, combined with all his other exploits, the sheer audacity of his life is almost overwhelming. I have already recommended this book to my friends who enjoy reading because there's nothing like a true story, especially this one.", "Star": "5.0 out of 5 stars", "Title": "Amazing True Story"}, {"Upvote": 0, "Review": "I've read many novels about WWII and the Nazis. I do not recall reading one that talked of Italy and the Nazis and Mussolini and the Fascists.In this book, I rejoiced at every amazing and heroic act that  saved even one innocent person. Then there were the reminders of the trains and death camps and the people who performed these unconscionable acts that caused despair. Intertwined within the historical reminders were beautiful stories of love and family loyalties and Italian joy.  The heroes and heroines were often children who grew up way too fast. Their struggles were real.There was also an element of horrific vengeance in overwrought survivors of this war. Murder and mayhem without any thought of \"sides.\"  Something I had not registered before.After the most recent events in Charlottesville, VA, it is well to remember that there us NOTHING good or acceptable in Nazi policies or philosophies.The truth of this novel is that it depicts the Nazi reign of terror. We would all do well to never forget so that history does not EVER have a chance to repeat.Take the time. It was well written. Great characters, some delightful ones. Some despicable ones too. Kind of like real life.", "Star": "5.0 out of 5 stars", "Title": "Novel Truth"}, {"Upvote": "2", "Review": "First let me say the subject matter of this book is far out of my wheelhouse. I've never been interested in tales of WWII or Nazis; I read mostly medieval historical fiction. Once in a while I like to switch gears and read something different. This is simply one of the best books I've ever read. Aside from the fact that it's based on a true story, it has everything; action, adventure, tragedy, brutality, romance, love, intrigue! Pino Lella is a hero and bore more grief and heartbreak than most people do in a lifetime. All I can say is you will not be disappointed in this book. It's no happy ending but it's a tale of resilience like no other. This story should be a movie or even a mini series!", "Star": "5.0 out of 5 stars", "Title": "Enthralling!"}, {"Upvote": "4", "Review": "This is a wonderfully written story. My discription cannot give Justice to this historical action packed war thriller, it is a heart wrenching love story, a coming of age story, an unbelievable tale about a boy forced to become a man during the Natzi invasion of beautiful Malan Italy. You will easily fall in love with Pino, his family,friends, and his beautiful countryside. Mark Sullivan thank  a you for giving us this amazing story, and the gift of meeting Pino.", "Star": "5.0 out of 5 stars", "Title": "One of the best"}, {"Upvote": "3", "Review": "I normally avoid books and movies based on war stories.  I chose this book from the Kindle free monthly books based on the descritption and reviews, despite it being a war story. It turned out to be a great choice. For me this story while not sugar coated brought the reality of war home without the extreme gory details. It opened my eyes to the internal moral struggles, the politics and the realities of war all as a part of lifes struggles.This is a compelling story, extremely well written with strong character development. I would highly recommend this book even if your interest in war is limited.", "Star": "5.0 out of 5 stars", "Title": "An excellent read, despite"}, {"Upvote": "10", "Review": "I highly recommend this book . The story is about a young Italian boy who unfortunately becomes changed forever by his experiences during WWII. The book is well written and the storyline flows bringing up every emotion that I can think of. It is a story that we should already be familiar with but are not. I am so glad that pino's story was finally written, and with such great detail and depth. This is a true story, and I find myself in awe of pino and Anna, the entire family, and of the courage they stood up to in the face of such evil. And pino is correct, some loves never die.", "Star": "5.0 out of 5 stars", "Title": "A true story of a young boy who quickly becomes a man during WWII, unforgettable !!!!"}, {"Upvote": 0, "Review": "I am so glad that I chose this as my April Kindle First book. I got to reading it late, as I was in the middle of a couple of other books, when I got this. I see from the reviews, that it is probably the best reviewed novel of any Kindle First, so far. It is an amazing book and had I paid $20 for it, I would not have been disappointed. I have read in the author's biography, and in other reviews, that Mr. Sullivan is an acclaimed and award-winning author, was a volunteer in the Peace Corps, began his career as an investigative reporter and is an avid skier and adventurer. He is thus the perfect person to write this incredible story about this courageous, adventurous and caring young man who was indeed an unsung hero of the Second World War, in the area of Milan, Italy. I won't go into the story, as many have already done so and you can also read the description. Suffice it to say that this is an amazing book about an amazing person. As I began the book, I thought the writing a bit simple. Then I realized that he was writing it, though in the third person, as it might have been told by the seventeen-year old Pino, himself. It is his mind and his emotions we are experiencing. I knew very little about the war in Italy and this book certainly enlightened me a great deal. It also moved me a great deal, as I cared very much for this courageous young man. I see that it is only $4.99 on Amazon, for those who didn't get it for free. I urge everyone to go and buy it. You will not be disappointed!", "Star": "5.0 out of 5 stars", "Title": "Exciting, moving and awe-inspiring, one of the best historical novels I've read and an amazing Kindle First!!!"}, {"Upvote": 0, "Review": "A journey hard to believe. That a boy of 17 could have the integrity and dedication to save the lives of strangers in the most difficult of physical mountaineering challenges, in the dark of night.....that he could go on to become a spy while serving at the whim of one of Hitler's second in command.....that he could learn be the best at whatever he chose to do in spite of incredible obstacles, and in spit of rejection and loss....that his life would take him through such harrowing experiences when technically still a boy.....  Here is a story that if, on film would seem too \"far fetched\" to be believable. And yet it is the true story of a life so remarkable it haunts the soul long after the last page is turned. It is a chapter of Hitler's war machine rarely told – that of the Italian Resistance and of the unthinkable barbarity the Italian people suffered at the hands of the occupying German army. It helps set the record straight on a misunderstood part of WWII that has been been called the The Forgotten Front. I would recommend it to anyone who loves history, humanity, and truth.", "Star": "5.0 out of 5 stars", "Title": "A Case for Truth that is Stranger than Fiction"}, {"Upvote": "2", "Review": "This is a true story about a very courageous, lucky, smart young Italian man, is also protected from near-death many times by heaven.  The story opens just hours prior to the bombing of Milan in 1942.  He has many adventures, from leading Jews  thru the Italian Alps to safety in Switzerland, to being the driver for a high ranking Nazi, and then finding his true love.The style of writing is not the best, but the story wad so absorbing that I sat up until very late reading. I liked the ending. There is one part of the story that brought tears, but you will have to read it yourself and see if you agree.I recommend this book. It's not heavy on the history, or drones on about numbers,  like some war stories are.", "Star": "5.0 out of 5 stars", "Title": "Beneath A Scarlet Sky by Mark Sullivan"}, {"Upvote": "2", "Review": "Beneath A Scarlett Sky by Mark Sullivan is probably the best book I have ever read. I absolutely could not put it down. The chapters are completely relatable. The description of all of the action is virtually palatable. You can smell the air in the mountains when Sullivan described them, fell the snow falling and the ice chill of the air. You can feel his fear in each dangerous situation Pino encounters and experience the love he has for Anna.The story is mesmerizing; an untold story of World War II and the atrocities suffered by the Italian people during the last two years of the war under the occupation by the Nazis. I recommend Beneath A Scarlett Sky to anyone who enjoys learning about history and/ World War II.", "Star": "5.0 out of 5 stars", "Title": "Fantastic! Outstanding!"}, {"Upvote": "2", "Review": "I’ve read so much WWII fiction and nonfiction. Some good, some not so good. I now feel like I understand life in wartime Italy. This story has all the elements that make for suspense, Pino is a likable, but not perfect protagonist in unbelievably precarious situations who doesn’t know how heroic he is. Antagonists and supporting characters are well drawn and complex, the love story is compelling and believable.The ending is satisfying but leaves some loose ends as real life is wont to do. The author has done a service to humanity by not letting this story die. My highest recommendation.", "Star": "5.0 out of 5 stars", "Title": "Amazing"}, {"Upvote": 0, "Review": "One of the best historical novels written. A great amount of research was performed by the author to provide an accurate description of life in Italy during WWII.  The story follows the life of a young boy who grows to manhood during the war.  The descriptions of the Alps and surrounding areas made it easy to picture as the story progresses.The persecution of the native Italians and Jews during these times was atrocious, and the main character witness a great deal.  At the same time, a love story develops with him and a young lady which is beautifully told.This is a vast story involving real characters who were very involved in the Nazi invasions.A tremendously well-written novel. I look forward to reading more from this great Author.", "Star": "5.0 out of 5 stars", "Title": "Incredible novel"}, {"Upvote": 0, "Review": "A very interesting true story that tells of the sacrifices made by everyday people caught in the clutches of Nazi rule in Italy during WWII. Our hero is a real hero who also fails in that role with the accompanying loss and tragedy that always comes with war and self survival. You feel empathy for him, understand his fear, see his weakness and strength, are compelled by his loss and his guilt that continues to this day. Could you have done differently? Could you accept the consequences of your decisions to live and not give up and die even though others, loved ones, may die as a result? Real heroes are seldom completely certain of their actions and motives. This hero is very human and that makes this true story worth reading. Highly recommended for everyone especially those young adults that have little knowledge of the greatest generation and it's sacrifices in WWII.", "Star": "5.0 out of 5 stars", "Title": "Could you have done this?"}, {"Upvote": 0, "Review": "Well, apparently one of the most amazing stories of WWII came close to never seeing the light of day. The characters and events are all real, which makes this story so incredible. I couldn't wait to see what happened next. Obviously, after all these years, much of the dialog had to be invented, and on a few occasions it became a little hokey, but, hay, perhaps much of it was real also. Anyway, nothing could detract from the power of this story. I've been told that a movie will be made based on the book, but I don't think a movie of just 2 hours could do it justice; too many important events would have to be omitted which would be a shame. A \"mini-series\" of perhaps 6 or 8 episodes would work better. After reading the book, be sure to read the \"Afterword\" to find out what became of all these people.", "Star": "5.0 out of 5 stars", "Title": "Upsetting to think that this remarkable story came close to never being told"}], "Star": "4.8 out of 5 stars", "Name": "Beneath a Scarlet Sky: A Novel", "Format": "Format: Paperback", "Price": "$11.99", "Author": "Mark Sullivan"}