{"Name": "My Dear Hamilton: A Novel of Eliza Schuyler Hamilton", "Author": "Stephanie Dray", "Price": "$13.59", "Format": "Format: Paperback", "Star": "4.8 out of 5 stars", "Comment": [{"Review": "I’m not going to lie. I’m sort of a Hamilton fan. Having previously read Ron Chernow’s compelling biography, Alexander Hamilton, I already knew Hamilton’s wife, Eliza Schuyler Hamilton, was an intriguing and resilient woman. Also, having read America’s First Daughter by historical fiction novelists Stephanie Dray and Laura Kamoie, I knew this dynamic writing duo wouldn’t do anything less than exceptional in telling Eliza’s story; therefore, I highly anticipated My Dear Hamilton. Dray and Kamoie far exceeded my expectations. I absolutely devoured My Dear Hamilton from beginning to end!There’s no doubt that Eliza Schuyler Hamilton lived through an exciting time in American history. She was right in the center in witnessing the birth of a new nation. She’s mostly known as the wife of Alexander Hamilton, one of the Founding Fathers of the United States; however, there’s so much more to this woman with a compelling life story. I very much appreciated that her life before marriage is portrayed in My Dear Hamilton. We get to know the endearing relationships she had with her family, especially her father and sisters Angelica and Peggy. It’s with these strong familial bonds that she would deeply rely on later in life.At its heart, My Dear Hamilton is very much a love story filled with betrayal, sacrifice, loyalty and forgiveness. Yes, she was indeed a devoted wife and mother, but she was also characterized in this book as a woman possessing admirable inner strength. Through their intensive research, the authors expertly shape, not only Eliza’s journey through life, but her emotional well being as well. Readers will celebrate with Eliza through her happiest of times, feel utter heartbreak as she endures public humiliation, and be encouraged by her sheer determination and accomplishments.Eliza outlived her husband by 50 years. In her 97 years, it’s fair to say that Eliza Hamilton had loved and lost so much. Her emotions are so thoughtfully detailed with the passing of the most important people in her life. I was very curious about her life after her husband’s infamous duel. There’s a scene towards the end of the book, and this is not a spoiler, where she literally lays everything out in front of her to try to make sense of what she’s learned. I found this moment to be poignant, sorrowful, and something totally relatable as humans. I’d like to think that scene was how it really played out years ago, but it was surely memorable the way the authors depicted how she may have dealt with that part of her life.If Eliza Schuyler Hamilton were alive today, I think she would applaud how Stephanie Dray and Laura Kamoie interpreted her life though My Dear Hamilton. Another brilliant and fascinating read from these talented authors!", "Upvote": "111", "Title": "A brilliant read on a fascinating woman!", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "After America's First Daughter, my expectations from this team were high -- but they were exceeded in every way as I read this truly impressive book.It is an incredible, surprising, and altogether lovely tribute to the woman who stood beside one of the most unknowable, irascible, energetic, and passionate of the many people who contributed indelibly to the foundation of this nation.  I am left both humbled at the accomplishments of the Hamiltons, and uplifted by the depiction of Eliza.More than that, though, I am awed by the scope of the work that Dray and Kamoie undertook.  Spanning the tumult of the Revolution, and reaching all the way up to the eve of the Civil War, through the decades where the nation itself was being invented out of whole cloth, My Dear Hamilton hints at the changes that rushed past Eliza, while maintaining its focus on her as the prime mover of her own story.Watching her emotionally knocked to the ground, over and over, and yet each time finding her feet again and not merely persevering, but triumphing, we get a sense of the force of Eliza's personality, and just how equal a match she was to her husband, the force of nature we've come to know in the wake of the musical Hamilton.In the end, My Dear Hamilton works not only as a marvelously rich work of historical literature, but as a deeply personal meditation on one woman's process of making her place in history, keenly aware that history has its eyes on her.", "Upvote": "42", "Title": "\"Best of wives and best of women...\"", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "When my daughter and I saw Hamilton in February, I turned to her after the final notes and said “wow, Eliza Hamilton was a remarkable woman! She needs her own story.” I was delighted to discover that Dray and Kamoie has taken that task on, and brilliantly so—I’m a political history nerd to the core, and I learned a lot from this book. It takes a gifted writer to keep you turning pages when you already know the ending, but this team managed it. Don’t miss this book!", "Upvote": "21", "Title": "A remarkable woman", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "This was the latest book in my book club. I'm not ashamed to admit I'd probably wouldn't have given it a second look if it wasn't part of my club. It was slow to get through (and pretty slow throughout), but it was ultimately a great story, examining someone close to Alexander who hasn't had much of a chance to have her story told.The audio book was just as good as the story it told. It was the first audio book I listened to (outside a few samples) and I definitely would consider buying another. I bought this one because I had to read the book in July but knew I had little time to read the 600+ page tome so I listened to this while working. Cassandra Campbell did a great job, not only as Elizabeth/the narrator, but as every other character. Her playing a Frenchman or southern gentleman sounds funny at first, but she makes you accept it.I recommend both the book AND the Audible version (and if you buy Kindle, you get the Audible at a discount :) ). A great story whether you read it yourself or Cassandra Campbell reads it to you.", "Upvote": "3", "Title": "A great story, if slow at times.", "Star": "4.0 out of 5 stars", "positivity": 1}, {"Review": "Although a work of fiction, it stuck close enough to the facts to know that it was well researched.  Well written.  It had me enthralled from the first page.  The writer brought the Hamiltons and others to life in a captivating tale.For fans of Thomas Jefferson, please read some of Jefferson's own letters first. I was glad I had already lost some of my illusions of Jefferson's character before reading this book because it paints a totally different picture of him than most of history does.And, in case the writer reads this review, thank you for bringing my ancestor, James McHenry, to life for me.  You were much kinder to him than most historical accounts.  He was a doctor, a patriot and well out his depth as Washington's Secretary of War.History often omits how much these patriots personally sacrificed and risked to found the United States of America.This was a beautiful book about bringing to life flawed men and women, their lives, and their accomplishments to history.", "Upvote": "4", "Title": "For fans of historical fiction, this is a must read.  Loved it!", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "Having been a Political Science Major – I expected I’d know this entire story.  Oh, but how I was delightfully mis-taken!  The substantive, richly rounded, extraordinarily vivid characterizations were inspiring as the characters they depict were actually valiant.  The talented dynamic duo Authors are to be lauded in their depictions!  Elizabeth Schuyler Hamilton, what a remarkable woman - who enabled an indomitable, brilliant man to literally hold the fraying tapestry of our Country together.  Without Alexander Hamilton, we’d absolutely not have the United States today!  Who realized just what a precarious precipice we’d been balanced upon, and Hamilton actually tipped the scales to co-founding our country by sheer resolve?  This was a wonderful journey, learning of just how Betsy/Eliza was entirely integral to his driven, determined tasks in shaping our Country and forming our Central Banking System, despite the initial turmoil - which is surprisingly still afoot - what with greed, self-serving backstabbing, sleazily questionable ethics, scandalous affairs, intracate intrigue, labyrinths of compromises, ferocious frenemies, and murderous destruction, continually surviving to this day.  That despite all these challenges, they accomplished anything at all, no less this lasting, is nothing short of miraculous.  That Eliza’s fortitude surpassed being cruelly betrayed, and that she chose to take the high road, wisely realizing that everyone is human, by definition - with human foibles - thus should be judged solely via a balance of their choices, not of their worst, is truly noble.  That she persevered deep heartache, to continue to lovingly take care of her family - left destitute by her husband who ironically was the First Treasury Secretary - yet she fulfilled her determination to preserve his legacy is honorably ultra-noble, even more so than her flawed husband.  A better, more admirable, and valiantly courageous person, by far, she!  Thus, one must ponder, without Elizabeth Schuyler Hamilton, just where would our Country be today?", "Upvote": "5", "Title": "A masterful recount of an entirely amazingly resolute heroine", "Star": "4.0 out of 5 stars", "positivity": 1}, {"Review": "After my loss of words reaction, I can say My Dear Hamilton is unquestionably my favourite book read so far this year (2018).I dived into this novel with no prior knowledge of who Elizabeth Schuyler or Alexander Hamilton were. After finishing the book, it left me with a huge void and a desire to discover more about the people closest to Elizabeth and Hamilton and the legacy they both left.My Dear Hamilton captured my imagination and left me craving more. Of course, Alexander Hamilton himself intrigued me and I fully appreciate why he has become such an iconic historical figure. He is perfect as a romantic hero; dashing, brave and imperfect. However, it is his wife Eliza who is the one full of surprises. Historically, she's known more as the daughter of a general and as the wife of one of the founding fathers; but Eliza's life after Hamilton's death is noteworthy. As well as her stubborn determination to preserve her late husband's legacy, she championed the protection of widows, their children and orphans.A book to savour! With over six hundred pages, Initially, I was a little concerned about my ability to absorb all the historical facts. However, the writers' did a marvellous job of incorporating the finer details within the narrative which not only kept my interest but enabled me to maintain and remember the information as we learn it. Written as a historical novel, the writing style definitely played a significant part in my overall enjoyment of this momentous period in American history.I'm happy with the literary liberties the writers took with some facts and fully appreciate the thought process involved. The inclusion of this information at the end of the book is informative and adds an extra dimension to an already rich text.This is the first novel I've read by these authors. I already own a copy of America's First Daughter and after my positive reading experience of My Dear Hamilton, I can't wait to read it.***arc generously received courtesy of William Morris Paperbacks via Edelweiss+***", "Upvote": "9", "Title": "A Fascinating lady.", "Star": "5.0 out of 5 stars", "positivity": 1}, {"Review": "I love history and I was so excited to read My Dear Hamilton.  It was so much more than I expected.  It was like taking a behind the scenes journey in the founding of our great nation through the eyes of Eliza Hamilton.  What a journey it was!  There is so much content in this book surrounding the Founding Fathers and what efforts and sacrifices they went through to establish our country.  I learned so much!The authors did a fantastic job of researching and creating a history of Eliza Hamilton based on facts and documents.  Her story has so many facets to it.  From her childhood and family devotion, to her early adulthood and meeting Alexander Hamilton, to her marriage to him and the life they had together.  It was a marriage that was loving and supportive but there were also struggles and difficult times.  Eliza was Alexander Hamilton's champion and believed in his love for the country and his desire to make it succeed.  This story is a saga that I loved reading and made me appreciate even more what it took to begin our great nation.I appreciate the in depth conversation at the end of the book about what the authors created the story on and their research into writing this novel.", "Upvote": "9", "Title": "Eliza Hamilton's Story", "Star": "4.0 out of 5 stars", "positivity": 1}, {"Review": "The authors of this novel have done a wonderful literary depiction of our nations founding father Alexander Hamilton and his loyal and long suffering wife, Eliza.Eliza endured calamity, agony, and joy being married to the complicated and talented Hamilton.I love and respect the manners the actors of that era afford one another.Politics in the beginning of our nations birth closely mirror the deceitful and sordid politics of today’s. Interesting", "Upvote": "3", "Title": "A must read", "Star": "5.0 out of 5 stars", "positivity": 1}]}