{"Comment": [{"Upvote": "19", "Review": "Madeliene L'Engle's \"Wrinkle in Time\" was one of the few young adult books that I actually read when I was a young adult.  I loved it then and have read it repeatedly in the past 40 years. My current passion for graphic novels and adaptations led me to this version by Hope Larson.Unlike some graphic novel adaptations, Larson had to abridge this story to some extent.  The other issue I had with this book was that the characters did not appear as I had envisioned them.  But the former was a necessity and the latter was a matter of personal interpretation, and neither detracted from the quality of this book.The adaptation follows the story of Meg and company closely.  Larson chose a difficult book to illustrate.  Characters such as Aunt Beast and IT might be better left to the imagination.  While the art is good, I would have liked it to have used as much color as the cover.My original intention was to reread L'Engle's version before I read this adaptation, but graphic novels draw me into them and don't let go until I have made it to the last page.  It has been at least 10 years since I last read \"Wrinkle,\" and it may be best that I didn't read it right before this book; I didn't make direct comparisons of descriptions and dialog, and that probably made this graphic novel more enjoyable.Looking at Hope Larson's work, I see that she collaborates on original stories and has others illustrate them. Even though I don't see myself reading Larson again, I would recommend her work to children or young adults.  Like \"Wrinkle\" her other works seem to include the important questions that good juvenile and young adult literature should ask.---------A note about reading this on Kindle:  This is the third graphic novel I have read in an electronic format.  One book was a Kindle enhanced version of \"Trillium,\" which had an option that allowed for swiping from frame to frame instead of page to page.  There was not enough opportunity to zooming in on the frames to make the reading easier.  In addition, the material was presented one page at a time instead of in a full-spread format to see opposing pages at one time.  This prohibiting seeing splash art as it was created by the artists.There was an improvement in \"Will 'o the Wisp,\" published in Adobe Digital Editions format.  There was an opportunity to zoom in as much as desired, but I found bouncing back and forth between full-page mode to see the art and zoom mode to be able to read the words was somewhat cumbersome.However, I would have loved to have had either zoom option with \"Wrinkle.\"  This Kindle book version did not let me zoom in on any of the individual frames, and so I actually had difficulty reading the text at all.  If I hadn't already had much of the story and dialog memorized from frequent reading of the L'Engle's book, I would not have been able to read it, and would have asked for my money back.I will hesitate reading other comic books and graphic novels in electronic format in the future, unless I know that I will have the ability to read the text in addition to seeing the art in double-page format as intended by the authors and artists.", "Star": "4.0 out of 5 stars", "Title": "I loved it then and have read it repeatedly in the ..."}, {"Upvote": "13", "Review": "<3 💗Absolutely LOVE it❣️❣️❣️ We have a 7, 9, 11, & 15 year old all reading it with us and THEY ALL LOVE IT❣️ Wish I would’ve bought this sooner‼️This book is not word for word. The editing is concise, very fluid and more up to date in many ways, making it much easier for younger readers to comprehend.  If you are having a young reader use this as a companion to an audio book it will not work out and they will easily become lost!💰 💵 Paid full price. Not compensated in any way to leave this review. I believe in Amazon’s HONEST, unbiased community reviews to make many of my purchasing decisions which is why I contribute whenever I can by lending my own perspective in leaving a review of my experience with the different products I purchase.", "Star": "5.0 out of 5 stars", "Title": "👍🏽👍🏽AWESOME❣️⭐️⭐️⭐️⭐️⭐️"}, {"Upvote": "7", "Review": "I am so excited to use this book with my special education class.  I am actually going to read the full novel while projecting the graphic novel on the Promethean board so the students can have a visual support.  We will also compare and contrast the novel, graphic novel, and new movie.  I also had the school order several paperbacks so the students have a book in their hands.  I haven't done this before but have high hopes.  I decided to do it this way because the text in the graphic novel assumes background knowledge that my students may not have.  Also, there is a subtle difference between in drawing style and color between actual action and Meg's internal dialog.  I have lost the thread a few times myself and am carefully making notes so I can explain what's happening to my students.", "Star": "5.0 out of 5 stars", "Title": "Pair with full novel for classroom use"}, {"Upvote": "20", "Review": "An excellent graphic version of the classic novel. I wish it was more colorful, but it is beautifully drawn. It is an exciting adventure of three kids traveling through time and space, explaining the science along the way, with the help of three magical old ladies to rescue a missing man. If only SOME CHARACTERS could manage that...", "Star": "5.0 out of 5 stars", "Title": "Wibbly Wobbly Timey Wimey Spacey Wacey Humany Wumany"}, {"Upvote": "5", "Review": "Bought this as a gift for an 9-year old girl. I wanted to buy her a book that would nurture her budding scientific mind, but was afraid the print version would be too difficult for her at a young age -- though I really wasn't sure, I just remembered reading it as a pre-teen. I played it safe and got her the graphic novel in the hopes it would turn her to the print version as she got older. She loved this book. Her father, who was a fan of the original, also sincerely loved this graphic novel. It ended up being a great gift.", "Star": "5.0 out of 5 stars", "Title": "Great Adaptation (so I hear at least)"}, {"Upvote": "9", "Review": "I originally read the novel several decades ago, and consider it one of a handful of books I read when young that shaped who I became as an adult reader. When I was assigned this graphic adaptation as part of a graduate class on adolescent literature, I approached it with a great deal of trepidation - just the idea of a graphic novelization of such a loved novel from my past disturbed me greatly. So I was pleasantly suprised to find this adaption to be extraordinarily faithful to the source material. It is obvious to me that the artist held as much appreciation for the novel as I did, and that appreciation shows in every panel, as well as in the overall presentation of the material. Well done! And a big thanks to Hope Larson for showing such love and respect to Ms. L'Engle's original words.", "Star": "5.0 out of 5 stars", "Title": "Well Done!"}, {"Upvote": "9", "Review": "I've been a big reader since I was very young.  As a small girl, I would voraciously read more or less anything that was placed in front of me, from cereal boxes to a well-loved dictionary.  My grandparents loved introducing me to books that my mom loved as a kid, and one of my favorites was A Wrinkle in Time.I don't think I need to explain the story, but it is one of the best gifts a clever, perhaps slightly strange kid can receive.  The book stresses the importance of valuing yourself, both your faults and your strengths.  It reminds us that the ways we differ are just as important as the ways we are the same.  Perhaps most important for me, it tells us that home is what (and who) we make it.  It's just a gorgeous story, and one that other, far more concise folk have summed up.This adaptation, by the wonderful Hope Larson, is simply fantastic.  Much of the language is very much the same as in the original L'Engle, so it has very much the same feel.  I'm re-reading the original now, and the first few chapters are more or less the same in tone and feel.With regards to the art, I am totally charmed!  I love how Larson indicates color and movement.  A personal favorite is when Meg mentions Calvin's eyes being blue.  The whole book is blue, but when I looked at Calvin in that panel, they looked brighter.  It was beautiful.  Overall, I feel the art was exceptionally faithful to how I imagined the beautiful and fearsome aspects of the book.  Like others, I found IT to be particularly enjoyable.  I also want to stress how much I loved Mrs. Who in this version.  She never resonated with me the way Whatsit did as a child, but as an adult, I've found Who to be more my speed.  After all, communicating with the words of others -- It truly is easier sometimes, is it not?Perhaps I would not love this version as much were I not a lifelong fan of the book.  I can certainly understand that, and I do suggest reading the novel itself first if you have not before and are an adult.  For children though, this is a lovely introduction to a lovely author.", "Star": "5.0 out of 5 stars", "Title": "Faithful and Gorgeous Adaptation"}, {"Upvote": "4", "Review": "Beautifully illustrated book! This graphic novel version accurately follows the original book. I bough several copies for students who are English Language Learners in my class, and this has greatly helped boost their comprehension when we read \"A Wrinkle in Time.\" These books are also printed on high quality paper.", "Star": "5.0 out of 5 stars", "Title": "Beautifully illustrated book"}, {"Upvote": "2", "Review": "This is a graphic novel version of Madeleine L'Engle's A Wrinkle in Time that was well done. It kept the most important parts of the plot and added nicely done illustrations. The palette of blue, black and white matched the mood of the story very well.While it is missing the rich detail of the novel, this provides a good introduction for new readers of the book and a nice refresher for those of us very familiar with the original.", "Star": "5.0 out of 5 stars", "Title": "A Wrinkle in Time Gone Graphic"}, {"Upvote": "2", "Review": "My 11 years old loved it. She said the graphics were very good and that the writer managed to put in all the important details of the story, even though he had to make it shorter because it's a graphic novel (she read the actual book and the graphic novel version). She said it was a great purchase and she enjoyed it a lot.", "Star": "5.0 out of 5 stars", "Title": "My 11 years old loved it"}, {"Upvote": "5", "Review": "Near 50 years ago, I won a copy of \"A Wrinkle in Time\" for having read 57 books over summer vacation. I remember I was half-way through the summer, having spent hours in the library reading (you know.. with my good friends, Henry Huggins, Nancy Drew.. etc) before they told me I could check out books and take them home. Wow! Best summer treat ever! Over the years since, I have read A Wrinkle In Time to my four children, and countless times to myself. I still have the copy with the little typewriter-typed presentation inscription and my picture in the newspaper. I am convinced there is a \"Wrinkle In Time\".. for how else to explain the vividness of the memories, let alone the fact that I still have this book near 50 years later!Anyway, I recently got the graphic novel and have been enjoying it immensely! Sure, the characters may look different than I imagined during my readings... but so do any old friends I might now reconnect with. I am reading the condensed words more than studying the pictures anyway. It is like looking through a text version of an old photo album with a few sketches to carry me through the passages. I can't imagine anyone who enjoys the original novel would be unhappy with this graphic novel. That said, it is worth (even important) having both. I can't imagine having grown up not knowing Mrs. Who, Mrs, Whatsit, and Mrs. Which, the image of the giant brain and the identical houses and the children bouncing the balls at the same time..... and all the rest.  I will probably reread the original novel once again this year. Anyone who enjoys graphic novels AND the original story, will not be disappointed. I would only suggest you start with the original novel. A gift of both to someone would be an amazing wonderful present!", "Star": "5.0 out of 5 stars", "Title": "Thoughts on original book and graphic novel"}, {"Upvote": "5", "Review": "Madeleine L'Engle's classic science fiction tale for children, \"A Wrinkle in Time\", has made the jump to graphic novel, courtesy of writer and illustrator Hope Larson.  \"A Wrinkle in Time\" has stayed in print since its initial publication in 1962; this quality adaptation will introduce the story to a new generation of fans.As the story opens, we meet Meg Murry, awkward teenager, who can't fit in at school and who pines for a father gone mysteriously missing on a secret government project.  Her mother can't or won't offer an explanation.  Her only consolations are her uncanny younger brother Charles Wallace, and a brand new friend from school, Calvin O'Keefe, who seems to fit right into the Murry family and who, wonder of wonders, finds Meg attractive.The three children are enter on a unique adventure, a journey across unmarked time and space, to find Meg's missing father.  Their journey will be by tesseract; their companions will be the three uniquely different old ladies known as Mrs. Whatsit, Mrs. Who, and Mrs. Which.  The children will encounter worlds and beings undreamed of.  At the most distant point of their journey, they will find Meg's father, and something else, a dark being with unexpected power.  In the end, it will be up to Meg to discover her own strength and find the way home.\"A Wrinkle in Time\" is very highly recommended in graphic novel to its fans of any age.", "Star": "5.0 out of 5 stars", "Title": "They were not expendible..."}, {"Upvote": 0, "Review": "My 8-yr-old son devoured this in 2 days.  I'm excited for him to get the overview before the movie comes out.  He's great at \"decoding\" words but is still 8 and is working on \"comprehension.\"  So voila, the beauty of the graphic novel.  I think he gets it, and after this and the movie, he'll be more ready for the full unabridged version.", "Star": "5.0 out of 5 stars", "Title": "He's great at \"decoding\" words but is still 8 and is ..."}], "Star": "4.5 out of 5 stars", "Name": "A Wrinkle in Time: The Graphic Novel", "Format": "Format: Hardcover", "Price": "$13.99", "Author": "Madeleine L'Engle"}