[{"Comment": [{"Upvote": "868", "Review": "My sister and I listened to this book from Audible and I am now reading his other book.  Such a sweet, well written story of despair and hope.Having just lost a husband less than a year ago, I can certainly relate to his sorrow and feelings of worthlessness - being old and useless.  What a blessing this book as been to me.", "Star": "5.0 out of 5 stars", "Title": "What a blessing"}, {"Upvote": "393", "Review": "I honestly didn't go into this book expecting to like it as much as I did. I have trouble with books where the main character is not someone I particularly like. But, I gave this one a shot. I was pleasantly surprised. I couldn't help but like the curmudgeon. It's not a deep-thinking book. It's there for entertainment, to make you 'feel' emotions, to transport you to another place and another life. Therefore, I give the book five stars for being exactly what it claims to be--a story about one man and the circle of friends that he makes despite his grouchy personality. I liked the backstory with the wife (even though I thought the author went too far with the tragedy heaped onto this always-optimistic woman). I bought the audio book to listen when I couldn't read and the narrator was flawless. I've heard some pretty bad narrators lately from best-selling books (Miss Peregrine's for example), but this audio book was very well done. I have one gigantic bone to pick with the author. 59 years old is not 89 years old. Fifty-nine years old is when most people are in the apex of careers--before retirement and also having a lot of knowledge and experience to help them in their career fields. The 50-somethings in my office know what an iPad is, how to use computers, have the latest cell phones, and are pretty up on all the new tech gadgets because they are the ones that can afford them! There was no reason why the author couldn't make this a lot more believable by making the main character 79 or older. There was nothing to prevent the backstory being set further back. The whole time I was reading, I had to make myself forget the character was supposed to be 59. For godsakes, the President of the United States is 56!!  I wonder why the author chose such a relatively young main character to act like my grandfather would.  But, if you can overlook that weird decision, the rest of the story is very well done and very entertaining.", "Star": "5.0 out of 5 stars", "Title": "Pretend Ove is 79"}, {"Upvote": "437", "Review": "There is a part of me that didn't think I needed to review A Man Called Ove because so many people have read it at this point, but I have talked to a few who have not, hence my desire to write this review.I will admit that I am entirely on the Ove train!The book is about a man, named Ove, who is the angry neighbor that we all seem to have. He complains about everything, has put up signs around his neighborhood with rules about what should and shouldn't be done, and feels there is a proper place for everything. He is not a friendly guy to say the least.Into his life walks or rather drives a family who are to be his new neighbors. He doesn't bother to get to know their names and calls them the pregnant one and the lanky one. After an accident with the lanky one, Ove is forced to help this family, complaining the entire time.Throughout the book Ove also speaks to his wife, complaining about the neighbors, the rule breakers, and how much he misses her (very minor spoiler). During interludes within the narrative, we read about how Ove became Ove. I will say by the end of the book, a bunch of dust was flying around the room and some got into my eyes.The first thing to write is this book is funny. Ove is quite the character and how he treats people is hysterical. He just doesn't care what he says or how he says it. He simply wants order in his world and has lived that way for all of his life. The way he expresses himself becomes incredibly funny.It is also a tragic story. Backman interweaves the two (funny and tragic) quite well and doesn't make it overly heartwarming. This could have easily become a book with the sentiment that we don't know people's past, so don't judge them, but it isn't. Ove is an ass in his past too and sometimes with reason. Backman keeps it level with just enough to make the reader fall for Ove.The great thing is this is a book that pretty much anyone and everyone can (and will) enjoy. I recommended this one for book clubs and discussion groups. Grandmas will like this as well as middle aged men. Ove is simply a good book.I gave this one 5 stars.", "Star": "5.0 out of 5 stars", "Title": "A Book for everyone"}, {"Upvote": "14", "Review": "In case you’re one of those few who haven’t heard about this book, here’s what it’s about in a nutshell: a curmudgeonly old man is prevented from killing himself multiple times by neighbors who are needy and people to refuse to obey the sign that restricts parking in the residential area of his small neighborhood. It’s like the movie Up, only with more people that are adults, and more character. Take this paragraph for example:\"For more than fifteen minutes he stood waiting for her at the station in his tight-fitting suit and his new-polished shoes. He was skeptical about people who came late. 'If you can’t depend on someone being on time, you shouldn’t trust ’em with anything more important either,' he used to mutter when people came dribbling along with their time cards three or four minutes late, as if this didn’t matter. As if the railway line would just lie there waiting for them in the morning and not have something to do.\"Every sentence in this book is imbued with characterization and style; every word is a brushstroke in the painting of Ove as not only a curmudgeon, but an (spoiler alert!) orphan, a loving husband to a wife who was paralyzed and rendered infertile by a drunk driver, a principled man, a hard worker, a dedicated Saab driver, and one of those loyal-to-the-death-but-you-wouldn’t-know-it-to-talk-to-him kind of people.And, unlike most adult-genre books, especially ones about old people, there is something interesting or amusing or soulful on almost every page. The pacing and plot weaving are impeccable. It’s truly a treasure to read.", "Star": "5.0 out of 5 stars", "Title": "A Treasure to Read"}, {"Upvote": "34", "Review": "Fredrik Backman, thank you for \"A Man Called Ove.\" This book had me laughing out loud and dabbing at tears as I turned the pages and was drawn into the lives of the characters in this story. Backman sketches each scene with deft, bold strokes and yet a light touch. Ove's curmudgeonly approach to the world is akin to an oyster whose crusty shell protects the pearl that grows within. His neighborhood is a rainbow of quirkiness. Backman pokes fun at small town bureaucracy with the \"man in the white shirt,\" and wannabe urbanites with the \"blonde weed wearing sunglasses\" and \"her damned mutt.\"'  He meets his match in a scruffy stray cat that moves in uninvited. The tiny \"Pregnant Foreign Woman\" inserts herself into Ove's life and doggedly pulls him out of his shell. We can all relate to Ove's need for order in a world of chaos and his desire to shrink into his shell when he's been hurt. We're all reminded that the best things in life happen when unlikely people are thrown together in unexpected situations to produce uncommon results. Ove's transformation offers hope to anyone doubting that we are all capable of loving, and of being loved.", "Star": "5.0 out of 5 stars", "Title": "Backman pokes fun at small town bureaucracy with the \"man in the ..."}, {"Upvote": "22", "Review": "I've just set this book down after reading it one sitting. I was interesting in the book because of recommendations from friends and its place as a Best Seller, but it's not the kind of thing I usually read. All the same, I have never been so touched by a book that I had to immediately sprint to the internet and share my feelings.Ove is grumpy and awful and the first two chapters left me frowning and upset, wondering who would want to read a book all about someone so unhappy. But minutes later, I was deeply enthralled with the story of Ove. Backman has a unbelievably skill, a heartwarming talent to weave Ove's story through different timelines and a completely breathtaking array of events. I mean it when I say I COULD NOT put this book down. I had to know more about Ove and his life, and I was not disappointed. I am left here with a heart that is full from Ove's story, a heart that breaks for an old (although not that old) man called Ove who somehow found his way into my soul and proceeded to deeply and proundly speak to me about the nature of loss and love and honesty.Each and every character Backman has created has a story to tell, and each of them finds a way to tell it through Ove's eyes. Every second of this book was something refreshing and touching and completely overwhelming. I am unlikely to ever forget what an utterly fantastic book this is, and what a thoroughly talented writer Backman is. This book is worth the few hours you spend with it, because it will stay in your heart for a lot longer after that.", "Star": "5.0 out of 5 stars", "Title": "A book to touch your heart"}, {"Upvote": "4", "Review": "This book is a quick, easy read for a pleasant weekend.  I enjoyed reading it, and am looking forward to the Tom Hanks movie that is in the works for this book.  I felt that the author had a unique approach to his book in that he jumped back and forth across time quite a bit, telling the reader a bit about the present, and then explaining a bit about the past.  (I can’t wait to see how they adapt this to a movie...????). In this way, the reader is slowly able to understand the “backstory” of Ove, and understand why he behaves in the way he does.  As another reviewer mentioned, there is sort of an underlying current that Ove is probably somewhere on the spectrum of Autism, but the book does not specifically point this out.  However, his background probably influences the behavior to some extent, too.  The translation is very well done, and as someone else already mentioned, the humor is very well preserved across the languages.  You could almost imagine it happened in America, except that the money is in “kronor”.A few less than positive comments, although not enough to dock more than one star.  First, there is a lot of cursing in the book, although half of it is basically British cursing, and quite a lot of it adds to the humor.  It didn’t really bother me, but just keep it in mind if you have a child that wants to read it and you are particular about language.  There is no sex or anything like that.  Also, I felt that some of the characters were overly stereotypical, and some not necessarily vital to the plot.  I would say maybe a modern social issue or two were injected into the story that maybe could have been left out to avoid a controversy.  However, it was not overbearing.  I also felt like a violent event near the end of the book was a bit sudden, to the point of not really going along with the general feel of the book. Like...”Where did THAT come from???”  I almost felt like the author possibly took a break after writing 3/4 of the book and then came back to finish, because the general feel of the book, to me, changed slightly near the end, and I felt like the coherence of the story struggled at that point.Overall, however, the book was fun to read and was a neat mixture of comical and sad/serious.  It gave a good message about giving people a chance to get to know them before judging them, and also that you never know what someone has gone through in their past.I do think it will make a fantastic Tom Hanks movie.  I could almost visualize him in some of the scenes.  :-)", "Star": "4.0 out of 5 stars", "Title": "Easy, enjoyable read. Looking forward to the movie."}, {"Upvote": "5", "Review": "Fredrick Backman has written a little gem of a novel in “A Man Called Ove.”  It’s strange and quirky, complete with odd verbiage, but all that makes it even more engaging.  Ole, the protagonist, will always be a clear image in your mind because of his peculiarities.Ole wants to be left alone.  He wants to converse with and think about Sonja, his deceased wife.  He wants people to follow the rules.  He wants order and routine to guide his life.  Uninvited interruptions and improper behavior are not acceptable.  When all these parameters are suddenly violated, Ole’s life becomes, in his mind, unlivable.  He walks around in a huff even as he plans ways to do himself in.Parvaneh, a very pregnant Iranian woman, her husband, and two little girls move in next-door and Ove’s structured world collapses around him.  She’s cheeky, her husband is inept, and the little kids are annoying.  Ove doesn’t like little children anyway.  Then a mangy cat takes over his serene home life and his best friend, who is sometimes his biggest enemy, becomes deathly ill, turning his wife into an Ove slave master.  Her doesn’t like cats, either, and his friend’s wife is becoming tiresome.  None of it is good for Ove.  When will it all end, allowing Ove to join his wife, wherever she is?The author involves his reader in every Ove tribulation.  It’s highly enjoyable companionship albeit with an unwilling escort.  The writing, although unconventional as mentioned, captures the reader in its simplicity as it creates a world of complexity that creates havoc to a simple man of principle.  Ove’s mumbling is memorable, as are caustic encounters with authority.I predict that you will take this book to your heart.  You’ll probably not forget it.Schuyler T WallaceAuthor of TIN LIZARD TALES", "Star": "5.0 out of 5 stars", "Title": "OVE IS A DELIGHTFUL READ"}, {"Upvote": "4", "Review": "This was the first book I read by Fredrik Buckman and I love it so much that I am now on a mission to read all of his books.  The protagonist, Ove is not your average, well loved book character.  He is an angry, short tempered, senior citizen that has definitely not moved into the 21st century.  He has basically been a loner since his wife died, and her passing did nothing to improve his disposition.  He follows rigid rules and expects everyone else to also follow them.  However, one day a young couple moves in to the house next door and shakes Ove's world up.  The wife is very talkative and very pregnant and on their first meeting she manages to plow down Ove's mail box.The young woman always seems to somehow overlook Ove's cantankerous  moods and talk.  Despite Ove's repeated attempts to avoid these people, the woman manages to befriend him,  Well, sort of befriend him.  This story is centered around this odd friendship.  There is plenty of things both of these people will learn about themselves, as well as each other. It is a story of heartbreak, humor, and sorrow, but mostly it is a beautiful story of love kindness and friendship.  Ove might not seem to be an interesting character at first glance, but if you give him a chance, he will steal your heart.", "Star": "5.0 out of 5 stars", "Title": "How to love a bitter, angry, and antagonistic old man!"}, {"Upvote": "22", "Review": "My wife's book group read this and the reviews were mixed, as humor often is.  She didn't really care for it.  For her and some of the others, this was just a boring tale of a cranky old man, although in fairness, the people who felt this way were generally the ones who did not finish the book.  I read some of the \"look inside\" snippets and was prepared to be underwhelmed.  But others in her group loved this book, and I'm with them.  The look inside snippets just don't do it justice.  I see this as a book for hopeless romantics - a great love story.  It's just not the kind we're used to.  Ove loves in spite of all his instincts to the contrary, and finds himself a hero and helper of anyone in need, again in spite of himself, and yet also because of who he is.  He is a man who loves rules, as long as he gets to make them up, but who hates with a passion the thoughtless rules of local government bureaucrats (the white coats).  After the death of his wife - his one true love, Ove is a man who wants to end it all, in a neat a tidy way of course, but he just can't seem to get the job done.  Events and people of course conspire to keep him alive, until he finds his way back.  A big thumbs up for a truly clever and fun story, with equally fun and clever characters.", "Star": "5.0 out of 5 stars", "Title": "For Hopeless Romantics"}, {"Upvote": "2", "Review": "Ove doesn’t ask for much: He wants to be left alone, he wants everything to be in its proper place, and he wants everyone to follow the rules.  His universe is defined by his routines, and woe betide the man, woman, or child who disrupts those routines.  In Swedish writer Fredrik Backman’s charming first novel, those routines are disrupted with increasing frequency by a varied cast of men, women, and children, to the point where Ove finds that he can’t even carry out the seemingly most straightforward of his intentions.  Why won’t these people just leave him alone and let him get on with it?  Even the neighborhood’s stray cat gets into the act.We’ve probably all met an Ove at some point.  He’s a frustrated, Saab-driving, handy-with-a-toolkit curmudgeon who has suffered his share of setbacks but who also insists that the world, and the people in it, must behave in ways that any reasonable person (meaning Ove) would expect.  That’s not asking too much, is it?  Apparently it is, because the people around Ove simply refuse to fall in line.  He complains about all of this to his wife, but she’s having none of it—and not just because she’s dead.  She was always just sweeter and more tolerant by nature than he is.  This is a very enjoyable tale of one grumpy old man’s attempt to deal with a world that insists that he become part of it, for better or worse.  His encounters with the people in his neighborhood and beyond are often hilarious, and sometimes surprisingly moving.  But will they change him?  Does he need to change?  What kind of person is Ove, really?A side note: I occasionally had to remind myself that this is a translation, because it never feels like one.  The English idiom is perfect.  This is no small skill, and translator Henning Koch deserves praise.", "Star": "4.0 out of 5 stars", "Title": "Cranky, Lovable Swede"}, {"Upvote": "2", "Review": "I stumbled upon the author Fredrik Backman following a recommendation by my daughter to read, \"My Grandmother Said to Tell You She's Sorry\" and this is now his 4th book I have devoured!  I would be hard pressed to tell you which of the 4 books I enjoyed the most!The one thing I love most about this author is that he doesn't waste words over describing clothing, plants, cars, buildings, weather, etc...instead, he uses his words to develop his characters perfectly!  So much so that I have literally started each book over immediately after finishing it the first time!  True!  By the time you get to the ending of these books, you have almost developed an emotional connection to the characters...I for one, hated to get to the end of each book because I knew I was going to \"miss\" the characters so started them each over again.\"A Man Called Ove\", as with the other Backman books, touches on humanity and social \"norms\"...such as aging, illness, sexuality, suicide, death, diversity, etc.  As with his other books, Backman did NOT disappoint here!  I fell in love with the character Ove as he struggled with loss over and over and over.  You pretty much know from the beginning where the story and this particular character are headed...no surprises...but this author isn't about shockers...he writes beautifully woven tales that leave you wanting more.  I was pleased that Ove found some peace and joy in the end.PS for anyone in the bizz...this book would make for an EXCELLENT movie!", "Star": "5.0 out of 5 stars", "Title": "Loved the book!  Loved the Author!  And, LOVED Ove!"}, {"Upvote": 0, "Review": "I finished “A Man Called Ove” last night. Since then, I have been trying to determine what I would write about it. I don’t read a lot of novels. But, a classmate from West Point suggested I read it.This novel has an unusual style. We follow a grumpy old man through his life after he lost his wife. I can’t tell if I am sad for him, love him or would want him living next to me. Quite frankly, he would probably be a pain in the ass!There is little doubt that he love his wife. I can’t help but feel that his disagreement with Rune was the loss of child, not over cars. He was competitive with Rune and I think he respected him. But he could no longer be competitive, thus, he hated him, at least that is what we are led to believe. But was that really true?Clearly, we are peering into the life of a man, who had hardships not of his own making, a man without political influence but a man of integrity. I don’t think he desired attention of his neighbors but he got it. Fortunately he was as his neighbor described him, “poor at dying.”I put the book down near the 20% mark because it was so sad and I really wasn’t prepared to be depressed. But the book grows on you: I could not read this book straight through. There were times that I had to put it down. Yet, I did return to finish it.I really think there is a bit of Ove in all of us. He has certain ideals that he won’t allow to be violated. These ideals cause problems for him. Was he a good man? I would have to say yes. But he sure had a hard scrabble life.", "Star": "4.0 out of 5 stars", "Title": "A Good Man Poor at Dying"}, {"Upvote": 0, "Review": "This is one of the best books I have ever read! I loved every word, every character, the story, the amazing cat...it was (to me) literary perfection. I laughed out loud hundreds of times...the kind of laugh that I couldn't stop, that brought tears to my eyes. And speaking of tears, I cried so hard while reading the epilogue, which I read so slowly because I didn't want the book to end. I want to write to Fredrick Backman and insist he write more books about Ove's life. I loved his morning inspections. His day to day encounters with the neighbors who became family. His love of Saabs (my first car was the 900 Turbo). His literally oversized heart.I'm so gushy right now with love for this book!!! I'm never this gushy. Maybe I should have given myself 24 hours before reviewing this. I recommend this book to everyone. 1,000,000 ⭐️⭐️⭐️⭐️!!! I've read Beartown and loved it too and just ordered (and pre-ordered) all of Backman's books. Wow! Just an amazing reading experience. I don't know what to read next because I fear whatever the book, it will pale in comparison.", "Star": "5.0 out of 5 stars", "Title": "Can't Stop Gushing"}, {"Upvote": 0, "Review": "I liked the way this book presented Ove first as a stereotypical grumpy old man outliving his time and his usefulness, no friends, spending his hours grumbling about others and telling his neighbors to keep off his lawn. Then, as the story progresses, Ove  slowly becomes more human. We learn that his animosity for his neighbor who was once his best friend is based on more than what kind of car he drives, although the car brand is an unlikely indicator. Other characteristics are explained as the book goes on, finally leading to an understanding, sympathy, and respect for a person the reader had most probably disliked at the start of the novel. It brings to the reader's attention that a snapshot of a person's life is not enough to know a person. What we are now is the summation of all we have ever been.The author uses a narrator's voice rather than the typical close third person or even first person which has become so popular. The narrator is close though, able to see into the mind, mainly of Ove but also of others. The detachment lends well to the intent of creating a growing empathy toward an unlovable protagonist.The chapters are short, easy to read in a lunch break or a quite fifteen minutes or half-hour. Each chapter is self-contained, a little story or a snippet of Ove's personality development.", "Star": "5.0 out of 5 stars", "Title": "Why we are as we are"}, {"Upvote": "3", "Review": "I had seen - and loved - the movie, so I wasn't sure how the book would be. I know, books are \"always\" better than the movie, but really they're just different.  And both versions are to be treasured. A sparkling, touching, beautifully-translated story of a simple man who just wants to do things the right way, and does - it's certainly not _his_ fault if people are going to get all weepy about it, or fuss over him, that's just what some people do, but not Ove! And don't blame Ove if you don't have enough tissues around at times while reading this book - if you can't manage to have the proper supplies on hand, well, it's not surprising considering how things are these days.", "Star": "5.0 out of 5 stars", "Title": "Oh, my, I loved this book!"}, {"Upvote": "2", "Review": "I really enjoyed this quirky, unique story about a curmudgeonly man of 59 with mild OCD ticks. His cantankerous view of the world made me chuckle out loud several times. He lost his job to computers. He hates technology and longs to live in a world where people can fix their own cars and know how to repair things around the house. “He had begun more and more to differentiate between people who did what they should, and those who didn’t. People who did and people who just talked. Ove talked less and less and did more and more.”He bemoans: “An entire county standing up and applauding the fact that no one was capable of doing anything properly anymore. The unreserved celebration of mediocrity. No one could change tires. Install a dimmer switch. Lay some tiles. Plaster a while. File their own taxes. These were all forms of lost knowledge.”Without his wife or a job, he tries numerous times to commit suicide, but his plans are thwarted every time by a neighbor who needs help, sometimes against a white shirt—some bureaucrat who wants to impose their rules.Ove has battled the white shirts all his life, so when a neighbor needs help to do battle against a white shirt, he can’t help but get involved.I won’t say more to not give anything away, but between Ove and his neighbors, this book is filled with a memorably cast of characters. Recommended.", "Star": "5.0 out of 5 stars", "Title": "A fun, unique, quirky story that pulls heart strings"}, {"Upvote": "5", "Review": "I did not care for the author's style of writing in 3rd person, \"a man called Ove\" did this or did that. Got very old reading a man called Ove over & over at the beginning of every chaptrr & many sentences. Author's ananolgies were so off base & could not be related to the actual situation that happening. Only reason I'm even giving two stars is because the VERY END was emotional & sweet. I struggled getting through this book!!!", "Star": "2.0 out of 5 stars", "Title": "Struggled To Finish It"}, {"Upvote": "2", "Review": "This review originally appeared on my book blog, herestohappyendings.comWhen I first stumbled across this book, it was by accident.  I was looking at Amazon Kindle books, to find something new to read, and I saw this listed as a daily deal for only $1.99, so I decided to give it a go.  Everyone seemed to have good things to say about this book, so I figured it might end up being a really good read, and if not, well it was cheap, so it wouldn’t be a big deal.Wow, was I really blown away by this novel.  It’s a heartwarming story about a man named Ove (and while he’s not really that old in the book, for some reason I always pictured him being much older), who is incredibly grumpy and doesn’t want to be bothered with anything or anyone.  Ove’s wife had passed away, and now that he is alone, he really doesn’t know what to do with himself.  He spends time doing his usual checks of the neighborhood, the recycling, and parking situations.  When he gets laid off from his job, he finds himself landed with more free time, in which he thinks about his wife, and gets incredibly depressed to the point that he doesn’t want to live without her any longer.  So, he does the only thing that he thinks will solve this dilemma – he plans to take his own life.  However, the doorbell rings, and Ove’s adventures with the neighbors truly begin.  They bring him cookies.  They need his help with their children.  They ask for driving lessons.  They interrupt his quiet, lonely life, and at first, Ove hates it.  He wants to be left alone to miss his wife in peace, but after a while, Ove discovers that they aren’t the only ones who need someone…but deep down, maybe Ove needs them, too.This book is absolutely hilarious in some places, and in others it tends to be heartbreaking and meaningful.  It made me appreciate life and those that are in it, and it has a message that has stayed with me months after reading it.  At any cost, this has been one of the best books I’ve read, and I cannot recommend it enough to those who haven’t had the delightful experience of picking this one up yet.", "Star": "5.0 out of 5 stars", "Title": "A Beautiful, Heartwarming Story"}, {"Upvote": 0, "Review": "My book club read and discussed this book recently, and I'm bound to say it was the best discussion we've EVER had!  Usually we talk about our book for half an hour and then start chatting about this and that, breaking into smaller groups, etc.  This time we talked about THE BOOK for nearly an hour, and useful and interesting things were said.  It's kind of an ordinary, regular book, not artsy or literary, but it became an unexpected worldwide best seller, and everybody in our group seemed to enjoy it and planned to try other books by the author.  We weren't sure why it seems to special.I disliked the main character (and the book) a lot for the first 25 pages or so, and then it worked its charm on me and I found the story amusing and touching.  So if the beginning hits you that way, push through it.", "Star": "5.0 out of 5 stars", "Title": "Easy and gratifying read."}, {"Upvote": 0, "Review": "The constant humor got me through the story (it was really quite depressing), which I thought was carefully crafted and balanced by the author.I loved Ove. He is unabashedly un-politically correct and somewhat terrifying, but somehow the author feeds the reader enough of Ove's good qualities at just the right times for him to be loveable. I love how the character grows without really changing his personality.Parents should know: This book is squeaky clean (save for scattered curse words and one f-bomb on page 216). *SPOILER*: However, I think this should be given to teens with caution because the topic of suicide is a main focus of the story and a character makes detailed plans about how to commit suicide. While i think there is a sweet, subtle, uplifting message about being loved and finding purpose, I'm not sure it's said clearly enough to get the message across to a teenager struggling with depression", "Star": "4.0 out of 5 stars", "Title": "Better Off Dead meets Gran Torino"}, {"Upvote": "2", "Review": "It took me a bit to get into this book because of the characters.  But once I got into it, I just had to finish it to see how it would end.  I've had several friends who raved about this book. Can't say I'd do that, but I did enjoy that this book was different from many.  I think I'd like to read more by this author. It takes place in Sweden about an elderly man who lost his wife and his attempts to join her because he misses her so much.  The characters in his neighborhood keep interrupting him and he's pretty cranky about it all.  He is a person who sees things pretty black and white and has all his life - though his wife was not.  I laughed in places and felt compassion for the characters in this story.  I'm glad I read it.", "Star": "3.0 out of 5 stars", "Title": "A different read"}], "Star": "4.6 out of 5 stars", "Name": "A Man Called Ove: A Novel", "Format": "Format: Paperback", "Price": "$13.17", "Author": "Fredrik Backman"},
{"Comment": [{"Upvote": "14", "Review": "I loved this book on several levels: 1. Great setting, something different from the standard. Western Michigan on the lake. 2. Fantastic characterization. By the end of the book, I was in love with the characters and would have wanted to live with all of them as well. I don't know if they were based on real people, but the author really did a good job of creating characters that leave an impression. 3. Writing humor is very, very difficult, and Brogan's humor was refreshing and truly funny. I re-read some of the more clever lines in hopes of remembering them, and that's saying something for all the reading and writing I do. 4. A strong plot supported by interesting subplots that made sense and moved the story along. It wasn't face-paced nor did it drag. The momentum was consistent and everything came together in the end.I had the advantage of reading this book after one that tried to be funny but wasn't. There is a distinct difference. I loved this author's writing style and see her as a true talent. Highly recommend!", "Star": "5.0 out of 5 stars", "Title": "Truly funny and fun book"}, {"Upvote": "110", "Review": "Sadie, late 20's, divorced mother of two young kids, decides to spend the summer by Lake Michigan with her kooky aunt and assorted grown-up male cousins. There she meets Des, 36yo Scottish doctor, and an offbeat courtship/relationship ensues.This was a pretty quick read. Although it wanted to be really funny, it came off more as ridiculous in my opinion. I've read other romances where I actually laughed out loud (some books by Sophie Kinsella, for one) but this was not really one of them. However, it was still an enjoyable read--Des was totally HOT and a nice guy without being a wuss or a control freak--best case scenario.Sadie JUST skirted the edge of being one of those heroines who says, \"I don't know why he would like me, I'm such a mess\" and you find yourself agreeing with her. She pulled back just enough between the ridiculous acts of craziness that I wasn't totally annoyed with her. Although, strangely, I never really got a sense of what she looked like. Brown hair and eyes, and she denigrated herself at every turn. But others said she was beautiful, even her ex and he was a total narcissist who would probably never be caught dead with anyone rating less than a 9. She said she had worked out like crazy to try to \"help her marriage\" before the divorce so her body was great, but a few pages later, she'd be saying how she had to stand up straight and suck in her gut when Des was near. She just never came into focus.There's a bit of sex in the book but none of it is graphic or even detailed. Even so it didn't bother me. I would have liked to have seen more of Sadie and Des as a couple among other people. It seemed like almost every time they were together and happy, it was in private. Any other time they were shown in public something ridiculous happened. Ridiculous was a running theme in this book. When they went sailing with Des's friends, it was the only time they were out among others that some kind of zaniness didn't occur. Truthfully, I spent the whole chapter waiting for her to fall in the water or something.In any event, the reason I decided to write this review is because if I had known before reading what I found out on THE LAST PAGE I would not have bought the book:SPOILERS*********************************There seem to be whole chapters missing in the end. Sadie never has any kind of real understanding or communication with her mother. It was like her mother was just a one-dimensional prop to show Sadie what she could turn into, without explaining why or how she got there. At one point, Sadie's aunt sums the mother up in one line--someone must have disappointed her at some point and it made her not trust anyone. Could she be any more vague??We don't find out if Sadie's aunt will be okay. Although, that vagueness didn't bother me as much as the first.BUT, the biggest problem for me, was the fact that AT NO TIME, not even when Des comes back and tells Sadie he needs her and she makes him \"flustered\" does he EVER say, he loves her. And she doesn't either. As a matter of fact, Sadie says a couple of times that she isn't in love with him, or she might be falling for him. The only time she actually says she loves Des, is when she's lying to her ex.I was so floored. It was bad enough the author waits until the last 2 friggin' pages to get them back together. But then to not even reach the finish line (in these books, the L word is the finish line IMO), was completely disappointing. I was so annoyed, I reread the last few pages to make sure I hadn't missed it. But--no! He never says he loves her.END SPOILERS******So there you have it--ridiculous zaniness with some amusing side characters and a hot leading man but, in the end, unsatisfying--for me, at least.", "Star": "3.0 out of 5 stars", "Title": "Would have been a four except for one, BIG problem"}, {"Upvote": "19", "Review": "My summer reading goals include some historical fiction titles and literary classics, so I like to add some light mysteries and pool reads to the list. This book had some laugh-out-loud moments but was Lifetime-Movie predictable from beginning to end. I felt the biggest distraction was the author's display of her political preferences and attempted humor directed at religion that more than hinted at disrespect.If the context had remained the same, but words changed to a race or another religious belief - I'm sure the author would not have utilized that to attempt humor.If you're into light reading - get a rock to anchor the book to your table.There are plenty of fun reads out there. I won't be seeking out this author again.", "Star": "1.0 out of 5 stars", "Title": "Junk food....."}, {"Upvote": "4", "Review": "I have to say that anyone who would give this book only one star has absolutely no sense of humor!  You poor things.As a constant reader nearly my entire life, I found this to be one of the funniest books I've ever read, which is saying a lot.  I've lost track of how many times I've laughed out loud.  I love this book and I'm only a little over a fourth of the way through it, and can barely put it down.  I've never read Tracy Brogan before, but I had downloaded three of her books, thank goodness, all Bell Harbor novels.  I got them for a bargain price of $1.99 each.  I only wish she'd already written a bunch of books rather than just a handful so far.If the other two books I downloaded are anywhere near as enjoyable as this one, I am looking forward to a lot more from Tracy Brogan.Now back to the hilarious Sadie, her funny Aunt Dody, and that adorable Des, not to mention those \"carbuncles\" on the bottoms of ships.  Oh, and right after I sent in this review and went back to the book, I read that Sadie's daughter loved to read, \" a product of being named Paige Turner.\"  Another laugh out loud moment.  Thank goodness we can edit our reviews!", "Star": "5.0 out of 5 stars", "Title": "Hilarious!"}, {"Upvote": "3", "Review": "The story was a predictable light romance and an easy read. I read it while on vacation and although the overall story was OK, there was too much emphasis on the character's episodes of self doubt and insecurity. I get that she was treated badly by her first husband and had self doubts, but this aspect of the story was overdone. After the first couple of self doubt episodes I skimmed over them to get to the real story and this made it a very quick read. Although larger than life and very eccentric, some of the supporting characters were fun. The author is good at writing dialogue but their stories would be better if there was more depth. I probably wouldn't buy this author's books again unless I read a review which told me their work had evolved a bit more.One comment; the author obviously doesn't know much about cats and dogs. The descriptions of the animals in the story lend me to feel they have little experience with animals and don't care to. My suggestion for future books is they leave animals out of the story. Animals have as much character and in some cases more and better character than some people, but as with people, you have to take the time to get to know them. They like people, develop from the treatment they receive from others and in the case of domestic cats and dogs; the way people treat them is directly proportional to how they behave.", "Star": "3.0 out of 5 stars", "Title": "A very light read with a couple of fun characters"}, {"Upvote": "8", "Review": "Sadie Turner had the house, the two kids, and the successful husband. Unfortunately, her husband liked to have other women. That's how Sadie finds herself divorced and floating through life, not sure what she wants to be when she grows up. Which isn't good considering she's well past the age of grown-upness.While considering her options, Sadie decides to spend the summer at eccentric Aunt Dody's place on the lake where she comes across a neighbor practically sent by the gods to be the perfect summer fling. The perfect man (doctor, HAWT, Scottish, straight) to bring Sadie's self-esteem back to recognizable levels.Unfortunately, two cousins, two slobbering dogs, two kids, one over-the-top aunt, one louse of an ex-husband, and a basket case of insecurities throw all kinds of kinks into the works. This book is about a woman overcoming the crap hand life has dealt her, finding the good in herself and others, and finding love along the way.Best of all, this book will make you laugh out loud. Not the LOL! thing we all put in our emails that really means a chuckle. Literally. Laugh. Out. Loud. This book should get an award for the best use of sarcasm ever. The heroine is flawed but trying. Definitely relatable. The hero is dreamy but human, and there is this one part that will absolutely break your heart.I HIGHLY recommend this book.", "Star": "5.0 out of 5 stars", "Title": "her husband liked to have other women"}, {"Upvote": "3", "Review": "I actually laughed out loud several times during reading this book.  This was a easy to read, funny story about a newly divorced mother of two young children who decided to accept the invitation of her eccentric aunt who lives by a lovely lake in a small town that caters to summertime tourists.  She thinks this will give her a chance to hide away and lick her wounds while she figures out what she is.going to do with her life .  Because she had discovered her husband had been cheating on her, she has determined that she will never put herself in the position of being so hurt ever again. So she has sworn off men.  Tracy Brogan is a very funny author and she does a good job.  It is a girly story, but only because the ladies' can easily relate while the guys probably can't..It is a definitely a delightful way to spend a rainy afternoon..", "Star": "4.0 out of 5 stars", "Title": "A chuckle on every page."}, {"Upvote": "3", "Review": "The book started out good, funny, a character you could relate to. But then the funny elements just kept on and on and became trivial. The characters stayed superficial and the male hunk didn't have any character to him at all.  Sadie, our female protagonist, has no common sense and is constantly surrounded by annoying drama.The major flaw of this book is it lacks depth. Both in character development and how the relationships between characters are described. Without depth it quickly becomes trivial and irrelevant.", "Star": "2.0 out of 5 stars", "Title": "Lacking"}, {"Upvote": "2", "Review": "Winning romance writer awards and hitting bestseller lists is impressive. So is the fact that this novel has received more than 2,400 customer reviews on Amazon. That is Stephen King- and Dan Brown-like numbers. Brogan, a new author, has developed a huge following in short order.In Crazy Little Thing, we meet Sadie Turner recently burned by a cheating husband. Stung, short on confidence, and lacking a plan, she visits her quirky aunt Dody's pink clapboard lake house in Bell Harbor, Michigan. This is a place where no one knocked before entering or locked their doors. Sadie is drawn by the nostalgia and comfort, \"The scent of hot sand tinged with tanning oil and lilacs reminded me of carefree summers, back before I cared about damaging UV rays and toxins in the lake.\"Her plan is to escape men but that is not to be for both romantic and humorous reasons. Suffice it to say there is some dating with a \"dreamy\" doctor and more than a few absurd mix-ups reminiscent of an episode of Three's Company. Brogan employs an overriding metaphor throughout relating to cleaning up clutter. As such, she provides Sadie with a new and convenient career that allows her to create order from life's frequent chaos.The supporting characters are there to help Sadie too including a psychic advisor who says, \" We can't control events in our life, Sadie. Sometimes we can't even control our reactions. But the harder we fight against the waves, the more exhausted we become. Control is an illusion, you know.\" On the lighter side Aunt Dody is described as \"a tsunami in fuzzy slippers\". Dody is full of eccentric musings like wishing her husband had fixed the screen door before he died years earlier.It is definitely a light beach read. And while the dialogue is too clever by half and the ending a bit too clean, it will add to a sunny afternoon or pass a rainy day more pleasantly. I am reviewing books set at beaches and lakes for a cottage community paper in Canada and so far there is a theme as each has mentioned the joys of gin and tonic.", "Star": "3.0 out of 5 stars", "Title": "Read with a G&T"}, {"Upvote": 0, "Review": "I'd love to give this book five stars as I did 'Jingle Bell Harbor '. The book sputtered at first as if the author couldn't quite find her footing which was odd. I felt as if it didn't come to life til around chapter three. So don't give up on it. The characters were great and I enjoyed hanging out with them throughout the book. The story could have moved a little faster and been a little shorter but I will still read the two following books. I really like this author. Her characters are realistic and I loved the town. Thanks for the 'vacation'!", "Star": "4.0 out of 5 stars", "Title": "Mini Michigan vacation."}, {"Upvote": 0, "Review": "God, why did I actually wait so long before reading this book? This was on my Kindle for months now, and I only just read it now. It is, indeed, as the first reviewer described it, the kind of book that makes you feel comfy, warm and fuzzy after a cold day!Anyways, it is a charming read and basically the story is about a newly divorced ladie in her thirties (Sadie), who is taking some time out with her 2 kids and thus moving to her crazy aunt's house in Bell Harbor over the summer. Aunt Dody is totally crazy and messy, and drives Sadie (who is a neat-freak) totally nuts. Sadie teams up with her gay cousin Fontaine to get over the divorce and one day, while drinking coffee on their backporch, both of them notice an overly sexy jogger passing by the beach - and that guy is going to become the center of everyone's attention and matchmaking intentions.Well well, it took me a lot of time to finish this book because I had to laugh out loud at almost every page. This book is ab-so-effing-lutely hilarious - it is full of humour, sarcasm and misunderstandings. It's exactly the kind of book that should be turned into a movie...The end was \"okay\", because it leaves you longing for more, but I understand that there is another Bell Harbor book due to be released. I will be watching its release date slowly, believe me.Oh and this one belongs into my Book Of The Year 2013 selection - definitely.", "Star": "5.0 out of 5 stars", "Title": "5 out of 5 Stars"}, {"Upvote": "2", "Review": "With the witty characters in this book, you really cannot go wrong with purchasing a copy.  I will say this, though.....Every woman seeking the right push to moving forward in life needs a Fontaine of their own!  He was a stitch to read!!  I won't tell you why, but I will tell you that he is the sunshine on a rainy day!!Of course, who could complain when there is an attractive Scottish doctor as the hero that has a way about him.  Really, the heroine of the book, Sadie, did not have a fighting chance to not fall for this guy,  Heck, I would fall for him in a heartbeat.As for Sadie's ex-husband?  I did not like him all that much and he was definitely portrayed as the slimeball that he was.  Aunt Dodie?  She was the quirky character that can make your eyes roll and laugh at the same time.  Really, I could go on with the other characters, but why spoil your chance to read something enjoyable?Cute, funny, witty, and not overly filled with forced sizzle between the sheets is what this book offers.  Well, also a reasonable amount of thought about family, love, and taking chances.  This is something I will read again.  The humor might seem a little slapstick to some readers, but it is definitely a fresh breath of air to read a light story that does not weigh you down.  I look forward to more from this author.", "Star": "5.0 out of 5 stars", "Title": "Best humor in a contemporary romance novel....."}, {"Upvote": 0, "Review": "Upon starting this book, I really wondered if I was going to like it as it seemed more about healing.  At least at the beginning of the book.  But Ms. Brogan was merely laying a solid foundation.  I'm so glad I persevered as this story was unlike any romance I've read before.  Most romance novels deal with two people meeting/connecting, falling in love...hawt intimacy then breaking up, and after working out their issues, getting back together...usually.  But I especially liked this story as it dealt a lot with moving on after a divorce...healing from that stressful situation and how this main character, Sadie Turner, simply \"deals\".  And this story was so much more...it was about the journey and the arrival.POSSIBLE SPOILER:After a stressful and ugly divorce from her philandering husband, Sadie Turner heads to her Aunt Dody's home in Bell Harbor, Michigan, with her two children, for a much needed summer vacation.  She simply needs time to vedge and heal.  Sadie is insecure and vulnerable as she comes to terms with the wasted years she devoted to an uncaring man.  She has a poor self image and an even poorer outlook on life in general.  Her ex and his oppressive treatment of her for eight years makes Sadie second guess just about everything...but most importantly, ever committing to another relationship...ever.  Until she get's to know Dr. Desmond (Des) McKnight.Des is everything opposite of what Sadie has been accustomed to.  He's cordial and polite...he's kind, patient, sincere and caring.  When he shows more than a casual interest in Sadie, she finds it hard to believe (she does, afterall, have trust issues).  I loved Des.  He's the epitome of the perfect, non-arrogant alpha male.  A major \"rawr\".. yowza factor.This story was such fun to read...at times it had me laughing so hard I had tears streaming down my cheeks and my hubby going \"what?  what??\"...(and I'd have to stop and explain)...I loved Aunt Dody...a loving free spirit and Fontaine who's antic's and vernacular wit had me rolling in the aisles.If there was a downside to this book (for me) it would be that character descriptions sort of \"trickle\" in as you read the book.  The Author doesn't stop and devote a paragraph or three in just describing a person...descriptions filter in through dialogue and narrative...which isn't a bad thing...but can be distracting when you're trying to get into the plot.  I was often distracted, wondering what color eyes, or hair, or size, or height so-n-so had/was when I could've been concentrating more on what was happening at the moment.  But it all comes in time.  :)Still all in all this was a delightfully delicious, and often hilarious story.  No holes or loose threads...it never unravels or disintigrates.  Strong emotional dimension that the reader will easily connect with and become emotionally invested with in little time.  Deep tacit messages of healing, starting over...the journey and the arrival of finding that one special person in your life.  A fabulous story of getting your priorities straight and realizing what really.....reallllly...matters in life.", "Star": "4.0 out of 5 stars", "Title": "Realistic and hilarious romance.."}], "Star": "4.3 out of 5 stars", "Name": "Crazy Little Thing (A Bell Harbor Novel)", "Format": "Format: Paperback", "Price": "$9.99", "Author": "Tracy Brogan"},
{"Comment": [], "Star": "0.0 out of 5 stars", "Name": "Percy Jackson and the Olympians The Battle of the Labyrinth: The Graphic Novel (Percy Jackson & the Olympians)", "Format": "Format: Hardcover", "Price": "$14.71", "Author": "Rick Riordan"},
{"Comment": [{"Upvote": "13", "Review": "After reading this volume, it makes you question whether Ainz is actually the protagonist of this series until now or someone villainous like him who has been pulling the strings. Similarly to Volume 4, Volume 7 has basically also portray the protagonist as the main villain this time around, but the events unfolding here is more brutal and gruesome in comparison. The fact that I had to invest myself into reading it from the viewpoint of characters outside Nazarick solidifies that Ainz is becoming more evil as he can get. His minions or NPCs are acting exactly the same way as him since he permitted them to do unspeakable, horrific things to these characters. If anything, Volume 7 as a whole got me to reevaluate Ainz differently than your average protagonist in other Isekai series.", "Star": "5.0 out of 5 stars", "Title": "After reading this volume, it makes you question whether ..."}, {"Upvote": "15", "Review": "This is by far the darkest book yet in the series, this volume follows a group of people who for one reason or another aren't registered with the adventurers guild,Instead these people are called workers and the jobs adventurers don't or can't take are how they make a living. They get hired to survey a newly discovered ruin and well, it ends up being the Great Tomb of Nazarick. This was a story where at some points I had to just put the book down for a moment and picture the events in my head and would end up shuddering.we learn quite a bit more about the empire and a little bit about the slane theocracy, and we finally get to meet the Prince of Fear... If you've read the books up to this point and enjoys them then you'll probably enjoy this one too, even if it leaves a bit of a sour taste in your mouth. I'll definitely be picking up the next volume.", "Star": "5.0 out of 5 stars", "Title": "Darkest entry yet..."}, {"Upvote": "6", "Review": "Another nice addition to the series. One of the reasons Overlord is so fun is because the author isn't afraid to shift to multiple point of views of different characters in the overall story line. It makes the story and its world feel more alive. In that sense, the perspectives shown and the some of the actions committed in this book are the darkest yet. It may, like it did a bit with me, at times feel exaggerated or forced (I only mean about the main character here). Don't get me wrong, I am a sucker to dark fantasies, and its not anywhere enough to ruin my enjoyment as like I said, I think it was more of a exaggeration rather than a plot hole or a mistake. Anyhow, I expect things to further escalate as Nazarack develops and becomes more influential to the world, and can't wait to see what happens next. My only wish is that the books get translated a bit quicker, but I guess you have to live with what you got.", "Star": "5.0 out of 5 stars", "Title": "Can't Wait For The Next Book"}, {"Upvote": "4", "Review": "Thank you so much for creating a story with a protagonist who is not the \"faint when a hot girl talks to you type\"! Finally a \"good guy\" who isn't afraid to get his hands dirty...or bloody. Please keep this series going!!!", "Star": "5.0 out of 5 stars", "Title": "Dark and enticing"}, {"Upvote": "2", "Review": "Love this LN series and the anime, managed to read this one before the S3 premiere that covers this", "Star": "5.0 out of 5 stars", "Title": "Thumbs Up"}, {"Upvote": "2", "Review": "Love the Overlord series and the light novel is always such a delight to read.", "Star": "5.0 out of 5 stars", "Title": "Five Stars"}, {"Upvote": "2", "Review": "I gave it a 5 star rating because it fulfilled my desires of knowing what is happening next along with more characters.", "Star": "5.0 out of 5 stars", "Title": "Definitely a great series"}, {"Upvote": "2", "Review": "I feel like just started reading... And suddenly 'boom!' i'm out of pages... I feel cheated. I need more. I shall haunt your dreams if you don't release book 8 soon~", "Star": "5.0 out of 5 stars", "Title": "Too short!"}, {"Upvote": 0, "Review": "Great little read, oh boy did that get violent. Might be expensive for a 2-3 hour read, but it is the only light novel I will purchase.", "Star": "5.0 out of 5 stars", "Title": "Good read"}, {"Upvote": "2", "Review": "Really do I need to say anymore if you are here then you know why not to hear me talk about it but to buy it for we all serve the Overlord", "Star": "5.0 out of 5 stars", "Title": "All hail the overlord"}], "Star": "4.7 out of 5 stars", "Name": "Overlord, Vol. 7 (light novel): The Invaders of the Great Tomb", "Format": "Format: Hardcover", "Price": "$13.59", "Author": "Kugane Maruyama"},
{"Comment": [{"Upvote": "19", "Review": "Madeliene L'Engle's \"Wrinkle in Time\" was one of the few young adult books that I actually read when I was a young adult.  I loved it then and have read it repeatedly in the past 40 years. My current passion for graphic novels and adaptations led me to this version by Hope Larson.Unlike some graphic novel adaptations, Larson had to abridge this story to some extent.  The other issue I had with this book was that the characters did not appear as I had envisioned them.  But the former was a necessity and the latter was a matter of personal interpretation, and neither detracted from the quality of this book.The adaptation follows the story of Meg and company closely.  Larson chose a difficult book to illustrate.  Characters such as Aunt Beast and IT might be better left to the imagination.  While the art is good, I would have liked it to have used as much color as the cover.My original intention was to reread L'Engle's version before I read this adaptation, but graphic novels draw me into them and don't let go until I have made it to the last page.  It has been at least 10 years since I last read \"Wrinkle,\" and it may be best that I didn't read it right before this book; I didn't make direct comparisons of descriptions and dialog, and that probably made this graphic novel more enjoyable.Looking at Hope Larson's work, I see that she collaborates on original stories and has others illustrate them. Even though I don't see myself reading Larson again, I would recommend her work to children or young adults.  Like \"Wrinkle\" her other works seem to include the important questions that good juvenile and young adult literature should ask.---------A note about reading this on Kindle:  This is the third graphic novel I have read in an electronic format.  One book was a Kindle enhanced version of \"Trillium,\" which had an option that allowed for swiping from frame to frame instead of page to page.  There was not enough opportunity to zooming in on the frames to make the reading easier.  In addition, the material was presented one page at a time instead of in a full-spread format to see opposing pages at one time.  This prohibiting seeing splash art as it was created by the artists.There was an improvement in \"Will 'o the Wisp,\" published in Adobe Digital Editions format.  There was an opportunity to zoom in as much as desired, but I found bouncing back and forth between full-page mode to see the art and zoom mode to be able to read the words was somewhat cumbersome.However, I would have loved to have had either zoom option with \"Wrinkle.\"  This Kindle book version did not let me zoom in on any of the individual frames, and so I actually had difficulty reading the text at all.  If I hadn't already had much of the story and dialog memorized from frequent reading of the L'Engle's book, I would not have been able to read it, and would have asked for my money back.I will hesitate reading other comic books and graphic novels in electronic format in the future, unless I know that I will have the ability to read the text in addition to seeing the art in double-page format as intended by the authors and artists.", "Star": "4.0 out of 5 stars", "Title": "I loved it then and have read it repeatedly in the ..."}, {"Upvote": "13", "Review": "<3 💗Absolutely LOVE it❣️❣️❣️ We have a 7, 9, 11, & 15 year old all reading it with us and THEY ALL LOVE IT❣️ Wish I would’ve bought this sooner‼️This book is not word for word. The editing is concise, very fluid and more up to date in many ways, making it much easier for younger readers to comprehend.  If you are having a young reader use this as a companion to an audio book it will not work out and they will easily become lost!💰 💵 Paid full price. Not compensated in any way to leave this review. I believe in Amazon’s HONEST, unbiased community reviews to make many of my purchasing decisions which is why I contribute whenever I can by lending my own perspective in leaving a review of my experience with the different products I purchase.", "Star": "5.0 out of 5 stars", "Title": "👍🏽👍🏽AWESOME❣️⭐️⭐️⭐️⭐️⭐️"}, {"Upvote": "7", "Review": "I am so excited to use this book with my special education class.  I am actually going to read the full novel while projecting the graphic novel on the Promethean board so the students can have a visual support.  We will also compare and contrast the novel, graphic novel, and new movie.  I also had the school order several paperbacks so the students have a book in their hands.  I haven't done this before but have high hopes.  I decided to do it this way because the text in the graphic novel assumes background knowledge that my students may not have.  Also, there is a subtle difference between in drawing style and color between actual action and Meg's internal dialog.  I have lost the thread a few times myself and am carefully making notes so I can explain what's happening to my students.", "Star": "5.0 out of 5 stars", "Title": "Pair with full novel for classroom use"}, {"Upvote": "20", "Review": "An excellent graphic version of the classic novel. I wish it was more colorful, but it is beautifully drawn. It is an exciting adventure of three kids traveling through time and space, explaining the science along the way, with the help of three magical old ladies to rescue a missing man. If only SOME CHARACTERS could manage that...", "Star": "5.0 out of 5 stars", "Title": "Wibbly Wobbly Timey Wimey Spacey Wacey Humany Wumany"}, {"Upvote": "5", "Review": "Bought this as a gift for an 9-year old girl. I wanted to buy her a book that would nurture her budding scientific mind, but was afraid the print version would be too difficult for her at a young age -- though I really wasn't sure, I just remembered reading it as a pre-teen. I played it safe and got her the graphic novel in the hopes it would turn her to the print version as she got older. She loved this book. Her father, who was a fan of the original, also sincerely loved this graphic novel. It ended up being a great gift.", "Star": "5.0 out of 5 stars", "Title": "Great Adaptation (so I hear at least)"}, {"Upvote": "9", "Review": "I originally read the novel several decades ago, and consider it one of a handful of books I read when young that shaped who I became as an adult reader. When I was assigned this graphic adaptation as part of a graduate class on adolescent literature, I approached it with a great deal of trepidation - just the idea of a graphic novelization of such a loved novel from my past disturbed me greatly. So I was pleasantly suprised to find this adaption to be extraordinarily faithful to the source material. It is obvious to me that the artist held as much appreciation for the novel as I did, and that appreciation shows in every panel, as well as in the overall presentation of the material. Well done! And a big thanks to Hope Larson for showing such love and respect to Ms. L'Engle's original words.", "Star": "5.0 out of 5 stars", "Title": "Well Done!"}, {"Upvote": "9", "Review": "I've been a big reader since I was very young.  As a small girl, I would voraciously read more or less anything that was placed in front of me, from cereal boxes to a well-loved dictionary.  My grandparents loved introducing me to books that my mom loved as a kid, and one of my favorites was A Wrinkle in Time.I don't think I need to explain the story, but it is one of the best gifts a clever, perhaps slightly strange kid can receive.  The book stresses the importance of valuing yourself, both your faults and your strengths.  It reminds us that the ways we differ are just as important as the ways we are the same.  Perhaps most important for me, it tells us that home is what (and who) we make it.  It's just a gorgeous story, and one that other, far more concise folk have summed up.This adaptation, by the wonderful Hope Larson, is simply fantastic.  Much of the language is very much the same as in the original L'Engle, so it has very much the same feel.  I'm re-reading the original now, and the first few chapters are more or less the same in tone and feel.With regards to the art, I am totally charmed!  I love how Larson indicates color and movement.  A personal favorite is when Meg mentions Calvin's eyes being blue.  The whole book is blue, but when I looked at Calvin in that panel, they looked brighter.  It was beautiful.  Overall, I feel the art was exceptionally faithful to how I imagined the beautiful and fearsome aspects of the book.  Like others, I found IT to be particularly enjoyable.  I also want to stress how much I loved Mrs. Who in this version.  She never resonated with me the way Whatsit did as a child, but as an adult, I've found Who to be more my speed.  After all, communicating with the words of others -- It truly is easier sometimes, is it not?Perhaps I would not love this version as much were I not a lifelong fan of the book.  I can certainly understand that, and I do suggest reading the novel itself first if you have not before and are an adult.  For children though, this is a lovely introduction to a lovely author.", "Star": "5.0 out of 5 stars", "Title": "Faithful and Gorgeous Adaptation"}, {"Upvote": "4", "Review": "Beautifully illustrated book! This graphic novel version accurately follows the original book. I bough several copies for students who are English Language Learners in my class, and this has greatly helped boost their comprehension when we read \"A Wrinkle in Time.\" These books are also printed on high quality paper.", "Star": "5.0 out of 5 stars", "Title": "Beautifully illustrated book"}, {"Upvote": "2", "Review": "This is a graphic novel version of Madeleine L'Engle's A Wrinkle in Time that was well done. It kept the most important parts of the plot and added nicely done illustrations. The palette of blue, black and white matched the mood of the story very well.While it is missing the rich detail of the novel, this provides a good introduction for new readers of the book and a nice refresher for those of us very familiar with the original.", "Star": "5.0 out of 5 stars", "Title": "A Wrinkle in Time Gone Graphic"}, {"Upvote": "2", "Review": "My 11 years old loved it. She said the graphics were very good and that the writer managed to put in all the important details of the story, even though he had to make it shorter because it's a graphic novel (she read the actual book and the graphic novel version). She said it was a great purchase and she enjoyed it a lot.", "Star": "5.0 out of 5 stars", "Title": "My 11 years old loved it"}], "Star": "4.5 out of 5 stars", "Name": "A Wrinkle in Time: The Graphic Novel", "Format": "Format: Hardcover", "Price": "$13.99", "Author": "Madeleine L'Engle"},
{"Comment": [{"Upvote": "1", "Review": "I very much enjoyed Kristin Hannah character development and story. This book is written better than many books about WWII. The reader experiences the struggles and fear of those living in a Nazi occupied country. I am very, very troubled however. When I read about Isabelle organizing an escape route for airmen whose planes were shot down in France and then escorting them safely to Spain with the assistance of reluctant Basque, I had to stop because I clearly remembered reading this before. I vaguely also remember a black white movie or documentary about this. I searched and found the once read story of the Belgium, Andree de Jongh who actually did what the fictional character Isabelle did in the novel. Much, much, much of the book parallels de Jongh's true story - the description of the heroine; the number of people (118 by de Jongh and 117 by Isabelle) escorted through this escape route: this escape route having a code name (Nightingale in the book and Comet in real life); the description of the airmen's instructions on the train and staying behind the heroine when they walked in German occupied cities; de Jongh's/Isabelle father executed by firing squad; the reaction of the airmen to this female who was going to be the one who to lead them out of France; de Jongh's/Isabelle's invisibility to the Germans because she was \"just\" a woman: collaborating with the British to fund the escape of airmen from France; de Jongh's/Isabelle's capture in the Pyrenees by the Nazi's then interrogation and Nazi's disbelief and rejection of the idea that a woman was capable of doing this; and de Jongh's/Isabelle's imprisonment in Ravensbruck women's concentration camp. Why am I troubled? I searched the book, several interviews with the author and Ms. Hannah website and there was no mention of specific name \"Andree de Jongh.\" Hannah acknowledged on her website that her search led her to \"a story of a young Belgian woman who created an escape route out of Nazi occupied France.\" I strongly believe that the author should have dedicated, credited or acknowledge the name of Andree de Jongh in the book where it was easily visible to the reader. de Jongh is as invisible to the author as she was to the Germans and in a book that celebrated the bravery of women during war. Was Vianne's character based on a brave woman who also deserved bold recognition? This makes me sad.", "Star": "3.0 out of 5 stars", "Title": "The reader needs to know one of the book's main character's clearly details the real life heroics of Andree de Jongh"}, {"Upvote": "149", "Review": "Almost 36,000 reviews and 86 percent are five stars. What's THAT about, I thought. So I read the book, and now I know what the raves are all about. This book is one of the best, if not the best book I have ever read. Hannah writes like an angel. The book isn't a fast read, at least not for me, because I would go back and reread a sentence just to enjoy the mastery with which it was written. Hannah's style doesn't try to be high literature, but the result is. She writes beautiful scenery and background, but not so much as many authors do. Her characters, well, I felt like I knew them, like old friends, not without flaws, but perfectly developed.So I add my five-star review to the others. Read this book. It will take you away from whatever you're doing. This was my first book from Kristin Hannah. It won't be my last", "Star": "5.0 out of 5 stars", "Title": "A Perfectly Told Story by a Gifted Writer"}, {"Upvote": "196", "Review": "The Nightingale opens with this amazing first line:“If I have learned anything in this long life of mine, it is this: In love we find out who we want to be; in war we find out who we are.” - pg 1This story is about what it’s like to be a woman during war. The author says on her website that “In war, women’s stories are all too often forgotten or overlooked.” I had never thought about how true that really was until I read this book. Vianne and Isabelle are two sisters that we follow through World War II. One stays home and takes care of her kids and one helps in the war effort. Their story showed me that this statement is not true:“And it’s a fact that women are useless in war. Your job is to wait for our return.” - pg 26What a beautiful reminder not overlook women and their strength. Even as a woman, I'm guilty of doing that sometimes.Since this is an historical-fiction story, I felt like there should have been an afterword talking about what was historical and what wasn’t. But don’t worry I’ve googled it all for you :) The Nightingale is inspired by a real person, Andree de Jongh. Don’t go read her biography before reading this book unless you want to be spoiled. Andree de Jongh and her corresponding character in the book were themselves inspired by a real nurse named Edith Cavell who served during World War I. You should read about her too :)I love pictures and the author has some beautiful pictures of places that inspired the locations in her book.I’m a geek for any reference to art or culture, so when I saw a reference to “drab-eyed, dark-clothed people who looked like they belonged in an Edvard Munch painting.” (pg 239) I had to look it up. He’s most famous for doing The Scream.You’ll love the writing in this book. It’s beautiful. I highlighted so many good quotes that I can’t share them all. This might be my favorite one:“Lately, though, I find myself thinking about the war and my past, about the people I lost. Lost. it makes it sound as if I misplaced my loved ones;” - pg 1The Nightingale deserves all the hype and awards it's gotten. You should read it.", "Star": "5.0 out of 5 stars", "Title": "Must Read"}, {"Upvote": "47", "Review": "So where do I start with this book... Oh I know! I really didn't like this book! Now wait just a minute before you throw a shoe at the screen. I'll tell you why I didn't like this book and why I gave it the rating I did. First let's start with the rating. I rate my books on how well they are written, originality of the story line, character development, pacing of the story, among other things. This book had all these attributes by the bucket load. Exceptional writing, unique story line, complex characters. Which is why I gave it five stars.Now to the fun part. Why I didn't like this book. The honest answer is it made me feel too much. Now you're are probably wondering how can I not like a book like that? This book made me feel happy, sad, scared, grateful and a bit guilty as well. I was born to a generation and a country that didn't have to face the horrors of war. I hear about the destruction that wars bring in the news and I change the channel. Why? Because it makes me sad. This book teaches us how fragile life can be. One day you might be enjoying a beautiful day in the sun and the next something unimaginable might happen to you and the people you love.I didn't t like this book because it made me face my own inadequacies head on. How I should show the people that I love how much I love them more often. How I should treasure every minute that I am blessed to have them in my life. How I should endeavor to be brave and face the challenges that life throws my way. So be brave, love more, take chances but above all enjoy every minute of this fickle life because each and everyone of them is precious.", "Star": "5.0 out of 5 stars", "Title": "Learned great lessons from this book."}, {"Upvote": "36", "Review": "This book. Whew. It took a little bit for me to get into it because I'd learned about it from a romance blog and just assumed it was a romance. It's not. That being said, if I had known, I would have been sucked in right away. As soon as I figured that little fact out, I was sucked in.I've visited the Anne Frank house and Dachau. I've watched tons of movies on the subject. But this book is different. It explores the everyday people in a Nazi occupied country. It explores themes I've never even considered. It's inspirational and motivating but it will tear you up as well. I couldn't put it down and my poor husband had to wait 20 minutes for me to calm down before he could walk with me into a restaurant. Then I read it all the way home and cried for 2 straight hours after I finished it. I'm on the verge of tears now and I finished it months ago.I gave it to my teenager to read who mentioned it to her teacher (who wanted to kill us by the way since she ugly cried on a very public plane for the duration of her flight) and now the book is being read by the school's book club. I hope I had some small part in that decision.", "Star": "5.0 out of 5 stars", "Title": "I would have been sucked in right away"}, {"Upvote": "24", "Review": "I've read a fair amount of historical fiction (and non-fiction) about WWII. I enjoy reading about different experiences that people could have had, and the way the author conveys the characters' lives.  I worried that this book would be filled with stories I've already heard from a different author's pen.  This was not the case at all.The story focuses on alternating between two French sisters, who have a tense relationship which stems from childhood issues. Vianne and Isabelle are quite different from one another, and this offers readers the chance to follow both women on very different courses through the war.The pace of the book was relatively slow, but I think that supported the concept that the occupation of France was not quick.  It was long and drawn out, and the stress and reality of war broke many people. The slow pace also helped richly develop the main characters, as well as several supporting players.  It kept pulling me back in for more. There were a few times when I was thinking \"can anything more happen to them?\" And it did.The ending was amazing, and I shed several tears.  I hadn't thought much about how I thought the book would/should end, but of course I had a few guesses.  It was a wonderful culmination of the emotions that were felt whist coming alongside Vianne and Isabelle.This is my first time reading Kristin Hannah.  I am interested to read some of her other books.", "Star": "5.0 out of 5 stars", "Title": "Excellent WWII novel"}, {"Upvote": "11", "Review": "I was \"supposed\" to be reading another book for our book club, but a little bird was insistently calling to me, saying \"Read me! Read me!\". So, like Lewis Carroll's Alice, I picked up the little bird and read it. And could absolutely not put it down until the final page. That \"little bird\" was, of course, The Nightingale, the immensely popular best seller by Kristin Hannah.Set in France during the German occupation of WWII, the story is about the lives of two sisters, Vianne and Isabelle, who struggle to survive during the darkest of times, under the harshest and most brutal conditions. The author skillfully paints a stark picture showing the extreme differences between the ways each sister manages to cope. The unimaginable hardships they endure are described in excruciating detail, making this reader cringe in fear and revulsion while at the same time, ensuring that said reader will not stop reading.As I sat reading this book in my home with all the comforts I have grown up with, I was reminded that this 21st century American lifestyle must never be taken for granted. History has a nasty way of repeating itself and the amenities we Westerners have enjoyed during the past 7 decades could be erased in the blink of an eye. Or the flash of a nuke. And I have to wonder how many of us would be strong enough to survive the way Vianne and Isabelle--or any of the survivors of that war--did. How many of us could withstand the unimaginable cruelty and inhumanity that accompanies any world war? Heavy thoughts...but only the best writers can make us reflect so heavily on our own real lives by writing fiction about the lives of others.", "Star": "5.0 out of 5 stars", "Title": "Heavy thoughts, great writing"}, {"Upvote": "8", "Review": "The Nightingale is one of the most engrossing books I have read in a long time.  It is the story of two sisters and the circumstances that envelop them during World War 11 and the German invasion of France.  Although they appear to be poles apart in their views, they have one thing in common, courage on a grand scale that overcomes and surpasses all their differences.  Separately they make a stand against the invaders of their homeland, never losing sight of their desire for freedom even when it means their personal sacrifice.The book covers the gamut of the German invasion and the effects it had on the population - the hardships and atrocities that were a part of it.  It is unflinching in its depiction of what it was like to be a citizen of France during these years.I read this book continuously, only putting it down when necessary.  A wonderful reading experience that covered the range of human emotions from joy to grief, from elation to sadness.  It is about redemption and the power of love in its many forms.I highly recommend The Nightingale to anyone who wants to read a wonderful story on every level about the courage of the human soul.", "Star": "5.0 out of 5 stars", "Title": "A Wonderful Book that Covers all the Bases."}, {"Upvote": "14", "Review": "Admission time. I had heard about Kristin Hannah’s The Nightingale, but for some reason, I had been putting off reading it. I just couldn’t wrap my mind around it. I do love historical fiction, but I was in a mystery-thriller phase that I just could not work my way out of.Last week, however, I wanted something different, so I decided to go for it. And go for it I did. All 592 pages. Perhaps my mind knew that I would not be able to put it down once I started. Whatever it was that kept me from reading it before, I am so very glad that I finally got around to it. And I read it, ALL of it, in just over 1 day. I truly could not put it down! YES! It is that great.Two sisters. One steadfast and true. One temperamental and headstrong. After the death of their mother and the day their father sent them away, both want nothing more than to be loved again. Vianne is married to Antoine, whom she has loved and been loved by since she was 14 years-old. Isabelle has been kicked out of one boarding school after another.When news of war comes to France, Vianne remembers her father the way he was before the first Great War and how he was never the same afterward. Isabelle only remembers the man from after the war; the one who never wanted her.With Antoine called to fight, Vianne is left to care for their daughter, Sophie, when the Germans invade France. She has no idea how she will cope. Isabelle wants to fight for France. She wants to join the Resistance and do whatever possible to free France from the horrible Nazi regime.Differing dispositions and ideology separate the sisters, but as conditions in France turn into a real-life nightmare, each sister must tread her own dangerous path to survive the Occupation.This is now one of my favorite books of all time. It is historical fiction, real-life, heartache, terror, love, and forgiveness all wrapped up in a story that you will not want to put down until you make it to the final page. And then you will want more.  Unputdownable!", "Star": "5.0 out of 5 stars", "Title": "Unputdownable!"}, {"Upvote": "6", "Review": "I know this is a work of fiction. But even in fiction, we find glimpses of the truth. This book inspired me, at a time when I find it hard to find inspiration. In this time of uncertainty, disagreement, and the unknown for what lies ahead, this book has brought perspective, strength, and inspiration. One of the clear messages I got from this book, is that love must always win over hate, in order for our future to survive.  If you want to know what it takes to survive, to be committed to a cause, and to love in the face of evil, hatred and pain, then read this book. But be forewarned, it is not an easy read.  Sacrifice for love in the face of evil, usually never is easy...as was the case for the millions of people that suffered the atrocities of wars throughout our history. For me, this book brought a whole new perspective to life and to what it means to love.", "Star": "5.0 out of 5 stars", "Title": "Inspiring...the true meaning of love and commitment."}, {"Upvote": "5", "Review": "Oh my goodness, where to being with The Nightingale, the book that I received free from SheSpeaks to read and review. The main characters, two sisters, each different in her own values, morals, and spirit. The author truly captures the essence of both sisters....making you feel such heartache and hope for both of them in different ways. She also tells a story that is not readily told or taught in history teachings....the women's war during World War II, I had no idea before reading this book what women went through during that awful, tragic, and soul-breaking time. The starvation, trying to keep her children alive, the humiliation they endured, fear, and physical and emotional pain....I could feel it all through the pages. Every emotion was real, I cried, gasped, hoped, and feared along with the characters. The author also conveyed what love would have felt like during that time, when all you had were memories and the human spirit to hold on to. The Nightingale is about family, hope, love, and dreams for the future....a future that was hard to imagine during such pain and tragedy. The human spirit is strong....that's what I learned after reading this. I can't imagine enduring what these sisters endured and actually live through it. I don't know that I have that much courage, strength or determination. This author makes you think about those things and gives you a whole other side to the Nazi invasion of France. She also paints a beautiful picture of Paris, which made me want to visit even more! Wow, what a heartbreakingly beautiful novel. Get the book and read it. It will change what you thought you knew and have you cherishing every moment you live.", "Star": "5.0 out of 5 stars", "Title": "Thought-provoking, Fantastic read!"}, {"Upvote": "7", "Review": "This was a page-turner. The author kept us riveted to the story, and I did finish the book, because I purchased it. Might not have been the same if I got it from the library. In all fairness, I read this directly after I read \"All the Light They Cannot See\", which took place also (partly) in Occupied France during WWII and was far better written and researched. I am not a fan of the romance novel,nor the feminist novel, and I'm afraid that what \"The Nightingale\"  was. I found the younger sister neither sympathetic nor credible, and the plot did not hang together as it should. Looking back on dates and ages revealed a lot of inconsistencies..", "Star": "3.0 out of 5 stars", "Title": "Pretty Good. Not That Good."}, {"Upvote": "7", "Review": "The story starts with two girls, one only a young child, the other a teenager, abandoned by their father when their mother dies who has returned broken from World War I.  The uncertainty of the 1930's give way to war, and a sense of doom steadily intensifies as the Germans invade and occupy France.  The two girls have a difficult relationship and this is tested and changed as life becomes more and more difficult and dangerous.  I'm not going to say more about the plot, but it's enough to say that at times both my wife and I were in tears over this book, and it's one that will stay with us for a long time.A gripping story, both of us reached a point in the book where we just had to finish it even if it was 1 - 2 - 3 in the morning, as well as an insight into the atrocious conditions of living under Nazi occupation.  Well worth the $US7.11 it cost me to have this downloaded to my Kindle.", "Star": "5.0 out of 5 stars", "Title": "A gripping story, and an insight into life under Nazi occupation."}, {"Upvote": "4", "Review": "I've read several Kristin Hannah books and am always mesmerized by her stories; her character development is impeccable, relatable, and brilliant.The Nightingale was no different.I was unable to put this book down, engaged at every turn and emotionally invested until the last page.Vianne and Isabelle Rossignol are sisters living in France during World War II. Both girls are familiar with the spoils of war having witnessed their father come back from The Great War a changed man. Their father's inability to cope with the tragedies of war casts a shadow over the family that resonates for years to come.When news of a new war emerges, the sisters are certain that this war will be short-lived; and of course, they are very wrong.Hannah writes the story from three points of view: Isabelle's, Vianne's, and a mysterious American woman who we don't learn the identity of until the very end of the novel.I would recommend this read to anyone interested in historical fiction, strong, well-written characters, and a brilliant storyline.", "Star": "5.0 out of 5 stars", "Title": "MUST READ"}, {"Upvote": "5", "Review": "When I searched “French Resistance,” Amazon.com turned up 11,485 titles — and that may understate the number of books that have been written about a subject that is one of the most heavily researched topics in 20th Century history. Anyone who has read more than a smattering of what has been published about World War II is sure to have encountered something about the French Resistance. It takes courage for a contemporary writer to undertake yet another book on such well-traveled terrain — and surpassing skill to succeed in crafting a fresh and moving treatment of the topic. Kristin Hannah has done just that in her novel, The Nightingale.The French Resistance, writ smallHannah is certainly not the first writer to spin a tale about the topic through the experiences of one person (or in this case, two), but she is surely among the most successful. The Nightingale is the story of two French sisters, Isabelle and Vianne Rossignol. (The surname means “nightingale” in French.) Isabelle, the feisty and headstrong younger sister, is determined to serve her country when Nazi Germany invades France in May 1940. She is just eighteen and single as the war begins, having been expelled from a long string of boarding schools. Vianne, ten years older, is a married schoolteacher and the mother of a bright eight-year-old daughter. The two sisters live very different lives through the six years of war, apart most of the time but intersecting at crucial points along the way. Isabelle personifies the Resistance. Vianne and her daughter stand in for all those in France who lived and suffered at home. Both characters are well-developed and credible.A culture of crueltyUnlike some authors, Hannah does not paint a picture of all German soldiers as monsters. Also, though she celebrates the heroes of the Resistance, her treatment of the French people in general is far from kind. The collaborators who dominate the French police are merciless; one in particular proves to be a Nazi at heart. But two Nazi officers play larger parts in the story: a Wehrmacht captain and a colonel in the SS. Though a proud German and at times a willing participant in the Nazis’ vicious treatment of French civilians, the captain has a gentle and compassionate side. By contrast, the colonel embodies all the mean, vindictive traits of Hitler’s chosen few, the “Aryan” men of the sadistic enterprise known as the SS.In a world dominated by reason and compassion, the colonel described by Hannah would be considered grossly exaggerated — a figment of the author’s imagination. Sadly, the portrait is all too realistic, as there are innumerable examples of such monsters throughout the history of World War II. The SS fostered a culture of cruelty: these were not men who were “just following orders” — they were willing, even eager participants in the wanton violence and murder that Hitler’s minions wreaked on untold millions of Europeans. Yes, six million Jews were murdered; as a Jew by birth and a visitor to Auschwitz just twenty years after the end of World War II, I’m intensely aware of that fact. But so were five million other Europeans, not to mention the tens of millions of others who died as soldiers or suffered intense privation of the sort experienced by Vianne and her neighbors. The Nightingale helps us understand the breadth of the horror visited on the world by Hitler and his cronies.About the authorA former attorney who turned to writing full-time, Kristen Hannah has written 22 novels over the past quarter-century. The Nightingale is the most recent. She is American.", "Star": "5.0 out of 5 stars", "Title": "Brilliant!"}, {"Upvote": "5", "Review": "I've been reading Ms Hannah's books for years and have enjoyed every one. This novel is spectacular. I was born in 1938 at the beginning of WWII. I remember the Victory Garden my grandfather planted. I remember picking up soldiers and giving them a ride - everyone did then. I remember air raid drills and giving up butter. I remember VE Day when everyone drove down Main Street honking their horns. I remember my uncle's 21 gun salute funeral and the army officer giving my cousin the folded American Flag. I've read numerous books about WWII. But nothing moved me to tears the way this novel did. I can't believe I traveled to Paris without being aware of the history and the blood and the deprivation and the courage of it's citizens. This novel is beautifully and sensitively written. It's as though Ms Hannah walked France's streets, suffered the bitter cold, climbed the Pyrenees, led the downed English and American airmen to safety, and experienced the extreme hunger and fear that the Parisians did. No one should miss reading this wonderful piece of literature. Thank you Ms. Hannah.", "Star": "5.0 out of 5 stars", "Title": "An incredible novel!"}, {"Upvote": "6", "Review": "Neither as great nor as bad as some of the ratings. I think some of the really bad ones are from people who didn't even finish the book. I thought it a bit superficial in places and some of the historical references seemed added in gratuitously to needlessly remind readers \"it's war time in France\". However about a thrid of the way through I ignored the above annoyances and began to get hooked into the storyline.Some have stated it's a romance novel but any \"romance\" is more like a small parallel story, and not at all the crux of rhe story, of 2 women and their experiences and survival during the war.", "Star": "3.0 out of 5 stars", "Title": "Neither as great nor as bad as some of the ratings"}, {"Upvote": 0, "Review": "Since 'The Nightingale' by Kristin Hannah has been out for over three years now and is much reviewed, I won't go deeply into the plot. Rather, I'll simply point out what I loved and a couple minor things that I felt could have been lessened.To start off, I'll say that I am delighted that I discovered this book because it has made me realize that I must add Kristin Hannah into my list of favorite authors. 'The Nightingale' was the perfect book for me to get to know her body of work.The novel tells the beautiful, tragic, and triumphant story of two sisters, Vianne and Isabelle, who live in France during WWII and make starkly different but sometimes similar choices in coping with the war and its effect on their lives and on their beloved country. From the first page, I was hooked. Kristin Hannah's writing style isn't complicated, nor is it pretentious. It's beautiful and straight-forward, simple but enthralling, while concurrently teaching the reader unsavory lessons and consequences from war time. Both her protagonists and many minor characters in 'The Nightingale' are strong and admirable, while also showing a duality of vulnerability.I love historical fiction, especially those with WWII as a backdrop so the story and plot charmed and fascinated me from page one, and I felt it was done well. I loved many things about the novel but as a classically trained chef and a gourmand, one thing that many readers might miss or might not appreciate as much, was Hannah's accurate and delicious description of food and cooking that Vianne does throughout the book. It was surprising but wonderful to read it being integrated into the story in a way that was convincing. It makes me wonder if the author herself is an avid cook or perhaps she simply loves and appreciates gourmet food. Either way, this was a device and technique that was minor, but very effective and pleased me tremendously.Also wonderfully done was Hannah's propensity to write the book in such a way that it was almost cinematic, as if she intends to or knows that the book will eventually be adapted into a screenplay for a feature film (as of the writing of this review, a feature film is in development). In other words, the characterizations and descriptions are rich, immersing the reader deeply into the mind of the characters both major and minor, and vividly into the plot. While reading, I could see the searing pain and harrowing decisions the sisters had to make in order to survive. In this vein, I was emotionally wrought and gutted while reading chapters 22 and 23, in as much that I had to take a short break before continuing onto 24. The story is about two sisters but it's also about war, don't forget. Heavy stuff, made more wrenching knowing that although this book is fictional, many things that took place actually happened to real people during WWII.As much as I love the book, there are two negatives I must mention. First, is that the bravery and heroism of Isabelle was too heavy handed, cajoling. In the beginning of the book, her character is annoying, arrogant, and impetuous, with a too-big-for-her-breeches attitude. Later on, Hannah transforms her into an almost mythical, herculean, Mount Olympus Goddess type heroine whose actions although believable, were too forced, for the purpose of dramatization. Perhaps the author was trying hard for us readers to like the character of Isabelle after her initial behavior in the beginning of the book.This wasn't necessary in my opinion because even with less heroicizing, I would have still liked her. Not as much as I liked Vianne, but I would have still liked her character nonetheless.Another plot point that I felt could have been shaved off a bit was the love story subplot between Isabelle and Gaetan. It played throughout the book, which was tolerable, but it was too sentimental, maudlin, to the point of cloyingly sweet. I'm not a major fan of \"love at first sight\" type plots, nor do I like too much romance in my novels. I did like their love story but I would have preferred less of it overall. Yes, people fall in love during times of war, but the over use of plot devices like \"I will go to the ends of the earth for you,\" or \"our love is all that sustains me\" type details don't please me. To be clear, these lines are not in the book but it felt like they were. The Isabelle Gaetan love story parts of the book were too drawn out and made the pace of the book stall. Which pains me to say because the novel's overall pace is excellent.Despite those the two pet peeves, I felt 'The Nightingale' was an excellent read. The decisions that both sisters had to make, especially those by Vianne, are layered and thought-provoking. It makes me wonder what I would do in the same scenario, given little choice. My reading experience with the novel was wonderful and though the book is more accurately 4.75 stars, it deserves the full 5 stars for the effort. Highly recommended for historical fiction, WWII, and strong women fiction fanatics.", "Star": "5.0 out of 5 stars", "Title": "Beautiful, Tragic, and Triumphant: With Some Annoyances"}, {"Upvote": "2", "Review": "The Nightingale is a realistic fiction novel depicting a time when France was occupied by Nazi Germany during WWII. It tells the story of two sisters, Vianne and Isabelle who lost their mom when they were too young. You could also say, that in a way, they have lost their father too who was a broken man after the Great War. When the war begins, Vianne is working as a teacher. She's married to Antoine and they have a daughter, Sophie. Isabelle, the younger sibling, is only eighteen. She's impetuous and adventurous.Before long, Antoine is sent to fight in the war, leaving Vianne and Sophie behind. Isabelle soon joins her sister, after her father sends her away from Paris. Vianne and Isabelle have never been close. Their differences have always been noticeable. Vianne thinks of herself as weak and worries about their survival, while Isabelle speaks her mind and wants to join the fight. She wants to be part of the resistance. Their lives become more complicated when a German captain is sent to live with them. Vianne tries to keep her head down and be inconspicuous. Isabelle, on the other hand, knows she can't stay with Vianne without putting her and Sophie at risk. When the chance to join the resistance comes, Isabelle makes up an excuse to go back to Paris. Here is where the story becomes impossible to put down. The sisters' tribulations, losses, heartbreak and the always present danger captivates the reader.“A broken heart hurts as badly in wartime as in peace.”I believe The Nightingale is a story that should be read by everyone. Kristin Hannah does a great job in detailing the horrors of the war and their consequences. At times, I felt like my insides were being ripped apart. I knew it couldn't end well for them. Or at least not for both. The end was bittersweet. I would recommend having some tissues around. I was not a sobbing mess like I was with her other novel, Firefly Lane, but it was close enough.I hope the movie does this book justice. I hope to add it to prior masterpieces like Shindler's List and Life is Beautiful.“Men tell stories,” I say. It is the truest, simplest answer to his question. “Women get on with it. For us it was a shadow war. There were no parades for us when it was over, no medals or mentions in history books. We did what we had to during the war, and when it was over, we picked up the pieces and started our lives over.”Cliffhanger: No4.5/5 Fangs", "Star": "5.0 out of 5 stars", "Title": "Everyone should read it"}, {"Upvote": "3", "Review": "Since getting my first Kindle I have kept track of everything I've read - and it's been a couple hundred books to date I think.  The number of reviews with 5 stars I've given during that time... well, I can count them on one hand.  I found this book to be very well written, riveting, and something I will think about for a long time. This is the kind of book that sends me to the internet and the library to find out more about the book topic.  As I type this, it is Veteran's Day, and I am once again thinking of all the brave service men and women who have fought for our country.  To them I give my heartfelt thanks.  And Kudos to Ms. Hannah for reminding me...", "Star": "5.0 out of 5 stars", "Title": "One of my VERY rare 5-Star ratings"}], "Star": "4.8 out of 5 stars", "Name": "The Nightingale: A Novel", "Format": "Format: Hardcover", "Price": "$14.73", "Author": "Kristin Hannah"},
{"Comment": [], "Star": "0.0 out of 5 stars", "Name": "To Kill a Mockingbird: A Graphic Novel", "Format": "Format: Hardcover", "Price": "$15.90", "Author": "Harper Lee"},
{"Comment": [{"Upvote": "58", "Review": "This was a terrific read!  Frazier takes us through the passages of Varina's life as a mirror to the life of the South during her years from youth to old age.  Frazier's depiction of the antebellum South, complete with the neurotic obsession of her soon-to-be brother-in-law's vision of a slave culture and her soon-to-be husband's unique relationship with his overseer/slave/friend, Pemberton, precisely defines what southerners meant by the term \"the peculiar institution.\"  Her flight southward is of course metaphoric for the flight of any southerners in the disastrous end of things for the Confederacy.  The vignettes along the muddy roads headed southward are excellent, and say much about what was to come for the South over upcoming decades.  I especially like the depiction of Varina as an ever more independent thinker and actor.  It's hard to imagine that the marriage to a repressed martinet like Jefferson was one of much joy.  And over time nearly all their children die.  Varina emerges as a woman who can stand apart from her world, evaluate it, see it for what it is, and maintain a dignity and an integrity.  I came away liking this woman, perhaps respect would be a better word.  And as a longtime student of the Civil War and its aftermath in Dixie, I found her an excellent cipher for its people and their travails.  Beautiful phraseology throughout.  Great story.", "Star": "5.0 out of 5 stars", "Title": "Varina's Life as a Metaphor for an Age"}, {"Upvote": "30", "Review": "Varina Howell was born into a Mississippi family whose economic status waxed and waned. At the age of 13, she was sent for one year to a girls' school in Philadelphia and returned home to be tutored by a lawyer/judge living in a cabin on her family's homestead.  Judge Winchester instilled in Varina a life-long love of books and trained her in both Greek and Latin for a life of the mind through the study of history, philosophy, poetry and mathematics.  As \"spinsterhood\" approached, at the \"ripe old age\" of 18, Varina was married off to the widower Jefferson Davis, over twenty years her senior and still eight years in mourning for his first wife.  Varina later noted, \"Back then, a good marriage did not require love: a good marriage meant security.\"  She planned to settle on the Davis Mississippi plantation, but her husband chose a political career as a member of the Federal House, Senate and finally Secretary of War. The couple lived in Washington, DC for over 15 years where Varina, because of her wit, charm and education, became friend and hostess to Presidents and Congressmen of the day.  After the Mexican American War, she refused to join her war-hero husband back in DC until he changed his will to make her the beneficiary of his estate.  She finally won her cause.  When the Civil War began and her husband became the first and last President of the Confederacy, she reluctantly moved with their children to the Grey House in Richmond.  She loathed Richmond and was never accepted by the local high society.  She viewed slavery as the \"strangeness of owning people\" since she treated \"help\" like members of her family.  She believed that the South was unprepared for conflict and queried of the Confederacy, \"Is it self-government or self-immolation we are testing?\"  As Richmond burned, she fled with her children and a few loyal servants toward Florida and ultimately planned an escape to Cuba.  It was not meant to be: Jefferson was captured and later imprisoned near DC for two years and she was \"imprisoned\" for a year in Savannah.  After the war, she lived mainly apart from her husband in Europe and with friends throughout the South.  Upon his death, she completed his memoirs.  She supported herself in New York City by writing articles for the New York World.  She befriended Julia Grant, wife of Ulysses Grant, and the women were often seen in public to promote further reconciliation within a healing nation. Varina openly asserted, \"The right side won.\"Frazier is a master wordsmith. He unwinds Varina's life backwards, from the end of her life forward, primarily using fictional conversation. Frazier's prose captures not only the lushness and false \"civility\" of the slave-propelled agricultural economy of the Antebellum South, but also the ravaged landscape and desperate population after Sherman's march to the sea.  Even better are Frazier's delicate forays into the psyches of post-war Jefferson and Varina.  The first reveals a delusional, old man failing both mentally and physically quite emotionally detached from his wife of almost fifty years.  The other is a person with a will of steel who fulfills her obligations, mourns the death of her children and creates a new life.  She wrote, \"It is a frightful thing to drop out of one's place in the world and never find it again..\" Thanks to a gifted author, the reader becomes acquainted with an important American feminist who was, in many ways, ahead of her time.", "Star": "5.0 out of 5 stars", "Title": "A Southern-Belle Bellwether"}, {"Upvote": "18", "Review": "This book was a true testament of what a man I never knew anything about was really like.  Jefferson Davis.  It was an interesting story of a very unusual marriage during one of the worst times in our country's history. And the courage Varina had in taking care of her own.  She was a woman way ahead of her time and never failed to speak her mind and question what she did not understand. She never looked back, always to the future and took the good, bad and ugly in her stride.  Good read although written in a different mode.  If you like history  and fiction combined you will definitely enjoy this book.", "Star": "5.0 out of 5 stars", "Title": "Loving History with a twist"}, {"Upvote": "24", "Review": "As a life long reader and a person with ancestry firmly in the South for generations, books centered in the Civil War and Reconstruction era are sought out. The author, Charles Frazier, previously wrote Cold Mountain, a Masterpiece, in my opinion. Often a novelist has that one outstanding book and all that follow seem inadequate, even those well done. With Varina, the author has accomplished his next great work! Difficult as it can be to weave real historical figures into the fabric of fiction, Frazier has done so, and in excellent form. For readers who have preconceived thoughts, that all of war was a simple concept, after reading this book, you may feel differently. The human, emotional weavings with passion and yet, leaving the reader to ponder and reflect without judgment. Stop and reread and repeat, the same paragraphs, for the nuances and beautiful structure of thought into words, is what I found myself doing. Frazier is the most eloquent writer of near prose I have found. He can turn a phrase so profoundly, you want to keep it with you. I often do copy them down.In these days of selective spending and the abundance of book selections, it is easy to be tempted by covers and advertising. Varina is a novel that will be a keeper and one you will recommend to friends. I highly admire this book and the authors dedication to fairness, frankness, and the harsh truths that we humans created and still exist with the aftermath to this day.", "Star": "5.0 out of 5 stars", "Title": "Another Masterpiece! Varina!"}, {"Upvote": "6", "Review": "The premise of the book sounded intriguing and I have loved Frazier's past novels however, this one missed the mark from my point of view.  It might have been because I was reading it on my Kindle Book, but it seemed hard to follow the characters, time and place.  I didn't find the characters to be particularly interesting or authentic.  I kept thinking that it would get better as I kept reading but it really didn't.  It was one of the few books where I was glad when I had finished it.  Sorry, Charles.  I will try your next book though.", "Star": "3.0 out of 5 stars", "Title": "Not Up to Frazier's High Literary Standards"}, {"Upvote": "2", "Review": "Varina is a novel about the wife of the Confederate President, Jefferson Davis, by Charles Frazier, who also wrote Cold Mountain. A large portion of the book deals with Varina Davis’ life after the fall of Richmond. It follows her unsuccessful escape accompanied by her children, servants and friends as she tries to reach Cuba.The novel weaves back and forth in time as James Brooks, aka Jimmy Limber, connects with her in her later years. The controversy of whether James was originally a slave of the Davises, an adopted son, protege or family ‘pet’ is never completely explained. But James collects V’s memories of her life as a girl, her meeting and marriage to Jeff Davis, her early days in Washington as a political wife and later as the First Lady of the South and the tragic loss of her young son, Joe.It took me al least a third of the book to relax into the writing style. At first, I found it self aware and bordering on pretentious. As I got more deeply into the extraordinary life of V, my irritation at the forced writing style fell away. She is portrayed as a complex, intelligent and wily woman, clearly ahead of the times she lived in.What the novel did was whet my appetite to discover the true Varina Davis and I shall carry on with my research.", "Star": "4.0 out of 5 stars", "Title": "3.5 Stars. A Slow Start But Worth It"}, {"Upvote": "3", "Review": "I had never heard of Varina Davis before I read this book but I like the author. It is a tragic story in many ways but beautifully written. Another stunning example of how women had almost no rights but we're incredibly strong and resilient-more so than the men who had all of the rights at the time.", "Star": "3.0 out of 5 stars", "Title": "little known wife of confederate president"}, {"Upvote": 0, "Review": "But it just didn't quite measure up. In places, the writing is beautiful as you expect from Frazier, and sometimes the book really captured my interest, but I kept finding myself putting it down and then picking it back up again. The narrative is disjointed and cumbersome in places, and I never felt any connection to the characters. Also, while I do like Frazier's ability to write, the way he sets off dialogue with dashes grates on my nerves after awhile. Overall, I wanted to love this book, and I didn't hate it, but I just expected more/better. I definitely will read more about Frazier, however.", "Star": "3.0 out of 5 stars", "Title": "I'm a Civil War buff and wanted to like this book."}, {"Upvote": "4", "Review": "I purchased this book, because I really knew little about Varina Davis. There were some interesting historical facts, but I never felt I knew her.  The jumping from the past to the present was not a helpful format. There were too many people to keep track of, and I found myself skimming through.", "Star": "3.0 out of 5 stars", "Title": "Enough to make me finish, but not enough to wow me"}, {"Upvote": 0, "Review": "I'm a member of a very smart book club, and we all gave a thumbs up to Varina, many of us having read most or all of Frazier's other work. What I found especially compelling aside from Frazier's narrative strategy, which alone makes the novel worth reading, is how Varina introduces the issue of race, something that pretty much defines the United States today as it did in the nineteenth century. Whether you are more interested in history or in literature, you won't be disappointed in Varina.", "Star": "5.0 out of 5 stars", "Title": "Compelling and Timely Novel About an Interesting Historical Figure"}], "Star": "4.1 out of 5 stars", "Name": "Varina: A Novel", "Format": "Format: Hardcover", "Price": "$13.99", "Author": "Charles Frazier"}]
