{"Name": "Kiss Collector", "Image": "https://images.gr-assets.com/books/1518623000l/18457118.jpg", "Reviews": [{"Review": "‘‘Enough! No more relationships. Men are incapable of being faithful and I shall not let my heart be destroyed by them once more!’’Is what Zae is thinking as she is planning a kiss competition with her best girlfriends to see who can collect the most kisses. Except, not in those exact words, because my creative mind has missed a few days of work due to laziness and now it’s working overtime. You see, her boyfriend, with whom she was madly in love (or so she thought), cheated on her. And her father, who was supposed to be a male role model in her life, gave up on his long marriage with her mother. ‘‘What a loser!’’Oops, there goes my overtime and underpaid employee again. Is Zae right to forsake romantic relationships and label her dad and every other guy out there a hormone-saturated creature without the chromosomes necessary for starting a stable and long-lasting relationship? No, of course not! But for a couple of hours—let’s say 5—you have to be in the mind of someone who thinks she is right in her thinking that. Which I personally did not mind doing. Watching Zae take control of her own body and claiming those kisses like a boss was a lot of fun. I predicted drama would ensue, rightly so, and with drama sometimes comes a llama. So this was entertaining, but as mentioned above, predictable. Also, there is a love-triangle you’ll want to murder. Decent and enjoyable on a summer day (unfortunately it comes out in December so you may not find one right away). I just wouldn’t auto-buy if I were you. PS. This was a hell of a weird review. But I am pleased to announce my now disgruntled employee has clocked out. Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"Review": "So freaking unbelievably good. Review to come closer to release date.**EDITED TO ADD REVIEW*4.5 Stars!The Kiss Collector is so much more than your average YA contemporary. So much more.It is emotional and honest and a bit raw. It has diversity and real life problems but most importantly, it's empowering. It's all about family and friends and being supportive of one another, in short, girl power in almost every sense of the phrase. It truly is an amazing read that I just can't praise enough. I loved every single heartfelt, emotionally charged and sometimes even funny page. It was a breath of fresh air in a sea of overrated contemporaries that pale in comparison. *ARC provided by the publisher in exchange for an honest review.*"}, {"Review": "Two things:1.Just an FYI to anyone who received an arc. The author posted this note: *Update* If you're reading an ARC of KC, we are aware of the \"extra-s\" copy editing glitch before every ellipses. So sorry!! It will be fixed before the final book publishes.I wish that I had known this before reading this book as it honestly never even remotely occurred to me that this was a typo. Some of the characters are a bit \"ghetto\" and I thought that the author was using slang. And it drove me crazy! I'm so glad that this was just a copy editing glitch.2.Also do not look at the table of contents of the e-book closely before reading the book. The chapter name for chapter 41 is a huge spoiler. I always look through the table of contents before reading a book to see how many chapters there are and at what percent the book ends.**************************************************************This book is a YA contemporary romance. The narrator is high school junior Xanderia Monroe. But she goes by Zae. The story is told in 1st person POV.The book blurb says that she is 17, although I do not remember that being mentioned in the book. Although since she and her friends are juniors in high school I assumed that they were all 16-17.Zae lives in the least wealthy and most multicultural part of northern Virginia county. She has a group of girlfriends who she does everything with. They are: Lin, Monica, and Kenzie.Most of the story takes place during Spring Break. Zae and her friends decide to see who can kiss the most boys during that time. This book seemed very real to me. I liked that things were not perfect. Zae was disillusioned with love. She did not know what she wanted to do in the future. She had major issues with her parents. And her family had money issues. This book seemed to deal with so many issues that many kids have to deal with in real life.I enjoyed the realistic parts of the story. Also, I really liked Zae's relationship with her little brother. And the friendship between the four girls.My biggest issue with this book was the underage drinking and partying. Is it normal for 16/17 year old kids to be allowed to go out partying every night, getting drunk? It was weird to me because these seemed like good girls. I know some high school students drink. And I know that kids go to parties. Maybe if they had been in college, or at least 18, or at least high school seniors. But I didn't really enjoy this aspect of the story.The romance was the most interesting part of this book. The craziest thing for me was that for most of the book I really had no idea who would end up as her true romantic interest. There were so many possibilities: Dean/athletic guy, Joel/car guy, Elliot/waiter, Taro/skateboard guy. I really thought that the romance was going in a certain direction, but then I was surprised.Overall, this was a really enjoyable quick read. It read like part realistic fiction, part Young Adult romance. The book was light and charming. But it was also serious and compelling. Also I really liked how the epilogue was done.Thanks to HarperTeen and edelweiss for allowing me to read this book."}, {"Review": "DNF at 18%I’m not entirely sure why I requested this one, because when I read the synopsis before starting it, it didn’t sound like something I would read. However, it had a lot of high reviews, so I was hopeful.Zae has a lot of potential. I love the idea that she’s going to take something back for herself. Sadly, I couldn’t settle into her inner monologue. She sounds much younger than her age. Plot wise...I don’t know. The small bit I did read was drama filled and the first chapter was absolutely cringeworthy to me. I didn’t even make it to the kissing parts and skimmed a lot of what I did read. Overall, it didn’t work for me. I’m not rating it because perhaps something would have turned around, but I don’t have the patience for it at this time. **Huge thanks to HarperTeen for providing the arc free of charge**"}, {"Review": "ARC provided by Edelweiss in exchange for an honest review Seventeen-year-old Zae Monroe has had it with relationships. Between getting cheated on by the only guy she’s ever loved and watching her parents’ marriage crumble, she decides to turn the tables and take what she wants, and what she wants are kisses. Athletes, musicians, poets, bad boys—their lips are all on her agenda, and it’s time to collect.For the longest time, men have been categorized as cheaters and douchebags. There are Twitter, Facebook, Instagram and Tumblr accounts fully dedicated to trashing males (I know because I follow some of them). But have you ever seen an account that exposes women? No, because that will be considered sexist. It’s quite the double standard. Where did we get this idea that girls don’t cheat? It’s happened countless times in the history of humanity, especially in recent years. Not all girls are faithful and not all guys are unfaithful. That’s the truth.This book is mainly about girl empowerment and giving a twist to gender stereotypes. The main character, Zae, is done with relationships, so she opts for a more carefree, fun and easy lifestyle. It’s all fun and games in the beginning. She assumed that none of the guys will get attached and it wouldn’t turn complicated. But, it’s not long before things get messy and Zae has to deal with the aftermath of what she did. I was pleasantly surprised by the ending. The overall message is not so much that ''Girls can do the same things as guys'' as I expected, it’s actually ''Girls can make the same mistakes as guys''. If you use and deceive others without having any regards for their feelings, you're a crappy person. Doesn't matter what gender you are. I would definitely recommend it. It’s a fun, cute story but with a great message!"}, {"Review": "After finding her boyfriend with another girl and finding out her dad left the family for another woman, Zae's faith in love was pretty weak. Her revenge on the institution was to kiss and walk away from as many boys as possible during spring break. To make it even more fun, she challenged her three best friends to do the same, and though it was amusing at first, things got complicated quick once emotions played a part.• Pro: This book surprised me in a good way. I will admit I struggled a little with the beginning, but once it got into the thick of the plot - the kissing, it was fun, like a teen movie, and then it turned into a much more meaningful story, which I really enjoyed. • Pro: Zae and her friends were a robust and vivacious group of young women. They shared a fantastic friendship, which was tested over the course of this book, but they were also about supporting other women. The focus on the highs and lows of friendship was done well, and a good female friendship will always capture my attention. • Pro: If you look at the cover of the book, you can tell it included a lot of ethnic diversity, but there was also diversity with respect to family structure, which is something I connect with. One character was adopted and lived in a two parent home, another lived with multiple generations of women in her home, and the other two were from single parent homes. • Pro: Zae was not only struggling with the changes in her home life, she was also grappling with worries about her future and her feelings of being left behind by her friends. I really liked where Higgins went with this subplot, because it gave the story a good dose of substance, and I loved the way it played out. • Pro: Even though she was down with love, Zae did find some romance, and I loved the paring and the way their relationship evolved. He was more complex, than he first appeared, and this was a slooooooow burn, but so satisfying. • Pro: What a great epilogue! Not only did Higgins wrap up Zae's story for us, she caught us up with everyone, who played a significant part in the story. And, let me tell you, there was some super-sweet-awesome stuff that transpired in that epilogue. Overall: A revenge turned romance turned self-realization story, which made me giggle, smile, swoon, and shed happy tears. *ARC provided in exchange for an honest review. BLOG | INSTAGRAM |TWITTER | BLOGLOVIN | FRIEND ME ON GOODREADS"}, {"Review": "Kiss Collector was a cute book; a perfect read right after a \"heavy\" book. Zae just broke up with her boyfriend and is having family difficulties at home. This affects her deeply and not trusting the men of the species, decides to have a kissing game with her friends; who can kiss the most guys during spring break. Zae is going through a lot emotionally, but someone is writing poems about her in English class and she is dying to know who the culprit is. She must make decisions that will guide her into adulthood. She finds who and what she needs at the very end. Lovely read. "}, {"Review": "I was looking forward to this fun story, but I felt disappointed.But for the many important themes carefully approached, I think it was still worth it.Zae has been facing problems in all aspects of her life, her parents constantly fighting, her boyfriend cheating, even the cheerleaders tryouts may become a flunk this year. She has no idea what to do with herself when she decides to take control of things, starting with boys. That's when she and her friends start a competition to see whom will kiss the most boys before they're back to school.I was ready for something more like Firsts, which had a similar premise although it wasn't a competition there. But what really lacked here was fun. Zae was at a mental state I could only feel pity for her. Things were too serious in this book for me to have fun and all I could do was wait for her breakdown. As you can see, I have myself to blame for wanting a different kind of book and thus feeling frustrated.Despite dragging, the book managed to approach many important and some not so common themes, such as not wanting to go to a university. To be honest, I don't remember reading any YA's on this, and it's always important to show kids they have so many more options than what conventions impose.Of course there was much more that would render good discussions for a group reading, so this is surely a recommended book for book clubs and the such. On this, I wish they had approached the idea of girls kissing for fun in a positive way, though. As I said, Zae wasn't in the best place to make decisions, which didn't help this argument. It's a pity, since the author seemed to give serious thought to everything she was proposing, so it'd have been an important situation.In all, this was just a book that dragged. The plethora of characters, especially boys, coming and going didn't help my getting involved since I couldn't even keep count of the important characters. But I'd still read more from this writer, you can see she has a lot of talent and great ideas."}, {"Review": "What a fantastic new book, with hot guys galoreI recommend Kiss Collector - it’s worth an explore!————————————————————I’ll try my best to give a review that’s not biased But I love Wendy Higgins, I hold her the highest.She’s a wonderful author and with her talent she writesBooks I get hooked to, books full of delightsKiss Collector is written amazingly so,from the view of the beautiful Zae Monroe Zae’s having some trouble at high school you seeSo to help her recover, here’s her latest theoryShe’s seen relationships shatter - ones close to her heartso she needs a new plan and here’s how she’ll startShe’ll kiss a few boys and not want for moreBoys are just drama of that she’s now sureShe’s kissing to heal her poor battered soulTo forget her heart’s pain, is her primary goalShe’ll kiss athletes and poets and musicians for sure,She’ll kiss bad boys and skaters, their lips are her cureShe’ll challenge her friends to join in the funOf collecting some kisses and when they are doneThey’ll smile and say thank you then hold their heads highAs they find their next target, some other cute guySo there you have it, Zae’s Spring break goalTo have fun with her friends, whilst mending her soulCan a kiss, be a kiss and nothing more?A simple challenge with friends and a final score?Or will hearts be broken? Will Zae need a protector?To find out the answers...READ KISS COLLECTOR!! "}, {"Review": "This is different for me from any others I've experienced. I'm lost in the physical sensations but emotionally detached from it. Like a guy.And then...Let's make it a contest to see which one of us can kiss the most boys before the end of spring break.I should have just DNF this book. I was hate reading by the end but I wanted to know what happened. And well it all fell into place once Zae's mom told her the truth. It was like magic. Honestly, I didn't connect with any of the characters. I didn't really like any of them. I do think it belongs in a high school library though. Young teens need a platform to talk about sexual abuse or almost sexual abuse. It's so important because the \"almost\" part really worries me. They just glossed over it but what happens when it's not \"almost\" and he does sexually assault someone. Those almost times are important. Talking about divorce and relationships is important. Books like these are important. I just wasn't feeling this one. I digress. A kissing competition. A fun silly one would have been cute and even funny. But this book was dark. The main character was so jaded and so immature. She threatened a boy that was messing with her little brother and that was suppose to be cool but I saw it as abuse. She was older and stronger and that was not okay. And the judgment was so hard. She called boys fuckboys but then kissed them. She was a \"good\" cheerleader not a slutty one. Only her group of friends were good. This was so odd to me. There was so much undercurrent prejudice and stereotypes and the worst part was that she was correct. I'm telling you these characters were awful. Next time I'll DNF and move on."}, {"Review": "Zae Monroe has been deceived and disappointed by boys, with her friends they decide to take from boys only the things they love, that is, kisses. On the other hand, her parents separate and when she discovers the reason, she is angry. She's going to try to enjoy life and the boys. I loved Zae, she is upset about her family but is doing everything she can to protect her little brother. Her best friends are Monica, Kenzie and Lin. Zae absolutely wants to kiss Dean but eventually she will fall in love with Joel. I suffered for her, her friends are not always very nice to her, even if finally she too sometimes gets carried away and doesn't pay attention to collateral damage. Joel is an adorable boy with a big Bad Boy side that is very appreciable. He's always there to save Zae and I really like the relationship they both have. His family situation is not simple and he tries to get out of clichés. I loved the lightness of the story and Wendy turned my little heart upside down again. We've all been in Zae's shoes at one time or another, we just didn't have the courage to do what she did. High school is a very complicated time for young girls, boys use and abuse their naivety and the fact that Zae and her friends finally make a decision like this is great. Quick Word: A funny and light romance that will await you. "}, {"Review": "3.5/5I love Wendy's books, and I literally just read this straight through!While this novel is filled to the brim with drama, most of the drama did not emerge between Zae’s friends but more from interacting with different guys. But, relationship drama is not the only important part of the story. Zae had to deal with many real-life issues with her family, friends, and financial situation. My favorite part of the story was Zae’s relationship with her brother because it was endearing and adorable. I’m so glad Wendy decided to highlight the sibling dynamic. Her entire family was also central to the story. Her parents were facing divorce and a lot of other issues but were ultimately remarkably supportive of Zae.While the competition was interesting, it was probably my least favorite aspect of the book. All it managed to do was create tension between Zae and her friends. I think the competition could have been the first half of the book and then the last half of the book could have expanded the romance. While Zae kissed several guys, there were a few that I liked much more than the others, and I wish we got to see more of them in the story. I found myself rooting for many of the guys who liked Zae, but I was thrilled with the ending of the story. Wendy Higgins is one of the first authors I ever met, and I have read all of her books since then. I had high hopes for KISS COLLECTOR, and I am so happy Wendy decided to venture into a full-length contemporary romance. The story is relatively predictable but also a joy to read. I read it on one sitting, and I think that is the best way to do it because it takes place over a relatively short period and the book itself is short. Readers who aren’t a fan of drama probably shouldn’t read KISS COLLECTOR. If looking for a fun, addicting, and quick read, this is the book. I highly recommend this brief but enthralling read."}, {"Review": "It's been a while since I gave 5 stars. For a while I think I was just giving em out cuz I liked the book a lot, but didn't really love it, so I decided unless I absolutely loved the book I wouldn't give 5 stars. This is the first time in quite a while. This book was sooooo goood! I laughed, I cried and I was completely immeresed in every detail. It was very relatable and real. It wasn't exactly my high school experience but it certainly reminded me not only of my own but of friends that dealt with similar issues. "}, {"Review": "I received an eARC of this through Edelweiss in exchange for an honest review. Dudes can be the absolute worst. Zae’s boyfriend cheats on her and her parents are getting divorced because of her own father’s cheating ways. She is done being used by the male population, so she has decided to take what she wants, no strings attached. Zae and her three besties compete against each other to get the most kiss over spring break, the only rules are no falling in love and no kissing anyone’s ex. While Zae is struggling with the changes in her life, like moving to a small apartment and working on her tumbling for cheerleading, she finds that she is developing romantic feelings for two guys in her junior class. Too bad one of those guys has his sights set on one of her friends. Will Zae and her friends be able to come out of this kissing completion with their friendship still intact?This story was rough because the characters were one-dimensional. I wasn’t pulling for any of the guys, because truthfully I didn’t care about what happened to any of the characters. I have no clue what the main character looks like. All she talks about is her curly hair…but what colors are her eyes, hair, skin? Does she spray tan? While there is a great amount of work done to classify/diversify the other characters, I don’t have a clear picture of the main character. I loved the Sweet Reckoning series, but this novel didn’t work for me. However, I loved the fact that the main character was good at and loved languages. I have never seen a character with those qualities before and I think it does give a refreshing outlook. This novel did explore the less popular, but just as awesome options for adulthood…not everyone wants to go to college, and that is okay. I totally appreciated that. "}, {"Review": "My full review can be found on the Epilie Aspie Chick blog! Thank you to HarperCollins for providing the ARC in exchange for an honest review.  Full disclosure: I'm in a permanent love affair with Wendy Higgins as an author. The Sweet Evil series still makes me swoon every time I think about it fondly and its oh so adorable lead couple, Anna and Kaidan. So when I saw that Wendy was taking a trip away from Fantasy lane to publish a contemporary romance book - I knew I had to get my hands on it. AND BOY DID IT NOT DISAPPOINT. With girl squads, boy issues, family drama, and a future so unplanned that it looks like a desert wasteland, how could you not get excited?  Wendy's quick wit and startling ability to weave a complicated tale well continues on in this new sub-genre with Zae Monroe. Our story starts out with her world being completely shattered her boyfriend Wylie cheats on her, her parents split up (in which she finds out that her dad is moving in with his girlfriend), and she's moving out of the only home she's ever known. The only guy who hasn't let her down at this point is her younger brother, Zeb. It's at this point when she's out with her group of three girl friends from the cheer team that Zae gets the best idea: instead of dating boys who use and abuse them - why don't they turn the tables on the guys and use them for kisses? All four girls them agree to spend their spring break collecting kisses from guys, with the girl having the most kissed guys winning.  Zae's life starts out a perfect picture and turns into a total mess... rightfully so. The thing I loved about this book is that it felt so genuine and real what our heroine goes through. None of it is made to feel like this image of utopia or that everything will be right going forward. Life is hard, you have to work hard to fix your mistakes and choose to stay with the people you love. The challenge here feels tough and Zae struggles hard with it - and blunders her way through it multiple times. Her mistakes along the way are big and the consequences are real, to which she admits she screws up and deals with it. There are a few \"perfection\" situations that I doubt would happen in the real world, but in the book world that's to be expected. "}, {"Review": "I haven’t read a book by Wendy in years, so I was really excited when I saw this one. I had to read it immediately. While it was sweet and fun, it wasn’t as good as Wendy’s other books. I took me a long time to get into the story and start enjoying the book. The romance was slow building and kind of made me really impatient at times. I do wholeheartedly support the main idea behind the book. To get revenge on guys by acting exactly like them. I am really glad Zae didn’t experience any name callings, as this was one of my biggest worries. A lot of the times if girls decide they’re just gonna have fun, they get called names. There are always double standards and I really liked how the girls in this book could do just that and still be treated normally.Blog | Twitter | Facebook | Instagram | Pinterest"}, {"Review": "This review was originally posted on That Book Gal.This book and I started out on rocky ground. I’m so glad I’d read a Wendy Higgins before and also that this was a review copy. I stuck it out because I trusted Wendy, but also because I knew I had to review this. The concept of this is hella empowering. Turning the tables on the boys? Being basically like f-girls? Okay yes please and thank you. It was all about teaching the boys a lesson. But it also had some scary realities.There is a scene of sexual assault. Zae isn’t interested in where a guy is going, she says no. She has to fight him off in the end and only gets away because her friends heard the commotion. The book then deals with some of Zae’s paranoia the next day(which yeah, fits. Of course she’s freaked out) and it talks about how lucky she was that she had people to help her get out the situation. And it touches on how she can’t go to the police, and the issues with people not believing survivors. This situation isn’t even a huge plot point, but I think it helps the book. Because in the amount of rape culture and toxic masculinity in our society, the whole concept of the book wouldn’t work because giving just one thing makes boys think they can take it all.One issue, which isn’t awful, that I had with the story, is that at times Zae seemed a lot younger than she is. But she changes a lot throughout the story, and as she grows I think she sheds that sort of skin and is a much more likable person. But it’s understandable how she acts in the beginning. Her boyfriend just cheated, and she’s the bad guy because she wasn’t ready for the next step in the relationship(ugh, boys). Her parents are getting divorced. Everything in her life is falling apart and it makes sense that she reverted to a more childish attitude.There’s a huge thing at the end of this book that I won’t spoil, but it’s something I hardcore related to. Okay fine here’s a spoiler section. Words in white, select to read.(view spoiler)[I just recently decided to live somewhere thousands of miles away from my family. It was one of the hardest decisions of my life. I hardcore related to EVERYTHING Zae said about having to make her decision, and then once she made it it threw me back to all those bittersweet feelings. To doing something that you know is right, but having so many goodbyes and missed moments. I’m not at the other end yet like she is, but I could also relate to her missing out on parts of her brother’s life, and returning to him being taller and having changed. I RELATED TO THIS CRAP(lovingly said, I promise) OKAY (hide spoiler)]In this story, it’s heavily featured that Zae doesn’t want to go to college. I love how this book doesn’t show her as stupid, or just a “fickle teen” or whatever. The guidance counselor takes her seriously and this book really shows that college isn’t everything. It’s not for everyone, and that’s okay. In the end, what matters is that you can find a job you love, with or without a college degree.The last portion of this review is dedicated to the amazing, hot human who is Joel. YES PLEASE AND THANK YOU. He’s just the sweetest guy. He can rap, and he’s funny, and he’s angsty but a softie inside. HE MELTS MY HEART Y’ALL. I just love him. Also. The sexual tension between him and Zae is like super amazing. Like my sister reads this blog so I’m going to keep the fanning to a minimum, but DANG. HOT DANG.I also loved the mysterious poet! His words were amazing and so well written and romantic, and a lil edgy sometimes, but heyyyy he was in love.WE’RE GOING TO END ON THE AMAZINGNESS THAT IS THE MAIN SQUAD. This books heavily focuses on Zae’s friend group, her squad. Honestly the friendships were so amazing and each friend was really well developed. They all had different depths of friendship with Zae. Sometimes with friend groups in books, especially all girl or all boy ones, I can’t tell the people apart. They’re like on friend conglomerate. But Wendy Higgins does a great job at keeping them separate people and the most amazing squad.So overall! This book has lots of kissing(yesss), cute boys, drama, amazing friendships, and beneath it all, a wonderful heart."}, {"Review": "For more review follow my blog shades of paperI was pretty intrigued by the premise of this novel, because it sounded super interesting and like it was going to be a very fun and entertaining story, and I had pretty high expectations because I enjoyed the other book I read by this author, and though it was a very lighthearted read, I expected so much more from it, and it didn’t reach those expectations. The main problem that I had with Kiss Collector was that I found the characters extremely unremarkable. They were very plain and simple, and I feel I read about those type of characters in multiple YA contemporary romances before. I really loved the female friendship in the book, because I think it was so precious and seeing girls supporting each other and relying in her friends is always a bonus, and I think those relationships were so well done.However, I wasn’t the biggest fan of the romance, and that was mainly the 80% of the story. There wasn’t anything wrong about the way it was written, but more a personal preference. I’m quite picky with my romances, and though there were some parts that I enjoyed and I could see the chemistry between the characters, I feel there was too much angst for the lighthearted tone the book set at the beginning of the story that could have been easily avoided had the characters actually had a conversation.It was a very fast paced and fun book that didn’t take me long to finish, which is something that I like in contemporary books, and overall, despite not being the best book I’ve read and the main character being a bit annoying sometimes, it had some redeemable qualities and I enjoyed other parts.I received an ARC of this book in exchange for an honest review. This doesn’t change my opinion whatsoever. All thoughts are my own.Actual rating: 2.75⭐️"}, {"Review": "I received an e-ARC from Edelweiss in exchange for an honest review.Xanderia Monroe. But she goes by Zae. She lives her high school life full of drama, teenage crushes and lots of heartbreak. There is way too much fun and emotion to go around here and it was surprising for me to read a YA contemporary from Wendy Higgins, whom I have mostly connected with PNR and her recent sci-fi series. This was new and fresh and I enjoyed it. There is a huge spoiler about whom Zae ends with but I'll leave to you to find out. ;)My only throwback was the underage drinking and the parties. They are all a bunch of 16/17 years old. Where were the parents in all this? But despite that, the story was well written and Zae's emotions were realistic and funny."}, {"Review": "3.5 stars!Liked a lot, didn’t absolutely love. It definitely had a lot going for it, but adversely, it had some things I could have lived without. I read it all in one go, so it certainly was entertaining to hold my attention for one afternoon.I was absolutely a fan of the whole “we are women and we’ll take your kisses and enjoy the hell out of them but nothing more” movement they had going on. I may write a longer [better] review one day.♥ A very special thanks to HarperTEEN and Edelweiss for providing me with an advanced copy of this title.*Disclaimer: An e-copy of this title was provided by the publisher via Edelweiss in exchange for an honest review. However, that did not influence this review in any way. All thoughts, quotes, and opinions will be of this version and not of the published edition."}], "Genre": "Romance", "ID": "18457118", "Desc": ""}