{"Name": "Every Breath", "Image": "https://images.gr-assets.com/books/1521763937l/38212843.jpg", "Reviews": [{"Review": "\nThere are stories that rise from mysterious, unknown places, and others that are discovered, a gift from someone else.\nFound near a sandy dune, on an actual stretch of North Carolina beach, sits a community mailbox—owned by no one and everyone. A character in its own right, Kindred Spirit rests atop a driftwood post, waiting to share the hopes and dreams entrusted by past visitors, along with this resounding message: love endures. Letters and photocopied drawings available for perusal during the time of Nicholas Sparks’ own visit to the box, served as the catalyst, prompting him to track down the couple behind the heartfelt words. Ultimately, it was their journey that provided the inspiration for this story-within-a-story and the author’s mighty return to his roots—the telling of a love so intense, it’s felt with the reader’s every breath and turn of the page. And so it begins, with fate placing Tru and Hope on the same stretch of beach.\nThe destiny that matters most in anyone’s life is the one concerning love.\nA plane ticket and a plea from Tru’s estranged father brings him halfway around the world—from the “the bush” in Zimbabwe to the coast of North Carolina. His time abroad proves to be life-altering; giving him the opportunity to lay eyes on his father for the very first time and the introduction to the one person he never knew his soul yearned for. It’s the misadventures of the rambunctious terrier staying in the beach cottage next door that brings about the meet cute. Decompressing from the stressors wreaking emotional havoc, Hope’s intention is to spend a few days alone at her family’s beach house to gain some much needed clarity. The furthest thing from her mind, meeting a man like Tru. Pivotal days—including a trip to Kindred Spirit—force Hope and Tru to make hard and fast decisions. What are they willing to sacrifice for the type of love experienced only once in a lifetime?This is where things get a tad tricky for me. The very place where Nicholas Sparks makes me gnaw on my own words and admit I just might be a bit of hypocrite. I’ve made it clear—loudly, and more than a few times—insta-love doesn’t work for me in any capacity. But, and this is a HUGE but, Nicholas Sparks seems to be the outlier and here’s why. Glossing over the development of those lovey-dovey emotions on the front end of the falling is typical for him, opting instead to sell the reader on the back end. And you know what, it works. Once that declaration of love is released into the fictional universe, it’s game on as the full force, feel it in your bones, your heart wants to explode from all of the giddiness feelings takes over. So, regardless of how few days it takes Hope and Tru to transition from strangers to lovers, the intensity of their connection is undeniable. As a seasoned Sparks reader, I'd be remiss if I didn't mention that Every Breath went a long way to piece together the shambles Two By Two left my heart in. Kudos to Sparks for trying something different with his previous two releases, but neither worked well for this love obsessed heart of mine. See Me felt like a detour and Two By Two felt like a completely wrong turn. Both forcing me to ponder, had the king of romance lost his touch? Nope. Leave it to the wonders of Kindred Spirit to inspire a story reminiscent of the author’s greats. I think a trip of my own is imminent. *THANK YOU to Grand Central for providing a copy in exchange for my honest review."}, {"Review": "Spoilers ahead! I just finished Every Breath this morning and it turned out to be pretty good. Once I got about half way through I was leary with the direction the book was taking, but by the end it came together nicely.Hope is in a relationship that she isn't exactly content with. Her boyfriend Josh doesn't seem to be committing and after six years she wonders what their future holds. Her dad has been diagnosed with a debilitating health condition and she doesn't know how much time they have left together. She plans a visit to their family cottage on Sunset Beach because her family has decided to sell it and she needs to help prepare. During that week, Hope meets Tru who is on a temporary visit  from Africa to meet his father for the first time. Tru's hope is to learn more about his mother while he's there. When Tru and Hope meet, they have a genuine interest in each other. It's love at first sight and they can't stop thinking about one another.\n\"Through the window, he was able to see into the kitchen as Hope emerged from around the corner, a towel draped over her shoulder, and pulled two cups from the cabinet. She interested him. That she was beautiful there was no doubt, but it wasn't simply that. There was an air of vulnerability and loneliness behind her smile, as if she was wrestling with something troubling. Maybe even a few somethings.\"\nAs their time comes to a close, their family circumstances get in the way and they have to make a difficult decision regarding their future together. Will they follow their hearts?Nicholas Sparks writes beautiful romances. I've been reading his books for as long as I can remember and I'm used to his writing. With that said, the romance in this book felt like insta-love and went way to quick for me. The two meet--they are totally physically attracted to one another--then they are in love in just a matter of a few days. Don't get me wrong, it's not that I don't think two people can have a quick connection like Tru and Hope did, it's just that for me it felt rushed and I wanted more development to their relationship. Another issue I had was that even with the strong connection they feel for each other, they go separate ways and live separate lives, and decades later they still feel the same. It's like this huge piece of their time apart never happened even with zero communication in between. I get that we make decisions in life and we have to take the road that follows, but feeling as strong as these two did and knowing the options that Hope had in her current relationship, their decisions just didn't feel right to me. I wanted them to stay together and it just wasn't going to happen,  but regardless, I found it to be a good story. These are just my personal opinions on the story itself based on the characters' backgrounds and choices.I still enjoyed the book! I loved that even though it's a work of fiction, parts of it were true. I even had a few tears as they read through some of the letters from Kindred Spirit: a mailbox in North Carolina that really exists. The writing is beautiful and detailed. The characters had depth with their own histories. It just really felt good to get back into a Spark's novel.3.5 stars rounded up.You can see all my reviews @ www.readrantrockandroll.com"}, {"Review": "I loved this novel. For those that enjoy a timeless, classic, romantic love story....check this one out. From the beginning author’s introduction from Nicholas Sparks to the very end, I was fully enraptured and captivated. As so many important novels do, it had me thinking about life and circumstance throughout reading and left me with similar questioning thoughts once I turned the last page. This book has all the makings of a love story to remember from the characters’ strength, resilience, and loyalty to the moments that squeeze your heart with heartbreak for situations that no one should have to go through. This novel was relatable for any age whether young or old and I can only imagine that many (like me) could see themselves in these character’s shoes for different moments of their lives. Whether it be for making that difficult decision that alters a life’s path or dealing with the grief of loss that only comes from living (and loving).For those that are a fan of Nicholas Sparks novels, you will not be disappointed with this one. It has all the telltale signs of what he is rightfully known for. It’s one of those stories that only he can tell best. ***Thank you to Hachette Book Group Canada for sending me an ARC of this novel in exchange for an honest review***"}, {"Review": "\n \n\n MY REVIEW:  can also be found on my blog: \n ➽ KITTY KATS CRAZY ABOUT BOOKS\nIn the romantic tradition of The Notebook and Nights in Rodanthe Nicholas Sparks brings us EVERY BREATH  which Is a full length, stand alone romance novel.Like previous novels by this author he has such an uncanny knack of weaving a magic spell over his readers Every Breath is no different, unique in every way, it drew me in as soon as I started reading it. In this we’re introduced to forty two year old Tru, an unconventional man of many layers, a guide on a game reserve in Zimbabwe where he’d worked for the past ten years. Divorced with one child.Out of the blue a letter arrives for him, inside are two plane tickets, a later accompanied with an old photograph written and sent by his biological father whom he has never met. Within the letter it is stated that he is dying. Not long on USA soil and settling into his father's house on the beach he’s returning a dog to his neighbour that had been knocked by a car.When he first laid eyes on Hope  She was beautiful, with untamed auburn hair and eyes the colour of turquoise. Almost at once something inside him began to stir, something that made him feel a bit nervous, the way he always felt in the presence of a beautiful woman.  Thirty six year old Hope is packing up her parents cottage which had just recently sold and is preparing attending her friends wedding without her long term boyfriend by her side, she works as a trauma nurse in the ER and at this stage was unmarried and without children. As soon as these two clap eyes on each other there is an instant feeling of attraction, a feeling of coming home after a long trip away, as though they have known each other for many years. A heartbreaking journey that hit all the feels, an unpredictable, unique kind of read. Highly recommend.\n\n\n  \n     \n "}, {"Review": "Title: Every BreathSeries: StandaloneAuthor: Nicholas SparksRelease date:  October 16, 2018Every Breath had a lot of promise to be a big winner for me, but unfortunately it didn't reach my expectations. Based on the synopsis, it sounded like an emotional ill-fated love story with the potential for a second chance later in life. How long can a dream survive? it poses. Mistakes were inevitable, and she’d concluded that regrets could impart important lessons in life, if one was willing to learn from them. And in that sense, she realized that her father had been only half-correct about memories. They weren’t, after all, only doorways to the past. She wanted to believe that they could also be doorways to a new and different kind of future.I knew that a happy ending isn't guaranteed, and while that's preferable, if the message in the story at least leaves me introspective and moved then I'm satisfied. I didn't come away from the book feeling happy with the events that took place, in fact, I was frustrated and left wanting more. There were several things that contributed to that, and I'll get to that in a minute. Tru Walls is a safari guide from Zimbabwe who is visiting North Carolina for the first time on a life changing trip. He's a man of simple needs who loves his son dearly, but as much as he loved his ex-wife, they couldn't make their marriage work. They wanted different things out of life: she wanted a husband who would be home more, he wanted to continue the career he loved amongst the land and wildlife where he felt most at peace. This is one area where he was unwilling to compromise, and they parted on amicable terms. There isn't much that would tempt him to leave the country and take time away from his son. Except learning more about his biological father and unlocking answers to questions he has about his mother. For that, he agrees to meet with the man who has reached out to him, and the uncertainty of what he will uncover has him more than a little unsettled. Hope Anderson is staying nearby at her parents' cottage on the beach with her own worries consuming her. Her father has just been diagnosed with ALS, and with that earth shattering news, the future is a scary thing to imagine. Will her parents have enough money for his care as his health deteriorates? How will she deal with seeing her wonderful father slowly waste away before her eyes? And then she has things of a more personal nature plaguing her mind. The relationship with her boyfriend of six years is once again on rocky terms, and she's at a crossroads. Attending her friend's wedding by herself while he parties in Vegas with his friends, she knows something has to give. As much as she doesn't want to believe she's wasting her time with him, she can't help but feel like marriage and a family may never be in the cards. Motherhood has always been something she expected to achieve...but more than that, needed to achieve. Now her biological clock is ticking away as she counts the minutes passing her by. Both Hope and Tru were dealing with very heavy decisions that would forever alter the course of their life. It was a time for introspection and self-discovery. Then they cross paths and begin a friendship that very quickly evolves into a complication that neither was expecting. When I say very quickly, I'm talking about a matter of one day. We met on a Wednesday morning, and I’d fallen in love with him by Thursday evening.This was a major issue for me. Sparks was going for a soulmates/destiny/magical feeling about this couple based on how they instantly felt emotions that couldn't be explained. I'm not necessarily against that in books, but in this case it made their supposed depth of feelings seem artificial and shallow. In short, I just didn't believe it. The actual development of their romance was almost non-existent in the book. Which made the unchanged intensity of their feelings after 25 years to be laughable. On one hand, this was a fairy tale type of romance. On the other, it was bone jarringly realistic in regards to the effects of Hope's rash choices. I don't think you can have it both ways and end up with a cohesive plot. Part two was a juxtaposition of regrets and hope for both characters. The big question was which one was the end point in it all? We get a long examination of their life stories over the last two and a half decades. Family, successes, failures, and pondering if things could have been better if another path had been chosen. To be frank, I started to skim some of these pages after a while because the story started to lose me. If I had agreed with Hope and liked her more, I might have cared at this point. Unfortunately I got annoyed at her selfishness, and the ignorance of her decision. Yes, she achieved her ultimate goal, but at what cost? She had alternatives that would have given her the same results, but refused to compromise on her needs. (view spoiler)[Here's my problem with that: Tru was willing to give up his entire world and rearrange his life plans for the woman he loved. This is something that he couldn't do for his first wife, but his feelings were so strong for Hope that he would do anything to make it easier for her to choose him. He proved his love beyond a doubt by his actions. She didn't. I understood her needing to be near her father in his final years. That's admirable, and beyond blame. However, she turned down his offer for him to move to the US, because adopting children \"wouldn't be the same\" as having biological children. Knowing Tru was sterile was the deciding factor in the entire affair. I'm sorry, but that is unbelievably awful and selfish. She chose a man whom she felt lackluster about in comparison to Tru who brought peace and happiness. The idea that adopted children are somehow less than biological is ignorant, and it made me angry that she put that at the top of her priorities. She didn't want a big wedding because ...she had no desire to smile through the faux romance of a fairy-tale wedding. By then, after all, she understood the nature of romance, and knew it had little to do with trying to create a fantasy. Real romance was spontaneous, unpredictable, and could be as simple as listening to a man read a love letter found in a lonely mailbox on a stormy September afternoon. She didn't even see a future with this man as a \"real romance.\" Yet she accepted his marriage proposal so he could be her designated baby maker. Not to mention how hypocritical she was! In the beginning she was doubting her boyfriend's faithfulness and didn't know if she could trust him. He had slept with other women during their frequent and brief break ups. And yet she can take a call from him at the cottage, and a few minutes later sleep with another man with a complete lack of conscience? She sat in judgement of his \"cheating\" when she did the same thing and didn't even have the decency to come clean and tell him before accepting his proposal! This was all (and I quote) \"in the hope of sparing his feelings.\"  (hide spoiler)]I was just so done with her, I completely disconnected from the outcome of the story. Yes, it was sweet and romantic how they reconnected, and yet I was puzzled as to why Tru would even be interested at that point in his life. It didn't make very much sense to me. I enjoyed Tru's home of Zimbabwe, and the detail put into the research surrounding that setting. There were parts of the plot that were whimsical and touching, and yet overall the romance was too superficial to actually be believable. The ending left me unexpectedly deflated as the reality of the near future was revealed. I couldn't help but feel that Tru's blind devotion had cheated him out of the happiness he could have had. I'm sure a lot of readers will find this to be achingly bittersweet, but for me this leaned way too far into the bitter with not enough sweet to satisfy. FOLLOW SMOKIN HOT BOOK BLOG ON: "}, {"Review": "4.5 Stars ⭐️"}, {"Review": "*https://mrsbbookreviews.wordpress.com3.5 starsThe king of contemporary romance fiction returns with a brand new love story titled, Every Breath. This is a love at first sight classic romance, that sees destiny play a huge role in shaping the lives of two individuals, Tru and Hope. Sparks describes his latest novel as ‘a classic story of lovers long denied’. I think this quote perfectly summarises what you can expect when you pick up Every Breath.The latest novel from Nicholas Sparks begins with Tru, a guide from Zimbabwe, who is called the US on a relatively short trip to connect with his biological father and learn more about his mother before his father passes away. Alongside Tru’s story is Hope Anderson’s journey. Hope is a woman who is unsure of where her life is going. She is in a relationship that doesn’t seem to be progressing, or making her happy. She also is faced with some tough choices in North Carolina, where she is visiting her ill father. Every Breath is the heart pounding story of how these two strangers fall quickly and deeply in love, but they face immense complications. A decision is made and the two go their separate ways, living on opposite sides of the world and inhabiting very different life paths.It is always a comfort to return to the writing of an author that you have followed for some time. I first began my love affair with the work of Nicholas Sparks back in 2012, where I read book after book of his work. I do suspect that my interest in his work began prior to 2012, when I first read The Notebook, a timeless love story. In Every Breath, the latest novel from Nicholas Sparks, we are reminded why he rules the roost in terms of contemporary romance. I can’t think of another male author that is able to capture to heart, feelings and emotions that Nicholas Sparks seems to so easily convey through the pages of his novel.So this time around, Every Breath introduces two protagonists who have their own troubles and colourful back stories. For Tru, his life in Zimbabwe really makes this novel stand out. The sequences featuring Tru’s life in Africa had me utterly entranced. Sparks does an excellent job of bringing this country to the pages of his novel. I felt like I had been transported to Zimbabwe in these scenes and many times I imagined myself standing there right beside Tru. This is perhaps an indication of the research Sparks has undertaken on this part of the world and his true passion for Africa. Then we have Hope. I enjoyed Hope’s story and I genuinely liked her as character. There were a few choices that she made that didn’t quite stick well with me, but I feel in the spirit of the book, it did work well. Through Hope, Sparks explores medical issues and an illness (I won’t say much more as I wish to avoid spoilers). I thought this aspect of the novel was handled with sensitivity and insight by Sparks.Apart from Tru and Hope, the other major character in this novel is the magical mailbox, ‘Kindred Spirit’, which is situated in the North Carolina setting of Every Breath. I have to say, as of fan of letter writing, this was a big drawcard for me. I also loved the fact that it was based on a real life story of a mailbox situated in an isolated location in the US. This letterbox has seen people freely drop letters in to those they cannot write or get a letter to, for reasons unknown. I just wished we had one here in Australia, it is such a touching gesture, especially in a world where the art of letter writing seems to be disappearing at a rapid rate. I loved how Sparks tied this idea into his novel, it worked well and it added another vital layer to the book.For those expecting a great romance from Nicholas Sparks, I don’t think you will be disappointed. For me personally, Every Breath wasn’t quite up there with my favourite Sparks novel, Dear John, but it was an enjoyable read. I will say that Every Breath is a book that will conjure up a variety of emotions; from happiness, to sadness, joy, frustration and it does leave you with hope. The love that surrounds Tru and Hope is one that is separated by time, life choices, ill-fated decisions and reconnection. It was nice to revisit this couple many decades after their first meeting. However, I would have loved to have gleaned more about their initial relationship spark, those magical five days of instant love on the beach in North Carolina captured my heart.Fans old and new will appreciate the classic romantic sojourn Every Breath represents, through the capable hands of master storyteller Nicholas Sparks. Every Breath is a really lovely story, with a beautiful set of characters.Every Breath by Nicholas Sparks is published by Hachette Australia. $32.99. Out now.https://www.hachette.com.au/nicholas-...* I wish to thank Hachette Australia for providing a copy of this book for review purposes."}, {"Review": "After six years with her boyfriend Josh, Hope Anderson is not sure what comes next. Far too often the relationship between her and Josh is one that fluctuates between on and off. She needs to decide what she wants and how much she is prepared to invest in a relationship that seems to be going nowhere. The other main character is Tru (short for Truitt) Wallis, a safari guide, who has lived for many years in Zimbabwe, a country he has no intention of leaving. That is, until a letter from a man claiming to be his biological father brings him to America. Both Hope and Tru end up at Sunset Beach at the same time and meet, thanks to a cute but disobedient little terrier called Scottie. This is Nicholas Sparks, so the reader just knows this will lead to further developments. Both Hope and Tru face some tough choices.I picked this book up because it was written by Nicholas Sparks and I have read and enjoyed most of his books. Starting in Zimbabwe seemed strange at first, though the setting is well described and probably as close to that country as I will ever get. It soon changes to the more familiar American landscape. This is vintage Sparks where people fall in love quickly and deeply. If you can’t accept that premise then you will probably struggle with this book. For those of us happy enough to accept this, it begins a love story that has more than its share of heartache. This is Nicholas Sparks after all! There are some aspects that are not going to appeal to some people like the Kindred Spirit mail box, and no, I am not going to explain that. Just know it plays a pivotal role in the story. But all in all, this is what Sparks is best known for - a love story. It is also a story of family love as well, of choices and consequences. I struggled with Hope and her choice at one stage. Still, overall it was an enjoyable read with light hearted moments and moments of sadness and struggle. Maybe it helped that I was relaxing near the beach at the time of reading this. It was easy to just drift along with the flow of the story as it unfolded. "}, {"Review": "I really wanted to give this 5 stars before I read it, because I love Nic Spark books. However, this one had just a little too much unbelievable sap for me. Too far fetched. I disliked the 20year fast forward as well. I’m both disappointed and pleased. I liked it in spots and I disliked it 🤷🏽‍♀️"}, {"Review": "Eeep - finally another Nicholas Sparks book!I just love his stories. A WALK TO REMEMBER was the book that started my reading addiction back in 2002 or somewhere around that time.Every Breath is really heartbreaking and sad and moving and hopeless but also full of hope and love and family and loss and ... so much. Full of all those beautiful and heartbreaking things a Nicholas Sparks book needs.☺We start with 42 year old Zimbabwe tour guide Tru. He's the grandson of one of the countries' richest men. But he left home to become a guide for tourists because he didn't much like his grandfather and step-dad. Tru has a 10 year old son with his ex-wife and an estranged step-dad and 2 half brothers who live in his grandfather's mansion.When he receives a letter from America, he decides to follow the invitation. It's a letter from his biological father. A man he never met. And he's dying. Off to North Carolina he goes. He wants to know about how his late mom met his father.And on a beach his first morning in America he meets Hope.She's staying in her family's already sold beach home for a friend's wedding that weekend. Without her boyfriend of seven years. He has to work. The whole relationship is a bit strained.And then she meets this interesting and handsome guy with all his amazing stories about african wildlife and she's immediately attracted. She's never been like this with anyone. And Tru is just as drawn to Hope. But both have so many family obligations and exes or current relationships and he lives in Africa and she lives here ... it won't be easy. But the reader has an amazing (aka heartbreaking aka crying rivers of tears) time reading about their journey to a hopefully happy end. But since this is a Sparks book ... we're not yet sure if there will be happy end. What we do know - or what I realized at the 13% mark when something was mentioned - is that it will definitely be a very sad and heartbreaking book ... but also a book so full of love and hope. I don't know what more to say. It's a Nicholas Sparks book, so you know what could happen, what might happen. BUT that doesn't mean you shouldn't read it. I loved and hated every single word. Such a beautiful love story. My heart broke a million times for ... Nope - I'm not telling you more about the story. I loved it. The End.☺\n♡ \n♡ \n\n♡ \n♡ \n\n\n\n \n \n \n \n"}, {"Review": "🔹The destiny that matters most in anyone’s life is the one concerning love.🔸- Nicholas Sparks“Demasiadas pessoas passavam as suas vidas a desempenhar um papel que pensavam que deviam desempenhar, em vez de serem simplesmente quem eram.”*“Too many people spent their lives performing a role they thought they were supposed to play, as opposed to simply being who they were.”- Hope Anderson* * *“Gostaria que as coisas tivessem sido diferentes para nós, mas parece que o destino fez outros planos. No entanto, tens de saber isto: o amor que sinto por ti é verdadeiro e toda a tristeza que vem agora com ele é um preço que pagaria mil vezes. Porque conhecer-te, e amar-te, mesmo por pouco tempo, deu um significado diferente à minha vida, e sei que será sempre assim.”*“I wish that things could have been different for us, but fate seems to have had other plans. Still, you need to know this: The love I feel for you is real, and all the sadness that now comes with it is a price I would pay a thousand times over. For knowing you, and loving you, even for a short while, has given my life a different kind of meaning, and I know it always will.”- Tru Walls* * *“É por causa de ti que agora acredito em milagres. Connosco, quero acreditar que tudo será sempre possível.”*“It’s because of you, after all, that I now believe in miracles. With us, I want to believe that anything will always be possible.”- Tru Walls * * *“Dava por si a recordar coisas que gostaria de poder mudar, discussões que deviam ter sido evitadas, palavras de perdão que tinham ficado por dizer. Uma parte de si desejava poder voltar atrás e tomar decisões diferentes, mas quando era honesta consigo mesma tinha dúvidas sobre o que teria mudado. Os erros eram inevitáveis, e concluíra que os arrependimentos podiam ser importantes lições de vida, se as pessoas quisessem aprender com eles.”*“She wished she could change, arguments that should have been avoided, words of forgiveness that had been left unspoken. Part of her wished she could turn back the clock and make different decisions, but when she was honest with herself, she questioned what she really could have changed. Mistakes were inevitable, and she’d concluded that regrets could impart important lessons in life, if one was willing to learn from them.”- Hope Anderson* * *Muitas vezes o amor está à espreita, pronto para desabrochar quando menos se espera.”*“Love often lies in wait, ready to bloom when least expected.”- Hope Anderson"}, {"Review": "\n\n“The destiny that matters most in anyone’s life is the one concerning love.” \nEvery Breath is a tear jerker. You have been warned!For the longest time, I resisted reading Nicholas Sparks novels. I had seen the movies like A Walk to Remember, Message in a Bottle, Dear John and The Notebook. So I knew his main characters either didn't stay together or one of them died. As a true romantic, this really hurt my heart. Then, I read The Longest Ride, See Me, and Two by Two and I became a fan of his storytelling.Every Breath took me on a journey full of destiny, hope, heartbreak and true love.Tru Walls is going to America for the first time. His biological father has sent him a letter and in it, he has asked Tru to meet him. The meeting will take place in North Carolina, in Sunset Beach. In Africa, Tru is a guide in Zimbabwe. Since early in his life, he has spent time in the bush. He was once married but currently divorced. He has one son he adores and he gets along with his ex-wife Kim. Hope Anderson has many things to think about. Her boyfriend of six years, an orthopedic surgeon is currently in Las Vegas. Over the years, he had a problem with faithfulness and they are currently on a break. Hope decides to go to his family beach home in Sunset Beach for the last time. The beach house is going on sale to save money to pay for his father's care who has recently being diagnosed with ALS. Hope will stay there and will attend the wedding of her best friend over the weekend. She's concerned and has no idea how to explain her boyfriend's absence. A chance encounter due to Hope's dog will begin a true love affair between these two souls. Hope will show Tru the magic of a place called the Kindred Spirit, and it will connect them forever. After reading, Every Breath, I'm dying to go to Sunset Beach and Kindred Spirit. Whoever decided to start it, had a great idea in the making. I can't end my review without thanking Grand Central Publishing, NetGalley and Nicholas Sparks for my copy of Every Breath. The cover alone is gorgeous. 4/5 FangsMrsLeif's Two Fangs About It | Facebook | Twitter | Instagram"}, {"Review": "2.5 starsEvery Breath is the first Nicholas Sparks book I have read. I wanted to love it but, unfortunately, I was underwhelmed. The author wants us to believe that Tru and Hope fall passionately in love after spending two days together. It is not entirely improbable, but to me it felt more like two strangers forming a wonderful bond of friendship rather than starting a romance. Any sparks are tepid at best, and the declarations of love come out of left field. The story is rushed, but it also seems to drag in places. Actual conversations with other characters are glossed over in favor of lengthy exposition. The huge time gap also hurt my emotional investment. On the positive side, Sparks does a fantastic job describing the charming North Carolina beach town where the bulk of the story takes place. I felt as though I could taste the salty breeze, feel the brisk air, and see the gorgeous sand dunes from Hope’s deck. The writing is on the sappy side, and while this should be a moving tale, I failed to connect with the story or the main characters on a meaningful level.\n*I received an early version of this book to voluntarily read.*\n\n"}, {"Review": "This book was just okay for me. Interesting enough to keep me reading but I never connected with the characters. And instead of finding their story wildly romantic, I found it way too unrealistic. Normally that doesn’t bother me but when even the conversations between characters seem forced and awkward, nothing hits home for me. I didn’t even shed a single tear for what I’m guessing was supposed to be the emotional bombshell at the end. First of all, I saw it coming and secondly, I just didn’t care enough for the characters to feel anything. Overall, I’m just left feeling disappointed.Was it worth reading? Yes and no. Yes, because I've read every other book by Nicholas Sparks and feel compelled to keep reading them. A habit which I may have to force myself to break. No, because it was close to being garbage.Would I read it again? God, no."}, {"Review": "2.5 starsI'm annoyed by the fact that I don't hate Sparks' books even though they annoy the crap out of me more and more. Yet I keep reading them. Wtf, Kelly? Get your shit together.My main annoyance with this one was the woman basically stayed with her shitty boyfriend instead of the hot African dude solely because she wanted children and Mr. Africa was sterile. So she gets her kids which end up barely getting mentioned because she's pining for Safari Sir for YEARS even though they had ONE NIGHT TOGETHER after knowing each other for TWENTY-FOUR HOURS because ERMERGERD LERVE.Second main annoyance was, and I quote, \"comfortable strappy heels\". Has the author worn strappy heels and found them comfortable? THEY AREN'T COMFORTABLE, NICK."}, {"Review": "I’ve been pretty critical of Nicholas Sparks’ last few books. I have always admired his novels and credited him for being such a force in the Romance genre, as a male author I think it is so unique!! I’ll probably repeat myself again but when he wrote The Notebook, Message in a Bottle, The True Believer duet, nights in Rodanthe, his memoir 3 weeks with my brother - he really upped his game, those were all my favorites!!! And I have to remember that all authors have their set of phenomenal books, and then the really good set, and then the OK set. With that being said, I think this book was very true to Nicholas Sparks. I think it will appeal to the Sparks’ fans and anyone who enjoys the mainstream romance genre. This story was sweet and I always enjoy his Carolina setting, complete with walks on the beach!! I found the Author’s note in the beginning, that told the back story to how he created this novel, to be VERY COOL!!!( that part narrated by Sparks on the audio) And I really did love the characters in this book. But this really was a 3.5, just a little better than OK for me as a romance novel. I just didn’t find the insta-love very believable, and it just lacked the “It” factor, as it did drag a little bit. I think the mystery of the story is really what helped me stay in it!! Overall enjoyable and I am glad Sparks is back in a normal bookplace for me!!"}, {"Review": "The saccharine sweet, endearingly romantic Nicholas Sparks is back with his latest novel, “Every Breath”. Hope has retreated to her parents’ cottage in North Carolina, to prepare for the wedding of her best friend and to think about her life. Abandoned by her long-time boyfriend, she desperately wishes for a child and begins to question her life choices. Tru Walls has been working on an African game reserve most of his life, when out of the blue, he receives a letter from his biological father, a man he has never met, summoning him to North Carolina. When Hope and Tru meet there is an instant connection, but both of them become increasingly aware that their time together can be short lived. This novel is different than others Sparks’ has written, but it is strikingly similar in many ways as well. As stated by the author himself, Sparks got the idea for this novel from an actual real-life event  (although the novel itself is still, ultimately, fiction) . Also, Sparks narrates both the prologue and the epilogue to “Breath”, infusing it with his own experiences researching this novel. This is not a new method and has been used by many authors in the past, but it is something that Sparks’ readers may be unfamiliar with. Readers, however, will find similarities between the plot of this novel and others from Sparks’ history. The reunited lovers’ storyline strikes comparisons with “The Best of Me”, and memories of “The Notebook” are evoked in Hope’s choice between the two loves of her life. Hope was far too relatable for me  (same exact age, same exact relationship struggles)  so this novel may have been a little too difficult for me to read in parts, but it has nothing to do with Sparks’ creativity as a writer. Hope and Tru were both delightful, if somewhat naïve and simple, and I thoroughly enjoyed the detailed descriptions of life on the African Savannah. “Every Breath” starts sappy, and ends sappy, and has a whole lot of unbelievable sappiness in the middle but it is nothing that Sparks’ readers are not familiar with. Some parts were hard to swallow for a cynic like me, but it wouldn’t be a true Nicholas Sparks novel if there were not parts full of downright emotional romantic sap. No doubt, it will be developed into a film that I  (of course)  will watch and will (of course)  cry like a baby throughout. Although “Breath” is not comparable to “The Notebook” or even “Message in a Bottle”, it will definitely provide enough romance to satisfy. "}, {"Review": "\n\n“It’s because of you, after all, that I now believe in miracles. With us, I want to believe that anything will always be possible.”\n\nI remember the first Nicholas Sparks novel I ever read. I was in 6th grade (2003) and I picked up A Walk to Remember at Walmart. It was the movie tie in cover, with Mandy Moore and Shane West holding hands— which I still have to this day. I read the whole book that night and begged my mom to buy me the movie, and thankfully, she did. I think I watched that movie every day for the whole year.After reading A Walk to Remember I caught up on the author’s backlist and would read every single new release the day it came out. It’s safe to say that Nicholas Sparks became one of my favorite authors. So know before I say this that I have a long history of love for this original storyteller. But I feel that the last two books by Sparks have been a letdown. Two By Two and See Me were so disappointing and it almost felt like a different man was writing these stories. I almost lost hope in finding another timeless novel by Nicholas Sparks until I picked up Every Breath.Every Breath reaffirmed my love for Sparks’ novels and proved why his stories will always hold a special place in my heart. I smiled, I laughed, I cried, I got angry and upset… all the emotions that a Sparks novel should make you feel— I felt. So if you’re like me and have been let down by his last two releases, pick this one up. You’ll fall in love with this author’s writing all over again. One thing that was particularly interesting to me was how Sparks got his inspiration to write this story. While it is a work of fiction, it’s based on a true story. With permission from the characters he told a unique story of love and loss. I’m going to put in the official synopsis here so I don’t write anything to spoil the story:Hope Anderson is at a crossroads. At thirty-six, she's been dating her boyfriend, an orthopedic surgeon, for six years. With no wedding plans in sight, and her father recently diagnosed with ALS, she decides to use a week at her family's cottage in Sunset Beach, North Carolina, to ready the house for sale and mull over some difficult decisions about her future.Tru Walls has never visited North Carolina but is summoned to Sunset Beach by a letter from a man claiming to be his father. A safari guide, born and raised in Zimbabwe, Tru hopes to unravel some of the mysteries surrounding his mother's early life and recapture memories lost with her death. When the two strangers cross paths, their connection is as electric as it is unfathomable . . . but in the immersive days that follow, their feelings for each other will give way to choices that pit family duty against personal happiness in devastating ways.Illuminating life's heartbreaking regrets and enduring hope, EVERY BREATH explores the many facets of love that lay claim to our deepest loyalties -- and asks the question, How long can a dream survive?From the characters to the setting to the beautiful words— I loved everything about this novel. Thank you Nicholas Sparks for creating another amazing story that will stay with me forever. It won’t be long until I revisit Tru and Hope at Sunset Beach."}, {"Review": "Romance novels aren’t really my genre but I’ve heard a lot of good things about Nicholas Sparks and thought it was time to try and read a novel by him. That’s not the only reason I picked this book, but also because the story seemed really nice and it seemed like something I would enjoy reading. What I liked most about this novel is that it’s a true story and it’s just such a cute little romance novel with an equal amount of sad moments involved. It’s so pure and Sparks writes so beautifully it’s enchanting. I did enjoy the storyline, loved the characters, but mostly I loved their backstories. Each character had their own story and their own problems back home, but when Tru and Hope meet each other, it’s almost as if all those problems are forgotten and it’s just them and no one else. I loved the first half of the novel, but near the end, I found it to be a little too sappy, but then again it is a romance novel so I guess I had that coming. It was a great ending to a beloved story and I very much enjoyed Sparks’ writing.Many thanks to Hachette Book Group and Grand Central Publishing for giving me an advanced copy of this novel in exchange for an honest review."}, {"Review": "My least favorite Nicholas Sparks book for sure. The story begins with what you believe is Nicholas Sparks finding a letter at Kindred Spirits in North Carolina. He feels like he must find this person to talk to first get their full story then to them about possibly writing a book on this story. He ends up getting permission, and the story officially begins. This book was insta-love which I really dislike. I felt like the book was incredibly rushed and didn't connect to either of the characters. The book was 2 stars until you find out in the epilogue that the entire story was made up. Nicholas Sparks never found a letter and searched for the author. That was all part of the \"story.\" "}, {"Review": "If you want a good love story, set in recent times, then you reach for Nicholas Sparks. This book will probably be considered one of his best books. It is obvious to this reader that tremendous time was invested in its researching and composing this story. The characters are interesting and their story is intriguing. Sparks excels at creating atmosphere as well. This story has movie potential and I would not be surprised if the sales are high that sharp producers may consider this a slam dunk!For me, this story is on par with \"A Message in a Bottle\" and my all time favorite by Sparks, \"A Walk to Remember\".I would not be surprised if those who embrace the love story genre give it 5 stars, in the past that would have been the case for me as well. So, the 4 stars reflects my connection to the book and may not be the best barometer. If you read one love story this year, this is definitely one for consideration."}, {"Review": "I can always rely on Nicholas sparks for a beautifully written love story, one that makes me cling to every word cry and laugh and just never want to put the book down and miss the characters as soon as I close the book when I’m finished reading. Every breath introduces us to Tru Walls who travels from Zimbabwe to North Carolina to meet his biological father. Here he meets Hope Anderson. The five days Tru and Hope spend together will forever change their lives . This book was heartwarming and also gut wrenching. It’s a love story full of hope , sacrifice and miracles until the very last page. Nicholas Sparks is truly the master of romance and heartbreak. The book is centered around a real mailbox in North Carolina people come from all over to visit the mailbox and to read the letters inside, I absolutely love this part of the story. I highly recommend this book and give it five stars. This is definitely a book you can curl up on the couch with a blanket and fall in love with every word and connect with each character. "}, {"Review": "5 stars 🌟!! The destiny that matters most in anyone’s life Is the one concerning love... 💗 Son of a Safari.... Nicholas Sparks... you slay me Every.Single.Time. From the first line, I could not put this book down, I devoured it. I was once again transported into this beautiful place you created with your magical words and imagined being inside this story right along with the characters. This was such a timeless romantic story that leaves you remembering his earlier works, such as A Walk to Remember and the Notebook. I smiled, I laughed, I ugly cried and just loved the feels this book gave me. Hail to the King of Romance you have once again blessed us readers with a beautiful, well thought out, love story! Tasteful stories of TRUE heart felt love without all the Smut are so hard to find these days!! "}], "Genre": "Romance", "ID": "38212843", "Desc": ""}