{"Name": "The Accidental Beauty Queen", "Image": "https://images.gr-assets.com/books/1523875162l/38532229.jpg", "Reviews": [{"Review": "Favorite Quotes:Ginny chose this life, just as surely as I chose mine. She also gets paid more for one sponsored Instagram post than I make in a week, and when I remember this, I keep my sympathy in check.The Hogwarts T-shirt I’m wearing might as well be an invisibility cloak… I’m here for the chance to stay in Ginny’s luxury hotel room for a week, for free, and completely nerd out at the Wizarding World of Harry Potter. I’m also here for moral support, of course. I plan on being at every single pageant event, cheering like a maniac while inwardly cringing in horror at the very thought of prancing around in only a tiny swimsuit and a crown.I prefer the scent of ink on paper and old library books to perfume. And while I want to see world peace happen, I’m not convinced that a real-life Barbie can hasten it by uttering those words into a microphone.Her complexion is covered in red splotches and she looks weirdly out of proportion, almost like a Picasso painting.I’m so totally in over my head. Last week I was shelving picture books and now I’ve got more secret lives than I can keep up with. I’ve somehow become the beauty pageant version of Jason Bourne.My Review:I loved this adorable and cleverly amusing tale. The writing was refreshingly crisp and laden with smart wit, skillful levity, and heart squeezing and insightful observations. I was quickly enamored with Ms. Wilson’s agile word skills and was soon fully invested in her smartly written, delightfully humorous, and well-crafted tale. This was my first exposure to Ms. Wilson’s genius and was an immediate smitten kitten and instant fangirl. "}, {"Review": "What originally sparked my interest in this book was the cover. I just think the cover is so cute! The Accidental Beauty Queen is a cute, light, and fluffy read. This isn't the most original story and was predictable but it still was an overall easy and fun read.Let's meet the twins Ginny and Charlotte. These girls couldn't be more opposite. Charlotte is a shy librarian and Ginny is outgoing competing in beauty pageants. Charlotte decides to take a vacation to see her sister compete in an upcoming beauty pageant. Unfortunately, Ginny comes down with hives at the last minute and Charlotte is forced to take Ginny's place in the competition. I was reminded of Miss Congeniality a little bit in this one and was very heavy with Harry Potter/Jane Austen jokes. I'm not sure how I felt about this? I think it was bit overboard with all the references to H.P and Jane Austen. There is a romance aspect to this novel... but wasn't the focus of the novel. The scenes between Charlotte and Gray were so mild and was disappointing. I feel that Gray's character was a bit underdeveloped and was hoping to see their relationship flourish more. I'm not a believer of a falling in deep love over a 2 day period? This kind of annoyed me. I feel the romance side barely touched the surface here. Which maybe was the author's intention?Overall, this was a cute and fluffy read. 3.25 stars rounded up. Thank you to Netgalley and Gallery Publishing for the opportunity to read this arc in exchange for my honest thoughts.Publication date: 12/4/18Published to GR: 10/30/18"}, {"Review": "The Accidental Beauty Queen by Teri Wilson is a fun, light-hearted breathe of fresh air romantic comedy. This one actually had a bit more to it with a theme of discovering one’s self and connecting with family plot along with the romance when a set of identical twins swap places.Charlotte and Ginny Gorman are identical twins but completely opposite in every way they can be. The sisters had lost their mother at an early age and Charlotte had gotten close with their father gaining a love for learning and books while Ginny began to idolize their beauty pageant winning mother.Now at twenty nine Ginny is signed up to compete in the Miss American Treasure her mother had won years before one last time before she is too old to join. Charlotte has decided to use her vacation time to join Ginny in Orlando and root her on, oh and visit Harry Potter world too of course.Unfortunately for Ginny when the girls share a meal Ginny becomes allergic to something in the food and swells up tremendously to where she can’t compete. Seeing her sister’s dream in danger Charlotte agrees to step in for a few days but never expected to find herself falling for a judge.From the moment Charlotte arrived in the opening pages until the very end this one was just a ton of fun. It was so nice to have the whole competition environment but with all the contestants supporting one another instead of fighting or bickering. And I will say Buttercup/Fang stole the show quite often in the story too, adorable. The romance is mostly light flirting while the rest of the plot takes the forefront but definitely enjoyable to follow too.I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"Review": "Tl;dr: A short, sweet contemporary that's got a romance but better still, is refreshingly women positive.I admit, I expected The Accidental Beauty Queen to be a quick, easy read. And it was, but unlike so many \"chick lit\" novels, or even (sad to say) many contemporary romances, this one was refreshingly devoid of any \"beautiful=ugly on the inside\" female characters.The gist: Charlotte and Ginny are identical twin sisters, but Charlotte is an elementary school librarian (librarian yay!) and Ginny works the beauty pageant circuit (and rakes in the dough via her sponsored Instagram content, natch) -- and at first, I thought, oh great, a smart trumps pretty story. Sort of interesting with the whole identical thing but yet...And then something interesting happens. When Charlotte has to enter the pageant in Ginny's place, she finds out that a. being in a beauty pageant is more than just the requisite makeover scene-- it's actually not that easy. And it's not awful! In fact, all the contestants she meets are nice, smart, and best of all, supportive. What could have easily been such an easy out--Ms. Wilson doesn't take it, and I applaud her for it.Instead, the drama comes from Charlotte herself, as she finds herself falling for someone she shouldn't and feels terrible about lying even as she continues to do so. (Side note: Ginny says her favorite book is Fifty Shades of Grey (am I the only person on the planet who hasn't read it??) and the main male character's name is Grey. I lol'ed over that because even I know the main male character in Fifty Shades is named Grey something and this seemed like Ms. Wilson taking a gentle swipe at the books.)(That was a long side note, I know!)Anyway! The romance is G rated, PG at most, and predictable, but honestly, who doesn't like a easy going romance once in a while? And bonus, not outside angst from a bautiful-yet-mean woman, whoo!This is going to go over well with fans of Sophie Kinsella, Bridget Jones's Diary (which is now over 20 years old!!), possibly The Hating Game, as well as fans of The Kiss Quotient who don't mind a fluffier read.Sweet but not cloying and another yay! for the female positivity. Very cute."}, {"Review": "Ginny and Charlotte are identical twins. Although they look alike, their lives have taken very different directions. Ginny spends her time competing in beauty pageants and has worked hard to achieve some success. Her goal is to win the upcoming Miss American Treasure pageant- a title previously won by her mother. Charlotte is more introverted and is happy working as a librarian where she can enjoy her precious books. With little social overlap, the two sisters are not as close as most twins. Charlotte decides to spend her vacation by supporting Ginny at the pageant. The night before the competition, Ginny breaks out in hives on her face from a food allergy. Rather than withdrawing, the sisters swap identities and Charlotte makes her secret beauty pageant debut. In the process, she makes surprising discoveries about herself and moves forward to repairing ties with her sister.This was another fun novel by Teri Wilson. I was first introduced to her books in The Royally Roma series. The Accidental Beauty Queen was not only a book about pageants but about sisterly love and rivalry. "}, {"Review": "Love love love!!! What a fabulous story. ~~~~~~~~~~~~~~~~I had so much fun reading this great story. It’s a bit of a rom-com but mainly it is a humorous look at the life of a beauty queen and her twin sister.How can two sisters be complete opposite’s? As with any siblings we all have our own personalities. But these two twin sisters are close to being complete opposite’s, at least in the lifestyle portion. But what would you do for your twin?This story was a riot. From the crazy Frenchie dog to the secret trysts, you cannot help falling for this story which is a bit reminiscent of Miss Congeniality - without the FBI, or Sandra Bullock.Teri has definitely brought us a winner with this charming, delightful, and realistic look at beauty pageants, aka scholarship programs, and the deep family connection that makes us question our mental state. But the winner does take home a fabulous parting gift of a sweet and tasty hottie! Score!* copy received for review considerationfull review - https://amidlifewife.com/the-accident... "}, {"Review": "This is the exact kind of read I need between all my twisted thriller and horror. Something light and fluffy - and yet somehow got me emotional. What the hell, Wilson?!Look, I'm gonna be straight up. This book is predictable from beginning to end. But you know what? WHO CARES! Twins. Both have their strengths. One seemingly shines brighter. They trade places... things go wrong. An absolutely addictive read and while I never wanted a French bulldog before, I kind of do now... and name him Fang!At times, I felt it read a bit YA. I don't know if it's because of the beauty queen thing that for some reason makes me think of younger girls rather than adults most of the time or the sister rivalry or exactly what kept making me feel this way. I had to keep reminding myself that they were adults. Oh, but excuse me while I get some ice.. because apparently every time I got to a hotel room I'll be going out to get some ice from now on and … well, you'll just have to read this book.I got a warm feeling in my chest when Where The Red Fern Grows was mentioned because it's my all time favorite book and quite frankly, any author who can reference that, somehow put together a heart warming contemporary romance that actually got me a little misty eyed at the end... Well shit. I'm done. Fork. Timer going off. Done. I really do wish real life emulated books sometimes. Yeah, I'd definitely recommend. Hi Wilson, you just made a new fan. Thank you Gallery for this fun read!"}, {"Review": "My love for Hallmark movies is no secret, and when I saw that Teri Wilson had been involved with several particularly wonderful Hallmark films, I knew I had to read this book. I was expecting something light and fun, but still sweet and thoughtful, and Wilson more than met my expectations.• Pro: I loved Charlotte. She was a bookish, nerdy librarian. How could I NOT love her? • Pro: The exploration of sibling relationships is something I always enjoy, and this one was made that much more interesting by involving identical twin sisters and a really BIG secret, that was hampering their relationship. • Pro: Grey was such a wonderful and swoony hero. Not only was he a billionaire, but he was also a literature lover. I was as dazzled by him as Charlotte was when he spoke Darcy to her. • Pro: I am telling you, the pageant scenes gave me this awesome Miss Congeniality vibe. They were fun, and I liked that Charlotte started to see this world in a different, more positive way. I loved the sisterhood side of the pageant Wilson exposed, and I always like seeing women supporting women. • Pro: This was quite a journey for Charlotte. She not only learned a lot about pageants and her sister, but she learned a lot about herself, and I really enjoyed getting to see her evolve over the course of the story. • Pro: There were all these little things that delighted me in this book. From butter beer to Buttercup, the adorable French Bulldog, I found all these little touches that added to my enjoyment. Overall: This book was sweet and charming, as well as hilarious and heartwarming. I smiled, I laughed, I shed some tears, and in the end, I was left with a smile on my face and a full heart. *ARC provided in exchange for an honest review. BLOG | INSTAGRAM |TWITTER | BLOGLOVIN | FRIEND ME ON GOODREADS"}, {"Review": "A cute fluffy book great for fans of romantic comedies, Miss Congeniality, and plots revolving around twins switching places. Charlotte's identical twin sister is competing in the Miss America Treasure pageant when she suffers an allergic reaction. She convinces her shier, more homebody twin, Charlotte, to take her place in the preliminaries. There is a romance the buds between Charlotte and a guy she meets at the hotel that adds to the story, but ultimately this felt more of a quirky, adult coming-of-age story.Near the beginning I did struggle with Charlotte a little as even though she is 29 she sometimes felt 21. I found her sister, Ginny, to be selfish and single-minded although she did redeem herself in the end. I liked that Wilson didn't make all of the contestants vapid and shallow, but instead gave them more faceted personalities.Although at times this felt a little childish (or maybe like a YA novel with adults), overall I enjoyed the story and characters."}, {"Review": "If ever a book was begging to be made into a movie The Accidental Beauty Queen is it! It was an absolutely adorable read and would be more than ideal as a rom com movie, it was perfection in my eyes and I’m so glad I read it before making my best of the year lists because this will definitely be on it!This uses quite a few classic and well loved tropes that we’ve all seen before, but somehow Wilson manages to breathe fresh life into the story in such a charming way. Identical twins switch places, of course it goes horrible wrong along the way, but it was just so damn cute I didn’t even care that I knew exactly how it would end early on. That alone speaks highly of the authors talent, I was totally into this one hardcore, from beginning to end and truly enjoyed every single page of this beauty. Highly recommended for rom com fans, it’s a must read and I guarantee you’ll finish with a smile on your face!The Accidental Beauty Queen in three words: Sparkly, Funny and Light."}, {"Review": "Once again, I wanted something light, romantic and hopefully funny. Did this novel succeed at fulfilling my needs?Why yes. Yes, it did. I was actually pretty blown away by Teri Wilson's writing! The story is told by Charlotte, the nerdy twin, who takes her sister's place in a beauty pageant after an unfortunate mishap. This actually makes for a very interesting point of view since we get the perspective of a person used to knowing about pageants, but not being an actual part of it until now. Sure, there are some occasions where the importance of looks is mentioned, but the author also challenges this. Loved it!Then we have Charlotte's unique voice. Like I said, she's the nerdy twin. A librarian who lives for books, loves books, breathes books and has a whole lot of shirts with literary quotes on them. You could safely say she stole my heart right from the start.That's not even mentioning the growth she accomplishes as a character! I really admired her and the way she started seeing things differently, opening up to a world she always ignored, started accepting truths about herself and her past. All this combined made for a beautiful evolution of both her character and the relationship with her twin sister!There's a very clear focus on their relationship throughout the entire story. They have a past, there are secrets between the twin sisters and those are waiting to make an appearance. It adds so much to this story and makes it more than \"just a love story\".The other character I truly loved? Well, the love interest of course! He uses literary quotes quite a few times and, as Charlotte, I just felt my heartbeat speed up. Not even ashamed of it.The only thing I wish was a bit different, is the evolution in their initial attraction towards one another. It's there, and you can feel it.. But I wish it would've had more obvious progression instead of jumping from one thing to the next? Could be me looking back at my reading experience though, since it didn't really bother me at the time of reading!This simply was the perfect read at the perfect time for me - which made me enjoy it so, so much! Although it isn't a new favorite, it definitely brightened my day and gave me exactly what I was craving. I loved all the literary quotes, the romantic aspect and the relationship between the twins!Definitely going to check out more work of this author - that's for sure.4,5 / 5!"}, {"Review": "The Accidental Beauty Queen is a light and quick read with cute and quirky characters that I could totally see playing out on a movie channel. You have the mousier twin who never quite measures up to her beautiful beauty pageant-loving sister, the trading of places when one is too (temporarily) disfigured to compete, and the hilarity that ensues from said switch during the competition. It’s a made-for-TV movie waiting to happen.The identical twins are 29 years old, live completely different lives, and couldn’t be more opposite if they tried. Charlotte joins Ginny in Florida to support her mission to win the Miss American Treasure pageant, hoping for a Harry Potter-filled vacation from her life as a children’s librarian. What she didn’t expect was to be roped into helping Ginny make it into the finals by pretending to be her. While Ginny lives and breathes pageants, Charlotte is introverted and shies away from the spotlight. However, Charlotte learns a thing or two about herself and her family as she is primped within an inch of her life while trying not to look like a baby giraffe on stilts.I enjoyed the dynamic between the sisters, along with learning their family history and why pageant life is so important to Ginny. While there is a minor, fade-to-black romance with a handsome, literary-loving billionaire, it isn’t the primary focus of the story; overcoming sibling rivalry, learning to move on from the past, and the importance of the sisterly bond is. The Accidental Beauty Queen is a refreshing take on the Parent Trap switcheroo scenario with lots of Harry Potter and Pride and Prejudice thrown in for good measure. With several heartwarming and laugh-out-loud moments, I recommend it to anyone looking for a light and spirited read.▸ ARC generously provided in exchange for an honest review.▸ Purchase: Amazon US | Paperback | Kobo | Apple Books | Nook▸ For more reviews, visit http://www.totallybex.com\n"}, {"Review": "Okay, imagine that Miss Congeniality, The Parent Trap and Pride and Prejudice had a sleepover and combined into a rhinestone encrusted story about an identical twin coerced into taking her sister's place in a beauty pageant.Is it awesome?It's awesome.Charlotte is a children's librarian (score) and her sister Ginny is a beauty pageant queen and Instagram influencer. Ginny has a whole hell of a lot of personality, and I like that there was a lot of sister bonding and girl bonding and all of the contestants were genuinely nice people trying to make the world a better place. Seriously. There is not one catty girl moment—it's all uplifting, even the dreaded swimsuit competition.And there's a love interest! Who—don't get me wrong—despite being my least favorite part of the book (handsome, billionaire, suave, a little one dimensional) was still swoony, upstanding and surprisingly ethical for a handsome tech billionaire.And of course the makeover moment, with its many shout-outs to Anne Hathaway (I agree with Charlotte—why do movie people keep trying to make her over?? She's gorgeous), which is basically this without the gun, Victor or a team of highly skilled professionals:It's light, it's fluffy, and sure it's a little optimistic on the abilities of an inexperienced dog trainer, but there's Harry Potter and Pride and Prejudice quotes, and did I mention that a children's librarian is the main character?A children's librarian?Granted, all the stereotypes of librarians as plain, non-make-up wearing spinsterly bookworms are played up to the hilt, but still—A book about a librarian.WITH MISS CONGENIALITYI received this ARC from NetGalley for an honest review."}, {"Review": "Ah, this was fun!I'd rate it 3.5, though.Charlotte has a twin, a beautiful and popular twin who's broken up her most recent relationship when Charlotte overheard the guy confess he was just waiting to do the switch. Ginny is so different from her, she's in every pageant and usually goes far. That's what's so tragical about her getting her face all blotched after an allergic crisis. In the end, Charlotte needs to step up and become Ginny for a few days in other to make sure her sister classifies for the final round of this last-chance pageant.I was very into this plot and requested to read the ARC the same second but then I found out I had read a previous work from the same author and wasn't a big fan of it. So maybe my expectations weren't the highest. And yet, it proved everyone deserves second chances. This was a very entertaining pleasure read.There is a bit of Miss Congeniality inspiration but it's very mild. There's no crime being investigated and neither is Charlotte from the police. But I liked living for a bit in the backstage of a beauty pageant, I even wished there were more scenes like that even though the book is full of them.The romance is more of a subplot, and it's also drunk from elsewhere waters—Pride and Prejudice, in this case. I really like the not-knowing-each-other's-real-identities trope and wish there was more of the couple, but I also think there was a high chance the book would become just like all other romances. So let's say the writer knew the ideal dose not to spoil it all but still leave us wanting. And kudos to him, I approve his reactions to everything going one there.This book doesn't go too deep and it's no innovation of any kind, but neither does it sell itself like that. It definitely fulfills what it was made to and shouldn't disappoint. It could have been funnier, it could have been less forgettable, but it was a nice read.Honest review based on an ARC provided by Netgalley. Many thanks to the publisher for this opportunity."}, {"Review": "Humor and digs fly when two sisters attempt to win a beauty pageant with an Accidental Beauty Queen.Charlotte is resigned to never being the pretty sister. Her sister, Ginny, has followed in their mother’s footsteps in the pageant world. Charlotte followed in their father’s footsteps by being a reader and a primary school librarian. There is no need for bedazzling, hair extensions or even makeup in Charlotte’s world.When Ginny invites Charlotte to share her hotel room during the Miss American Treasure contest in Orlando Florida, Charlotte is overjoyed for the chance to visit the Harry Potter theme park. However, the second evening, Ginny has an allergic reaction that swells her face threefold. Ginny convinces Charlotte to pretend to be her in the prelims because the two sisters are (wait for it...) identical twins.The author does a great job making light of the easy comparison to Miss Congeniality. The makeover scenes are hilarious. When an attractive man sees the real Charlotte under all the glam, things get all Pride and Prejudicey. It is a great mashup—both literary and chick lit at the same time. The Accidental Beauty Queen is highly recommended to anyone looking for a fun happy story. 5 stars!Thanks to Gallery Books and NetGalley for an advance copy in exchange for an honest review."}, {"Review": "Thank you to Net Galley & Gallery Books for a copy of this book in exchange for my honest review. #partnerCharlotte Gorman is an elementary school librarian, who is a huge fan of classic books & Harry Potter. Her twin sister, Ginny (a beauty pageant contestant famous for her Instagram presence) won't stop competing until she wins the title of Miss American Treasure. Ginny invites Charlotte along as a good luck charm (and for some sisterly bonding time), but their plans get completely blown up when Ginny has an allergic reaction the night before the pageant begins. With her face completely swollen and unable to compete, she convinces quiet, bookish Charlotte to step in for her & compete. Charlotte has tons of ideas about the pageant world & what it's like, but comes to find out the contestants aren't as silly as they seem. A chance encounter with a handsome man & his dog leave her reeling, and Charlotte discovers that the crown (and her sister's reputation) may not be her only motivation.I thought this book was adorable! It had so many wonderful bibliophile references, and I loved that Charlotte would've fit right in with bookstagram - Harry Potter & Jane Austen are both referenced on multiple occasions, and she talks about her TBR stack! While this was a fun & lighthearted read, I also loved that the sister relationship was explored. There are so many books out there where relationships are fractured, so I loved seeing sisters that loved each other so much. This book was so sweet & easy to read! I loved the behind the scenes of the pageant world. This is definitely worth reading!"}, {"Review": "Upon seeing the cover and reading the synopsis of this novel, I knew I had to include it in my TBR pile right away. I'm so glad I did, as I really enjoyed it. I even included it on my 2018 favorites at Chick Lit Central.The Accidental Beauty Queen was such a fun and refreshing story. I easily connected with Charlotte and had such a great time seeing the pageant through her eyes. There were a lot of funny and entertaining moments, as well as some steamy ones. I even got teary-eyed at times. Even if you're not into watching pageants (like yours truly), you'll still be enthralled with this story and want to hug the book afterward! Movie casting suggestions:Charlotte/Ginny: Tori Anderson (She could do the Parent Trap thing.)Gray: Justin Hartley"}, {"Review": "I was looking to take a break from my usual murder and mayhem and listen to something light, fluffy and fun. Teri Wilson's newest novel, The Accidental Beauty Queen, was the perfect fit.Charlotte loves her job - she's an elementary school librarian. Her identical twin Ginny has made beauty pageants her life's work so far. She's desperate to win the one elusive crown she's never been able to claim - Miss American Treasure. This is the last year for a chance before she ages out. When she suffers an allergic reaction to a face mask, she refuses to opt out. Instead......yup, you guessed it.....she asks her identical twin Charlotte to step in until she can participate. Which Charlotte reluctantly does.....I really liked Charlotte as a lead character. (And not just because she loves books and all things Harry Potter!) She's warm, funny and personable. I enjoyed her inner dialogue as she attempts to navigate the world of pageants - and more. The relationship with her sister, her family - and that judge on the panel. (And I laughed when I read the name of that judge - Grey Beckham - conjure up any mental images?) But most importantly - Charlotte herself.The Accidental Beauty Queen was fun for me. I always enjoy the yes/no/maybe so of a rom-com read. I enjoyed Wilson's spin on this and the unique setting. Not being familiar with pageants, I was surprised that the upper age limit for participation does indeed include those in their late twenties.Joy Osmanski (a perennial favourite of mine) was the reader. It's hard to explain, but her voice is fun and lively. Her reading is very expressive and she absolutely captures the tone of the book. Her voice matched the mental image I had created for Charlotte. It's clear, easy to understand, well enunciated and pleasant to listen to. "}, {"Review": "This book is exactly what I needed. Obviously like every actively literate person, I over-identified with Charlotte. I also didn't understand Ginny and her pageant obsession at all (although I started to get it when it became clear that it was her way to connect with their mom, who died when they were little). I do wish we had gotten more of Charlotte and Ginny, but I love what we did get. And I also love Charlotte's thing with Gray, and the way she became more confident. This book is total girl power, and I love how the contestants were friends and not competitors. This book reflects my experience with women, which is that we are awesome and help each other. (I am so tired of books where women do nothing but tear each other down.)If you are a fan of romantic comedies (or Miss Congeniality!), this is for you. There's a lot to adore about this book. "}, {"Review": "This was the first book I've read by Teri Wilson and it def. would be the last!! I loved this story of twins Charlotte and Ginny Gorman. Identical twins who are different in almost every way is a great storyline!Charlotte, quiet, librarian, agrees to come to Orlando to see her twin Ginny, gregarious, outgoing, compete in a beauty contest that their long dead mother won back in the 70's.What ensues is a mistaken identity trope that was at times hilarious, at times touchingly warm, and at times so insightful, that I had to finish the book in one sitting!I received an arc of this book when I went to a recent romance writing conference, but as I've said, I will now be looking at Ms. Wilson's backlist!5 well deserved stars from me"}, {"Review": "Thanks to the publisher, via Netgalley, for an advance e-galley in exchange for an honest review!This is a quick, sweet read. The romance element is almost secondary to Charlotte's experience \"trying on\" her twin sister's life and navigating the pageant realm as a favor to her sister. The Goodreads description mentions this as \"for fans of Sophie Kinsella\", and I think that's an apt comparison- it's light, it's about relationships and self as much as it is about a romance, and it's just got a good heart to it. "}, {"Review": "Could The Accidental Beauty Queen have been any better? I was entranced from the beginning, from the book nerd to the beauty queen sister I just knew I was going to love this romantic comedy. I cried, I laughed and I swooned!The Accidental Beauty Queen was so much more than a romance novel, it had heart and passion and lies, love and humor. I had numerous Sandra Bullock, Miss Congeniality flashbacks and I just simply loved it. I loved watching Charlotte grow, from being narrow minded about the contestants to actually getting to know them. There is just something about character growth that makes me so happy.From the time that she, eventually almost selfishly, swapped places with her twin (which I love so much) to the when everything blew up in an epic way, I couldn't put The Accidental Beauty Queen down. I loved how real the sisters were that even when you are angry and upset with them you would still do anything for them so that they wouldn't suffer.Not only was the story great, but it's a clean romance, and that was so refreshing. I really loved that I got a break from the constant sex of so many romance novels these days, but I was still able to feel the love and connection between the leading couple. AND their french bulldogs!If you are looking for a fun, flirty, light-hearted read that still has the power to make you cry, you don't need to look any further than The Accidental Beauty Queen. "}, {"Review": "This was as ridiculous as you would expect based on the premise, but I did enjoy the book nerd protagonist, and it was a nice change from the dark stuff I’ve been reading lately. As mentioned above, I liked that the protagonist was a book nerd, though I felt like the author overdid the references to this a little. The love interest was likable enough, though I don’t feel like we really got to know him at all, and the relationship between the sister was a bit shallow. Honestly, I felt like the book felt a little shallow overall. The protagonist was supposed to have this epiphany. but this total change of perspective came after only a couple of conversations and was portrayed more by telling than showing. The world has come a long way since Miss Congeniality, and I’m not sure the climate is really right for this book right now. *I received an Advanced Reader Copy of this book from Indigo Books and Music Inc. in exchange for an honest review*"}], "Genre": "Romance", "ID": "38532229", "Desc": ""}