{"Name": "Drago", "Image": "https://images.gr-assets.com/books/1539903984l/40622772.jpg", "Reviews": [{"Review": "\n PopSugar 2019: 14. Un libro publicado en 2019 \nEsta es una de mis series favoritas de mafia por el simple hecho de que tiene a uno de los personajes masculinos que más amo en el mundo literario obvio hablo de ti precioso Lucca. Nunca me voy a cansar de leer más sobre él.Nunca es suficiente para míPorque siempre quiero más de tiMi corazón estalla por tu amor…🎵🎶Sorry pero tenía que fangirlear primero.Tengo dos moods para evaluar este libro:Si me pongo buena onda obvio el libro me entretuvo y hubo momentos que me hicieron reír, me encantó volver a ver a personajes que tanto amo y descubrir futuras tramasPero si me pongo picky me quedó a deber un montón. Este libro es más como de transición y no aporta nada relevante para la serie.Sentí la historia muy apresurada y no tan desarrollada como quería sentí que todo ocurrió demasiado rápido y cuando menos pensé se acabó el libro y quedaron cabos sueltos que si se hubieran resuelto en este libro agregándole más paginas la historia tendría esa acción de lo que careció el libro.Y en cuanto a los personajes esperaba muchísimo de Drago fue un personaje para nada desarrollado todo lo que dijeron de él no lo vimos porque el simple hecho que la autora no lo permitió.Esperaba un hombre oscuro, torturado con sed de venganza, capaz de intimidar y matar pero nada.En cuanto a Katarina la hermana de los Luciano, me agradó un poco más, era decidida, inteligente igual que sus hermanos es una sobreviviente del maltrato de su padre, a pesar de su juventud no la sentí inmadura.Ella le dio la frescura a la historia para que no se tornara tan adulta ya que esta serie se caracteriza porque sus protagonistas son jóvenes.Y como pareja tuvieron sus momentos buenos pero no me creí su enamoramiento pasaron de odiarse y no tolerarse y ya estar amándose o sea, wait When did it happen? Este libro tenía que ser un .5 y hubiera funcionado mejor.Ahora está la pregunta del millón ¿Cuál libro queremos que sea el siguiente? Aunque mi corazón obvio quiere a Lucca again pero una parte de mi sabe que tiene que ser el de María y Dominic.Aunque la mayoría de los votantes quieren a AmoMe emociona muchísimo saber que la autora tiene pensado otro libro para Lucca y saber que mis ruegos se hicieron realidad un libro no es suficiente. Quisiera que fuera el que cerrara la serie con broche de oro."}, {"Review": "Yeah, Shanny and I are giving one more chance to this author...simply because of Nero (Made men #1) even though, every single book that came after in the series was a disappointment for us both...I just hope this will be a turn around...*sigh*After all kinds of books I have read in my life, all kinds of genres, sub-genres, I have developed a palate for a certain kind of rush i seek in a storyline....It consists of several segments: solid characterisation that appeals to me on a layered level, gripping captivating plot, no nonsense, and over all, the book has to deliver an atmosphere of a sort, smth that speaks to me, rivetting and captivating that will stay with me for longer than a few minutes after I have read the book...This story was meh, delivering a simple re-telling of a slower paced plot, a mafia arranged marriage topic should at least hold intensity on a certain level if anything...but here, I dont feel it...any of it...Sorry😕"}, {"Review": "\n***3,5 \"Little Witch!!!\" stars***\n\n\"If you thought this was going to be a love story, where they fall in love the second their eyes met... you were wrong. This isn't it.\"\nHmmm.... Honestly, i don't know from where to start...My thoughts are all over the place...So, i will start with saying that i enjoyed and this book a lot, not like crazy as the first books in the series, but it was interesting...The only sure thing is that Sarah is having to write more stories about these people.... And they are many more....But i will cross my fingers and i will try with telepathy to make Sarah write next Maria's book!!! And I'm hoping with everything i have for her man to be Dominic Luciano!!! In this book, i loved him!!! A lot!!!Not as much as Lucca, noone will ever be better than this physco, but i loved him!!! Bahahaha....\n\"Payback wasn't a bitch. It was a fucking monster.\"\nWell, this book was about Drago... To be totally honest with you, i wasn't remembering him, but then... I did!!!! Drago was Boss's bodyguard and he had been shot 5 times when Lucifer took Chloe away in her book....Drago survived after all and after a lot of time had finally recovered...Now, he is seeking revenge and even if he didn't want it to be that way, the chance is giving to him by Luca.... He is going to married a Luciano and it is his choice to marry the Devil's daughter...\n\"Lucifer might have killed him, but it was Drago who 'd created the monster.\"\nCatarina is the Devil's daughter... A daughter whose father never really wanted her...Her brothers were her only shelter and her father's murder her only salvation...But without asking for, she is about to marry the enemy, in order to save her family...So what will happen with these two when hatred is what there is between them??? They had live in two different worlds and their age gape is big... There is a chance the hatred become love???\n\"The only way to scare him into not choosing you is by scaring him into thinking he could love a Luciano.\"\"Don't prove him right by being exactly how he thought you'd be, Katarina.\"\nTo be totally honest with you, i think that this was more Cat's book than Drago's...I liked them both, but still... something between them felt rush and incomplete... There were too many gaps, i think!!!!I liked Cat very much... I liked her story, even though it made me sad... I liked how close she was with her brothers, especially Dominic... I liked how easily was adjusted in Carusso's territory and to be friends with the rest of the crew....Drago was a good man... Very, very good, even though he was seeking revenge... His behavior toward Cat was wonderful most of the times.... He went an difficult phase in his life but he was the winner after all... Cat came to his life to change everything....They looked good together, but i was needed more of them... More time... More infos... more closeness.... More... More...\n\"Okay, fuck. He liked the little witch when she was nice and... a smartass. You know why? 'Cause she was his little witch now. Even id he didn't want a wife. But like Lucca had said, he'd chosen her, and boy was it turning out that he had chosen her for a reason.\"\nHalf of the book didn't have to do with the main heroes, but with the rest of the crew, and don't get me wrong, but i enjoyed it a lot... Especially, since Lucca and Maria was a big part of the book....Those two are my most favorite.... They are the most ruthless and the most intelligent... I just LOVE them...And i also loved that we learned more about Luciano boys... and now, I'm curious for each one of them... But as i told you above, I need Dominic's turn, ideally with Maria by his side... They would be... explosive!!!!And of course, I need to know who One-Shot is!!!"}, {"Review": "Thank god my office wasnt open today, cause I read this in one sitting. Wasnt as great as Lucca, and the romance took a back seat to \"the family\" drama quite a few times, BUT it kept me very entertained and I loved both MCs ANNDDDDD the book was safe. I'm very much looking forward to Maria and Dominics book, and I'm happy to see Amo is just as miserable as ever. Still loving this series and the world Sarah Brianne has built. Safety:Probably safe for most of the safety gangers out there...Hero (29) wasnt a manwhore *even though its mentioned he had experience*Heroine (18) was a virgin No OW/OM drama or other people after meeting. No seperationAbuse of the heroine in flash backs from her father. Hero hated the heroine at first but had his reasons, but the heroine held her on. Slow burn ---Pre review:Update: is this ever going to be released or nah? Waiting impatiently 😤Look. At. This. Cover. *swoon*"}, {"Review": "Honestly, I don't know how to feel. There was some things I liked, but in whole, I feel like it's missing something. Drago and Kat relationship... I don't think there was enough time to build it. It felt like there was hate/enemies/revenge and then forgiveness/moving on/love. Beginning and end but no middle, if you're getting my meaning. And I'm confused and dissapointed. Kat susposed to be 'mafia girl' but most of the time she came as new to this world with her reactions. I'm not sure how to explain it but I guess I expected her to be darker and badass. Either way, I'm not sure if it's me who expected more from snippets and teasers or authors 'badass girl' is different from mine. Or a bit of both. And I have to say this, because I'm sick and tired of everyone reacting to Lucca in that way. If you read previous books, you know of what I'm talking about. With each book I find him less and less scary and I'm getting more and more annoyed when everyone's shakes in theirs boots around him."}, {"Review": "Honestly, I don't know how to feel. There was some things I liked, but in whole, I feel like it's missing something. Drago and Kat relationship... I don't think there was enough time to build it. It felt like there was hate/enemies/revenge and then forgiveness/moving on/love. Beginning and end but no middle, if you're getting my meaning. And I'm confused and dissapointed. Kat susposed to be 'mafia girl' but most of the time she came as new to this world with her reactions. I'm not sure how to explain it but I guess I expected her to be darker and badass. Either way, I'm not sure if it's me who expected more from snippets and teasers or authors 'badass girl' is different from mine. Or a bit of both. And I have to say this, because I'm sick and tired of everyone reacting to Lucca in that way. If you read previous books, you know of what I'm talking about. With each book I find him less and less scary and I'm getting more and more annoyed when everyone's shakes in theirs boots around him."}, {"Review": "Έχω την αίσθηση πως το βιβλίο έχει λάθος όνομα. Ενώ συμπάθησα πολύ τους πρωταγωνιστές του βιβλίου, νιώθω πως η ιστορία τους πέρασε σε δεύτερο πλάνο κι αυτό το θεωρώ άδικο. Θα ήθελα να δω περισσότερο το ζευγάρι και λιγότερο την υπόλοιπη οικογένεια και την ανάμειξη των ηρώων από τα προηγούμενα βιβλία. Το διασκέδασα το ομολογώ και μου άρεσε ο κόσμος που έχει πλάσει η συγγραφέας, αλλά τελειώνοντας το αυτό που μου άφησε ήταν κάτι μισό και ανολοκλήρωτο. Ήθελα πιο πολύ Ντραγκο τον οποίο όμως είδα στη σκιά της ιστορίας."}, {"Review": "Spoilers!!!!First charapter made me almost Dnf. I still dont understand it. He was shot 5 times and was in a coma for some time, then woke up all weak from that coma. He was so broken because he got shot and was in a coma? Was he broken because he lost his muscles and size? He was not beaten, tortured like that first chapter might sound.. and 99% people dont dream in a coma. Why was he so broken and hell bent on revenge? Is it only me who finds it super weird, that those bad mobster people, who kill, cheat etc. Do the BAD stuff daily are so hell bent with underage drinking? More then once it is pointed out, that Kat can't drink because she is 18. They are mobsters, underage drinking should not even be on their radar.And to bring Lucca on so much, because his book was such a huge success. All kiss the ground he walks on, he is this larger than life person, smart, genius etc. ALL have inner monologues how smart Lucca is with his plans. Lucca here, Lucca there, always with his scemes. I'm fucking tired of Lucca. I just want to skim the parts with him (and god forbid more of acutal charapters in his POV in someone else book). I will vomit if i hear one more time how amazing Lucca is. I did like Kat, would liked her even better of she was a psycopath. Too bad she married a soldier, they are \"cannon meat\" and almost never die old :/first 30% book was quite good 4 stars, then after the marriage it kept dragging and that mysterious \"one-shot\".. yeah.. he will be dragged out for books also. I am sure. I had to force myself to read last pages. There was one bad sex scene at last 5 pages (did not seem virgin to me).Kids mob book.. maybe i am just used to steamy, hardcore, bloody, dark mob books.. Maria and Dominic book - hell yes, please! (But a darker read....)Amo book - hell no!!"}, {"Review": "WHAT HAPPENED?OH no! I've been waiting for MONTHS for this one and it was honestly the biggest disappointment of all times! WHHYY?First, the story is only 50% about Drago and Kat. That's it. Where is the healing process of Drago? Where is Kat beeing the soothing balm to his internal wounds? What happened to Kat having to bring Drago back to the emotional available status he should be in?It was clipped and short and not at all satisfying. I kept trying to stay enthusiastic about what's to come but it was escalating unreasonably. He didn't treat her like a man who has been tortured for months at the hands of his current wife's father should do. He was all protective and caring and sweet and doting husband from the first beginning when he ought to be real and just a little bit testy with her. Not that I condone such behavior - please don't think I'm Pro-violence- but it was the RATIONAL sequence of events. It was the instant acceptance in the Caruso family that raised my hackles too. I mean COME ON! They handed the books to Kat when she is clearly forcibly married to one of them and is the supposed enemy? This is NOT a real marriage people! How are you treating it as such?With that being said, I couldn't but have a flutter in my heart when Nero, Vin, Elle, Chloe, Lucca, Maria and the rest of the gang showed up and did their thing. I seriously have an actual lost love with Lucca and his frightening presence. Dear lord that's a fine boogieman alright.I really really really wish for a Dominic and Maria book, I think there's going to be an actual explosion through the pages and it will an absolutely delightful and exciting read! Can't wait!! "}, {"Review": "I’ve said it before and I’ll say it again. NOT ALL CHARACTERS DESERVE A BOOK! After Angel I felt that Sarah started swaying away from people who really mattered. Amo, Maria, Leo, Dante... Characters that we already invested so much time and interest in are just waiting in the wings, merely remaining secondary characters when all of them have so much potential for a good book. When Sarah announced that the next book was going to be Drago I literally groaned out loud. Although I did enjoy his character in Lucca’s book, I wasn’t interested in much else about him. After finishing the book I was left unsatisfied and almost bored. Unfortunately the appearances of “his saving grace” Lucca couldn’t save this one for me. I wish Sarah would just finish the series instead of trying to pump out as many books she can. At the rate she’s going the entire mob is going to be head over heels in love, and having mind-blowing sex. Seems legit."}, {"Review": "“If you thought this was going to be a love story where they fall in love the second their eyes met… you were wrong. This isn’t it.”This sentence let us think that this is gonna be some dark shit. But trust me all the scare is limited to this sentence only. Because after this there’s nothing dark or bad in their romance. In fact they slowly fall in love. And TBH it’s a sweet love. But there is a huge star cast. So it’s not only about them, it’s also about the other character who keeps popping up.And of course how can you forget Lucca. Lucca is clearly given the main preference. He is shown as some kind of enigma, as always. The author keeps reminding us that the H is some servant type guy of the Caruso family. I myself like Lucca but cmon, let the other characters shine too. Drago is not bad himself. He was a hero material. But it seems like the author doesn’t want us to love any other guy more than LuccaP.S. Having said that I still love Lucca 😛.Also I loved Drago and Kat. I wish there was more of them. And I want to read Dominic and Maria’s story. I hope they become a couple."}, {"Review": "Who book was it??I felt like this wasn't really about Drago or Kat??? I still know nothing about Drago character. I know nothing at all. However one shot is all up and through here, this book wasn't rushed but by all means I feel like it's missing a lot. Kat and Drago love didn't build it was so instinct I missed it. Well I'm assuming kat brothers get books soon with Marie and DOM soon. Hope it's better more fire. I don't see me reading this like I will continue to re-read Lucca. It was better than Angel but only because it had my favourite supporting characters. We didn't even get to see her and Sal relationship shesh........"}, {"Review": "3.5 starsSnarky h and taciturn H; he chooses her for revenge but treats her well and they bond from there ...I liked both H and h; she was very smart and I liked that she was so loyal to her brothers ... the relationship with her older brother is so sweet and poignant; H plans for revenge but cannot bring himself to be cruel; he was also sorry that he was older than her and may have spoiled her life ... Most of all, I liked the glimpses I got of Maria, Leo, Matthias and Dominic; would really like to read Maria's story; she has remained constant to her character from the beginning ... "}, {"Review": "Ehh. about the only thing I liked about this book was the cover. It definitely needed more editing.It has so much potential to be one of the great ones and it missed the mark big time. It wasn't so much Drago's book as it was a just kind of a collection of smaller storylines. I have read this entire series and there have been some hits and misses (I'm looking at you Vincent), I was even \"ok\" with the whole Chloe book ordeal but at least that book gave insight to Chloe and why she is the way she is. I got it. (I still think it should have been marketed at a novella though)Annnywho. I just didn't get this one. Drago and Kat's marriage was arranged blah blah blah I'm sure you have read the synopsis of the book so I won't go over it again. This book had the potential to be great but it felt rushed and had too many \"side storylines\" to ever really say that it was Drago and Kat's book. There was no \"love\" story just one day they decided that they loved each other. The beginning was amazing then it slowly just flat lined for me. I had to read several passages over again so that I could figure out who the hell was saying or thinking what! and then the whole reminder that you are reading a book!!! Good Lord in heaven, Who does that!! I'm not gonna say that I won't read any more of this series because I am curious about what's gonna happen with Amo (and btw, where the hell did this one-shot shit come from? did I miss something in the other books) but I don't think that I will be on pins and needles anymore. Sarah has kinda let me down these last few times and I'm sure that there will be a delay in the publishing of the next book anyway. "}, {"Review": "3.5 ’Wedding’ StarsWell, I can’t say I was highly excited about this book. You all know by now who’s book I’m dying to finally read (Yep, Maria’s...) But I guess it wasn’t her time. And I still have mixed feelings about this story.I think I like it, but this feeling isn’t close enough to loving something. But still, Brianne’s writing is one of the most powerful things I’ve ever experienced.What I really missed was the depth of the characters. They were not complex and their relationship was also a big meh.I loved the ending, tho! That was really sweet! And Lucca is still MY man!"}, {"Review": "Honestly I can't recognize this writer from the first book NERO. They are too much different books to be written by the same author. this series keeps going but the love stories are not strong enough. The characters are all too similars and not well described. At the end of the book I can't even say who is Drago and who is Katarina. they're not peculiar in anything, the love story is too short and too weak. (same was Angel and Adalyn)The only thing that keeps me going is the telenovela's side of this series. The need to know what will happen to all of them, the part of Lucca that are not still revealed. But honestly is not something that keeps me on my toes anymore."}], "Genre": "Romance", "ID": "40622772", "Desc": ""}