{"Name": "The Kiss Thief", "Image": "https://images.gr-assets.com/books/1544101164l/41450662.jpg", "Reviews": [{"Review": "It’s Live! GRABBY HANDS!Amazon US: https://amzn.to/2LVqPD7Amazon UK: https://amzn.to/2GXHx63Amazon CA: https://amzn.to/2C3qTwaAmazon AU: https://amzn.to/2AynVzI⭐️⭐️6 STARS⭐️⭐️\n”Ours is not a love story.”\n It was bound to happen, but I had no idea it would happen in such spectacular fashion. Alas, all good things come to an end....With that said, several of my #1 loves have been dethroned! My new #1, Wolfe Keaton, is EVERY SINGLE LITTLE THING that ever was! The Kiss Thief is unlike any other book I’ve read and is completely amazing. In fact, it’s the BEST OF THE BEST! I was utterly enchanted from the very first page. And just look at that gorgeous cover. I’m BLOWN AWAY by the gorgeousness. L.J. Shen slays!So...here’s what you need to know:As I stated above, Wolfe Keaton is effing amazing! He’s, sexy, cunning, ruthless, intelligent, and driven. In short, he’s the perfect Alphahole! I’ll go on record right now and state, if alphaholes are your thing, YOU WILL BE RUINED by Wolfe. Prepare your hearts NOW! He’s larger than life and the ultimate BBF.The plot is intricately weaved like a beautiful tapestry. It’s complicated and intriguing. Unexpected twists abound. I was on the edge of my seat while reading it. And did I mention, I devoured the book at a record speed. The writing and storytelling are beyond reproach. Shen is one of my Top Favorite author for this very fact. I can always expect the best from her and she delivers...each and every time. And last but not least, the execution is fan-freaking-tastic! The feel of this book is different and so beautifully rendered. The historical inspiration shines throughout. The attention to detail and subtle nuisances that are interspersed throughout add to the decadence and beauty of the storytelling. It left me breathless and completely in awe.To sum up, this is my absolute favorite LJ Shen book. She raised the bar and ascended to a new level of greatness. From cover to cover, The Kiss Thief, is stunning perfection. This book has my HIGHEST RECOMMENDATION."}, {"Review": "\n A story of Nemesis and a villain with no chance at a happy ending.Where the Prince doesn't save the princessHe tortures her.And the beauty doesn't sleep.She's stuck.In a nightmare.\nHold on to your hearts ladies cause the Big Daddy of All Predators -Wolfe Keaton has gatecrashed the Booklandia. This masked marauder is here to whisk Princess Rossi away on his Black Stallion. You will lose your hearts too, to this Brutish Buccaneer and if you're extremely lucky- your panties too in the process.  \n\"Once a Thief ; Always a thiefI wanted to see for myself if the rumours of your beauty were true\"\nSenator Wolfe Keaton has not only stolen Princess Francesca Rossi's first kiss, he has stolen her dreams, her life and is working his way to steal her heart too. Al, these she'd been safeguarding for Angelo Bandini.\nHe took the power. MY powerWolfe Keaton was A KISS THIEF\nIf you love-hated the #HotHoles , you ain't seen nothing yet. Leigh has surpassed her earlier work in not only the gorgeous offbeat cover, but equally Fabulous off beat story too. It has a very scarlett-Rhett vibe and takes me back to my Mills & Boon days. The writing is sharper, shows teeth, the vengeful notes are stabbing. Leigh doesn't shy away from flaunting his vicious intentions. He's not here to make friends. In fact he's here to make men & women kneel in his presence and beg for scraps of his goodwill.Wolfe will give EVERY HOT HOLE  a run for their money. He's drop dead sexy, ruthlessly ambitious & passionately patriotic. Leigh has AGAIN  proven why she's the QUEEN OF creating lickalicious ALPHAHOLES. This story is completely new in plot, setting and tone. The intricate story keeps you ON YOUR TOES throughout. It has a sinister and darker vibe. People constantly change sides and loyalties and an undercurrent of danger, betrayal and blackmail is buzzing at every step.\n\"How about you give me what I really want, Rossi? Your PRIDE\"\nOn the other end,  Francesca is princess of the Rossi  clan-The Outfit. Born and bred to stand a step behind the men, She's polished, sophisticated and ladylike. A perfect asset to act as an arm candy to Senator on the rise in politics. She merely changes cages and a no walled prison is still suffocating as any for her crushed ambitions and dreams.\n I am an unwanted puppy, running from door to door in the pouring rain, looking for shelter \nBy the end of the story, the princess turns into a warrior and ends up winning your heart. Her mettle is so strong, her enemies end up underestimating the steeliness of her spine.A particular scene in the middle of the book was so cruel, it brought tears to my eyes and from that point on, both the characters seem to change their tint. The scene was quite dark and it was a catalyst in changing the course of the story. Brilliance of the scene was in the tears. You'd expect them to be of hatred, but they are of sacrifice and martyrdom.\nI am a rusty barbwire, twisted together, knotted in a ball of fear!\nFrancesca tops from the bottom and uplifts the scene by sheer endurance. The ensuing \"Walk of Shame\" is a slap on the face (you'll understand it when you read it) I swear it's akin to seeing a rough diamond being faceted and polished to sparkling brilliance right in front of your eyes. There's enough fire in her to inspire others to draw on her courage and bravery. S.U.P.E.R.B !!!\n\"Leave,\"\"I'll never doubt you again, Francesca\"\"LEAVE!!!\"\nI believe LJ  was a bit apprehensive about this out-of-the-box story and I can somewhat understand. She's pushed the envelope, written scenes with sadistic pathos(you'll get it when you read it), she has shed her comfortable blanket and penned some chilling sentiments. But a lion is a lion at the end of the day, he'll starve before eating grass. so her fears will prove to be unfounded when ALL her readers-old and new will LOVE the story!!This story shows a lot of growth as a writer on Leigh's part and will definitely endear her more to the readers.The noteworthy thing in Leigh's characters is that they don't change their spots. The assholes don't spout flowery monologues and fangs don't get withdrawn. The characters remain true to their traits right up til the end.\n\"He's in hate with my father and in lust with me\"\nIt's an oxymoron that you love-hate these characters with equal fervour. Brilliant writing, thoroughly enjoyable ride which came to an end so soon, I didn't even realise it. I wish the book went on and on and never ended. It's been ages since I read a paperback and kept the lights on, much to my husband's irritation, but I couldn't help it!! Wolfe just bit me hard and carried me away in his fangs. I hope his knees heal soon cause he has a lot of genuflecting in his future😜\n5 plates full of Humble Pie\n#BookBistroBlogApproved Follow us on :FB - https://www.facebook.com/groups/BookB...Blog -https://bookbistroblogcom.wordpress.comBlog -https://bookbistroblogger.blogspot.comTwitter - https://www.twitter.com/BookBistroInstagram - https://www.instagram.com/BookBistroBlog"}, {"Review": "English/spanish version“Falling in love was so tragic. No wonder it made people so sad”A standing ovation for ONE OF THE BEST BOOKS THAT I'VE EVER READ, and L.J Shen's best story to date. It left me with the worst book hangover of the year! ITS INTRICATE PLOT IS A NEW BRAND OF PERFECTION SO MIND-BLOWING THAT IT WILL LEAVE YOU BREATHLESS. Have you ever felt that words are not enough to describe what you feel? that's me now after reading this story, I'm an emotional mess and nervous wreck. The Kiss Thief, * sigh *, is EPIC BEYOND WORDS. Oh God, I loved every second when I read it. It's so different from everything I've read before, but so completely addictive. The first words had me hooked on the story and turning the pages as if my life depended on it. I COULD NOT PUT IT DOWN!!!! The plot and the characters consumed me, obsessed me, hypnotized me, with an emotional and harrowing romance bordering the dark and raw, full of love, banter, hatred, passion, opulence, power, anguish, that kept me on the edge of the seat, heart racing and a swarm of butterflies inside me stomach. Get ready for the most ruthless alpha male ever, more than Troy and Vicious together. Wolfe Keaton is despicable, cruel, he has no mercy for anyone, he also is sooooo sexy, he melted my panties, gave me goosebumps and made me blush several times. But nevertheless, he captured my heart. He loves so hard, the sweet way he protects and cares for the heroine, wow, I'm dying of love for him, he's my new obsession. MY TOP BOOK BOYFRIEND EVER!!! Francesca is a sweet, beautiful, brave and strong girl who melted my heart, her way of talking to the plants made me laugh out loud, she also faces situations with courage. She is everything I look for in a heroine. I LOVE HER!! The explosive attraction and passion between the characters is unparalleled, and the slow burn, let me tell you, it reaches stratospheric levels, it could burn a whole room. I cannot get enough of them, I still cannot get them out of my head.  THEIR ROMANCE IS SOOO TEAR-JERKING, SO PASSIONATE AND EMOTIONAL,  everything what I am looking for in a romance, ahhhh, I keep sighing. WITH AN EXQUISITE AND FLAWLESS PROSE, L.J. SHEN MANAGES TO CREATE A MASTERPIECE THAT REACHES YOUR SOUL.  A masterfully written story that evokes so many different feelings in the reader. Mrs. Shen continues to prove why she is the best storyteller. She has an ability to wrap you with her words and catch your heart, smash it, tear it completely and break it into pieces. My soul still does not recover from the suffering. THIS LOVE STORY IS SO EPIC, SO HEARTBREAKINGLY BEAUTIFUL THAT I NOT WANT TO LEAVE THIS WORLD OR THE CHARACTERS. It is definitely a must read. An exquisite romance that you will not want to miss. What are you waiting for? Go read it now!Versión en españolUna ovación de pie para UNO DE LOS MEJORES LIBROS QUE HE LEÍDO y la mejor historia de L.J. Shen hasta la fecha. ¡Me dejó con la peor resaca literaria del año! SU INTRINCADA TRAMA ES UNA NUEVA MARCA DE PERFECCIÓN TAN EXTRAORDINARIA QUE TE DEJARÁ SIN RESPIRACIÓN.¿Alguna vez has sentido que las palabras no son suficientes para describir lo que sientes? esa soy yo ahora después de leer esta historia, soy un lío emocional y nervioso. The Kiss Thief, *suspiro*, es EPICA más allá de las palabras. Oh Dios, amé cada segundo al leerlo. Es tan diferente de todo lo que he leído antes pero tan completamente adictivo. Las primeras palabras me tuvieron enganchada a la historia y volteando las páginas como si mi vida dependiera de ello. ¡NO PUDE PONERLO ABAJO!La trama y los personajes me consumieron, me obsesionaron, me hipnotizaron, un romance emocional bordeando lo oscuro y crudo, lleno de amor, odio, pasión, opulencia, poder, angustia, que me mantuvo al borde del asiento, el corazón acelerado y un enjambre de mariposas dentro de mi estómago. Y prepárense para el macho alfa más despiadado de la historia, más que Troy y Vicious juntos. Wow, Wolfe Keaton es despreciable, cruel, no tiene piedad de nadie, sin embargo, es increíblemente sexy, derritió mis pantaletas, me provocó piel de gallina y me hizo sonrojar varias veces. Pero a pesar de todo, él capturó mi corazón. Él ama con tanta fuerza, la forma en que la protege y cuida a la heroína, muero de amor por él, es mi nueva obsesión. EL MEJOR NOVIO LITERARIO DE TODOS LOS TIEMPOS.Francesca es una chica dulce, bella, valiente y fuerte que me derritió el corazón, su forma de hablarle a las plantas me hizo reír a carcajadas, pero además ella enfrenta las situaciones con coraje. Ella es todo lo que busco en una heroína ¡¡LA AMO!!La atracción explosiva y pasión entre los personajes no tiene comparación, hierve a fuego lento, y déjenme decirles, alcanza niveles estratosféricos, ufff esos podrían incendiar una habitación completa. No puedo conseguir suficiente de ellos, todavía no me los puedo sacar de la cabeza. SU ROMANCE ES TAN DESGARRADOR, TAN APASIONADO Y EMOCIONAL, AHHHH, todo lo que busco en un romance. Sigo suspirando.CON UNA PROSA EXQUISITA E HIPNÓTICA, L.J. SHEN LOGRA CREAR UNA OBRA MAESTRA QUE LLEGA A TU ALMA. Una historia magistralmente escrita que evoca tantos diferentes sentimientos en el lector. Ella sigue probando porque es la mejor en lo que hace. Tiene la habilidad de envolverte con sus palabras y atrapar tu corazón, hacerlo un puño y desgarrarlo completamente, pisotearlo, y hacerlo pedazos. Mi alma todavía no se recupera de tanto sufrimiento. ESTA HISTORIA DE AMOR ES TAN ÉPICA, TAN DESGARRADORAMENTE HERMOSA QUE NO QUIERO DEJAR SU MUNDO O LOS PERSONAJES. Definitivamente es una lectura obligatoria. Una historia épica y exquisita que no te querrás perder. ¿Qué estás esperando? Ve a leerlo ahora."}, {"Review": "\n\nOur hearts were tarnished. Stained. And guilty. Unpredictable to a fault. And bound to break.\n\nI got two words for you here: Must. Read.I know I say this each time I finish a book of hers, but this was my favorite LJ Shen book to date.\n\nI was born into a glided cage.\n\nIf you like a modern day arranged marriage trope, welcome to your next addiction. This book? GAH! It had an anti-hero that only Shen can write; brutal and hard but completely redeemable. This is someone you won't be able to help rooting for! This was like if Vicious and Sparrow had a baby, and that baby threw down the gauntlet of delicious angst and grit. A clashing of a ruthless politician and the mafia, and a young beauty used as a pawn that gets caught in the crosshairs of political agendas and blackmail. Francesca Rossi was such a breath of fresh air. For someone so young, she had this endearing naiveté to her that was beneath her hardened persona. She's not a doormat, even when dealing with an extremely dominant man. This is not a woman that takes things lying down. She's sharp-witted and smart-mouthed. I absolutely loved her.The Kiss Thief was a book that kept me riveted to the pages from beginning to end. It was unlike any book I've read in a long damn while and it was absolutely everything. EVERYTHING, I tells ya! I know you're thinking, Lana, you're being vague as hell right now. But trust me, you don't need or WANT to know more. This is a book that you NEED to go into absolutely blind, or you'll do yourself a great disservice. So, you're welcome :)beta readFind me on:  "}, {"Review": "Oh wow, wow, wow. I’m in awe right now. If you’re a lover of L.J. Shen’s Hotholes then The Kiss Thief is going to be exactly what you want because ladies (and gents), we have a new alphahole in town. Mr Wolfe Keaton, the man that makes men quiver in their boots and women drop to their knees. He’s sexy as sin with an attitude to go with it. He’s ruthless and harsh and keeps his true feelings locked away. The Kiss Thief isn’t your typical romance. It’s a story about a nemesis and a villain. One that starts with hate and anger, with pain and heartache and turns in to so much more than you could ever expect. A romance that has you gritting your teeth and ready to pull your hair out in frustration. One that has you melting on the spot and clutching at your heart because of all the emotions it inflicts upon you. This story is incredible, one that I won’t be giving away. You HAVE to experience this book through fresh eyes and no spoilers to 100% enjoy it and enjoy it you will. LJ Shen has gone and written a book that’s far from her normal style of writing and absolutely slayed it like the queen she is. Leigh, hands down, takes the crown for writing THE BEST ALPHAHOLES in book land. Since the announcement of this book and the updates from Leigh I’ve been eager to read it but I wasn’t ready for what she gave us, it was definitely a pleasant surprise. The amount of time, effort and love that’s gone in to this book shines brightly and I’m in awe of this woman, she’s truly incredible. This book is most definitely my favourite book from this author. My favourite read of 2018 and no doubt my favourite book from 2019. TKT is everything I love about romance’s. The struggles and the real ness of it all hooked me from the get go. If I could give this beauty a higher rating than 5, I would. It deserves all the stars and more."}, {"Review": "***AVAILABLE NOW - FULL REVIEW***MY FIRST FAVORITE AND MUST READ OF 20195+ Nemesis CROWNSLJ Shen has rocked me world, tilted it on its axis, and I don’t which way is up or down after the whirlwind she just took me on. The Kiss Thief is EVERYTHING I love in a romance, and I never wanted this book to end. EVER! Wolfe Keaton has taken top book boyfriend spot. With his confidence and intelligence and lethal charisma, I was utterly charmed by this man. His cold exterior makes him seem untouchable and callous, but the way he takes care of the heroine, even if it seems detached, shows he is a man who has the capability to love, and love he does. The evolution of his character, the freedom of forgiving and letting go, is so inspirational. This is man who has been wronged and instead of continuing to revel in the ashes, he rises from the love and affection to create something better and beautiful. He is willing to fall to his knees and relinquish what has held him together for love. What is more romantic than that? He has my heart. TOP BOOK BOYFRIEND material right here. Francesca is a heroine, like most of Leigh’s, that has an inner strength. Like most of the secondary characters in the story, readers might see her as weak and docile but not all who are silent are weak, and Francesca is the farthest thing from complacent. She takes power when she can and yields it like a weapon. She pushes those who try to control her and speaks with actions when she knows her voice will be ignored. This woman who may not show her strength on the outside is stronger than any character LJ Shen has written to date. I couldn’t be more enamored with this tiny but mighty sprite of a character. The Kiss Thief is more than my words can articulate. There is the romantic layer with hot sex and swooning declarations of love (eventually). There is the danger and the vengeance that will keep readers turning the pages. But with this book, Shen layers it with an allusion to mythology while also contemplating ideas of revenge and forgiveness and how one lifts you up and the other tears you down. If those layers aren’t enough, Shen continues to astound with her reflection on what real love is, which is letting someone you love be free, having them stay by choice versus keeping them prisoner. Real love allows for freedom and growth, evolution and change. It is an absolutely masterpiece that had me riveted from the moment these two meet and an HEA that will steal your soul and leave a smile on your face. Leigh Shen continues to prove why she is a best seller. She integrates romance with real ideas that deal with the heart and the mind. She creates characters that consume us and loves that are so epic it shifts our world. I never ever want to leave this world or these people! I have a new Shen favorite! Beta read"}, {"Review": "Gah!! You guys!! The Kiss Thief was everything we've come to expect from L.J. Shen and more!! BEYOND PHENOMENAL!! It was emotional, poignant and gut wrenching and filled with a brilliant story that had me glued to every page. It was so perfectly written with every intricate detail written with the utmost care. This is without a doubt THE BEST novel this author has written!!Without giving away any spoilers, Shen did it once again with Wolfe Keaton. He undoubtedly is the new alpha-hole to top and that is a very tough title to win. He is dark and foreboding with an icy and unfeeling exterior. But his demeanor hides the heat and fire inside him. I absolutely FLOVED him as he was the perfect combination of hardened and vulnerable. He was consumed with vengeance and yet allowed an encounter with his enemy's daughter to set him on an impulsive journey filled with love, lust, revenge and obsession.Francesca Rossi likewise was absolutely astounding. She was Wolfe's perfect match and my favorite Shen heroine to date. She was strong and resilient. Delicate and beautiful in appearance but with a deep and unwavering core strength - choosing to write her own story with the cards she is dealt in life by unequivocally making it her own. She was completely underestimated by all the men in her life and the lasting impression she would make on all of them.Overall The Kiss Thief was truly phenomenal and another feather in the cap of this remarkable author. Her brilliance is apparent in every novel she puts out where each book is better than her last and her skills are only surpassed by her goals to better her craft, which she accomplishes every time. She needs to officially rename herself Slay Shen because she always kills it. Bravo! 6 stars! ~Ratula"}, {"Review": "\n\n\n MY REVIEW:  can also be found on my blog: \n ➽ KITTY KATS CRAZY ABOUT BOOKS\n' 5 THE BIG BAD WOLFE STARS '\n A story of a Nemesis and a Villain with no chance at a happy ending. Where the prince doesn't save the princess. He tortures her. And the beauty doesn't sleep. She's stuck. In a nightmare. \n THE KISS THIEF:  Is a full length contemporary Romance novel. Spoken in Dual Perspectives. It all started with a wooden chest carved and made by a witch encasing three notes which would predict her future..The first note said 'I was going to be kissed by the love of my life.'This was utterly unique, utterly un-put-down-able, utterly captivating, and utterly memorable, utter perfection. I couldn’t put it down, I didn’t want to put it down, I devoured this, I inhaled this, I loved this more than words can convey, L.J. Shen has got her grooooove back and she is un-stop-able!! What a way to set the new year on fire!! A little old fashioned story that will capture your heart, set your panties afire, and leave you gasping for more.The heroine is like nothing I have ever encountered before, she’s polished, sophisticated, a socialite by name, born in a gilded cage, risking escape would result in death. A chimney smoking character that will win your heart in many ways.This starts off with nineteen year old Francesca getting initiated into the Chicagoan Society by allowing her to pick her own husband from thousands of eligible men affiliated from the Outfit. Instead of college she was choosing the perfect husband. But she already knew within her heart who was going to be of her choosing, And that man was Angelo, she’s known him since birth.\nThe Masquerade theme was gods and goddesses, Francesca had chosen to go as Nemesis the goddess of retribution.\nThey say your first kiss should be earned. Mine was stolen by a devil in a masquerade mask under the black Chicago sky.\n\nA kiss that was mean't for her chosen was stolen from her, and the man responsible was thirty year old Senator Wolfe Keaton, the most desirable man in Chicago, this one kiss set the ball rolling into unknown charters. \n It was just a stupid, fun tradition. Hardly a scientific fact. Surely, not all the predictions written on the notes turned out to be true. I probably wouldn't even see Wolfe Keaton ever again. \nThis set the pace perfectly, retaliation, retribution, a debt paid in full..\nThis book right here was one of my most highly anticipated books, I couldn't wait for 2018 to be over with, I wasn't so patient to get my hands on it, I stalked the ass off it, the teasers made that anticipation the times worse, and then finally I got it in my grabby little hands and all my expectations were exceeded, I inhaled it, I devoured it, I went into this with eyes wide open and at the end of it my heart was filled to the brim. All the feels in the world, 'The Kiss Thief' was full of insane chemistry, love and angst. I adored this book! It reminded me exactly why I’m obsessed with this authors words. L.J. Shen writes the most compelling stories, and this one is my all time favourite from her.* Teaser used is off the Authors Facebook Page * \n\n\n  \n     \n "}, {"Review": "5 stars!\n\nThey say that all great love stories have a happy ending. I, Francesca Rossi, found myself erasing and rewriting mine until the very last chapter. One kiss. Two men. Three lives. Entwined together. And somewhere between these two men, I had to find my forever.\nLJ Shen crafts a deliciously angsty and riveting tale of a Villain and his Nemesis. This was one of those books that had me glued to every page, unable to put it down for a minute. It was a story that captivated me from the start and never let go. By far my favorite Shen book to date! Francesca Rossi has always known who she would marry, and she was okay with it. Her father is the boss of the Chicago Outfit and only a certain suitor will do. Then walks in Senator Wolfe Keaton. Wolfe claims Frankie as his own and there is nothing she can do about it. \u2028\u2028Gah gah gah! There is so much I want to say about this story, and Wolfe, and Frankie, but I loved seeing all this on my own. The anticipation is the best part! So this won’t be very detailed, just know I loved it so hard! \u2028\u2028Wolfe is one of those characters you hate to love and love to hate. By the end I loved him so much! He was hard to like at times, but getting his story and seeing why he did the things he did made me see him a different way. At first he was so leery of Frankie, but as he got to know her, he saw she wasn’t just a young and immature girl, she was kind, innocent, and better than he deserved. \n\n\n“My sweet poison, my gorgeous rival.”\n\n\u2028I loved Wolfe and Frankie together. Their chemistry was off the charts. Enemies to lovers is something I never tire of reading about and I also love the arranged marriage/marriage of convenience troupe. This book was perfect for me. It had some moments where I wanted to legit throw my kindle, but still I loved it so much. \u2028The Kiss Thief is an addictive, unforgettable, and original read. The writing was stunning and the story blew me away. I already picked up the audio book because I know I’ll want to do a re-read. Don’t miss this book! It’s fantastic!!\n"}, {"Review": "It's no secret that The Kiss Thief was one of my most anticipated releases of 2019. L. J. Shen is one of my favorite authors of all time, and I look forward to every single book she publishes. This time was a little different though. The mystery surrounding this book and the collective excitement of all of the other L. J. fans I knew took it to a whole new level! All the time wondering what the story would be about, what the name of it was, and basically, everything else about this book had already made for so much anticipation I could barely stand it. Then once I found out the answers to all of those things, it just made it worse! An enemies to lovers story with an arranged marriage, a love triangle, and the mafia?! It was like she wrote this book just for me! I was ready to pay Leigh any sum of money she wanted for an early copy of this book. I thought I was going to legit lose my shit if I didn't get my hands on it soon! Patience is just not a virtue I possess.  All that build up could have set the stage for a let down of epic proportions. I wouldn't have been surprised if it did. Having expectations like that can ruin almost anything, but guess what? It didn't. Not only did The Kiss Thief not disappoint me in the least, it completely blew me away! Every expectation I had was met and exceeded! I was on cloud fucking nine the entire time I read it. This author's writing is mesmerizing and just downright magical. I'm so in awe of her talent it's ridiculous. I basically highlight everything and drool as I read at this point. There are no words that can adequately describe how incredible it is.\n \nI absolutely adored everything about this novel. I couldn't be more enamored with it if I tried. The setting, the characters, the plot, and the steam are all nothing less than utter perfection. I was engaged throughout the entirety of the book, and it gave me all the feels. My emotions ran the gamut from laughter to anger to tears. I could feel my heart break, mend, and warm over and over again, and I never wanted it to end. Before I get even more carried away and blabber on further about my love affair with L. J. Shen, I want to talk about my favorite part of this book, the characters. Francesca and Wolfe are an unlikely pair, but at the same time, perfectly matched. They're complex individuals that bring out the best in each other, challenge each other, and understand one another like no one else. From their very first meeting, the chemistry between them was insane, and it just escalated from there. Francesca is a different type of heroine than I've read from this author before, and I enjoyed that. I loved her transformation from the slightly immature, sheltered, unsure, naive teenager in the beginning to the strong, resilient, confident young woman she was by the end. That being said, she was more than meets the eye even from the start, but nobody saw it. It didn't take long for Wolfe to though, and boy, did he like what he saw!  Wolfe is one of my favorite asshole heroes Leigh has ever created, and that's saying a lot since she writes some of the best I've ever read. He's sexy, intelligent, cocky, complicated, and all alpha. His main priority is always to protect and care for Francesca above all else, and when it comes to sex, the man knows what he's doing. Powerful, loyal, slightly broken, morally gray, and swoonworthy af, Wolfe is everything I could want in a hero. If you love Vicious and Troy, you will fall head over heels Wolfe. No doubt about it! Captivating, addictive, and fantastically written, The Kiss Thief should be on the must read list of every fan of contemporary romance. It is one of the best books L. J. Shen has ever written. I can say without a shadow of a doubt, this is going to be on my favorites of 2019 list and plenty of other author people's, too. Side note: I know some readers tend to shy away from love triangles, but if you're one of them, I wouldn't let that hold you back from picking this one up. You don't have anything to worry about in my opinion. If you're a fan of this author's work, asshole heroes, and/or enemies to lovers romance, this one's for you!    "}, {"Review": "\n\nA story of a Nemesis and a Villain with no chance at a happy ending. Where the prince doesn't save the princess. He tortures her. And the beauty doesn't sleep. She's stuck. In a nightmare.\n\nWhat a fantastic beginning to reading in 2019! I knew I’d fall in love with this, because it is L.J. Shen. One of, if not, my favourite author. Ever. She’s a proficient and excellent writer—her sentences are carefully and beautifully constructed into gripping scenes and concise prose—who continues to astound me with every release. She’s mastered an ability to transform cold-hearted and callous asshole heroes, who undergo an inevitable transformation of redemption, into loveable characters we can’t hate. They’re always damaged, filled with cynicism and sarcasm and hatred towards the wrongdoer, yet loaded with vengeance and countless positive qualities that make them them.\n\nGod, she was sweet, and she was all mine. Not just her body but also her words and her courage.\n\nI thought I loved Baron “Vicious” Spencer; adored Celian Laurent, but I’m unconditionally infatuated and unquestionably besotted with Wolfe Keaton—The Kiss Thief. On the surface, he appears to be nothing beyond ruthless; however, there’s an immense amount of depth, intrigue and enigma surrounding this mean anti-hero. Without doubt, he is complex and multi-faceted, someone who appears withdrawn and detached, yet beneath the tough exterior is someone able to love. And love hard. Fierce, without shame. Wild, without restraint.\n\nWe were entwined and entangled, connected with invisible strings, each of us trying to pull away, only to create more knots that made us closer.\n\nFrancesca Rossi is my newest fictional best friend. Tangent: I was almost named Francesca. Ergo, we’re best friends. I digress. Having been raised dreadfully sheltered inside a gilded cage, oftentimes Francesca appears to be docile, unsure of herself and awfully immature. Seeming complaisant, or sometimes quiet, however, doesn’t always mean being submissive or feeble-minded—she’s quick-witted and intelligent. Torn between an older life bound in tradition and a newer life promising freedom, Francesca transforms into someone more daring, challenging and outspoken. \n\nHe turned to me, his grays on my blues, two pools of beautiful lies.\n\nWolfe and Francesca are explosive. Passionate enemies who slowly and quietly transform into intimate lovers. Wrapped up in an unexpected fervid romance; embraced by an intense connection. The Kiss Thief is an engrossing, riveting narrative of an arranged marriage set within a modern Chicago. Promises of revenge shadowed by danger is abundant—you will be turning the pages faster than expected. L.J. Shen continues to astound me with the ways she illustrates love. It is always an intense fierceness of earnest affection and vicious yearning that is wretched and heart-aching however real. To be in real love is to be free. To change. To transform into someone greater than you’ve imagined. And she’s portrayed this through Wolfe and Francesca.Follow me on: Blog | Instagram"}, {"Review": "I was lucky enough to read an ARC of the The Kiss Thief and let me tell you the chemistry between Keaton and Francesca is through the freaking roof. Once again, Ms Shen has created a damaged alpha, a-hole hero that I couldn't help but fall head over heels in love with.Ms Shen has the amazing ability to take me through an entire emotional gamut. I wanted to throttle the hero and yet . . . I also wanted to ride him like a rodeo bull. My heart broke for Francesca and the impossible situation she found herself in. I loved her strength and conviction as she came to terms with her reality, no matter how difficult and painful.This book is fabulous.I went on a brief historical reading binge after I finished it.And it's been months and I'm still thinking about it. And one scene in particular that will break your heart and show you, as the reader, just how strong the heroine is, and just how fully Ms Shen is able to draw you into the worlds she creates.The Kiss Thief is all the things I love about historical romance set in the contemporary world. It's emotional, sexy and heartbreaking and intense.I wish I could read it again for the first time"}, {"Review": "Live Amazon https://www.amazon.com/Kiss-Thief-LJ-... 5 BEAUTIFUL STARS This is the best book I have read from L.J. Shen!!!Lately I'm saying it each time I finish a book from her but it's so true!She doesn't stop surprising me, her stories are so unique! The Kiss Thief is addictive,full of tension and angst.It is so hot and captivating! \"My sweet poison, my gorgeous rival.\"I was hooked from the prologue and I couldn't put it down!Each chapter hooked me even more.The characters were fantastic and the plot addictive.I'm not going to give anything away you have to go blind and devour it like I did!It's so different from what we have seen so far from L.J. Shen and get ready because this book will stay with you forever!!\"His voice was a poem, and I drank every word as if my life depended on it.\"One of my top reads for this year, my year started so good!I highly recommended to everyone,The Kiss Thief is a must read!Prepare yourself for a book hangover after finishing it!  \n\n  "}, {"Review": "Huge 5 stars for The Kiss Thief. This story was better than I expected and unique in many ways. Wolfe and Francesca are so hot together! Wolfe is alpha, dark, brooding and cold but the author shows us he is vulnerable and honorable. Francesca is sweet, innocent, smart and kind. Her beauty glows bright from within and out! She is really a lady but she is strong and a fighter as well! And she is caught in the middle of a fight between two men. If you really love someone, do you fight for them or let them go? The author has done something fabulous. She created characters who I empathized with, whose actions alternately thrilled and horrified me, but most importantly they developed. The plot was excellent and had me engaged the whole time. It was well paced; nothing seemed too slow or too rushed. Really, there's a little bit of everything in here, and it mixes well to give you an exciting read. This book takes you into a whole new world with some great characters and a beautiful love story. High praise for L.J. Shen!In short:Hero 5/5 | Heroine 5/5 | Plot (Point, Originality) 5/5 | Writing Style 5/5 | Steam 4/5 | Romance 5/5 | Angst-Suspense 4/5 | Darkness 2/5 | Humor 2/5 | Secondary Characters 5/5 | Drama-Conflict 5/5 | Mystery 0/5 | Twists 5/5 | Pacing Steady | Action 4/5ARC kindly provided in exchange for an honest review."}, {"Review": "First thing I was able to think about when this book hit my kindle, was to start the journey with these two characters. When I found out this book the book was coming I was so exited that sleeping was hard for me. The exitement for this book got to an unhealthy level.I’m so glad to say that this book was clearly worth my whole exitement.L.J. showed me a way of writing a love triangle in a way that didn't annoy me . Because most of the stories I’ve read until now which mostly had fantasy stories, the love triangles used to get on my nerves. So the author showed her talent with keeping up my interest in this love triangle.I totally loved the way this story was constructed because in the beginning there had been a lot of hate. Then it changed. We saw how close love and hate can be together in relationships.What made things more interesting was the position of our love interest.All those feelings and those thoughts of the two main characters, L.J. Shen described in a way that I mostly was able to get why they acted like they did. Even if in some situations I wouldn’t act like they did.Another fact that is amazing about the book that made me want to dive in the Story even if I really weren't in the mood for romance it was so hard to put this book down. Sometimes it seemed like I had a clue what will happen next but the the story went in an other way.There were some passages in this book that brought me to tears and some that made me smirk. And even if these scenes had been really close together the author made it so I didn’t feel bad when I had to laugh.There is a lot of character development placed in this story. If you multiply Vics intention by ten you'll come out nearly to the total of how much of a bad boy Wolfe is. He can be very stubborn and grumpy. He knows what he can say at which time. Also he knows how deal with people who gave him pain. He likes it when every one is listening to his orders but also he has a soft side. Sometimes he shows humor and he loves fiercely, but hates with the same intensity.Francesca is a young woman who fights for her self and can be really sweet. She has like the author’s other heroines her way of being sassy. She always finds a way to make her self kind of happy. What is shown perfect by the words the author has choosen is how confused she is. There was so much strength in her.To conclude you can see that there was much about this boook I loved and the less time was left in that book the better the story got and the less in wanted to leave the characters. Even if I loved the relation to the American Italians in my eyes it was repeated to much. But it just costs this wonderful story just a quarter star. So we have 4.75 stars.but I cant wait to read it again in a better condition."}, {"Review": "Surprise! Surprise! There's no surprises in this book. We have the same characters and plot, again. To be fair the book was engaging and well written. The MCs had great chemistry. Those things might be enough for you to enjoy and I didn't finish the book, so I might not be a fair judge.The amount of sexism, double standards and cliché was disturbing and unbearable for me. His thoughts about sex and women were vomit inducing. And her insecurity because she is inexperienced virgin were cringe worthy. And don't let me start about the gendered norms and expectations. I just can't!What I hated about the book is what I hated about every book I have read by the author. Instead of coming up with something new she is recycling her work again and again. And it's not that pleasant to begin with. And the blurb is misleading, it's not really a love triangle. The other man is just there to cause jealousy and stupid drama.The male lead is a manwhore jerk and the female is that pure kind girl with a fake backbone. They hate each other; op drama; they have angry sex; they fall in love; they hurt each other; more op drama; love confessions and then hea... Wait, I didn't get that far. I think I stopped around the 'hating each other' part which took way too long. Still, I don't think I'm wrong. Please correct me if I'm. I don't remember once when the male lead was a decent human being in this author's books, when his thoughts didn't repulse me and his actions didn't irritate me. He always arrogant, mean and hurtful. Not once he kept it in his pants after meeting the heroine and the worst, the female lead is always aware that he is having sex at the moment if she is not watching. I can't recall once when the heroine didn't turn boneless the moment the male mc touched her, doesn't matter what she thought or felt about him. She always plays strong and cool but fails miserably when strength and common sense are needed. And she never wins in the dominance game between her and him, never."}, {"Review": "If you know me you know how much I love L.J. Shen. She’s one of my favorite author’s of all time so when I read and saw the cover of The Kiss Thief I couldn’t contain my excitement. I am so sad to say that even though I enjoyed it, it fell kinda short for me. Wolfe and Francesca’s sexual chemistry is off the charts from the moment they meet. I enjoyed their banter but I don’t know there was something missing. SPOILERS AHEAD(view spoiler)[It bothers me that they always refer to her as a teenager. She’s 19 and he’s 30. I understand there’s an age gap but please let it go. Its not like he’s an old guy. Even the H refers to her as a teenager and says things like “that’s what happens for marrying a teenager” Its a real turn off. I understand she’s young but she’s not a kid and they make it sound like she is. Also 30 is not old age. He’s still pretty young too. My parents married when my mom was 20 and my dad 30 and it wasn’t creepy. They are still happily married and about to celebrate their 41st anniversary. Also whats up with Francesca always smoking? It would bother me too if he was the one smoking. The H even asked her not to smoke in the house but she still does. Also she was in a car accident and the first thing she asks the H is for a cigarette. Maybe its just me but smoking is a turn off, specially when they do it constantly. I didn’t like that Wolfe had sex with OW after meeting Francesca. Also Francesca shouldn’t have kissed Angelo when she was already married. There’s just too much OW/OM drama for my liking. These were just some of the things that didn’t sit well with me. (hide spoiler)]Overall the writing is amazing as usual but I was expecting more from this book. I did enjoy it but didn't love it. I will always love L.J. Shen and read everything she writes cause she's an amazing author. Can’t wait for her future books.\n"}, {"Review": "yeetus deletus yeah i dunno, i usually sum up my thoughts in bold but i can't think of a good tag line for this book. first thoughts though: much better than dirty headlines (which is a book i wish i could forget forever).i think i'm starting to realize a pattern with lj's books and tbh once i start seeing patterns it's all downhill from there. 98% of lj's heroes are dickheads. i mean BEYOND dickheads. and you always fall for them which is fine and dandy. except that it's really hard to believe in their love. she does this thing at like 80-90% into the book where the hero comes to this epiphany that he loves the heroine and it's always done the same way. like 2 pages of him waxing poetic on how he's treated her like garbage but he can't live without her.and that was barely ok the first time it showed up in her books, but it's getting hard to sympathize with after 3+ times. get creative, lady.what didn't bug meyou're going to see a lot of reviews mentioning other woman/other man drama. and there is. but it didn't really bother me. neither character truly cheats on the other. if anything it just shows how juvenile the two main characters are.beyond that, if the plot interests you at all i would say give this a try. it's certainly not a bad book it's just a little repetitive with the lack of trust and endless cycle of trying to one up each other. the chemistry is definitely there between the main characters tho.trigger warning though for: (view spoiler)[dubious consent when heroine is losing her virginity. it was mildly disturbing. (hide spoiler)]"}, {"Review": "3.5 StarsOverall Opinion: I enjoyed this. I just didn't enjoy it as much as I had hoped. I'm in the minority yet again here. I do really enjoy this author's ability to write a nasty H. And I enjoyed this H for the most part, but I think I just needed some more of the good to balance him out. I didn't like the fact that their dates were skimmed over. I think that would've helped a ton in redeeming him and his impulsively jerkish behavior! Yes, he groveled -- but because some of it felt skimmed over it didn't feel like enough for me. This also has some content that I'm sure some readers won't like, so please check out my spoiler tags below if you're considering reading but might have some \"triggers\" that would ruin a book for you. However, I think this will be a success -- especially with those readers that like this author's other works.Brief Summary of the Storyline:  This is Francesca and Wolfe's story. Francesca is the only daughter of a big crime boss. She meets Senator Wolfe Keaton on a night that she dreams is the night of her first kiss with the man she's been in love with for years. What she doesn't expect is that the jerk at her table would steal that kiss and then declare they are to be married the next day. Wolfe has a plot for revenge and Francesca's dad is the main target. They have a bumpy road, but the more time they spend together the more their walls start to fall and they fall in love...and get a HEA ending.POV: This alternated between Francesca and Wolfe's POV.Overall Pace of Story:  Good. I never skimmed and I thought it flowed well.Instalove: No, they take a while to develop stronger feelings. More like hate-to-love.H rating: 3.5 stars. Wolfe. I liked him for the most part, but I had to deduct some for the impulsive jerkish behavior he displayed a few times.h rating: 3.5 stars. Francesca. I liked her, but I didn't like her indecisiveness towards the end and what she did to the H.Sadness level: Low, no tissues neededPush/Pull:Yes (view spoiler)[ They both push away at times (H more so), and I'd say that they both also pursue the relationship at times (also was the H more so).  (hide spoiler)]Heat level: Good. They have some good tension, chemistry, and scenes -- but not so much it takes away from the story. Not as hot as I thought it'd be though.Descriptive sex: YesOW/OM drama: Yes (view spoiler)[ The h has a love interest when they meet. There is also a ex-fling of the H that causes some drama, and he goes out publicly with OW when they are married. (hide spoiler)]Sex scene with OW or OM: No Cheating:  Yes (view spoiler)[The h publicly kisses old love while married to the H and after things had progressed between the h and H. The H slept with OW when they were first engaged because he thought the h slept with her love interest (and she also led him to believe that). The H also made the h believe that he was with OW after they are married and she publicly kisses OM, but he didn't go through with anything physical (just was publicly out) with OW. (hide spoiler)]Separation: Yes (view spoiler)[They are separated shortly, but there was no mention or suggestion of other partners during this time.  (hide spoiler)]Possible Triggers: Yes (view spoiler)[ Arranged marriage (on page), H is ~11 years older than the h, the h was a virgin and the H was a manwhore before the h, cheating (off and on page), criminal activity (off page), unexpected pregnancy (on page), and loss of loved ones (off page)  (hide spoiler)]Closure:  This had pretty good closure with what I would call a HEA ending (view spoiler)[they're still married with children (hide spoiler)].Safety: This one is probably Not Safe for most safety gang readers depending on personal preferences.(view spoiler)[- Does  have cheating- Does Not have a descriptive sex scene with OW/OM-  Does have both the h and H pushing away-  Does have a separation between the h and H-  Does Not have abuse- Does  have a HEA ending (hide spoiler)]"}, {"Review": "This book hit my kindle and I literally dropped the other book I was reading just to start this one! Nothing was going to stop me from devouring this book! Well except for the annoying part where I had to adult! But between that,I devoured this book completely! What a fantastic way to start the new year! I am not usually one for love triangles or arranged marriages for that matter, but this book is written in a way where it does not feel like either of these things! Ms Shen has shown us a passionate story that pulled me in completely! When I reached the end, I immediately wanted to go back and read it all over again! I absolutely loved it!I really REALLY want to tell you all about the characters and the storyline but I think it would be so much better if I just tell you that it was completely worth the wait and you need this book in your life! This book is different to what you may have read by this author but holy BEEP it’s amazing!! Gahhhhh!!! I laughed, I cried, I swooned, and my heart soared! The angst will grip you and keep you hanging on every word. But if you are expecting a love story that will be happiness and rainbows, you are in for a surprise! Seriously, you need this book in your life! I highly recommend to absolutely everyone!"}, {"Review": "It's no secret that Shen and I are tighter than how my jeans fit after this Christmas holiday... but make no mistake... my love for her has absolutely nothing to do with this book. It is captivating, unique, beautiful, and it drove me f***ing crazy. I have a thing where I get bored easily. If the relationship is smooth sailing, I dose off. Oh boy, that is NOT the case here.... TKT is everything that I love about reading in ONE epic page turner. Sparrow was my favourite Shen book. Then Vicious happened. But now The Kiss Thief takes the throne. Leigh knows her shit when it comes to writing. She gives me writer envy. I'm reading her words, my heart thumping in my chest, tears streaming down my face and cussing her out because this b**ch can WRITE. *chants to self* \"I need a new career.\" I'm not talking \"Oh, her writing is good\" - I'm talking her writing is one of the best I have ever read. Period. Anyway, read this book. It is an incredible tale of love lost and love found, with chaos in-between."}, {"Review": "I must confess that I haven't read a lot of \"love triangles\" and there is a reason for that. They make me extremely nervous. I like angst in my books but the angst that comes with \"love triangles\" can actually drive a person to drink. Which is why I am normally not a fan of this trope. You know who I am a fan of though... L.J. Shen !! So, me reading this book was a pretty much a done deal ;) Writing a review is a bit of a challenge though because I really don't want to spoiler this story. I think it would best to jump into this one blind...I am a huge fan of L.J. Shen's Sinners of Saint series. I loved all the HotHoles, which should tell you, how much I love a redeemable asshole !! Well, if you are anything like me...you are gonna love the hell out of this one...and out of Wolfe ;) \nWolfe Keaton was a kiss thief.\n\nThe heroine in this story, Francesca, she was a bit different than what I am used to...by this author... but also just in general. She was sweet, a bit naive, and shy...but she wasn't weak by any means. She was strong in her way. And even though I would have done things very differently than her...I still admired her. She wasn't exactly what I expected from a mafia princess. There were still times I wanted to shake her a bit though...\nA Story of a Nemesis and a Villain with no chance at a happy ending.\n\n  This book definitely managed to make me \"feel the feelz\". Anxious, excited, angry, sad, happy are just some of the emotions I went through while reading, and I finished it in one go... No social interactions on this new years day for this girl :P I started the year exactly how I wanted to...with an awesome book !!\n\n    \"Maybe I am the monster. After all, I come out to play at night. But so do you, little one. You're in the darkness too.\"\n  \nThis one has unquestionably deserved a spot in my favorites list, though it hasn't surpassed \"Ruckus\" and \"Bane\" for me.  That might never happen because I fell in love with those boys/men hard. Doesn't mean I didn't fall for Wolfe as well ;) I highly recommend this book as well as any other one written by this author. \n\n\n\n\nMy reviews are posted on DirtyBooksObsession\n\n\n\n\n\nFollow Us on➦ \n\n"}], "Genre": "Romance", "ID": "41450662", "Desc": ""}