{"Name": "Normal People", "Image": "https://images.gr-assets.com/books/1535170371l/37539457.jpg", "Reviews": [{"Review": "\nNo one can be independent of other people completely, so why not give up the attempt, she thought, go running in the other direction, depend on people for everything, allow them to depend on you, why not.\nThis is going to be a polarizing book. I mean, I think I liked it. And I say \"liked it\" in the sense that it made me very miserable. It is a quiet character study, almost a YA novel but not quite, and it is a profoundly lonely and depressing love story.I didn't begin by liking it. Normal People follows two characters - Marianne and Connell - through adolescence and into early adulthood, and they begin by being the kind of uber-precocious teenagers who read Proust and Marx for fun. It took a while for me to settle into their story. My initial impression was that this was going to be some kind of John Green for adults, which is not something that floats my particular boat.Without fully realizing it though, this book had crept quietly under my skin. The relationship between Marianne and Connell is angsty, sure, but it felt painfully real. They are so flawed, marred by unlikable characteristics, and yet, I could not stop caring about them.\nNot for the first time Marianne thinks cruelty does not only hurt the victim, but the perpetrator also, and maybe more deeply and more permanently. You learn nothing very profound about yourself simply by being bullied; but by bullying someone else you learn something you can never forget.\nThe story is really just about the two of them and their relationship. In high school, Marianne is a smart and wealthy girl, but is socially ostracized and emotionally abused at home, whereas Connell is working class, but very popular. Connell's mum works as a cleaner for Marianne's family. They begin a secret sexual relationship that falls apart when Connell fears his friends will find out. The compelling dynamic between them drives the story-- issues of class and social status cause much conflict.In college, the two meet again. This time, Marianne is popular, and Connell is feeling increasingly depressed. The two of them lean on each other time and again as they move through a social world filled with social expectations. There's a bit of a When Harry Met Sally vibe, except that this book is more soul-destroying.\nNothing had meant more to Rob than the approval of others; to be thought well of, to be a person of status. He would have betrayed any confidence, any kindness, for the promise of social acceptance.\nThere's clear criticism of our constant need to impress and perform for others in a world that grows ever more connected. Much of the tragedy that befalls Marianne and Connell is caused by other people, peer pressure and social expectations. It is very sad to think that someone might give up who they love the most because they can't deal with how it makes them look to others.The pair's inability to adequately communicate is frustrating but feels realistic. I was on the verge of tearing my hair out at all the things left unsaid in this book, but I think it was a good kind of frustration. The kind that comes from caring too much. I feel like there are any number of reasons I could have hated Normal People, but I didn’t. I actually kinda loved it. It's a weird, awkward, depressing novel about a connection formed between two very different people who find exactly what they need - and perhaps a lot that they don't - in each other. CW: sexual assault; domestic abuse; drug use; casual racism (called out); depression; anxiety; suicide & suicidal ideation.Blog | Facebook | Twitter | Instagram | Youtube"}, {"Review": "Sally Rooney is the real dealNormal People has been lavished with praise from critics, longlisted for the Man Booker prize and is apparently being adapted for television by the BBC. And it only came out last week! All that attention will no doubt attract quite a few readers who would not ordinarily touch this subject matter with a barge pole. Because this book:A)\tIs about young peopleB)\tIs a love story (but not a romance)C)\tContains a fair bit of sex (which is crucial to the story, btw, and is not graphic)All of which (possibly also the fact that the author is a 27-year-old woman) mean that Normal People will inevitably be dismissed by some as frivolous. It isn’t. This is a confident, accomplished and serious work. Of Rooney’s debut, Conversations with Friends, I said in my review it ‘occasionally scrapes close to the bone’. Well, Normal People cuts to the core.Normal People is not out to inspire, instruct, entertain or talk down to anyone, which makes it something of a refreshing anomaly in current fiction about young people. It is a novel (for anyone, young or old) that simply presents the truth of youthful experiences without the filters of nostalgia or sentimentality. It invites you to inhabit the psyche of someone else – two someone elses: Connell and Marianne – to identify with them and to feel their pain and turmoil. For the reader who connects to that, it is wracking. The story focuses only on the pivotal moments for these two characters, jumping forward three weeks, six months, or five minutes, as needed, to excise all the uneventful bits of life and leave us with the most emotionally intense supercut possible. It follows them from high school in a small town, through their years at university in Dublin, as the dynamic between them shifts with their surroundings and social circle. They’re not officially 'together' the whole time, or even most of the time, but they always figure in each other’s lives in a significant way.Sally Rooney writes with such precision that this all feels painfully true. She conjures the tension and emotion in a scene just from the way someone wrings out a dish sponge; she conveys the full weight of feeling from a look or a shrug. In Rooney’s imagining, Connell and Marianne as separate entities are less important than the interplay between them – their relationship dynamic and the influence each of them has on shaping the other, that’s the real stuff of this book: \n\"How strange to feel herself so completely under the control of another person, but also how ordinary. No one can be independent of other people completely, so why not give up the attempt, she thought, go running in the other direction, depend on people for everything, allow them to depend on you, why not.\"\nThere’s irony here, and self-conscious posturing (not nearly as much as in CWF), but earnestness, truth and kindness as well. In addition to the central relationship are issues of class, intellectual integrity, and a particularly astute look at the rebuild of self that teenagers undergo in the transition from school to uni, how it allows some to thrive while others stumble, and in some ways is just an illusion after all. So there’s hype and there’s backlash to the hype, and Normal People is sure to resonate powerfully with some readers and not at all for others. If you like a minutely observed novel about people and feelings that isn’t mawkish, I'd say give it a go."}, {"Review": " Man booker prize long list nominee and Costa book awards nominee This is a book that has many admirers and sadly it didn't work for me and while I would love to agree with all the judges on this one I only struggled to the end because it was a bookclub read. It is difficult to go against the grain on a book that is nominated for so many awards. So as always you  need to judge for yourself because books fit people differently  Quite simply this book didn't  Fit Me. I really have no interest in reading about 18-20 something year college kid's on/off sexual relationships where they seem to only exist in their own little complex bubble and this book felt like a bubble. It is described as \"exquisite love stroy\" which I honestly found nothing exquisite or no love in this one. The characters of Connell and Marianne were dislikable and boring and the on / off, will they wont they \"relationship\" became repetitive reading. The only character which I liked and felt any connection with in the novel was Lorraine.Perhaps this is more suited for a younger audience where they connect with the college scene or for readers who like complex relationship stories but for me this was a struggle from start to finish."}, {"Review": "I am not sure how to write this review because I seem to be so far beyond the pale on my antipathy to this book. In simplest terms I didn't connect with this work at all and I would be best to chalk this up to a \"reader/writer\" mismatch and move on but I will try and articulate some of my reading experience.Some of my perplexity with Normal People is that I just couldn't relate to the twenty something, highly educated, politically aware and cynical young adults that populate this novel. I am not sure how reflective these voices are of young Irish making their way in the world, but as presented here I found them exasperating to listen to and not particularly nuanced. It is possible that even if I didn't enjoy the novel I might like the writing but in actual fact Rooney's style is perhaps the single biggest thing that bugged me. I found some passages of interest sandwiched between a lot of wooden dialogue and these flat descriptions ... Marianne goes inside and comes back out again with another bottle of sparkling wine, and one bottle of red. Niall starts unwrapping the wire on the first bottle and Marianne hands Connell a corkscrew. Peggy starts clearing people's plates. Connell unpeels the foil from the top of a bottle as Jamie leans over and says something to Marianne. He sinks the screw into the cork and twists it downwards. Peggy takes his plate away and stacks it with the others This kind of writing really gives me nothing. Others have cited the two dimensional nature of her secondary characters and I would concur. Barely any of them made much of an impression on me. Alan - Marianne's brother, seemed particularly badly drawn. He appears to be a key part of understanding Marianne and yet he warrants only a few pen-strokes of unexplained malice and cruelty. The opening of a wine-bottle and pouring of cups of tea receives much more page space. I tried to understand Marianne, who seems to be both ugly and beautiful, popular and friendless. Her hinted at troubled family life was suppose to underpin her need to be a submissive. I remain unconvinced that this is really how dominance and submission works and I would think experts in BDSM might strongly take issue with some of the cliches here. The relationship between Marianne and Connell should have kept this book afloat at the very least. The intense emotional and physical connection, the will they / won't they stay together, all the drama of YA love is here but it is in an eye-wateringly navel-gazing form. I found it all exactingly po-faced. The number of inexplicable break-ups, largely based on mis-communication was about three or four break-ups too many for me. I just wanted to yell at this novel most of the time. Say what you mean and stop being so insufferably difficult !, either split up or stay together, both your friends and I really don't care !. Marianne and Connell were of most interest to me when they started emailing each other, discussing novels and politics thus preventing them breaking up over some new emotional minutiae. Perhaps this should have been a novel of their email exchanges.Oh well, I guess I will never be a Rooney fan and I have doubtless missed the point of this book entirely but that is ok not every book is for every reader."}, {"Review": "3.5 stars.Sally Rooney's upcoming novel \nNormal People\n almost felt like a puzzle, in that you didn't really know what you were truly getting until all of the pieces came together. Beautifully written although a little slow in its pacing, it's a novel full of deep emotions, which made it difficult to read at times.Connell and Marianne know each other from high school, although they pretend not to, plus his mother works as a cleaner for her family. Marianne is a bit of a laughing stock in school, mainly because she doesn't care what her classmates think of her. Connell is tremendously affected by what people think of him, so when a connection starts to grow between him and Marianne, and turns to something physical and even emotional, they keep it hidden, and he ignores her in school.\"At times he has the sensation that he and Marianne are like figure-skaters, improvising their discussions so adeptly and in such perfect synchronisation that it surprises them both. She tosses herself gracefully into the air, and each time, without knowing how he's going to do it, he catches her.\"Marianne feels so intensely for Connell, and she is willing to let him possess her completely. He can't explain his feelings for Marianne, except that she thinks so highly of him, but he continues to fear what his peers would think if they knew what was going on. He winds up treating her badly, leaving her to deal with her own emotional distress.One year later, both are studying at Trinity College in Dublin. Connell feels uneasy, no longer the popular fellow he was in high school, and has difficulty relating to his peers and fitting in. Marianne, on the other hand, is comfortable in this world, enjoying deep conversations about the political and economic issues facing society, and being looked at as an object of desire, not ridicule by her fellow students. No matter what other opportunities present themselves, the pair finds themselves drawn to each other once again, enjoying the way their interactions make them feel yet falling into the same patterns which cause friction.\"Marianne had a wildness that got into him for a while and made him feel that he was like her, that they had the same unnameable spiritual injury, and that neither of them could ever fit into the world. But he was never damaged like she was. She just made him feel that way.\"\nNormal People\n follows Marianne and Connell through their time at college, through different relationships and the periodic circling back to one another, whether solely for friendship or something else. Each chapter, with a few exceptions, takes place a few months after the last one. But Marianne's penchant for self-destruction and Connell's inability to cope with the emotional stresses he faces leave them both unsure what their relationship should be and could be, if anything.Marianne's feeling she is unworthy of being loved without abuse or mistreatment, and the way she is treated by her family, boyfriends, and others, is very difficult to read about at times. Connell's bouts with depression are also quite painful to read, so at times this book felt very heavy, and its pacing seemed to move much slower than I would have liked. And like many books which focus on relationships, at times I wanted to shake both characters to make them say the things they wanted to, to each other and other people in their lives.Despite the book's emotional turmoil, Rooney's writing is exceptional. There were so many passages beyond the two I've cited in this review that I read over and over again, marveling at her use of language and imagery. She definitely got me completely immersed in this book and these characters, even when things seemed particularly draining or moved slowly. \nNormal People\n is really affecting, and it will stick with me for a long time.NetGalley and Crown Publishing provided me an advance copy of the book in exchange for an unbiased review. Thanks for making this available! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2018 at https://itseithersadnessoreuphoria.blogspot.com/2019/01/the-best-books-i-read-in-2018.html."}, {"Review": "I have to admit I wasn't taken with Rooney's debut Conversations with Friends but I tried to read her second book with an open mind. The writing was good and some of the themes were interesting but I was rather bored by the selfabsorbed, cliché-characters: women who just want to 'get the man' and who always question their self-worth after a break-up, and men who are behaving as if they come straight out of a 'boys-will-be-boys'-movie. So 1950ies. And the ending is just plain cheesy. 2.5* (mainly because the writing was good).And not much has changed after the re-read in January 2019: Nope, I still don't get the hype..."}, {"Review": "I wanted to like this book more than I did. How thrilling that the author hailed as \"Salinger for the Snapchat generation\" is Irish, and from my own province of Connacht at that. There are moments in this novel that would certainly back up such a bold claim. But I believe that she is a writer still honing her craft. Not quite the finished article just yet, but with all the potential to become a literary heavyweight.In the beginning we meet Connell and Marianne, two young people growing up the west of Ireland. Marianne comes from a wealthy family and Connell's mother Lorraine is a cleaner in their lavish house. At the start of the book, the pair are in their final year at school - Connell is a popular sports star while Marianne is a social outcast. They are close despite operating in completely different circles. Roles are reversed once they move to Dublin for college - Marianne falls in with a group who appreciate her wit and intelligence, and a taciturn Connell finds it difficult to make friends. The story follows their on-off relationship over the years - they go from being pals, to more than that, to who knows? They are a huge part of one another's lives, no matter what their romantic status.Rooney is strong on the intricacies of relationships - how the influence of one person can shape another person's whole life, and how little misunderstandings can snowball into major heartbreak. At one point Connell discovers that becoming part of a couple can even validate one's existence: \"To be known as her boyfriend plants him firmly in the social world, establishes him as an acceptable person, someone with a particular status, someone whose conversational silences are thoughtful rather than socially awkward.\" She is also extremely perceptive about the journey from adolescence into adulthood, that point in your life where you fly the nest to take on the world and finally meet people with the same interests as yours - confident, excited and apprehensive all at once: \"They were coming into college every day to have heated debates about books they had not read.\"However, there were a couple of things that bugged me. For one, Marianne's family despise her, yet we are given no reason for this. The actions of her brother Alan, in particular, become more ridiculous as the story goes on, and without proper context they just feel ludicrous. And I'm afraid I found the dialogue quite flat at times. For two people like Marianne and Connell, who know each other so well, I kept thinking, is this how they would really speak to each other? Their exchanges are so earnest and dry. For example, there's one part where they are about to have sex after missing one other for so long, and the atmosphere is charged. They kiss. Marianne says that she wants this so much, and Connell goes: \"It's really nice to hear you say that. I'm going to switch the TV off, if that's OK.\" The description of the scene makes it sound passionate but the conversation dulls its effect.Maybe I'm nitpicking. There were many aspects of the book I really admired. It's just that when I see publications like The Guardian declaring Normal People a \"future classic\", I expect a bit more from it. I do think that Sally Rooney is massively talented, and her gifts of observation and empathy will serve her very well in her career. She may have the literary world at her feet right now, but I reckon her best work is yet to come."}, {"Review": "Longlisted for the Man Booker Prize 2018This will probably be the last book I read from this year's longlist (unless Snap or Sabrina are shortlisted). I have been hearing great things about Sally Rooney since her name got a number of glowing recommendations in last year's end-of-year reviews, but I only got round to reading her first novel Conversations with Friends last week. I was impressed by that, so my expectations for this one were very high.I found the first couple of chapters a little flat, but once the characters were established, the rest of the book became a compelling read, and I couldn't resist finishing the whole book in a single day. Like Conversations With Friends, this one is at heart a love story, but it is far from being a sentimental romance.At the start of the book in 2011 (a time of economic depression after the \"Celtic Tiger\" boom), Marianne is a loner, an outcast in her final year at school from a rich (view spoiler)[(and as becomes clear later abusive) (hide spoiler)] family in a small town in Mayo. Connell is the son of their cleaner (a young single mother), and a popular star of the school football team. Both are very intelligent, and they develop a clandestine relationship. Marianne persuades Connell to follow her to Trinity College in Dublin, where most of the rest of the book is set over a four year period. In Dublin their roles are reversed - Marianne finds friends quickly but Connell finds it difficult due to class snobbery.Their relationship is a complex one, and the book explores their inner worlds intensely, and like Conversations with Friends this takes them to some pretty dark places - Marianne has a masochistic streak and is attracted to sadistic bullies, while Connell escapes his depression to find some redemption as a writer (which allows Rooney to make some playfully acerbic comments about the literary world). As in Conversations with Friends the second half of the book is darker and deeper than the first, (view spoiler)[and the ending has an element of ambiguity (hide spoiler)].The writing is sharp and witty throughout, and Rooney's ability to inhabit her characters is very impressive. This book is definitely worthy of shortlisting, and could yet be a potential Booker winner."}, {"Review": "Oooof. Alright - a disclaimer before I start. Normal People by Sally Rooney is superb. I’m gonna gush about this one (warning to those in the splash zone!) and I honestly feel that the less you know about it, the better the experience will be for you. So, to those of you who’re thinking of reading it, don’t bother with any reviews about the book - just read it. It’s a contemporary story about a boy and a girl who fall in love. That’s all you need to know. And when you’re done, come back and we can hi-five each other in joy over its excellence! …Why did I begin with “Oooof”? Because I genuinely feel like I’ve been punched in the gut. Repeatedly. This is such an emotionally exhausting and draining read! Sally Rooney’s created a remarkably compelling pair of characters in Marianne and Connell and I felt their love so intensely it was like I was experiencing it with them. Which makes it sound like a romance, and it has some of those elements, but if it’s anything it’s a classic Bildungsroman (just a fancy word for “coming of age” story). Marianne is the awkward loner in high school, brainy but socially isolated. Connell is the good-looking popular boy, inexplicably drawn to Marianne - star football player falls for nerdy girl. The two begin seeing each other secretly - god, it sounds sooo fucking cheesy doesn’t it? I promise you it’s anything but. From there it’s a rollercoaster of emotions as the characters grow and develop. I loved it pure and simple. Here are some critiques to anyone who didn’t enjoy the book: Marianne’s brother Alan is a laughably one-dimensional villain. There’s no plot (which is very typical of this type of story) - the story just starts and then ends. The occasional phrase feels hammy and clichéd (stuff like “so few people have what we have”). Connell is written as this genius but he does some super-dumb things - and if he is so brilliant, would he care so much what others thought of him? Also, given how unbelievably connected Connell and Marianne are on every conceivable level, the number of times they misunderstand one another seemingly purely for dramatic purposes could be seen as contrived as fuuuuck. And, though I know almost nothing about Rooney, it feels like a very autobiographical novel - most young writers tend to write about themselves to start with, after all. She’s a young Irish woman who went to Trinity College, Dublin, on a scholarship, like Marianne, and the novel ends with the characters in their mid-20s, which is the same age I suspect Rooney was when she stopped writing this (she’s now 27 years old). In that regard you could say it’s somewhat unimaginative. Listen: none of that matters. I noticed those things and I didn’t care. Because it’s so well-written, so damn compelling, so enthralling and honest and… real. If I gave this anything less than the highest possible rating, I’d be lying about how much I enjoyed this book. It’s also impressive that she didn’t shy away from writing the sex scenes given how tricky they are to write with most writers publicly embarrassing themselves. She’s such a confident and skilful writer – already, at such a young age! - that she pulls them off admirably and, yes, sensuously. If you’ve ever heard someone trying to convince someone else to start reading books, one of the points they’ll make is that you get to live lives you never would. Most books do this on a superficial level but Normal People actually achieves this viscerally. This is one of those books that effortlessly draws you into it and lets you experience the intensity of Marianne and Connell’s heart-achingly, tender, complex relationship in a totally believable way - it’s powerful stuff. Truly, I felt more and more anxious as the book went on until I was actually dreading the end - this novel turned me into a wreck! The Guardian review, which drew me to this book in the first place, mentioned something like “this is a novel for and about the Millennial generation” but it’s not really. In a literal sense the characters and author are Millennials but besides that there’s nothing about this book that makes it distinct for this specific time - it could easily be set at any point in the last 50 years and still work perfectly. I’m not really sure what the book was trying to say - if anything - but it’s left a deep impression regardless. Maybe that’s it - the whole labelling of generations is a fruitless exercise in misnomers, we’re all the same and love is a complicated, weird thing for all of us? Maybe it’s trying to define what “normal” is for this generation but isn’t that something every generation goes through? And I’m not exactly sure what conclusions Rooney comes up with could be uniquely ascribed to Millennials. I’ll leave it with this because I’m spent: Normal People isn’t just the best novel of the year, or even the best novel of the last few years, but it’s one of the best I’ve ever read in my life. Maybe I’m just a sucker for coming of age stories? W. Somerset Maugham’s Of Human Bondage told a similar type of story that left me just as devastated - but in a good way (sort of). A beautiful powerhouse of quiet, extraordinarily potent sensations that indelibly captures an important part of the human experience, Normal People has made me an instant fan of Sally Rooney’s - and thank you for writing it. "}, {"Review": "Longlisted for the 2017 Man Booker – and the only book published after the longlist was announced, and so the last I came to read (a month and 2 days after the announcement). While not shortlisted for that prize - the book is now (and not surprisingly) starting to sweep other awards: Irish Book of The Year - Best Novel. National Book Award - International Author, Waterstone's Book of the Year - Best Novel and Best Book, Costa Award - Best Novel. I have little doubt that the author will be the one on the Booker longlist that we will hear most of in the years ahead and that this book (probably alone of the longlist) will be on the shelves in mainstream bookshops in say 5 years' time.Returning to my review:The other books on the longlist draw on wider elements: graphics and alt-right, crime genre conventions, Greek mythology and legend, immersive research into the penal system, environmental passion, free verse and film noir, dystopia, grime and urban slang, refugee crisis, steampunk and slavery, greyhounds and spying, stream of consciousness: and the reader’s view of each book depends, at least in part, on her (or his) views on how well the author has translated those aspects into languageThis book is though little more than an internally focused, but two sided tale of millennial student friendship and love – and hence to a very large extent stands or falls on the readers view of the author’s writing and her characterisation of the thoughts and motivations of the two protagonists.In my view the author largely succeeds and, much to my surprise, this is one of my favourite books on the longlist.Connell and Marianne attend the same school – Connell quietly popular, Marianne widely shunned for her perceived eccentricity – but the two have two links: both are intellectual and Connell’s single mother cleans for Marianne’s widowed mother. The two start a tentative sexual and covert relationship and both apply (successfully) for Trinity where their relative status is turned on its head and more in line with their social status – Connell struggling with the simultaneous vacuity and confidence of his fellow students, and Marianne thriving.The book which moves forwards in unevenly spaced chapters which are dated and title (for example) Three Months Later, chapters which are told form alternating third party viewpoints and which often look back on key events since the last chapter and more particularly on the ever changing dynamic of the relationship between the two.Connell’s relationship to literature (like the authors) is complex – struggling with the middle class attitude to literature he still desperately wants to be part of it – which even leads to the book’s ending. Connell (and the author’s) ambiguity is captured in a number of quotes: \nIt seems to Connell that the same imagination he uses as a reader is necessary to understand real people also, and to be intimate with them.Connell couldn’t think of any reason why these literary events took place, what they contributed to anything, what they meant. They were attended only by people who wanted to be the kind of people who attended themIt was culture as class performance, literature fetished for its ability to take educated people on false emotional journeys, so that they made afterwards feel superior to the undereducated people whose emotional journeys they liked to read about \nKey themes examined in the book include: Class dynamics and social privilege; Masculinity and feminity – and the privileges and burdens of each; The aftermath of the end of the Celtic Tiger, and its economic and social effects on the millennial generation that reached adulthood after it, including their loss of faith in capitalism (having already lost faith in the church); Power dynamics and how these can alter across different social milieu; Fitting in and standing out – and how different people can adopt different positions over time; Intimacy and independence ; Self-image and its interaction with abusive relationships and with depression.I described Sally Rooney’s last book – Conversations With Friends – as “an interesting debut by a young author writing with a fresh new voice about a young character experiencing a very old story (a woman having an affair with an older married man)”. Despite its many differences, this book is again simply a young author writing with a fresh new voice about (in this case) two young characters experiencing an even older story – how does friendship translate into love and how can you really know the mind of someone else. Albeit one with a dark undercurrent. Jane Austen for the millennial generation. \nOne night the library started closing just as he reached the passage in Emma where it seems like Mr Knightly is going to marry Harriet, and he had to close the book and walk home in a state of strange emotional agitation …………. It feels intellectually unserious to concern himself with fictional people marrying one another. But there it is – literature moves him. \nAnd there it is – this book moved me."}, {"Review": "The night before the Man Booker Shortlist was announced, I was approved for the eARC of this title, so I stayed up late finishing it. Sadly it was not included in the shortlist, but if you like novels about relationships, this is excellent. It traces Marianne and Connell's friendship from childhood, and also tackles class difference and family violence. (I often find my favorite books from award lists are long but not shortlisted anyway.)Thanks to the publisher for granting me early access; sadly this doesn't come out in the USA until April 2019. You can bide your time by reading her earlier work."}, {"Review": "3.5***You learn nothing profound about yourself simply by being bullied; but by bullying someone else you learn something you can never forget.This was a hard book to review as it is so outside my usual type of book. This book follows Marianne: intellectual, cold and a wallflower; and Connell: likable, lives in poverty and anxious how people see him. Both have secret family lives outside what their classmates can see; one in a household of love and one from coldness. These two unlikely people become friends and then lovers, navigating their lives in their small rural Irish town to their experiences at college in Dublin. The book journey's their lives from school to university and how these two mismatched young people are inescapable from one another's lives, always drawn to each other.Normal people shows how one person can impact the decisions and actions of anothers life. While I would say the book is simplistic, focusing on the relationship between these two characters, Sally Rooney's narrative of the two character's shows deep vulnerabilities, complexities and unsureness in their thoughts, behaviours and lives. This book documented class issues, mental health issues, relationship issues and explored how two characters are trying to find themselves in today's world. This was all done with reference to today's technology as well and really mirrored a lot of young people's experiences. There was also the frankness of describing sex in the book which was attuned to the character's behaviours and being 'normal people'. Overall this was an easy read and something different from what I usually pick up!"}, {"Review": "Engrossing, complex, and emotionally honest, Normal People is an understated powerhouse of a novel. As this book ends up being so much more than the sum of its parts it's particularly difficult to summarize, but basically, it's a sort-of-love-story about Connell and Marianne, two young people growing up in small town Ireland together, who both move to Dublin for university in 2011.There isn't much going on in this book aside from Connell and Marianne's 'will they/won't they' relationship, but I wouldn't describe this as a romance novel as much as a novel about being human. Sally Rooney highlights with razor-sharp precision the oddities and intricacies that complicate interpersonal interactions, even between two people who love one another. This book is about miscommunication, but not miscommunication as a plot device; miscommunication as an intrinsic part of the human experience, naturally calling into question the possibility of truly knowing another person. Connell and Marianne's inability to open up to one another is so much bigger than these two individual characters; it's about gender roles and socioeconomic differences and power dynamics and social status and preconceived notions and projections and misinterpretations, and Rooney examines it all minutely through the lens of this one ill-fated sort-of-couple. She also has the uncanny ability to cut to the emotional core of a scene without sensationalizing, and I think that's what strikes me as the most accomplished element of this novel.I think this book is inevitably going to be underestimated by some because of its premise, and because of all the hyperbolic claims that Rooney is the definitive voice of her generation. But it's a deceptively clever book; it's perceptive where it could easily be vapid, it's clear-eyed where it could be melodramatic, and it has more intellectual and emotional depth than anything else I've read recently. A bit of an unconventional choice for the Booker longlist, but it fully earned its spot in my opinion, and I'd love to see it shortlisted."}, {"Review": "On the second page of Sally Rooney’s universally acclaimed, Booker- longlisted novel is the following paragraph:‘He puts his hands in his pockets and suppresses an irritable sigh, but suppresses it with an audible intake of breath, so that it still sounds like a sigh.’What?I get the hand in the pockets bit, but how the hell does the rest of it work? A sigh is an exhalation and I have no idea how any attempt to suppress a sigh by inhaling could possibly sound like one. I’ve tried hard to imagine it, but no luck. I’ve tried even harder to do it, but even less luck. In fact, in an effort to understand this twaddle I have tried it so often that I have come close on several occasions to hyperventilating and passing out.What have those Faber editors been doing? Maybe they have no problem with it because they are all so much cleverer than me and know how to read properly. Or maybe they also tried to do it and actually did pass out, which might explain why they have failed to apply the editorial pencil with any intelligence in the 264 pages that follow.The more likely explanation, of course, is that the problem is mine – and I offer the following gems from Normal People on that understanding… • ‘He looks down into his lap, and exhales quickly, almost like a cough’.It’s hyperventilation time again. I’ve imagined it and I’ve tried it, but I still don’t get it. • ‘He can’t even visually imagine himself as a lawyer, wearing a tie and so on..’Do we really need that ‘visually’? • ‘It’s true she is Connell’s type, maybe even the originary model of the type:’Originary? What does that mean? Am I the only one who had to look it up? (It’s not in Chambers, by the way, so you’ll need the OED) • ‘Peggy, watching, took a performatively large mouthful of Cointreau…’Can anyone explain what ‘performatively large’ actually means?• ‘Enraged now, Alan wrenched her back from the sink by her upper arm, and, seemingly spontaneously, spat at her.’Seemingly spontaneously? I could go on. It’s not often that I feel the need to read with a pencil in my hand but Normal People drove me to it, and my copy is now covered with question marks and annotations. I retired from teaching last year but reading Sally Rooney’s feted novel felt like I was marking again - in this case marking the work of a precocious, but overindulged, talent.In 'Normal People' alternating points of view are combined with an inconsistent and confusing authorial presence, voices are often difficult to differentiate in an ineffectual free indirect style, the comma splices (Ferrante this isn’t) and the unpunctuated dialogue, far from creating an impressionistic flow, suggest a lack of precision, and the prose shifts from past to present for no apparent reason and even within paragraphs, creating a chronological blur. In short, it's a bit of a mess. If I cared about the characters or cared about the story, these things would not matter quite so much but on the few occasions when I saw through the writerly mess I found it difficult to care about them at all.The novel, though, has been so well received that its very reception has become a news story. ‘Salinger for the Snapchat generation’: critics unite to praise 27 year-old novelist’ was the headline in last Saturday’s Guardian.So the problem is clearly mine. Maybe I've read a different book from the one everyone is raving about. Maybe I've read the same book but don't know how to read properly. Or it could be that I'm the child's voice at the back of the crowd politely suggesting that the emperor might not be wearing any clothes."}, {"Review": "Now somehow NOT shortlisted for the 2018 Booker Prize...Sally Rooney sold her first two books to Faber at the age of 25, and Normal People suggests the decision was a no-brainer. I can think only of Rachel Cusk (who Rooney resembles in imparting so much with such elegant concision) and Karl Ove Knausgaard as possessing Rooney’s ability to write such deceptively slight-seeming (but in fact – hyperbole alert – often Chekhovian) yet mesmerising and addictive literary fiction.There’s little immediately obvious in Normal People (or Conversations with Friends) that might point to Rooney being in possession of a rare talent. At first glance, you might be forgiven for wondering what all the fuss was about. But very quickly the style – spritely and shorn of all literary fat; dialogue-heavy – Rooney employs gathers traction and force until you find yourself irked at having to put the thing down.“Marianne is grinning now. She exercises an open contempt for people in school. She has no friends and spends her lunchtimes alone reading novels. A lot of people really hate her. Her father died when she was thirteen and Connell has heard she has a mental illness now or something. It’s true she is the smartest person in school. He dreads being left alone with her like this, but he also finds himself fantasising about things he could say to impress her.You’re not top of the class in English, he points out.She licks her teeth, unconcerned.Maybe you should give me grinds, Connell, she says.He feels his ears get hot. She’s probably just being glib and not suggestive, but if she is being suggestive it’s only to degrade him by association, since she is considered an object of disgust. She wears ugly thick-soled flat shoes and doesn’t put make-up on her face. People have said she doesn’t shave her legs or anything. Connell once heard that she spilled chocolate ice cream on herself in the school lunchroom, and she went to the girls’ bathrooms and took her blouse off to wash it in the sink. That’s a popular story about her, everyone has heard it. If she wanted, she could make a big show of saying hello to Connell in school. See you this afternoon, she could say, in front of everyone. Undoubtedly it would put him in an awkward position, which is the kind of thing she usually seems to enjoy. But she has never done it.What were you talking to Miss Neary about today? says Marianne. Oh. Nothing. I don’t know. Exams.Marianne twists the spoon around inside the jar.Does she fancy you or something? Marianne says.Connell watches her moving the spoon. His ears still feel very hot. Why do you say that? he says.God, you’re not having an affair with her, are you?Obviously not. Do you think it’s funny joking about that?Sorry, says Marianne. She has a focused expression, like she’s looking through his eyes into the back of his head.You’re right, it’s not funny, she says. I’m sorry.He nods, looks around the room for a bit, digs the toe of his shoe into a groove between the tiles.Sometimes I feel like she does act kind of weird around me, he says. But I wouldn’t say that to people or anything.”Marianne is obviously unusual, a terminal outsider from a rich but odd family, a plain- looking and unconventional girl. She sees Connell when he turns up to meet his mum, who cleans at Marianne’s house; Connell is clearly a popular and at least superficially conventional student from the opposite end of the socio-economic scale. Both are amongst the smartest in their school, but both run in vastly different social circles. Marianne has no interest or need in currying favour with anyone; she’s both seemingly uninterested in other people and protected from the requirement of networking by wealth. Connell is doing his best to fit in and needs other people to thrive; he also needs validation.The two are drawn together out of their mutual incongruence around groups, that the whole charade of school and jostling crudely for attention is something the other also despises. They’re unclubbable allies whose only moments of clarity and respite are while mutually resolving their outlier statuses, and despite her awkward uncertainties and his appreciation of his own shallowness, and that Marianne is not the girl he is supposed to be pursuing, her cachet unaligned with his own (which only adds to his interest), the inevitable ensues.“You know you were saying the other day that you like me, he said. In the kitchen you said it, when we were talking about school.Yeah.Did you mean like as a friend, or what?She stared down into her lap. She was wearing a corduroy skirt and in the light from the window she could see it was flecked with pieces of lint.No, not just as a friend, she said.Oh, okay. I was wondering.He sat there, nodding to himself.I’m kind of confused about what I feel, he added. I think it would be awkward in school if anything happened with us.No one would have to know.He looked up at her, directly, with total attention. She knew he was going to kiss her, and he did. His lips were soft. His tongue moved into her mouth slightly. Then it was over and he was drawing away. He seemed to remember he was holding the book, and began to look at it again.That was nice, she said.He nodded, swallowed, glanced down at the book once more. His attitude was so sheepish, as if it had been rude of her even to make reference to the kiss, that Marianne started to laugh. He looked flustered then.Alright, he said. What are you laughing for?Nothing.You’re acting like you’ve never kissed anyone before.Well, I haven’t, she said.He put his hand over his face. She laughed again, she couldn’t stop herself, and then he was laughing too. His ears were very red and he was shaking his head. After a few seconds he stood up, holding the book in his hand.Don’t go telling people in school about this, okay? he said.Like I would talk to anyone in school.He left the room. Weakly she crumpled off the seat, down onto the floor, with her legs stretched out in front of her like a rag doll. While she sat there she felt as if Connell had been visiting her house only to test her, and she had passed the test, and the kiss was a communication that said: You passed. She thought of the way he’d laughed when she said she’d never kissed anyone before. For another person to laugh that way might have been cruel, but it wasn’t like that with him.”Marianne is casually groped in front of peers largely indifferent to her shock and distress; Rachel, a blatant and amusingly awful rival for Connell’s affections delights in such a disaster; Connell comforts Marianne and eventually takes her home. This is the first occasion he’s shown his feelings for her amongst the group (they usually ignore each other to save his embarrassment). Eventually they end up in bed together, but it’s still illicit and slightly shameful to Connell, to the extent that he can’t even confide in his mother about any of it.“So is Marianne your girlfriend, then? said Lorraine.No.What does that mean? You’re having sex with her but she’s not your girlfriend? You’re prying into my life now, he said. I don’t like that, it’s not your business. He returned to the bag and removed a carton of eggs, which he placed on the countertop beside the sunflower oil.Is it because of her mother? said Lorraine. You think she’d frown on you?What?Because she might, you know.Frown on me? said Connell. That’s insane, what have I ever done?I think she might consider us a little bit beneath her station.He stared at his mother across the kitchen while she put a box of own-brand cornflakes into the press. The idea that Marianne’s family considered themselves superior to himself and Lorraine, too good to be associated with them, had never occurred to him before. He found, to his surprise, that the idea made him furious. What, she thinks we’re not good enough for them? he said.I don’t know. We might find out.She doesn’t mind you cleaning their house but she doesn’t want your son hanging around with her daughter? What an absolute joke. That’s like something from nineteenth-century times, I’m actually laughing at that.You don’t sound like you’re laughing, said Lorraine.”The reluctance to treat the relationship as anything but a secret is all wasted energy: far too late Connell realises that everyone knew anyway and nobody cared. But before that harrowing (all the more for it being so obvious, and confirmation of a ruinous narcissism) epiphany the two will break apart, find the pull of what each offers the other too much to be deprived of for too long, and then part ways once again leaving old, stitched-up wounds unpicked and agape, until the only means of reparation – another reunion – is once again sought. This return/abandonment scenario runs through the novel right to the close, and ultimately suggests two people incapable of being alone or within the confines of a relationship, but also makes plenty of indirect and persuasive comment on the inadequacy of conventional relationship parameters, to which these two candidates futilely attempt to adapt to.Connell inexplicably (but convincingly; this is one of Rooney’s chief attributes – everything she attempts works, purely down to brilliant characterisation) asks Rachel to go to the Debutante Ball, a gesture he knows will crush Marianne, and the novel then jumps ahead to their next confrontation. Marianne has a habit of letting Connell off the hook, and regularly leaves the door open by retaining an unflustered (or indifferent? – Connell is often unsure, and has to falteringly find his way back to who she is) mood.“Jesus Christ, she says. Connell Waldron! From beyond the grave.He coughs and, in a panic to appear normal, says: When did you take up smoking?To Gareth, to her friends, she adds: We went to school together. Fixing her gaze on Connell again, looking radiantly pleased, she says: Well, how are you? He shrugs and mumbles: Yeah, alright, good. She looks at him as if her eyes have a message in them. Would you like a drink? she says. He holds up the bottle Gareth gave him. I’ll get you a glass, she says. Come on inside. She goes up the steps to him. Over her shoulder she says: Back in a second. From this remark, and from the way she was standing on the steps, he can tell that all these people at the party are her friends, she has a lot of friends, and she’s happy. Then the front door shuts behind them and they’re in the hallway, alone.He follows her to the kitchen, which is empty and hygienically quiet. Matching teal surfaces and labelled appliances. The closed window reflects the lighted interior, blue and white. He doesn’t need a glass but she takes one from the cupboard and he doesn’t protest. Taking her jacket off, she asks him how he knows Gareth. Connell says they have classes together. She hangs her jacket on the back of a chair. She’s wearing a longish grey dress, in which her body looks narrow and delicate.Everyone seems to know him, she says.He’s extroverted.He’s one of these campus celebrities, says Connell.That makes her laugh, and it’s like everything is fine between them, like they live in a slightly different universe where nothing bad has happened but Marianne suddenly has a cool boyfriend and Connell is the lonely, unpopular one.He’d love that, says Marianne.He seems to be on a lot of like, committees for things.She smiles, she squints up at him. Her lipstick is very dark, a wine colour, and she’s wearing make-up on her eyes.I’ve missed you, she says.This directness, coming so soon and so unexpectedly, makes him blush. He starts pouring the beer into the glass to divert his attention.Yeah, you too, he says. I was kind of worried when you left school and all that. You know, I was pretty down about it.Well, we never hung out much during school hours.No. Yeah. Obviously.And what about you and Rachel? says Marianne. Are you still together?No, we broke up there during the summer.In a voice just false enough to sound nearly sincere, Marianne says: Oh. I’m sorry.”At no point are we led to understand that either Marianne or Connell will drift apart for long, or that any of their intervening relationships are likely to last. Much of the novel’s enjoyment is derived from seeing this genuinely likeable, if fraught, match-up reconvene; much of its power is hewn from the impossibility that any reunion can last.Marianne’s home life becomes a growing if disturbing matter of relevance. Her long-dead father, it’s revealed, used to beat her up; her brother, a hectoring, leering monster, has taken on this mantle and aggressively hounds her whenever she’s in the house, or whenever she returns once she’s left, the level of his rage, steeped in a parental model that exculpates and validates his vile habit, worsening until a particularly violent confrontation leaves Marianne with a broken nose. (This harrowing scene, an extreme but typical unravelling among such deeply dysfunctional siblings, is compounded by the matter of Marianne seeking openly violent relationships in which she is submissively beaten by a series of appalling predators, such as a Swede called Lukas who ties her up and takes photos of her in degrading poses; such acts make warped sense of her worthlessness and subjugation and yet offer brief, vacuous emancipation from it. She even asks Connell to perform such acts, but he refuses, which is yet another cue for their coming apart.) Connell is the only person she thinks of to ask for help, and for all the complexities surrounding their failure to resolve their attraction to each other, he instinctively drops everything to run to her aid. But it’s a disaster that you imagine is merely the precursor to one greater still.Normal People is a beguiling work that quickly and uncannily fleshes out several indelibly wrought characters, in particular the two central players, Marianne and Connell, whose misfortunes, mutual and exclusive (not that anything either does occurs out of the other’s shadow), and messy shucking-off of adolescent skins becomes a desperately compulsive drama. Marianne, we begin to feel, is not going to change, and Connell, after fluctuating dalliances with ‘normal’ life, spins back into her orbit, having tried to change, to leave her behind, to eschew the claustrophobia of being that close to someone, relents and allows who he really is some respite.You can’t achieve any of this – a slender storyline entirely reliant on the two central figures being compelling enough (I won’t say likeable; I found both extremely likeable but doubt all readers will, and surely far more important for a character to be intriguing than potential good company) – without fascinating characters, and characters are fascinating either through what they say and do or what they don’t say and do, and the meanings implicit in both acts and non-acts. The combination of outward and inward dialogue here – and the avoidance of exposition – creates two very complicated counterparts tormented by themselves, only at ease with each other, until the ease becomes something else, much misreading and misrepresentation is allowed to unfold, and a coming-apart augments self-loathing on both counts, which is then exacerbated by the fact that neither of these people are fully formed individuals. Much of their character is formed from what they see in each other, and how the other perceives them, a perception that is in itself subject to the usual mercurial changes and doubts.It’s interesting that as Connell begins to understand how he feels and who he might be, this acceleration in his self-perception occurs largely through writing. He composes long emails to Marianne and at one point, when meeting her along with other friends (which include the most enduring of her appalling partners, a ghastly Tory thug who revels in the imbalance of their relationship) bemoans being in her presence as it means he can’t write to her instead. He can’t think while around her, only react and want; when writing to her from a distance he understands what she means to him and in turn what he really wants – to keep her in his life. He can’t communicate with anyone else in remotely the same way, and wonders (unlike the reader) why...and in the meantime develops as a writer, spurred on by his muse.Rooney’s ear is often troublingly dead-on, and much of the novel’s success is drawn from the mortifying precision with which she assembles her protagonists’ woes via how their relationship falters, develops, comes apart. Neither can quite get a firm handle on the other, or themselves. But together they experience fleeting peace, a peace that can’t last. They recognise in each other the only place in which the world can be shut out, but soon forget that the world is, in fact, no real place for them, and yet it’s something that has to be contended with. While their bond isn’t illusory, it’s corroding, and untenable, and they will eventually both have to become whoever they’re going to become, at a disinterested world’s behest, without the person who knows and understands them best.“Do you think it would be better if we had never been together? she says.I don’t know. For me it’s hard to imagine my life that way. Like, I don’t know where I would have gone to college then or where I would be now.She pauses, lets this thought roll around for a moment, keeps her hand flat on her abdomen.It’s funny the decisions you make because you like someone, he says, and then your whole life is different. I think we’re at that weird age where life can change a lot from small decisions. But you’ve been a very good influence on me overall, like I definitely am a better person now, I think. Thanks to you.She lies there breathing. Her eyes are burning but she doesn’t make any move to touch them.When we were together in first year of college, she says, were you lonely then? No. Were you?No. I was frustrated sometimes but not lonely. I never feel lonely when I’m with you.Yeah, he says. That was kind of a perfect time in my life, to be honest. I don’t think I was ever really happy before then.”So it’s a horribly wrenching, moving tale, in which you’re simultaneously delighted to see the two protagonists back together whenever that happens (and want to know if such recouplings might also be on the cards beyond the novel’s agonising but astute ending), but then fearful of what’s going to go wrong and how badly, and the subsequent fallout. You can only create a story as simple yet enduring as this one if the nuances of behaviour, the potency of the spark, the import of every act is freighted with meaning and urgency and vitality and care. Sally Rooney cares about people, understands them and empathises with them. When you’re as good as she is, when even the briefest cameo is invested with the kind of deft, vivid élan that renders their authenticity beyond question, that goes a long way."}, {"Review": "★★✰✰✰ 2 grungy starsIf you believe that characters who dislike themselves, shrug a lot and say \"I don't know\" 24/7 , are very deep and realistic, well this is the perfect read for you. Or if you enjoy reading about \"in\" authors...look no further. After all, Rooney is \"defining a generation\". Yikes! If you are thinking about reading this novel, I suggest you listen to the following song instead, since it will take you less time and you will get the same story:https://www.youtube.com/watch?v=BjMwd...While I enjoyed Rooney's style, the way in which she interweaves ordinary moments with emotionally charged ones and the uncertainty that pervades her story, I was also annoyed by how artificial her novel is. I had the impression that Rooney was trying to conjure a certain millennial \"vibe\" through her characters and their experiences. Connell and Marianne lacked depth and, as stupid as it might sound, character. Their looks were emphasised in a way that made them \"stand out\" from others: they are skinny and beautiful, they smoke, they make languid movements, they are smart, and unlike their peers they actually care about world politics. Throughout the course of this novel we are told how DIFFERENT and SPECIAL they are. Marianne comes from a wealthy and abusive family (we are supposed to feel bad for her), Connell was raised by his mother and suffers from bouts of anxiety and depression (we are also supposed to feel bad for him). That they have issues that they can't cope with is realistic, but what I didn't appreciate is the romanticising of their difficulties. What I didn't like is that being \"alienated\" is synonym of \"cool\" and that seeking sadomasochistic relationships is understandable/inevitable if you come from an abusive family. Rooney handles serious issues (eg. an abusive family, depression, etc.) very badly.Marianne and Connell aren't terrible people but god, they are so self-involved. Their relationship is made to appear fraught but I didn't always understand why. Drama for the sake of drama? They enter forgettable relationships with equally forgettable people but they remain fixated on each other. Why? No one knows...Marianne is depicted by the author and the other characters as being the sort of person who does not to care about others' opinion of her but soon after a breakup with a cliched dick boyfriend she is obsessed with what people are saying about her...Connor is...intelligent? Indecisive? As interesting as a slice of white bread?!Secondary characters and family members are barely sketched out, they have little to no purpose other than creating more \"drama\" for the main characters. Marianne's family was so badly written that I had difficulties taking them seriously. Her brother is laughably cruel and her mother is uncaring and snobbish. Friends from college serve very little purpose, other than making the main characters seem \"different\" and \"real\" (special snowflake alert).What I disliked the most is that by the end neither Marianne or Connell show any sort of character growth.  Not that I always want to read about characters who learn from their mistakes or gain some sort of insight from their experience, I can appreciate characters that keep perpetuating their 'bad' behaviour or even characters who get worse and as their story progress they regress. But they have to be believable. These two seemed were not. They were merely an 'aesthetic', more befitting as subjects of a black and white grunge photo than anything else. The only reason why I finished this novel is that I listened to the audiobook and the narrator managed to make this otherwise unappetising storyline sort of okay."}, {"Review": "In her first novel, ‘Conversations with Friends’, Sally Rooney introduced us all to her schtick – young Irish novels for young Irish people. Her debut followed a sort of ménage à quatre in which no character, and I literally mean no character, came out as loveable or bearable. It was like witnessing a car crash in slow motion. ‘Conversation with Friends’ also lacked a cohesive mood and prose style. The Guardian rightfully bashed Rooney as a non-visual writer, stating that the dialogue in the novel read like ‘he-said she-said reportage‘. Yet the public warmed to the novel, and Rooney herself. Therefore, the publication of her follow-up book, ‘Normal People’, was heralded from on high as if Rooney was finally gifting her adoring public with another darling epistle.Continue reading my review on my blog here."}, {"Review": "(2.5) Conversations with Friends was one of last year’s sleeper hits and a surprise favorite of mine. I was part of the official shadow panel for the Sunday Times Young Writer of the Year Award and was pleased to see Sally Rooney win the prize. So I jumped at the chance to read her follow-up novel, especially after it was longlisted for the Man Booker Prize. It’s been earning high praise from critics and ordinary readers alike as being even better than her debut. Alas, though, I was let down.Normal People is very similar to Tender – which for some will be high praise indeed, though I never managed to finish Belinda McKeon’s novel – in that both realistically address the intimacy between a young woman and a young man during their university days and draw class and town-and-country distinctions (the latter of which might not mean much to those who are unfamiliar with Ireland).The central characters here are two loners: Marianne Sheridan, who lives in a white mansion with her distant mother and sadistic older brother Alan, and Connell Waldron, whose single mother cleans Marianne’s house. Connell doesn’t know who his father is; Marianne’s father died when she was 13, but good riddance – he hit her and her mother. Marianne and Connell start hooking up during high school in Carricklea, but Connell keeps their relationship a secret because Marianne is perceived as strange and unpopular. At Trinity College they struggle to fit in and keep falling into bed with each other even though they’re technically seeing other people.The novel, which takes place between 2011 and 2015, keeps going back and forth in time by weeks or months, jumping forward and then filling in the intervening time with flashbacks. I kept waiting for more to happen, skimming ahead to see if there would be anything more to it than drunken college parties and frank sex scenes. The answer is: not really; that’s mostly what the book is composed of.I can see what Rooney is trying to do here (she makes it plain in the next-to-last paragraph): to show how one temporary, almost accidental relationship can change the partners for the better, giving Connell the impetus to pursue writing and Marianne the confidence to believe she is lovable, just like ‘normal people’. It is appealing to see into these characters’ heads and compare what they think of themselves and each other with their awareness of what others think. But page to page it is pretty tedious, and fairly unsubtle.I was interested to learn that Rooney was writing this at the same time as Conversations, and initially intended it to be short stories. It’s possible I would have appreciated it more in that form."}, {"Review": "It was only recently that I got round to reading Rooney's first book (Conversations With Friends) and that was really only because I was waiting for this one to be published so that I could finish my reading of the 2018 Man Booker long list. I didn’t enjoy CWF, but then I started to see positive reviews of Normal People from other GR reviewers whose opinions I value and trust. So, I approached this one in a hopeful mood: I expected it to be better than CWF and thought there was a good chance I would really like it.One out of two isn't too bad, is it?For my tastes, this book is far, far better than CWF. Perhaps this is because it is much more tightly focused on just two characters rather than the larger group in the first book. We follow Connell and Marianne through their on-again-off-again relationship that is never truly off but seems to struggle to be truly on. Both have their struggles and their issues that they battle with and we do get to see a lot of their inner worlds. They meet at the start of the book because Connell’s mother is a cleaner employed by Marianne’s mother. Connell’s mother, Lorraine, is my favourite character in the book and I really wish we had a lot more of her! Initially, you think the book is going to be simple to follow as each chapter is headed with details of how long after the previous chapter it is and which month of which year it is therefore set in. But then a lot of the story is told in flashback, so you do have to keep aware. Helpfully, most of the \"now\" stuff is narrated in present tense and the flashbacks in past tense.Like CWF (and like an awful lot of other books), this book gets darker as it progresses. And, also like a lot of other books, I felt it improved as it went along. I thought I was going to find the focus on just two characters rather claustrophobic, especially as the story darkened, but that didn’t happen. I thought I was going to find a story of two teenagers in love rather maudlin, but that also didn’t happen. Indeed, at one point towards the end Marianne asks Connell a question and it made me cry! Near the start of the book, Marianne feels a \"thrill of femininity\" when a man stares at her breasts and for a long time I struggled with that as I couldn't see how someone could write something like that in this day and age (I'll take advice from women, though, if it’s true!). But, I think that as you get to know Marianne, it starts to make some sense. I would certainly caution the heterosexual men reading the book to not take it as helpful advice for talking to girls.So, why only three stars? This is about personal preferences/taste. I have to confess that I struggle to like Rooney’s writing style. I find it bounces from the banal:The kettle comes to the boil. Lorraine sweeps the line of hairpins into the palm of her hand, closes her fist around them and pockets them. She gets up then, fills the cup of tea, adds milk, and puts the bottle back in the fridge. He watches her.to the overblown:She feels pleasurably crushed under the weight of his power over her, the vast ecstatic depth of her will to please him.Somewhere in-between would be great. And, to be fair, there is stuff in that in-between zone. That’s entirely a personal preference: it’s not about whether this is a good or bad book, just about my own reaction to it.I also began to wonder if Rooney has a colour vision issue. We have \"chlorine-white\" and we have \"Raincoats glistening in the undersea colour of street lamps\" as examples. I’m not sure what to make of these. I have a similar reaction to phrases such as \"Her body was all soft and white like flour dough\" (which I read to my wife and she went \"Ewwww…that’s creepy!\") and \"Lorraine’s eyebrows moved around\". Around?!?!Overall, I enjoyed this a lot more than I did CWF, but I didn’t think it was a great book. It was fine, parts of it were good, but I couldn’t get excited about it."}, {"Review": "To be honest I don’t really know how to review this. I think this is probably the best book I will read this year. Rooney is the kind of writer who is not only exceptionally skilled at writing, but she’s also the kind of writer who really gets people. This novel, perfectly captures what it is to be young, anxious, confused, and imperfect. It’s much more than an exploration of relationships and their dynamics, it’s discussion of youthful decision-making, in all unthinking, arbitrary glory, and the power this has to change the course of lives is astute. In short, I think Rooney is very, very clever, and this book is too."}, {"Review": "DNF at page 120..This started really promising, but turned into a big yawn.. So much talk it could have been easily titled \"Conversation with Friends 2\"Marianne and Connell were a bit interesting in their hometown, but in Dublin it's turned into a journal, a game of sleeping with different people and being so unsure about the situation between them? I really don't enjoy details like \"destiny's child was playing..\" or \"she was wearing a black vest and the other girl was wearing this and that\". Just no.I am sadly on the \"Not likey\" train on this one. "}, {"Review": "3.5 stars, rounded down.I wasn't looking forward to this Booker longlist novel, but I was impressed despite myself. I thought it was going to be new adult written as lit fic, but that assumption wan't accurate. The novel doesn't always work, but I found it thought-provoking and sometimes insightful. More tightly focused and less trope-y than Conversations With Friends, it's a classic coming-of-age university novel but very much of this era (which makes me curious about how it will age and be regarded retrospectively).The plot is simple. Marianne and Connell grow up in the same small town in Sligo and go to the same secondary school. Marianne comes from a wealthy, dysfunctional family and Connell is raised by a single mother. Apart from school, the two are connected because Lorraine, Connell's mother, is Marianne's family's house cleaner. Both are very intelligent but Connell is content and popular at school, while Marianne is basically an outcast. These opposites become attracted to each other and embark on a secret relationship, which ends before graduation when Connell humiliates Marianne in classic teenage-boy fashion. But before their break, both had decided to apply to Trinity College Dublin, so they make their separate ways there in the fall.At college the tables are turned. Marianne's wealth, standoffish personality, and general air of alienated boredom make her a welcome addition to the rich college kids' clique, while Connell's working-class background and friendly, relatively uncomplicated disposition place him at the margins of several groups (especially because he's not interested in joining one of the many college societies). Ironically, Marianne comes to his social rescue when they encounter each other and resolve their breach. The deep connection and sexual attraction they feel for each other resurfaces and shapes the rest of their time at Trinity. The novel is all interiority and focuses entirely on Marianne's and Connell's relationships (with each other and with other people). Although both are very smart and hard-working, the reader learns almost nothing about the substance of their studies until well into the second half of the novel. Instead we read about their not-a-romance, their hookups, their other sexual and romantic relationships, and their friendships, especially Marianne's female friendships. They break up and make up, inexorably tied to each other as friends with or without benefits. Connell has one other long-term relationship which he thinks is a healthier one but which doesn't satisfy him as much, while Marianne has a couple of unhealthy relationships in which men treat her badly (both physically and emotionally), to some extent at her request. Class issues shape their relationship quite a bit in high school and their early college years, but after Connell wins a prestigious scholarship (5 years of tuition and room & board), class differences become cultural and symbolic more than material. Town vs. gown issues essentially get resolved as well, with Marianne's high school bullies maturing and improving their behavior (one even apologizes directly to her for his previous actions). Marianne's mother and brother continue to abuse her, but eventually she finds a way to deal with that as well, and it brings her closer to Connell. Rooney captures a certain type of college experience really well; the cliquishness of first- and second-year students, the sense of dislocation, the confidence gained over time for some paralleled by the greater alienation of others. As in Conversations With Friends, there is an almost affected detachment on the part of all the young people, no matter how intense the emotion. People cry, hurt themselves, are hurt by others in deep and profound ways, but it's all depicted and described at a distance which mirrors the alienation some young people clearly feel. Objectively, Marianne and Connell are massively endowed with social, cognitive, and/or financial capital (Connell doesn't have money but his talent is recognized and rewarded). But they don't feel fortunate, and the depression they separately experience is symptomatic of quite a few college students in their age and cohort. I found some of the gender aspects of the novel troubling. Marianne's desire to be dominated is presented in a muddled way; at first it seems to be purely a sexual preference, but then it becomes a reflection of her sense of self-worth, history of familial abuse, and the apparently total absence of love in her upbringing. I wish the text hadn't conflated sexual desires with psychological trauma, because that plays into some harmful stereotypes. The other gender dimension that surfaced over the course of the novel is that while both Connell and Marianne are plagued by self-doubt, anxiety, and depression, Connell's psychological problems don't stop him from being academically successful and able to develop longer term career goals. As the novel unfolds, we gain a good sense of what Connell wants to do with his life and how he's developing the skills to achieve it. We see none of that with Marianne, even though we are told and shown that she is at the top of her cohort. Objectively she is better placed to pursue whatever goals she develops because she has the intellectual chops, work ethic, and financial cushion to achieve them. But she has no goals that we can see, and we're even told at one point that if she can only aid a few people in this screwed up world, there's no point in doing anything. Connell has both an inner and outer life that will take him into adulthood, but Marianne doesn't. Is all of this supposed to be chalked up to her terrible childhood? That seems like an inadequate explanation to me, both textually and in terms of what women like Marianne are actually doing in the world despite the obstacles in their way. The prose style is very similar to that in Rooney's first novel and one she is clearly making her own. It's detached and self-consciously affectless, and as with the previous book, there are phrases that don't come off. But overall I think it's successful. There are some nice touches, like how Connell engages with literature when he first arrives at university and how it fails him when he's in a deep depression a couple of years later. I waver between 3 and 4 stars. Rooney has clearly set out to do what she intended, so in that sense the book succeeds. But it is once again a narrow slice of a class-specific generational experience, and it sends some messages about gender that I'm not sure are intended and that undercut the novel's tone of even-handedness. And it's focused on personal relationships in a way that almost completely exclude the effect of events and institutions on those relationships. I understand from interviews she's done that that is Rooney's interest, but relationships don't exist in a vacuum.I can't help but contrast this novel with Anna Burns' Milkman, which is an even longer novel rooted in the interiority of only one character. And yet Burns weaves a complex, rich tapestry which places that single character's experience within a much larger context, and it does so without sacrificing her singularity."}, {"Review": "\n“I don’t know what’s wrong with me, says Marianne. I don’t know why I can’t be like normal people.”\nI will officially read (and likely love) everything Rooney writes. I prefer her debut to this one but the consistency in her writing and the themes she explores make her and her works a landmark to understanding our current generation -- which can be misinterpreted as very many things (according to the media, most of them not good) but, mostly I think what makes me and many other people in my generation connect with Rooney is the subtlety of her writing and the nuances of dread and bleakness she puts into everyday situations, in particular human relations.\n“For weeks now she has had this feeling, the feeling of moving around inside a protective film, floating like mercury. The outside world touches against her outside skin, but not the other part of herself, inside.”\nNormal People is just that: a tale of two people and their relationships, the pushes and pull of everyday life and how every aspect of our life will influence us in some way. The epigraph of this tale is a quote from George Eliot’s Daniel Deronda, and it’s a beautiful and profound summary of what we should (could, might) take away from this book: relationships shapes us, transform us, influences us. \n“Most people go through their whole lives, Marianne thought, without ever really feeling that close with anyone.”\nEven if at the surface we’re looking at the relationship between Connell and Marianne, our main characters, Rooney introduces us to a series of side characters (some of them omniscient) that will prove just how much human relations mean to, well, humans. We are social beings and, as such, it is impossible to detach ourselves from our family, our friends, how they influence and shape us. We can rise above them, yes, when needed, but there’s always something about us that is unmistakably someone else, or the product of our relationship with someone else. And Sally Rooney takes this complex topic and makes it fresh and profound: it is important to acknowledge the importance of youth and especially our relationships. We’ve all been young at some point of our lives.\n“Looking in his eyes she says: Well, hello. He senses a certain receptivity in her expression, like she’s gathering information about his feelings, something they have learned to do to each other over a long time, like speaking a private language.”\nI can understand why this book, or her debut, will not work or feel meaningful to some people, particularly those of older generations (although there is nothing particularly “millennial” about this story: no direct mentions to facebook or snapchat or any of the many other aspects that seem to characterize the generation; in fact, there’s only mention of the e-mail, which is not the most sophisticated of today’s social media platforms), but I believe there’s still great importance in it. I can’t stress this enough, likely won’t articulate it in a way that will truly convey the mastery of her words, but Rooney’s sensibility is her greatest strength. As a young novelist, she’s writing about experiences that relate to her and she acknowledges how important and meaningful they are: even the sex, which she’s said is essential (and I agree) to her character’s understanding and depth. It is a part of normal people’s lives, so why not include it? In this book in particular, it becomes a specially important moment of relevance to one of the characters.In the end, just like in her debut, there’s something unspokenly relatable about her characters and their stories, their struggles and achievements, all covered in a film of melancholia that will make the reading of this book a sensory experience that will likely gut you, make you feel hollow but you can’t quite tell why."}, {"Review": "Chuyện yêu đương thời nay có lẽ đã khác xa chuyện yêu đương thời xưa, trong cái thời đại mà sự phát triển của công nghệ khiến người ta kết nối dễ dàng hơn nhưng đồng thời cũng cô đơn hơn nhiều. Vì vậy đọc \"Trà Hoa Nữ\", \"Đồi Gió Hú\" hay \"Kiêu hãnh và định kiến\" ta cũng sẽ thấy hay đấy, thú vị đấy nhưng ít nhiều sẽ cảm thấy hơi lạc điệu với đời sống hiện đại. Vậy giới trẻ hiện nay yêu như thế nào, câu hỏi có lẽ chỉ có chính người trẻ trả lời được, với Sally Rooney - tác giả người Ireland sinh năm 1991 - cùng với tác phẩm được đánh giá rất cao \"Normal People\" khi lọt vào đề cử Man Booker năm nay và nhận được rất nhiều lời khen của các nhà phê bình, thì tình yêu thời nay có lẽ đang là trào lưu của on/off romance.Chúng ta hãy nhìn lại cách chúng ta yêu bây giờ, phải chăng xung quanh có rất nhiều sự lựa chọn nên ta rất dễ dàng dao động, dễ bị say nắng dù đã có một người mà ta nghĩ là dành riêng cho bản thân mình, và rồi giữa bộn bề bao nhiêu thứ trong đô thị chật ních người, ta rơi vào cảm giác cô đơn và cảm thấy tình yêu của đối phương không đủ để bù đắp lại sự trống vắng mênh mông trong lòng, không đủ để chữa lành những vết thương và ta lại quyết định ra đi để tìm một người nào khác và rốt cuộc lại vỡ mộng vì chẳng có ai có thể cứu vớt ta khỏi cuộc đời cô đơn lạc lõng mà ta đang đối mặt, và chính bản thân người đó cũng đang chiến đấu để thoát khỏi nỗi cô đơn vây kín. Connell và Marriane, thông minh, trẻ trung và dường như họ biết phải làm gì với cuộc đời mình thế nhưng cái thế giới điên rồ xoay vần này khiến họ sầu thảm, họ tìm đến nhau, chia sẻ nỗi niềm, hẹn hò, hôn và cả làm tình nhưng họ không gọi nhau là người yêu, họ không đặt tên cho mối quan hệ của mình dù trong sâu thẳm họ biết mình thuộc về người kia, họ vẫn muốn cái gì hơn nữa và muốn tìm hiểu những người khác, và rốt cuộc họ làm tổn thương nhau và tổn thương chính mình. Họ chia tay, cặp kè với những người khác, họ bị những người đó làm tổn thương, rồi lại quay lại gặp nhau để tìm cách hàn gắn, an ủi nhau. Mối quan hệ cứ thế kéo dài suốt 4 năm ròng (theo mốc thời gian trong sách nhưng dường như sẽ kéo dài mãi vì dù câu chuyện đã khép lại, dấu chấm cuối cùng đã được đặt thì Connell và Marianne vẫn tiếp tục lạc lối trong cái thế giới của họ - hay thế giới của chính chúng ta), và tôi cảm giác từng mảnh của trái tim cứ vỡ ra khi đọc về những tâm sự của hai con người ấy, chúng mang lại cho tôi một sự đồng cảm đến độ như thể những câu chữ ấy đã chạm đến phần sâu kín nhất trong câu chuyện của chính tôi, và những bối rối hoài nghi về tình yêu, về cuộc đời về những mối quan hệ bao lâu nay ngỡ chẳng ai hiểu bỗng được 2 nhân vật giải bày.Một cuốn sách nghe có vẻ điên rồ khi chỉ viết về chuyện tình của hai người trẻ, một chủ đề mà có lẽ đã có bao tác giả viết về nó, thế nhưng Sally Rooney là tác giả đầu tiên khiến tôi cảm thấy sự thấu hiểu sâu sắc về vấn đề này, không phải là một câu chuyện hời hợp dễ dãi trên bề mặt mà cô đã đào sâu những góc sâu kín nhất trong mối quan hệ và những nỗi bi ai khi ta phải đối mặt với quá nhiều thứ mà chỉ một quyết định nhỏ cũng có thể khiến cuộc đời ta thay đổi mãi mãi. Và Sally Rooney chỉ cho ta cái cảm giác chân thực khi ta trẻ, buồn bã, cô đơn và đắm chìm trong tình yêu, một cảm giác tuyệt nhất nhưng cũng tệ nhất cuộc đời mà ta sẽ chẳng thể nào quên được.Một cuốn sách ngọt ngào mà vẫn cay đắng, buồn thương mà không ủy mị, sâu sắc mà rất dễ cảm thông, trần trụi nhưng vẫn nên thơ, đau khổ nhưng vẫn đầy hy vọng, khiến ta vỡ tim nhưng vẫn xoa dịu. Tình yêu thay đổi chúng ta, nhưng đồng thời cũng giải thoát chúng ta khỏi bản thân mình, như cách Sally Rooney đã khiến ta một lần nữa tin vào điều đó trong cuốn sách tuyệt vời này."}, {"Review": "Sally Rooney is a writer that stands out as the voice of young Ireland. The natural milieu of her characters are intellectual college educated women and men in their teens and twenties. From her first novel “Conversations with Friends” to her new Booker longlisted “Normal People” she presents their stories about grappling with relationships and finding a place in society with deceptively straightforward prose. While this runs the risk of appearing to have a parochial view of the world, it moreover reads as emotionally honest and engaging in a way that few writers can pull off. This new novel is the story of Marianne and Connell who come from very different socio-economic backgrounds. Connell's mother works as a cleaner at Marianne's family home. The differences in class seem an inconsequential part of their relationship at first, but as they get older it has more of an effect on how they connect to each other. The story charts the staggered journey of their bond from 2011 to 2015. You can read this novel for the insights it gives into modern life and the plight of a section of an emerging generation, but it's moreover a modern romance which meaningfully engages the reader in the characters' growth as individuals and tantalizes with the question: will they or won't they get together? Read my full review of Normal People by Sally Rooney on LonesomeReader"}, {"Review": "Perhaps it was the great cover illustration that got me started, I'm not sure, but I read this book as if it were a graphic novel. I imagined each scene as part of a panel and read the speech as if in blurbs. But in my scenario, there would have been quite a few panels with empty blurbs because the two main characters, an on-off couple, often failed to communicate. I think this was one of the really great points the author made: how people can be really close, as close as sardines in a tin, and yet each remain in a separate compartment."}], "Genre": "Romance", "ID": "37539457", "Desc": ""}