{"Name": "29 Dates", "Image": "https://images.gr-assets.com/books/1531474519l/40798092.jpg", "Reviews": [{"Review": "I have one question: why was it necessary for a non-Korean to write about a Korean and criticize Korean culture while she's at it? According to the author's note, the author is Filipino-American, learned about seons from a Korean friend, and dedicated this book to her Korean sister-in-law. The author states that seons typically take place during or post-college, but she says in the author's note, \"as an author of fiction, I've taken some liberties with this practice.\"You cannot take \"liberties\" with a culture that's not yours. It doesn't matter if you have friends or family-through-marriage of that culture. That's going out of your lane, and I'm disappointed that an author of color would make this mistake, given how much people of color already have to deal with in terms of appropriation and fetishization.The nuance that this book would require is incredible. Jisu is Korean-born-and-raised, goes to a good Korean high school, and has hardworking, rich parents who adhere to strict cultural values, such as matchmaking and good grades. There is no way for a non-Korean to understand what the culture is like, much less understand how it is for a person who grew up in South Korea to suddenly move to America and go to a new school. Even I know this, and I'm South Asian.Jisu and many of the other characters criticize Korean culture a lot. There is the \"jansori\" Jisu constantly mentions, and then the constant criticism of the seons and her parents' expectations of her grades. Yes, it's pretty much a universal Asian thing for parents to expect nothing less than a 110% from their kids, but cultural differences affect that a lot! You can't criticize a culture that's not yours. Maybe the author wanted to be authentic and show how much resentment Asian kids have towards their parents and culture (as an Asian-American kid, I testify), but I'm not going to understand how it is for a Korean kid and a Korean kid isn't going to understand how it's like for me. Same rule applies here. A Filipino-American can't write about Koreans. This goes for any culture, really. I'm pointing out what I see here.The thing is, you can tell how awkward the writing is. The code-switching is unnatural and both Jisu's criticism and love for her culture seems forced. She talks too much about feminism and expectations and how much she misses home and her friends. Even her descriptions of the food is clunky, and it's especially noticeable because the description of the Filipino cuisine that comes up because of Austin is so, so much more authentic. I don't get why the author couldn't just write about Filipinos to begin with? If she was going to take liberties with Korean culture anyway, then why not.write her own and take liberties with it?If we're talking about the actual writing, it was strange. I don't understand why Jisu was so critical of \"teens\" when she was a teen herself. It was the wrong mindset for a teenager. And then there's Austin, who has no chemistry at all with Jisu, yet gets pulled into this insta-love thing that is too confusing. And while I love Dave, I don't see why it was necessary to even give him a girlfriend when Sophie basically had no screen time, not to mention the fact that the author made a big deal out of Jisu choosing a Korean in the end. All of it was forced.There's also the fact if Min and Euni. Aside from their naming (is Euni supposed to pronounced according to Korean romanization or the way the 'Eu' in Eunice is pronounced, given that's her full name) and did the author purposefully give Min a monosyllabic name and why? They seemed like promising friends, but we barely get to meet them before Jisu gets shipped to America and get only bits of texts from them. I can't even feel sorry for Euni's accident because I don't know her.This reminds me— the whole plot with Jisu getting shipped to America was so stereotypical and sudden. She sneaks home late and wakes up to her parents handing her tickets and saying she's taking the afternoon flight to a new country, where she'll live for the next year. It doesn't make sense at all. And then we get absolutely nothing about how Jisu feels adjusting to new life in San Francisco (which is impossible anyway, given that the author isn't Korean).I'm all for diverse casts. If there had been a Filipino MC and a Korean side character or even a love interest, it would be fine, but a non-Korean writing a Korean MC just doesn't work. Had this book been written by a Korean, I think it would've worked really well. If the author had written about Filipinos instead, it would've been even better, but you can't win everything, I guess.This book was just a whole mess. I was looking forward to read ALEX AND ELIZA soon, but after this book, I don't think I can read anything else from this author. It'd just make me uncomfortable. I'm a bit upset at this turn of events, but it is what it is. I hope the author sticks to writing about Filipinos from here onwards."}, {"Review": "Rating: 3.5 StarsJisu was devastated, when her parents shipped her off to San Francisco in hopes that she could perform better in an American school, but they may have given her the greatest gift, since her new environment did yield some stellar results.• Pro: Jisu was easy to like and root for. My heart broke, when her whole life was uprooted, but I admired the way she took it in stride, and also commended her on fulfilling her filial duties. Beside being under the standard pressure to get into an Ivy League school and earn top grades, she also had to go on a myriad of blind dates, which she did with a more or less open mind. • Pro: The dates were interesting. They were presented to us in a transcript format, and what I really liked was the way they paralleled something happening outside of the dates, as well as being a catalyst for Jisu's growth and change. She had discovered a lot about herself during these dates, even if she never happened to find \"the one\". • Pro: I adored Dave, and thought the chemistry and dynamic between him and Jisu was fantastic. One of my favorite scenes was when Jisu met his mom. Totally couldn't wipe the smile off my face. • Con: There were some really fun parts in this book and also, a lot of things I really enjoyed. I wish more of these things had been included. There were some times when the mood shifted, and it sort of made the story drag a little. • Pro: It's really difficult for a teen to leave her friends, but Jisu was lucky to find such a great squad in San Francisco. I especially loved Hiba, who was fierce and not afraid to speak her mind. • Pro: Jisu's grandfather was a most precious human. I loved and adored him so much, and was grateful that Jisu had such a phenomenal ally. • Pro: The ending went in a direction that left me with a smile on my face. I was really happy with how de la Cruz finished Jisu's story (even if I wanted an epilogue, too)Overall: A story of growth, change, family, friendship, and finding your passion, which was thoughtful and satisfying.*ARC provided in exchange for an honest review. BLOG | INSTAGRAM |TWITTER | BLOGLOVIN | FRIEND ME ON GOODREADS"}, {"Review": "***3-3.5 stars ***I'm such a sucker for YA novels that I hope I never lose touch with them. They take me back in time; I always enjoy them and feel that I can relate to the story. Melissa de la Cruz has been one of my favorite YA authors, specifically her Blue Bloods series. 29 Dates did not disappoint. Jisu, a girl from South Korea is sent by her family to San Francisco to complete her senior year of high school. In Korean culture, seons are arranged dates to help matchmaking within their culture. The story alternates between Jisu's high school experiences and applying to colleges with a transcript of each seon, which of course there are 29 of. It's a quick and easy read that I really enjoyed and recommend if you're looking for something light-hearted. **Special thanks to NetGalley and Inkyard Press for allowing me an ARC in exchange for an honest review.**"}, {"Review": "I think Melissa de la Cruz is a fantastic author who has done wonderful things to bring more diverse books to teens.. But I'm not sure how I feel of her writing a Korean (not even Korean-American) MC with a detailed Korean background. I'm not Korean so I can't speak on how well of a representation this book was so I'm not going to. A lot of moments did feel a bit jarring for me as a reader, though. It was like watching a kdrama but without the heart and love poured into the story.(One of the characters is Filipino-American, and honestly that one chapter spent with his family, THAT was the heart and love I wanted to feel from Jisu and her family.. But I just didn't?)\n\"Don't ignore your passions. Don't ignore that voice in your head. You know, the one that talks with your heart. If you ignore something like that long enough, it'll eventually explode and just make a huge mess!\"\nThis book is light, fun, and a quick read.I DID enjoy the main character a lot. She's the reason why I read until the end.The friendships were fun. The romance was kind of a mess, to be honest. One was unnecessary and the other felt rushed. It was kind of a bummer since I think as an author it was supposed to come across as a romantic comedy, but sadly the romance just didn't work for me. I was only rooting for Jisu to fall in love with herself above everything else.This book just wasn't for me. I believe some readers will definitely enjoy it, though! <3"}, {"Review": "Sooo what was this book even about? Like I understand the blurb, but when I got to the book I was greeted with a very bland, plotless, pointless book. Let's start with the plot. Where was the plot? This book progressed but there was no clear plot in sight, I didn't feel any big conflict or resolution as the book just felt like a threadbare patchwork quilt of writing. Another gripe I had was that the author seemed to be attempting to ride from the point of view of a teenager, but as a teen, I can tell you that the writing was very out of touch. It felt like Melissa de la Cruz just googled teenage pop culture and stuffed as many outdated references as she could and it all it did was make me cringe. Character development in this book was also very dissatisfactory. The only character remotely given any depth was Jisu and the rest of the characters were like cardboard cutouts. The author gave them a brief character description and then didn't build on their character, making it hard to build any type of connection with the book.One thing I did like was the romantic aspect of the novel, because I did felt that it was an accurate model of how relationships today tend to go, and I thought it was very genuine and cute. One thing I found odd was the author was writing about Korean culture and at some points even criticizing it but she wasn't actually part of the culture, so I just thought it was clunky and odd at some points. It seemed a bit disingenuine and it read like someone who did a bunch of research on Korean culture and less like someone who experienced it. I received this book on NetGalley in exchange for an honest review."}, {"Review": "Jisu is about to start her last year of HS when her parents sent her to San Francisco. There she will focus on school, get great grades and get into a great College. I must say that school in Seoul sounds horrible, Jisu thinks so too. And at the same time she wants those good grades because that is what ger parents want. As for her parents, evil! They just said pack your bags, you are leaving tonight! But San Francisco is great for her. She gets to be more on her own. She finds new friends, she gets to take more photographs without her parents telling her to study instead.Of course one of the keypoints of the book is the matchmaking thing she is part of. Her parents wants her to find a good boyfriend, with good parents, and he has to have a good future. So she goes on dates and we take part of horrible ones, nice ones, but no amazing ones.She continues these dates in SF, and she also crushes on a classmate.I liked Jisu. She was at her best when idiot dates annoyed her. She sure knew how to speak back.I also really want to try Korean food! Why can't someone open a restaurant!? It was very YA. Cute, fun and everything working out in the end.NarratorI liked her Jisu voice. It made me want to be friends with her. And her Austin, omg I could so see him before me"}, {"Review": "Ji-su is a 17 year old girl from Seoul Korea. She is about to begin her last year of high school, but her grades are not up to her parents standards. During the summer she has been ordered to go on Dates, arranged by a matchmaker hired by her parents. One night she decides to cancel a date and go to a club with friends to see a bunch of bands. When she comes home her parents break the news, she must go to America where she might excell in the laxed atmosphere and without the distractions of her friends. The dates were mostly ordinary, with a bunch of rich entitled children/boys.  I found the story ordinary, though easy to read, seemed like it suited a much younger audience then YA. I was bored, but this is just my own opinion. The story was far to young and slow paced for me. It kind of just sits there although Ji-su was interesting, most of the male characters were pretty much carbon copies."}, {"Review": "3.5 stars actually. Also many thanks to Netgalley and Harlequin Australia for the arc!I feel like I should have looked at the cover more closely. I also probably should have read the blurb. But in the end, I kind of actually like this lighthearted romcom. It was cute in it's own way. Definitely not what I was expecting (and at the same time was, hence the title) and for a moment I felt very disjointed--the sad effect of reading the author's name and getting hit with full Korean content. But it was nice. Jisu is mostly a sympathetic character with the usual highschool problems. I liked seeing her stress over college applications, it doesn't feel the same as the usual process I read about. So it was nice, and familiar (as an asian). I do kind of wish I got more of a feel of what she would do at the end. The love interest was interesting, but it amazes me how I kept thinking it was way too typical! But he was nice and cute and good love interest material. As for the other guy, evidently he was a total jerk, and I can't express how many times I wanted to shake Jisu. Which goes to show how it happens, and the thoughts that come with it, and how we learn from it. More so for Jisu who was uprooted and replanted and dealing with the different cultural expectations. I did like de la Cruz's interpretation and creativeness in bending this story into shape, and despite the obvious author-culture vs character-culture going on, I also don't think that mattered a lot. The author in her notes essayed her own exploration, experiences, and acknowledgement of her cultural informants; and I think it's great that a popular author can go out there, research (as they all do for all stories whether it's science fiction or history etc) and then give a decent portrayal of it to expand the diversity of the literature.So:Story: Very cute, some affective, and grows on the reader (I will admit that the beginning threw me off and it took me a while to get into it).Romance: It's not in-your-face, and Jisu does come across as a bit of a cynic, but also a teen who's looking for the right answers. It's a cute romance.Characters: Friends feature highly! I love it. I love how they're supportive as well! It's strange for me to say that it's nice to see Jisu integrate so easily into a new school and country. So much so she makes good friends in both san fran and maintain her home friendships back in Korea.Love interests and seon dates: The main guy is nice! The other guy is a tool! And the seon dates were amusing. So that was fun.Writing: I presume this usual Melissa de la Cruz writing? This is my first work by her and I didn't dislike it. I liked the flow, and she makes Jisu a sympathetic character.Overall, I would recommend this as a fun, light, summer read. I don't put much heavy stock in it or emotion, but it certainly has a nice little ending to put a smile one's face. Perfect for the bloody hot summer we've been experiencing down under!"}, {"Review": "29 Dates by Melissa de la Cruz is an adorable romantic comedy that's sure to elicit many giggles from its' readers. However, the book lacks the depth required to be truly memorable, and like many within its' genre, falls into the trap of silly twists and unlikely happenstance in its' second half.This book tells the story of Jisu, a talented photographer and student of one of South Korea's most elite high schools. While Jisu is happy to float her way through life, spending time with her friends and snapping pictures, her parents have big dreams for her. Not only do they want Jisu to secure a place in a top university, they also want her to find the perfect boyfriend; setting her up on a series of blind dates with wealthy and eligible young bachelors. However, when Jisu continues to show preference for fun over study and long term planning, her parents intercede by sending her across the world to attend an American high school. Once there, Jisu meets two boys who have a big impact on her life and her world view. There's Austin, a cute and laid back surfer who really isn't the girlfriend type, and Dave, who starts out as a good friend to Jisu, though part of her secretly hopes for more. Ultimately, 29 Dates is not a bad book, though it wasn't for me. Jisu is firmly established to be a member of the upper class, her parents give no second thought to providing her with first class plane tickets or a private school education. This isn't something that interested me, or something that I find relatable. After reading the first few chapters, I was concerned that the book would be some kind of Korean Gossip Girl, however, Jisu's wealth doesn't play as much of a role in the story when she arrives in America. From there, the book is fairly typical high school fare, following Jisu through crushes, dates, and university applications. There are a lot of cute and funny moments, and I think this book will appeal to fans of To All the Boys I've Loved Before or Simon VS the Homo Sapiens Agenda. However, there were a couple of minor plot twists near the end of the book that really lowered my opinion of 29 Dates as a whole. I won't give away any spoilers, but I will say that parts of the ending just felt silly. "}, {"Review": "This is really more like 2.5 stars, but it was a quick and enjoyable read in its own way, so I’m rounding up. I had heard of Melissa de la Cruz before but never actually read any of her books, and honestly, this one disappointed me. The writing wasn’t super strong, and the story was kind of predictable. I usually love YA, but this was a teen book that didn’t translate for me. But my bigger concern was about the culture piece. It’s really hard to write a culture that isn’t your own, and I’m not sure de la Cruz quite hit the mark with this one. I know she has a Korean friend who helped her out, but this examination of Korean culture just felt kind of... jumbled? And surprisingly critical, from someone who hasn’t lived it first-hand. It seemed clear that the author had a bias in favor the more American attitudes toward values and family, which is fair enough... if you have a real, personal experience with both cultures, which she doesn’t. So I found that really frustrating. I also found the end of the book sort of fragmented and confusing. Overall, it just felt self-conscious and not quite on point for me. I did read the whole thing in one night, though, because I wanted to enjoy how I knew it was going to play out - and it did play out the way I expected, but wasn’t as enjoyable as I thought it would be. Just not the book for me. Thanks to Harlequin Teen and NetGalley for the ARC. "}, {"Review": "I wanted to love this book. Years ago I read Melissa de la Cruz's Fresh off the Boat and loved it. I've been waiting for her to write another book with an Asian protagonist that measures up since. Sadly the vast majority of the leads in her novels are white. But that's an entirely different discussion for another time. I was so happy when Netgalley approved me for an arc of 29 Dates. Finally a teen book featuring an Asian girl and a fully Asian one not a half white one chasing white boys. Two potential Asian male love interests? It felt like a step in the right direction. But the goodwill soon ran out. Melissa should've written about a Filipina girl instead since that's familiar territory for her. Taking on another Asian culture did not feel authentic. At time the story felt like it was written by a Koreaboo. But this is what happens when you hop on trends and Korea is very trendy at the moment. One thing I hate about these teen stories is the love triangle. They are never written in a way where you are truly torn over which guy the girl should choose. The clear choice is always evident from the beginning and usually there's no chemistry between the leading lady and one one of her men. And I went in with the expectation of her meeting 29 different guys with different personalities but the dates had no real effect on the thin plotline. I was over and done with this book by the 80% mark but trudged along to say I finished. "}, {"Review": "I have issues with this book. First of all, how did Jisu's parents pick out this school in San Francisco? How did they know about it? Second, it felt like a HUGE overreaction to send her to the US after we only see her skip out on her responsibilities once. The whole rest of the book she makes it sound like Jisu did everything her parents ever asked of her. So why did this one infraction cause such a drastic response? Third, did Jisu have an accent? If not, how did she get flawless English? Fourth, WHY NO GLOSSARY OF KOREAN TERMS!?!?! Fifth, you can't just change a cultural tradition like seons to be a thing high schoolers do. That's like saying someone is going to have a quincenera on their 18th birthday. It seems a bit disrespectful to the culture. Sixth, the ultimate romance in this book doesn't feel right. They didn't have much chemistry. Then again, Jisu didn't seem to have much chemistry with anyone. I'm so disappointed in this one. I really expected something fun. "}, {"Review": "3.5 starsWhat I most enjoyed about this book is that it allowed me to learn more about Korean culture through the lens of the dating misadventures of a teenage girl.The 29 dates referred to in the title are seons, meetings set up by a matchmaker to see to introduce a couple with proper social backgrounds in hopes that they will hit it off. Jisu doesn’t really want to spend time looking for a potential boyfriend; she’s got enough on her plate with finishing high school and applying to college. However, her parents insist that she needs to both excel in school and make an advantageous match. When Jisu does poorly on an exam and skips a seon to hang out with her friends, her parents ship her off to San Francisco in hopes that she will do better in a good but less academically rigorous school. Jisu begins to spread her wings a bit in her new environment, but she still feels a lot of pressure to be what her parents expect in a good daughter. And that includes continuing to go on the dreaded seons, even though she already is interested in another boy. Or maybe two boys . . .The author isn’t Korean, but she consulted with a Korean family member who came to the US as a freshman(!) in high school, and it shows in the book. Jisu’s experience coming to the United States and adjusting to a very different culture felt real to me. It was interesting to see the similarities and differences between the two countries through Jisu’s eyes. (De la Cruz does admit to fudging on one aspect of Korean culture, though; the people who participate in seons are typically in college or older.)In a nice touch, transcripts from the seons are included between other chapters. Some of them are hilarious disasters, while others are just examples of the awkwardness of a blind date between two people who are only compatible on paper. Readers looking for a diverse YA rom-com should give this book a try. It’s a fun light read. A copy of this book was provided through NetGalley for review; all opinions expressed are my own."}, {"Review": "\"I received this copy from the publisher via NetGalley in exchange for an honest review\"Jisu's traditional South Korean parents are concerned by what they see as her lack of attention to her schoolwork and her future. Working with Seoul's premiere matchmaker to find the right boyfriend is one step toward ensuring Jisu's success, and going on the recommended dates is Jisu's compromise to please her parents while finding space to figure out her own dreams. But when she flubs a test then skips out on a date to spend time with friends, her fed-up parents shock her by shipping her off to a private school in San Francisco. Where she'll have the opportunity to shine academically—and be set up on more dates!Navigating her host family, her new city and school, and more dates, Jisu finds comfort in taking the photographs that populate her ever-growing social media account. Soon attention from two very different boys sends Jisu into a tailspin of soul-searching. As her passion for photography lights her on fire, does she even want to find The One? And what if her One isn't parent and matchmaker approved? This book was something different for me to read and I really enjoyed it. Learning about a different culture is something I find really interesting and this book taught me more than I expected.Jisu I found hard to like though, I found her way with people was a little rude and off at times and never resolving her issues with her parents exceptions and what she wants to do with her life had me a little frustrated. In saying that it could be a cultural difference that I can not relate too. The side characters I didn't have much thoughts on either with this book so I felt like the characters for me was lacking when it comes to finding interesting and wanting to read more about. In saying that I did breeze through this book and did enjoy it and I am glad I read it. I ended up giving this book a 3.75 stars out of 5. I am a person who has to be able to like the characters in the book to really enjoy it and having Jisu the way she was just made the rating lower for me. I still intend to read more of `Melissa de la Cruz novels because I can see myself really enjoying other books she has written. "}, {"Review": "29 Dates follows Jisu, a young South Korean girl as she navigates a new high school in a different country after her parents find her struggling to cope at her very competitive high school in Seoul and send her off to America. Living with a host family, Jisu has a hard time juggling school and new friends as well as going on blind dates that her mother's match maker sends her on.I really enjoyed this book. I liked Jisu and how she always had an open mind when going on her blind dates even though she didn't want to be there. I liked that she stood up for herself and always spoke her mind when it was called for. I really felt for her when she felt the constant pressure from her parents to do well and how she felt that she really didn't know what she wanted to do or be after high school. I feel that is relevant to most young people and although this novel is aimed at someone younger than me, I still felt a connection to the character and the story.I found myself really looking forward to reading about her 29 dates which featured at the end of each of the 29 chapters, especially the very last one but wished it had been a bit longer.The majority of the cast of characters were great, and I really enjoyed the friendships that Jisu had in Seoul and in San Francisco but especially with her friends back in Seoul. I hope we get to see more of them in future books because I would like to hear their own stories and also through them find out about Jisu because I would love to read more about her. I gave this book 4 out of 5 stars and would definitely recommend you give this book a go! Thank you to NetGalley and HQ for providing me an e-arc in exchange for an honest review."}, {"Review": "My Review: This book was so adorable. I thought that the middle snippets of her dates were going to take away from the story at large but after a few chapters, I was actually looking forward to reading how each one went. This book was unlike anything I have ever read and it felt very diverse with the characters. I loved learning more about Korean Culture (even though the author notes that she took liberties with the matchmaking dates) and I really hope that De La Cruz does another story set in another culture soon. I loved all of the characters and the pace of this story. The one thing that I wish would have been really touched on in this story was the fact that Jisu's parents were very hard on her. It would have been nice for her to sit down with them to have a real talk about how they were pressuring her to not only to do her best but to surpass that. Kids these days are under so much stress during school, especially being a senior. It would be better for parents to support their children vs. stressing them out more. Although Jisu does talk to her mom about the issue its never really talked about at large and is never really resolved. In the end, I think was a very cute and at times funny story. I am really glad that I got the chance to read it and I could see this one being a great summer read. To grab a copy and layout at the beach and get a tan while watching the waves and reading. Go Into This One Knowing: Korean Matchmaking (with liberties), Romance, Humor "}, {"Review": "Jisu's traditional South Korean parents are concerned by what they see as her lack of attention to her schoolwork and her future. Working with Seoul's premiere matchmaker to find the right boyfriend is one step toward ensuring Jisu's success, and going on the recommended dates is Jisu's compromise to please her parents while finding space to figure out her own dreams. When she flunks a test and bails on a date, her parents are fed up and send her to San Francisco. Where she'll have the opportunity to shine academically—and be set up on more dates!Possibly one of the sweetest novels I have read recently. It is easy to read, humorous and heartbreaking at the same time. It takes the pressures of school and multiples it by 1000 - with parents that pile the pressure on even more. My favourite thing about this book is that it is about focuses on a Korean teenager. I am absolutely loving seeing more books come out, particularly in the YA category that features a lead character from a different country. It just opens up a whole new multicultural world - introducing the idea of seons (blind dates set up with a match maker and parents) and other cultural occasions. Would highly recommend!! "}, {"Review": "Jisu’s parents are not happy with her grades or her plans for college. They have been working with a matchmaker to find her the right boyfriend in order to set her up for a successful future. After Jisu gets a C on a test and skips one of her dates to be with her friends, her parents decide to send her to San Francisco to finish her senior year. They hope the change in scenery will be just what Jisu needs to strengthen her academics and find the perfect boy. Will Jisu get into an acceptable college and find a boy that she likes and her parents will accept? What will Jisu learn about herself along the way? 29 Dates is a stand-alone romance novel that was challenging and enjoyable. I will admit that I am not Korean or Korean American and it was interesting to read about the various cultural nuances within this community. De La Cruz did a wonderful job introducing these various Korean viewpoints while also not making the book feel like a cultural lesson. The romance that is included is very superficial and is more of a secondary story to the overall story of finding out who Jisu really is. I recommend 29 Dates to anyone who likes a good relationship story, especially those who liked To All the Boys I’ve Loved Before. "}, {"Review": "Shes not doing well in her elite school, maybe an average student. Now her parents have decided to send her halfway across the world, to the U.S.A., to finish high school, apply to an appropriate college and find her future husband. How would you feel?Ji-su's parents expect a lot from her, she is their only child and they are wealthy; that is why they can afford the pricey matchmaker who is responsible for setting Ji-su up on so many dates. Conflicted between priorities of her home land and this temporary home she has to figure out what she wants out of life and what to make of all the new men she is being set up with. The book is a page turner; a light romance with only one mature scene that could be questionable for younger readers. Fans of \"To All the Boys I've Loved Before\" will enjoy this light romance."}, {"Review": "This book was received as an ARC from Inkyard Press in exchange for an honest review. Opinions and thoughts expressed in this review are completely my own.This book was the ultimate teen dating book and every teenager can relate to the trials and tribulations Jisu is going through with her adventures from moving to Korea to finding the right friends and then finding the right soul mate. This book is definitely relatable from society which made it even more better to read and understand. This reminded me a lot of the Jenny Han books To All the Boys I've Loved Before and how that phenomenon has sparked and Melissa De La Cruz is a well known young adult author so I can definitely see this book becoming popular or even on the best-seller list.We will consider adding this title to our YFiction collection at our library. That is why we give this book 5 stars."}, {"Review": "Jisu Kim attends a highly competitive high school in Seoul, South Korea. Her best friends seem to know what track they are on, but Jisu likes to take pictures and struggles with the school work. Her parents send her off as a senior year exchange student to an International School in San Francisco. I felt bad for Jisu at first, but the adventure definitely gives her a chance to be herself and there's a lot to be said for time to do that. The rom-com part of the story is framed by a series of seons--dates that her parents have paid a matchmaker, Ms. Moon, dearly for in hopes of also finding Jisu a well off match. I learned quite a bit about Korean culture--the bad luck of 9's for instance, and got a kick out of how quickly Jisu fell into a routine at Wick. She made friends easily and the story was a lot of fun."}, {"Review": "Thank you to NetGalley and the publisher for providing me a complimentary arc of 29 Dates by Melissa de la Cruz in exchange for my honest review.*I enjoyed this amusing and charming story of Jisu\"s senior year in High School. This novel is filled with adventure, trial and tribulation, as well as growing pains. One of the things I enjoyed about the novel was Jisu's honest homesickness for both family and friends. In the midst of a new environment she make new friends, but stays in contact with her old ones at home in Korea. The concept of matchmaking is as old as time, so to see it occur in the modern era and with a high school was entertaining and informative. It was a quick enjoyable novel."}, {"Review": "Jisu is a high school girl from Korea. Her parents have set her up with a matchmaker and sending her on seons to try to find a suitable husband. After Jisu gets a bad grade on a test, her parents decide to send her to America to go to a different school.I received a free ARC of this book from NetGalley in exchange for an honest review. This was a cute story. The main issue I had was in chapter 20, something happens in the evening, but is changed mid paragraph to morning, and then it continued with the thing happening in the morning for the next chapter. Hopefully this will be changed for the final copy of the book. Other than that, I enjoyed the story. It was kind of obvious who the 29th date would be, but getting there was half of the fun of the story."}, {"Review": "29 chances to drive yourself crazy! 29 ways to learn your dislikes!29 dates but what about...love?29 Dates is a cute story. I will admit to wishing for a little glossary though. Never having indulged in Korean culture, I felt a little left behind -at first. Eventually, you pick up the lingo and start craving the restaurant experience. (Maybe don't read while hungry?!😆) I think the most fun though was reading the play by play of these seons. Some are perfectly terrible! Like award winning terrible! Laugh, want to cry, and cross your fingers through the awful experience with Jisu because in the end you will be smiling just as hard!"}], "Genre": "Romance", "ID": "40798092", "Desc": ""}