{"Name": "Jane Eyre", "Image": "https://images.gr-assets.com/books/1327867269l/10210.jpg", "Reviews": [{"Review": "Yes, I suppose you can view this book mostly as a love story. That's what I did at age 13 - but that's why I was left disappointed back then¹.Or you can view this as an story of formation of a strong and independent female protagonist, a nineteenth-century feminist, light-years ahead of its time. And that's what left my now-closer-to-thirty-than-twenty self very satisfied and, quite frankly, rather impressed.²¹(view spoiler)[The guy kept his wife in the attic. Seriously - no. Just no. You don't get all the way to your SECOND wedding forgetting to mention that your FIRST wife is hidden in the attic. Seriosly, Rochester, what the hell is wrong with you? How can you even attempt to build a marriage on such a lie??? (hide spoiler)]² \"I do not think, sir, you have any right to command me, merely because you are older than I, or because you have seen more of the world than I have; your claim to superiority depends on the use you have made of your time and experience.\"Sing it, Jane. You tell him, you strong and awesome woman, you!\nWhen I read it for the first time as a young and opinionated teen, I thought Jane Eyre was a boring and meek protagonist, too clingy to her 'outdated' morals, too afraid to do what I thought was a brave thing to do - say 'yes' to the apparent happiness that poor tragic Mr. Rochester was offering. (Oh naive young me, putting way too much stock in Rochester's woes after his (view spoiler)[first marriage (hide spoiler)], sleeping with everyone in Europe and rejecting them probably because they were not English enough for him!) Wow, was there ever a way to misunderstand a book more than I did this one? Sometimes life experience does matter indeed.Jane Eyre has a good idea of her self-worth. And she has a good idea about her own morals. And, unlike many in her situation, she sticks to her morals and her idea of what is wrong or right regardless of what outcome is in it for her. Here is the prime example:\"Gentlemen in his station are not accustomed to marry their governesses.\"The emphasis in this well-intentioned advice by Mrs. Fairfax is on the word MARRY. Ah, silly old lady, one may think, cautioning the young woman in such a prudish way. Ah, silly young woman, taking the advice of the old lady and acting prudishly. Ah, silly young woman, eventually rejecting the sincere love and offer of happiness for a seemingly prudish reason - not wanting to be a mistress. So old-fashioned and weak and caged-up, screamed my thirteen-year-old self.But here's the thing. It's not just for the moral lesson for the readers that Bronte has Jane firmly say 'no'. It's not for the sake of mere societal appearance. It's for the sake of Jane, and Jane alone. MARRYING governesses was uncommon. Having them as mistresses - probably not as rare. In her society, protecting her virtue and reputation was not only the matter of religious views or stigma - it was the question of her future, as she had nobody to stand up for her if her reputation was ruined. And it was a question of her integrity - the quality that she maintains through thick and thin, refusing to fall head over heels for love, refusing to let love justify all the mistakes and wrong choices, refusing to let love blind her to everything else that was important for her sense of self-worth.By refusing Rochester, Jane stays so true to herself without ever betraying herself. Jane refuses to take the steps that would destroy her integrity in her own eyes, and for that she has my strongest and most sincere respect and admiration. What Rochester did is unthinkable to her - not because of how others view it but because of her morals and convictions - and she shows unbelievable courage in sticking up for what she believes in, even if it is to her own material and soul-wrecking detriment. She will not give herself fully to something - or someone - that would destroy her integrity, tarnish her own self. And I love her for this unwavering determination to stay true to herself! \"Reader, I married him\" may be one of the most famous phrases from this book (actually, the most famous, come to think of it) - but it is her refusal to marry him in the first place that allows her to keep her integrity and remain true to self, and continue developing into the amazing person she becomes. Jane has too much self-worth to have Rochester until he redeems himself in her eyes, until he repents. That's the point, not the marriage part.Despite self-proclaimed meekness, Jane Eyre is far from weak or scared. She has been forced to make her own way in life without the luxury of relying on a rich male relative - father, brother, husband. And she did this in the world where being attached to a man was the best choice for a woman (just remember Jane Austen's heroines a few decades earlier reaching happiness only after finding a suitable gentleman!). She is a rebel - setting out to have her own career in a male-dominated world, refusing to let a man rule her life (that applies to both Rochester and St. John here), and making statements that may have not had the most sympathetic audience back in her day:\"Women are supposed to be very calm generally: but women feel just as men feel; they need exercise for their faculties, and a field for their efforts, as much as their brothers do; they suffer from too rigid a restraint, to absolute a stagnation, precisely as men would suffer; and it is narrow-minded in their more privileged fellow-creatures to say that they ought to confine themselves to making puddings and knitting stockings, to playing on the piano and embroidering bags. It is thoughtless to condemn them, or laugh at them, if they seek to do more or learn more than custom has pronounced necessary for their sex.\"And here's what else I enjoyed about this book - its attempts to subvert the tropes, the same tropes that we still heavily rely on in literature. Bronte gets rid of the 'faultless' heroine - instead of being perfect (or having an imaginary flaw, like many literary heroines are prone to nowadays) Jane has a real one (for her time, at least) - her occasional temper. And she is not beautiful - not fake flaws, either but a consensus by many impartial observers that she is not a beauty. And to take it a step further - Mr. Rochester, our romantic lead, is quite frankly, rather ugly. This is not a beautiful couple (and Hollywood managed to \"fix\" that in all the movie adaptations, by the way - a slap in Bronte's face, I guess?). Jane is not in love with a pretty façade of Rochester - since he has none (a thing that contemporary writers should learn, by the way - writing love that stems from something else that simple attraction to physical beauty). And finally, the atmosphere of this story. Oh, the wonderfully gothic atmosphere written so well, with intense moods palpable in every paragraph. So colorful, so vivid, so immersing - every room, every moor, every tree. Every description of landscape or interior actually serves a purpose to establish the mood of the scene, and it is very well-done..................................All that said, I'm giving a condescending pat on the shoulder to my teenage self from the 'wisdom' of another fifteen years. Sorry, teen Nataliya, you little annoying know-it-all - you just needed to grow up to appreciate this story. 4.5 stars and high recommendation."}, {"Review": "FIVE REASONS WHY JANE EYRE WOULD NEVER BE A BESTSELLER IN OUR TIMES:5. Four hundred-odd pages of purely descriptive writing4. Overt religious themes and moral preaching3. A plain-Jane heroine who stays plain. No makeovers to reveal a hitherto hidden prettiness that only needed an application of hydrogen peroxide and some eyebrow plucking to emerge full-blown.2. The world is not well-lost for love. In the war between self-respect and grand passion, principles win hands down. Rousing, yet tender speeches do not make our heroine forsake her creed to fall swooning and submissive into her alpha's arms. 1. NO SEX!!!When I was a little girl, I had a doll named Saloni. Now Saloni wasn't a particularly attractive specimen as dolls go, especially since, over the years, I had drilled a hole in her little rosebud mouth in order to 'feed' her, I had 'brushed' her hair till all the poor synthetic threads had fallen out and I had dragged her around with me so much, one of her big blue eyes had fallen off. But in my eyes, Saloni was the best doll ever created. She was my comfort, my mainstay in a world filled with confusing new things like school and daycare and other little people. Jane Eyre is my grown-up version of Saloni. Comfort food for my brain. There are two authors I will read over and over and over again, until the day I die. One of them is Charlotte Bronte, the other one is Georgette Heyer. I have read Jane Eyre a million times, but I never tire of the story. Every time I reach the scene where she professes her love to Mr. Rochester, I come out in goosebumps. Every single time. Age and experience have taught me to spot the flaws in the story and the characters. The ineffable belief in English superiority. The condescending attitude towards servants and people of the lower class. The ill-treatment of mentally disabled people. The almost Quaker-ish sentiments of Jane Eyre. But all of this detracts not a whit from one of the greatest love stories ever told. And there are a lot of things to admire in this book as well. Edward Rochester, ugly as sin, but powerful and dominant and unbelievably attractive in spite of his looks. A love that grows and strengthens on the basis of mutual sympathy, respect and a meeting of the minds, that a lot of our authors would do well to learn from. Jane Eyre, who does not think that her great love excuses acts of selfishness and immorality. Despite being drawn as a somewhat submissive personality, Jane manages to hold her own with quiet fortitude, never loudly asserting her intelligence or talent, but nonetheless displaying a strength of character that would put the Bellas and Noras of out time to shame. Jane Eyre would never, as I have said above, be a bestseller if it had been written in our times. And that is a loss we must take upon ourselves. That we have put such prime value on lust and looks and power that we have forgotten to be real in our writing. There is a reason why millions of people the world over remember and revere a book written a hundred and fifty-odd years ago while the bestsellers of our times slip quickly and quietly from our memories. Jane Eyre is more than just a beautiful book about a love story that transcends all boundaries; it is a testament to the power of pure emotion, that can be felt through the ages and across all barriers of time and culture."}, {"Review": " Reader, I gave it five stars. Please let me tell you why. Jane Eyre is the quintessential Victorian novel. It literally has everything that was typical of the period, but, unlike other novels, it has all the elements in one story. At the centre is the romance between Jane and Rochester, which is enhanced by gothic elements such as the uncanniness of the doppleganger and the spectre like qualities of Bertha. In addition, it is also a governess novel; these were an incredibly popular type of storytelling in the age and for it to be combined with gothic elements, which are interposed with a dualistic relationship between realism and romance, is really quite unique. The correct term for this is a hybrid, in which no genre voice is dominant; they exist alongside each other creating one rather special book. And this is so, so, special; it’s an excellent piece of literature. Jane’s journey is gut wrenching and emotional. Through her life she experiences real sorrow, the kind that would make a lesser person give up. She also experiences real friendship, the type that comes across perhaps once in a lifetime. But, most significantly, she experiences true love and the development of independence to form he own ending. I really do love this book. Bronte utilises the first person narrative, which creates a high degree of intimacy with her character; it makes me feel like I know Jane as well as she comes to know her own self. “I am no bird; and no net ensnares me: I am a free human being with an independent will.”Jane’s a strong willed individual. From a very young age she had the clarity of intelligence to recognise the injustice that was her life; yes, she is narrating her story retrospectively, though she still had the perceptiveness to realise how mistreated she was. I love the pathetic fallacy Bronte uses at the beginning. The child Jane looks out the window, shielded by the curtain, and witnesses the horrible weather. It is cold and bleak; it is windy and morose; thus, we can immediately see the internal workings of Jane’s mind. The weather reflects her feelings throughout the novel, and at the very beginning the situation was at its worse. This can also be seen with the fire imagery that represents her rage when she is shoved in the red room; it later mirrors that of Bertha’s fury. Everybody needs love, children especially so. These early experiences help to define her later character, and, ultimately influence how she sees the world; she still hides behind a curtain in Rochester’s house when he flirts with Miss Ingrum. These experiences set her on an almost perpetual quest for love, for belonging and for the independence to make her own decisions. She finds friendship in the form of Helen Burns; she gives her some sound advice, but Jane cannot fully accept such religious fatalism. However, it does inspire her, a little, to continue with life; she realises, no matter what happens, she will always have the love of her greatest friend. Jane clings to this idea, but, ultimately, has to seek a more permanent solution to her loneliness. She needs a vocation, one that will fulfil her and give her life meaning; thus, she becomes a governess and crosses paths with the downtrodden, miserable wretch that is Mr Rochester. Sometimes I feel like Rochester didn’t know quite what he wanted. When he sees Jane he sees a woman with strength, blunt honesty and integrity: he sees an emotional equal. This attracts her to him, which develops into love. However, when he tries to express his love he does it through trying to claim her as his own. Through doing so, not only does he show the nature of Victorian marriage, he shows his own deep vulnerability. He loves her mind, her intelligence, and he too wants to be loved. He longs for it with a frightening passion. So, instead of doing things the way Jane would have wanted him to do, he overwhelms her with expensive affection. By doing so he almost loses her. All Jane wanted was his heart, nothing more nothing less. By showering her with such flattery and expensive items, he insults her independence. He risks destroying the thing that attracted him to her in the first place, their equality; their mutual respect and love. He takes away her dignity. I really don’t think the original marriage would have worked. Ignore the existence of the mad woman in the attic; I just think Rochester would have spoilt it. It would have become too awkward. They needed to be on the same societal level as well as one of intellect and character. The ending is touching and a little sad, but it is the only one that could ever have worked for these two characters. Without the tragedy there could never have be rejuvenation and the chance for them to be together on equal terms, no matter what it cost to get there. If that wasn’t enough reason for me to love this book, there are also elements of fantasy and desire. This is a realism novel, it pertains to credible events, but the suggestions of fantasy only add to the strong romantic notions. Rochester is enamoured by Jane; he cannot believe that a woman like her actually exists. All his misguided notions are brushed away in an instant. Whilst he views Jane as special, it is clear that he realises that other women may also have a similar rebellious voice, only hidden. He considers her an elf, a witch, an improbable woman that has captured his desire, his heart, his soul, his life. He knows he will never be the same again. From Jane’s point of view, her first encounter with him is otherworldly. She had grown bored with her governess role, and when she sees the approach of Rochester and his dog Pilot, she sees the gytrash myth; she wants to see something fantastical instead she finds her heart, which is something much rarer. Then there are also the feminist elements. Jane transgresses the boundary associated with her gender in the Victorian age. For a woman to be recognised as having equal intellect to that of a man was sadly a rare thing. Women could actually attend university, but the downside was they could never get the full degree. They could spend months studying, though never be recognised as actually having gained the qualification. It was just another attempt to keep women under the thumb, so for Bronte to portray the truth of Jane’s equal intellect is a great step for the recognition of women, and women writers. This book received a whole host of negative reviews at the time of its publication for this element alone. Stupid really, but that’s misogyny for you. Reader, I love this book. I really could go on, but this is getting kind of long. I hope I’ve made it clear why I love this story so much. I shall be reading this again later this year to correspond with my exams, which I’m already looking forward to- the reading that is, not the exams. I don’t think will ever have read this story enough though.Blog | Twitter | Facebook | Instagram | Academia"}, {"Review": "“‘Jane, be still; don't struggle so like a wild, frantic bird, that is rending its own plumage in its desperation.’‘I am no bird; and no net ensnares me; I am a free human being, with an independent will; which I now exert to leave you.’”I am glad that in 1847 Charlotte Bronte made the decision to publish her novel under a male pseudonym. Currer Bell had a much better chance of being published than Charlotte Bronte and, with reviewers and readers assuming that she was in fact a male writer, allowed the novel a chance to be weighed properly without prejudice. Jane Eyre became a bestseller. The question is, of course, would the novel have been so successful or even published at all if CHARLOTTE BRONTE had been emblazoned on the cover? I like to think that some editor would have realized the bloody brilliance of the story and would have published it anyway, even if they didn’t spend any money on promoting it. Would readers have bought it? Hopefully, word would have trickled out about how compelling the plot was, and people would have overcome their natural prejudice for reading a novel by a woman. So isn’t it fun that Charlotte tricked everyone, including her own father? She did not confess her efforts to him until she had become successful. Even writing these words, I have a smile on my face thinking of this successful bamboozlement of publishers, editors, and readers. The story, of course, is larger than the book. Most people with any kind of inquisitive nature have been exposed to the bare bones of this novel without ever reading the book. Maybe they watched a movie based on the book, or maybe they have heard it referenced. Once read, it is impossible for people not to use aspects of this novel as common reference points for other readers. Take Mr. Edward Fairfax Rochester himself, the master of Thornfield Hall. He is a brooding, complicated, dark, and intelligent creature. He is a force of nature who conforms the world around him with every stride he takes or every word that drops from his lips. He is the embodiment of the Lord Byron character. It doesn’t matter that he is not handsome. He is powerful. Women swoon in his presence and, after a carefully administered smelling salt, might start calculating what he is worth a year. Rochester is completely taken by Jane Eyre, practically from the moment they meet. The drama of their meeting is one of those great cinematic scenes in the history of literature. Bronte incorporates many scenes into the novel that are, frankly, gifts to future movie renditions. Rochester has never met anyone quite like her. He is not alone. Everyone who comes into contact with Jane Eyre knows they have met a unique person. She is a kind and pleasant person, but she will not brook any discriminations against her character. Mrs. Reed (her aunt), Mr. Brocklehurst (director of Lowood School attended by Jane), Mr. St John Eyre Rivers (minister who asks to marry her), and even Mr. Rochester, all attempt to conform Jane to the acceptable, deferring Victorian woman of the time. To call this a feminist novel does put it in a box which constrains it too tightly. Jane or Charlotte, either one, would loosen those bindings and let it breath as Charlotte’s intentions with this novel go well beyond the confines of any specific genre. I found her ideas of female equality, embodied so wonderfully in the character of Jane, inspiring. ”Women are supposed to be very calm generally: but women feel just as men feel; they need exercise for their faculties, and a field for their effort, as much as their brothers do; they suffer from too rigid a restraint, too absolute a stagnation, precisely as men would suffer, and it is narrow-minded in their more privileged fellow-creatures to say that they ought to confine themselves to making puddings and knitting stockings, to playing on the piano and embroidering bags. It is thoughtless to condemn them, or laugh at them, if they seek to do more or learn more than custom has pronounced necessary for their sex.”I hear you, Charlotte.Can you imagine the impact of such words on your typical, Victorian housewife? A woman who has lived her whole life being the daughter of her father, the wife of her husband, the mother of her sons. She has been passed from the care of one man after another. If she were fortunate enough to be born pretty, she has that brief moment of power when suiters contend for her hand, but probably, ultimately, her father would decide who was best for her to marry. How about the impact of reading this novel on the typical, Victorian man? Did he look up from this book and peer over at his wife, she looking rosy in the firelight, knitting away at some frivolous thing, and think...does she want more? Or maybe he sees his pretty daughter enter the room on the verge of womanhood, and does he consider the possibility that she wants or deserves more? There is no spark of revolution inspired by this book, but I do hope that this book may have chipped away at some of the archaic ideas of inequality. Maybe a few women readers realized that some of those secret desires they have harbored their whole life were not such strange concepts. When Jane stands up to the conformists she encounters, she is willing to take the punishment because she knows in her soul that what she believes about herself is incontestable. This is no better illustrated than in her interactions with (I’m sorry to say this because it isn’t completely fair) the odious St. John Eyre Rivers. He wants to marry her but only for the sake that he believes she will make a wonderful, useful, missionary wife. He doesn’t love her. She is willing to go, but only as a “sister,” not as a wife. Jane refuses to compromise, but there is this moment where she is teetering in the balance. I’m mentally screaming to her at this point. ”I shuddered as he spoke: I felt his influence in my marrow--his hold on my limbs.” He is a cold man who would have gladly marched OUR Jane off to some godforsaken part of the world to die some horrible death from disease or from simple neglect. I know the plot; and yet, I’m still completely invested in every scene. There is always the possibility that I’ve fallen into an alternative universe and I am reading some other version of Jane Eyre with a completely different ending. I can assure everyone this did not happen.When Jane is residing with Mrs. Read, she describes her place to sleep as a “small closet.” I can’t help but think of the closet under the stairs at 4 Privet Drive. Like Harry Potter, she is also an orphan but still with a rebellious streak because she is also sure that she is supposed to be someone other than who she is currently perceived to be. The relief she experiences when she learns she is getting away from the condescending attitude of the Read house and going away to school at Lowood also reminds me of Harry’s relief to discover he, too, is escaping to Hogwarts. Though I must say Harry, despite the trials and tribulations he experiences, draws a better straw than Miss Jane. I really enjoyed the gothic elements; those were, to a degree, completely unexpected. ”’Oh sir, I never saw a face like it! It was a discoloured face--it was a savage face. I wish I could forget the roll of the red eyes and the fearful blackened inflation of the lineaments!’‘Ghost are usually pale, Jane.’‘This, sir, was purple: the lips were swelled and dark; the brow furrowed: the black eyebrows widely raised over the bloodshot eyes. Shall I tell you of what it reminded me?’‘You may.’‘Of the foul German spectre--the Vampyre.’”There are noises in the night at Thornfield Hall. There is an unknown tenant locked away in the rafters of the house. There are secrets. There are unexpected fires. There are scandals waiting to be known. In fact, the twists of the plot were considered so outrageous for the time that the book acquired a reputation for being “improper.” This helped to boost sales further. The Bronte family was very close. They grew up conceiving their own stories and fantasies and acting them out in impromptu plays. All three girls and the brother, Branwell, were writers. Tragically, they all died young. Charlotte outlived them all, dying in 1855 at the age of 38 with her unborn child. Branwell (31) and Emily (30) both passed away in 1848, and Anne died the following year at the age of 29. Can you imagine having to bury all your siblings? It must have felt like the spectre of death was stalking nothing but Brontes. What makes Rochester unique is that he does eventually see Jane the way she sees herself. ”Fair as a lily, and not only the pride of his life, but the desire of his eyes.” I will remember that line ”desire of his eyes” for a long time. She is a hidden gem in rooms full of people. Charlotte Bronte makes some good points through Jane’s eyes at how unaware wealthy people are of the true natures of those who serve them. I would talk about the love story, but what is there to say. It is one for the ages. I would say that Charlotte Bronte never found her Rochester in real life, but some letters have come to light, written to a man named Constantin Héger, that suggests that maybe she did. He was married to someone else, and when Elizabeth Gaskell wrote the biography of her friend, she carefully edited out those very revealing letters of a love that could never be. Jane Eyre, may you always find the readers you deserve. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at: https://www.facebook.com/JeffreyKeeten"}, {"Review": "I am a very pretentious person.I try to seem “hip” and “cool” and “relatable” and “down with the teens” - and of course I totally am all of those things - but also I have my tendencies toward pretension. It’s who I am. Just last night I shuddered at the idea of popular music, like some kind of eight-hundred-year-old gremlin.I am not proud of this side of me, but it’s who I am. And also it is important background information for you, dear Reader, going into this review. (That direct address to you as an audience member was me emulating this book, not an example of my pretension. Or was it???)Anyway. It’s important that you know my capacity to be pretentious so that I can make this statement:I don’t get how any reader can say they don’t like classics.Oof. A doozy, right? Aren’t you glad I warned you? Now you know that that wasn’t just a one-off of self-serious condescension but rather a pattern of my personality and oh sh*t actually my explanation probably made the whole thing a million times worse. Now I’ve painted my insufferability as consistent.Come back, everyone!!!! Let me explain!What I need to explain is that this book is excellent, and also a classic. It is very very old but sometimes old stuff is still worth it! (I should know. I have the mannerisms of the type of grumpy old man that gets endearingly profiled in Scandinavian bestsellers.)This is not the classic I would recommend that someone start with if they’re looking to get into the genre. It is very, very slow, and very wordy, and the language takes some settling in. But also this book is a literal gem.It was published in 19th century England, which is no one’s idea of Progressive Central. But this book is jarringly feminist when the constraints it (and Jane) were working in are taken into account. Jane is an independent woman, and this book from eighteen freakin’ forty-seven tells her story.Now, I love Jane Austen books as much as the next girl (if the next girl is pretty damn obsessed with Jane Austen), but that’s something not even all her books can say.Here’s the thing about this book: I love nineteenth century fiction (or what I’ve read of it), but even if you didn’t you’d probably love this book. So much of this is unique, by the standards of then but also even the standards of today. It’s a romance, yes, which: extremely normal. But it’s a romance between two characters who are not conventionally beautiful, which is unbelievably rare. It’s also not a romance that acts as basically the sole option for its female character. I love Pride & Prejudice, and I of course think Lizzie Bennet is a feminist (and awesome) character, but there’s no way for that book to end, really, that doesn’t include marriage for her. Three of the five Bennet sisters get married over the course of that book. It’s either that or old maid status, baby.But not lil Jane Eyre. She does not allow marriage to be the only prospect for her!! She goes away and makes a life for herself and then decides whether she wants to follow that path. We don’t even see that in every 21st century romance.Plus, Jane is an excellent character, and of a type we RARELY see. She’s serious and upstanding and smart and moral. She has a strong mind and she doesn’t shy away from that. She lacks the requisite features of today’s female subjects of romance: the quirkiness or the humor or the adorkable way she trips and falls/spills coffee/etc. She also lacks the nineteenth-century version of a lot of those traits. And it is so goddamn refreshing I can’t even tell you.And on top of all that, the language in this book is so gorgeous I want the whole manuscript tattooed on me.Which would be wild, because this is about a million pages long. And speaking of, yes, it is very slow and hard to get into and basically you have to adjust to a whole new reading experience. So I wouldn’t recommend starting off your nineteenth century fiction binge with this book.But I would recommend getting into nineteenth century fiction solely for the purpose of reading this book.Bottom line: IT’S JUST SO DAMN GOOD, YOU GUYS.-------------pre-reviewhey um...i love this book so stupid much???if you've got a free few hours over the course of the next few months i HIGHLY recommend rereading this book at a snail's pace. worked out for me very well.i should probably shout about my adoration of this book for several pages so. full review 2 come"}, {"Review": "Child neglect, near death, a dash of magical realism, the power of love, the powerlessness of the poor, sexual rivalry, mystery, madness and more. It is as powerful as ever - but is it really a love story, given Rochester's Svengali-tendencies, or is it a life story? His downfall and her inheritance make them more equal, but is it really love on his part? I'm not sure, which is what makes it such a good book (just not necessarily a love story). I also like the tension between it being very Victorian in some obvious ways, and yet controversially modern in others: an immoral hero, a fiercely independent and assertive heroine, and some very unpleasant Christians (it's not that I think Christians are bad or like seeing them portrayed in a nasty way - it's Bronte's courage in writing such characters I admire). CHILDHOODAbout the first quarter of the book concerns the tremendous hardship and abuse that Jane suffers growing up. It's often heavily cut from film, TV and stage adaptations, but despite the fluff about this being a great love story, I think there is merit in paying attention to her formative years as an essential element of explaining what makes Jane the person she becomes.The Red Room, where young Jane is banished shortly before being sent to Lowood, is a very short episode in the book, but its significance is probably greater than its brevity implies. The trauma of the Red Room is not just because Mr Reed died there, but because of the associations of red = blood = death, compounded by cold, silence, blinds that are always closed and a bed like a sacrificial altar. Is it also some sort of reference to Bertha's attic?Jane endures dreadful hardships: she is orphaned; her aunt says she is \"less than a servant, for you do nothing for your keep\" and invokes the wrath of God who \"might strike her dead in the midst of one of her tantrums\"; she endures injustice as she strives to be good, but is always condemned, while the faults of her cousins are indulged or ignored. So, she is sent to Lowood, where she sees the hypocritical tyranny of Brocklehurst, survives cold and near starvation and witnesses her best friend's death. Nevertheless, \"I would not have exchanged Lowood with all its privations for Gateshead and its daily luxuries.\" There is a dreadful irony in the fact that the first time a relative demonstrates any interest in her (John Eyre), it seems to ruin everything. VILLAINS AND CHRISTIANITYWho is the worst villain: John Reed, Aunt Reed, Mr Brocklehurst, Blanche Ingram, St John Rivers or even Rochester?Christianity gets a very mixed press in the book: Mr Brocklehurst is cruel and comically hypocritical (curly hair is evil vanity in poor girls, who \"must not conform to nature\", but fine for his pampered daughters); St John Rivers thinks his devoutness selfless, but is actually cold and selfish (his motive being to gain glory in Heaven for himself); Helen Burns is a redemptive Christ figure who accepts her punishments as deserved, helps Jane tame herself (\"Helen had calmed me\") and, of course, dies. Jane's own beliefs (or lack) are always somewhat vague (though she's very moral) and controversially feisty. When, as a small girl, the nasty Brocklehurst asks her what she should do to avoid going to Hell, she replies, \"I must keep in good health, and not die\"!Aspects the way Christianity is portrayed may make it more accessible to modern readers from more secular backgrounds, but might have been shocking to devout Victorians. Perhaps they were placated by the fact that despite the cruelty, Jane forgives Aunt Reed for trying to improve her errant niece, even though \"it was in her nature to wound me cruelly\".MALE POWER, FEMINISM, AND RELEVANCE TODAYMen had most of the power and respect in Bronte's time and often Jane has to go along with that. However, Bronte does subvert that to some extent by making Jane so assertive, determined and independent. The story of Jane Eyre has parallels with the story of Bluebeard, albeit with a very different ending, in which the woman takes charge of her own destiny. Bluebeard was well-known in Victorian fables as a rich and swarthy man who locked discarded wives in an attic (though he killed them first). He took a new young wife and when she discovered her predecessors, he was about to kill her, but she was rescued by her brothers, rather as Mason wants to rescue Bertha. Jane even likens an attic corridor to one in \"some Bluebeard's castle\", so Bronte clearly knew the story and assumed he readers did too. See http://en.wikipedia.org/wiki/Bluebear....Despite her minimal contact with men, right from the outset Jane instinctively knows how to respond to the man she describes as \"changeful and abrupt\". When they first meet in the house and he is quizzing her, she consciously mirrors his tone (\"I, speaking as seriously as he had done\") and \"His changes of mood did not offend me because I saw I had nothing to do with their alteration\". Like many bullies, he enjoys a bit of a fight, rather than the nervous, prompt and unquestioning obedience his manner normally elicits, and Jane isn't afraid to answer him back and speak her mind. It isn't long before she can say \"I knew the pleasure of vexing him and soothing him by turns\". When Blanche arrives, Jane realises \"he had not given her his love\" and that \"she could not charm him\" (as she could). At this point, she realises her self-delusions in overlooking his faults and merely considering them as \"keen condiments\".What should modern women make of this book? Bronte is radical in that neither Jane nor Rochester is conventionally attractive (it is personality that matters) and Jane is fiercely independent and assertive, even when she gives the impression of being submissive. She even says, \"Women are supposed to feel very calm, generally: but women feel just as men feel; they need exercise for their faculties, and a field for their efforts as much as their brothers do; they suffer from too rigid a restraint... precisely as men would suffer.\" On the other hand, Rochester's treatment of Jane, Bertha, Blanche and Céline is hard to justify (other than the fact he keeps Bertha alive - why not kill her?). Does disappointment and disability truly changed him, and does that, coupled with her independent wealth make them equals? Will they live happily ever after?ROCHESTERWhat were Rochester's plans and motives for his relationship with Jane? Why does he insist that Jane appears in the drawing room every evening while Blanche and friends are staying, even though he fully understands and comments on how depressed it makes Jane? And would Rochester have married Blanche if Mason hadn't turned up, making a big society wedding impossible? If so, was Jane always in his mind as a mistress and backup in case marriage to Blanche was not possible, or did he only decide to marry her much later? What sort of basis for a happy marriage is that, and can the equalising effect of his later disability and her inheritance really conquer it? It's true that Rochester tells Jane \"I feigned courtship of Miss Ingram, because I wished to render you as madly in love with me as I was with you\", but that is after Mason's visit, so is it true?Rochester's treatment of Bertha is even more problematic: divorce wasn't viable, and yet he didn't want to leave her behind in the Caribbean... very odd. In a funny sort of way, he might have felt he was doing the right thing by her, or at least, not the wrong thing. In a society which condemns divorce and cohabitation, is Rochester's planned bigamy justifiable? As Rochester hints to Jane early on, \"Unheard-of combinations of circumstances demand unheard-of rules\". He also knows that Jane's integrity means she must be unaware of the details if he is to be with her (he says that if he asked her to do something bad, she would say \"no sir... I cannot do it, because it is wrong\"), though in fact there is a bigger tussle between her head and heart than he might have expected. Later, he ponders the fact that she is alone in the world as being some sort of justification, \"It will atone\" and extends to the more blasphemous and deluded \"I know my Maker sanctions what I do. For the world's judgement - I wash my hands thereof.\" ST JOHNJane's bond with St John is very different, and she realise it, \"I daily wished more to please him; but to do so, I felt daily more and more that I must disown half my nature\". His proposal is positively alarming, \"You are formed for labour, not for love. A missionary's wife you must - shall be. You shall be mine: I claim you - not for my pleasure, but for my Sovereign's service\"! Under the guise of serving God and man, he is irredeemably self-serving.MAGIC REALISM?The strangest element is the small but hugely significant ethereal message from Rochester that might now be called magical realism. It sits oddly with the rest of the book, but I can never decide whether this is it a strength or a weakness.WHO KNOWS WHAT?A constant theme is \"who knows what?\". Is Aunt Reed ignorant of how awful Lowood is and has she truly convinced herself that her treatment of Jane is appropriate? How much does Mrs Fairfax know (and tell) about Rochester's wives, current and intended? Does Rochester know whether or not Adele is really his daughter, and what does Jane believe? Blanche appears to know very little, but is she only seeing what she wants to see? LOVE?Overall, there is so much in this book, it is well worth rereading, but I am not convinced that it is a love story. It is the easiest label to apply, and although Jane certainly finds love, I am not sure that love finds her. They're intellectually well-matched, and the sparring and physical attraction bode well. On the other hand, my doubts about his motivations when he was juggling Blanche and Jane make me uneasy. Incidentally, I first read this book at school (a naive mid-teen enjoys and appreciates it for very different reasons than an adult). One day, we were at a point when Jane was with the Rivers and possibly being courted by St John. We were told to read to page x for homework, so I turned to that page to mark it and saw the famous words (not that I knew they were), \"Reader, I married him\" and was shocked to assume it referred to St John.Jane's Place in My LifeThere are many reasons I love this book, including - but not limited to:1. The cliché of first reading this at an impressionable age (15).2. Coming with no preconceptions, other than knowing it was a classic - so I had a couple of big surprises in the plot.3. Being at a boarding school myself at the time - though fortunately not (much) like Lowood.4. Questioning my faith and the role of religion - then and since.5. Questioning the roles and rights of women - then and since.6. Jane, herself. That's a major one.7. The fact the book is daringly subversive for its time (most of the Christians are bad, and Jane is fiercely outspoken and independent - most of the time). 8. I get something new from it each time.Like many, I first read this at school. I was captivated from the outset. Jane was wild, and brave, and rebellious - all things we weren't supposed to be, and yet we had to read and write about her. I vaguely knew about the wedding scene, but everything about her time with the Rivers was new and unexpected. For all that I had doubts about Rochester, I felt (in a naive, teenage way) I shared a passion for him. When I thought Jane would end up with St John, I was devastated. The actual ending was a happy relief - all the more so because it had been unexpected. I thought I understood the book, and got good marks for essays about it (apart from the injustice of being deducted marks for a comment a teacher refused to believe I hadn't copied from Brodie's Notes - a brand I'd never actually seen!). But like all great works of art, it speaks differently on each encounter, and the more I've read it, aided by a bit of maturity along the way, and now discussions with GR friends, the more I've seen in it.So no, this not a love story - on the pages. But there is a love story: between the reader and Jane. PrequelI finally read Jean Rhys' prequel \"Wide Sargasso Sea\", reviewed here: http://www.goodreads.com/review/show/..."}, {"Review": "I'm bumping Jane Eyre up to the full five stars on this reread. It has its Victorian melodramatic moments (horrible aunt! and cousins! (view spoiler)[mad wife secretly hidden away in the attic! heroine starving in the wilderness! (hide spoiler)]), but overall I found this story of a plain, obscure girl determined to maintain her self-respect, and do what she feels is right even in the face of pressure, profoundly moving. And I'm a romantic, sorry/notsorry, so that aspect totally sucked me in too. And it really is a great romance, at least in my book, but it's just so much more than that.Reasons I Love Jane Eyre:1. Jane is no beauty. There's no Cinderella moment. Deal with it. Her beauty is all on the inside.2. Rochester is not gorgeous. This is not going to change either. In fact, his outward appearance gets worse in the end. And it doesn't matter! When's the last time you read a romance where neither the heroine nor the hero was good-looking?3. Great dialogue. Rochester makes sarcastic comments to Jane all the time. She sasses him right back.4. This is a romance of the mind and the heart, not just OMG HE'S SO HOT AND HIS LIPS MAKE ME MELT. (Though there's definitely physical attraction here too.)5. Jane maintains her pride and self-respect. She sticks to her principles, even when the pressure's on, even when it would be much easier, and would bring her much more short-term happiness, to let those principles go hang.6. Jane Eyre takes a very nuanced view of religion: there are hypocrites, in at least a couple of different variations. There are hard, cold people who sometimes use religion as a tool, or an excuse for what they do. There are saintly characters who always turn the other cheek. And there are believers, like Jane, who are imperfect but are doing the best they can. 7. Jane teaches us that we have a great power to take control of our lives and decide our own destiny, even when the cards are all stacked against us. It's up to us to take action to change our lives, not wait for someone else to change it for us.8. Jane Eyre empowered women, written at a time when in so many ways we were considered second-class citizens. It still empowers us now.Women ... feel just as men feel; they need exercise for their faculties, and a field for their efforts, as much as their brothers do; they suffer from too rigid a restraint, to absolute a stagnation, precisely as men would suffer; and it is narrow-minded in their more privileged fellow-creatures to say that they ought to confine themselves to making puddings and knitting stockings, to playing on the piano and embroidering bags. It is thoughtless to condemn them, or laugh at them, if they seek to do more or learn more than custom has pronounced necessary for their sex.Buddy (re-)read with Jess, Karly, Vane, Kristin, Rabbit, and Andrea.P.S. The Kindle version available for free at Project Gutenberg has wonderful pencil drawing illustrations.Bonus: excerpts from Texts from Jane Eyre: And Other Conversations with Your Favorite Literary Characters **spoiler alert**JANEMY LITTLE SUNBEAMWHERE ARE YOUI NEED YOU BY MY SIDEI’m taking a walkbe back for dinnerAH YES MY CAGED SPRITECOMMUNE WITH NATURE AND UPON YOUR RETURNRELATE TO ME THE VAGRANT GLORIES OF THE RUINED WOODSdo you really want me to describe my walk to youMORE THAN ANYTHING YOU POCKET WITCHit is fairly cloudy outlooks like rain soonAHHH TO THINK THAT MY LITTLE STARLING JANESHOULD RETURNTO PERCH ON MY BROKEN MALFORMED SHOULDERSINGING A SONG OF THE GREY AND WRACKING SKIESMAKES MY HEART SWELL TO BURSTall right—JANE WHERE HAVE YOU GONEI AM BEREFT AND WITHOUT MY JANE I SHALL SINK INTO ROGUERYi am with my cousinsWHICH COUSINIS IT THE SEXY ONEPlease don’t try to talk to me againIT IS YOUR SEXY COUSIN“ST. JOHN”WHAT KIND OF A NAME IS ST. JOHNI’m not going to answer thatI KNEW ITDID YOU LEAVE BECAUSE OF MY ATTIC WIFEIS THAT WHAT THIS IS ABOUTyesabsolutelyBECAUSE MY HOUSE IN FRANCE DOESN’T EVEN HAVE AN ATTICIF THAT’S WHAT YOU WERE WORRIED ABOUTIT HAS A CELLAR THOUGH SO YOU KNOWDON’T CROSS MEHAHA I’M ONLY JOKING"}, {"Review": "I read this book back in High School. I hated it. I thought it was boring and stupid and all I wanted to do was spread the word that this book was terrible and no one should read it. I had it marked one star on Goodreads and it had a home on my least favorite shelf.Well, I have been waiting years to find the perfect place to use this gif:I reread in late August, early September 2017. I have to say that I should probably reread everything I read bank in High School to get a better perspective. I enjoyed the book quite a bit this time. The story in intricate and dark. Jane Eyre is a tragic hero who does her best through the whole book but keeps encountering unfortunate situation after unfortunate situation. The story held my interest a lot more than some other classic novels I have read. My only complaint was a few times certain plot points were belabored. I found myself saying, \"Okay, I get it, let's move on.\"So, everyone, if you remember a book from your youth with less than enthusiastic fondness, it might be worth giving it another shot. You never know what you might find! "}, {"Review": "\n\n“I am no bird; and no net ensnares me: I am a free human being with an independent will.”\n\nOkay, so high school Melanie did not appreciate Jane Eyre! But thankfully, many years later, and because of a few friend’s encouragement, I have seen the light and righted my wrongs, because this reread proved to me how much of a masterpiece Jane Eyre truly is. This is a very beloved book, that stars an orphan girl name Jane that is trying to figure out the world around her. She’s searching for worth, for love, and all the middle area in-between. When she is very young, she is forced to live with her not-so-nice aunt, who is absolutely terrible to her. But soon, her aunt sends her off to an all-girls boarding school, but Jane starts to learn who she is and who she wants to be, and after getting her education, she begins to teach at this school that she now considers her home. But at nineteen, she decides that she would like to try to be a governess so that she can travel and see the world that she has learned so much about. Jane gets a job teaching a young girl at Thornfield Hall, but soon meets the master of Thornfield Hall, none other than Mr. Rochester himself. Mr. Rochester is distant, and rude, and a bit grumpy, but the more and more time Jane and him spend together, the more and more they realize they have a lot in common. And they develop quite a strange and unconventional relationship, while many spooky and mysterious things are happening at Thornfield Hall.This book is very protofeminist. Jane has so much rage and anger inside of her, because of the gender roles and expectations that are always set on her. On top of always being sent to places where she is forced to live and be molded into what is expected of her. Jane finally gets to live for herself at Thornfield Hall, and she does so unapologetically. Don’t get me wrong, Jane stands up for herself constantly, and at every age, throughout this story, but seeing her come into her own, and never backing down from her beliefs on what is right, is something so very awe-inspiring.\n\n“I care for myself. The more solitary, the more friendless, the more unsustained I am, the more I will respect myself.”\n\nAnd so many important themes are in this book! From classism, to marriage, to gender roles, to witchcraft, to slavery, to abuse, to power dynamics, and to so much more. And the things brought up in this book? That was first published in 1847? And I stan one feminist icon, and it’s Charlotte Brontë. I can’t even image what the world thought of this throughout the ages, because it spoke to my very soul in 2018. Seriously, I will forever be in awe of this book and this author, and I truly mean it when I say that she’s a new icon for me. \n\n“Gentle reader, may you never feel what I then felt! May your eyes never shed such stormy, scalding, heart-wrung tears as poured from mine. May you never appeal to Heaven in prayers so hopeless and so agised as in that hour left my lips: for never may you, like me, dread to be the instrument of evil to what you wholly love.”\n\nI ended up being a sucker for the romantic subplot in this book, too, even though I can see how many terrible, wrong, bad choices the love interest made. But Jane always puts herself first, and even though she wants to be loved more than anything, she will constantly fight for her own place in the world where she lives on her own terms for her own beliefs. Jane loves herself, and in turn it made me love Jane, and this masterpiece of a story. Overall, I fell completely in love with this. This was so intelligently crafted and so expertly woven! And the dark feelings and vibes throughout really makes this such a unique and amazing reading experience. And I think this is a book that I will be able to read and reread over and over for the rest of my life. You also best believe that if I ever have children, this will be required reading once they get a bit older, because this book seriously has an immense amount of power. And I truly believe this is my favorite classic of all-time now. And I never want any woman to feel like a bird trapped in a cage. Trigger and content warnings for bullying, abuse, abandonment, loss of a friend, and use of the slur g*psy. Blog | Instagram | Twitter | Tumblr | Youtube | TwitchBuddy read with Dani, Alexis, & Kaleena! ❤"}, {"Review": "[The picture disappeared which made the comments rather irrelevant.:]…Oh course, Rush Limbaugh is nuts.In December 2007, on a radio show with an audience of 14.5 million, Limbaugh asked this question about the former first lady's presidential prospects, after an incredibly unflattering picture of her had surfaced: \"Will Americans want to watch a woman get older before their eyes on a daily basis? I want you to understand that I'm talking about the evolution of American culture here, and not so much Mrs Clinton,\" Limbaugh told his audience. \"It could be anybody, and it's really not very complicated. Americans are addicted to physical perfection, thanks to Hollywood and thanks to television” (news.com.au).Interestingly and at the same time, we have John McCain, another presidential prospect, who was 71 years old [11 years older than Hillary Clinton:]. Somehow this is different. Society has agreed that women age, and men grow more distinguished. Ah, bullshit. McCain looked plenty old and acted like an irrational coot.However, the more important point is how little we've changed. Women still must be beautiful. And, for the most part, beautiful women still populate contemporary fiction. Consider how brave it was, then, for Charlotte Brontë to insist on a \"plain\" heroine. Brontë emphasizes Eyre's plainness as if challenging the reader to reject her. The impact of presenting such a heroine may be gauged by a male critic (a 19th century Limbaugh) in the Westminister Review (1858), who writes, \"Possibly none of the frauds which are now so much the topic of common remark are so irritating, as that to which the purchaser of a novel is a victim on finding he has only to peruse a narrative of the conduct and sentiments of an ugly lady\" (Showalter 123).Despite ignoring the classic paradigm of either having a beautiful heroine or a heroine--ostensibly plain--who later \"blooms,\" Brontë makes us forget that neither Jane nor Rochester are physically attractive. From the opening scene, Jane's personality dominants the horizon. Having endured the young master's abuse for some time, Jane strikes back and, as punishment for her passion, is banished to the red room. The room is chill, garish, and where Mr. Reed died. Jane's cries to be released are ignored, and she falls into unconsciousness. Although Jane suffers no lasting harm, her thoughts before she is thrust into the room isolate well why her path will be harder than fate had dictated already:I know that had I been a sanguine, brilliant, careless, exacting, handsome, romping child—though equally dependent and friendless—Mrs. Reed would have endured my presence more complacently; her children would have entertained for me more of the cordiality of fellow-feeling; the servants would have been less prone to make me the scapegoat of the nursery.While beauty and its attendant charms would have made Jane’s life easier, it would have lessened her complexity as a character. Again and again, Jane cannot sit back and depend on the free pass beauty often accords, but must choose to give up or to fight her way through. Jane chooses to fight, and it is her passion, wit, and intelligence that make her an unforgettable heroine."}, {"Review": "I, Ana, take you, Mr. Rochester, to be my lawful wedded husband (I'm sure my boyfriend won't mind).Back off fangirls, he is mine.\nI needed something to make me stop thinking about Heathcliff and Catherine and their  horror  love story. So, naturally, I chose Jane Eyre. Yes, it's dark but nowhere nearly as scary as Wuthering Heights. It's actually quite romantic. Ok, he locked his wife in the attic. In those days people didn't get divorced. If you had a crazy spouse, you locked them in the attic. That's how it was done. Let's cut Mr. Rochester some slack.   \"I knew,\" he continued, \"you would do me good in some way, at some time: I saw it in your eyes when I first beheld you; their expression and smile did not strike delight to my inmost heart so for nothing.\" "}, {"Review": "كلمتان تعبران عن ملايين الفتياتPlain Jane عندماتقفز جملةمن بين دفتي كتاب إلى الحياةاليومية اذن فقد نجح بطلتنا من النوع الذي نلقاه كل يوم بدون ان تدرك بطولته..عاشت يتيمة ..محتاجة..و غريبة. .الا انها امتلكت إحساسا عالية بالعزة و الكرامة ..و عبر عشرات الإغراءات نجحت مرارا في الموازنة بين واجباتها و اهواءهاجين يتيمة .. فقيرة ..عادية الملامح نشأت في كرب شديد لدى عمتها..تذهب لتعمل كمربية لدي ثري غامض مريب حقا.. .و مع تلك العائلة واجهت اختبارات عديدة...فهل نجحت في الحفاظ على مبادئها للنهاية؟ برونتي كتبت الرواية لتحسم الصراع الابدى بين الحب و الحرية ..لهذا صارت تلك الرواية هي النبراس الذي تتبعه كاتبات الروايات الرومانسية عبر العالم ..☀فقد وضعت جين في صراع بين الثرى روشستر و العالم المتفتح ريفرز. .او المطب المعتاد الذي تقع فيه كل فتاة في فترة ما : هذا ما يجب ان تفعله ..و هذا ما تحبه و ترغب فيه فايهما ستختار؟"}, {"Review": "I often think of classics as \"required reading,\" usually accompanied by a barely suppressed groan. Because, surely, they can't actually be any good. I'm not sure why I've always associated well-known and well-loved classics as such, but I suppose it must be the expectation to love it just as much as the world. It's silly, I know. A person can't be expected to love all books, classic status or not, but still, I wondered if I would enjoy it.Jane Eyre is one of those novels that proves me completely wrong and I'm glad of it. It is not beloved simply due to its age or progressiveness or pretentious nature, but because at its heart it's a damn good book. Lyrical, emotional, and captivating, Brontë makes you beg and plead sweet, emotional reprieve. You hunger for it, but she holds on to it ever so slightly -- not to the point of frustration, but instead leaves a trail of bread crumbs to keep you from starving. And the best part is that you delight in every moment. Brontë made my emotions work for that happily ever after with the irresistible OTP: Jane and Mr. Rochester.At the same time, while I thoroughly enjoyed the romantic aspect, I was also equally intrigued with Jane Eyre's life in general. While at times she lived under horrible circumstances, her resilience was nothing short of admirable. She never let her hardships define her as a person or let it compromise her morals even when she was at her lowest. In the end, her luck does turn around and she finds happiness, which at times I felt was way overdue.Thandie Newton's narration was even better than I expected. Her voice brought the novel to life and at times, I could have sworn several different people narrated instead of just her. It was very apparent that she had a healthy amount of respect for the novel, and her reading, imparted the same into me. It felt like her voice said, \"These words are amazing, this prose is magic, this story enchanting. I'm thrilled to be reading them to you. Let's bask in in Brontë's brilliance together.\"  Who could say no to that? I was very impressed and believe listening to this version was the best decision for me. I never was once bored because Newton demanded all my attention.This is the first time that I've read Jane Eyre and I'm glad I did at this point in my life where I'm fully able to appreciate the various themes conveyed. That's not to say I wouldn't have understood certain things, but I'm sure there are lots of books where we come away thinking, \"Wow, this was exactly what I needed right now.\" It's even more surprising and intriguing that it's a novel written over 100 years ago that appeals to me even now. Ah, the joys and magic of literature!All the things that I love in a good book was here and more: masterful character development, interesting plot, and OMG, the witty dialogue. I could have read an entire book composed of Jane and Mr. Rochester's banter alone!This book brought me many happy sighs and I'm thrilled to have found a new all-time favorite in a classic tale. Definitely an oldie, but goodie for sure.More reviews and other fantastical things at Cuddlebuggery."}, {"Review": "\"I love reading\", says a 15-year-old girl in class today. This is so unusual that I smile like a maniac.\"Really? I am so glad to hear that. What are you reading at the moment?\"\"Jane Eyre, and it is very hard to understand, but I am 100 pages into it now, and I think it is great!\"\"Jane Eyre? Jane Eyre?\"I feel like a young woman who thought she was dedicated to an old, grumpy, blind man and realises there is a vital, young Mr Rochester waiting to be adored again and again underneath the surface.Can this be true? Is a classic a classic a classic? Can an idealist school librarian go home and keep the faith in Reader Heaven for once? Yes! As long as young readers find the time and the space and the leisure and the pleasure of reading about the trials of Jane Eyre, there is a place for us faithful guardians of bookish love.When I came home, I found my own copy of Jane Eyre on my daughter's bed. She finds it hard, but good.\"When you make it through the first 100 pages, you will love it\", I say confidently. \"A student of mine told me so!\"\"And since when do you listen to your students, mum?\"\"Since they make perfect sense!\""}, {"Review": "Now I know why Charlotte Bronte said this of Jane Austen: \"The passions are perfectly unknown to her: she rejects even a speaking acquaintance with that stormy sisterhood\". I love Jane, but Charlotte REALLY knows how to write about passion, romantic or otherwise. If Jane’s books are stately minuets in which the smallest gesture has its meaning, Charlotte’s is a spirited, sweeping tango of duty and desire. A perfect blend of passionate romance, gothic mystery, romantic description of nature, social commentary and humor, all rendered in vivid, gorgeous prose. One cannot help to admire Jane Eyre, the little governess who could. She rises above her harsh upbringing to become a governess, poor but ever fiercely independent. Even the promise of love and comfort with the man that she worships is not enough to sway her from the path of integrity. One cannot help to admire Charlotte, who makes her intensely human; a woman of virtue, yet one who is not above jealousy and doubts, and who constantly struggles with the personal cost of her decisions. A deeply felt, and ultimately moving story of love and redemption that will linger long after the last page is turned."}, {"Review": "Jane Eyre makes me want to be a better person. Her goodness, her humility, her frankness, her passion, her fierce will and her moral compass are all inspiring.And yet, I also love her faults. Jane has a temper, she gets jealous, she fights back, and at times she is too obedient, especially when given orders by overbearing men.What is it about this gothic novel that still makes it a compelling read more than 160 years after it was published? I first came to this story, as I suspect many have, through the various movie and TV versions of the book.* I have now read this book three times, and I get something more out of it with each reading. With each reread, I have paid better attention to what Brontë was saying about women and gender roles; I saw her comments on class and social order; I noticed her thoughts on religion and piety, and the continuum of Christian characters she created — some noble, like St. John, and some who twisted the Bible for their own gain, such as Mr. Brocklehurst and Aunt Reed. (As the daughter of a stern clergyman, I am sure Charlotte had some strong opinions on the ways and people of the church.)Indeed, Brontë had a lot to say about Victorian England, and her characters were all so real and well-drawn that I feel as if I know them. I loved this book, and I will continue to love it. I'm already looking forward to the next time I read it.Update March 2017When Donald was elected U.S. President over Hillary, my heart broke. I was depressed and anxious, and decided to seek comfort from my old friend Jane Eyre. This was the first book I grabbed after the November election, and I savored the reread. I chose Jane because she always tried to do the right thing, despite being forced to deal with people of inferior moral character. Jane's goodness was indeed a comfort, and I was grateful for the companionship.During that post-election reread, one quote in particular struck me as especially relevant:\"Prejudices, it is well known, are most difficult to eradicate from the heart whose soul has never been loosened or fertilized by education: they grow there, firm as weeds among stones.\"First read: February 2009Second read: January 2015Third read: November-December 2016FAVORITE QUOTES\"Children can feel, but they cannot analyze their feelings; and if the analysis is particularly effected in thought, they know not how to express the result of the process in words.\"\"I remembered that the real world was wide, and that a varied field of hopes and fears, of sensations and excitements, awaited those who had courage to go forth into its expanse, to seek knowledge of life amid its perils.\"\"It is vain to say human beings ought to be satisfied with tranquility; they must have action; and they will make it if they cannot find it. Millions are condemned to a stiller doom than mine, and millions are in silent revolt against their lot. Nobody knows how many rebellions besides political rebellions ferment in the masses of life which people earth. Women are supposed to be very calm generally; but women feel just as men feel; they need exercise for their faculties and a field for their efforts as much as their brothers do; they suffer from too rigid a restraint, too absolute a stagnation, precisely as men would suffer, and it is narrow-minded in their more privileged fellow creatures to say that they ought to confine themselves to making puddings and knitting stockings, to playing on the piano and embroidering bags. It is thoughtless to condemn them, or laugh at them, if they seek to do more or learn more than custom has pronounced necessary for their sex.\"\"Most true it is that 'beauty is in the eye of the gazer.' My master's colorless, olive face, square, massive brow, broad and jetty eyebrows, deep eyes, strong features, firm, grim mouth — all energy, decision, will — were not beautiful, according to the rule; but they were more than beautiful to me; they were full of an interest, an influence that quite mastered me — that took my feelings from my own power and fettered them in his. I had not intended to love him; the reader knows I had wrought hard to extirpate at the first renewed view of him, they spontaneously revived, green and strong! He made me love him without looking at me.\"\"I care for myself. The more solitary, the more friendless, the more unsustained I am, the more I will respect myself. I will keep the law given by God; sanctioned by man. I will hold to the principles received by me when I was sane, and not mad -- as I am now. Laws and principles are not for the times when there is no temptation; they are for such moments as this, when body and soul rise in mutiny against their rigour; stringent are they; inviolate they shall be.\"FOOTNOTE*Since this is the closest thing I have to a blog, I will share my opinions on the best and worst movie adaptations of Jane Eyre. As I see it, casting is everything. It is not enough to take a famous actress, put her in a dowdy gray dress and do her hair in an elaborate bun. No, you have to find the right actress. And if you are lucky enough to find her, then you have to find the right man to play Mr. Rochester. And then, by jove, the two have to have on-screen chemistry. A film version of Jane Eyre with no heat between Jane and Edward is a waste of everyone's time. So here are my rankings of the versions I have seen:ABSOLUTE BEST: 2006 Masterpiece Theatre version with Ruth Wilson and Toby Stephens. A fantastic script, incredible actors, steamy chemistry and beautifully filmed. One of my all-time favorite period dramas. 5 starsA FOR EFFORT: 2011 movie with Mia Wasikowska and Michael Fassbender. The script moves quickly through the book and changes the original timing to in media res, which works OK. Both actors gave good performances and the mood was very gothic, but the chemistry wasn't as great as with Wilson and Stephens. Mia and Michael were just on slightly different levels. 4 starsSOLID TRY: 1996 Zeffirelli film starring Charlotte Gainsbourg and William Hurt. Fine script and beautifully filmed, the problem with this version is William Hurt, who seems half-asleep. Charlotte is a good Jane, but I wish Franco would have found a more impassioned Mr. Rochester. 3 starsMEH: 1997 movie with Samantha Morton and Ciarán Hinds. A total mismatch of actors. Just frustrating to watch. (Sorry Ciarán, but I loved you in Persuasion and Miss Pettigrew!) 2 starsWORST: 1943 version with Orson Welles and Joan Fontaine. This movie made me cringe. The problem with Orson Welles is that no matter who he's playing, he's always Orson Welles. He is a terrible Mr. Rochester -- he just bellowed and stomped around. I generally enjoy classic Hollywood films, but this was unwatchable. 1 star"}, {"Review": "SPOILER ALERT. YOU MAY NOT WANT TO READ THIS REVIEW IF YOU PLAN ON READING JANE EYRE.I read Jane Eyre for the first time as an adult and I can't help but feel sorry for every junior high or high school student who was forced to read this book. I thought getting through this book was very difficult. I assumed I would love it since I generally love books by Jane Austen, but I didn't find many similarities at all. Jane Eyre was boring and unbelievable. I did enjoy the first half of the book because I had such hope for her, but then it just became dull and unrealistic. I never bought the romance between Jane and Mr. Rochester, nor did I buy the coincidence of her happening to arrive on the doorstep of the only relations she has in all of England during her time of need. I also find it strange that she dedicates the last paragraphs of the book primarily to St. John Rivers, when he was such a small part of her life, not to mention the fact that the part he did play was primarily negative.Bronte failed to draw me into the lives of these characters or like them, frankly, which made this a very long read for me. "}, {"Review": "\n\"Though you have a man's vigorous brain, you have a woman's heart and--it would not do.\" \"It would do,\" I affirmed with some disdain, \"perfectly well.\nOh Jane, you wondrously bold and beautiful gal. After she was orphaned, Jane Eyre was sent to live with her maternal uncle and his wife (Mrs. Reed). When her uncle dies, he forces his wife to swear to love, nurture and care for Jane as if she was their own child. Unsurprisingly, Mrs. Reed is not pleased in the least with this arrangement and does the absolute bare minimum towards Jane. She spoils her three biological children but sees Jane as a wicked, conniving and devilish child (despite ample evidence against). \n I know that had I been a sanguine, brilliant, careless, exacting, handsome, romping child—though equally dependent and friendless—Mrs. Reed would have endured my presence more complacently; her children would have entertained for me more of the cordiality of fellow-feeling\n Jane is sent off to boarding school where life is harsher than before (threadbare clothes, small rations) but she prefers it for she has finally found what she's been missing.\nThere is no happiness like that of being loved by your fellow creatures, and feeling that your presence is an addition to their comfort.\n At the end of her time there, she sets off to be a governess. She takes a job for a Mr. Rochester and tutors his young ward, Adel. Only, when she arrives at the house, she starts to notice certain things. The servants know something is up and won't tell her. Mr. Rochester is hiding a huge mystery and despite the danger, and the difference in social standing, Jane Eyre is falling ever faster in love.An absolutely stunning book. This is my third time through, and each time I am blown away by Jane's strength of character. With every twist life hurled at her, Jane merely straightened her shoulders, adjusted her pack and trudged on. Each time I read this novel, I notice something different. This time, it was how much Charlotte Bronte slipped her own beliefs into the novel:\nPrecisely as men would suffer; and it is narrow-minded in their more privileged fellow-creatures to say that they ought to confine themselves to making puddings and knitting stockings...It is thoughtless to condemn them, or laugh at them, if they seek to do more or learn more than custom has pronounced necessary for their sex.\nIt made for a truly eye-opening rereadThe ABC Reading Challenge - J Audiobook CommentsRead by Nadia May. I may be the only one with this - but whenever I read a really old novel, I find it much easier to listen to (opposed to reading a copy). I spend less time puzzling out the language and unfamiliar terms and more time enjoying the story. I highly recommend listening to this book if you've tried reading it and just couldn't get into it.Blog | Instagram | Twitter"}, {"Review": "\nEDIT - 22/04/2015:-\n The following review was written in paroxysms of adoration which I no longer feel hence a star is being ducked. Now that I have read Wide Sargasso Sea and re-read Wuthering Heights, Rochester and Jane's attraction as characters of high morals has waned in my eyes. But until I write a more balanced critique of this, I refrain from disowning my first impressions.____What do I write about you Jane? Words fall short when I try to. Jane, you are so much a part of me as I am yours.You are so much a part of women who lived in obscurity centuries before Brontë breathed life into you. You are so much a part of women who are alive at present and so much a part of women yet to be born. You are so much a collective chorus of voices than just a single one.You are so much an inexorable force which builds up in intensity over the course of the narrative.You are so much an embodiment of the feminine spirit and not just an ordinary looking, puny little girl of barely twenty with grand world views and ideals.Jane, you are not only the essence of womanhood at its best but the finest specimen of humanity - so refined, so just, so fragile yet so iron-solid. So full of scorn yet so humble. So elegant even in utter distress.Jane, you transcend the boundaries of an era so effortlessly and retain your relevance even today.I don't give any guarantees that reading Jane Eyre (that is if you are still uninitiated) will cure you of misogyny. I do not believe in utopian concepts such as chauvinistic men suddenly giving up on their own delusional views on women and starting to treat them with respect deserving of a human, after reading a book. But it may come very close to achieving that purpose.Then again, I do not expect a well-read man/woman (shocking but women can be misogynists as well) to be a misogynist in the first place.Charlotte Brontë has accorded this immortal literary character with such a voice, such a dignity of bearing, such a sharpness of intellect, such a power of conviction - that absolutely no one can remain unaffected after reading this. Once you get to make the acquaintance of courageous, zealous, outspoken, energetic, intelligent, principled, respectable Jane, you are bound to remember her forever. Rather, Jane will ensure that you do not forget.If you are a woman of integrity, you may see a part of yourself reflected in her sarcastic comebacks, in her sense of humor, in her feelings of rage, in her unapologetic frankness and in her cold refusal to bow down to the wishes of those more powerful than her in terms of wealth or social recognition.Before the term 'feminism' had even come into being, Charlotte Brontë was busy creating an everlasting symbol of feminine power that will stand the test of time with incredible ease and continue to cast its influence on society and literature. Sure Jane Eyre has a romance at its heart - a memorable one at that. Sure it also contains a Gothic mystery. But these are not its only highlights. Jane Eyre is a feminist doctrine in the garb of a novel. Jane Eyre highlights the injustices of class divisions. Jane Eyre contains a subtle indictment of blind religious zealotry and upholds the value of man over God. Jane Eyre lays bare the perversities in self-important men of religion. Jane Eyre criticizes a prejudiced Victorian society and exposes the hollowness of the lives of its affluent but ignorant gentry. And to think Charlotte Brontë wrote this in the middle of the 19th century. The last time I had been this strongly affected by a classic was about 10 years ago, when I had read A Tale of Two Cities for the first time. This is the kind of book whose greatness you cannot try and measure by awarding it a number of stars or even by reviewing it. This is not just one of the finest literary masterpieces ever to come into existence but forms a very important part of the reason why we read, why we prefer to shun the company of people and seek a few precious hours of togetherness with fiction or literature, instead.Dear Ms Brontë, I am late to the party but I have arrived nonetheless. And I cannot thank you enough for bringing me, for bringing 'us' alive in your powerful words. The world and I owe you a debt we can never repay. Oh thank you so very much!P.S.:- This review is glaring in its obvious exclusion of Edward Fairfax Rochester, but that is not for any shortcoming on Mr Rochester's part. Rochester is without a doubt one of the most realistic and engaging literary romantic interests ever created. But I wanted this to be about Jane and only her. Because had Brontë's intention been to bestow equal importance on Jane and Rochester, she would have named this 'Jane and Edward' or something along those lines."}, {"Review": "I just finished this book in the early hours of the morning, and I'm left with a heavy but happy heart and a smile on my face. I clung to those last pages like nothing else - not wanting the story to end - and this is even a reread for me. This goes to show how much I love this book and this journey of Jane. I think what I love the most is exactly the fact that it takes you on an amazing journey, and Jane changes so radically from beginning to end. As a reader, you are rooting for her and your feelings are on their peak from the very first pages when she's being treated so cruelly. Another thing that makes me love this book to pieces is tbe fact that the two main characters are not beauties - the hero and heroine are actually quite ugly, but they find each other - maybe exactly because of that. Finally, we get a story which is not about perfect princesses or handsome princes - this is about common people and that makes it SO MUCH BETTER! I will say that the men in this story raise questions and they are quite unbelievable at times. They behave in such a way that is hard to understand for a modern reader; but I guess that was common back in the days. Nevertheless, that doesn't degrade the book for me in the least. This was a reread for me, but I kept being surprised anyway by the story and the twists and turns. This is a MUST READ and I cannot recommend it highly enough. Beware, because you will be taken on a most wonderful and amazing journey - and good luck! "}, {"Review": "It seems silly to say that a book can affect you on a profound level. well I definitely believe in this power that a good book has. Jane Eyre is one of them. I cannot say that this was an easy book to read. But it was a book that I was very enriched by reading. Romance is a genre that is looked down on by many \"sophisticated readers.\" Perhaps they would look down on Jane Eyre, but would probably get some eyebrows raised at them. Well Jane Eyre is the archetype for the romance novel. After having read thousands of them, I know a romance novel when I see it, and Jane Eyre does qualify. But it is much more than this. It's a story for the person who wonders why they keep trying to do the right thing, and persevering in life, instead of just taking what they want when they want it. If Jane Eyre had been that sort of person, she would not have gotten her happy ending. Instead, Jane walked away from the thing she wanted most in the world. She almost died doing what she felt in her heart was right. Had the story ended there, I probably would have detested this book. But it doesn't. We see Jane continue to grow and act as the phenomenal person that she was. Although often downtrodden, she is no meek mouse. She has a fighting spirit that keeps her going when others would have laid down and died. But despite being a fighter, she is not a user and abuser. It's hard at times for the difference to be clearly delineated. Well there is no question about Jane's level of strength and intregrity. Although it is made clear several times in this novel, that Jane is no beauty, her soul makes her a beautiful character. Beautiful in a more profound way.There are moments when you feel, how can one person suffer so? But taking the journey, you realize that all Jane's suffering had a purpose. It refined her into a woman who could look beneath and love what others could never love or understand. It made her the woman who could love and heal Rochester.At the same time, Rochester was made for Jane Eyre. He had searched his life for a woman like her, and made quite a few mistakes along the way. And out of love, he was able to let her go when he wanted to keep her. But she came back to him, when he needed her most. Rochester is the hero that formed the archetype for many of my favorites: tortured, scarred, dark, enigmatic, all of those things. Best of all, loving little, plain, ordinary Jane with a fundamental intensity that pours out of the pages of this book into my heart as a reader. Despite his lack of perfection, I could not love him more.Ah, how maudlin I sound. I can't help it. This book moved me to tears. Yet I smiled at the same time. I enjoyed the conversations between Rochester and Jane. There was a heat there, a passion. Yet this book is clean enough to read in Sunday school. That is grand romance. The journey so well expressed, that no sex scenes are needed. It's all there. This novel is also inspirational. Not preachy, in my opinion, but for a believer, one can definitely find spiritual messages in this book. About perseverance, about not wearying about doing good. About the profoundness of God's love. It's all there, but in a narrative that expertly showcases it, not preaching it.I feel I am failing to write the review I want to write for this book. The words do fail me. All I can say is that this book will always be a favorite of mine because of the way it touched my heart and challenged me. "}, {"Review": "One of the most beloved novels in history for many generations ; \"Jane Eyre\", is set in England, in the 1800's . The story of a neglected girl orphan, of that name, who never gives up her dream of happiness, no matter how remote a possibility, that goal, can ever be reached. Hated by her cruel Aunt Mrs. Sarah Reed (NOT A BLOOD RELATIVE), and cousins, Eliza, jealous of her more beautiful, but spiteful sister Georgiana, and abused by them both. They look down at the beggar, this little poor girl, this imposition, why is she here ? They show every day, their contempt, not even bothering to hide it . It would be so nice, everyone thinks, if Jane wasn't there. Her miserable, tormented life, seems everlasting, no escape, where would she go ? And treated like a lowly servant, not a loved relative, she the orphan has to keep her feelings, to herself. Bessie, the nurse maid, is the only person, that treats Miss Eyre, kindly, secretly of course. The frosty aunt, who very reluctantly raised Jane, until the age of ten, then gladly Mrs. Reed , sends the unwanted prepubescent Jane , to a charity school Lowood's, run by a clergyman , the tyrannical Mr. Brocklehurst who forgot the teachings of Jesus . Harshly treated there too, as are the other students (Jane is hungry and cold, often), by the director Brocklehurst, a man who believes in discipline, except for his own luxury- loving family ! Jane grows up a lonely woman with few friends, only one in fact, fellow student Helen ( who is there, for a short time), she hopes there has to be something better than mere existence. Leaving the horrible school after eight long years, the last two as a teacher, the teenager gets a job as a lowly and paid little governess , in a gloomy mansion, far away. Her new \"master,\" is the rather distant and frightening Mr. Edward Fairfax Rochester, a mysterious man that spends little time at home. Jane becomes attractive to the not very attractive Rochester, many questions are left unaccountably unanswered, at Thornfield Hall. The little girl Adele, the governess, teaches and takes care of sometimes. Along with her French nurse, Sophie, is she Rochester's child, or just his ward ? Those strange,horrific noises up on the third floor , dreadful, devilish, and inhuman laughs, in the middle of the night, what is causing them ? How did the owner of the house make all his money ? Will Rochester marry the beautiful, but greedy woman, Blanche Ingram, who despises Miss Eyre, and make her leave Thornfield Hall. Will the plain Jane ever find a place to call her own , and find love and contentment ? This classic book, written by one of the brilliant, but short- lived, Bronte sisters , Charlotte, will not disappoint readers of great literature, still worth the effort, after more than a century and a half, of its existence ... it will continue for who knows how long ?"}, {"Review": "I get the feeling that Jane Eyre may have ruined future English classics for me. I find it hard to imagine other classics topping this one. This was actually a book that I had no interest in reading because I had been underwhelmed by a Jane Eyre miniseries I watched several years ago. However, so many people have urged me to read this, saying it’s an excellent book, and they weren’t wrong.Jane Eyre is definitely cut from a different cloth from the other classic novel heroines I have come across. She is well-rounded woman of substance, courageous and brave. We follow Jane from her humble beginnings as an abused orphan, both at her Aunt Reed’s house and the boarding school she was subsequently sent to, to her life as a governess. During this period, Jane learns, and is willing to learn, many lessons. I admired her courage and her determination, her desire to be free, despite what little she had or was given, her intelligence, and her love for others.“I longed for a power of vision which might overpass that limit; which might reach the busy world, towns, regions full of life I had heard of but never seen that then I desired more of the practical experience than I possessed; more of intercourse with my kind, of acquaintance with variety of character, than was here within my reach.” I was surprised to read passages that highlighted her feminist leanings; it was very timely that I read this book on International Women’s Day. “Nobody knows how many rebellions beside political rebellions ferment in the masses of life which people earth. Women are supposed to be very calm generally: but women feel just as men feel; they need exercise for their faculties, and a field for their efforts as much as their brothers do; they suffer from too rigid a constraint, too absolute a stagnation, precisely as men would suffer; and it is narrow-minded in their privileged fellow-creatures to say that they ought to confine themselves to making puddings and knitting stockings…”It’s also a love story, featuring the brooding Mr. Rochester. I found him to be quite an interesting character, though I did question a few of his actions. Bronte’s writing style is truly exquisite; she has an adept handle on the language and her prose was like poetry at times. I found it quite charming the way in which she addressed the reader (“dear Reader”) throughout the narrative. It was also interesting to see that Bronte uses semi-colons a lot more often than I do (and I think I use them a lot!).“The flame flickers in the eye; the eye shines like dew; it looks soft and full of feeling; it smiles at my jargon: it is susceptible; impression follows impression through its clear sphere; where it ceases to smile, it is sad; an unconscious lassitude weighs on the lid: that signifies melancholy resulting from loneliness. It turns from me; it will not suffer farther scrutiny; it seems to deny, by a mocking glance, the truth of the discoveries I have already made…”I’m so glad to have my own copy of this book as I believe I’ll be reading this one over and over again in the future."}], "Genre": "Romance", "ID": "10210", "Desc": ""}