{"Name": "CAPTIVE", "Image": "https://images.gr-assets.com/books/1534459699l/38220317.jpg", "Reviews": [{"Review": "Emotionally gripping, fast paced romance story. The storyline and emotional developemnt of the characters is brilliant and makes you fall in love with the characters over and over again (even though there is somethimesvery little thta is lovable about them). The stories gloomy setting really transports you back to the historical times in which it is set.Even though I am only following this book on Wattpad, where it is currently being published but not completed, I have not read anything like this book for a long time and can't wait for the finised book to come out!"}, {"Review": "I've been searching for great books on Dracula ever since reading The Historian by Elisabeth Kostova. Most surprisingly I came across one on Wattpad, which I just brose for fun from time to time and share my own humble writings. But this book has surpassed my wildest expectations, even though it is not yet even finished on Wattpad, I've never been such in by a story like the one of Vlad and Katherine. If I had to describe this book in three words I would say it is: Harrowing, moving, thrilling, captivating and emotional, all in one!"}, {"Review": "This was a rich, lush, and atmospheric read. This is a book to be read late on a cold and rainy night. The prose is expressive and descriptive...I ate it up, it's like it was written just for me. There were times the writing dangled on the line between beautifully descriptive and purple prose, but I can't complain because the majority of it, like 99.5%, was so damn good. It hit all the right spots, exactly what I want to read in a book with a historical setting, vampires and romance. Unlike many PNR books the word 'vampire' doesn't even appear until the middle of the book, there's more of a demonic vibe going on, with hints to the male MC's true nature. There's no insta-love either. This story is inspired by Dracula and Beauty and the Beast, which immediately made me both intrigued and wary. I first thought the premise could be good, but could potentially go awry, all depending on the writer. Well, the author pulled it off. The author also managed to create a unique story, which is impressive considering stories inspired by Dracula aren't in short supply. The writing was amazing. There were many times I felt goosebumps and chills. I found myself rereading paragraphs just to feel that tingling sensation again. I was terrified of the male protagonist, Vlad, but also extremely interested in him. The vampire mythology was pulled off well. I like a vampire book that subtly hints at the vampire's abilities, without spelling it out. There are no info dumps here. There's a sense of darkness, evil, and magic that pervades the world. There's an intense sensuality between the heroine and 'hero' without explicit sexual scenes. The 'hero' is described as satanic, and possessing powers only someone who has been gifted by the devil or dark magic could possess. He's the kind of evil that looks appealing, and is capable of seduction to achieve his aims. The heroine becomes aware early on that he is giving her illusions of kindness, luxury, and control in order to manipulate her. \n...she became painfully aware that with every passing moment, she was falling ever further under his spell, becoming more and more like those around her, blind to the truth. And this was what he wanted. He meant to ensnare her, entrap her in this fairy tale, he wanted her to believe that the illusion was real.And what if I refuse to lose myself in the illusion, what if I refuse to play this game?She closed her eyes, leaning into his passionate kiss, oblivious that her spectral twin was slowly dying in the arms of her lover, clinging to him as the life slowly seeped out of her.\nWhile reading I couldn't help but think Katherine was acting recklessly at times. To talk back to a king with such disrespect would typically result in a death sentence. This behavior is explained by the author. Katherine has lost everything: her father, title, lands and home. The only thing she has left is her pride, so if standing up for herself results in her death, then so be it. That's her attitude. While the king, the sovereign, typically wouldn't put up with such insolence he has a good reason to do so. There is a backstory to Katherine, which only he and a select few are aware of...so he has motivation to tolerate Katherine's behavior. She's a pawn for his benefit, and it takes her awhile to realize this. This is a common trope in romance novels, but imo it's pulled off really well here.The reader is made aware of Vlad's plans to use Katherine, but the exact details of his plans for her remain a mystery. We're fed breadcrumbs like this: \n...far beneath those murky layers of fear and pain and lust, the light in her soul still shone - small and faint, yet unfailing in its tenacity to keep the darkness at bay. He knew, that if he followed this path to the bitter end, he would break her and extinguish this light forever.\nHow I imagine the castleMonastery Sfantul GeorgheSeveral of the movie stills from the french movie, La Belle et la Bête (2014), really do capture many of the scenes in this book. I initially criticized the book for ending early on Radish (it stopped on chapter 38 when I originally finished). I wasn't aware chapters were still going to be uploaded....and I was pretty frustrated. I saw last night that chapter 39 had been uploaded, so I'm hopeful there will be a satisfying ending to this book. I'm still deducting a star for the story being incomplete so far, and if I'm happy with the ending I'll change it to five stars. So far, at chapter 39, there are still many unanswered questions. If the author can answer some of them, give some more substance to the amazing atmosphere, mystery, and suspense she's provided, then I'll definitely up the rating to five stars."}], "Genre": "Romance", "ID": "38220317", "Desc": ""}