{"Name": "Verity", "Image": "https://images.gr-assets.com/books/1537519686l/41957126.jpg", "Reviews": [{"Review": "\"Find what you love and let it kill you.\" -Charles BukowskiWoah, this was fuuuucked up. It should really come with a warning: do not start reading this at night if you want to sleep.For two reasons, actually. One, it is so compulsively readable that it's almost impossible to put it down until you've finished it. And two, it is seriously creepy and disturbing. Warnings for depictions of child abuse and some graphic violence.Perhaps this doesn't need to be said, but  Verity is definitely not a regular Colleen Hoover romance. There's a love story, and sex, but it is predominantly a creepy thriller. And a mindfuck, if we're being honest.  Verity is mainly about three people - struggling author Lowen Ashleigh, a man called Jeremy Crawford, and Jeremy's wife, Verity, who was recently left incapacitated by a car accident. Verity is a successful writer, but she is no longer able to continue her bestselling series. That's why Lowen is brought in to complete the remaining three books. To do so, she stays at the couple's house so she can go through Verity's notes.But Lowen finds something else in Verity's office. An unfinished autobiography. As she reads, her fear grows. Lowen begins to dig into dark truths about the family and the deaths of their twin daughters. At the same time, she finds herself falling for Jeremy and wondering if perhaps she should reveal the truth to him.I don't want to say too much, but I thought it was excellent. Hoover expertly leads us on a winding trail of lies and manipulation. As the story is essentially Hoover - an author - writing about an author reading about another author, there's this constant sense that someone is lying to you-- but who is it? Now, that's not so easy to tell.\nI was good at spewing bullshit. It’s why I became a writer.\nThis may seem like a bit of a backhanded compliment, but I think I enjoy Hoover’s fucked-up books so much because I usually find her regular romances kinda fucked up. I like her books so much more when she's writing about trauma and morally-questionable characters than when she's trying to sell me a douche as a love interest.It's a clever book, and I don't simply mean because of its twists and turns. It's clever because of the fear and uncertainty the author creates. That all three authors create. The aptly-named  Verity is a novel about fictions and truths, about authors and characters, and about how it can sometimes be hard to separate the two.I found it absolutely riveting.Blog | Facebook | Twitter | Instagram | Youtube"}, {"Review": "Me, rollerblading into my therapist’s office with sunglasses and a piña colada and dropping this book on the desk with a resounding thud: we need to discuss this!Why read Verity when you can just pull out a Ouija board and summon a demon? I'm sure it’ll have the same effect. I finished this book feeling completely sapped of life, as if I've been bleeding freely for the past few hours instead of simply reading. I wish I could just shake my head to dissolve the memory of that ending, to disarrange it somehow. Because, of all the things I’d braced myself for, that did not cross my mind.\n\nSo, what’s this book about?\n\nLowen Ashleigh is set free from the long tedium of her daily life when she’s employed by Jeremy Crawford to ghostwrite the remaining books in a popular series his wife, Verity, is unable to finish due to an unfortunate accident. Lowe acquiesces in the spirit of hope: that this opportunity would help her acquire some small measure of celebrity that would be pure oxygen to the fire of her career. But nothing prepares Lowe for the purity of dread that clamps down her like a vise when she stumbles upon Verity’s autobiography. Verity’s secrets soon take up so much space in the house that there is barely any room left for Lowe’s body. Now she has to force what she’s reading into what she knew of Verity, Jeremy, and their lives together. She has to weave it in among what she expected.Sooner or later, the whole truth would spill, and this fraught waiting would come to an end—with havoc, and screaming, and loss.\n“After all, this is a house full of Chronics. The next tragedy is already long overdue.”\nI relish books that make me backtrack my own declarations of preference, the ones that catch me completely off-guard, astonish me, keep me on my toes. Verity is not at all what I expected, and I think it is all the better for it. I’d gone on in mystery, but not without speculation and a vast deal of skepticism. I made the mistake of perceiving this book through the haze of my opinions on Hoover’s early books, and it didn’t look quite like I remembered. I’ve never been happier to be so astronomically wrong, because this book absolutely lives up to the buzz.Verity is a fiendishly clever, mind-bending whirligig of a book. It’s a hall of mirrors where everything is a vacant reflection, including the people who live there. Hoover lures and tricks and sets obstacles to drive you into her toils. She wields her unreliable characters to stunning effect, confounding, disturbing and delighting in turn, and draws you into a world where illusion informs reality and time enfolds hauntingly. Not only is nothing what it seems, it’s not even what it seems after it’s been revealed to be not what it seems. I was entrapped in this story long before I even realized that the net has been cast.I love how wild the energy was in this book, barely controllable yet perfectly controlled. Hoover drapes Lowe’s unease and confusion over the reader by keeping us in the same disconcerting darkness. Danger pulses all around. Every page is very thin ice to skate on. You can scarcely see the freshly hideous future taking shape ahead of you, yet you can feel it all the same. I have a quirk of prudence in me that’s hard to break and if I were Lowe, I’d have gotten the hell out of that place. I couldn’t fathom how her fear couldn’t properly kindle. I’d have been impressed if I weren’t too distressed and I’d have appreciated her courage if I weren’t too preoccupied repeating a litany of “GET OUT OF THERE” in my head.And, oh my God, the ending. It struck me backhanded. Verity offers you no solidity of truth that you could hold in your hands. Even as I was reading the last chapter, I was mining it for clues, trying to make sense of something so innately senseless. Everything I’ve read up until that point felt like a false memory, and I was left shaking my fist at the whole book for leaving me on such a hideous note as it did.In conclusion, stories like Verity, are the reason I’m going to be one of those parents in their forties that make their kids go to sleep at 6 pm so they can drink scotch in the bath and have an existential crisis about that book they read back in 2018! BLOG | TWITTER | INSTAGRAM | TUMBLR"}, {"Review": "Bold. Unrelenting. All-consuming. Creepy. Unputdownable.What I’ve come to appreciate most about  Colleen Hoover’s work—whether it’s an emotionally charged love story or in this case, her first go at suspense—is her penchant for pushing boundaries. For telling the unexpected story. “It’s got bad things in it. Bad words, bad people, bad scenes.”Hoover preempted  Verity’s release with a warning of sorts—although facetious and comical in delivery, it’s something sensitive readers should take to heart. This storyline is dark, and the lives of the characters that inhabit the pages are far from perfect—so, don’t kid yourself into thinking this is something it’s not.  Verity is horrifying, maddening, and what-the-hell-inducing, but it’s also sustenance for that bibliophile looking to satisfy a craving for something different. From chapter one, it’s blatantly obvious this comes from an entirely different side of Hoover’s psyche than her typical love stories. Blood spatter accompanies the all-consuming, addictive quality of her words. Storytelling with the power to crawl inside of your mind, take over, and demand your undivided attention. Lowen’s life is literally in shambles—her mom just passed, she’s broke, on the brink of eviction and even though she’s a talented author, the crippling anxiety involved with marketing herself to fans has made her work less than popular.It’s the opportunity of a lifetime that uproots Lowen from the hustle and bustle of Manhattan to the quiet Vermont countryside. Contracted by a publisher to ghostwrite the three remaining books in an uber-popular series after the author was involved in an accident, Lowen has a ton of work ahead. Research lands her in Verity Crawford’s home office, looking for anything that might indicate the direction the author wanted to take the series. Instead, she finds herself caught-up in Verity’s life. Living in her home, sleeping in her bed, and spending time with Verity's husband, Jeremy, and their young son. Inescapable is the grief and pain marring it all. Most surprising was the level of creepiness Hoover managed to incite. A level even some seasoned suspense writers fail to attain. From someone who reads in the genre consistently and watches horror, it’s quite the feat for me to feel this level of anxiety. For my stomach to be twisted in knots, in anticipation of what’s to come—but, it happened.And that finale . . . stunning. I was so sure I’d pinpointed exactly what was happening and why, but I was wrong. So very wrong. Hoover mentions in her Acknowledgements that this was an indie project she wanted to branch out and write on her own, which is commendable and exciting when you think about where her inner drive might take readers next. While there’s no denying her love stories are fierce, my hope is for more suspense. To be this taken with her first try, I can only imagine what that mind of hers might dream up next."}, {"Review": "I've pulled up this review and tried to make the words come for a couple of days now, but every time I try to write the words all that comes to mind is WTF Colleen?! Obviously we were warned going in that this one would but much different than her other novels, but she didn't tell us that it would be so compulsive and I wouldn't be able to live my life while reading it. How dare she?? But seriously, this book was so delicious in a seriously twisted way, and I feel slightly guilty admitting that I loved Verity so much due to its dark and disturbing nature.\"Find what you love and let it kill you.\" -Charles BukowskiThere's not really much you can say about the plot here, other than read it for yourself ya filthy animal you really should just go into it blind. Obviously there are numerous content warnings,(view spoiler)[child abuse, murder, murder of a child, attempted home abortion, adultery, descriptive fatal pedestrian accident, etc.  (hide spoiler)] , but it you're open to picking up this book with as little knowledge of the story as possible it will be in your best interest. \"Most people come to New York to be discovered. The rest of us come here to hide.\"The characters here are deviously flawed, every last one of them, and I love this. I'm a sucker for storylines that feature the writing of a book inside the plot, and this was no exception. The varying between Low's present tense POV and the chapters featuring Verity's autobiography built the most exquisite tension, and by the end of the novel we are flipping pages as quickly as Low is, trying to decipher where this is going and what's going to happen. Also, that epilogue. That is all I will say, other than I'm respectful and grateful to CoHo for leaving this book without the neat wrapping and shiny bow. There are pieces of the story that are essentially left up to the reader to determine their thoughts on, and while a bloody and gruesome story, this will make a fabulous book club novel with copious discussion points. Highly recommended if you can stomach the content, but beware reader-once you pick it up, you certainly won't want to set it down until you turn the final page."}, {"Review": "\nHave you ever finished a book and thought… WTF did I just read? Verity is one of those books that will do that to you. Word to the wise for CoHo fans: this is not your typical book from Colleen Hoover. It’s amazingly written and it’s a completely captivating read, but it’s so different from anything she’s ever put out before. \n“Some families are lucky enough to never experience a single tragedy. But then there are those families that seem to have tragedies waiting on the back burner. What can go wrong, goes wrong. And then gets worse.”\nVerity is a complex story about an author who is ghost writing a series for Verity Crawford, an author who is injured in a way she can’t write right now- maybe ever. Her husband, Jeremy, commissions Lowen to do this work. Lowen goes to the Crawford’s house to do some research but that house and that family is more than she ever expected. While searching through old paperwork pertaining to the series Verity has written, she finds a manuscript of a truly messed up autobiography that changes her life and the life of the Crawford family forever. \u2028The word I would use to describe this book is disturbing. I was seriously disturbed the whole time I read. It wasn’t too spooky for me, but it was thrilling and horrifying at times. The writing was out of this world and the story messed with my mind. I’m not sure if I loved it, hated it, liked the characters or hated them. It’s a story that’s not always likable, but dang it was good. It was enthralling and made me think. That ending messed with my mind so bad, I don’t even know how to feel. If you’re a fan of psychological thrillers with romance thrown in and don’t mind a book that’s disturbing and thrilling because it’s also brilliant, check out Verity. I’m glad I went outside the box with this one and read it!!"}, {"Review": "This book was disturbing in a way that is hard to put in words. Verity is pitched as a thriller and a romantic suspense book. Well, allow me to be as candid as I can: \"Verity is a mind-fuck\". Is Disturbing. Twisted. Creepy. It will have you questioning things. Brutal. Haunting.There is no question, the story is hypnotizing. ENGROSSING even if alarmingly disconcerting. And the cherry on top? The ending. That probably held the most savage plot twist I have encountered in a romantic book.If this is the niche that CoHo find and stick, baby I'm yours for life!Verity is not an easy read. I am not really even sure if I can say it was an enjoyable read. But it was brilliant. Amazingly well written and unputdownable, Colleen will leave you questioning everything.By the end of the book, I hate all characters....Thank you so much Kim for your indirect recommendation!"}, {"Review": "Verity left me completely speechless, unsettled and unabashedly begging CoHo to write more thrillers!!!I found this story creepy, dark, addictive and absolutely unputdownable. Hoover has quite an imagination and as an avid thriller reader I was immediately drawn into the creepy world she created within the Crawford's home. \n\"My mother used to say that houses have a soul, and if that's true, the soul of Verity Carwford's house is as dark as they come.\"\nLowen Ashleigh is a struggling writer with no family and no place to call home. She is approached by bestselling author, Verity Crawford's husband to complete the last three books in a successful series his injured wife is unable to finish. Drawn to Jeremy Crawford and needing the financial stability this arrangement would provide Lowen agrees to complete the books and finds herself a guest in the Crawford home as she sorts through Verity's papers. \n\"Some families are lucky enough to never experience a single tragedy. But then there are those families that see to have tragedies waiting on the back burner. What can go wrong, goes wrong. And then gets worse.\"\nThe Crawford's have experienced devastating tragedy in the loss of their twin daughters. Lowen can't help but feel sympathy for the grieving Jeremy and his remaining son. Then she uncovers Verity's unfinished autobiography. Page upon page of bone-chilling, psychotic admissions. As Lowen uncovers Verity's deepest, darkest secrets things between her and Jeremy begin to intensify. But is all as it seems within the Crawford house?There were many chilling & disturbing moments here both in the present and via Verity's autobiography which we get to read select chapters of along with Lowen. I loved this foray into the romantic thriller world and certainly hope we will be seeing more of this from Hoover in the future."}, {"Review": "\n4.5 starsA manipulative mind f*ck that will keep you guessing!Verity is a psychological thriller in which the lines between fiction and reality blur together creating an illusion of truth. \nA struggling author is offered a lucrative deal: continue writing the popular a bestselling series, get out of debt and be in the presence of a sexy man. SOunds too good to be true? Lowen Ashleigh must find out for herself. She heads to Vermont and begins her journey into famous author Verity Crawford’s mind. While digging through Verity’s notes, she comes across a manuscript which appears to be Verity’s autobiography. Lowen gets caught up in Verity’s story that weaves together a tale of obsession, lies, and death. But one must wonder, is Lowen reading fact or fiction?This book sucked me in from the very beginning--it’s addictive and VERY hard to put down. Verity’s chapters were truly batsh*t crazy. Lowen’s narrative was quite interesting as well, but there were times when I was begging for her to pick up Verity’s manuscript again so that I could read another chapter of craziness. I had a theory early on and, while I was correct, I am still left wondering over the truth of Verity’s story.  Verity has all of the elements of a good thriller: It’s intense, dark, and very twisted. Best of all, it still has me questioning the different versions of the truth presented!Thank you to all of my Goodreads friends for putting this book on my radar! "}, {"Review": "C.R.A.Z.Y. To! The! Hilt!CoHo has one vivid imagination, and I for one, am glad she shared this ‘way out there’ creative plot line with the rest of us.Let me tell you there were so many “What the what?” moments, I had to keep reminding myself I wasn’t reading a Stephen King or Greer Hendricks novel. I really wouldn’t put this in the romance category, albeit plenty of sex scenes are a plenty. It is totally more af a psychological thriller. Now you might be saying to yourself, ‘But this is Colleen Hoover and she writes romance novels.’ I know, right?!? Well, she ventured completely out of her box this go round!I think this would make a great buddy read. So much to digest, dissect and discuss. So ‘much’ still swirling in my head ;)I am really glad I refrained from reading anyone else’s review, despite the temptation. I know I continue to sound like a broken record in one review after the other, but good gracious sakes, go in blind, prepare to be gob-smacked and enjoy the outlandish ride!"}, {"Review": "** UNPOPULAR OPINIONThis is the second novel that I've read by the author.  I'm not really familiar with her writing or style, but I was seeing many 4-5 star ratings on this book and it was a \"thriller\" so that was enough to push me to give it a try. There are many, many high reviews for the book so I'm not here to dissuade anyone from reading it. It just wasn't a good fit for me. I read hundreds of thriller/mysteries and love the genre.I've read darker novels and enjoyed them, but this one gave me an uncomfortable feeling that it is hard to express. Was it because it involved the characters children? Maybe. Was it the graphic sex scenes? May have contributed  Was it the improbable plot? I don't usually have an issue with this if I'm entertained. I wasn't. I can't explain more without giving spoilers.Again, this novel didn't work for me. If you decide to read it, you may enjoy it like so many others. Just my opinion. I wish I could unread it."}, {"Review": "3.85 Stars* (rounded up)Well Darn It! This novel didn’t quite live up to the Hype. “Verity” is a novel that I’ve seen crazy review after crazy review for and after a while, the hype got to both me and my book buddy, such that we decided to make it our New Year’s read. Admittedly, this book is, in fact, Whack (and entertaining at that) - however, I expected the ending to blow me away but after all the insane reviews I read, it was just kind of like “wah wah.” “Verity” is my first novel by Colleen Hoover - it was eye-opening! Let’s chat about how salacious it is. Like wowza!  If that’s your thang, you’re definitely going to want to take a bite out of this one. It’s also a super fast read... Maybe it’s the salaciousness… but even I couldn’t tear my eyes away (true dat!, lol). When Lowen Ashleigh is hired to co-author the remaining books in a series for “Verity” Crawford who was in a debilitating accident, she has no idea what she has gotten herself into. Being offered a huge sum of money, she just can’t turn it down. Staying in Verity’s home with Jeremy, Verity’s husband and their son Crew so that she can pour through Verity’s library, Lowen discovers way more than she ever bargained for. “Verity” is weird, wild and yes, quite wicked. It is also disturbing at times, I will not lie, that said, it is highly entertaining.  Had there not been so much hype built up around this novel, I think I would have enjoyed it more, such is life I suppose. I think most readers will LOVE this thus I think you should all dive in, the sooner, the better. Thank you so much to Kaceey for this book! Thank you also for reading this one with me - it was one wild ride! Published on Goodreads on 12.31.18."}, {"Review": "Verity by Colleen Hoover is a 2018 publication. Unlike so many rabid fans of this author, I have not read, to my knowledge, a single book by Colleen Hoover. (Although I did find one of her books languishing on my Kindle recently) I see so many rave reviews for her novels, and some of them seem like books I would probably like, but for some reason I continue to associate her with YA books, which is not my favorite genre. But, when I saw this book on Kindle Unlimited and read the synopsis, I was instantly intrigued. If the book had been written by anyone else, I probably would have given it a pass, while congratulating myself on using my iron willpower to stick to my strict- no exceptions- psychological thriller diet. But, because I knew this book was a departure for this wildly popular writer, my curiosity won out. So much for my iron willpower...The setup is interesting- Author, Lowen Ashleigh’s financial status is as dismal as her book sales. Her mother recently died after a lengthy illness and she’s fending off eviction notifications, when out of the blue she is given the incredible and lucrative opportunity of co- authoring a series with, or rather, for, the famous writer, Verity Crawford. Verity was in a horrible car crash and is no longer able to continue writing. Lowen doesn’t have to think too hard about accepting the job, especially when she sees the amount of money involved. Verity’s devoted husband, Jeremy, allows Lowen to live in their home while she goes through Verity’s notes on the series and acclimates herself with the tasks she’s been hired to perform. But when she stumbles across a Verity’s autobiography amongst her other work materials. Lowen rationalizes the need to read the manuscript, convincing herself it will help her better understand Verity. What she learns about the esteemed author will blow your mind!! Meanwhile, as Lowen immerses herself deeper and deeper into Verity’s memoir, a bond develops between Jeremy and Lowen. The attraction deepens as they spend more time together, until it becomes palpable and undeniable. However, Lowen has begun to irrationally fear Verity.Are her fears overwrought? Is her imagination playing tricks on her?  For long time fans of this author, this book could be a little like culture shock. But, for the seasoned readers of psychological thrillers, all this twisty darkness, and diabolical characterizations are par for the course. However, I must say that this one is more than just a departure for this author, it is a bit of a departure for the standard psychological thriller, as well. Many of you may not remember the surge in popularity of psychological thrillers back in the nineties, not just in books, but in movies, as well. Back then, it was almost a requirement for a PT to be as sexually steamy, as it was edgy and suspenseful. I thought this book had that same feel, as it contained a lot more sexually explicit content than most standard PT’s written today. It should also be noted that many people have shelved this book in the romance category. However, in my opinion, this is not a romance, nor does it fall into the romantic suspense category, although there is a romantic element, if you wish to view it as such. It’s a pure psychological thriller, through and through. That’s just my take on it. As far as PT’s go, this one is unique, very atmospheric and creepy, and even I, Miss jaded and burned out on PT’s, nearly jumped out of my skin on one occasion. The author thankfully keeps the story on an even keel, with no wild, unnecessary, or over the top twists. In fact, the twists are very well timed, and the suspense builds at a steady and effective pace.  Although the story is far from predictable, I did figure some things out in advance, and many seasoned PT readers will probably have a good inkling where everything is headed, as well. It’s an unavoidable ‘occupational hazard’ I think. Still, the final turn of the screw was very well done, and the book ended on a perfect note. I loved it! I am impressed by Ms. Hoover’s courage to step outside her comfort zone, taking a risk by writing outside of her usual genre. That she pulled this off, shouldn’t really be a surprise, though. Reading her bio, I see that she is a number one New York Times bestselling author. Ms. Hoover is a seasoned, professional writer and has been for some time. Let’s give her a little credit here. I hope her success with this book will widen her reading audience and I hope she will try her hand at this genre again someday. Meanwhile, I think it’s about time I checked out some of her romance and contemporary fiction novels.4 stars"}, {"Review": "I haven't had a visceral reaction like this to a book in years. This was a very different style for Colleen Hoover and I devoured it last night (unplanned. I was exhausted and only planned on reading a chapter or two.) It was hard to read at times and I did not see the ending coming, which is rare for me. But, in typical Hoover style, she gives you a security blanket at the end, to help mend your heart. If you read thrillers, you should read this one.If you don't read thrillers, suck it up and read this one.If you're itching for an MM romance about a truck driver named Keath and a mailman named Raul, you should definitely read this book.If you blame Dina Silver for everything wrong in your life, we should talk."}, {"Review": "\nTITLE: VerityAUTHOR: Colleen HooverGENRE: Romantic ThrillerPUBLICATION: Get your one click on!! https://amzn.to/2PqJqqD VERITY:  Is a full-length standalone romantic thriller from #1 New York Times bestselling author Colleen Hoover. MY REVIEW:  can also be found on my blog: \n ➽ KITTY KATS CRAZY ABOUT BOOKS\n This is so completely left field from the types of books Colleen Hoover typically writes, the very first chapter had me sitting up straight devouring her words, loving this different side to her she’s set loose. OMGODDDD!! I don’t even know what to say or where to really begin, this for me was like a slow burn, like a creeper it snuck up on me and I found myself devouring this, the feels came at me full force like an electric shock, shocking my body back to life, the outside world ceased to exist. Going into this I didn’t know what to expect, didn’t look at reviews, and honestly I barely glanced at the blurb, but one constant nagging in the background was my need to sign up for this, my need to read this knew no bounds, I needed to get my hands on this and I’m so glad I did..This is so left field to what this author normally releases and personally I think she nailed it!! I can’t wait to see what she brings us next!!This book won't appeal to a lot of you if your hard limit is cheating. But if you can overlook that aspect then you'll love this one as much as I did..Such a unique f#cked up story, this had my heart racing more times than I can count, I couldn't put it down, I didn't want to put it down. \nAnd then I reached the ending and I was sitting there flabbergasted, like literally no words described what I was feeling, I couldn't wrap my head around it, was it all lies? Or a coverup? Such a Profound train crash type of read, A mindf#ckery of epic proportions, twists and turns I never saw coming but loved all the whiplash they gave me.Highly recommend!!\n\n\n  \n     \n "}, {"Review": "What is an acceptable truth?My truth, your truth, and everything in between......Colleen Hoover hits the ground running in Verity with the sudden bolt of a gruesome accident. Lowe Ashleigh, a mediocre writer treading water in the publishing world, is on her way to a meeting with her editor. She witnesses the aftermath of a pedestrian on the wrong side of the speeding vehicle equation. A handsome stranger on the street comes to her rescue. This intersection of lives will be the pivotal point of what is to follow.Lowe's meeting turns out to be like a concrete slab balancing on her lap. She's been given the opportunity to ghost write for a very successful writer who has been recuperating at home and is unable to complete her books under contract. Uncertainty gnaws at Lowe, but from a financial standpoint, Lowe is desperate after being evicted from her apartment. Opportunity doesn't rap lightly. Lowe signs on the dotted line.Such an undertaking involves moving into the home of the popular writer, Verity Crawford, in order to go over her notes and files. Lowe meets Verity's husband, Jeremy, who gives Lowe every access into Verity's materials. Lowe finds a file that perhaps she should have set aside. As readers, we are allowed a jaw-dropping chapter here and there from said file. Yama Hama.....It's Fright Night!Hoover hands off the wrenching reality of knowing what you know alongside the sharp-edged anguish of either swallowing it down or spitting it out. We experience Lowe's shock as more and more is revealed about the renowned Verity. It's a huge understatement to say that not all is as it seems here.Prepare yourself for plenty of crossing-the-line brutal details in this one. T'ain't for the tender of heart. Colleen Hoover reveals in her Acknowledgements at the end of the book that she wished to venture into a genre outside of her usual neighborhood. Believe me, there must be some raggedy creatures swinging from the rafters inside her mind. That gasping sound will be your own......"}, {"Review": "**** 4.5 Stars!!!!****WOW!!!! What a book! I haven’t been so captivated by a story in a long time! I shouldn’t be surprised that one of Colleen Hoover’s books would do it! This one is a different kind of book than her usual; but it was brilliant, even if at times it was hard to swallow!“Verity” is a mysterious thriller type book, and at times it is down right disturbing. It is a book you want to go in blind and do not go around reading reviews trying to get spoilers!!! Lol! ( trust me... I was tempted!!) As I was reading, I thought I had it all figured out... and I was feeling pretty darn smart!!! Then the last few chapters blew me out of the water!!! I was quite wrong and I must say that I love books that take me by surprise like that! This is definitely a must read and it is unlike anything you have read before! To be honest, for me that is a huge draw nowadays! There are too many stories that are the same old stuff out there. My passion and interest is hard to stir anymore... don’t get me wrong... I still love to read!!! It is just hard to find books that will stick with me and get my juices flowing! This one absolutely did!!Thanks to my Buddy Steph for travelling this journey with me! I loved discussing our theories together! Not very often you scream while reading a certain scene... hey Steph!!! Lmao!!!!"}, {"Review": "Hooked immediately!!!! Thank you, Jayme!!!!Lowen and Jeremy -complete strangers -are alone together in a public - cafe men’s bathroom.They have just witnessed a man die on a crowded street in Manhattan. People were waiting for the crosswalk light to change. The man was looking at his phone when he stepped off the curb. The crack of his skull hits the ground as a truck hits him. Lowen was close enough to get splattered blood on her white blouse. The stranger, Jeremy, also near by, kindly guided her into the coffee shop bathroom to help her clean up. Lowen became quite vulnerable the minute she took her blouse off to clean it - ( ends up tossing it in the trash), standing in front of the sink with her unattractive bra. Jeremy removes his shirt - gives it to Lowen. Literally, he gives her the shirt off his back. He has a white t-shirt underneath. Lowen is aware of the vulnerable connection. Jeremy says:“I can’t tell if you’re calm or in a state of shock.” ( given they just witnessed a man’s death by a truck driver).“I’m not in shock, Lowen says,....but I don’t know that I’m calm either. I’m not sure, I admit. Are you okay?”“I’m fine, he says. I’ve seen worse, unfortunately”. Five months earlier, Jeremy pulled his eight year old daughter’s body out of a lake. A week ago, Lowen’s mother had died. She died of cancer. Where on earth does this conversation go from here? Lowen and Jeremy were only together by pure - ‘tragic’ - accident. Their conversation got heavy fast for complete strangers. Lowen wants to thank Jeremy for his help and be on her way.... but she is drawn to his altruism-a rarity these days. Then she notices a wedding ring. Oh well! They say goodbye.Lowen has a meeting in 15 minutes with Corey, her publisher and the editor from Pantem Press. The meeting will take place on the 14 the floor. Turns out Jeremy is in the same elevator, with a new clean shirt on...( fast change as he had a hotel room near by), .... also headed to a meeting on the 14th floor. Job opportunity arises. Jeremy’s wife, *Verity*, A bestseller series author... won’t be able to finish the remaining three novels in her series. Lowen is offered the job of finishing Verity’s series. Three novels to write. The hiring process made me laugh (financial benefits galore),....Lowen Ashleigh, takes the job with a pen name, *Laura Lane*. She can remain anonymous...which was vitality important to her. Lowen/ Laura moves into Jeremy’s house. She is there to research and study Verity’s books and notes. Jeremy has a five year old son: Crew.Chastin and Harper, twins daughters, both died from separate accidents. Chastin from anaphylaxis...( peanut allergy)...It was only weeks later, that Harper died in the lake behind their house.Both twin girls - dead! The suspense keeping building... We are turning those pages. Verity is in bed...pretty much incapacitated from ‘her’ accident (car crash)...confined mostly to one room - but her presence looms in almost every room of the house. We wonder about her car accident. Human error? Or intentional? Things aren’t right in the house. The house is filled with “chronics”. So many devastating tragedies!!! Yet Jeremy is warm, giving, and tender. Seems like the nicest guy in the world. So... what gives? But....with all those tragedies- and strange things happening inside that house... things are just creepy. Eerie is as eerie is!!! Two nurses take care of Verity full time: The Monday through Friday nurse, and the weekend relief nurse.Even they seem suspicious. As Lowen begins her research - reading the novels in the series that Verity wrote, she finds an autobiography- not part of the series... but with much insight into Verity, herself. She reads disturbing information about her.At the same time - Lowen is falling for Jeremy. has developed a crush on a man who is devoted to his ailing wife. Jeremy has even more baggage than Lowen. “Now that’s karma”. I enjoyed this fast pace psychological thriller.However, the ending was definitely rushed - and a mediocre ending compared to the rest of the novel. I didn’t mind the ending per say, ( even predicted some type of similar ending)... but the build-up ‘care’ - developing the ending felt anemic. Overall: Fun- thriller- rush!!! 4 strong stars! "}, {"Review": "An Ode To Colleen HooverHoover is in a category all her own when it comes to modern romance with a twist. You see, in case you've never indulged in a Hoover novel, she always has a \"hook\" (if you're a musician or music lover you'll know exactly what I mean). At some point in most of her novels you will inevitably sit up and go \"wooooahhh what in the actual fuck just happened?\".She can do it with just one sentence, like with the book Hopeless. The scene where Holder reveals the truth to Sky. I mean, idk about you, but I sat up in the bed and audibly gasped. My point is that she doesn't put forth simple fluffy romances. There's often something more just under the surface that tickles at your subconscious until Hoover is ready to spring it on you, pulling the carpet out from under your feet, making you question everything you just read. Like a Sixth Sense moment, you know what I mean? Over the years I've watched reviewers, and even fellow authors (always female) (shame on you), throw shade at Colleen for every reason under the sun. Most especially about the dynamics she creates between the men and women in some of her stories. Her critics say that the men are creepy, sexist and don't take no for an answer, her female characters are pathetic and weak. You know what I say to that? SO FUCKING WHAT?It's not Colleen's responsibility to only write politically correct scenarios.It's not Colleen's responsibly to coddle you and your sensibilities. It's not Colleen's responsibility to create what YOU feel are likeable characters.So what if you feel that all of her female characters are portrayed as weak. So what if you think all of her male characters are creepy.So. The. Fuck. What.And before some fuckwit comments about it...It's not Colleen's responsibility to provide role models for young men and women to emulate.It's not her responsibility to censure herself and her craft because it may in some way negatively influence a reader. It's not her responsibility to teach young women what they should and should not tolerate from a man. I've never seen any other author take the kind of flack that is thrown in Colleen's direction in an attempt to diminish her loyal following. All I can say to Colleen is that she must be doing something right. She should stop kowtowing to these armchair feminists behind their computer screens. She writes FICTION for ADULTS and if they can't sort out the difference between that and the real world then to hell with them.____________________________fic·tion/ˈfikSH(ə)n/nounliterature in the form of prose, especially short stories and novels, that describes imaginary events and people.invention or fabrication as opposed to fact.synonyms:fabrication, invention, lies, fib, untruth, falsehood, fantasy, nonsense____________________________In case anybody is still reading this .... I very much enjoyed Colleen's first foray into the romantic thriller genre. The story was gripping to the point that I read the entire book in one sitting that ended at 6:40 a.m. *yaaaaawwwwnn*This book would have easily been a 5 star for me if not for the \"I saw it coming\" lackluster ending. I feel like the story could have gone deeper and darker than it did. Hoover is just getting her feet wet with this one and I hope she's ready to dive off headfirst into the deep end of a shallow pool with her next endeavor."}, {"Review": "Lowen Ashleigh is trying to hold her life together. She is an author, one that has never hit the big time. But her ship may have just come in when an unexpected job opportunity presents itself.Verity Crawford is a best-selling novelist who, after an accident finds herself unable to fulfill her contract to complete her next book. Verity's husband Jeremy seeks out Lowen to step in and complete the outline and book. Only Lowen gets more than she bargained for!Oh, how I wanted to be shocked! Have that mind-blowing experience that just seems so rare in thrillers these days! Everyone was raving about this latest book by Colleen Hoover. I’d never read her books before, but after reading a multitude of reviews it seemed certain this book “was it!’” I quickly jumped on in! And while I devoured it in just over a day and was glued to every page, in the end I was left asking that oh so familiar question.“Is that it?”Sadly yes... I didn’t get my “wow” moment. But...Did I enjoy the heck out of this book? Absolutely!!Am I a new fan of Colleen Hoover? Jumping on the Colleen Hoover fan wagon!Will I pick up her next thrilling novel? Without a doubt!A buddy read with Susanne!"}, {"Review": "OMGOSH, the mind of a writer! Unputdownable! It all begins with a chance meeting and a shocking \"death by routine\" for a gripping start! Death by routine....hmmmmm, very scary in this day and age....and you'll see why. The storyline follows a struggling writer who desperately needs a job and a place to live since her recent eviction. A lucrative offer to complete a series of books by an accomplished author seems right up her alley....until extensive research turns up an autobiography from hell. (no spoiler here)  With the discovery comes evil, tragedy and a multitude of obsessive sexual descriptions that unfold to make her new temporary residence one of sadness and horror. In VERITY, \"With the imagination of a writer, every noise becomes a threat.\" In  VERITY....my first and not last read by Colleen Hoover....the outcome turned out to be quite unexpected; the novel, one fine suspenseful and creepy work of fiction!"}, {"Review": "I can't even form normal senteces right now. I'm so... I don't even know. I'm so confused...Me, the entire time reading this book:I mean...What the hell?Read this book, just read it. WHAT A MASTERPIECE! (Btw. I'm still in shock)I thought about writing a review, but trust me when I tell you that the experience is even better if you don’t have a clue what is going on and what is going to happen. ☺️Story, characters, writing, relationships 🌟🌟🌟🌟🌟"}, {"Review": "EHHHH, es que sí me gustó, pero ayyyy.Creo que la historia es buena, me mantuvo intrigada y hubo partes que me horrorizaron. Incluso hubo partes que me ASUSTARON, ¡puntos por eso!Mi problema fue que odié a la protagonista. Y al protagonista también. Verity era el personaje que Colleen creó para que todos odiáramos, pero definitivamente me parece el personaje más fascinante e interesante de la novela. Y estoy consciente de que en esta novela, todos los personajes son de moral cuestionable, ninguno podría considerarse \"el héroe\" o \"el bueno\", todos tenían más momentos despreciables que momentos en donde pudiéramos empatizar con ellos. Y como dije, especialmente la protagonista me desesperaba mucho. OH, y no me hagan hablar de la relación \"amorosa\" que se fue desarrollando. Creo que el libro hubiera estado mejor sin esa historia de amor, porque en serio, fuera de eso, ¡la trama era increíble y atrapante!También... me gustó el giro que da al final, pero no me encantó cómo fue ejecutado. Me hubiera gustado que llegara más de golpe, y que no se tuviera que explicar con tantas páginas. Tal vez era necesario, pero siento que pudo haber sido de otra forma para causar más impacto.EN FIN. El libro me gustó, hasta ahí. Y mis partes favoritas fueron las del manuscrito de Verity, cada vez que tocaba un capítulo de ese manuscrito, yo terminaba horrorizada (y extrañamente fascinada)."}], "Genre": "Romance", "ID": "41957126", "Desc": ""}