{"Name": "The Consequence of Falling", "Image": "https://images.gr-assets.com/books/1546118080l/42351725.jpg", "Reviews": [{"Review": "4 stars \nEnemies to lovers stories. I swear, I can’t get enough of them lately. When I read the blurb for this book, I knew I had to read it. It had the great banter I love, a bit of angst, laughs, and also some emotional parts.Presley and Nathaniel meet when she is in high school and he is in college. They don’t start out on the best of terms, and as they get older, it doesn’t get much better. When Presley’s father announces that Nathaniel will be his new business parter, which means Presley will essentially be working for him, she has a little fit. This is not what she needs right now. \u2028Presley is going through a divorce and things aren’t easy for her at the moment. She’s tough, though. Nathaniel knows that. Nathaniel and Pres have always had a love/hate relationship. Deep down, you can tell they both really do like each other and are insanely attracted to one another, you’re just waiting for the other shoe to drop. And when it does it’s glorious. I loved these two together. I loved their banter and the sexual tension that was always there. Nathaniel has a lot of drive and really built himself up from nothing. I admired and respected him for that. Presley didn’t have the same upbringing. Her life was much easier, but I still found her to be strong and likable. I really loved the relationship they both had with Presley’s father. It brought me to tears more than once. If you’re looking for an emotional story that’s also steamy, swoony, and has the best back and forth/enemies to lovers, pick up The Consequence of Falling. I really enjoyed reading it!"}, {"Review": "4.5 ”You’re Everything I’ve Ever Wanted” Stars!(ARC provided by author)\nPresley Rose is a New York socialite whose family owns a successful brewery business that everyone always assumed she'd one day take over since she's an only child. Most of her life she's done what's expected of her. She attended college and married what she thought was the perfect guy on paper. The safe choice. Now after an unhealthy, failed marriage, she's left to pick up the pieces. She feels like her life is falling apart, and she's tired of plastering on a fake smile, and acting like everything is ok, when it's not. She's finally ready to live her life on her own terms.Presley is excited for a new project she's working on with her dad, when she finds out her dad's new business partner is her longtime enemy Nathaniel Bradley. She met Nathaniel when they were teenagers and her emotions were all over the place. He's always been her father's favorite pet who knew just how to make her somehow feel inferior. \nPresley & Nathaniel were from different social backgrounds, and both attended NYU where she practically threw herself at him over the years, and he always rejected her advances. He treated her like an overprivileged, spoiled princess, and knew just how to push her buttons. Nothing was ever easy for her, and she hated how he seemed to do everything effortlessly. He was the classic rags to riches story, and the media loved him. He's still devastatingly handsome, and extremely annoying. He was never nice to her in the past, and they would usually bicker, and then go their separate ways. Now they're both single and share a mutual attraction they try to ignore. Their working together in close quarters, and the longer their around one another, the more they can't quit thinking about the one time their lips touched. Each encounter left Presley infuriated and frustrated. She thinks Nathaniel has no interest in her, but he wants her any way he can have her. He's had it bad for her since he was eighteen, and he's tired of denying what's between them.\n-The fire in her eyes made me feel things I rarely felt outside of our encounters.-“I’ve dreamed about this moment more times than I can remember.”-He always found a way to take me completely out of whatever was happening in my life and make me focus on something else, even if that something else was anger toward him.-A kiss from this man had me feeling like I’d been kissed wrong all along. \nThis was a fantastic enemies to lovers romance full of emotion, fabulous banter, chemistry, angst, sexual tension, and second chances. It never fails I always love this authors books. She creates exciting, intriguing stories that I can't get enough of. \n***NOW AVAILABLE***https://amzn.to/2QK3Ewa"}, {"Review": "I LOVE \"enemies to lovers\" stories and this was a very quick and fun read. I really liked it. <3 If you enjoyed Ms.Contreras previous works, I think you'll like this story too. Ps. \"Hearts\" series are still my favorites but I very much enjoyed Nathaniel & Presley's journey. ;)\n*ARC kindly provided by author in exchange for an honest review. ❤❤❤\n\nBLURB : The list of things I hate is short. Not even my soon-to-be ex-husband is on that list. Nope. I save only the worst of the worst, the crème de la crème, the absolute I cannot even for this list . . .1. Black coffee2. Rude people3. Nathaniel BradleyWhich is why when my father informs me that he’s making Nathaniel Bradley his new business partner, and in turn, my boss, I flip out. 1. He’s an annoying know-it-all. 2. He calls me a spoiled princess every chance he gets. 3. He disapproves of everything I do.I go into this knowing I’ll hate every second in his presence. Except the longer he’s around, the more I find myself staring at his lips and remembering the one time they were on mine. I randomly find myself looking at his hands and wondering how they’d feel on my skin. I try to snap out of it, but I guess I’m not as smart as I thought I was. No matter how many times I remind myself of the times I’ve practically thrown myself at him and he’s pushed me away, I keep falling little by little.I’d always heard that it was a bad idea to mix business with pleasure and if that’s the case, this thing with Nathaniel has demise written all over it.mise written all over it. \n"}, {"Review": "★ 1 STAR ★▬⋆▬⋆▬⋆▬⋆▬⋆▬⋆▬⋆▬⋆▬⋆▬⋆▬⋆▬⋆▬⋆▬⋆▬ Eu tentei muito gostar deste livro, mas não fui capaz de me conectar com nada.Achei ambos os personagens principais sem carisma e química. A imaturidade da Presley me irritou ao extremo, que personagem chata! Sem contar que pra mim a história foi entediante e muito previsível, consegui prever e acertar tudo o que se desenrolou nesta trama e isso definitivamente matou qualquer prazer que esta leitura poderia me proporcionar. Infelizmente não me surpreendeu como gostaria!"}, {"Review": "\n\"Forever ever.\"\nThe Consequence of Falling is a Contemporary Romance with complex characters, passion, and tender romance. Presley Rose has lived a privileged life. Her father, a successful businessman, and her mother, a professional socialite, have done there best to give her everything her heart desires. But when their marriage falls apart, Presley is forever changed. Her father hires a young man named Nathaniel Bradley as his apprentice and occasional driver for his young daughter. Nathaniel and Presley have nothing but disdain for one another and yet, as the years pass a unique attraction begins to develop. But Presley marries another man. After time has passed, Nathaniel finds success and becomes business partners with Presley's Dad. When Presley's marriage has failed she comes home to work for her dad. Imagine her surprise when her old nemesis and crush is now her boss. \n\"What if you want me to give your key back?\"\n Told in multiple POV, The Consequence of Falling is a delicious enemies to lovers romance. With witty text and passion, Presley and Nathaniel's story is full of twists and turns. The push and pull between the two kept me entertained and on the edge of my seat the entire read. The supporting characters enhance the plot greatly as family dynamics play a pivotal role in the plot.\n\"You couldn't possibly have been in love with me forever...\"\n Overall, I highly recommend The Consequence of Falling to anyone who enjoys a second chance romance with a strong alpha male and a spunky heroine. Claire Contreras is a truly gifted storyteller and I always enjoy her work. ➼ ARC graciously provided in exchange for an honest review!For more reviews/reveals/giveaways visit:"}, {"Review": "\n\n\n\n\n The thing about falling was that it didn't happen the way everyone imagined it. Sometimes it happened slowly, over time, and other times you find yourself sitting there waiting for the other person to catch up \n’THE CONSEQUENCE OF FALLING’ Is a full length ‘romance’ novel by author ‘Claire Contreras’ Spoken in Dual POV'sThe day fifteen year old high schooler Presley receives the news that her beloved parents are getting separated is also the day when she first meets eighteen year old Nathaniel. She’s expecting one of her parents to pick her up outside the school in the pouring rain sulking over the circumstances life has thrown her, but in their place is Nathaniel. Who unbeknownst to her has worked for her father for years. And her father's favourite pet as she called him was currently putting himself through business school in NYU. They don’t get off on the right foot, she thinks he’s kidnapping her and he thinks she’s got a screw loose. \"Are you seeing a therapist? Because you should. You jump to crazy conclusions about perfectly normal situations.\"As the years go by they run into each other off and on and even then with many years gap between when they see each other their banter is still in the forefront of each casual meeting. Fast forward when a few more years are behind them, with Presley licking her wounds over a failed marriage she's ready to jump head first into her fathers company but it's a shock to her core when her father announces that Nathaniel will be his new business parter, penning him as her new boss, old insecurities rear it's ugly head  I always felt less than him in my father's eyes  as she struggles to find her place in the male dominant world. Presley and Nathaniel have always had a love hate kind of friendship,  We butted heads on everything under the sun  she always felt as though her father preferred him over her so a lot of emotional word vomit ensues. Working together as a unit their bond becomes stronger, the sexual tension simmers away in the background until they can't fight it any longer. \n Timing really was everything This wasn't a bad read, I really enjoyed it, the only thing that grated on my nerves after a bit was the heroine Presley, Nathaniel had her pegged as a princess from the get go and he was right on the money. But in saying that towards the end we saw her coming into her own, and that's when I started really connecting with her character. I loved Nathaniel, a man driven to make himself better working himself from the ground up, making a name for himself but when it came to Presley he knew which buttons to press to get her worked up and I enjoyed their banter.A few life lessons, an emotional journey of losing a loved one but finding love where she least expected it. \n\n  \n     \n "}, {"Review": "Always enjoy a read by Claire!!! I especially enjoyed Nathaniel & Presley❤️ \n\n\n\n"}, {"Review": "❤️4 stars ❤️The Consequence of Falling is a sweet,steamy and emotional story.I was hooked and intrigued from the first pages.I liked the romance and the characters.The writing is flawless and the story fast paced!I enjoyed Nathaniel and Presley .They have a great banter, they were funny,intense and flirty.From their very first meeting you can feel the tension between them!Presley most of the time was so funny but there were moments she was getting in my nerves but this was not entirely bad.Nathaniel intrigued me and I liked me.Overall The Consequence of Falling is a heartwarming story with a swoon worthy hero and a romance which have it all!Sexy , angst and cute moments! \n\n   "}, {"Review": "\n➳A second chance novel that will have you wanting more of Claire's writing and her way of emotionally captivating her audience...\n➳Claire is known as an author who knows how to properly write a romance novel that will captivate your heart completely. No matter what the story line may be, she knows how to slowly and surely gravitate you to the next page making you want to read more. There is no denying this romance novel is an exception since there is so much to look towards to when it comes down to Presley's and Nathaniel's story. Both are two individuals whom have known each other for years. Years turned into days where they would constantly see each other throughout their college years. Both NYU students, they know how to take advantage of the city life. Obstacles come their way but they, especially the one obstacle for Presley, tend to be no match towards the rejection Nathaniel has towards her every time she wants him. ➳In his mind however, we later throughout the story learn to realize that he rejects her advances for the sake of him wanting all of her. Not just the drunken Presley who has such a feisty attitude towards him and wanting to devour him. But also the Presley who has this inner, deep emotional side to her that Nathaniel wants to own and captivate in the most sweetest of ways.➳Once they are together, both emotionally and physically, Presley and Nathaniel learn how to properly be with other and not hate each other. To me, I find this witty banter that they both have to be one that is endearing in the best of way. Overall I enjoyed Claire's novel. It is one that truly does get your blood pumping in such a tender attribute, one that also has your heart speeding with wanting more of Nathaniel. ➳ARC kindly provided by the publicist, in exchange for an honest review coming...➳Follow Me On:Blog ♕ Instagram ♕ Facebook ♕ Twitter"}, {"Review": "This isn't just a love story, it's a love journey. It takes through the life and experience known as bad timing. The not feeling enough to be the one. Not only did I love this book but it saved me. Pulled me from my book funk and reminded me they're are too many beautiful love stories to read to dwell on one. The angst, heart wrenching moments, me throwing my kindle in frustration, and hurting for two souls that are too stubborn to see what we can all clearly see...The way it all plays out for me, although infuriating at times, happened perfectly. The meet. The years. The \"go\" time. When things start to break, people have to look beyond themselves and their baggage to the love that has been shining throughout. A beautifully done, enemies to more, love story that Ms. Contreras brought perfectly to her readers. Love it."}, {"Review": "Presley is 15 when she meets 18 year old Nathaniel for the first time. Her rich dad hired him to do odd jobs for him and that day's job was to pick her up from school.They did not start their relationship as best of friends. He thinks she's a spoiled little princess and she thinks he's an ... idiot!☺They meet again through the years. Presley is always attracted to him - but they always argue back and forth like two old married people!Nathaniel is working his way up the ladder in Presley's dad's company - and making his own money and Presley is getting married... and divorced ...Now she's back home and about to start working for her dad's beer empire - only he doesn't own the company anymore - he just sold half of it to Nathaniel!And now they have to work together constantly.The princess and the idiot .. who always smells so good and looks amazing in his suits and who looks at her lips all the time.Ugh! ☺☺LET THE FUN TIMES BEGIN .... ☺What will happen to Presley & Nathaniel?Will there be a HEA?READ THE BOOK TO FIND OUT!══════════════════Awww, that was adorable!It's a bit of a slow-burn romance. We kind of notice the attraction the first time they meet as teenagers, but they just can't be civil with each other. They argue and bicker and insult and the reader just knows that this is all just the most adorable and fun foreplay!But now is finally the time for them. Of course it will take them forever to understand that the one person for them has been so close all along. And the reader has an amazing time watching them fight and argue their way to that happily ever after.This was a really great romance. Sweet, funny, sparky, sexy with a few very moving and heartbreaking moments.I loved reading it!We even see some old friends for a few seconds!(Which was ok for me - I read all the Hearts books - but it could also be that other people were mentioned, from books I didn't read? Or books that are planned? Just a little too many people for my taste. No idea if we'll see them one day or already have. At least I recongnized the Hearts-series people. LOL!!!)Another tiny little thing that bothered me a bit.The beginning was interesting and sweet and fun but then once they 'got together' ... there was a lot of sexiness and not much more ... and then it got a bit more interesting again towards the end. Maybe a little bit of drama or excitement should've/could've been thrown into the middle of the book - to break up the sexy times. ☺ I still loved the book, but it could've been a tiny bit ... deeper or with a bit more detail or .. I don't even know what I mean. I really liked it. Cried a bit even. But I was always hoping for a tiny bit ... more.Maybe Nathaniel wasn't happening as this sexy-alpha-hero person the way I wanted/expected him to. He even gets his own POV and he's such an amazing guy, but he's also not really present. It's all about Presley and her dad and the company. Nathaniel gets lost in there somehow/somewhere. And he deserves better.THE CONSEQUENCE OF FALLING was a very adorable frenemies-to-lovers-beer-office-almost-stepbrother love story! ☺ Run to your nearest amazon for your own NATHANIEL - this one is MINE!!!\n♡ \n♡ \n\n\n\n \n \n \n \n"}, {"Review": "Loved it! It was delightful and fun and pretty predictable (but in a good way). There was a real chemistry between Nathaniel and Presley and the author did a brilliant job at building up their relationship. I loved seeing the two each learning to value the other and seeing them go from tolerance to acceptance to cherishing one another. I loved their relationship and their banter and how darn cute they were together. The Consequence of Falling is a funny, sexy enemies-to-lovers story that made me laugh out loud more than once. This book was engaging and made me want to read 'just one more chapter' and then 'just one more'. If you are looking for a book with witty banter, relatable characters, a touch of angst, and some heat, then this is the book for you! In short:Hero 4/5 | Heroine 4/5 | Plot (Point, Originality) 4/5 | Writing Style 4/5 | Steam 4/5 | Romance 4/5 | Angst-Suspense 4/5 | Darkness 1/5 | Humor 3/5 | Secondary Characters 4/5 | Drama-Conflict 4/5 | Mystery 0/5 | Twists 3/5 | Pacing Steady | Action 3/5ARC kindly provided in exchange for an honest review."}, {"Review": "3.75 stars.Cute enemies to lovers story with a little sadness.I liked it well enough but it never quite hit its potential IMO.My first read by Claire Contreras. I have had the Heart's series unread on my kindle for rather a long time now. I really need to start reading it soon as I believe this book was a spinoff story. PresleyOne thing I did learn throughout my life was that the weight of unspoken words always felt heavier than the burden of the consequences they carried. And so, I spoke....... "}, {"Review": "How do they call, when a taken man kisses a taken woman on her wedding day? 🤔He had a gf and she had a fiance, but they still kissed.Hmm, let me think...Overheating? Nucleating?or maybeCheating?! 🤔He was an arrogant jerk; she was ok till the moment she called his gfs bimbos and threw herself at him.DNF @ 17%I suppose he would be a cool, cold, brooding tycoon, who bought her father's business, and she would try to become a better person and throw herself at him. Wet panties and week knees are a given I guess.Note to myself - freaking stop reading CR! 🧐"}, {"Review": "5 'Forever ever' Stars!Loooooooooved every second! This enemies-to-lovers love story was everything I hoped for. Claire Contreras writing is amazing, her characters well developed and engaging and the romance was emotional and oh-so-sexy! I got hooked on the very first page (and the very first meeting between Presley and Nathaniel) and I loved The Consequence of Falling till the very end. Presley and Nathaniel are a wonderful couple, I loved the building of their love story, all the characters in it, the explosive chemistry, all those feels and that beautiful ending! I definitely need to check more of Claire's work because the ones I've read I really loved. Highly recommend reading this one, guys!"}, {"Review": "\n\n“You have no idea how long I’ve wanted you.”\n\nIf you want your next romance novel to captivate you from the very beginning and utterly consume your heart and soul, then I urge you to read The Consequence of Falling by Claire Contreras; it was sweet, steamy, and emotional. I just cannot get enough of stories which are written the way I love, intelligent, witty and the ability to set a scene so vividly. Claire’s carefully constructed words made me feel like I was living this journey along with the characters that I got to know and love. I love nothing more than an ‘enemies to lovers’ story and this one had it down pat. Presley and Nathaniel have known each other for years, and to say they did not get off on the right foot would be a massive understatement. Presley is only 15 years of age when she first meets Nathaniel and unknown to her, he is currently working for her father whilst studying business at NYU. From their very first encounter they just don’t see eye to eye and as the years pass, their views on each other don’t get much better.\n\n “The thing about falling was that it didn’t happen the way everyone imagined it. Sometimes it happened slowly, over time, and other times you find yourself sitting there waiting for the other person to catch up.”\n\nFast forward a few years later and Presley is going through a divorce and the utter turmoil that comes hand in hand with the end of a marriage. She is all set to throw herself head first into the family business when things go from bad to worse for her; her father announces that none other than Nathaniel will be appointed as his business partner. This means Presley will now be working for Nathaniel, which is the absolute opposite of what she needs at that point in time. Through the many years of their somewhat tumultuous relationship, all the banter, all the loaded words that have been exchanged between the two, you just know that deep down the attraction between them was very apparent and they won’t be able to hide their true feelings forever.\n\n\n\n"}, {"Review": "2.5 StarsThis was, by far, my least favorite book written by Contreras. I was really excited when it was announced that she had a new book releasing and I love both the title and the book cover. I wanted to love both Nathaniel and Presley, as well, but I really never warmed up to either. It was mostly a so-so read from start to finish. And that's a shame because the story definitely had great potential to be something special, but it just didn't seem to meet the criteria. Too much slinging hate-filled remarks, petty arguing, stomping off like children -- just didn't cement the all-consuming love that either professed to hold for the other. And what the hell was that pre-wedding kiss before she walked down the aisle to marry another man. Hey, I didn't think Presley should marry Adam -- but then again, Nate was a big boy and old enough to get his you-know-what together before pulling a stupid move like that -- especially under the circumstances. Okay, I know I'm being harsh, but this one really disappointed.And I can't let it go unsaid that this book had so many editing problems -- and all were so easily fixable if someone had taken the time to give it a good proofread. So many missing words with sentences that didn't make sense. I found myself re-reading them to figure out \"what the heck?\" Also, Presley's mom was cast as a character who supposedly remarried someone she loved deeply who \"didn't even have a lot of money\" and then a chapter or two later, they got on his private jet and flew off to his mansion on an island. Sounds rich to me! If you know me, these kinds of problems bug me and I can't keep quiet.So, yes I was disappointed, a little put-out and didn't come away with a very high opinion of this one."}, {"Review": "Yay! My first FIVE STAR book this year and first TOP FAVE of 2019!I haven't read a Claire Contreras book in some time and when this one popped up on my kindle, I was both surprised and delighted to dive right in. It came in at the perfect time that I was looking for something sweet and romantic and utterly blissful, and that's how I felt the entire time I was reading it. I just love the enemies to lovers troupe *le sigh*Presley and Nathaniel knew each other when they were young, Presley being the daughter of brewery owner Winston. Winston took Nathaniel under his wing as Nathaniel had a very different upbringing than Presley. Nathaniel worked hard and tirelessly to build something for himself, to make himself better, to be worth something, never giving in to the attraction that he felt for Presley.And life goes on... and there is a marriage and you think it's a happily every after, only it isn't.And this is where the second chance romance comes in... because Presley and Nathaniel are in each other's path again for various business reasons, and the attraction that was always there is now at the forefront and WOW... I love romance, I love the words and actions, I love watching characters work hard for what they want and that despite the sadness, despite the heartache that they fight for what they want because you never know what will happen tomorrow. Life is short, there is no guarantee, but you have to live life to the fullest and to enjoy the moments. Don't be angry, don't waste time on the unimportant. Live for what you love.This book community lost someone very special around Christmastime, and Kandace would have loved this book. Because every day is a gift and the consequence of falling in love and doing what you love, and being with who you love—is nothing short of being the most precious thing you will ever have in your life. I simply loved this book... the emotions, the romance, the sweetness. It was just right, just perfect, and I have found a new favorite from this author who I admire and adore. <3"}, {"Review": "\n\n“You couldn’t possibly have been in love with me forever.”“I was. I was just waiting for you to catch up.”\n\nThey say there’s a fine line between love and hate. When it comes to Presley Rose and Nathaniel Bradley, this couldn’t ring any truer. These two bickered like there’s no tomorrow, disagreed on almost every single thing you can think of, and fought over the most ridiculous situations. But at the end of the day, that ball of pent up energy brewing between them turned into something else entirely. They could have screaming matches all they want, but it doesn’t change any of the feelings that started to grow and develop between them nor the connection that truly went beyond just what was going on in the bedroom.\n\n“I don’t think any kind of hook up with you could ever be meaningless, Nathaniel Bradley.”\n\nThe Consequence of Falling is a captivating enemies to lovers romance with an emotional twist that will make you see how much timing really is everything. How much wealth doesn’t mean anything when it comes to love. That material things are nothing compared to any memory or moment you share with someone. That you can even have the sweetest guy in the world, yet end up getting betrayed in the most painful way possible. How your prince could’ve always been in front of you all along, waiting on the sidelines and biding his time until life permits you both the happy ever after you deserve.\n\n“I’m telling you the truth dammit. I’ve wanted you since I was eighteen years old and had absolutely no business wanting a girl like you.”\n\nWhile this book wasn’t as strong or emotional as I wanted and expected from a Claire Contreras novel, I still enjoyed the heart, heat and the slightest touch of humor that Nathaniel and his Princess had to offer.Follow me on: Instagram • Facebook • Twitter"}, {"Review": "***AVAILABLE NOW***5 SECOND CHANCE CROWNSClaire Contreras has written one of my favorite novels of hers. It was filled with angst, the hate/love tension in an enemies to lovers romance, and the added bonus of a secondary plot of the heroine and her father. I absolutely fell in love with her words and this story.Nathaniel and Presley are magic. Claire takes us through the many years that these two have circled each other in similar social circles. Each moment builds up the animosity and hate between these two, but when they reunite as adults, all the walls come falling down. I enjoyed the banter, the obvious chemistry, and the slow fall into love between these two. Presley's dad also being an important man in Nathaniel's life added such an interesting dynamic to their relationship. I loved every moment of it.Presley kind of stole the show about for me. I loved how she has decided to strip the mask she has worn for years and grab her brand new life the way she wants. She was an inspiring character.This story has absolutely everything. It had the banter between sparring enemies, the chemistry that heats up the kindle with their resistance, and the sweet satisfaction when they give in. What also pushes books from 4 to 5 crowns, though, is when there is an added thematic layer and we see this the re-connection and love between Presley and her father.The Consequence of Falling is absolutely one of Claire Contreras's best works. I loved every single moment of falling for these two and watching them finally get that HEA after so many years apart.BETA read"}, {"Review": "If ever a couple need to be put in a bag and given a good shake, Presley Rose and Nathaniel Bradley are that couple. I wanted to bang their heads together. Tell them to wake up and smell the coffee and slap them around the face with a wet fish!A very angry and very wet (from the rain, get your mind out of the gutter) Presley meets Nathaniel when she is 15. She is a fire burning ball of rage at her parents which earns her the name of Princess from Nathaniel. They clash, big time. She hates him with a passion and we all know what that means!The story skips on through the years, teenage angst turns into adulthood and we meet our old friend Victor. Presley reconciles with dad Winston but a job at his brewery also means having to deal with Nathaniel. I loved how Claire developed the relationship between Presley and her dad. Dads are the knight in shining armour, the superhero and Prince Charming all rolled into one. Mine was the first man I wanted to marry and there will always be a dad shaped hole in my heart. Winston was a tough old cookie but his girl always had his heart.The Consequences of Falling had my heart in a vice like grip. I loved the anger and the passion between Presley and Nathaniel. The unfolding story of the whys and wherefores was fabulously constructed by Claire Contreras. I loved it.\"Life was too long to settle on things that make you unhappy and too short to let it pass you by.\"Ain't that the truth!"}, {"Review": "Dnf.Honestly it’s not bad but I’m bored.I seriously don’t know what’s going on with this book. Presley meets Nathaniel who is her father’s employee. They immediately judge each other at the very first meeting. Then they keep on meeting. First high school, then college, then her wedding day, then finally when she is divorcing her husband.Presley was weird but Nathaniel was not any good himself. When Presley wanted him to kiss him in college, he didn’t kissed her. But then he kisses her at her wedding day. They both keep on giving mixed signals to each other.It was irritating me. I just wanted them to shut up and kiss. The drama was irritating and boring me. I might continue this book someday but not today."}, {"Review": "I loved this enemies to lovers story and read it in one day. Nate and Presley have such a great relationship with witty banter and intense chemistry. Every time Nate opened his mouth, either calling her Princess or Sweetheart, or coming at her with a sarcastic comment I swooned. He was a jerk at times but one I loved. And when he showed his tender, sweet side I was a goner. This story is full of tension and angst but also has such romantic parts as well. Any fan of Claire’s will love this story and if you haven’t read her yet, this is a great place to start. You will love it!An arc was provided for an honest review."}, {"Review": " 3.5 StarsOverall Opinion: I appreciate the message that is in this book of enjoying your loved ones while you have them, and I also liked the overall premise of the book. I did struggle with the h from the start, because her bratty behavior was not something I appreciated. I understand that we are supposed to see a lot of growth with her character by the end, and I did, but I felt like she was borderline doormat status with her father and she was too bratty with the H through too much of the book. I also didn't fully understand the H's behavior. If he truly cared for the h all along (like he claims to have by the end) I don't understand why he had to be so harsh with her at times. I did, however, appreciate that she didn't go to that borderline doormat status with the H. The ending felt kinda meh. Overall, I liked this a little more than \"just okay\" 3 Stars but it won't be finding its home on my favorites shelf.Brief Summary of the Storyline:  This is Presley and Nathaniel's story. Presley meets Nathaniel when her father has him pick her up from school when she is 15. She had the worst day of her life and they bump heads instantly. Through the years, they continue to have brief but tense encounters. Presley is shocked to find out that her father has sold majority of his stock of the business she was supposed to take over to Nathaniel. They are forced to work together and the are both single for the first time in a while, so Nathaniel finally makes his move. There are some secrets revealed, some sexy times, and some sad moments ...and they get a HFN ending.POV: This alternated between Presley (mainly) and a little bit of Nathaniel's POV.Overall Pace of Story:  Good. I never skimmed and I thought it flowed well.Instalove: No, but they have some strong feelings from the many years in each other's presence. (view spoiler)[The H does claim at the end to have been in \"love at first sight\" with the h when he was 18 but he certainly didn't show it. (hide spoiler)]H rating: 3 stars. Nathaniel. He would do something to make me like him but then he would be a major jerk and make me not like him. The little bit of his POV that we got didn't help me understand him better, but actually made me more confused by his actions in the long run.h rating: 3 stars. Presley. I struggled with her bratty behavior from the start. I get that she was supposed to portrayed as such in order to show her personal growth at the end, but I didn't find it endearing. Sadness level: Low/moderate. I shed a few stray tears, but never would need any tissues.Push/Pull: Yes (view spoiler)[ They both push away (h in the present and H in the past) and they both also pursue the relationship (h in the past and H in the present).  (hide spoiler)]Heat level: Good. They have some good tension, chemistry, and scenes -- but not so much it takes away from the story. Descriptive sex: YesOW/OM drama: Yes (view spoiler)[ The h's marries and divorces OM, and this OM being around causes some jealousy for the H. The h also expresses some jealousy and distrust (because of her past relationship) with the H and his exes.  (hide spoiler)]Sex scene with OW or OM: NoCheating: Not with mcs (view spoiler)[The h's mom cheated on her dad (off page) and she was cheated on by her (eventually ex) husband (off page)  (hide spoiler)]Separation: Yes (view spoiler)[They are separated shortly (a month?) after they get together, but there was no mention or suggestion of other partners during this time.  (hide spoiler)]Possible Triggers: Yes (view spoiler)[ The h was married to OM and then divorced (on page), cheating (side characters - off page), and loss of a parent (h - on page) (hide spoiler)]Closure:  This had alright closure with what I would call a HFN ending (view spoiler)[they're engaged in the epilogue (hide spoiler)]. I would've appreciated more concrete commitment for them and a farther glimpse into their future though.Safety: This one should be Safe for most safety gang readers(view spoiler)[- Does Not have cheating by mcs- Does Not have a descriptive sex scene with OW/OM-  Does have both the h and H pushing away-  Does have a separation between the h and H-  Does Not have abuse- Does Not  have a HEA ending (see above) (hide spoiler)]"}, {"Review": "Find this review and others at Carlene Inspired.Presley Rose thought her life had a plan, at least she thought it did until her junior year of high school when her world changed completely. Presley and Nathaniel don't have the best first meeting, he think she's a spoiled brat, she thinks he's the child her father always wanted. Those first impressions stick with them as the years go by, with Nathaniel continuing to call her princess even as he becomes a partner in her father's business and technically her new boss. Presley is going through a divorce, trying to prove to her father she can be successful in his business, and deal with the unwelcome feelings she has overtime she's around Nathaniel. It's obvious they both like each other, but can they put the past they've shared to the side to allow love in?Oh my word, I forgot how well Claire Contreras can write a romance. I could not put down this enemies-to-lovers story, I loved the push and pull between Presley and Nathaniel. We see some of the interactions between the two as they attend college at the same school, as Nathaniel shadows Presley's father, and in time as Nathaniel takes on an ownership role in the company, but these glimpses only give us a bit of the chemistry that has been brewing between the two. These two are straight fire together, but it is obvious that the path to love will not be easy for them. Nathaniel has fought his way to the top and while he desires Presley, he still sees her as a spoiled little girl. Presley, having loved and lost, is only fighting to be a good daughter to her father again, but Nathaniel threatens her patience and her time with her dad. Their romance moves fast and is incredibly sexy, but it's only when things stop being easy that they really get to know one another truly. I loved the relationship the two had, their banter made the book just that much better, but more than anything I loved the relationship each character had with Presley's father. He very much so is the father that everyone thinks of as partly their own and it gave this story a personal touch for me. It made everything seem sincere and realistic, so much so that I was very invested in each character individually. And yes, I cried, a lot, I always do when the characters come to life for me and in The Consequence of Falling they certainly did.Sweet, romantic, funny, and emotional, The Consequence of Falling is a standalone by Claire Contreras that is sure to please all readers. The enemies-to-lovers storyline feels fresh in this book and the witty banter between Presley and Nathaniel gives a humorous touch to an otherwise emotionally charged story. I highly recommend this one to my fellow romance lovers.ARC provided."}, {"Review": "ARC received for an honest review\n\"The thing about falling was that it didn't happen the way everyone imagined it. Sometimes it happened slowly, over time, and other times you find yourself sitting there waiting for the other person to catch up.\"\nI adore a frenemies-to-lovers story, and Presley and Nathaniel's story is one that drew me in right from the start.They fight and bicker and snarl at each other from the very moment they meet, however underneath all that snark you can feel the spark of attraction between them.But don't expect things to get sexy any time soon. Oh no, our lovelies like to drag things out. It is kind of slow burn with years of underlying sexual tension. They have a love/hate relationship, which leads us to plenty of funny and frustrating times as a read.This was also quiet an emotional book, particularly the later parts. It came upon me unexpectedly, and I may have shed a tear or two along the way.I didn't want to put this book down once I started (stupid adulting getting in the way of my reading!). I really enjoyed it, and now am impatiently waiting to see what Ms Contreras brings us next.\n\n\n \n \n \n \n"}, {"Review": "4 STARS!The Consequence of Falling was an angsty enemies-to-lovers romance! Claire Contreras knows how to write emotional, butterflies in your stomach, stabbing in the heart stories!! Nathaniel Bradley was determined. Sexy with tats, he came from nothing and he built his business from the ground up. Thanks in part to his relationship with Presley's father, Winston he becomes a very successful man.Presley Rose was one of those heroines you hate and love. In the beginning she was spoiled, entitled, and naive. As the years past she endures hardships and carves her own path and begins working for her father's company.Nathaniel and Presley always bickered since they were teens. With time that push and pull between them becomes strong. Both of these characters did a lot of growing up and healing in order to overcome their obstacles and finally be together.This story was sweet, sexy, and at times rather frustrating. But the beauty of Claire is she balances it all out perfectly!*AN ARC WAS KINDLY PROVIDED IN EXCHANGE FOR AN HONEST REVIEW.*"}], "Genre": "Romance", "ID": "42351725", "Desc": ""}