{"Name": "Dear Heartbreak: YA Authors and Teens on the Dark Side of Love", "Image": "https://images.gr-assets.com/books/1518730153l/36952607.jpg", "Reviews": [{"Review": "This idea would make a great, like, project. You know. A pay it forward/start a movement/promote kindness type of deal. As a book? Eh. Not so much.The conceit of this thing is that Heather Demetrios had a bunch of teens write a letter to “heartbreak” - like, as a concept - and then famous YA authors wrote them letters back. Except not really letters back. They just wrote some response paragraphs and then gave them to ol’ Heather and then Heather compiled them alongside the teens’ very upsetting letters and then boom. You’ve got this book.It is very, very strange.When I first heard about this, I imagined it was going to be like that villain book that came out a while ago. BookTubers helped with it and everyone was furious and hated it. Uhh. Quick research break...Okay, Because You Love to Hate Me! (Dumb title, really. Everyone should have known they’d hate it without even picking it up. Like me!)Anyway, I thought it’d be like that. You know, the teens write all their unbelievably wrenching stuff and the authors write a story about it and the story has a happy or at least hopeful ending and it’s all happy-happy-joy-joy.But no.The authors just write a nonfiction letter back which sometimes feels very personal, and sometimes not even inspiring? Sometimes kinda presumptuous? There were a couple where I was like “Uh, Nina LaCour, I don’t know how helpful the fact that you were hot as hell in high school is going to be to this person who is literally in pain over their total lack of romantic history.”Not to call out Nina or anything.Anyway again. I had high hopes for this book but it was ultimately too weird. I think if these authors wanted to strike up correspondence with teenagers who are suffering, that would be just rad. As is, this felt like opening someone else’s mailbox in, like, 1947 when a mailbox would have contained something a lil more personal than Bed Bath & Beyond coupons.Also, the introduction contains this little gem: “To love people in the volatile times we live in—romantically or otherwise—is an act of courage and defiance. We see this [...] in the boy who doesn’t stop asking out the girl he’s crushing on, even though she rejects him every damn time.” Uh, doesn’t read as courageous to me. More like tormenting a girl due to a basic misunderstanding of consent! Very romantic and cute.(Note: This is an ARC, so quotes may change.)Bottom line: Non, merci! But again, if these authors are feeling legitimately charitable, rather than just charitable when they know their charitable-ness will be published, I think it’d be nice for them to write to some teens going through hard times.But I’d believe that when I see it.Thanks to Macmillan for the ARC! This book is out December 18. (Hell yeah I did this in time.)"}, {"Review": "DNF @ pg 87This is probably the most disappointing, upsetting DNF review I've written in all of 2018 (with the year almost over, at that), but I can't continue this.When I requested this ARC, it was pitched to me as YA authors writing \nfictional stories\n in response to teens' letters about heartbreak—not nonfiction self-help columns, which is what I got. And there's nothing inherently wrong with that, if that's what you're looking for, but I can't stand self-help columns, so that was very jarring for me. That said, I enjoy a lot of the authors involves, so I went into it with an open mind and open heart.If my only issue with these pieces was that it wasn't what it had been marketed to me as, I would not be giving this collection a rating, but it is a mess. As much as I love Heather Demetrios, I am literally pained over the fact that her name is attached to this, because some of the authors replying to these letters are downright irresponsible.Of the pieces I read, I only enjoyed Becky Albertalli's (ironic, since I don't enjoy her fiction much), and the rest were \"meh\" at best and problematic as hell at worst.→ Nina LaCour's was shockingly tone-deaf; after receiving a letter where the writer complained of feeling unwanted and suffering from FOMO, Nina went on a tangent about what a popular, beautiful, cool teenager she had been, which felt like page upon page of blatant humble-bragging with little to no advice.→ Adi Alsaid's was okay but gave advice that felt super sketchy to be giving teens (such as recommending a teen find strangers online in their city to meet up with—I could understand suggesting this to grown adults, but the protective mother in me cringes at the thought of a 15-year-old reading this and running off to Craigslist to find some creepy pervert)→ Libby Bray's had a lot of good advice and was humorous, but I genuinely hope the final edits clean up some of the immensely gendered language. I'm 100% sure it's just second nature and Libby meant no harm, but if the email writer is anonymous, it seems super unfair to me to assume that you're talking to a cishet girl just based on their mention of seeking a boyfriend? :(→ Kim Liggett's advice was the final straw for me. This letter was from someone seeking advice on how to heal from sexual assault and mentioning how they haven't moved past the rawness of it, yet Kim goes on to describe their own rape as a teen in detail that... I don't know how to explain this, because it wasn't over the top explicit, but the way it was described was immensely triggering for me as a survivor. I'm not saying you can't give advice on healing from assault while mentioning your own, because solidarity and empathy can go a long way, but I think trigger warnings and tact would have gone even further.So, that's it—this was one of my most anticipated releases of the year due to wrong marketing, and I'm a little broken up over how disappointed I am in this collection. I really wanted to keep going and see if it got better, but the lack of care going into some of these stories tells me that, even if I were to continue reading it, I don't foresee my rating improving from its current state.Thank you so much to Henry Holt & Co for providing me with this ARC in exchange for an honest review!"}, {"Review": "\"Loving yourself is damn hard because it means accepting all the parts of you that you can't stand. it means knowing you're actually okay even though society wants you to believe that you aren't. It's downright revolutionary.\"At the very core of this collection of letters from teens to Heartbreak answered by YA authors is a common thread that the power to overcome, to love, is within us already. There is a uniting message that we are more powerful and resilient than we believe we are. Each author, in their own way, shares stories about their own heartbreak and reminders that you can't look outside of yourself for self-esteem, love, acceptance, or wholeness. \"Here's to forgiveness and choosing yourself and saying yes when it scares the shit out of you--and screaming NO at the top of your lungs when you need to.\"There is so much empowerment in this book, and not just for girls, and not just from women's POV, either. This is a love letter to youth, to encourage them to keep open hearts and to be gentle with themselves but fierce in their expectations. This is a battle cry for love, love for yourself, and love for others. This collection is a way to ensure that nobody feels unseen, unheard, unloved, or misunderstood so long as this book is in their hands. \"I'm proud of my honest with myself. This is how I put my heart on the line. This is the way I know how to be brave.\"There was ONE story in this that I thought was going to have ace rep, and it didn't. There also wasn't letters about confused sexuality and how to handle that. There was a ton about love lost, unrequited love, not finding love when everyone else has it, crushing on friend's significant others, and abuse within relationships. There are letters from actual teens, heartbroken and screaming into the void for help and I LOVE that these YA authors took their time, talent, and energy to thoughtfully, respectfully, and fully answer their heartbreak. \"It's impossible to do everything right. Be kind to yourself-stop trying. Even at our best, we are complicated beings.\"However, as an adult reading this (and YES I know I'm not the target audience, I was able to see through the letters and the answers and realize that it all had a thread of \"love yourself first\", \"be a whole person before you get into relationships\" and that got more than a bit repetitive throughout the book. \"In my fear, I find courage. In the depth of Alone, when I stretch out my hand, I always find something to hold onto.\"But teens need to hear that. They need to hear the same thing a dozen times before they believe it, or at least start to. And it certainly doesn't hurt to hear it from so many respected authors in their own varying voices and so I understand and celebrate the fact that this book exists in the world for those who ARE the target audience. \"You're arms that used to hold me together when my world was falling apart. Now I'm left all alone with my broken pieces. Desperately trying to replace your arms with my own.\"Because there is NOTHING worse than feeling alone, feeling unloveable, hurting, hell-shattering, and not having anyone to talk to. You feel like you're the only one in the entire world with that feeling and no parent, friend (because they're prettier and more loveable than you) or significant other will ever understand. And not just because you don't have words to communicate how you feel but because you are a uniquely pained individual. And they are-unique...but not in their pain. We've all been rejected, felt the sting of unrequited love, or an unhealthy relationship, or wanting what you can't/shouldn't have. Life is hard when you feel like you can't find love--even as a late 30's woman. \"You were born whole. Stop believing the myth that we are born to be coupled.\"But fuck it, because I love myself and I LOVE that these authors encouraged the teens who wrote them to do the same. Sure, you can still want for romantic love but there is a joy that can be found only in loving yourself, the time you spend alone, your unique talents and mind. And I do, love myself. If this collection helps even one teen do that in an earlier timeline than I did...then hell yes this book is phenomenal. \"Everyone is the unlikeable narrator of their own story. We all want things we shouldn't.\"The one thing we can all want, should all want, is love. It connects us to one another and this book successfully makes you feel connected to a larger collective. The collective of heartbreak, love, loss, and longing. We've all been there dear hearts of the youth, and you are not alone. "}, {"Review": "Want to see more bookish things from me? Check out my Youtube channel: https://www.youtube.com/channel/UCfer...*I received a copy of this book in exchange for my honest review* 3.5/5 Stars This is an anthology of letters real teens wrote to YA authors about heartbreak. The authors chose which letters spoke to them and wrote back to the teen with advice. I really enjoyed this for the raw vulnerability it brought to the table. Having some of my favourite authors share their experiences with the world and heartbreak was eye opening and so relateable. I think there is at least one letter inside this collection that will speak to everyone. I think its going to help so many teenagers AND adults come to terms with some of their own experiences."}, {"Review": "You can find the full review and all the fancy and/or randomness that accompanies it at It Starts at Midnight Ironically, this book is so completely full of love. But not the kind you're thinking of. The love in this book is apparent in every single letter- it's the love the authors have for the young people they write for. It's the love they've found for themselves. And the love they hope to make their readers feel.It's nice to find people who can understand what you're going through. It's cathartic to share trials and tribulations with one another. It's that sense of camaraderie that I enjoyed about this book the most. I related to so many of the responses, and yes, the questions. I imagine that many, many others will as well. Obviously the importance of that is huge.The thing that left it falling a bit short for me is that it kind of felt a bit repetitive after awhile. And while I, as an adult, appreciate the message the authors are trying to convey (especially the \"love and care for yourself\" sort), I'm not sure a teen would be game for 300+ pages of it. The thing about heartbreak and heartache is that no amount of logic and self-talk is really going to make it better. It's messy, illogical, and something we may just have to feel.\nBottom Line:\n The plus here is, knowing these authors have come out on the other side of their teen heartbreaks can be helpful- especially as they're often role models. The downside is, it's a lot of pages of personal stories that may not fully resonate with a young person wading through their own pool of sadness and confusion. Hell, it's a lot of pages for a 36 year-old wading through her pool, so. 🤷‍♀️"}, {"Review": "First of all - don't be fooled, it's NOT a short story collection! It's more of an essays anthology, with letters from teens struggling with different shades of love, heartbreaks, loneliness and feeling of being 'not worthy' and responses from YA authors, sharing their personal stories. Concept is really interesting, but execution is weak... Or maybe it's just not a book material? I don't know, but as much as I liked some replies (mostly for style of writing! And comparision to truffles!), I think that young adults and teenagers struggling with love need more than hearing 'I was exactly like you!' or - worst case scenario - 'We have nothing in common, but I'm gonna share my story anyway'.Not really what I expected this book to be."}, {"Review": "Truly disappointed in something that I thought was going to be different in light of the fact that I adored the darkness and beauty of Demetrios' own book. But this one was really all about the YA authors even though it was set up to be teens writing in and then YA authors responding-- really there was no teen voice if that was the attempt and really ALL about the YA authors themselves with an interspersed bit of positivity and encouragement. And taken all at once, even though it was super short, just became too overwhelming and not respected enough as a topic because I see what Demetrios was trying to do-- it just doesn't work in this particular interest. Either have YA authors write about heartbreak or don't, but to try to authentically include teens' actual letters and a YA author's response was unemotional. And I felt used on behalf of the teens. It wasn't even very Dear Abby to be a little (throwback here-- Chicken Soup). "}, {"Review": "2.5 stars. I’m 100% too old and cynical for this book, but I’m not the target demographic! But still, I felt like this collection was very jumbled, and the “advice” was often so heavy handed in the “love yourself before you can expect anyone to love you ALSO you don’t need a partner to find happiness ALSO you’ll find love when it’s meant to be ALSO ALSO ALSO” variety as to be patronizing. As a former perpetually heartbroken teen, reading some of the author responses would have caused Teen Jane to roll her eyes, sigh heavily, and be pissed that some adult was being so condescending. I feel like this was too surface level and too many authors ended up making their responses more about them than the teen.Also, I originally thought this would be fiction. Nope. It’s basically a mix between Dear Abby and Chicken Soup for the Teenage Soul. While the idea is good, I almost think this would have been better as a podcast, because something gets lost in making this a book.Final note: this is titled and marketed as being about “the dark side of love” and that is very misleading. A few entires deal with heavier topics, but the vast majority are about standard teen romance issues - not sure why this was done."}, {"Review": "This novel really caught my eye, the cover is gorgeous and I was intrigued by the concept however, after reading the book I was disappointed. This novel just didn't go where I was wanting it to, the advice wasn't great and I agree with some of the other reviews. Some of the authors seemed, at times, condescending and didnt give any real advice or any connection to the letter at all, just a lot of generic love yourself before others can love you answers. This book had potential and was a great idea but it just wasn't done well."}, {"Review": "Graded By: Mandy W.Cover Story: HeartfeltThe Wallflower: \"We Have to Be Who We Are\" by Libba BrayThe Guarded: \"Knock Down These Walls\" by Ibi ZoboiThe Mythbusters: \"Own Your Heart\" by Jasmine Warga; \"Life in the Friend Zone\" by Varian JohnsonThe Survivors: \"We're Not Alone\" by Kim Liggett; \"Down the Rabbit Hole and Out the Other Side\" by Cristina Moracho; \"Love Is All, Love Is You\" by Heather Demetrios and Zach FehstBonus Factors: Love Yourself, IntrospectionBreak Glass In Case Of: A Heart That Needs MendingRead the full book report here."}, {"Review": "Huge thank you to Raincoast for this ARC!I always find anthologies difficult to rate, mainly because the stories in them often tend to be a mixed bag. What I loved about Dear Heartbreak, is that it isn't typical of what an anthology would be. Real teens submitted letters to \"Heartbreak\" and popular YA authors took the time to respond to plights. It's an interesting take on Dear Abby, that's for sure.What I loved about this book was more the letters themselves rather than the responses. I found myself tearing up at some of the issues that were shared. There's discussion of suicide, abusive relationships, friendship gone topsy-turvy, and just feelings of isolation and how corrupting it is. What I appreciated in the responses to the letters is the level of respect and tenderness that many of the authors provided. There was a sense of understanding and empathy, something that I find many adults struggle to provide in a way that is helpful and self-reflective. These letters were exactly that, offering examples and stories, as well as resources they used as well. I did find some letter meandered a bit, but overall I think the responses were very empathic.I am really happy a book like this exists in the world for teens to read. It's amazing to see a group of authors respond in a way that is so kind. It's a rally of kindness, of hope, of light and of need. Teens need to be able to see themselves and feel heard, and I think Dear Heartbreak does a great job in opening a lot of discussions regarding teen mental health."}, {"Review": "3.75 starsAnthology collections that are short stories or essays can be difficult to review at times, however reviewing an anthology of letters from real teens that are answered by authors in story form with a sprinkling of advice is something I haven’t done until now. As the title suggests, Dear Heartbreak has teens write in to authours about their heartbreaks and about the not so pleasant side of love which is unfortunately something we do not often see in non-fiction that is geared towards teenagers. I love this idea as it was a unique twist on the typical advice columns.Read the rest of the review here: https://wp.me/p36jwx-1Bo"}, {"Review": "Dear Heartbreak is a collection of letters from anonymous teens to Heartbreak and responses from some of today’s most popular YA authors. When I first started reading this novel, I was really enjoying it, but by the 6th response it seemed redundant and almost like the authors were repeating the same thing time after time. The 6th response especially made me uncomfortable due to the graphic account of rape that just doesn’t seem like something you would want to reveal to a teen that is trying to recover from sexual assault. Another major annoyance for me was the overuse of endearments like, “my sweet”, “love”, and “my darling”. It comes off as placating and I’ve yet to meet a teenager that wants to be talked down to like that. I will say I truly enjoyed a lot of the personal anecdotes, but there were two that stood out to me the best: Becky Albertalli and Sandhya Menon. I connected deeply with Becky’s to the point that I thought that if the rest of the book made me feel that deeply, I would be rating it a five star. As for Sandhya’s, it just felt tailored to that teen and she acknowledged facets of that teen that weren’t revealed overtly. Overall I think I’m going to settle at 3 stars but this is still something that I would like to put in my classroom library because there is a lot of good advice encapsulated in this book; I just think it could have been shorter in order to eliminate some of the redundancy. I think adults forget what it is like to be a teenager and now teens are more stressed than ever, yet we trivialize what teens go through and call them dramatic, myself included. We need to stop downplaying their very real emotions and try connecting with them on a deeper level, which is something I enjoy about this book. "}, {"Review": "There are messages here that I like and think are important, but the book is pretty repetitive. For all that one of those repeated messages is \"love yourself\" (with variations of \"you don't need someone else to complete you\" and similar) and all the talk of friendship in addition to romantic love, it's super not aro-friendly. (Not that that's a surprise, but still. Sigh.)I didn't always understand the authors' choices of letters or how they chose to respond; sometimes it felt like they were reading things that weren't there into the letters, and so it just comes off as an odd set of choices all around."}, {"Review": "the correct way to enjoy this book:a) Bundled up in your fuzziest blanket, listening to sad music and quietly cryingb) Splayed out on the floor, listening to \"Misery Business\" and feeling the anger rise in youc) Hanging on to the words on the page, reading them, seeing them unfold in to a story not unlike your ownd) all of the above ☑️I mean, usually I have trouble rating multiple-essay books, but I genuinely enjoyed all the advice and stories told in this book!"}, {"Review": "I'd give this one a 3.5. Despite some of the naysayers who didn't like this book, I did. Its concept is original--real teens writing letters to Heartbreak--and then various authors, many of them well known and well established, choosing a letter to which they then responded. The teens' letters are heart-wrenching and sometimes ever so innocent and hopeful while some of them seem ready to give up, and the authorial responses are honest, drawn from the writers' own life experiences, offering hope, encouraging resilience, and sharing their own struggles and heartbreaks. Throughout the collection, there is often one particular note that is sounded, and that is the reminder, platitude though it might be, that in order to find love or be loved, one must first accept and love oneself. Now I'm as romantic as the next person, but it was encouraging to note that many writers did not see romantic love as somehow completing someone or the necessity in coupling. Sometimes, being alone is perfectly fine. YAY! It's about time someone shared this notion with a teen audience. While I liked some of the 18 responses more than others, I cannot say that I regretted reading any of them. All of the responses imparted some wisdom, and some of them even made me laugh at their cynicism as well as wince at my own misguided experiences in looking for love in all the wrong places. Maybe it's just me, but I would have appreciated even more diversity in the authors and their romantic experiencdes. "}, {"Review": "To be released on Tuesday, Dear Heartbreak is a collection of letters written by teens concerning their heartbreak struggles and the corresponding responses from YA authors. The authors provide encouragement, life tips and personal anecdotes to address the teens' issues. Topics dealt with include loneliness, self confidence, disability, assault, depression, termination of a relationship, lack of a relationship and self love, among others. Clearly some letters and responses will be more relatable to readers experiencing those specific issue. As each letter response comes from a different YA author, this book could also provide solid future reading suggestions based on the discovery of these new (to the reader) authors. I received an advance reader's edition of this book as a Goodreads giveaway in exchange for an honest review. Thanks to the author/publisher for participating in the giveaway."}], "Genre": "Romance", "ID": "36952607", "Desc": ""}