{"Name": "Misadventures with a Country Boy", "Image": "https://images.gr-assets.com/books/1527013414l/38198500.jpg", "Reviews": [{"Review": "Oh wow, Misadventures with a Country Boy was a little beauty. I had so much fun reading this.ARC received in exchange for an honest reviewWhen I see a new misadventure book I get super happy because this whole series of books are amazing. I just had to read it. Cole and Brooke were fun characters to get to know. The country boy and the music star. The sexy man and the beautiful woman both of them brought together by accident ends with an incredible story between the two of them. A story that will make you smile, make you laugh but also, it makes your heart ache. Oh and let me just say, the sex is incredible it’s hot and makes you hot and gahhh. Just wow. This is my first read by Elizabeth Hayley and I absolutely adored it. I hope to read more of this authors books in the future. "}, {"Review": "The misadventures books might be completely stand-alone, but this one had a lovely treat for us who have read Misadventures by Elizabeth Hayley! We got an epilogue to Blake and Gavin's story!!! Isn't that great? It was a good end to a book which I enjoyed. I wouldn't have minded an epilogue for Brooke and Cole's story. I would like to see what these two were up to a few months or years later. I have to admit that this wasn't my favorite story in the series, but it was good and it had some strong moments that made it one of the best. I think that Brooke gets the most focus on the story, which I didn't mind, but I would have liked to see more of Cole and his life before he met her. Both of them are in a place that's in the middle of two major moments in their lives. Brooke is trying to get away from she had before and find her place once again and Cole is just going on a road trip that will change his life unbeknownst to him. I enjoyed seeing them go on their journey and finding out what was planned for them. Both of them were likable and I loved them equally. I am sure you will enjoy the book as much as I did and dare I hope, even more. "}, {"Review": "Misadventures with a Country Boy by Elizabeth Hayley is book 19 in the Misadventures series. This is the story of Cole Timmons and Brooke Devereaux. This book is a standalone book. Cole is a former Army man who knows how to avoid things he doesn't want to face. While on a trip to visit his friend he stops for gas but picks up Brooke. Brooke is the opposite of Cole who is a country boy besides ex-military. Brooke comes from a family who is very well off and knows it. So she is trying to get away from her family for a break but is left stranded at a gas station when Cole offers her a ride. This leads to a road trip that they find more than just their destination....they find each other."}, {"Review": "[I received a digital arc for an honest review]Misadventures with a Cowboy by Elizabeth Haley is an enjoyable addition to The Misadventures' series of standalone novels.Brooke is running away from the life her parents want for her. A life in the spotlight where every one will know her name. It's easier to jump on a bus and remove herself from the situation than tell her parents no. Stuck at a bus stop she finds herself throwing caution to the wind and accepting a ride from Cole. Ex soldier Cole, is the opposite of Brooke, he grew up feelings worthless and not mattering to no one and hopes someday he will mean something to someone. He is tired of feeling so alone and unimportant.Brooke and Cole are enjoying their own little bubble of fun away from responsibilities and the lives they grew up with. Stopping at tourists attractions and taking in the sights along the way they slowly get to know each other. The make each other feel calm, safe and happy. It's not long before they cave to their carnal desires and then they can't seem to get their fill.Sooner rather than later, the life Brooke is running from catches up to her. Cole has to figure out his place in life and a way to accept his worth. Brooke has to either stand up for herself or sacrifice her happiness.Overall, Misadventures with a Cowboy by Elizabeth Haley was a quick fun read. Filled with steamy sex scenes, adventures, banter and honesty. This is my first Elizabeth Haley but I would be interested in reading more of her books.\"Cole’s laugh was deep with a hint of a rasp behind it. It was a genuine sound that made him, and the world, seem a little less frightening.\"\"He kissed her deeply again. The connection was raw and consuming, and Brooke couldn’t get enough of it.\" "}, {"Review": "Alright, alright, alrightttttt. Cole and Brooke. Possibly my new favorite Misadventures couple. We’ve got two people running from what’s wrong in their lives and coming together to find what they were missing. We’ve got mystery, adventure, drama, and just an overall captivating mix.Cole, our steamy main man, is fresh out of the Army, on a journey to visit his friend in Oregon, when he runs into Brooke at a gas station. Brooke, well, we don’t know much about Brooke, without spoiling the story that is. But, we do know she’s stranded without a car at the gas station where Cole stops for gas and coffee. Good guy Cole offers Brooke a ride, and so we embark on our journey.Elizabeth Hayley is actually two women, Elizabeth and Hayley. They have such a unique writing style, as they write together, but the story flows seamlessly. I felt a connection to Brooke and Cole that I haven’t felt with the characters I’ve read about lately. Elizabeth Hayley made Brooke and Cole relatable to, in my opinion, anyone who has never felt whole or fulfilled, like they were missing something or just have never felt good enough. I’m sad to let Brooke and Cole go, but I cannot wait to continue on my Misadventures journey and get my hands on Elizabeth Hayley’s next installment in the series."}, {"Review": "Name’s Cole, but I am fond of nicknames.Cole is out of the army and needs to change in his life, what he didn’t expect was to run into a woman at a gas station in the middle of Kansas while on his way from Georgia to Oregon. Brooke is struggling in life and needed to get away from her overbearing family, she is stuck in Kansas, can’t get a car, when a handsome stranger comes to her rescue.“You think I’m charming?” “I also said I think you might be the next Ted Bundy.” “I might also be Prince Charming.”As the continued on their road trip, Cole wanted to know more about the mysterious Brooke. There was something about this girl that had him wanting more. The more time they spend on the road together, they more they start to let each other in. This was not only a road trip to a physical location but a road trip to a new life. Sit back and enjoy the crazy, hilarious, and steamy ride that Elizabeth Hayley take you on with Cole and Brooke. "}, {"Review": "Five southern stars! This is a beautiful read. It is an illusion of love at first sight!Oh.My.Sweetness! This is the first time I read a book written by Elizabeth Hayley and I’m totally and irrevocably in love with her flawless writing and strong characters. Wow! Misadventures with a Country Boy left me breathless and aching for more. I felt like I was falling and losing my heart over this wonderful masterpiece. This book is more than sweet words. It is NOT like anything I have read before. It has all the sweet magic and charm of a southern romance. Misadventures with a Country Boy is a story that screams for a 5 stars rating. I love everything about it: adorable, lovable characters and a unique storyline that had me glued to the pages of this book until I devoured the last chapter. This charming romance read was a train wreck I couldn't look away from! It consumed me in the best way possible. Elizabeth Hayley delivered a strong and addictive book; a perfect addition to the Misadventures Series! Reading this book was a spectacular way to spend my time. Each chapter made me feel all the emotions. I smiled. I cried. I wanted to kill and at some point the suspense and drama got the best of me. It fascinated me how easily I loved this book. I was caught in the story. It made me happy and sad at the same time. Cole and Brooke took a piece of my heart. It all started with a southern Prince Charming saving the Princess...Who has ever thought that a stranger could change your world and turn it upside and down? Because we are taught to be aware of strangers and not to trust them easily but what happens when the attraction is stronger than anything? When the pull is sparkling addiction there is nothing you can do... only to fall into de temptation... That is exactly what Brooke and Cole will experience together. They will discover themselves and in the same way they will change each other life in a wonderful and tearing way. They came from different worlds. They are trying to find who they are. However they belong together. The ex-military southern Charmer and the Princess are such a dangerous and beautiful combination. In my opinion, Cole is literally a Prince Charming. There is no doubt he is the ultimate book boyfriend. He is sexy and hot as sin. There is something mysterious and intriguing about him that make you want to discover all his secrets. His southern manners, worn-in Levis and sweet dimples are dangerously charming. I found it really hard not to fall in love with him. On the other side we have Brooke, the strong heroine who is lost and running from a life she doesn’t want. She wants a simple life surrounded by true people. But how can she take of herself when she has never done it? Finding Cole and accepting his help save her. There will be adventures and an attraction that she will resist until the desire consumes her. Resisting Cole’s southern-charm will be an epic task! The story of Cole and Brooke is a soft and deep romance where both characters finally took control of their life. They will find a real and sweet love which they deserve after everything. I have the feeling that Cole and Brooke story deserve more chapters.Reasons why I love this book: It is addictive. It is consuming. It is perfect. It is original. It is everything. "}, {"Review": "Misadventures with a Country Boy begins with Cole Timmons on a cross-country trip to Oregon to see his best friend, Jimmy. He's trying to put as much distance between himself and his hometown in Georgia. He thought after he got out of the Army that things would be different, but they weren't. He makes a stop at a gas station along the way and encounters a young woman seemingly in need of help, or, at least a ride. Brooke Devereaux is in a hurry to get to.......well, she doesn't quite know where. All she knows is that she wants to get as far away from Pennsylvania as she can. When she encounters a stranger at a gas station in Kansas who offers to help, she is immediately wary, but he doesn't seem to recognizer her, which is a plus. Add to that he's headed west, and the fact that she needs a ride, and she reluctantly accepts his offer. What begins as a guarded friendship eventually turns into a tentative friendship. Cole seems to be a good guy, but Brooke knows that can just be for show. He also seems to have some secrets himself, and that suits Brooke just fine. However, when secrets are revealed and withheld facts come to light, will the two of them do what they do best and run? Or with they have the courage to stand up to the road blocks in their lives? Misadventures with a Country Boy is the second book I've read in the Misadventures series. It is nicely written and the characters are engaging. Yes, there was instant attraction, but the story was about more than that. Brooke was a bit naïve, but through no fault of her own. Her parents' hold on her will leave you seething and will explain why she ran. Cole's backstory? Absolutely heartbreaking. But, his meeting when his best friend, Jimmy, will leave you in a puddle of tears. Once he realizes that he's been running from pretty much everything and everyone his whole life, he knows just what he has to do.......thanks to Jimmy. This is the first I've read by Elizabeth Hayley, but has made me interested in seeing what else she has. If you're a contemporary romance fan, you'll enjoy this one. Well done, Elizabeth Hayley!"}, {"Review": "This book was such a fun read. It was my second novel from Elizabeth Hayley and I enjoyed every single second. I will be on the look out for more from these two fab romance authors for sure. \n\"You belong in the world while all I want to do is exist on the fringe of it.\"\n \"Misadventures with a Country Boy\" follows the story of Cole and Brooke, two people from very different worlds that were brought together through fate. I loved the characters in this book. As soon as I met Brooke, I was intrigued by her and that intrigue just kept on growing the more that I read. I wondered what Brooke's history was and what were the reasons behind her actions that lead to her meeting Cole. As I began to discover Brooke's back story, I understood and could empathise with her struggles. I found myself rooting for Brooke to have the future that she wanted. Especially if it was with sexy country boy, Cole. Cole truly was Brooke's hero, finding her when she needed someone the most. From that moment on, Cole took care of Brooke, giving her the support that she deserved. He was a sexy alpha, protecting her like a knight in shining armour. He was also extremely sexy and gave the story an extra blast of heat. Together, the pair sizzled. \n\"I can't let anyone else have you. You're mine. So if I don't deserve you, I'll just have to become someone who does.\"\nI adored the progress of Brooke and Cole's relationship. I loved every moment of their blossoming love. It made my heart happy to see how perfect the couple were for one another. I'm not saying it was all blissfully happy. It wasn't all hearts and flowers for Brooke and Cole, however everything turned out in the way that I wanted and I had a huge smile on my face as I reached the last page. I was more than happy with how cute Cole and Brooke's story turned out. I was also given a lovely surprise as there was a gorgeous bonus chapter from \"Misadventures with My Roommate.\" I was so excited to read more from Blake and Gavin. \n\"Did you think I was going to let you out of my sight? Silly boy. You're stuck with me now.\"\"That's everything I could want.\"\n"}, {"Review": "I received a copy of this book from the publisher/author to review for Stephanie's Book Reports.Brooke Deveraux has a lot she wants to escape from: a career she never asked for, a future she doesn't want, and parents who've only ever see her as a business opportunity. But in her desire to experience live, she quickly realizes she's lacking in one very important skill-how to survive on her own. Former soldier Cole Timmons is an expert at running away. Whether it's from his rural hometown, alcoholic father, or painful memories. Cole doesn't hesitate to leave...Until he encounters an out-of-place woman at a gas station in the middle of nowhere. The wealthy \"princess\" couldn't be more different from the country loner, and the pair get off to a rocky and misadventurous start. But sometimes exteriors are armors meant to deceive. Sometimes what's beneath reveals more than anyone ever realized. Sometimes in order to stop running away, a person simply needs to find something to run toward. Welcome to the story of Cole Timmons and Brooke Deveraux. Cole is fresh out of the army and is serious need of a change in live. So on his way to Oregon from Georgia he runs into a woman at a gas station in the middle of Kansas. Brooke is struggling and it is much needed that she get away from her family. However she gets stuck in Kansas and can not get a car and totally isn't expecting the sexy stranger who comes to her rescue. This is the beginning of a road trip neither of you or us as readers will every forget. I loved every single second of this book!! This is a sexy hilarious ride and you get to figure out if Cole is the next Prince Charming or Ted Bundy. Don't miss this book. Don't miss any of these Misadventure books. I have loved everyone of them I have read. "}, {"Review": "Misadventures With a Country Boy is about self discovery , love and finding the joys of life in little things.Ex-Army and Southern country boy Cole encounters Brooke in a pump store on his way to Oregon. He has own issues and burdens weighing heavy on his mind. But he can't leave Brooke behind who is running from her parents and celebrity lifestyle as pop princess that she doesn't want at all. They both hide their identity or personal details because they don't trust each other. A beautiful journey begins when they decide to take the journey to Oregon together in Cole's car. We see some breathtaking nature tour through the Rocky Mountains, the forests and the small towns.With each passing days they fall in love with each other. They have fun. They have freedom from their worries. They have passion and true emotions. Until the reality of Brooke's life comes crashing and they leave in a bitter note. What will happen next? Would Cole find his way back to Brooke after realizing his mistake a little too late? I can just say the ending was epic and so swoon worthy!I loved this over all truly adventurous feel of the story! The author has a great eye for details and I had such a great time travelling with the amazing couple. Cole is a great guy full of sexy arrogance, sense of humor, protectiveness and good ol' southern charms. Brooke's character was interesting too. She may have moments of insecurity and weakness but she finally refused to let other people dictate her dreams. The story had some funny adorable moments, some sexy scorching hot moments and some deeply emotional moments. The story has something for every reader. You get sweet and sassy.You get erotic and romantic. You get an adventure of life and love.(ARC from author and Bare Naked Words) "}, {"Review": "Well the delightful Elizabeth Hayley penned another fabulous Misadventures story that I absolutely couldn't get enough of once again, and even gave a bonus to her previous one to boot. See, Cole Timmons, who is out of the military now, is coasting through life with a bucketful of regrets, so he's in his truck for a road trip, when he comes across a beautiful woman with a lot of pain in her eyes, who needs some help. So he somehow talks her into taking a ride from him. Brooke Devereaux is on the run from her life out of the spotlight trying to experience life on her own, but doesn't count on the difficulty of lying low. So when the handsome stranger offers a ride, she's not sure, but finally takes a chance on him, and this takes them both on an emotional journey, and maybe just maybe, both will be able find some freedom from their demons. I loved this story, as Brooke & Cole had great interactions that kept me laughing quite a bit. It didn't hurt in the slightest that they had some chemistry sparking up either to be honest. But I think what I loved the most, was how they found what they needed in each others company, especially Cole, who was suffering greatly from his past demons. They were so heavy that I felt his pain, and it had my eyes threatening to leak when those demons were revealed. Did these two make some stubborn decisions in this journey? Well, of course they did, otherwise, it wouldn't have had any realistic feel if they didn't, nor would it have allowed my f-bombs to drop either. So yeah, this was another great read in this amazing series. HIGHLY HIGHLY HIGHLY RECOMMEND TO ALL! "}, {"Review": "I have read the majority of the Misadventure series and just like the rest, this book did not disappoint. The series can be read in any order which is a plus, Even for someone who is very OCD about reading books in order. We meet Cole, who’s down right handsome. Raised with manners of a true southern man, and served for his country. God.. Who doesn’t love a man in a uniform?! When needing a change of pace in life Cole hops into his truck and is traveling towards Oregon, where a former military buddy currently resides. Fate always has a way of playing its hand when you least expect it. Brooke is a girl on a mission. A mission, to get as far away from her controlling family and a promising career. Brooke stumbles upon a gas station that’s happens to be selling a vehicle, she has the means to purchase but not wanting to prove her identity to do so, is denied the purchase. *Enter sex on a stick* Cole who is a complete stranger to offer her a ride to where ever she decides she’s going. The playful banter amongst the two will make you laugh. There’s even some parts that will make you cry. And a few more swipes of the pages and your caught up in a steamy sex scene where the chemistry is off the charts. What I enjoyed the most was the adventure. The not knowing, getting to learn a little bit more of our mysterious Brooke and falling even more in love with Cole for being so charming. It’s a read that’s worthwhile, a must read and read again! "}, {"Review": "Brooke Devereaux has a lot she wants to run far, far away from- overbearing parents who forced her into a career that she never wanted, a future she never asked for, and did I mention her overbearing parents who could care less about her unless she was making them money?Yeah. Talk about ouch.So Brooke does the most logical thing any 24-year-old girl does: She runs away. Sadly, Brooke wasn't blessed with knowing how to survive on her own. Yet somehow, by the grace of God and the heavens, or the Fates, she ends up at a gas station in Kansas. And that's where she runs into a sweet Southern cowboy by the name of Cole Timmons.Cole knows a lot about how to be on the run. He's on the run from his drunk-of-a-father, memories of being a soldier, and a darker secret that's haunted him for years. When he runs into an out-of-place woman at the gas station, something pulls at him to help her out. So he offers his \"Princess\" a ride to wherever she's going. Little does he know, Brooke has no idea where she wants to go, be in her life or in destination.So what's a country boy and a wealthy \"princess\" do together? They take a road trip that leads the pair on a discovery of freedom, release, and truths. The two of them realize that sometimes it takes more than running away to face one's fears; it takes someone finding something to run toward that will break down the walls and barriers."}, {"Review": "Another Misadventure book with another couple that sticks to your heart.Brooke wants to get away from the life that her parents build for her without asking her what she really wants from and with her life.Although some may think she has it all, she can't live that life anymore and find herself wanting to start a new life in another place where nobody knows her for her name or inheritance.Cole is a country man that served in the army but now is also trying to get away and start a new life in other state far away from his past and family and it's a bit heartbreaking all his backstory and very understandable why he wants to leave it all behind. After she gets to be alone and without a car in a gas station where he stops for gas and coffee ,although she is wary of him then realises that he doesn't know her so she could get on the road trip with him and what a road trip really. The authors have such a talent to describe a more than visual surroundings that I felt myself in the car with the couple.They get to know each other a little bit every day through their journey and it's full of funny moments,facts from their past and what they wish for their future,it's a slow burn love story filled with good banter and very real characters.Another misadventures book and another new to me authors that won't be new in the future."}, {"Review": "To ride with a stranger or not. Former milatary man Cole is running away from his painful past. He has no idea where he is going but he does know who he's going to see. A friend from the military. On his road trip, he stops at a gas station. He hears a woman yelling at the manager.  She claims she has no ID and when the manager tells her she can't buy a car with no ID she leaves in a huff. Cole pays for his things and leaves. Then he sees her, standing against the wall looking defeated.  He talks her into joining him on his road trip, cause after all that's no place for a woman to stay who has no car. Brooke is running from her life as a pop singer. Her parents pushed her into that career when she was younger and she's so over it, but she also don't know how to tell her parents no. Cole and Brooke get off to a rocky start. They also have arguments a long the way. Brooke still doesn't tell Cole who she is and she's so afraid someone will recognize her. That is until her bodyguard shows up and tells Cole who she is. Cole and Brooke have already started a relationship but Cole let's Brooke know he knows who she is. They end up in an argument about it and both go their separate ways. Cole and Brooke still think about each other and Cole decides to go find Brooke. Will Brooke quit her singing career? Will Cole find her? I loved this story. I highly recommend this book."}, {"Review": "I have read a few of the other Misadventure books and even though at first I didn't want to read this one, I decided to give it a chance anyway and man and I glad I did. It was nothing what I expected but that is a blessing. It was such a good story. It was full of so much emotion from anger, fear, love, and just overall happiness. I loved Cole. My heart went out to him from the beginning. I could tell he had some heavy baggage he was sifting through and I wanted to hug him and help him through it. Plus his blonde shaggy hair had me drooling along the way.Brooke also had my heart in knots. Not romantically, but just as someone I wanted to help through her problems. We have to wait a chunk of the book to find out what she is running from, but that adds so well to the suspense and emotions that flow through the pages. I know it isn't easy what she was running from and I commend her for doing something for herself even when she doesn't know what she really should be doing.This story left me in a book hangover and wanting to know more about things go in their lives. I could continue to read about where they end up and read about them as elderly warm in their beds. I am so glad I picked up this story and know I will cherish it for many years to come!"}, {"Review": "Country Boy and his Princess....Cole Timmons is the epitome of a country boy. Kind, masculine, polite, easy going and treats all the ladies with utmost respect. It was no surprise that he would come to the aid of a damsel in distress at a gas/truck stop in the middle of nowhere. Brooke Devereaux was in a tough spot and needed a ride as fast as possible out of there. Cole took one look at her and determined that this filly screamed high maintenance and spoiled brat. Cole being the gentleman that he is could not resist offering his assistance, that and the fact that he found Brooke intriquing and definitely easy on the eye. As they took off together on their road trip, Cole found himself wanting to learn more about this Diva. Both Cole and Brooke have turbulent pasts that they are not proud of. As they got to know each other better on the road to \"anywhere\" they discover each other's true self. Elizabeth Haley takes us on their journey of revelation together. They each face some difficult truths that need to be addressed. There is a lot of humor, anguish and hot steamy sex with Brooke and Cole as they break down boundaries and face their true feelings for each other."}, {"Review": "Title: Misadventures with a Country Boy (Misadventures series, #19)Author: Elizabeth HayleyGenre: Contemporary Romance Rating: 5/5ARC received in return for an honest review.A brilliant new addition to the Misadventures series where we get to meet main protagonists Cole and Brooks. Cole’s fresh out the Army and off on a road trip to visit his friend in Oregon, when he stops at the gas station for some gas and a coffee, whilst he’s there he stumbles into the \"mysterious\" Brooke a young woman who’s stranded at the gas station with no car, Cole being the good guy that he is offers her a ride and that’s where their journey together begins.MWACB is filled with fun, drama, mystery and steam, it’s a brilliantly written story in which the words just flowed effortlessly. It’s hard to believe that it was written by two different authors as the words did just seem to flow together seamlessly from page to page. I’m not going to lie I’m a huge fan of the Misadventures series as it is and I’m really looking forward to seeing what’s coming next, especially from these two authors in particular.📚🤓 The Book Whisperer 🤓📚Check it out here☟https://m.facebook.com/The-Book-Whisp..."}, {"Review": "Omg, another amazing misadventure book for the amazing series. All of which completely Standalone.Brooke wants to get away from a life which her parents have built for her without consulting her for what she wants to actually do. Some may think she has it all but for her she wants to start a new life, where no-one knows her inheritance.Cole on the other hand is a country boy, who has served his country in the army but is now wanting to get away and start anew life away from his family and his past.Coles story is a bit heartbreaking but can understand the reasons behind him wanting to leave.Brooke and Coles path cross at a gas station where Brooke has been left without a car, Brooke is weary at first but who wouldn't be, once she feels comfortable she realises he hasn't recognised her, they can go on the road trip together, and what a trip it turns into.The author is truly amazing, the way she is soo descriptive with the surroundings made me feel like i was there with them. Its a slow love story but works soo well. Highly recommend this book and the whole of the misadventures series and the amazing author Elizabeth"}, {"Review": "There is something to be said about a country boy with a Southern drawl and good ‘ol fashion manners.  Misadventure with a Country Boy is the latest edition to the Misadventure series and it’s as sweet as tea and as hot as a summer in night in the south.  This book is a quick but steamy read that will leave the reader searching for a gentleman that has a hero complex and is willing to ride to the aid of a damsel in distress, even if she is determined to make it on her own.  I give Misadventures with a Country Boy by Elizabeth Hayley 5 stars.Cole Timmons is running from his past and his father and the small town he grew up in.  Not sure what he needs to do, he only knows he must get away.  Cole comes across Brooke in the middle of nowhere and just can’t leave her to fend for himself, offering her a ride the two try to make the best of a long road trip between strangers.  Cole knows that Brooke is running too but he can’t figure out what or who she is trying to escape.  After a rocky start the two can’t deny the attraction that they feel for each other and Brooke just hopes that the life she left behind doesn’t interfere with the adventure she is on with the charming country boy."}, {"Review": "Misadventures with a Country Boy by Elizabeth Hayley. Misadventures is a romantic series of spicy standalone novels, each written or co-written by some of the best names in romance. The stories are scandalous, refreshing, and, of course, incredibly sexy. They’re the perfect bedside read, a ‘quick blush’ for the reader who loves a page-turning romance.This Misadventure is written by two friends who love reading Elizabeth & Hayley. I didn't know this until today. Not once during the story could you tell it was written by two different people. I was very surprised to find this.Cole Timmons is fresh out of the army & on his way to meet his friend in Oregon when he stops for gas at a station. When he's there he meets a beautiful stranger, named Brooke that's needing a ride. On this trip, you go through so many emotions that you don't except. I love this Misadventures series & I look forward to reading the next one in the future. I also like to read more from these two wonderful authors.Melissa's Most Memorable Book Mentions received a complimentary copy for her to voluntarily read in exchange for an honest review."}, {"Review": "Again, what an amazing addition to the Misadventures Series. I really enjoyed this one. It was not at all what I was expecting. Be ready to fall in love! The message in the book was also amazing.Cole.. He is definitely the definition of a country boy. Cole is on a personal journey to find himself when he meets Brooke. Cole comes from a rough past that he always finds himself running from. Cole has SO much to offer, however, it takes him some time to actually see and feel his own worth. Will Cole find the pieces he has been missing?Brooke is also on the run from her unwanted reality. She meets Cole under interesting circumstances at a gas station and decides to tag along with him. She is also running from a life that she did not choose. She strives to find independence to prove to herself she has what it takes to be alone and make her own decisions. There is definitely SO much more to her than meets the eye.Can Cole and Brooke learn to trust? Will they see what they are worth? Let me also say that these 2 have an AMAZING chemistry! You will also find yourself laughing out loud and loving the banter between these 2. This is a MUST READ!!"}, {"Review": "Cole and Brooks story is the story of two people running away from the hardships and difficulties that they are facing they want to be their own people they don't want to live under the shadow of their family or their past they want to create their own place in the world a place where they can fit in Cole is escaping a tortured past he can't fix it and you can't run away from it but he's trying to deal with it Brook is trying to find herself and not live under the presumptions and thrall of her family she wants to do what makes her happy if she can escape and hold off then maybe she'll get her happy ending but when she's down and out and a stranger helps her she thought she was running toward freedom ended up could it be loved that she ran toward can two strangers fall in love in a matter of days weeks find out this book was hot hot hot I love the complexity of each person's issue it is a must-have in a must-read🔥❤🔥"}, {"Review": "Another great addition to the Misadventures books. I've loved them all!! This one was incredibly well written, with a bit of humour and whole lot of sass. But, to be honest, I wasn't keen on Brooke, I didn't particularly like her bratty attitude but I LOVED Cole. He's a laid back alpha male, insanely hot and hella patient!The story itself was great and I found myself really really enjoying it the whole way through but Brooke's character let it down a bit for me. I don't think I've rolled my eyes so much in a long while, especially at a book. Pet hate? Bratty, childish characters. To me, she was more a thirteen year old than a 22 year old but hey ho.I've not read any of Elizabeth Hayley's books before, and I really do love discovering new authors. I liked her writing style, the way she forms the characters very subtly and leaves the reading guessing about their pasts, it makes it a lot more interesting. I'll definitely be looking up her other work."}, {"Review": "Yeeeeehawww! Everyone needs Misadventures with a Country Boy in their life! What a fantastic read! Cole and Brooke were a pleasure to read about. Cole runs into Brooke at a gas station. She is without a car and in need of help. Cole being the charming man he is offers her a rid and we go on an amazing journey with these two characters. These two characters are definitely in my top five of the misadventure series couples. They both are running from the things going on in their lives and wind up finding things they weren't even looking for. I love a fast read and this was like the other Misadventures in that way. I devoured it in a few hours and loved every single second of it. I discovered Elizabeth Hayley from their first Misadventure and I absolutely adore them. These two women are absolutely fantastic writers and I loved their first Misadventure. This Misadventure was an absolutely amazing addition to this wonderful series and it is a must read."}], "Genre": "Romance", "ID": "38198500", "Desc": ""}