{"Name": "Not the Duke’s Darling", "Image": "https://images.gr-assets.com/books/1524671249l/38309947.jpg", "Reviews": [{"Review": "2.5 starsI received this book for free in exchange for an honest review. This does not affect my opinion of the book or the content of my review. First in the new Greycourt series, Hoyt starts us off with a spot of danger as our heroine, Freya, is on the run from some men and finds herself face to face with her childhood crush, Christopher, but who she also blames for her brother's downfall. There's some background foundation to the hows and whys of where our characters are at in life. The main thread is Freya's brother, Ran, tried to elope with Julian Greycourt's sister, she ended up dying (we aren't given specifics), and Christopher just stood by while Ran was beaten bad enough he ended up losing his right hand. Ran, Julian, and Christopher were bestfriends but this fractured their bond and they all separated, the other members of the family cut ties all with each other also.\nThe Wise Women had long been hunted by Dunkelders— nasty, superstitious fanatics who knew about the Wise Women and believed they were witches who should be burned.\nWhile the ill fated elopement gave us the underlining emotional tones, the Wise Women that Freya is the Macha (spy) for, gives us the suspense as she is trying to stop a law in the House of Lords that gives free reign to declaring women witches along with her trying to hide from members of the Dunkelders, men who hunt “witches”. These are the two main plot threads but there are numerous other ones, some slight and others weighty, that at times only clog an already full story. Christopher has PTSD induced anxiety from his time in India, we get povs from an old friend of Freya's, Messalina Greycourt, who's storyline looks to be set-up for the next in the series, an imprisoned wife, and a whole slew of secondary characters that get little mini-plots of their own. I like full stories but none of these threads or plots were fully fleshed out and it left a lot feeling shallow and dull.\nThis, this was what he’d been missing without even realizing it: genuine conversation. Genuine feeling.\nThe romance and chemistry between Christopher and Freya was severely lacking for me; I had more fond feelings for the relationship between him and his dog. Hoyt has been a favorite with word play, sexual and taunting, but these two never sparked; it felt like he just found her attractive out of nowhere, while she relied on childhood feelings and the color of his pretty blue eyes. While their bedroom scenes didn't start ridiculously early, besides kissing once or twice, when they do start to get hot and heavy, Freya's first move is to give him a blowjob, because of course. The latter second half brought more sexual scenes but I almost found myself skimming them as their emotional connection wasn't there.\nHe might be a duke now, but she was a de Moray woman , small, swift, and above all ruthless.\nMy biggest disappoint and what frustrated me the most was that Hoyt introduced these interesting ideas, plots, or instances but they all happen off script. The intense ill fated elopement? Happens before this story takes place, no prologue to introduce, show, and explain the basis for the whole the series. Christopher's time in India? No flash back scenes to help immerse the reader into the emotional turmoil of his PTSD or his relationship with is first wife. Freya spending time with the Wise Women? It takes an absurd amount of time for the reader to even get a full explanation of who and what the Wise Women are, let alone the author writing and showing scenes of Freya interacting with the women. This could have been a great emotional fulfillment moment of showing women taking care of one another, bucking the system in a way they could, and female bonding while providing a solid and understandable reason for why this group was so important to Freya and why she might shy away from marrying Christopher.I missed Hoyt's normally atmospheric writing, I did not feel the time period at all, and the sexual heat between the leads that she has a knack for expressing. This honestly felt kind of generic and with dukes popping up everywhere, I'm not sure I could pick this book out of a lineup. The second book is set-up here and with two leads that at least seem like they have some spark, I will give it a try but am hoping for more showing than telling and emotion.****************************************************Whimpers*"}, {"Review": "I've given this a C at AAR (which I think was probably over-generous).Hard as it is for readers when a favourite, long-running series ends, it must be equally so for the author who has lived with those characters and scenarios for years – and who then has to follow up that success with something new that will continue to please fans of the previous books as well as, hopefully, gain them new ones. Having closed the book on the hugely popular \nMaiden Lane\n series last year, much-loved author Elizabeth Hoyt now faces that particular challenge, and presents the first book in a new Georgian era series about the Greycourt family and their immediate circle – Not the Duke’s Darling.If you’ve looked at the advance reviews on Goodreads, you’ll have seen a plethora of four and five star reviews for the book, so I’m afraid I’m going to be a dissenting voice. Not the Duke’s Darling was Difficult to Get Through. It took me twice as long as it would normally have taken me to read a book of this length, mostly because I was able to put it down easily and wasn’t engaged enough to want to pick it up again. There were a variety of reasons for this, not least of which are that the book is disjointed, episodic and overstuffed with plot, the heroine is hard to like, and the romance is woefully underdeveloped.The Greycourt series is predicated on a tragedy that occurred some fifteen years earlier which tore apart three families who had previously been very close. The death of sixteen-year-old Aurelia Greycourt, who had been set to elope with eighteen-year-old Ranulf de Moray, eldest son of the Duke of Ayr, had far ranging repercussions which left Ran crippled and near death, and his friend, Christopher Renshaw, hustled away to India and an arranged marriage with a young woman he’d met exactly twice before.Ran, who inherited the title Duke of Ayr almost immediately after these events, lives as a recluse and his brother Lachlan administers the dukedom. Ran’s sisters – Caitriona, Elspeth and twelve-year-old Freya – were sent to live with their Aunt Hilda in a remote village in the Scottish Highlands, where they learned the ways of the ancient secret society of Wise Women, a group dedicated to helping women throughout Britain utilising their centuries-old knowledge of herbs and healing. Once a thriving group of thousands, the witch hunts of the previous centuries have decimated their number and even though these were made illegal by Witchcraft Act of 1735, old beliefs and superstitions continue to run rife, and Wise Women still run the risk of accusations of witchery being levelled against them.You can read the rest of this review at \nAll About Romance\n."}, {"Review": "The majority of books in Elizabeth Hoyt's \nMaiden Lane series\n are my all time favorites so maybe my expectations were too high when I started reading NOT THE DUKE'S DARLING. However, there are several reasons I didn't enjoy this as much as I was hoping. And here is why:The heroine is part of a group called Wise Women. They are being mentioned but the explanation what they are comes to light at the 72% mark. Yep, that's how long you can guess. Some may find this entertaining, but it left this reader confused, especially because the members had special names that didn't make much sense. Macha was a spy, and the Crow...still not sure about her role...The solution to the riddle was anti-climactic.The heroine was a shrew for a loooong while. Look, I don't mind prickly, spirited heroines and I understood why Freya disliked Christopher - the tragedy that crippled her brother and the role Christopher played in it - but once she fell in love with him the reason didn't matter anymore, only her independence kept her from committing.\n\n    She’d never before met a man outside her family who considered a woman’s being willing to act on her own decisions a good thing.\n  \nShe knew early on that Christopher wouldn't cage her in and take away her independence. It just felt like an excuse and at some point I didn't think Freya deserved Christopher.The reason for Christopher's actions that faithful night was never fully explained. (view spoiler)[ That Christopher stood by while his friend and Freya's brother was beaten to a pulp and crippled, their friend Julian demanding from Christopher not to interfere, without asking why. His apology \"I was weak\" doesn't make him attractive. (hide spoiler)]. It may be a set up for their friend Julian's book but if that is the case EH didn't do this book a favor because how can I root for somebody like that? Miraculously I did, although I could never really forget what he did. I really liked Christopher who had a good heart and actually loved the heroine's bristling.\n\n    “Don’t change. Don’t ever change. I like your prickliness, your scowls, the way you argue with me so fiercely.\"\n  \nChristopher and Freya's love was pretty instantaneous. They'd seen one another last when Freya was still a teenager and Christopher on the verge of becoming a man. When they meet again it takes only a couple of days for the hero to decide that he loves Freya and wants to marry her. And while I'm usually not too bothered by insta-love I have to at least feel the connection. Which I didn't. I didn't feel very invested in their relationship and it took me way longer to get through this story than it should have.What saved this book was Elizabeth Hoyt's beautiful writing and I do hope the next story in this series will be a little more plotted out and we'll get answers we were denied in NOT THE DUKE'S DARLING.\n\n    He looked at Freya’s sleeping face and wished he could cut open his chest and reveal his heart, because he hadn’t the words to tell her what she meant to him.\n  \n\n"}, {"Review": "1.5 starsRight! You have two choices, though they're by no means mutually exclusive.You can either simply scroll through my updates, and you'll get the gist of my overall feelings about Not the Duke's Darling'. Or - and that's by far the better option, in my opinion - you can read the excellent reviews already written by Caz, Kyraraker and Jan.This is not laziness on my part for a change. I'd say so, if it was. There's simply nothing I could possibly add in regards to the many, many weaknesses of this book. Apart from the usual trademark Elizabeth Hoyt applies to all of her books by opening every chapter with the little fairy tale she comes up with, Not the Duke's Darling did not feel like an Elizabeth Hoyt book at all. My disappointment, and I'm not exaggerating, knows no bounds. The Maiden Lane series was a hit and miss for me. But even the books that I considered a miss were still way above the usual romances this sub genre usually offers. Even if I give Not the Duke's Darling the benefit of 'the first in a series, therefore too many characters and subplots', this one was awful. Had I read this book as a first-time-Elizabeth-Hoyt reader, I would have probably not bothered again.I was of a mind of slapping this book with a 1-star rating. However, going through my 1-star shelf, I know there are worse romances out there. But within the work of Ms. Hoyt, this is definitely the weakest yet. Let's hope (in my case kneel, crawl, pray, beg) that the next one will be better. That said, I don't know how it could get any worse, unless it's as bad as this one. Then I'll definitely have a problem.Until then...\n\nAs a side note, I should adopt some of Melody's shelves. Apart from being hilarious, some of them would be spot on for this trainwreck of a book!"}, {"Review": "2 'it was OK' stars. This much-anticipated first book in a new series by a decent HR writer was actually pretty flat and disappointing for me. Others may enjoy it much more - these are my opinions only. I didn't hate it, but it's a bit of a rant, so feel free to look away now.I just did not get engaged in this book and I couldn't bring myself to care much about the characters. I love the period and place setting (1760, England). But the trope was, for me, pretty lame. It's no spoiler (cos it's on the blurb) that the h, Freya, or Miss Stewart, is a member of the ancient Scottish order of 'Wise Women'. Hmm. I have little interest in secret societies, really, even though I know they can work as a central trope. But I'm a bit over the idea, and frankly I think I'd rather you just gave me a woman of her times who lives in her society and experiences the ups and downs of life. But I know many will enjoy the concept, and that's fine.But it wasn't just the trope that I didn't particularly like. IMO this book just isn't Ms Hoyt's best-written book. There was too much going on for readers to easily parse. Too many sub plots simmering away, so you didn't really know which one to concentrate on or care about. Too many characters with confusing names. The h herself with her secret/not-so-secret identity has two names, which is confusing in itself. The dog has a person's name ('Tess') and for a while when she was mentioned I kept thinking she was a person. Then there is Lord Lovejoy and Mr Lovejoy (I think....???) Hmmm. I didn't really connect with H, h or storyline enough to care about them, so I kept getting characters confused, which muddied the waters even more for me. I didn't mind the sisters being named after Roman empresses (Messalina etc) but we didn't see much of them, and it felt too much like they were really there to set up future books rather than to forward the plot of this one.And it didn't feel like there was enough romance and sexual tension between our lovers. They didn't even get down and dirty and do the deed till (view spoiler)[ 2/3 way through the book (hide spoiler)]. I would have liked a bit more overt romance earlier on. I didn't mind the H's past, with the reference to actual historical events (view spoiler)[ the black hole of Calcutta, and also, him being forced into an arranged marriage with a 'simple' woman (hide spoiler)] But for me the whole plot line was unclear for too long. The thing with the Dunkelders got mixed up in my mind with the (view spoiler)[blackmail plot (hide spoiler)] and it all felt confused. And what did really happen with Ran? (Terrible name, BTW!) Who was really to blame? I know there needs to be a certain level of suspense sustained, but if not enough is revealed early enough, readers (like me) are confused and can begin to lose interest. Which is what happened. I started to not care :/I didn't really love the feminist aspect of this story. I know in 2018 authors are expected to write characters who have more agency. I respect that, and will always love a h who is intelligent, strong and has integrity. But I do like a HR to illustrate women of the times who lived within the very real constraints of their day. I found Freya's lecturing Harlowe about women's rights a little tedious, frankly. Isn't there a subtler way Ms Hoyt could have demonstrated their genuine respect for each other?This book also has a little fairy tale/fable type story told in parts at the start of each chapter, just like in the Maiden Lane series. I know many readers love this - that's great for them. Personally I find them tedious and unnecessary, and after reading the first 'instalment', I completely skipped the rest, just as I did in the previous series. But that's not really a complaint - others will enjoy them and it's easy to skip over if you don't like them.So, will I read future instalments in this series? Yes, I'll probably try at least the next one, hoping Ms Hoyt will be better on her game. This was potentially a really good book - mainly just muddied by too many things going on, too many characters. Let's see a clearer focus on our MCs, and with the romance more front and centre."}, {"Review": "Freya was a woman of titled nobility but reduced due to a scandal involving her brother and the Greycourts. Christopher, brother’s childhood friend was also involved, and while Freya would like to set him in his place with revenge, it soon becomes apparent that Freya may not know all the details Freya’s newest mission leads her to a house party in order to get close to Lord Randolph, a man who wants to pass a law to once again subject women to witch trials. Lord Randolph had a wife, a much younger woman, who died under questionable circumstances, and Freya wants to make sure Lord Randolph didn’t get away with murder. Little did she know that Christopher, now Duke of Harlow, would also be at this house party. Christopher accepts the invitation to deal with a despicable man trying to blackmail him. As they each deal with their own challenges they can’t help but be drawn to each other. Freya, because she loved Christopher once upon a time, even though she’s angered over his part in her brother’s ruin. Christopher can’t resist the feisty woman who pushes his every button with her sharp wit and cutting words. Soon they’re stealing away to satisfy the fiery passion between them and I could feel the heat coming off the pages every time they came together!I love that Freya was a strong woman, not really influenced by societal norms here. She’s undercover, hiding the fact that she’s a duke’s daughter to get close to those who would reinstate antiquated laws in order to punish and subject woman who don’t fit into their boxed expectations. Even though I liked Freya I was a little irritated with her actions in the end. A smart woman should use all her assets to keep safe, such as asking for backup or help when facing danger. Going off alone isn’t the wisest thing in my opinion, especially a woman facing off with a man. Her resistance to Christopher was annoying, too, even though it was clear she loved him as he loved her. Thankfully, these situations weren’t long and drawn out so I still really enjoyed the story. Elizabeth Hoyt’s historical romances are always beautifully written, sensual and captivating so I was excited to dive into her new series. Not the Duke’s Darling was an entertaining start to what looks to be a fantastic series! Can’t wait for the next story! A copy was kindly provided by Forever via Netgalley in exchange for an honest review."}, {"Review": "\n NOT THE DUKE’S DARLING is the first book in a new series called the Greycourt. Guys, this series is so fun! If you’re a fan of the Maiden Lane series or like a little bit of action in your Historical Romance, then I’m sure you’ll love this book as well.The heroine, Freya, was really fun and cool. She’s a member of the secret order of Wise Women so there was a lot about her character that I found intriguing. It’s been a while since I’ve been this excited about a new series, especially a Historical Romance one. But I have some pretty high hopes for this series if the next books are as good as this one.Engaging from the first page, NOT THE DUKE’S DARLING is a refreshing new series filled with action and mischief. I think you’ll love the characters for their unique personalities and interesting motives. Hoyt’s writing has always been fabulous, but her ability to weave suspenseful scenes are what really sets her books apart from the crowd."}, {"Review": "3.5 StarsI loved almost every book of the Maiden Lane series and so I was extremely excited to start on a new journey with Elizabeth Hoyt in the Greycourt series. Remember this is an introduction book to a new set of characters and overall plot arc so some things take more time than in other books.First and foremost this is a semi-enemies to lovers story and so sometimes the animosity Freya feels for the Duke of Harlowe is a much. Since this is a set up story for more in this world there is a long drawn out tease to what the Greycourt scandal of the past was and why Freya became a wise woman. Also the wise women are a bit of a mystery for a long time in this book too. You know that they are women helping other women in need but the whole of who they are takes a long time to get to.I like Freya, she is independent strong and has never been taught to set her worth on a man or the marriage she will make. This in itself is unusual for a Historical Romance novel. Even though she is the sister of a Duke she is undercover working as a paid companion so she can be the eyes and ears of the wise women. It takes a very long time to get to what the Greycourt scandal was and why she hates the Duke of Harlowe so much when as a girl she had fantasies of marrying him. Even once we get to it no questions are really answered and I think that will be in following books where they actually work to solve the murder that happening. This incident doesn’t paint Harlowe in the best light, but it does make his character feel more three dimensional. He is a man that made a mistake as a young man and has paid for it for the last 15 years. He is not the same boy from the night of that tragedy.\n\n❝He was a man, both good and bad and everything in between. A man who made her very aware that she was a woman of blood and bone and wants.❞\n\nThe feelings that the two have for each other hit hard in the beginning and the turn from enemies to something more doesn’t take a long time. But still the writing is done well and I enjoyed the journey. I was a little concerned that Harlowe was married but the story of his wife made me feel like he paid and penance that he might have deserved for anything in his boyhood.Overall this is a good introduction to the world and the characters that I think we will see over multiple books. I’m very interested in seeing a few of the characters from this book and meeting Freya’s brother Rand. There seem to be a lot of opportunities for great stories in the future of this series."}, {"Review": "This was well written as always with a Hoyt book, and the last part was enjoyable; but I just didn’t find myself gripped by the storyline. It was a bit simplistic, I was not overly engaged with either of the leads, and the story was often rambling and with too many vaguely drawn subplots. I got confused with all the names. There was no consistency in the name being used. Sometimes it was the character’s first name, other times the family name. Add to that the titles and the fake names, and I was often lost as to which character was which. So it was a good read; but not quite what I’ve come to expect from Hoyt. "}, {"Review": "The central couple is Christopher and Freya, childhood friends who were estranged after her brother is wrongly accused of murder. Fast forward fifteen years and now Christopher is a Duke and Freya is in service as a companion (or so it seems). They meet by chance at a house party and have to deal with the past, the present and also consider what they want for their future.I loved the hero! Christopher Renshaw, Duke of Harlowe had a dark past to regret, but was a lovely person all through the book. He was forever respectful and understanding and my infatuation grew into love after a few chapters.I cannot say the same about the heroine though, at least not at first. At the beginning Freya seemed a little childish and even sometimes arrogant. But she grew on me later on when she finally let down her guard and showed she was also a sensitive woman in search of understanding and love. I could then realize that her insistent self affirmation was in fact a reflection of her inner doubts, and it changed my initial opinion of her.There is a lot going on in the book: a secret women society, witch hunting, families tore apart by an unexplained murder, an arranged marriage, PTSD (Post Traumatic Stress Disorder), blackmailing, illegal confinement, and much more...Although full of adventure, the story also brings a well built romance with tender and steamy scenes.As the first book in a new series, several characters are introduced, including the heroine’s best friend Messalina (whose calm and fortitude really conquered me and who is the protagonist of the following book: “When a Rogue Meets His Match”). I’m a fan of Mrs. Hoyt’s work and I’m looking forward to read the next books!I’ve received this ARC as a prize in a giveaway during the Historical Romance Retreat 2018, with no strings attached."}, {"Review": "Reviewed for THC ReviewsNot the Duke’s Darling is the first book in Elizabeth Hoyt’s promising new Greycourt series. It follows the exploits of our heroine, Freya, who is part of a secret order known as the Wise Women. These women live in a commune-like environment in northern Scotland. They’re well-educated in many different traditional areas, as well as learning the ways of their foremothers in the healing arts. They’re also very independent and forward-thinking, always trying to protect their fellow women in need in an era when women’s rights were virtually non-existent. Freya is paired with Christopher, a duke, who unexpectedly inherited his title from a distant relative. The two were acquainted in childhood with Christopher being Freya’s brother, Rand’s best friend. Freya had a huge crush on Christopher as a girl, but ever since a scandalous tragedy involving both their families, they haven’t seen each other for fifteen years until a chance meeting in which Freya all but throws herself and a woman and child she’s trying to save into his coach during a daring escape. Then they have a later second meeting at a house party they’re both attending, which leads to a rekindling of their friendship and a whole lot more.Freya is the daughter of a duke, but when she was twelve years old, her older brother, Rand, was accused of a heinous crime and severely beaten for it by the men of the father of the woman he’d supposedly wronged. Of course, none of it was true, but her brother was left permanently maimed as a result and now lives in seclusion. Not long after the scandal, her father died as well, leaving her ill brother, who was only eighteen at the time, as new duke. Since Rand was unable to care for Freya and her younger sisters, an older, maiden aunt came to take them to live with her and the Wise Women who taught them all they knew. As a result, Freya is now a fiercely independent spitfire, who has worked as the Macha (or spy) of the group for the past five years, saving many women who might otherwise have perished or been horribly abused. She lives under the assumed identity of a companion and chaperon to a lady and her two daughters, but she’s been tasked by the Wise Women to find dirt on a lord who is about to introduce legislation to make witch-hunting legal again. Since the Wise Women are often accused of witchcraft, this would be a terrible turn events for them. As it happens, the house party Freya is to attend with her charges is being held at an estate next-door to the lord she needs to investigate. Also in attendance at the party is Christopher, who Freya blames for Rand’s condition, so she vows to get vengeance on him at the same time. But she didn’t expect to discover that Christopher is actually a decent guy and then find herself falling in love with him.Freya is a very liberated woman, possibly too much so for some readers given that this is a historical romance. This might be why the book has lower ratings than most of Elizabeth Hoyt’s works, but since I haven’t read any reviews yet, I’m not sure. Given the context of her upbringing, though, I was able to set aside any skepticism. I’m not really sure if Wise Women like what are portrayed here actually existed at the time, but it at least seemed plausible to me. Freya is, however, tough as nails and doesn’t believe that she needs a man in her life at all, something that becomes a sticking point in her burgeoning relationship with Christoper. I often have difficulty with heroines who are as stubborn and independent as Freya is, but somehow she made sense to me. Perhaps it’s because she vacillates between her fiercely independent streaks and softer, more vulnerable moments. I loved how she comforted Christopher when they were locked in a small space and he was panicking. I also like how she took charge to some extent during the love scenes, but was always so giving of herself at the same time. In addition, she could be reasonable and forgiving when faced with the truth of what Christoper’s life has been like since that scandalous night. I’ll admit that Freya did come close to tweaking my buttons when she kept refusing Christopher’s proposals, but in the end, I think she was just afraid of losing herself and her autonomy in their relationship, which is a valid concern that many strong-willed women like her have.Christopher is haunted by that scandalous night and regrets not taking action to help his friend before things went too far. Simply because he had been involved, he ended up paying a steep price, not just to his psyche, but in his life. His father forced him into an arranged marriage with a woman he’d only met twice, then basically exiled him to India, where his wife died, something he also holds himself responsible for. It wasn’t until a distant relative died without heirs, leaving him as the next duke that he returned to England. When Christopher meets up with Freya again, he realizes she’s everything he’s longed for in a wife and partner, and the exact opposite of his former wife. He loves Freya’s fiery nature and the way she argues and debates with him. She challenges him at every turn, but he finds it all arousing and intriguing. However, the independent lady keeps refusing his suit, as well as his help, even when investigating a potentially dangerous enemy. I absolutely adored Christopher. He’s a kind, caring man, completely accepting of Freya as she is and never expecting her to change into a meek and submissive wife. What he wants is an equal partner and he respects her intellectual abilities. He’s also very patient, never badgering her to accept his proposal. Even though a part of him wants to, he bides his time, allowing her to come to terms with the decision on her own without stifling her autonomy, even if it means possibly losing her.Overall, Not the Duke’s Darling was another great read from the pen of Elizabeth Hoyt. It boasts some great secondary characters, including Freya’s former best friend, Messalina, another player from that fateful night, with whom she reconnects. Messalina gets several of her own POV scenes, and we also get a brief introduction to Gideon Hawthorne, the man I’m pretty sure will become her hero in the next book of the series, A Rogue Meets His Match. There were a number of other characters that could also make great future heroes and heroines, and I’d be remiss if I didn’t mention Christopher's loyal dog, Tess, who’s always by his side. In addition to the wonderful characters, there’s plenty of action and intrigue, enough for me to categorize this book as romantic suspense. There are multiple mysteries afoot to figure out, including what happened that night fifteen years ago, why someone is blackmailing Christopher, and what happened to the wife of the lord Freya is investigating. I have to say I wasn’t the least disappointed with any of these reveals. The only thing that wasn’t entirely solved is what happened to Messalina’s sister, which is a mystery that I assume will be explored further in future books of the Greycourt series. But for now, Not the Duke’s Darling was an awesome start to this new series that has me eagerly awaiting the next one, which is expected to be released this summer (2019).\nPatience for Christmas\n by Grace Burrowes - Bonus novella. Review coming soon"}, {"Review": "Ah, Hoyt, who’s written some of my favourite historical romances, The Leopard Prince and Duke Of Sin. Therefore, a new Hoyt series is always welcome and I happily plunged into Not the Duke’s Darling as my first 2019 romance-read. Though it didn’t reach the heights of my favourites, very difficult to do given how much I love them, it was satisfying. In particular, the storylines and premise it sets up make me eager for the books-to-come.Not the Duke’s Darling is Georgian-set, Hoyt’s time setting of choice, and centres around reunited childhood friends and former-best-friend’s-younger-sister hero and heroine, Christopher Renshaw, Duke of Harlowe and Freya Stewart de Moray. The opening scene was thrilling, funny, and compelling. Freya is a member of a ancient, secret society, the “Wise Women”, a group of proto-feminists sworn to help and protect women, persecuted as witches and now living in seclusion in an isolated part of Scotland. Freya, however, is one of their agents, living pseudonymously in society, aiding women, and keeping her ears and eyes alert to threats to the group. In the opening scene, Freya is helping a baby-lordling and his widowed mother escape the clutches of an evil uncle, intent on using the infant-lord to control his estates.Desperate to escape pursuing thugs, Freya, baby, and nurse tumble into a nobleman’s carriage, Christopher’s carriage. Freya recognizes Christopher as the man who stood by and watched as her brother was beaten fifteen years ago, when they were all friends in Scotland. (This backstory serves to re-introduce some of the characters involved in that life-changing incident, while others hover, ready to be brought in in later volumes.) Christopher, on the other, hand, doesn’t immediately recognize Freya, but he does find her exciting and beautiful, if a tad crazy. He helps save baby and Freya and she is able to hand the one and half year old Earl of Brightwater over to his mother, who spirits him away to America. Freya then meets with anther Wise Woman, the “Crow,” who warns her that the Wise Women want her return to their Scottish sanctuary. Freya wants to stay in England to investigate the instigator of a new Witch Act in Parliament, sure to destroy the Wise Women. That instigator is Lord Randolph. Working as ladies’ companion to the Holland family, Freya finds herself on the way to a country estate party at the Lovejoys, whose holdings abut Lord Randolph’s. An ideal opportunity. Moreover, Freya also wants to reunite with Christopher, to exact revenge for what happened to her brother, especially when she noticed, in the carriage, that Christopher wore her brother’s signet ring.In the meanwhile, Christopher, ever haunted by the mad, beautiful woman who fell into his carriage, is confronted by his own problems. A handsome little creep, Thomas Plimpton, is blackmailing him over some letters Christopher’s deceased wife exchanged. As Plimpton is to attend the same house-party to which Freya has been invited, Christopher makes his way there. The romance then becomes a working out of their past, the push-pull of their attraction, and their pursuit of Plimpton and the witch-hating parliamentarian, Lord Randolph. Moreover, other figures from that original traumatic scene appear at the house-party: the sisters, one of whom was Freya’s childhood friend, Messalina, of the man who caused Ran’s beating, Julian Greycourt.That it took me three long, inelegant paragraphs to reach the point where I can express an opinion about the book may tell you something both about its weakness and strength. Hoyt can’t write a bad book if her life depended on it. She drew me in with her creation of this Wise Woman society and especially with the conversations among the women of the house-party. Lady Holland, Freya’s employer, turns out to be a sympathetic, forward-thinking character, an anti-Mrs.-Bennett, smart and concerned for her daughters’ happiness as opposed to their marrying up and rich. Freya’s reconciliation with Messalina is wonderful, as is Messalina herself. Though the muffin-eating, sword-wielding sister, Lucretia, steals the show in one priceless scene. The mysterious beating, the reasons behind it (Ran was thought, at the time, to have killed the Greycourts’ sister, Aurelia, not true, of course, but it brought about the estrangement among the close-knit friends), the proto-feminist society and what they stand for, Christopher’s own sad backstory, and the delightful dog, Tess.Hoyt is setting up a compelling, original series: what she didn’t accomplish is the development of Freya and Christopher’s relationship. In order to introduce her overarching series narrative, Freya and Christopher and even Tess have sound as one-note wonders. Christopher, no matter how one-quirked-eyebrow roguishly handsome he is, is a man of fidelity, decency, and care for others, protective and loving toward Freya and all women. He sees Freya, is attracted to her, likes her, realizes who she is, woos her and wants her throughout. Freya, on the other hand, is fiercely independent and wary, wary of marriage and commitment and the way it might thwart her work with the Wise Women and her own freedom. As smart and good as Freya and Christopher were, it was hard not to see how they couldn’t NOT be together, how they couldn’t NOT work out their differences, especially Freya. She’s too smart not to recognize Christopher’s value, how he would only ever stand by her, never thwart or diminish her. There’s a lot sex, well, not a lot, not till the last third: it’s good it takes Freya and Christopher a while to become lovers, but when they do, it’s at least a love scene a chapter. So, there’s a lot of sex, but not much tension, difference, the emotional stakes don’t seem to be that high. And, frankly, the love scenes are over-wrought, trying to make up in heightened language what is lacking in development.In the end, Not the Duke’s Darling great strength is Hoyt’s world-building: the families, that past incident that will need to be worked out, the potential in all those marvelous characters waiting to have their story told, the atmosphere of danger and, the potential presence of characters, some still at loggerheads, who will serve as a merry band against evil. I loved Not the Duke’s Darling for what is to come and I liked Not the Duke’s Darling for its likable, compatible couple and the binding role they will come to play in the other characters’ lives. I loved the women and their friendships/relationships the most of all. With Miss Austen, we say that Hoyt’s first Greycourt novel offers “real comfort,” Emma.Elizabeth Hoyt’s Not the Duke’s Darling is published by Forever (Grand Central Publishing). It was released on December 18, 2018, and may be found at your preferred vendor. I received a Digital Galley Edition from Forever via Netgalley, as well as a paper copy."}, {"Review": "\"Obviously he wasn't used to being given orders by anyone -- a woman least of all.Too bad.\"FINAL DECISION: I absolutely loved the relationship between Freya and Christopher which I found passionate and combative and I loved how the two of them both have to consider their own expectations. This book begins a new series and has a lot of new characters and new situations to begin to explore so it feels that there are a lot of dangling ends...but the main story line between Freya and Christopher is complete.THE STORY: \"What had happened at Greycourt fifteen years ago would reverberate forever in their lives.\" Freya de Moray is operating as a companion while working as a member of a secret group of women called the Wise Women who, among other things, protect and care for women who need help. When one of her missions places her in the path of Christopher Renshaw, the Duke of Harlowe, Freya's mind turns to revenge. Harlowe caused the ruin of her family and Freya is not going to forget it.OPINION: This book is breathtaking in its fierce passion. These characters are drawn together through pain and fury. I loved their relationship which is between two strong personalities.\"He was a man, both good and bad and everything in between.\"Christopher was simply an amazing hero. He is damaged and difficult and incredibly caring and passionate. From his protection of his deceased wife, to his acknowledgement of what Freya needs in order to feel heard. I loved his passion for Freya -- and not primarily the sexual passion (although the relationship between Freya and Christopher is hot). He is strong and determined but I especially loved him at the moment that he put aside his own desires and instead considered what he could do for her -- even if he didn't agree with her.Freya is a woman who has made her own way after the tragic events that destroyed her family. She has a strength and a determination that is especially admirable for the historical period. That strength and independence is something that Freya fears will be lost in a relationship with Christopher. I was interested in how Freya has to confront the risks a woman takes in choosing to join her life to a man at a time where a woman has no recourse against the malfeasance of her husband.Together, Freya and Christopher sparkle on the page. The moments where they are together are passionate and frustrating and I was never bored for one moment. For me, the relationship is the central and most important part of the book and there was no disappointment for me here.It is important to note that this book is part of a series where there is an overarching story line that is not resolved in this book. If danging threads bother you, consider that this story resolves the main plot points raised in this book, but there are things still to be uncovered in the remainder of the series.Indeed, the weakness of this book, like many first books, is that there is much setup here of characters and situations which are clearly meant to be unraveled in the series. This book is one which expect might improve over time as the other stories are told and the promises in this book are fulfilled.WORTH MENTIONING: I had to read this one twice. I was mildly disappointed on first read. I believe because it was so different than the Maiden Lane series which I adore that I really didn't give the story a chance. On second read, I loved it and am excited about all the possibilities in this new series.CONNECTED BOOKS: NOT THE DUKE'S DARLING is the first book in the Greycourt series.STAR RATING: I give this book 4.5 stars.NOTE: I received a copy of an ARC of this book from the author. I was not required to write a review or to write a positive review. All opinions contained herein are my own.This review was originally posted on Top10RomanceBooks.com"}, {"Review": "For years now I've been hearing about how great Elizabeth Hoyt's books are. Even though I am a huge fan of historical romance, I think it took me a while to pick up anything from her because I didn't know where to begin. Now that I've read my first book from her, Not the Duke's Darling, well, I'd like to bang my head against a wall. I did not think this book was perfect, but it was enjoyable enough that I will be reading more of this author.I was intrigued by Not the Duke's Darling in particular because of the secret order of women. It sounded so scandalous but incredibly interesting given the position that women were in at the time this book is set. I think this was what set the book apart for me from other historical romances I've read and it is what will have me picking up more books from this series. Character-wise, I enjoyed Freya quite a bit. She was a well-layered character with a fiery side to her that I enjoyed seeing emerge. The book literally opened up with her fleeing a dangerous situation and that one scene spoke to her bravery. Though we're not given the entire history of what exactly happened to her family early on in the book, enough background was given to understand what fuelled her actions into taking up a position as a companion even though her brother was a duke. She was very headstrong and at times, quite bullheaded. There were occasions when I thought she was entirely too harsh, but it was also easy to understand where she was coming from. All in all, I found her to be a well-rounded character.Equally likable was the hero of the book, Christopher Renshaw, someone Freya considered to be an enemy for what he did to her brother. Growing up, she had a bit of a crush on him, but that had changed. We learn that Christopher is a widower and someone is blackmailing him with letters that could hurt him and his dead wife's reputation. Which is how he winds up at the same gathering as Freya, who is there to I liked Christopher a lot. There wasn't anything particularly special about him, but he was a genuine and sweet guy, who had been forced into a marriage that he did not want. When Freya stumbled into his carriage, he finally felt a spark after long. Their dynamic and chemistry were great together. The anticipation to their first kiss, in particular, was great. That being said, I felt like their romance felt a bit rushed. I wanted more of the hate-to-love, more tension, more passion, and more banter. The sex scenes in the book were also not my cup of tea. There were some odd word choices that were used that made the scenes a little cringy. I am eager to learn more about the secret order of women and Not the Duke's Darling was a good introduction. I only wish I got out of the book what was promised in the summary in terms of the romantic tension."}, {"Review": "\nI received this book for free from Publisher in exchange for an honest review. This does not affect my opinion of the book or the content of my review.NOT THE DUKE’S DARLING is the first book in a new series called the Greycourt. Guys, this series is so fun! If you’re a fan of the Maiden Lane series or like a little bit of action in your Historical Romance, then I’m sure you’ll love this book as well.The heroine, Freya, was really fun and cool. She’s a member of the secret order of Wise Women so there was a lot about her character that I found intriguing. It’s been a while since I’ve been this excited about a new series, especially a Historical Romance one. But I have some pretty high hopes for this series if the next books are as good as this one.Engaging from the first page, NOT THE DUKE’S DARLING is a refreshing new series filled with action and mischief. I think you’ll love the characters for their unique personalities and interesting motives. Hoyt’s writing has always been fabulous, but her ability to weave suspenseful scenes are what really sets her books apart from the crowd.*ARC provided by publisherReviewed by Ann❤ ♡ Don't want to miss any of our posts? Subscribe to our blog by email! ♡ ❤"}, {"Review": "\n❝He was a man, both good and bad and everything in between.\nA man who made her very aware that she was a woman of blood and bone and wants.❞\nConfession time ... this is my first, Elizabeth Hoyt book. I know, I KNOW. You don't need to tell me what a fool I've been. Or what I've missed out on, because this book was an EXPERIENCE. It was an adventure. It was a treat.Historical romance has never been my go-to choice for reading, but as I get older, I find I'm enjoying them more. 'Not the Dukes Darling' was a time travel experience that delighted this notice historical romance reader.I love Hoyt's voice, tone and writing style. She tempers her descriptions, providing just enough to paint a picture forcing the reader to envision the backdrop and experience the emotions.\n❝For years he'd been exiled from these shores. Had lived in a country with foreign sights and smells and people and he had thought all that time -- thirteen years -- that when he returned to England, his birthplace, everything would be different.\nThat he would be home.\nExcept when he returned it was to a title too grand. To parents dead and friendships destroyed and turned to dust. To grand manors that echoed with his solitary footsteps when he walked through them.\nEngland was no longer home. All that he could've built and loved there had been lost as he spent his youth in India. It was too late to find a home now.\nHe did not belong anywhere.❞\nThat is until Christopher Renshaw, the Duke of Harlowe found Miss Stewart, Lady Holland's companion, (Freya de Moray). There was something familiar about the beautiful, understated woman that reminded Christopher of his childhood. She pushed him, fought with him, and yet, she excited him.\n❝She  glowed, a fire, burning brightly, luring him closer, appearing to offer him peace.\n❝You drive me mad, little thief,❞ he whispered, and gave in to the constant, terrible temptation.\nHe kissed her.❞\nHe yearned to have her beauty in his life, for her to set at ease thunderstorm that brewed within him. He wanted her soft lips to only spit hatred at him and her green-gold eyes to gaze only at him.With a guilt-ridden Duke who's being blackmailed and a beautiful, mysterious ladies companion who is not who she seems; 'Not the Dukes Darling', was a wonderful historical adventure with mystery, intrigue, romance, and humor.I was provided a review copy by the publisher. This did not influence my opinion of the book nor my review.\n \n \n \n \n \n"}, {"Review": "I was in the middle of a decent reading streak and this book literally caused me to stall: I just did not care an iota about any of the \"Wise Women\", the alleged drama between Freya or Christopher or their apparently large and sprawling families, or the ridiculous conceits needed to create a sense of drama and tension. The real problem I have is that I enjoy how Hoyt writes; the mechanics of her prose are engaging and interesting, but this particular story not only hit me like a bucket of cold water but made me dread the time I set aside to read. Not planning to revisit unless future books dramatically break with the premise. "}, {"Review": "Intriguing regency romance…I’m all about diving into character’s minds and hearts. Feeling, hearing and seeing their emotions is what romance is to me. Not surprising then that traditional Regency romance is hard for me to connect with as the characters keep so much of their true thoughts and feelings hidden behind strict grammar and manners. Thank goodness this author reminds us that, no matter the time, there is always, always love…Freya and Christopher (aka Kesper) found themselves in an intrigue that both were well-suited for. Their meeting after many years was an explosive start to a long overdue reckoning. Each were battling enemies so found their mutual animosity taking second fiddle to greater danger. Freya was bold even as she hid her pioneering spirit under an assumed name and drab clothing. I liked her, for her bravery, her sharp, witty tongue and her soft heart. Kesper was a recluse so was brought out of the shadows kicking and screaming. I ached for the pain and hurt he still endured. Together, they made an intriguing, surprisingly supportive couple that were a match for any foe…While the emotional punch and surprises may have been quieter if compared to the Maiden Lane stories (which I adored), they were satisfying in their own right. I’m hoping for many more Wise Women to come… ~Diane, 3.5 stars"}, {"Review": "Not the Duke’s Darling is the first book in the Greycourt series by Elizabeth Hoyt.15 Years ago Freya De Moray's brother was left a broken man, both literally and figuratively leading to the downfall of her family. The man she holds responsible is Christopher Renshaw, now the Duke of Harlowe. Before the 'incident' she thought herself in love with Christopher, but now she only holds anger and contempt towards him. When they come across each other at a house party Freya wants nothing more than to get her revenge against him. Something that she thinks will be easy to do because he doesn't even recognise her for who she is. Instead of taking her place in society, she has taken a position as a companion/chaperone and in doing so she dresses appropriately and makes sure she is always in the background. The disguise works well.Freya needs to keep her disguise in order to work well as a 'wise woman'. They are a secret society, a group of woman who work towards helping other women in need. Some people who know of the wise women, but not who they are, also consider them to be witches. The hunting and killing of witches had been outlawed, but one member of the nobility wants to put a bill before parliament to bring back those things which of course would make the wise women hunted women. Unfairly hunted, but then when was witch hunting ever a fair thing?! Freya plans to get some 'dirt' on that member of the nobility so that he can be blackmailed into not putting the motion forward in parliament. That is the main reason she is in attendance at the party.This story was quite a 'busy' one with many characters intertwined with a similar goal but for different reasons. Christopher, bless him, had no secret agenda, but still had a large part in the story because of his past with Freya and her family. Would she get her revenge on him, or would time spent together at the party help her to see that perhaps he isn't the evil man that she sees him as? I enjoyed seeing their relationship develop especially as they both can easily help each other to heal from what happened 15 years ago. They just need to give themselves permission to do that.I enjoyed the story, the drama of it, the building passion between Freya and Christopher, and I love the secret society of the wise women. I am not sure which way the series is going to continue but I hope in future books we have more stories about the wise women and their rescues.I noticed one or two small inconsistencies in the story, nothing hugely dramatic, but I picked up on them all the same. I read an advanced copy to the book before release so I am hoping that an editor or proofreader will pick up them before the book is released.All in all this book definitely captivated my attention and I am happy to recommend it. I can't wait for the next one in the series."}, {"Review": "I wanted to like this much more than I did. It had all of the elements of a great story: revenge, feminism, and a tortured hero. Somehow it didn't meld into anything spectacular. The main female character was a strong feminist and was part of a secret group called Wise Women. I love a good revenge story, but this one unraveled rather quickly.Freya was hard to like. I loved it that she was so passionate about women's rights, but it was taken too far to the point of man hater territory. Her emotional growth was stunted from the time she was a child. Tragedy befell her family years before. In many respects she held onto the childish misconceptions she had of that time and let them dictate her life without bothering to search for the truth. Many things about her grated on my nerves. Renshaw was a genuinely good guy. I liked him a lot but nothing about him stood out either. Somethings about his past were surprising. Something was off with the sex scenes especially when compared to the author's other works. At times, they were downright cringe worthy.There were a few random times where the POV switched to a third character. It was obvious this person was going to be one of the main characters in the next book. I'm genuinely interested in her story, but I would have preferred that her story didn't take up as much page time in this. I received this from Netgalley in exchange for an honest review."}, {"Review": "3.5 stars rounded up.Lady Freya Stewart de Moray's life changed dramatically 15 years ago after what came to be known as the \"Greycourt Tragedy\", when her brother Randolph \"Ran\" almost died and her family was torn apart. Now 27, Freya has joined the secret society of Wise Women and has taken work as a companion/chaperone to Lady Holland and her daughters, using the assumed name of Miss. Stewart. Her life is nothing like she thought it would be, but she is content. While helping reunite a woman with her child, she is chased by some men and jumps into a carriage. That carriage is occupied by the one man Freya hoped to never see again - Christopher Renshaw, the Duke of Harlowe, the man her 12 year old self vowed to marry and the man she holds responsible for destroying her family. She looks up and sees he is wearing Ran's signet ring, hate for him almost overwhelms her, but he doesn't recognize her, which makes her hate him all the more. She is rude to him, but he protects her when the men chasing her approach the coach. She leaves his coach with a parting shot at him and continues on with her mission.Christopher is a widower, he was married and sent to India shortly after the \"tragedy\" and only returned to England two years ago when he unexpectedly inherited the dukedom from a distance cousin. He keeps to himself and has spent the last two years restoring the duchy. He didn't recognize Freya, but he was intrigued by her, she made him feel alive for the first time in years. He tries to put her out of his mind, sure he will never see her again. He goes to his club and is confronted by a man he knew in India - a man who seduced his late wife - Mr. Plimpton. Plimpton has letters from his wife Sophy, which he threatens to make public if Harlowe doesn't pay him off. He says he will exchange the letters for the money at a house party being held by Harlowe's former brother in law, Baron Lovejoy. Christopher wants nothing more than to thrash Plimpton, but he failed Sophy in so many ways, that he can't let her memory be tarnished by the letters. He will go to the house party, pay off Plimpton and return to his solitary life.Freya goes to the house party with her employer, hoping to get information on Lord Randolph, the neighbor of the Lovejoy's, a man who is actively trying to pass a bill in Parliament to revive witch hunting - the Wise Women have long been targeted by witch hunters and this bill will threaten their already dimished numbers. She arrives at the party and is shocked to see not only the duke, but her former best friend Messalina Greycourt as well. Christopher immediately recognizes Freya from the coach incident, but doesn't reveal her. He also recognizes Messalina. Messalina knows exactly who Freya is, but for some reason has kept the knowledge to herself. Her family is at the center of the \"tragedy\" and Freya is sure that Messalina must hate her - her brother Ran was accused of trying to elope with and then murdering Messalina sister Aurelia. Messalina is surprised to see Christopher talking to Freya, but quickly realizes that he doesn't know who she is. She approaches them and is hurt when Freya slips away, why would Freya forgive Christopher, but snub Messalina? Freya has ignored her since they saw each other again for the first time in years when Freya came to London. Messalina has kept her distance, but longs for her friend. Messalina has her own reasons for attending the party, her dear friend Eleanor, Lady Randolph died last year and Messalina is sure her husband is responsible, so she wants to investigate and bring him to justice.Later Freya sneaks in Christopher's room, hoping to retrieve her brother's ring. She enters and realizes immediately that she made a mistake, she forgot about his dog, Tess. But before she can leave, Christopher grabs her. She kisses him and when he returns the kiss, she bites him and slips away - with the ring. He is shocked and intrigued. He confronts her later and demands the return of the ring. The ring is a reminder to him of his failures and his determination to be a better man. She of course refuses. Later he demands it again, this time she challenges him to a duel - winner gets the ring. She beats him, but he finally recognizes her! She tells him what happened to her family after that awful night, but she doesn't really know what caused the tragedy. Christopher tells her what he witnessed and begs her forgiveness for not saving Ran - he never believed Ran killed Aurelia. He tells her that he was married off and exiled to India shortly after the incident and only returned when he inherited. He hasn't seen Julian Greycourt or Ran since that night. She begins to realize that Christopher is not the man she thought he was, she still can't forgive him, but no longer hates him.When Freya overhears two different conversations, she will find herself in more trouble than she could ever imagine. She finally talks to Messalina and agrees to meet with her later. But when she follows Christopher, they end up being locked in a well house for the night. She and Christopher talk and he tells her of his time in India and the horrific events that lead to the death of his wife. She calms him and tells him of her family. They are rescued the next day by Messalina, who was hurt that Freya stood her up, but soon realized that she was actually missing - along with Christopher. To save Freya's reputation, Christopher proposes, but Freya refuses to marry him. She cites the many reasons that they could never be together - he refuses to accept them. He will win her! But theirs will not be a smooth journey to HEA.The story was good, but honestly, there is so much going on and so many pertinent secondary characters, that it gets a little hard to keep track of the \"romance\". The book is well written, interesting, entertaining, steamy and definitely a page turner, but I finished it feeling a little unsatisfied. There were a lot of unanswered questions, some will probably be addressed in the future installments, but some were specifically relevant to this story and I can't see how they will be incorporated in to the future books. Overall, it was a good read and I would be happy to recommend this book and am looking forward to the next one!*I am voluntarily leaving a review for an eARC that was provided to me.*"}, {"Review": "Reviewed for \nWit and Sin\nMurder, betrayal, revenge, trauma, blackmail, mysterious orders, politics, secrets, danger, and romance… \nNot the Duke’s Darling\n is a whole lotta story packed into one book. Elizabeth Hoyt dives headfirst into the intriguing world of the Greycourt family and the result is a bit of a mixed bag for me. On the one hand, I liked many of the elements to this tale. On the other, there was so much going on that everything felt incomplete.At the center of \nNot the Duke’s Darling\n are Freya and Christopher. Christopher was once the best friend of Freya’s brother, Ran de Moray, until the night Ran was accused of and beaten nearly to death for murdering Aurelia Greycourt. It’s been fifteen years since that night, and Christopher is still haunted by it. He’s also carrying invisible scars from the death of his wife and his time as a prisoner in India. Christopher had the potential to be an intriguing hero. All the elements are there – a young man who made the wrong choice and is still suffering for it, PTSD, an adorable emotional support dog, his yearning to feel alive again – but his character development felt stifled by the abundance of plot and I didn’t get as deep a sense of him as I would have liked. Freya suffered the same fate. She’s a Wise Woman and a spy and I wish I could have learned a lot more about that part of her life, 99% of which takes place pre-book. She’s brave, independent, and definitely (humanly) flawed, but she also has a warm heart that shows in moments when the plot lets her breathe.The romance between Christopher and Freya is enjoyable, but could have been so much more if it had been given room to grow and time for passion to be explored. Instead we are shuffled from one plot point to the next. To start, there’s the Dunkelders – men who think the Wise Women are witches and want to murder them – and their mustache-twirling plot to introduce a new era of witch hunting. The ignorance and sexism that’s innate to the Dunkelders could have been more ominous if – at the risk of repeating myself – they had been given more page time. There’s also the matter of Christopher being blackmailed, Freya’s initial quest for revenge, and looming over everything, the question of who murdered Aurelia Greycourt all those years ago. Neither Freya nor Christopher are Greycourts, but the titular family of the series is featured heavily, mostly in the form of Messalina Greycourt. Messalina is the third point of view in \nNot the Duke’s Darling\n and she’s a wonderful character who had the characteristics of a classic Hoyt heroine.I’m a longtime fan of Elizabeth Hoyt’s which makes this book a bit difficult to put a rating on. Had it been by another author or had I been new to Ms. Hoyt’s work, I might have liked this book better (though at the end of the day, I did enjoy it). But I know Ms. Hoyt’s writing – her passionate, unique, flawed characters and their liveliness on the page – and Freya and Christopher were just missing some of that ineffable zing. I was, however, completely fascinated by some of the secondary characters. From Messalina to the mysterious Gabriel Hawthorne to Freya’s lovelorn charge, Arabella Holland, there are plenty of characters who have me excited to read more Greycourt stories. I’m really looking forward to seeing what Ms. Hoyt has in store for readers, especially given the way things ended in this book. So while I may have finished \nNot the Duke’s Darling\n wanting a bit more from Freya and Christopher, I did enjoy it and I think there’s great promise to the Greycourt series.FTC Disclosure: I received this book for free from the publisher in exchange for an honest review. This does not affect my opinion of the book or the content of my review."}, {"Review": "I have some seriously mixed feelings for this book. The story seemed to drag on a bit, which given that there were 2 central plots and a number of sub-plots on going, should have been impossible.The author was trying to lay the foundations of future books in this series which at times felt too convoluted while there were bits in which the story dragged. Overall, I found h to be a more enjoyable and engaging character than the H; in fact all female characters seemed more dominant in the book, from the h to the side characters. They got my focus more than the H did.H, while portrayed as a decent man overall, seemed more beta and easily sidelined. He seemed a sad man, beaten down by life in general. The intimate scenes, for all that they were rather erotic, seemed forced. As in, she seemed to be rather adventurous while he seemed to go along with her. All these sub plots combined to make this book seem unfinished; granted this is a series but I prefer all books in a series to be capable of being independent. These MC's will not be the MC's in any other book so it would have felt better if their story seemed satisfactorily complete. It seemed that the author touched on many important parts, like H's experiences in India, h's family dynamics, etc. but didn't give enough page time to any, which left a slight feeling of frustration; I felt that I scratched the surface of the characters but wasn't able to see inside the h and was not interested in exploring H further. However, I will wait for other books in the series, esp. Messalina Greycourt and the other ladies. They were rather interesting. Actually the camaraderie between the ladies was more relatable to chick lit than historical.Elizabeth Hoyt's trademark light-hearted flirting tenderness between the main characters was missing from this book.So for the h and all future h's in this series, 3 stars. "}, {"Review": "I absolutely love Elizabeth Hoyt’s writing, the proof being that I really don’t care for historical romances, and yet I have devoured every single one of hers, going so far as to chase down out of print copies online, but this latest book, the beginning of a new series, is absolutely fantastic. I think what draws me to her stories is that Ms. Hoyt writes strong, self-assured women in an era where women had very little autonomy over their lives. She writes them beautifully and makes it work.Freya de Moray is a Wise Woman, a title that puts her in danger should it be known due to fears that Wise Women consort with the devil and are therefore witches—and there are still those among the English who believe they should be burned at the stake. But Freya’s identity is not the thrust of this story though it plays heavily in the plot. Instead, it’s her hope to exact revenge upon a duke who, as a young man, was her brother’s close friend. Freya blames him for the beating that left her brother a broken man, maimed for life.But Christopher Renshaw, the Duke of Harlowe, is not exactly the way Freya remembers him, and when the two of them end up at a house party, things do not turn out exactly as Freya had planned. At first, Christopher doesn’t recognize her as the quiet lady’s companion, and Freya has a hard time reconciling the thoughtful duke with the horrible person she wants to remember. When he realizes that someone is stalking Freya, the duke vows to protect her—something he was not able to do for her brother.This book has so many wonderful twists and turns, beautifully developed secondary characters, and a thrilling plot that leads to an absolutely perfect ending. I already know I’m going to enjoy this series—a lot. And the teaser at the end of the book has me waiting impatiently for Messalina’s story.The paperback comes with a bonus book by Grace Burrowes: Patience for Christmas. Again, I’m not usually a fan of historical romance, but this one was just flat out fun, a sexy-sweet romantic tale with really well-developed characters. I thoroughly enjoyed it, and include it in my five star rating for Elizabeth Hoyt’s Not the Duke’s Darling.I definitely recommend both stories for an entertaining, pleasurable read."}, {"Review": "After a fortuitous encounter, Freya de Moray sees the opportunity to get her revenge on Christopher Renshaw, now the Duke of Harlowe. She is to attend a house party at the Lovejoys in her capacity of paid companion and chaperone to Lady Holland and her two daughters, and Christopher will also be there. For the duke, it’s not a pleasurable task: he is being blackmailed and intends to put an end to it at the house party. He hadn’t a clue that the fiery lady’s companion was Freya, his best friend little sister. But that was fifteen years ago, when the Greycourt Tragedy happened.NOT THE DUKE’S DARLING is the first instalment in Elizabeth Hoyt’s eagerly anticipated new Georgian romance series, and it does feel like an introduction to Ms. Hoyt’s new universe. It necessarily establishes the foundation, and judging by the number of characters and subplots, this series could go on for a very, very long time. I found it quite challenging to try to keep up with the numerous characters and to remember who’s what to whom. I kept forgetting who “Jane” was, and I got confused several times with all the gentlemen whose family names all have two syllables as well as the letter “o”. Or maybe I’m the one with a problem! There was so much going on, on so many levels, that I realised around halfway that I had completely forgotten that Freya had a mission for the Wise Women – an ancient feminist secret society of women to help women. There was also another subplot regarding the Wise Women that seemed to have been left dangling, or else it entirely escaped my notice – which I doubt. The revenge/enemies-to-lovers tropes served mostly to bring Christopher and Freya together; I think it could have been dealt with much more swiftly. It seemed their animosity acted as an aphrodisiac, because I couldn’t grasp why they were attracted to each other besides lust which seemed brought about mostly by his “blue”, “cerulean” gaze, and her (too oft-mentioned) “green-gold eyes”. I didn’t particularly like either Christopher or Freya; she seemed little more than a feminist, and he was quite mystifying: was he weak, arrogant, cowardly, fearless, violent? I love strong heroines and beta heroes, but here the balance of power felt odd.Elizabeth Hoyt’s prose flows effortlessly as usual, and her gorgeous descriptions are sparkling and crisp, but I did not find the story as captivating as the beginning suggested, because of all those subplots. While I understood the need to introduce the Greycourts, I’m still wondering if the Holland girls – Regina and Arabella – will figure in future instalments. I must say that Arabella was my favourite character along with Tess, Christopher’s dog – whom we would today call a therapy dog. As I’ve mentioned too many times already, because of the innumerable subplots, I have no idea who the next book will feature.I voluntarily read and reviewed an advanced copy of this book. All thoughts and opinions are my own."}, {"Review": "Un début de série en demi teinte en ce qui me concerne.Par moment, je me suis demandée où était passée Elizabeth Hoyt. On suit les aventures d'une jeune lady en mission pour une société secrète et féministe...Si j'ai aimé l'intrigue, le contexte, je n'ai pas aimée l'héroïne qui a mon sens est caricaturale. On a l'impression que l'auteur colle à un contexte contemporain pour suivre la mode, pour entrer dans le moule \"me too\". Il faut que son héroïne soit forte, indépendante et le revendique. Le seul problème, c'est que parfois, être forte, c'est aussi savoir accepter de l'aide quand on a en a besoin ... parce que non seulement son héroïne en devient agaçante et elle finit surtout comme la demoiselle en détresse. Le plus dommage dans toute cela, c'est que l'auteur sait faire des héroïnes fortes, le genre bambou qui plient mais ne se brisent pas face à des héros hauts en couleur. Elle l'a fait tout au long de sa série \"Maiden lane\".Paradoxalement, face à elle, Elizabeth Hoyt a créé un héros le moins alpha du monde mais pour autant \"parfait\". Christopher est ouvert, compréhensif et totalement d'accord avec l'esprit d'indépendance de Freya. Et je pense que c'est là que se situe le hic. Les vociférations de Freya sont comme des coups d'épées dans l'eau. Toutefois, le roman est agréable à lire, l'intrigue générale de la série se dessine, des personnages intéressants vont apparaître, un grand méchant semble être le marionnettiste. J'attends donc la suite."}], "Genre": "Romance", "ID": "38309947", "Desc": ""}