{"Name": "The Bride of Ivy Green", "Image": "https://images.gr-assets.com/books/1519322313l/33096116.jpg", "Reviews": [{"Review": "It was lovely to visit Ivy Hill again. The second book of the series left relationships unresolved and I really wanted an HEA for more than one character in the series conclusion.While I adore Jane, it was Mercy's story line that pulled me in the most in this third novel. Her cold and rude sister-in-law Helena is one of those characters that was beautifully penned. I didn't like her at all but loved the way Klassen described and used her in the novel.I would have liked a little more page time for Justina and less on newcomer Victorine. Overall, the novel was charming and the ending deeply satisfying.The entire series was a gift for this fan of Regency novels."}, {"Review": "I'm really not much of a series reader, but I love Julie Klassen's writing style. I have loved every minute I have spent in Ivy Hill. The characters and setting are charming. This series is the ultimate comfort reading for me. This entry wrapped everything up nicely. I would love to spend more time with these characters. I'm really sad to see them go. I would recommend this series to lovers of quiet, cozy novels and Regency era fiction. Make sure you start with the first book, The Innkeeper of Ivy Hill.I received a free copy of this book through Netgalley."}, {"Review": "This is a beautiful, satisfying conclusion to the Ivy Hill series, one that I both dreaded ending yet couldn't read fast enough to see what happened to my friends. While I am very attached to Jane and loved seeing her story continue here, I was thrilled to see Mercy, who I consider to be the other main character, get so much page time here. Her story is just so lovely and endearing, and after a lot of heartache, it was good to see her happiness. Although there were a few times that I wondered how it would come about, and it left me wishing more for another character, all in all, Mercy's story culminates in just the way it needs to.Jane's story has several new discoveries that kept it feeling fresh and entertaining. I also appreciated that life's stings are still present, as to make everything work out perfectly would have felt a bit unrealistic. It very much has the feeling of taking the bitter with the sweet and appreciating what you're given.I wasn't quite as enamored as the third story line of Victorine, but in the end, it's neat to see where she fits in and solves a significant mystery that harkens back to the first book. I was pleased - more like thrilled - to find out that there will be a Christmas novella. I know who I'd like it to be about, but of course, will be happy just to be back in Ivy Hill again.I have loved this series and am definitely sad to see its end. I do strongly recommend reading this one from the beginning, as so much builds with each book. It's a series that I could read again one day. Now to begin the long wait until another novel by Julie Klassen.Also, if you need a refresher on the characters, there is a list on the Ivy Hills website."}, {"Review": "I'll post my official review later, but for now, this rant will have to do. :P (There will be no spoilers; I'll just rant without meaning. I realize it's not launched yet.)Now, I hate, hate, HATE those readers who are like, \"I KNOW HOW THE BOOK SHOULD HAVE ENDED AND THE AUTHOR WHO SLAVED ENDLESS HOURS OVER THIS BOOK DOESN'T SO LET ME TELL YOU HOW I HATED THE ENDING.\"I don't want to be that person! And yet the author, to me, left such major things out of the ending, and furthermore wrote the final novel in the series in a way that ... that just ruined the whole thing for me??? So. I guess I'm going to rant EVEN THOUGH I don't think it's my right to do so! And I dislike myself for doing so.Let me explain (without spoilers so vaguely):-BASICALLY, Jane didn't get what I wanted her to. I have specific expectations for Jane, you see. She's, well, she's special to me. And I love her. But everything about her story was anticlimactic. It might have been REALISTIC, yes, but I don't care about that???She has a story that appeals to me and hits on some of my deepest fears (I am mortally afraid that I'll never have children, even though I actually don't have any strong feelings about getting married ... like, I don't want to have kids without getting married, obv., but if I could I would ... kids are the main thing for me, essentially).ANYWAYS ... yeah. I was just dissatisfied with her story. It was boring in this book; not a lot happened that I care about. (Yeah, stuff happened, but I ... didn't care. That was not the \"stuff happening\" that I care about, lolll)-NEXT, Mercy. I actually feel like ... ugh. I know he wasn't good for her, exactly, but ... I wanted her to end up with someone different. I thought she SHOULD fall in love with and marry someone and she didn't. And I hate, hate, HATE that I was bothered by this, but I was, and you know what? I'm going to list it even though, as I said, it is the author's choice not mine ... I just am frustrated. My ship did not sail. I am furious. Also, Alice is my sweetheart, and ... uggghadjfklaj;galksdf. I'm mad. Sorry.-Madame Victorine. Uninteresting sideplot that I cared nothing for. I just ... didn't care? Wanted her to go away? I'm sorry, but I needed more Jane, more Mercy, even more Justina ... and less Victorine. Who, again, I don't care about.-I WAS SO MAD WHEN [THAT COACH DUDE WHOSE NAME I COULDN'T CARE LESS ABOUT] MADE MADAME VICTORINE TELL HIM [SECRET STUFF]. HE HAD NO RIGHT. NOONNNNEEE. He comes running into her life like he OWNS it when she's never seen him before and he's never really met her and just ... ugalkdjg;alkgjasd. I could kill him. If I had been M.Victorine, I would have pulled out my sheers, cut him into a million little pieces, and buried them at every coach stop between here and Yorkshire. I'm serious.NOBODY, and I mean nobody, pries into my business like that! He. Had. No. RIGHT. He doesn't even know her! I am just ... wow. He is awful. I hate his soul. (I can do that since he's fictional.)HER. LIFE. IS. NOT. YOUR. BUSINESS. DUDE. She has every right to lie to everyone in the whole dang universe. SHE DOES. She can lie and lie and lie ... and it is not your business UNLESS she's hurting someone. Her past is not your business. Her name is not your business. What she does is not your business. JUST. BUTT. OUT. MAN.And in the next couple chapters she's (mild spoiler) (view spoiler)[KISSING HIM!?!?!? WHAT THE WHAT THE WHAT THE WHAT!?!?!? They don't even know each other ... and she's like, \"Hey boy you hot let's kiss.\" NO NO NO. The man who just threatened you, who acted like your life was his business??? WHEN HE DOESN'T EVEN KNOW YOU!? I legit had to put down the book and scream into my pillow when he treated you like that ... and then you're making out? WHAT IS HAPPENING HERE?!? I am just so ... ugh... (hide spoiler)] That was just ... horrid to an extreme degree.-Justina. Needed. More. Page. Time. I'm sorry, but she did.That said, there's nothing wrong with this book but the disappointed expectations of a moody teen. :P So ... you will probably adore it. Any sane person would! xP But ... I just ... I can't do that. I'm giving it three stars when it deserves 4 or 5.Ugh, just when I thought I'd thrown out my emotions and replaced them with cogs and wheels ... I should be able to accept it. *smh*This was a well-written book, it was fairly well-structured (with just the M. Victorina/that random coach guy thing making no sense), and like ... kadjl;adjg. I don't know. I just couldn't do it. I couldn't.Another thing: I kind of hated ... what's his face? I've already forgotten. #somememorable The carpenter dude. (view spoiler)[ANY MAN who needs a WOMAN to say, \"I love you\" first is not worth it. Drop him. Drop him like a ... cold potato. :P Just ... everything about him and Mercy's romance was horridly horrid. HE. WAS. NOT. GOING. TO. PROCLAIM. HIMSELF. He was going to leave it to her. Ughljakdf;ja (hide spoiler)]Good things:-I love JD. Just love him. Drake for the win. <3-I love Alice. <3 <3 <3 I want to hug her and wrap her in bubble wrap so nothing can ever hurt her.-Mercy is always cool except she made the wrong choices. #burntheships-Jane my baby. <3 -Actually, Gabriel is like goals. (p.s. I'm still waiting for my handsome horse owner to come sweep me off my feet. *ahem* Okay, not really, I'm not interested now ... but he needs to come around in 5 or so years when I'm old enough and ready for a serious relationship. And be Gabriel Locke.)"}, {"Review": "The third and final installment in the Tales From Ivy Hill bring things to a head for Mercy, Jane, and other residents of Ivy Hill Village. I've been with this story since the beginning and was eager to see how things wrapped up for several favorite characters. So much was going on that it got off to a sluggish start, but by the end I was flipping pages quickly to a satisfying end.The Bride of Ivy Green is the conclusion of a gently-paced ongoing saga that stretched out over three books so it does not make a good place to jump in. I'm pretty sure new readers would be dreadfully lost because a continuing reader like myself struggled at times to remember who was was who and where things were left off with certain plot threads.The focus of the book was on three ladies with a few other side plots as well. Mercy Grove seems to have hit rock bottom, but then a few surprising twists bring interesting prospects for her with a new chance at love and her dreams of teaching. Jane Bell can't let fear and bitterness rule and has to take the gamble of her life while dealing with a bitter past once and for all. A newcomer makes the biggest gamble of all when she sets up a dressmaking shop in the village and fends off questions about her past while desperate to make a go at a new life.This was a bulky story. It had a big job to do wrapping up not one, but a handful of story threads. And, if that wasn't enough, the author introduced a few new ones for good measure. I'm conflicted about this. I loved those new threads- the surprise from Jane's past and the new mysterious dressmaker and her past ties to Ivy Hill life. The side romance for the losing rival to Rachel's affections from the last book and James Drake's family. That said, I wish there had been a fourth book. There was so much going on in this one that its pace was ponderous at times and all the viewpoint shifts leaving off one thread to pick up another could get distracting. A few spots felt under-developed as a result. Nothing about the book felt into dislike for me whether characters or their stories.I don't wish to give the impression that I didn't enjoy this book. I did and was deeply vested in the outcome for all my favorite Ivy Hill residents and the new ones. I confess that I've been impatient with Jane over Gabriel for some time so I was glad circumstances pushed her along and got her off the fence in spite of her fear. I found the confrontation Jane finally had to have with her past was an interesting and realistic layer to add to her life. Mercy's situation was rather complicated and I felt so badly for her. She gives up her school and refuses probably her last big opportunity to marry well in her parents' eyes because she couldn't countenance a marriage of convenience. She is choosing the life of a poor, spinster sister living in her brother's home and at the mercy of his social-climbing, avaricious wife who makes it difficult for Mercy and Aunt Matty so they are not welcome in their own home (ala Fanny Dashwood of Jane Austen's Sense & Sensibility). She wants to marry for love, but the man she is interested in has given her no sign and seems to put her on a pedestal out of his own reach because she is scholarly and he works with his hands. I happily appreciated seeing couples I was rooting for find their way to happiness.But, this wasn't just a good historical romance. This book also addresses historical stigmas about illegitimacy, class differences, and views on mixed marriages which I enjoyed seeing teased out in thought-provoking ways. Then, there is the religious themes running through the book of God's goodness through times of trial, people who made mistakes and seek forgiveness, and people overcoming their pasts and changing for the better.All in all, it was a satisfying- if bulky- wrap up to a great series. I can see where there is room left for more at a future date while still bringing all major storylines to a fabulous finish. I am sad to be leaving Ivy Hill for the last time and loved how the author made me fall in love with the setting and people there. Fans of sweet historical romance and inspirational romances should definitely give this series a try.I rec'd this book from Net Galley to read in exchange for an honest review."}, {"Review": " Much has happened in idyllic Ivy Hill in recent months, and while several villagers have found new love and purpose, questions remain--and a few dearly held dreams have yet to be fulfilled. This is the last book in the Tales From Ivy Hill trilogy and I was looking forward to reading it all year. I didn't like this one quite as much as the two previous books in the trilogy. It seemed like there was less time spent on each character which was probably due to the fact that there were so many to cover in this book. I still enjoyed reading about them all though, especially Mercy and Jane. I think the real drawback of this book was that everything was tied up too neatly for me. It would have been more relatable if some characters would have been allowed to not have a happily ever after. One thing I really enjoyed was the author's note at the end of the book where she reveals that the inspiration for Ivy Hill was the town of Lacock in England. It was nice to read her perspective of the town and look at her photos (you can find them  here) since I had also been there and loved it. I'll miss this series a lot, but I'm looking forward to reading whatever Julie Klassen writes next.Thanks to NetGalley and Bethany House Publishers for providing me with a copy of this book in exchange for an review. Review also posted at Writings of a Reader"}, {"Review": "This entire series moved at a very gentle pace, sometimes a little too gentle. But at the same time, each book was filled with many varied story threads, all woven together seamlessly. There's drama, intrigue, and excitement, but it's always very genteel and elegant, just like the era in which it is set. If I had any complaint, it would be that I would really like to have a little more insight into the individuals' thoughts and emotions. The books are written with a sense of detachment that keeps you at a distance from the characters. I suppose even that helps to set the scene, but there were times I would loved a more intimate look into certain characters' lives."}, {"Review": "'Mercy reminded herself that God did not promise ease and happiness in this life. But He did promise peace and joy, and she was determined to hold on to both, somehow.'I have sincerely looked forward to Julie Klassen's final of her Tales from Ivy Hill series. I certainly have thoroughly enjoyed reading each book. In fact, I have read all her books, not just this series, and have never been disappointed in one of them.Mercy Grove has lost her precious girls' school and has simply resigned herself to life as a spinster dependent on the kindnesses of her family. When her brother returns to Ivy Cottage with his new wife, things just don't seem like they will guarantee a pleasant future. And Jane Bell is also facing some challenges in her own life. Can she give up her inn if it means marrying Gabriel Locke? Can she doom him to a childless marriage? In the midst of all this, a new seamstress comes to town and all it not as it seems with this lady. Surprises lie in store for many here and dreams are on their way to coming true. I laughed and wept during the reading of this book. Julie Klassen has brought this series to an end in a most admirable, satisfying and delightful way. I enjoyed it tremendously. Highly recommended.*My thanks to Bethany House and the author for a copy of this book. All opinions stated are entirely my own."}, {"Review": "I am a frazzled mess of euphoric bliss and abject misery because, while this was a spectacular conclusion to the Tales of Ivy Hill series, it is also the last book! Gulp. Ever. Like in never getting to armchair travel there again. And though this delectable, multi-romanced story charmed me into a flummox of heart-palpitating delight there's a niggling pain deep down inside my heart because it's really and truly over! Forever! Did I say that already? Sorry. I'm truly gutted...in a way that only true literary aficionados who have been forcibly ejected out of a fictional setting can understand.I love Ivy Hill! I love all the villagers and especially the businesswomen who pull together and support one another no matter what the need! They came together magnificently in this last (sob) installment. And this book does read like an installment -- or third season in a spectacular BBC period drama. Think Cranford or Larkrise to Candleford. Because of that, I think it's best to read this series in order. You'll miss out on so many nuances in relationships and plot if you don't...and, honestly, why would you want to deprive yourself of starting at the very beginning anyway?There is so much romance in this book that I'm still all aflutter. From married couples to courting couples to desperate-longing-but-slow-to-act-on-it couples, to the sweet-fresh-beginnings couples. Oh, this reader's anguish over the wicked twists and turns to their happily ever afters! Sensitive readers might require smelling salts and copious amount of chocolate to make their way safely through to the end.A stunning conclusion to an exceptional series and I guarantee I'll reread it more than once over the coming years because I don't think I can go Ivy Hilless for very long!"}, {"Review": "This was a beautiful conclusion to this beautiful series :) Jane, Mercy, Rachel, and their families and friends have a special place in my heart now along with many more of Julie Klassen's characters. This volume brought Mercy's story particularly into focus and I loved it! What a character she is. Everyone needs a Mercy in their life! I wouldn't mind a Joseph Kingsley either, to be honest. That said, I wanted more on Mercy and Joseph in this one. I also would have loved more of Jane and Gabriel, Justina and Nicholas, Rachel and Timothy, and the other already-established characters. I enjoyed the introduction of Eva and the subsequent traveling circus troupe plot, but I think I would have liked the book more if this last book had focused more on fully developing and closing out the storylines of existing characters rather than bringing in as many new storylines as it did. Even so, this was a delight to read, as I've come to expect of Julie Klassen. I anticipate her next books eagerly, as usual!"}, {"Review": "The Bride of Ivy Green by Julie Klassen takes us back to February 1821 in Ivy Hill, Wiltshire, England. Mercy Grove and her aunt, Matilda are preparing for the arrival of hew newly married brother, George and his society bride, Helena. Mercy was forced to close her school and have the lending library move to a new location in anticipation of the new occupants. She misses Alice who she wished to adopt until her biological father and hotelier, James Drake arrived on the scene. When Helena makes living in the home uncomfortable, Mercy contemplates becoming a governess. Jane Bell has a big decision to make. Gabriel Locke has proposed to Jane and, while she loves him, it would mean giving up her inn. Plus, she is unable to have children and Jane does not want Gabriel to make such a sacrifice. Then someone Jane never expected to see again returns to Ivy Hill. The dressmakers shop is let by a new woman to town who answers to the name of Madame Victorine. She doesn’t share many details of her past and Jane feels she looks familiar. Victorine has beautiful dresses on display, but her sewing skills are not on the same caliber. Will the Ladies Tea and Knitting Society help Victorine or help her new venture fail? Justine, Lady Brockwell, has a matchmaking mother who is intent on her daughter marrying well. Justine’s mother has her sights set on Sir Cyril, but Justine has eyes for a local gentleman. Will Justine give into pressure from her demanding mother? Wedding bells are ringing, but which woman in Ivy Hill will be walking down the aisle? I have enjoyed my visits to Ivy Hill with Tales from Ivy Hill series. I could not wait to get ahold of The Bride of Ivy Green to see what would happen with Mercy, Jane, Matty, and Justine. I was especially looking forward to Mercy’s story because I wanted her to get a happy ending. Tales from Ivy Hill is one series that you need to read in order. Each book in the series builds upon the previous one. The Bride of Ivy Green is a well-written story with a leisurely pace (sometimes a little too leisurely). The setting is quaint with cozy shops and lovely homes (I picture stone homes with thatched roofs). The characters are developed, and their personalities suit the time period. They are all genteel and refined ladies with good manners. I like that the women are close friends who look out for each other. All the characters are friendly and likeable except Helena, George’s wife. Her coldness and arrogance plus her indifference to Mercy’s feelings perfectly suit this unlikeable character. I did not understand why the author decided to introduce Victorine to the story (it seemed too late in the series for this addition). That time could have devoted to Justine’s or Matty’s story. While the storylines did not play out how I would have liked them to (we all have expectations), I was happy with the outcome. Julie Klassen captured the time period with the clothing, books, pastimes, and attitudes. I am giving The Bride of Ivy Green 4 out of 5 stars (I liked it). The Bride of Ivy Green is a satisfying conclusion to the Tales of Ivy Hill series. I will miss visiting Ivy Hill and the charming ladies who inhabit it. "}, {"Review": "First sentence: Mercy Grove could no longer put off the painful task.If you enjoyed The Innkeeper of Ivy Hill and The Ladies of Ivy Cottage, you are definitely going to read the third book in the series, The Bride of ivy Green. The only complaint I have is that I think it should have been called the BRIDES of Ivy Hill instead.This historical romance series by Julie Klassen is set in a small English village, Ivy Hill. The series follows the romantic adventures and misadventures of three women primarily: Jane, Rachel, and Mercy. Though really a dozen more characters are introduced and followed. One really gets a sense of time and place. (I believe this one is set in 1821; the others might be set a year or two earlier. The county is Wiltshire.)Mercy Grove, the heroine, is a school teacher, or WAS a school teacher. Her brother returning with a wife has closed down--at least temporarily--her dreams and her means of independence. (The school was in her home.) She remains in his house, but make no mistake, she feels it is HIS house now. Her new sister-in-law soon has her living in the attic so that her former room can be a guest room. Mercy feels trapped--not trapped enough to regret turning down a loveless marriage offer--but trapped. So when Mr. James Drake mentions he's looking for a governess for his daughter, Alice, she volunteers for the job. (Alice was a former pupil, a beloved former pupil.)Mercy, of course, is not the only woman adapting to big changes. Other women are as well. Rachel is loving getting to know her new sister-in-law, Justina. But her need to advocate for her may cause tension in her relationship with her mother-in-law. Justina is falling for someone....and her mother already has definite opinions on whom her daughter should marry. Jane is oh-so-close to getting her happily ever after. But someone from her past shows up, and difficult conversations must be had before she can be at peace with where she is in her life. There is also the matter of the brand new seamstress in town....there is something OFF about her. But what?!I love, love, love this series. There is something COZY about this series. It is definitely character-driven. Don't expect much action or drama."}, {"Review": "At last, all the heroines of Ivy Hill finally attain their dreams, whether having old dreams rebuilt or new ones developed (sometimes in ways I didn't expect). In the first two books it felt like more was at stake, but this one provides the satisfying conclusion to the series that I've been waiting for. (But if you haven't read the first two, I can't imagine this one would be nearly so enjoyable for you, so be sure to read them first!)I have felt from the beginning of the series that there were too many eligible bachelors to find happiness with the number of heroines in Ivy Hill--uneven numbers, as it were--and, sadly, one of my favorites has yet to be lucky in love. But even in my disappointment over his love life, I do think he's not heart-broken either, having found satisfying love of a different sort than romantic. So at the same time I'm disappointed for him, but also rather happy with the way the author ended the story for him. Who knows--maybe he'll get his own book someday (that's my hope!). I enjoyed the new intersections in the lives of the residents of the village, whether by the introduction of new characters like Victorine, or new connections among old. There also were some brief visitors to the village I didn't expect (yes, I recognized that dance master and his pretty wife). The series would make a great television mini series!Thank you Bethany House and NetGalley for the complimentary e-book. I was not required to write a positive review, and all opinions are my own."}, {"Review": "Conclusion to the Tales of Ivy Green Series. This book brings a full contented wrap of the lives of three friends Jane, Rachel & Mercy. Each book has developed a little deeper and brought many characters into the mix. The entire village plays a part - and this unite clearly is written as if you could imagine any TV period drama series would play out. As expected there are diversions along the way for each of the main characters, enough to pad out this series. I would have preferred to read each of this directly in succession - reading over a hundred books in between them means recalling details as intricately as they are shared in this series is hard. I was at least 30% of the way through before I knew what was going on and who was who. I didn’t enjoy this as much as I did book 2, though the series definitely improved as time went on. For those that haven’t read this series at all yet, you are lucky. You’ll be able to take on the 3 one after another. I have visited Lacock - in which Julie Klassen based this location on. Gorgeous village for sure and so picturesque. Thanks to Netgalley & Bethany House for the eARC. This is my honest review."}, {"Review": " With Julie Klassen's final book in her Tales from Ivy Hill series, The Bride of Ivy Green, the reader is taken back to the familiar roads, homes, and citizens of this little town outside London. With enduring characters and a lovely storyline, the plot enraptured my attention and kept me glued to the page. Klassen knows how to capture an audience with her attention to detail. Familiar characters from the first two books return, and readers should be excited to see how they have been since the previous two books. With the romances all tying up by the end of this novel, this makes for an unforgettable conclusion to the series.I received a complimentary copy of The Bride of Ivy Green by Julie Klassen from Bethany House Publishers, but the opinions stated are all my own"}, {"Review": "In this final volume of the Tales from Ivy Hill, spinster Mercy Grove is feeling pushed out of her beloved home by her new sister-in-law. She takes a position as a governess, though that is a step down for her, but soon finds herself pursued by two men. Meanwhile, Jane Bell still struggles with her fears about marriage, and a newcomer to town attempts to hide from her past in order to make a fresh start.I’ve enjoyed this well-written inspirational series. Klassen’s characters may occasionally express rather modern sentiments, but this tendency is not as egregious as I’ve seen in books by other authors. Klassen also manages to keep me guessing about certain plot twists. If you enjoy historical inspirationals, I recommend this series (start at the beginning, of course)."}, {"Review": "The Bride of Ivy Green is the delightful conclusion to Julie Klassen's Ivy Green trilogy. I enjoyed revisiting Ivy Green and catching up with lives of everyone there. With some new faces amongst the villagers, there is always something new going on. With several people of courting age who is going to be the bride? Ms. Klassen has created an enjoyable cast of characters that have grown throughout her trilogy. I would not mind seeing a fourth book...hint. LOL. So settle in at The Bell and have a mug of tea while you catch up on all the gossip from Ivy Green!I was given a copy of this book by NetGalley.com with no expectations. All thoughts are my own."}, {"Review": "What a satisfying concluding to the Tales from Ivy Hill series by Klassen.It was so fun to return to Ivy Hill and reconnect with some of my favorite characters of all time. I was slightly concerened that they might grow dull during a third story of their lives, but Klassen deftly weaves an enchanting and irresistible story. Themes of identity, grace, and dreams left unrealized are threaded throughout and the characters are just as deep, rich, and flawed as ever. The new characters are enticing and mysterious.Full of faith, love, and a bit of whimsy, Klassen has crafted a masterful conclusion to this incredible series. I highly recommend."}, {"Review": "This last entry in the Ivy Hill trilogy was a sweet and gently told finale to the series, wrapping up loose ends in a satisfying manner. My only regret was the introduction of several new characters without really giving them any depth, due to lack of space and time. I would have much preferred seeing them appear in the previous book and then expanded in this one. That said, Julie Klassen always writes an interesting and heartwarming tale, giving a clear picture of life in a small village circa 1820. "}, {"Review": "I am so happy that I discovered this delightful trilogy this year. This book was a nice conclusion to the characters that I have come to enjoy. This book follows Mercy who is having to decide what she is going to do after her beloved school at Ivy Cottage is closed and her brother George with his wife come to live there. I really enjoyed Mercy in this book and was happy to go on her journey. For me though this book was not as strong as the first book and wasn't as charming as I was hoping. I agree with what others have said, that the new character wasn't needed. I felt that the time spent on the new dressmakers storyline could have been focusing on other residents of Ivy Hill that we had already known. "}, {"Review": "The Bride of Ivy Green is the third book in the Tales From Ivy Hill series written by award-winning author, Julie Klassen. I would strongly recommend reading the first two books in this series before reading the third as The Bride of Ivy Green is a continuation of the story told in books one and two. I love that Julie Klassen writes in the Regency time period, her stories often contain a bit of mystery, and they have strong, capable women as heroines. I usually find myself never wanting her books to end, so I was very excited when a three book series was announced. That being said, my reaction to this book was a little out of the ordinary. I feel like this series would have been more enjoyable as a two book series because elements of this story didn't really capture my interest. I found myself reading over these parts quickly to just \"get on with it\". I wasn't a fan of the new dress maker, the menagerie or mystery surrounding her. I did really enjoy Justina's story and wished Julie had elaborated on it. I also wished the \"bride of Ivy Green\"s (I'm not going to identify the bride) story had more romantic elements. But maybe that was intentional and added to the mystery...would she marry? who would propose? On the whole I still enjoyed the book, I just didn't find it to be the usually Julie Klassen, can't put it down, read all night, type page turner. If you find yourself longing to live in a small idyllic English town in the country then you should travel through the pages of Ivy Hill.If you'd like to \"visit\" the village of Ivy Hill, you can go to www.TalesFromIvyHill.com, where there is a colorful village map, character list, photos, excerpts videos and more.The Bride of Ivy Green will be available for purchase from your local or online book retailer December 4, 2018.Thank you, Bethany House and Net Galley, for the free e-copy of The Bride of Ivy Green. The opinions expressed here are my own."}, {"Review": "Each time I savor a book by Julie Klassen I place her in the same league as the classic greats...Jane Austen, Charlotte Bronte, and Victoria Holt. The Bride of Ivy Green (Tales From Ivy Hill Book 3) is no exception—set during the Regency era in an idyllic, picturesque, and quaint English village. The gothic vibe that Ms. Klassen is so well known for is not as prevalent in this particular series, but the angsty romance certainly is! Just a hint of secrecy involving an enigmatic dressmaker adds to the mystery of this memorable novel with its charming cast of characters. I recommend reading this series in succession to become better acquainted with each one. I'm quite certain you'll become as completely immersed in their dramatic lives as I was...deeply dreading the moment I must let them depart. One of my fave reads of 2018! I was sent a complimentary copy of this novel from Bethany House and was not required to write a review. All opinions expressed are my own."}, {"Review": "The Tales From Ivy Hill series concludes with this new release from Julie Klassen. Once upon a time we met Jane, a young widow who was stepping up to the challenge of being an innkeeper, and Mercy, a schoolteacher whose life took an unexpected turn. Will Jane and Mercy both find the happy endings their hearts long for?Still trying to deal with her body's limitations, Jane hesitates to accept the offer of marriage that has been given to her. With the unexpected arrival of someone from her past, Jane ponders if it will change her future.Now in reduced circumstances, Mercy considers becoming a governess in order to find a measure of freedom. She pines for the man who has caught her heart, but meanwhile she's caught the eye of a man who could give her every comfort.Alongside the other Ivy Hill residents we've come to know and love, a new seamstress comes to town with the hope of making a fresh start. Her mysterious background becomes a source of much curiosity, and it turns out she may have more ties to the village than she even knows.A wonderful wrap-up to a delightful series, The Bride of Ivy Green had me laughing, cheering, and crying by turns. If you enjoy stories reminiscent of Jane Austen or Elizabeth Gaskell, you'll want to add these to your reading list.I received my copy of the book from the publisher. All thoughts in this review are my own.This review originated at http://reviewsbyerin.dreamwidth.org"}, {"Review": "I've said this before, but it bears repeating: the Tales from Ivy Hill series is perfect for fans of gentle period pieces like Cranford and Lark Rise to Candleford. This series, which focuses on several woman living in Ivy Hill, is sweet, gentle, and completely addicting.The Bride of Ivy Green is the third and final book in the series (and you really do need to read the series in order, as each novel builds on the last). It's told from the perspectives of four women: Mercy Grove, whose life is turned upside-down by the arrival of her brother and his wife (think Austen's John & Fanny Dashwood from Sense & Sensibility); Jane Bell, owner of The Bell Inn, who is in love with Gabriel Locke but not sure if she is strong enough for another marriage; Rachel, Lady Brockwell after finally marrying Sir Timothy, who is now intent on seeing her sister-in-law Justina marry for love, not duty; and newcomer Victorine, the dressmaker with a mysterious past who opens a shop in Ivy Hill.The women experience unexpected joys and sorrows as they continue living their lives in Ivy Hill. Of all the stories, Mercy's was the one that most interested me; she broke off a relationship in the second book and seemed to be building something with Joseph Kingsley, though he considered himself to be below her station. But then another suitor entered the mix, once who could give Mercy's nearly all of her dreams. The trajectory of Mercy's life drastically changed throughout the novel, and I loved watching her navigate everything.I also enjoyed continuing Jane's story, and I loved how Mercy's Aunt Matty's life intertwined with Jane's in an unexpected way.The one aspect I didn't totally love about this novel was Victorine. She was fine, but her story didn't interest me nearly as much as Justina's story did, yet Victorine got much more page time.Overall, this is a wonderful conclusion to the series; while \"Happily Ever Afters\" abound, not every story is tied up with a neat bow, and I appreciated that real-life feeling. Honestly, I'm a little bit jealous of readers who haven't begun the series yet, as I think reading the three novels back-to-back would be an even more enjoyable experience! 4-1/2 stars.Note: If you've read Klassen's The Dancing Master, look for a fun cameo by Alec and Julia!Disclosure of material connection: I received this book from the author and publisher. I was not required to write a positive review, and the opinions expressed are my own."}, {"Review": "\n*** VILLAGE LIFE REMINISCENT OF LARK RISE TO CANDLEFORD***\nIf you have ever watched the BBC series Lark Rise to Candleford, these books very much remind me of that TV show, with its many different characters, points of view, and various village locations.Ivy Hill, Wiltshire, England, Feb 1821.The third installment of Tales from Ivy Cottage finds spinster Mercy Grove and her Aunt Matilda preparing for the arrival of her brother George and his new wife to return from their wedding trip and move into their home, effectively taking over the cottage. She has already closed her school and her future seems uncertain. Her new sister-in-law seems bothered at moving into an already occupied home and her disposition is rather cool toward the lower class villagers. There are returning characters from the past two books; Jane Fairmont again taking a lead role in the story. There are new characters whose past is a secretive mystery, but nothing of danger or intrigue.As in the previous two novels, there is quite a lot to keep up with as this book has over 50 chapters.If you enjoy quaint village life along with a nod to the hierarchy of the social classes, I would recommend reading all three of the books back to back. Otherwise, it is a bit hard to recall the many storylines. The author provides many interesting tidbits found on www.TalesFromIvyhill.com including a character directory (although book 3 is not as well represented on that list), a map of the village, some of her travels to Wiltshire, etc. \nFavorite Quote: \nMercy reminded herself that God did not promise ease and happiness in this life. But He did promise peace and joy, and she was determined to hold on to both, somehow.\nTea Quote:\n “I have a family obligation tonight, but I might wander back here tomorrow evening f you think you might be having a late-night cup of tea?” She grinned. “Yes, I think there is every chance I shall be thirsty by then.”Bethany House PublishingDiscussion questions at the end of each bookTales from Ivy Hill Series:The Innkeeper of Ivy Hill – Book 1, Dec 2016The Ladies of Ivy Cottage – Book 2, Dec 2017The Bride of Ivy Green – Book 3, Dec 2018I received an ARC of this books in exchange for my honest opinion with no further compensation."}, {"Review": "Title: The Bride Of Ivy GreenAuthor: Julie KlassenGenre: Christian, Historical Fiction, Romance, Series, Regency EnglandPlot: Mercy Groove has closed down her precious little school and anxiously awaits the arrival of her brother and his new wife from their honeymoon. Life soon settles into a new uncomfortable groove for them and Mercy decides to take the only option left open for her. So she moves to Fairmount House with Mr. Drake and his newly discovered little daughter as the governess. This position puts her closer to her handsome carpenter crush. Sadly, he doesn't seem to have much time for her right now and Mr. Drake does.Meanwhile, Jane is torn between the man she loves and the inn she rebuilt and depends upon. But when a tragic accident occurs, Jane must make her decision before she waits too long and misses her one chance at happiness again.With so much life crammed into one small village, not many secrets are left to spill. But one newcomer might just change all of that. The conclusion to the many intertwined adventures in Ivy Hill will have readers swooning.Likes/Dislikes: I loved this book! It was so good to be back in Ivy Hill and I really hope more books set here will be forthcoming. I loved having Mercy as the main character more so than Rachel this time, and so pleased with her happy-ending. Jane was a touch annoying to me; she procrastinates her decision and then changes her mind so fast I'm surprised she didn't give everyone whiplash. Thankfully (as with all clever writings), her story ends beautifully. I liked Victorine but was confused by her arrival in the beginning and didn't care for the circus tie-in. I hate circus stories. All in all, a wonderful story!Rating: PG-14 and up, mainly for reading level and content (some veiled discussion of pregnancy, miscarriages and a brutal assault on a minor character several years ago in the story's history but nothing graphic).Date Review Written: December 22nd, 2018I received a copy of this book courtesy of NetGalley and I wasn't required to write a positive review. The opinions expressed in the above review are my own."}], "Genre": "Romance", "ID": "33096116", "Desc": ""}