{"Name": "Accidental Romeo: A Marriage Mistake Romance", "Image": "https://images.gr-assets.com/books/1545857770l/43365894.jpg", "Reviews": [{"Review": "It's here in all its mistaken love goodness! Accidental Romeo is LIVE! I hope all of my Goodreads fans adore Wendy and Hunter's story as much as I loved telling it.Get your copy below! FREE in Kindle Unlimited.➜ AMAZON US: https://amzn.to/2R1e4N7➜ AMAZON UK: https://amzn.to/2GS6tf0Accidentally his. Fun fact: Fate is a four letter word.A perfect stranger just kissed away the worst day of my life.Emphasis on perfect.Hunter Forsythe is so far out of my league I can't even buy tickets.And now he's insta-date to my stuck up sister's wedding?!Brace for everything to go hilariously wrong.But my mysterious new hero is no flipping joke.Rich as sin. Knockout eyes. A snarlypants single dad. Muscle, muscle everywhere.Too good for the quiet baker girl no one ever noticed.Then I find out what – and who – put him up to this insanity.I'm so mad I could spit nails.Imagine my surprise when Romeo keeps coming.Hear my door slamming in his face.Witness my jaw hanging when he starts wooing me for real.Dream dates, family dinners, and soul-branding nights.I'm in full Juliet mode before I see the crack in his world.The longing. The loss. The secrets. The danger.Does love even fit in Hunter's jagged heart?Or is a Shakespearean tragedy in our stars?From Wall Street Journal bestselling author Nicole Snow – a tale of pretend love turned way too real. See the sparks fly when tight wound alpha protector gets a taste of his ultimate Sugar and Spice. Full length romance novel with a Happily Ever After roller coaster!"}, {"Review": "Accidental Romeo by Nicole Snow a five-star read that you won’t want to accidently miss. This was another amazing story by this great author, I adored getting to know Hunter Forsythe and Ben they will make your heart melt and you eyes sparkle. This was so well written you will have the rug pulled from under you as you read and not see it coming. There is a bit of everything in this story, romance, drama, good food, a bridezilla with a fabulous wedding, and a date that will wow even if its maybe for all the wrong reasons. I don’t want to go into too much detail, but I will just say that you need this one in your life. Its possibly my favourite by this author and I adored the cameo from a romance author I wish was real. "}, {"Review": "Who knew almost running over a fleeing teenager would net Wendy the love of her life? The LOVES of her life?Wendy is the best baker in town. Her sculpted cakes are in high demand, and as such, her life is non-stop work. Outside of her cake-making prowess, though, no one ever notices her. And she's fine with that. Is she really, though? When Ben's (said teenager) dad tries to make up for the damage his son did to Wendy's delivery van, she puts him off. Hunter's not all that thrilled with, or used to, someone so thoroughly ignoring him, and he doesn't like it. He wants the beautiful, sassy baker to notice him the way he notices her. Thank God for her mother's insane idea because it brings Wendy into his life in a surefire way that she can't possibly say no to.I fell in love with Hunter and Ben and Wendy just like they did with each other. This is most definitely my favorite story of this author's, by far. It's steamy, the character and relationship development is superb, and there's a bit of suspense, too. You can't possibly ask for more in a good, no, GREAT, romance.ARC via Booksprout for an honest review.Full review posted on Live Through Books Blog."}, {"Review": "I was given an advanced readers copy of this book and have decided to leave a voluntary honest review. I have read a few books by this author lately, and I have to say this author surpises me more and more. I love getting glimpse of Landon in all these books so far. As you can tell he's my favourite and now I just love hunter. Man is he ever a sexy beast, and a sexy single dad. Damn I don't know how he get better. Wendy is fire ball who I absolutely love. She's such a good person with a kind heart. I just loved this book. I'm hoping Ben when hes a bit older will get his own book."}, {"Review": "Accidental Romeo stole more than just my breath. It stole my heart and my very soul. Nicole Snow knows how to gently coax and relentlessly tease until I am putty in her hands. This magnificent story is one of her best ever! It shines brightly and transcends life no matter what is happening. Not only does it soothe and calm a frantic and raging heart, but it also searches until it finds the smile and happiness that has been impossibly weighed down by daily life. This book is utter perfection that everyone absolutely NEEDS to read!!Wendy understands and accepts the reality that is her life. She doesn’t like it, but she knows it’s all she has. To her utter amazement and disbelief her life changes in an instant. When instinct pushes her to protect at all costs in a dire situation, she finds that listening to her heart leads to the most unexpected and wonderful changes. Changes her mind doesn’t know how to process or accept. Hunter has been raising his son by himself, but he know in the depths of his heart that something is missing. Something very important and absolutely vital. Except he has no idea what that is until the day his path collides with Wendy. He can’t wrap his mind around this woman who is all sugar and spice at the same time. She turns his world upside down and makes him see things so very differently. This new perspective has him contemplating his life in a whole new light. When unknown danger and deadly deception threatens to come between them, will Wendy choose to hold tight to the gift bestowed on her by Fate itself, or will she return it knowing she can never life up to its value and worth?Hunter is a genuine and loving father who melted my heart right away. He wants nothing but the best for his son, and that journey is one fraught with changes and new rules almost every day. Once Wendy came on the scene and I saw how empty and endless her life seemed, I knew that these two were perfect each other. They are simply two beautiful people walking through life as best they could dealing with the cards dealt to them. Life isn’t easy for either of them, but together they find a blessed heaven and a long awaited shelter against the storms of life. They bring the other more hope, life, and love then either dared to hope for. This story broke my heart and then rebuilt it lovingly, confidently, and joyfully. I am blessed beyond measure to be able to experience and savor this extraordinary masterpiece!Nicole Snow is a literary goddess! She is a true master of words, but more importantly she is a true master of the human heart. Her stories capture your heart with little effort, give you a temporary shelter from the harsh reality of life, and instill in your very soul a much needed grain of hope that begins to take root and grow. I always walk away changed from her beautiful books. They live on in my heart and give my soul a new song to sing."}, {"Review": "Hunter is a swoon-worthy dream come true! Like Wendy, I found it impossible not to fall in love with Hunter and his young son, Ben. Hunter doesn't even realize how much trauma he's still carrying around from the tragedy that happened more than a decade before, but Wendy is the much-needed breath of fresh air that shakes all the cobwebs loose and lets the light in through all the cracks in Hunter's life. Wendy is the beleaguered youngest daughter in a family that refuses to believe she could meet even their lowest expectations. Despite the constant criticism, though, she has made a name for herself as a world-class pastry chef and is more than fearless enough to stand up to Hunter and let him know exactly what he's doing wrong with Ben. After her family sets her up with him for her older sister's upcoming wedding, she finds that there's more to Hunter than meets the eye and their unconventional relationship starts to take root.There's more humor and less life-threatening drama in this book than in the author's other recent works, though there certainly is a villain and justice is found in the end. It's rare to see a villain so successfully portrayed as a wolf in sheep's clothing. The tragic history storyline played out just as expected, yet it was still satisfying and triumphant. The entire wedding scene alternated between emotional interplay that made me breathless and situational humor that had me laughing so hard I cried. By the end of the sister's wedding, everyone - this reader included - was irrevocably in love with Hunter. By the end of the story, Hunter's entire life has been rewritten and his soul healed by the freedom found in the truth and by the patient love he found with Wendy. I loved every bit of this book and devoured it in one sitting. I voluntarily reviewed an ARC of this book."}, {"Review": "I voluntarily reviewed an advanced reader copy of this book.Wendy's older sister Rochelle is getting married and once again, Wendy is dateless. Wendy doesn't have a problem with it but her mother and sister do. Rochelle has always held the princess title in the family and this wedding is no different. Everything has to be perfect and Wendy is expected to attend, preferably with a date. It all comes down to this, not the fact Wendy is a masterful baker who has studied with the best and will someday run the family coffee shop and bakery, Midnight Morning. No, poor Wendy. No boyfriend. All alone. Well, not for long. A run in with a fourteen year old boy leads to meeting his father, Hunter. No father ever looked like this guy. Tall, dark and handsome with the most gorgeous, mesmerizing blue eyes. After some convincing, Wendy soon finds herself at her sister's wedding with Hunter as her date. They have fun together, laughing, flirting and they end up spending an unforgettable night together. Wendy is everything Hunter has ever dreamed of in a woman. She's smart, kind and caring. Wendy is not convinced. Hunter is super rich and can have any woman he wants. He's so far out of her league, it's not even funny. Hunter has a teenage son that needs his full attention and that is his number one priority. There's really no room for romance or relationships in his life at this time, no matter how much he wishes things were different.This was unlike any Pretend Boyfriend/Date for Hire book I've ever read. I LOVED the inner dialogue of both Hunter and Wendy. SECRETS from the past that come back to haunt, are just some of the UNEXPECTED TWISTS in this story. RELENTLESS PURSUIT WITH TOTAL SURRENDER🔥, NOT JUST PHYSICAL BUT EMOTIONAL ! 💕 There's so much more I want to say, but you really need to read this book, YOU WILL LOVE IT ! AMAZING FROM START TO FINISH ! ! !"}, {"Review": "What a great read !!! I laugh-out-loud so many times,i suffered for them,i shouted-out-loud YESSS and NOOO so many times that my neighbour came knocking on my door asking if I was all right :)))Can something go more wrong in ones life then having to bake the wedding cake for your best highschool friends that got together because he dumped you ? For our heroine that's what happening,her day got worse as while delivering the said cake,she has a run with a teenage skater and the worst is that she has to go back and bake another cake in only few hours so she can keep her business reviews and clients as she is always on time with all her commitments. Her jaw drops as she get to see who the father of the poor teenager is ,build like a tank, gorgeous like a god and rich like no one she has ever met. Despite all of it ,she stands her ground and don't get all in a puddle swooning for him as he may expect.There are so many things happening in this story that you don't want to give up reading even if it's 3 am and you can barely keep your eyes opened.There's a bit of everything,i love the writing style,i love how the characters grow with every new action taken,with every gesture and though ,the dialog between any of the characters make you feel like you are there,with them and want to intervein in their discussions or arguments or even slap them sometimes for being crazy or stupid for their decisions ,but nevertheless a great story. Ilove the attraction, the chemistry, the wooing ,both their insecurities and inner thoughts, the scenes in the bedroom and outside are hot,very hot.Go get this book because you won't regret it."}, {"Review": "This is the second romance book in a row that I've read that is just WAY. TOO. LONG. Romance books don't need to be 440 pages long. Or 340 pages. While I liked this book, I found myself getting bored at the length of it many times.Wendy is a baker at her parents bakery, and has always played second fiddle to her older sister, Rochelle (who is honestly one of the worst characters I've read in a long time). Wendy is delivering a cake and almost hits a young boy with her car when he's skateboarding. She then meets his father, Hunter, and thus begins a bizarre set of occurrences.Wendy needs a date to her sisters wedding, so her parents arrange to have Hunter take her in exchange for giving his son, Ben, a job. This part is bad enough. I didn't care at all for the storyline regarding Wendy's sister. The fact that they grew up in a bakery and her sister became a money hungry bitch felt unrealistic to me. She was a a very awful character. Hunter is a business owner, and a billionaire. He's semi-retired to take care of his son. There is some drama surrounding this, and to be honest, it was incredibly predictable and kind of boring. As I said in the first paragraph, this book was exceptionally long, and this whole storyline could have been cut out and it would have made the book better.I really liked Ben, the son, a lot. He was very mature for his age. Hunter was a really sweet guy. He didn't like when Wendy put herself down, and really made sure to point out to her how beautiful and great she was.Overall, the best was just ok. Blog --> https://tvaddictedbookworm.comTwitter --> https://twitter.com/tvaddictbookwmInstagram-->https://instagram.com/tvaddictedbookworm"}, {"Review": "Wendy is driving her van to deliver a cake for a retirement party the man’s son is Blake he was the boy that stood her up at prom and he took her friend instead, that was years ago but Wendy is still angry about it and to make things worse Blake married Heather. Now on her way to deliver the cake a boy on a skateboard doesn’t look where he is going and Wendy has to swerve the van so she doesn’t hit the boy but the cake ended up on the floor it’s now ruined. The boy’s father stops behind her van when he gets out Wendy’s eyes nearly pop out of her head the man is gorgeous and built like a tank but you could also tell that he has money, he gives Wendy his card after trying to help her and he says that he will pay for the damages so now Wendy has to go back to her cake shop and bake another one within a couple of hours she’s so not happy and let’s him know. Hunter a single father of a teenager is having a hard time coping with Ben once they get home Ben has a attitude he speaks a couple of words then takes off to his room, Hunter just doesn’t know how he’s going to handle Ben. Hunter has a smile on his face when he thinks of that little spitfire who didn’t back down from him she threw insults to him about his money but that didn’t bother him because Hunter is a very wealthy man. Hunter just can’t get that woman out of his mind so he looks up the establishment of where she works and there are so many great reviews of her business, there’s no time like the present to get a sweet tooth. That’s all I’m going to give you guys but there is so much more to this story to keep you entertained and turning the pages I loved it. A fantastic story a 5 plus ⭐️ read and I highly recommend this book it’s definitely well worth the read. "}, {"Review": "firstly, my thanks to the author for an advanced copy in return for an honest review.I loved it, great writing style and really engaging characters. some of it was a little cliched and there were times when I really thought Hunter needed a swift kick in the rear end but overall the story has a bit of everything and is a sweet romance. you have the sexy alpha male billionaire single dad and the sweet & sassy baker and several storylines to keep the action moving.I could not put it down and enjoyed every word"}, {"Review": "Couldn't put this down once I started. I loved every breathtaking, heart stopping minute. Wendy feels like her life is missing something, she has always been the shadow to her louder and more obnoxious sister Rochelle. All that changes the day she has a run in with a boy named Ben. He is the catalyst to many changes that will occur in her life.Hunter captures her attention from their first meeting and then her meddling family ensure he remains in her life by practically forcing him be her date to her sisters wedding, things heat up when pretend turns real, however there is more to Hunter's world than Wendy could ever imagine. Buckle in for the drama, adventure and hot bedroom action, this one will definitely leave you on the edge of your seat. I loved it and was fortunate enough to receive an ARC for my honest review. Loved every minute!"}, {"Review": "This book was definitely one of the bests I've read by Nicole Snow.Even though I knew who the villain was right away I still enjoyed to find out all the motives and layers behind.I loved Wendy very much. She deserved to be acknowledged by her family but not only did they not put her on a piedestal but treated her like she was invisible, like her accomplishments meant nothing at all. She had a very loving but strong personality and in family matters she was a lot wiser than her years. It took only a few minutes to Hunter and he already knew the girl he accidentally met was something else entirely. Even though Hunter had a lot of development to do I liked the way he stood up to Wendy and gave his support and appreciation to her in spades.Of course their journey wasn't all rainbow and roses but some rain and thorns here and there. The suspense made it even more enjoyable.Good writing and plot, told in dual POV, HEA and a sweet epilogue."}, {"Review": "Nicole Snow once again has delivered a wickedly awesome story of love and fate with detail and characters as so real you identify with them immediately. Wendy works for her families bakery and she is the best cake baker in the twin cities, she is sassy and always says what’s on her mind with an inner and outer beauty. Wendy is unaware that she is beautiful and desirable. Then we have a cake delivery that goes awry when Wendy swerves to miss hitting young Ben who is fleeing on his skateboard not paying attention to traffic. At the accident scene we meet Ben’s father a sexy, handsome, billionaire, who is wickedly alpha and you can’t help but to fall helplessly in love with him. This is their story. A story of love, hate, intrigue, espionage, fate, laughter, faith, hope and every other feeling. It’s a story of family. Definitely a five star read. "}, {"Review": "Hunter, a growly, eat your heart, muscled protector, that is all about his family of two and spares no expense when it comes to the ones he cherishes in his life. When he meets Wendy after a frazzled encounter with his son, he cannot get the feisty, accomplished baker out of his mind. He takes fate into his own hands making sure they'll meet again- what happens after that..Talk about an all-out alpha! Nicole Snow takes swoony alpha men to new levels with her latest book!Sweet, funny, perfect amounts of drama, sexually charged with an air of danger and suspense this story had me in its grasp from the first page until the last! Loved. LOVED. loved the characters and the descriptive scenes - a well rounded, wild ride I did not want to end! "}, {"Review": "I’m loving all the Accidental Hero’s books, all beautifully written by Nicole Snow. This particular book about Hunter and Wendy was so good. I loved the alpha attitude of Hunter, he was bound and determined to get Wendy in his bed and his life. Wendy is a naive baker with low self-esteem, she falls in love slowly with Hunter and his son Ben. There are several obstacles on the way to reaching their HEA, but they overcome all of them. This book with intrigue, and mystery kept this reader’s mind so involved in the story, but also had several LOL moments. All of Ms Snow’s books have the element of love and mystery, they always end in great HEA’s. I received this book as an ARC from the author, to read and write an honest review."}, {"Review": "I don’t think I’ve read a tstl hero before but this guy is just that. The beginning was great, so cute but the Sloane plot ruined the book. Sloane was such an obvious villain, everything he said and did was suspicious and fake and controlling and just obvious. There were too many things to ignore. Which just made Hunter look like an idiot. He even believed lies about his dead twin. Like seriously? His twin, who days before his death was worried and suspicious and kept telling him not to tell Sloane while they investigated?! Ughhh. So his stupidity and the way he only believed Sloane about everything, that he didnt work and let Sloane control everything while he just signed checks, all of it was so frustrating. I wish it was half the book without this plot. Also Wendy’s reaction to finding about the twin thing was so weird. And her relationship with her sister was so horrible but then she’d say it wasnt and then at the end her sister’s (and the husband’s) personality completely changed and ugh just another pet peeve. Also during the proposal she turns to Ben and says she cant wait for him to call her mum. Just wow. "}], "Genre": "Romance", "ID": "43365894", "Desc": ""}