{"Name": "A Merciful Death", "Image": "https://images.gr-assets.com/books/1479484195l/29986740.jpg", "Reviews": [{"Review": "4.5 stars This is my first book by this author. This is the first book in the Mercy Kilpatrick Series. It was so good, it kept me intrigued from the beginning to the end. I have been wanting to read this author for some time now and was so excited when I got this chance.Mercy Kilpatrick ran away from her hometown, Eagles Nest, Oregon fifteen years ago and now comes back as a F.B.I. agent. She doesn't want her past to be known. Mercy is assigned to a case to help solve several murders.A predator known as the Cave Man is murdering folks in their homes stealing a huge number of weapons and it is going down as a domestic terrorism event. Mercy notices a frightening connection to these murders that happened shortly before she ran away from home. Every mirror in the victim's houses has been shattered. This brings up a connection to earlier crimes that comes very close to exposing the secret that led to her getting out of town.Mercy is a flawed heroine but she is very gutsy and stubborn in solving this mystery of murders. I really liked her a lot and there is also a romance brewing and can't wait to read the next one to see if it is still brewing. I loved the suspense and the twist. It was a very good page turner.I want to thank Netgalley, Kendra Elliot and the publisher for the copy of this book in exchange for an honest review."}, {"Review": "This is my first book by this author. This is the1st book in the Mercy Kilpatrick Series and the first that I have read by this author, Kendra Elliot.The plot dragged on a bit too much for me.....I felt bogged down with all this information about the \"preppers\".........hell, these are pretty weird characters........and the build up was so slow...slow. There was so much angst and secrets re: the small town people and Mercy's family.Whilst I found Mercy Kilpatrick a difficult character to engage with, I did find the local police chief, Truman Daly a much more sympathetic character. He took his job seriously and cared about his townspeople. The romance between these two is almost nonexistent and there's a bit of a romantic interlude near the end of the book...but nothing amazing.We are introduced to a lot of characters in this book, which is obviously to set up for future books.....I liked Eddie, Mercy's FBI partner, Rose, Mercy's sister and Kaylie, Mercy's niece.Overall this was not a bad book and I am going to read the next book in this series and see how it progresses for me."}, {"Review": "FBI Agent Mercy Kilpatrick has been pegged to investigate a series of murders in Eagle's Nest, Oregon. This is her home town, where her parents and siblings still live ... although she hasn't seen or talked to any of them in 15 years, when she was forced to leave and told to never return.Someone is killing survivalists in their homes and stealing their many weapons. Could this be a possible act of domestic terrorism? But the broken mirrors in each of their homes have been shattered, bringing to mind an unsolved mystery from Mercy's past.Police Chief Truman Daly has a personal interest in these killings ... his uncle was one of the survivalists killed.Working together, Truman and Mercy are trying to deny their growing attraction. Mercy is afraid that if she lets him get close, he will learn her secrets. Truman also comes with baggage of his own.As they get closer to the killer, the killer is also targeting a new victim.. only it's not a survivalist he's after. His mind is on the one who got away years ago. And he's a lot closer to Truman and Mercy than they think.I have read many of this author's books and never been disappointed. Her plots are well thought out, well written, with interesting characters that come to life. There's always an element of romance, but mostly left to the imagination rather than being explicit. This is the beginning of a brand new series. There are no cliff hangers involved. Next book is A Merciful Truth due out later in 2017. I'm looking forward to it.Many thanks to the author / Montlake Romance / Netgalley. The opinions expressed here are unbiased and entirely my own."}, {"Review": "I've read all of Kendra Elliot's books and was super excited to start her latest series. Once again, she didn't disappoint. Mercy Kilpatrick, the protagonist, first appeared in Targeted, the fourth book in the Callahan & McLane series.Mercy left her hometown 15 years ago and hasn't spoken to her family since. But now she is sent by the FBI to help the local police with their investigation into the murder of survivalists in the isolated community of Eagle's Nest, Oregon. Local police chief Truman Daly has a keen personal interest in the case, as one of the murdered men was his uncle. When Mercy finds some similarities to events that happened 15 years ago, she is forced to reconnect with members of her family and has to trust Truman with details of her life that she has kept hidden. I enjoyed the unique storyline about preppers, their mindset and way of life. The emphasis was on suspense, the romance light and believable because it unfolded gradually. Some unexpected twists. Overall, a great start to a promising new series. "}, {"Review": "I won this book in a Goodreads giveaway.Eagle's Nest, Oregon contains a large community of preppers - people who stock up on food, water, wood, medical supplies, equipment, guns, and so on. They plan to to be ready for a catastrophe, which they call 'the end of the world as we know it.' As the book opens someone has killed two preppers and stolen their weapons.Sheriff Truman Daly, the nephew of a prepper victim, is determined to find his uncle's killer and calls in the FBI. The Portland office sends Agents Eddie Peterson and Mercy Kilpatrick. Mercy, an attractive thirtysomething woman, actually lived in Eagle's Nest until the age of eighteen. At that time a tragic occurrence caused a huge rift between Mercy and her prepper family. So Mercy left town never to return.....until now. Mercy is understandably anxious, knowing she'll see family members and old acquaintances in Eagle's Nest. Before long another prepper is killed and broken mirrors at all the crime scenes link the prepper deaths to two rape/murders that occurred 15 years ago. Mercy knows about these cold cases for two reasons: the teenage victims were schoolmates of her sister Pearl; and Mercy and her sister Rose were attacked around that time, probably by the same unknown perp (or perps). Sheriff Daly and Mercy work together closely to solve the crimes. The sheriff is very attracted to Mercy and - noting that she's nervous and tight-lipped about some things - resolves to winkle out her secrets. Daly even follows Mercy when she takes a drive at night, to see where she's going. Mercy's a little angry at first, but this is a mystery/romance....so sparks eventually ignite. (Daly's behavior REALLY irritates me. What business does he have prying into Mercy's private affairs? IMO he should mind his own business!)😣As the story unfolds we meet Mercy's mother, father, and siblings - some of whom are more conciliatory than others. Mercy also interviews various residents of Eagle's Nest including a mentally challenged man who's very helpful with the investigation. Later on there's an abduction....and a frantic search for the victim.For me, this book doesn't work. The incident that occurred 15 years before, which led to Mercy's voluntary exile from Eagle's Nest, was more than justified in my opinion. Mercy's father's hard-headed 'family first' attitude is irresponsible (to put it mildly). Mercy's brother does things that are not credible. Moreover, almost everything about the perp (who I hardly recalled as a character) is 'off': why he breaks mirrors; why he steals guns; why he abducted someone....I didn't buy any of it. Finally, the romance between Mercy and Daly was too treacly for me.😕I understand this is the first book in a series, but I don't know if I'll read any more. That said, fans of romantic suspense might like the book better than I did.You can follow my reviews at http://reviewsbybarbsaffer.blogspot.com/"}, {"Review": "An enjoyable start to a new series for me. Mercy is an FBI agent out of Portland Oregon. She’s sent to investigate a series of murders of preppers (survivalists) in Eagles Nest, a town where she grew up before leaving her family at age 18, never to return. Mercy’s family were also preppers. She’s a tough gal. She might not be in communication with her family, but their philosophy still colors her beliefs. This one has everything I love - a decent plot with no improbably turns, good well developed characters, a bit of romance. I listened to this and the narrator, Teri Schnaubelt, does a good job. I have already bought the audio version of book two in the series. "}, {"Review": "I have read a number of Kendra Elliot books and really like her writing style and A Merciful Death may just end up being my favorite book of hers to date. I started reading it this morning and had a really enjoyable day reading it.I really liked all the characters (both good guys and bad guys) in this book. They felt real with real motivations - not that the bad guy's motivations were good but they felt realistic. I'm also really intrigued by the complexity of Mercy Kilpatrick's character. Her unusual background, her secrets and her obsessions, her strengths and her weaknesses. She's not perfect - good characters never are. Mercy returns to her hometown after 15 years of being ostracized by her family. She returns as an FBI agent looking into the murders of \"preppers\", men who stockpile so that they are ready for the collapse of civilization. She isn't here to re-new her relationship with her family or to reveal a 15 year old secret, but as she looks into the current case she can't help seeing a relationship to the past. I really enjoyed the way this plot was developed and how the story was told. I also liked the way that Ms. Elliot wove into the story a man with Down Syndrome and a women who was blind. Again, I truly believe the best characters are not perfect.I really, really liked that although there is a love interest between Mercy and police chief Truman Daly it takes a back seat to the murder plot. It has a \"slow burn\" development that I really appreciate. This first book in the series is definitely a winner and the set-up for future books looks really awesome. I'm looking forward to book #2 in the Mercy Kilpatrick series. Thanks to Net Galley and Montlake Romance publishers for an ARC."}, {"Review": "TEOTWAWKI: The end of the world as we know it - the scenario the victims in A Merciful Death have been stockpiling supplies for in case the worst should happen.A Merciful Death is the first in a series featuring FBI Agent Mercy Fitzpatrick. She and her partner, Eddie Peterson, have been sent to Eagle’s Nest, Oregon, to assist local law enforcement in investigating the murders of several survivalists, a.k.a. preppers. Someone has murdered the men in their homes and then stolen weapons from the victims. With large numbers of weapons going missing, there is fear that someone is preparing some type of attack - possibly an act of domestic terrorism. They are aided by the Eagle’s Nest police chief, Truman Daly, whose uncle is one of the murder victims.Having grown up in Eagle’s Nest and having a family full of survivalists, Mercy is very familiar with the area and with the prepper lifestyle. It's not a happy homecoming for her. Fifteen years ago, she left Eagle’s Nest after a rift with her family and she has not been back to the town nor has she spoken to anyone in her family since. Things are tense for Mercy as she works the case, running into members of her estranged family as well as other people from her past. Her bright spot is her blind sister, Rose, who is happy to have Mercy home though it’s not all sunshine as they have a shared trauma from their childhood and being together again awakens some old ghosts.As the investigation progresses, Mercy starts to see similarities to a series of murders from the past - from when she was a teenager. Has a murderer from the past come back or is it a coincidence? Is someone stockpiling weapons for a domestic terrorism event or is someone acting on something more personal as motivation? Overall, I liked A Merciful Death. I found the prepper aspect of A Merciful Death to be intriguing. I’ve never read anything or seen anything in depth about preppers. It’s an interesting topic. The pacing and writing are good. The characters are well-drawn. Both Mercy and Truman are likeable characters with baggage and an attraction to each other. Mercy, though, is not always the most sympathetic character. The tone is dark at times and there are some Debbie Downer moments. I think Eddie could have used a little more “screen” time as it were to add a lighter presence but he is pretty much pushed to the periphery as the story progresses. Mercy’s family is infuriating, especially her father and her oldest brother, Owen. I did find the reveal to be not very satisfactory and the events following it are a bit over the top and drawn out. That said, I think it’s definitely a good start to a new series. "}, {"Review": "FBI Spc Agt Mercy Kilpatrick was raised a prepper but she has kept her past a secret from all who know her. She moved away from Eagle's Nest and has had no contact with her family since. She has been called back there for a case assigned to her because she is from that area but she is not sure how her family will take seeing her again. It seems that someone is killing preppers and it may be tied into why Mercy left all those years ago. Great read. I would like to thank the Publisher and Net Galley for the chance to read this ARC. "}, {"Review": "Good startMercy returns back to her home town as an FBI agent to work on a crime but when she gets there the crime seems to mimic an old crime that happened when she was in her teens. The only problem is Mercy hasn't been back since she left home when she was 18 years old and her siblings have a secret so she will have to confront them. Things start to come together and there are other things start to come out as well will this ruin what Mercy has build? Well you would need to read it to find out. LOL. Not a bad start to the series. Will have to continue to see what happens next."}, {"Review": "A MERCIFUL DEATH (Mercy Kilpatrick #1) by Kendra Elliot is the start of a new series that is a cross between romantic suspense and mystery/suspense. This type of series is always difficult to categorize for me, but it is similar to Melinda Leigh’s Morgan Dane series and/or Marie Force’s Fatal series which are must reads for me. FBI Special Agent Mercy Kilpatrick grew up in rural Eagle’s Nest, Oregon in the shadow of the Cascade Mountains. Until the age of eighteen, Mercy was raised in a family of preppers. After a falling out with her father that had him disowning her, Mercy left town to build her own life. Her lifetime of being prepared for disaster has stayed with her though and is a necessary part of her life even though she hides it from her colleagues.When there are a series of elderly male preppers murdered in Mercy’s hometown. What would normally be a local case catches the FBI’s attention when the preppers large caches of weapons are also stolen. This raises the possibility of domestic terrorism. Her FBI supervisor sends her and her partner to work with the nearby Bend office and local law enforcement. Eagle Nest Police Chief Truman Daly is the nephew of one of the murdered men. Raised in the community only on summer breaks, he is just starting to be accepted in a community that has its own ideas about the government and police. As Truman works with Mercy on the murders, he learns of her family ties to the community and begins to suspect, she did not completely leave her prepper life behind. Mercy discovers that these current murders are eerily familiar to two unsolved murders in the town’s past. With her sister now involved, Mercy and Truman must capture a killer who has been free in their community for much too long before her sister suffers the same fate.Mercy is a wonderfully unique and flawed character. I find her so interesting and want to know much more about her and her family. Truman has his own interesting history and I hope this budding romance continues. He has his work cut out for him with such an independent heroine who does not like to share her secrets. The plot was interesting and tied in well with the older cases, but this is also why I gave this book four stars instead of five. I found Mercy’s brother’s actions not believable. (No spoilers, so you will have to read it and see if you agree.) Overall, a good start to this series and I am looking forward to reading the next book."}, {"Review": "A Merciful Death is the first book I've read by Kendra Elliot. It's the first book in the Mercy Kilpatrick series. I love it when I find a new series I enjoy. But then my heart sinks when I discover that it only has two books and the third isn't due out for another six months. But I digress.Mercy Kilpatrick is an FBI Agent from Portland, Oregon. She is called to her hometown of Eagles Nest to investigate the murder of a few \"preppers.\" What are preppers, you ask? They are a network of people who prepare for when disaster strikes. Why would the FBI be interested in such cases? For starters, the killer has stolen all of their weapons from the crime scenes.As Mercy and police chief Truman Daly investigate, they discover a small connection to two previous murders from 15 years ago. And the more those two crimes are looked into, the closer Truman Daly comes to finding Mercy's big secret. The secret that has caused her family to shun her and her reason for leaving Eagles Nest.I enjoyed this book. There were a few parts I had trouble tying together, but that may have been due to my distracted reading. Or listening as the case may be, I listened to A Merciful Death with Audible.I especially enjoyed Mercy's character. She was staring and hardened due to her past and her career choice. But she was soft and vulnerable too. My favorite character, however, was Truman Daly. Police Chief of Eagles Nest. He is not native to Eagles Nest but spent summers with his uncle in the past. He is the epitome of a nice guy. He develops a soft spot in his heart for Mercy, and they work well together. A Merciful Death is not as twisty as I prefer a book to be. But the story was well paced, enjoyable and entertaining. 4 sweet stars for A Merciful Death. Thank you, Kendra Elliot. "}, {"Review": "I was worried that A Merciful Death would end up being just like all Kendra Elliot and while it is very similar at the same time it is different.Mercy isn't the perfect Federal Agent but she works hard to cover up her past. She is strong, fights for the right and believes in those she loves. Kendra Elliot gave readers a person who isn't damaged but struggles between the way she was raised and how she wants to live her life.Kendra created characters who have flaws, are imperfect but are trying to do what is right with the knowledge they have. They struggle with the way they were raised and how they want to live their lives now. The family drama was very real. You could feel the family struggle with the dynamics create a real world feeling.The mystery was a little questionable and at times not as believable as many other of Kendra Elliot novels but the dynamics of the individual characters and the real life struggles some of them face made this novel a 5 star read.Advance Copy from netgalley"}, {"Review": "Advanced Reader Copy (ARC) provided by the Author and Publisher via NetGalley in exchange for an fair and honest review.The Kendra Elliot books I've read have all been suspense with the emphasis on building a realistic romance. \"A Merciful Death\" is no different. Somehow you just know, from the first pages, that a book is going to be good. This book is good. It's refreshing to have a H/h who don't fall into insta love/lust on first sight. This romance unfolds gradually, and the main characters get to know and respect each other.Mercy is an FBI agent sent to assist in the investigation of three murders where large amounts of weapons were stolen too. She left Eagle's Nest 15 years ago and never looked back. Now she has to face not only her past, and her secrets, but a murderer.Truman has been the Chief of police in Eagle's Nest, Oregon for only 6 months. His reclusive uncle was murdered and his cache of weapons stolen. Truman is not going to back away from this case until the murderer is found. Preppers, Sovereign Citizens and Militants are some of the groups that occupy the area around Eagle's Nest and they all like their weapons. All the victims were known Preppers. These are fiercely independent people who take exception to the government telling them what to do. But someone in their community is a part, yet apart. A murderer stalks these people and it may not be for the first time."}, {"Review": "Before I really delve into this review, I need to tell you that I'm in the minority with my feelings on this book. Almost 1800 people have read this book as of right this moment and it's rated at almost 4.5 stars. So my one star rating is ... not common. After I finished this, I was a little surprised to find out that this was a romantic suspense. I mean, I must have known that at some point because I picked this book and romantic suspense is my favorite genre. But I completely forgot and this book didn't remind me with how it was written. I didn't get romance ... at all ... I mean there were parts ... but this wasn't the kind of romantic suspense that I'm used to, maybe. Or I guess it could be the fact that this book couldn't keep my attention. That's not a good thing. I shouldn't look forward to putting the book down. And I did. A lot. Now this book wasn't badly written, it just read very dry to me. The conversations were extremely stiff and almost robotic. The further I got into the book, it wasn't just the conversations that I found dry. It became everything. And once that hit ... it was all downhill from there. I didn't enjoy even one portion of this book. I didn't like Mercy or Truman and I couldn't have cared less what happened to them in the past or what was going to happen to them or if they were going to get together or what happened with the case that they were working on. This was just not a good fit for me this time. * I received this novel in exchange for an honest review *Check out more of my reviews at Little Miss Bookmark!"}, {"Review": "Actual rating: 4.5 out of 5 starsI really enjoyed this book. This is the first book in the Mercy Kilpatrick series and my first read from this author. It was a compelling read and I could not put the book down.In a small rural town in Oregon, Mercy Kilpatrick grew up as a prepper. A prepper's life is centered on being prepared for TEOTWAWKI. The end of the world as we know it. After conflict with her family, Mercy was shunned from the family and forced to leave. Fifteen years later, preppers are being killed in her home town. FBI special agent Mercy is put on the case and returns home where she is forced to face secrets that she tried to keep buried. The whole survivalist mindset is new to me and I was intrigued. When I think of a prepper, I think of a paranoid crazy person. The story was interesting, fast-paced and kept me wanting more. The characters are well-developed and likable. Looking forward to reading the second book in the series. I would like to thank NetGalley and Montlake Romance for supplying a copy of Kendra Elliot's \"A Merciful Death\" in exchange for an honest review."}, {"Review": "I like this author; and this was a good beginning to the series. I had put off reading it for the longest because I wasn’t sure about the prepper storyline. The twist I was expecting throughout the book didn’t happen until near the end; and didn’t bother me as much as I thought it would. I did get a little pissy when the strong female FBI agent blithely revealed a serious 15 year old secret to a virtual stranger just because she was attracted to him and he was nice. Seriously?The book was a solid 4 star read until the last third, when the plot started unraveling and my interest waned just a bit. Looking forward to more of the series, though."}, {"Review": "3.5 stars.The existence of preppers has always fascinated and saddened me in equal measure. I've never read a book featuring this culture, so the entire premise was interesting and fresh. The writing was easy to read, the MCs were easy to like, the mystery/suspense was just the right amount of creepy, and the romance was sweet. I'm so happy that I found another author who has a lot of books to go through. :)Trigger warning :(view spoiler)[ there is rape that occurs during the timeline of this story. No graphic details are mentioned, but it does happen to one of the supporting characters (hide spoiler)]."}, {"Review": "The state of Oregon is home too many preppers or doomsday groups.  Our protagonist, Mercy Kilpatrick grew up in the tight-knit prepper community of Eagle’s Nest, Oregon. A disagreement with her father, caused her to cut-ties with her family when she was eighteen.Mercy knows the small-town and folks in Eagle's Nest. Their dislike of outsiders and the government make her the perfect agent to investigate.When a series of murders involving preppers occur, it raises alarms with the FBI. Could someone be planning a domestic terrorist act?  This was a clever story that pulled me in from the beginning. We have several story lines woven together, but the investigation was the primary focus. Twists and reveals kept me guessing until the end. Only after the killer was revealed did I see the foreshadowing and clues peppered throughout the story.Threads involving Mercy, and her estranged family, were well developed, and added to the overall suspense.  I found the prepper lifestyle fascinating.  Insight into preppers and the inner workings of their community kept me engaged.Mercy has secrets that the author slowly revealed allowing the reader to better understand her motives. The local sheriff, a newcomer by small-town standards assists in the investigation. Mercy's partner and the Bend FBI field office added to the investigation and added believability. A low-key romance develops with the promise of things to come but was a minor thread compared to the first two.A heart-pounding investigation and interesting characters made this an entertaining read. Elliot, a seasoned author pens books set in the Pacific Northwest. She brought the landscape, characters and small-town to life. I cannot wait to devour the next book, A Merciful Truth.  This review was originally posted at Caffeinated Reviewer"}, {"Review": "This is the first in a new series by Kendra Elliot and it has me hooked. Mercy Kilpatrick is a woman with many secrets. That is hard for someone who is also an FBI agent. When her most recent case sends her back to her hometown of Eagle's Nest, Oregon, some of her secrets come out. Fifteen years earlier she left home and was shunned by her family, she has not spoken to any of them since. This town has more than its share of \"preppers\". There are two main groups one headed up by Mercy's father and the second by her father's enemy. When several older preppers are killed and their weapons stolen, the FBI is worried about Domestic Terrorism. With the help of police chief, Truman Daley, Mercy and her partner begin the investigation. When things remind Mercy of earlier murders (15 years ago) she reopens the investigation in those cases. What is Mercy's secret? How will all this affect her job with the FBI and her family relationships?\" I could not put this book down. I read long into the night to find out what was going to happen. The plot pulled me along quite quickly. I liked learning more about Preppers. I always thought they were a bunch of crazy, hermit types but these characters were not. I was not sure about the character of Mercy at the beginning of the book, but really liked her by the end. Finding out about her past slowly as the book unfolds makes her very real to the reader. The secondary characters (her family, her partner) are all very likable (except her father) and I hope to see more of them in other books in this series. I will say that I had figured out who the murderer was much earlier than the book revealed it, but it did not diminish my enjoyment of the story at all. A great read for lovers of suspense, mysteries and FBI type stories. The publisher generously provided me with a copy of this book via Netgalley."}, {"Review": "A community of doomsday preppers, conspiracy theorists, and evangelical patriarchists near Bend, Oregon? Not for me! A mystery/thriller/romantic suspense novel set in such a location? Yes, please!Mercy is a compelling character and I love her romantic interest, Truman Daly. Though, I would've thought there would've been more killings/attacks in such a community. (Especially, as soon as FBI agents came to town!)I will definitely read more. I want to see more of Mercy, Truman, and Mercy's family. All this series needs is a dog. "}, {"Review": "I'm glad I got to start this new series from the first book because it's shaping up to be another great one from Ms. Elliot. The characters, the plot, the twists and turns, the suspense, all of it combines to make this story a gripping page-turner and I can't wait for the next book.A small town in Oregon. A crime spree and the murders of two young women. Two young women with a huge secret. Fast-forward to fifteen years later and the same town is facing another spree but this time, the victims are older men and the only thing they have in common is that they were all survivalists. The new interim sheriff Truman Daly knows his department is not equipped to handle these investigations and he's not shy about calling in the big guns, especially because his uncle was the first victim and he'll do whatever it takes to bring his killer to justice and make his town safe again.Enter FBI Agent Mercy Kilpatrick. Mercy is originally from that town but hasn't been back home since she left under a shadow fifteen years ago. Her connection to the town makes her the ideal person to run the investigation, but what she finds during her investigation may unravel the careful world she has built for herself and expose her for a fraud. Has a killer been hiding in plain sight all this time? Has Mercy's secret been the reason why he lay low for so long? Will her return put her back in his cross-hairs?Mercy is a very complicated and interesting character in many ways. Even as an eighteen year old, she was already showing that she was an independent and forceful personality, something that was not welcome in her community of preppers where the man is ruler of his domain and a woman was expected to be seen and not heard. While she left home, she did not live the lifestyle behind and she seems to have successfully built a life for herself that incorporates the best of both worlds. She's also very secretive and keeps a large part of who she really is shielded from everyone. Until Truman, who takes the time to dig deep and find her.The instant attraction between Truman and Mercy (along with his stalkerish behavior) adds some levity to the story. Truman's steady and solid disposition is a perfect foil for the swirling emotions that Mercy hides beneath her calm facade and she in turn brings a no-frills perspective to the guilt he carries from his time at his former job. Together they form a strong and dependable team, which may not be sexy but is perfect for this story, this town and the two of them. I am really intrigued by the survivalist mindset and being a copious consumer of news, this story bring close to home some not so far off incidents and also got me musing for a minute about my preparedness or lack thereof for the apocalypse:)A MERCIFUL DEATH is well-written and well-researched, with multi-faceted characters and engaging suspense and I'm looking forward to more in this series.Disclaimer: I voluntarily reviewed an Advance Reader Copy of this book. All opinions stated are solely mine.Want more? Subscribe to my Newsletter on The Sassy Bookster.Follow me on Twitter | Tumblr | Bloglovin’. Like my page on Facebook."}, {"Review": "4.5*Mercy Kilpatrick returns to her home town of Eagle’s Nest, a small rural town in Oregon, fifteen years after she fled the fallout from several disastrous events. She hasn’t seen or spoken to her family since then. Now a special agent with the FBI she has been sent to Eagle’s Nest with fellow agent, Eddie Peterson, to help the local police force in their investigation of a spate of murders. Someone has been targeting the community of preppers and stock piling stolen weapons in what could be the preparation for a domestic terrorism event.Eagle’s Nest Police Chief Truman Daly has a vested interest in the murders, his uncle was one of the victims. Truman didn’t grow up in Eagle’s Nest but spent several summers with his uncle, so he knows many of the townspeople. Nevertheless, it’s taking time for him to be completely accepted. Truman and Mercy join forces and in the course of the investigation it becomes apparent there are similarities and the recent murders have echoes from the past. I’ve enjoyed Kendra Elliot’s books previously and this was no exception. The protagonists’ intriguing backstories are woven into the twisty plot line, connecting the dots until a picture begins to emerge, with plausible trails leading the reader in various directions. Both Mercy and Truman are trying to come to terms with their pasts, the damage done and events that have shaped them, bringing them to where they are. Due to her upbringing and reason for leaving town, especially as it would have implications regarding her job, Mercy is wary of Truman and reluctant to let herself trust. Truman realises Mercy is a survivalist, despite her attempts to hide it, and almost against her will a bond begins to build between them. He, on the other hand, has no such reservations and is attracted to Mercy almost from the start. Having said that, the romance aspect is very much in the background and doesn’t overwhelm the main storyline.The story flow is smooth, with a well crafted plot and rounded, believable characters. Mercy and Truman are both likeable, although Truman is more relatable. His level-headed and easy going personality is a good foil for Mercy’s more edgy and complex one. Mercy’s story is drip fed as the story unfolds, which makes her more sympathetic. I enjoyed the prepper aspect, which adds an extra layer to the narrative. It was interesting to learn more about their way of thinking and community, which is still male dominated, and the lengths they go to in preparation for a major disaster. Kendra Elliot also paints a vivid picture of the area. Looking forward to the next instalment."}, {"Review": "A Merciful Death (Mercy Kilpatrick, #1) by Kendra ElliotMercy Kilpatrick is a special agent in the FBI. She is returning to her hometown Eagle's Nest with her partner Eddie. Someone has already murdered three preppers. A prepper is some one who lives off the grid and stocks up on things to eat and fuel and water. Mercy thinks that the massive amount of weapons that are stolen at each murder might have something to do with domestic terrorism. She meets police chief Truman Daley who is the nephew of one of the murder victims. He is going to work the investigation with Mercy because he wants the killer caught and brought to justice. Except for visiting in the previous summers he has only lived in Eagle's Nest for six months. Mercy basically tells Chief Daley it takes a couple of decades and plenty of family roots to be let into the inner circle of Eagle's Nest.Mercy should know she grew up in Eagle's Nest, but something that happened fifteen years ago had her leave and be shunned by her family. When she stops into the local coffee shop her partner points out that the girl who is making their coffee looks just like Mercy. It is her niece who she doesn't know and her brother who is running the place. Both parties act like they don't know each other.Mercy and Daley are working the investigation together. They are trying to figure out who and what murdered the three dead prepper's. These three murders have similarities to things that went on fifteen years ago. The three prepper murders link back to those past events. Special Agent Mercy and Chief Daley look as though they could be striking up a romance, They both have secrets and baggage that they are hiding and want to keep it that way. I am looking forward to the second book in this series.Thank you to Net Galley, Kendra Elliot and the publisher for my ARC for an honest and fair review.e"}, {"Review": "You can find this review in English below.Cuando empecé a leer esta historia esperaba encontrar algo similar a Vanished (mi libro favorito de esta autora) y no me decepcionó. No me malinterpretes, no es que las historias sean parecidas, el único parecido es que ambos protagonistas son agentes de la ley. Ahí empiezan y acaban las similitudes, pero el estilo es el mismo. Personajes interesantes, inteligentes y reales y una trama original, muy original y muy bien fundada.Mercy no se parece a ninguna protagonista que haya leído. Es una tía rara, poco usual y la autora consigue que me parezca real, la hace real y me convence de que hay gente así. Me ha sorprendido gratamente.Truman es mi hombre ideal. Un tío honesto, trabajador y que se preocupa por su comunidad. Le encanta su trabajo y eso se nota. Es inteligente y no es un alfa insufrible…ah…¡Qué original! :) Y trata a la protagonista como lo que es: una mujer capaz e inteligente; y la admira por ello… ¿Alguien da más?El romance es sutil, muy sutil. A mí me encanta porque siempre tengo problemas con el exceso de lujuria mientras los malos siguen matando gente y eso aquí no sucede. Los protagonistas son compañeros de trabajo y saben que mientras dure el caso no hay nada que hacer. Es una relación realista y madura, ambos se sienten atraídos y quieren pasar tiempo juntos pero el caso entre manos es lo importante y fundamental, así lo piensan y eso es lo que hablan, porque este es un caso de comunicación entre los protagonistas. Así que no leas esta historia por el romance porque podría decepcionarte.Después tenemos el drama familiar. Yo no soy fan de él. Y éste, como tantos otros, no me ha convencido. Me parece que las consecuencias fueron desproporcionadas al problema. Pero eso no quiere decir que la gente no sea cerrada y cabezona y que no pueda pasar. A mí no me ha convencido.Y por último y más importante está el suspense. Ha sido muy bueno, me tenía completamente enganchada. Ha sido la piedra angular de la historia. Por más que he barajado sospechosos no he conseguido acertar. Pero la resolución del suspense no ha sido buena. Ha sido demasiado rebuscada. El crimen no resuelto del pasado y los nuevos asesinatos que estaban ocurriendo no tenían nada que ver y no había manera de “casarlos”, así que el intento de la autora no me ha convencido. Nada. No ha tenido sentido. Ni eso ni el giro del final, hay “cosas” que no aguantan 15 años y este secreto es una de ellas. Los crímenes necesitaban de asesinos de amplio espectro y eso es muy complicado de justificar, sí, sí, hay gente muy mala, lo sé, pero seamos serios, no están durante tanto tiempo inactivos y después vuelven a la carga con otro asunto totalmente diferente. No he conseguido creérmelo. Una pena…Pero la historia prometía. Y estaba interesante. Y el romance ha sido tan sutil que, a pesar de que no me gustan absolutamente lo más mínimo las series, le daré una oportunidad al siguiente libro. Pero esta historia merecía un final más currado.\nARC provided by Montlake Romance via Netgalley.\nWhen I started reading this story I expected to find something similar to Vanished (my favorite book by this author) and I was not disappointed. Do not get me wrong, it's not that the stories are alike, the only resemblance is that in both stories their MC´s are law enforcement agents. That´s where similarities begin and end, but the style is the same. Interesting, intelligent and real characters and an original plot, so original and well founded.Mercy does not look like any heroine I had read before. She is a rare, unusual woman and the author makes her looks real and got to convince me that there are people like that out there. I was pleasantly surprised.Truman is my ideal man. An honest, hard-working guy who cares about his community. He loves his work and it shows. He's smart and he's not an insufferable alpha ... oh... So original! :) And he treats the heroine just as what she is: a capable and intelligent woman; and admires her for it ... Could it be better?The romance is subtle, very subtle. I love it because I always have problems with the excess of lust while the bad guys are still killing people and that does not happen here. The MC´s are coworkers and they know that during the case there is nothing to do about it. It is a realistic and mature relationship, both are attracted and want to spend time together but not while working on the case, is important and fundamental keep things crystal clear. That´s what they think and that´s what they talk about, because this is a case of communication between the MC´s. So do not read this for the romance because it might disappoint you.Then we have the family drama. I'm not a fan of it, to put it mildly. And this, like so many others, has not convinced me. It seems to me that the consequences were disproportionate to the problem. But that does not mean that people are not stubborn and pigheaded obstinate that it couldn´t have happened. But it has not convinced me.And last and most important is the suspense. It was very good, I was completely hooked. It has been the cornerstone of the story. No matter how many suspects have I considered, I have not managed to hit the mark. But the suspense´s resolution has not been a good one. It has been too farfetched. The unresolved crime of the past and the new murders that were taking place had nothing to do with each other and there was no way to \"marry them\", so the author's attempt did not convince me. Nada. It did not make sense. Neither that nor the twist at the end, there is \"stuff\" that can´t stand 15 years, and this secret is one of it. The crimes needed broad-spectrum killers, and that's very complicated to justify, yes, yes, there are very bad people, I know, but let's be serious, they have not been inactive for so long, and then they try again with another totally different matter/MO. I could not believe it. A pity ...But the story promised. And it was interesting. And the romance has been so subtle that, even though I do not like in the least series, I'll give the next book a try. But this story deserved a more thorough end."}, {"Review": "A Merciful Death is book one in the Mercy Kilpatrick series by Kendra Elliot. When the FBI realised the connection between the death of three senior men Mercy Kilpatrick returns to her hometown of Eagles Nest that she left fifteen years before. The Police Chief of Eagles Nest Truman Daly became involved with the investigation after his Uncle died. However, during the inquiry Mercy Kilpatrick and Truman Daly found out more then they expected. Readers of A Merciful Death will follow the twist and turns in Mercy Kilpatrick and Truman Daly investigation.A Merciful Death first book I have read by Kendra Elliot. However, for me, A Merciful Death starts off a little slow, and once I engaged with the plot, I enjoyed reading this book. I will defiantly read more books in this series. Kendra Elliot did a great job in describing her settings. A Merciful Death is well written and researched by Kendra Elliot. I like Kendra Elliot portrayal of her characters and the way they interact with each other throughout A Merciful Death. The readers of A Merciful Death will start to understand about preppers and the problems they have in the society. Also, the readers of A Merciful Death will begin to learn about the problems law enforcement have in an investigation of a crime in a small community. I recommend this book."}], "Genre": "Romance", "ID": "29986740", "Desc": ""}