{"Name": "The Magnolia Inn", "Image": "https://images.gr-assets.com/books/1544537522l/40227501.jpg", "Reviews": [{"Review": "The Magnolia Inn by Carolyn Brown is a slow burning contemporary romance. The story brings two flawed characters together for their shot at a happily ever after over the course of several months time.Jolene Broussard found out that her aunt Sugar was going to give her half of her bed and breakfast, the Magnolia Inn. As excited as Jolene wanted to be she knew she was dead broke and that the inn was going to take a lot of work to get into shape and her cousin Ruben who now owns the other half was the last person she waned to go into business with.Tucker Malone used to be in law enforcement before his wife died in a tragic accident, now Tucker is basically a hermit in his trailer and a weekend drunk mourning his wife. When Tucker hears the inn is for sale he decides to invest the insurance money putting use to his carpentry skills. While Tucker is much better to partner with than Ruben, Jolene and Tucker find themselves navigating their new partnership slowly but surely.For a change we have a romance novel that didn’t push the romance (or the characters into bed) within the first few pages. The couple in this story each had their own issues to deal with and that was done slowly while remodeling the inn. I will say what I also enjoyed the most in here was the side characters, Flossie, Dotty and Lucy, the trio of elderly ladies had been friends with Jolene’s aunt for years and were like extended family and always good for a chuckle which definitely helped make this one a cute story overall.I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"Review": "Check out all of my reviews at: https://www.avonnalovesgenres.comTHE MAGNOLIA INN by Carolyn Brown is her new contemporary second chance romance. It is a sweet romance, which I call a cozy romance because it is written about adults (not YA), any sex is behind closed doors, some religion may be included and the focus is on the H/h’s emotional growth or healing. These books also include a strong family, friends and/or community support system.Jolene Broussard grew up with a drug and alcohol addicted mother. She could not get her mother to change or get help for herself, so she left when she could. She is carrying a lot of guilt though because her mother committed suicide after she left. The happy times she had growing up were with her mother’s older half-sister and her husband at The Magnolia Inn B&B during summer break from school.Sugar and her husband are ready to retire and travel across country, so they leave half of the B&B to Jolene and half to her cousin Rueben. Sugar has big plans, but no money. Rueben hates his memories of the B&B and decides to sell. Tucker Malone lost his wife of 5 years in a tragic traffic accident. He hits the bottle hard. After losing his job as a police officer, he vows to only get drunk on the weekends and starts to build a name for himself as a carpenter. Tucker is informed about the sale of Rueben’s half of the Magnolia Inn and decides to buy in and partner with Jolene.The partnership is rocky at first, but soon each begins to understand that they each have deep emotional issues to deal with and dealing with them together as they remodel the inn seems to work better than dealing with them alone. I enjoyed this cozy romance. Jolene is so strong and had to survive so much. Tucker is rebuilding his life, but he is stuck emotionally until he meets Jolene. I enjoyed how the changes in their lives and the remodel of The Magnolia Inn seemed to intertwine. The secondary characters are almost show stealers in this story. Sugar, Flossie, Dotty and Lucy are good for a laugh, but also share their wisdom with Jolene. This is an emotional growth story with a very slow build up to romance. Sex is behind closed doors and only in the last portion of the story. An enjoyable read."}, {"Review": "The Magnolia Inn is the newest book by one of my new favorite authors, Carolyn Brown. It tells the story of Jolene and Tucker. Jolene spent her summers with her aunt and uncle at The Magnolia Inn, a B&B owned and operated by them. She loved her summers there and at the beginning of the novel she finds out that she has inherited half of the Inn. Her cousin, through her uncle (no blood relation) has inherited the other half of the Inn. Her aunt and uncle decided it was time for them to retire and travel the USA by RV. Jolene is thrilled, her cousin (who is a major jerk), is less than excited and no sooner than the papers are signed, he has sold off his share of the Inn to a man by the name of Tucker. Tucker’s wife passed away a few years earlier in a car accident and Tucker is having a very hard time getting over his wife’s death and he still speaks to her in his mind. Tucker lives in a trailer and after deciding to purchase the Inn, he quickly moves in. The story then progresses as Jolene and Tucker begin to fix up the inn.This is a very slow burn romance. A good portion of the book is spent with Tucker still mourning his deceased wife while dealing with his growing feelings for Jolene. There is some adult content in the book, but all those scenes happen behind closed doors so I would consider this to be a clean romance.While I adored both Jolene and Tucker, the best characters had to be Jolene’s Aunt Sugar’s friends; Flossie, Dotty and Lucy. They are such a hoot and their scenes are some of the best in the book. I compare this a bit to books by Fannie Flagg, in the scenes of how wonderfully southern it is. I received a digital review copy of this book from Montlake Romance via NetGalley.Rating: 4 StarsSensuality Level: Sweet\n\n"}, {"Review": "Two broke, grieving people share an ownership in an old Victorian inn. Between the magic of the inn and the friendship that grows between them, they might both find a chance at forgiveness, healing, and love. A bit of country charm, a group of sassy friends, and a sweet, simple story are what draws me back time and again to this author's books and an engaging, familiar narrator.The Magnolia Inn, a crossover between women's fiction and contemporary romance is a standalone story. It deals with such sad elements of death, grieving, substance abuse, family, friendships, and letting go of the past and guilt.Whenever I see a pair, who are disgruntled and barely acquaintances, but have that special spark, forced to work together in a gently-paced, slow burn friends to lovers, I know I'm going to have a good time. Jolene Broussard inherits half of the old Magnolia Inn from her aunt and uncle and ends up gaining a business partner when her cousin sells his share to Tucker Malone. Tucker might be the best handy man in the area and a partner who sees the potential in the Magnolia like she does, but he gets drunk at least once a week and isn't over his wife's death. Jolene has had enough of supporting and enabling drunks from her mother to her ex-boyfriend and she sure isn't willing to coddle another one.But, with the support of her aunt's three old friends and her own daily experience seeing that Tucker is not her mom or her ex though he surely does fight his own demons, she realizes that Tucker isn't the only one who needs to get over some pain, guilt and anger.Slowly, but surely the old inn is refurbished and the pair find they are friends and they both start to look toward the future. If only they can let go of the past.Unlike her straight up cowboy romances, this one focuses on the process of letting go, friendships, and then romance. There is lots of time with the three older ladies who are a sassy trio, renovation work that helps Jolene and Tucker form a friendship which lets them talk over what is on their hearts, and even resolving unfinished business with the ghosts of their past through mental conversations with those dead and gone. Things ease along rather than run straight to the romance.I enjoyed the story I got. The work, the people, the friendships, and the everyday feel. It was hard seeing how much pain and waste the alcohol caused, but I was glad to see that it wasn't quickly swept under the rug or treated lightly. Jolene was the child of an alcoholic and Tucker lost his job because of it and uses it to self-medicate away his grief and loss. My heart broke for them and I was cheering them on to get through it.Brittany Pressley is a great match for group who were mostly Texan with one of the older ladies, Dotty having some Cajun. She paced well with the story and had a good grasp of the tone needed through each change of emotion and situation. Her work enhanced the story and I enjoy that she does several of Brown's books.All in all, this was a comfy, heartwarming story with a satisfying romantic ending. Those who enjoy women's fic crossed with contemporary romance set in a small town should try this one.My thanks to Brilliance Audio for the opportunity to listen to this book in exchange for an honest review."}, {"Review": "This book started slow for me but it built up to a wonderful story of family, friendship and love. Jolene Broussard has been left half of The Magnolia Inn from her Aunt Sugar and the other half belongs to the nephew of her Aunt's husband. He does not want any part of the Inn and sells his have to Tucker Malone, who is a widower that cannot get past loosing his wife. Both of these people have had tragic pasts which they cannot move forward to a new life. While they renovate the Inn, they begin to put the past behind them and with the help of Aunt Sugar's three friends, who have been together since they were little girls, and phone calls with Aunt Sugar, they know the future is something that they both want and are building it together. Carolyn Brown knows how to write a good women's fiction with wonderful characters and the bonds of friendship that cannot be broken over time or place. She adds in romance and HEA for us to sigh over and gives us many LOL moments with her feisty, lovable, and quirky southern woman of a certain age. She makes you want to pull up a chair at the table and join in the fun. I always want they story to on and on so I can catch up with what her characters are doing... I await the next great story from one of my fav Women's Fiction writers. "}, {"Review": "When she inherits half an inn badly in need or repair. Jolene Broussard is equal parts thrilled and daunted. When she discovers that her original partner, the loathsome Ruben , has sold his half to someone else, Jolene's day brighten somewhat. But what if the new half owner is as bad as her cousin-by-marriage would have been? Jolene's got a lot of baggage in the love department and she's not exactly the most trusting of souls.Tucker Malone is a widower still in love with his wife and who is battling a drinking problem. Buying the inn on a whim seemed like a good idea at first. But when he meets the fiesty Jolene, he begins to second guess his purchase. Why does his partner have to be so darn cute? Restoring the inn together is a balm for the both of them.In her sweet way, Carolyn Brown gives her readers another darling romance and teaches us all about the gift of forgiveness.I loved this book. And although, like all her books. the dialogue sometimes seems a little anachronistic, the story is sound and the power of redemption for her characters, strong. Thanks, Netgalley and MOntlake for a sneak peak for an honest opinion."}, {"Review": "A beautiful Contemporary romance! This is the first time that I read a book rewriter by this new-to-me author Carolyn Brown. I strongly recommend it if you like romantic story! A beautiful story of two broken hearts who try a second time to trust and love someone!'The Magnolia Inn' tells the story of Jolene and Tucker. Both had lived some dramatic events in their past and have trouble to trust and try again at loving someone. She inherits half of the Magnolia Inn, a Victorian home nestled in the East Texas pines. The other half is for Reuben, a mean man who decided to sell his part. Then Tucker enters her life by buying Reuben's half. Can Jolene and Tucker trust each other and fall in love, by forgetting their pasts? I liked her three older friends Flossie, Dotty and Lucy. I received a complimentary copy of this book from Ms. Brown's publisher through NetGalley. Opinions expressed in this review are completely my own."}, {"Review": "Good slow-building romance between two hurting people who can't seem to let go of their painful pasts. Jolene was raised by a mother who was an alcoholic and a drug addict, making Jolene the \"adult\" in the family. After Jolene grew up and moved out, her mom died of an overdose, leaving Jolene feeling guilty for deserting her. Then Jolene's boyfriend also turned out to be an alcoholic who cleaned out her bank accounts. She needed a chance for a fresh start.Jolene's Aunt Sugar has given her a half-interest in the Magnolia Inn, the bed and breakfast that Sugar and her husband run together. He has given his half to his nephew Reuben, who Jolene detests (with good reason). Reuben has no interest in doing anything with his half and immediately sells it to Tucker. Jolene has some great ideas for the inn, but no capital to carry them out.Tucker is the local handyman. He used to be a cop until his wife died in a car accident. Unable to handle his grief, Tucker turned to alcohol and eventually lost his job. Now he works as a handyman during the week and drinks his way through the weekends to dull the pain of her loss. When he heard about the inn, he thought it would be a good opportunity for him. He has the cash to invest and the skills to do the renovations.Jolene wasn't too sure about having Tucker as a partner. She was all too familiar with living with a drunk, and she didn't want to do it again. I liked the way that she and Tucker sat down and laid out their expectations so that there would be no misunderstandings. I enjoyed the development of their relationship. They started as partners, working together to renovate the inn. I loved the easy exchange of ideas, and their willingness to compromise when necessary. As they worked together, their partnership became friendship. There were some terrific scenes of their more lighthearted moments, as well as some emotional scenes as they shared the more painful parts of their pasts. All that time together also gave a simmering attraction time to grow. But both were wary of risking their hearts again. Jolene feared getting involved with another alcoholic and did her best to keep Tucker at arm's length. But she also has a good influence on him after he heard her story. Tucker was buried in guilt over his wife's death, which made getting past it that much harder. He also fought his growing feelings for Jolene because they made him feel disloyal to his wife. It was very interesting to see the mental conversations he had with Melanie as she tried to get him to let her go. There were some heartbreaking moments as Tucker worked his way through that grief. The slow buildup of the feelings between Jolene and Tucker was believable and right for them. I loved seeing them realize that their pasts don't have to define their futures and that they can build that future together.The secondary characters are a huge part of the story. First, there are Aunt Sugar and Uncle Jasper, who were ready to retire and live their dream of traveling. It was fun to follow their travels and see the effects it had on them. I loved Sugar's phone calls back to Jolene and \"the girls.\" Her ability to sense when Jolene needed her was great, and I enjoyed the kernels of wisdom she dropped along the way. I wasn't at all surprised by her feelings as the trip went on. The surprise she had for everyone at the end was terrific. Her three friends, Dottie, Flossie, and Lucy, were a riot. Each of them was very different, but their friendship was bone deep. It was fun to see them rag on Lucy about her actions after romantic breakups. I loved how they supported Jolene with the inn and kept a wary eye on Tucker until they were sure he was okay to be around her. Their Sunday lunches were a hoot and added a bit of lightness when emotions got a little heavy."}, {"Review": "I was given a free copy of this book to read and review for Wicked Reads.With themes of loss and grief and a focus on strong relationships between quirky southern women, this story kept reminding me of Steel Magnolias. I enjoyed the intergenerational relationships and I liked Jolene for her determination as she builds a new life for herself. I didn’t love this story as much as I expected to. In an age of a million property porn instagram accounts, restoration blogs and Pinterest boards, this story feels more 1982 Laura Ashley than 2019 Emily Henderson. Too much of this story feels oddly dated and I struggled to believe in Jolene and Tucker as young Millenials. There really isn’t much romance in this book. Tucker is still grieving at the start of this story and Jolene is constantly judging him and assuming the worst of him. She can’t see Tucker for most of the book because she just sees her mother in him. Jolene is unnecessarily cold and mean to Tucker - right until they get together. The story is stronger when it focuses on Jolene and Tucker dealing with their pasts. It is also strong when it focuses on Jolene’s relationships with her aunt’s group of friends. But this really doesn’t feel like a romance. There is also no heat in this book. It feels like a book that could be borrowed from a church library and I’m guessing that I’m 30 years younger than the author’s typical reader. I’m sure this book will appeal more to a conservative audience of older American women. I am aware that my reaction to this book is partly a cultural thing. I’m a liberal atheist Brit. Jack Whitehall does a great standup routine where he examines the differences between American and British attitudes towards alcohol. I’m too British to even start to understand how the characters in this book are quickly judged and labeled either teetotal or alcoholic. Add in the slightly crazed religious stuff, the cute non-swearing and the prudish giggles about a married couple sharing a bath - and I feel like there’s a cultural chasm between the worlds Jolene and I inhabit. We might speak the same language but I struggle to relate to much of anything else in her world."}, {"Review": "A romance set in Texas, how much better could it get?!  And to top it off, it is set in Jefferson Texas, not far from where I went to high school.  And in fact, my husband and I visited this town last summer and was charmed by the small town, its residents, and the landscape.While the story is somewhat predictable - knowing that Jolene and Tucker would end up together, what adds flavor to the story is Sugar, Dotty, Flossy, and Lucy.  These women take Jolene under their wing and only want to see her happy.  But they are old enough to do what they want and not care what anyone thinks.  I got quite a chuckle out of their antics and matchmaking ways.Jolene and Tucker have their own set of issues to deal with but it somehow works for them as they learn to trust each other a little more and realize that perhaps what they need is looking them right in the face.  I thought it was interested that Tucker's deceased wife would speak to him in his thoughts.  She was a wise woman.  There were multiple times that the story was very touching and I felt a bit misty as if I was right in the center of the situation.This was a fun read and if you are looking for a book set in a small Texas town, in a B&B, and with some sassy characters, then check this book out."}, {"Review": "Although I like a good romance book, this one didn't make me fall in love with it. In the first few chapters, I didn't like Tucker. I was so frustrated with the storyline that I kept screaming at the book...err.. my e-reader. Ignoring that, I found the setting of the story beautiful. I loved the way Tucker and Jolene finally got together. Overall, it is a good romance book, and I think that many romance readers will love it. Magnolia Brown is my first Carolyn Brown read, and I was impressed by her writing. Thanks to NetGalley and Montlake Romance for providing me with an eARC!"}, {"Review": "B&BMagnolia Inn has been a bed and breakfast for many years. Proprietors Sugar and Jasper decided they needed to retire so they gave half of it to their niece Jolene and the other half to their nephew Reuben. They bought a new RV and left to travel the states.Jolene wanted to remodel the inn but Reuben sold his half to a man named Tucker. After working together for a while Tucker and Jolene become friends but he was a drinker which Jolene hated since her mother was an alcoholic. IA great story of loss,finding new love and changing lives. I love Carolyn Brown's books."}, {"Review": "This book was written with heart in hand and words that will make you smile with tears running down your cheeks. That’s it in a nutshell about this book. Jolene led a hard working life; Tucker’s life was filled with dreams and devastation. Together as partners in a B & B Victorian home in East Texas, they renovated, loved the friendships of aging ladies and built a busy life together. I loved this story-line and highly recommend this book to anyone who loves a great read. Thanks once again to this author for writing a book I can read over again and love it."}, {"Review": "What a pleasure to spend time at the Magnolia Inn with Jolene and Tucker. And their friends, Flossie, Lucy, and Dottie, were a hoot. I’d love to be friends with them! The “girls” along with Aunt Sugar, brought it all together, bless their hearts. ”Know what you do when life gives you lemons?” “You add tequila.” Dotty snapped her fingers and did a three-second rendition of a salsa dance. “Or throw them in the trash and make a chocolate cake,” Jolene giggled. “Now you’re talkin’ my language. I love chocolate.”"}, {"Review": "I thought this book was trite and simple and took forever to conclude. I downloaded it for a flight because it was free for Prime members and it served its purpose. Quick and super easy read. I found the characters dull, except for the old ladies, and the storyline predictable but it's pretty clear what you're getting in to. If you're looking for an easy story to escape a cramped plane or a beach read, this is fine. If you want something with depth and a little bit more thought then keep on looking, it's just a soap opera."}, {"Review": "Carolyn Brown is an author that I love for her easy romance, unique settings, and beautiful relationships. In Magnolia Inn, we meet Jolene who only wants to make her aunt and uncle’s B&B a success after they left it to her when they retired. When the nephew on her uncle’s side sells his half of the B&B to a local man who is living in grief and gets drunk every weekend she doesn’t know what to expect but she does know that living and working with a weekend drunk is not something that she is willing to do. There is less romance and more about figuring out life in Magnolia Inn. Tucker is a widow, he cannot figure out how to get past his wife’s death. Jolene grew up with an alcoholic mother and an abusive boyfriend. They both have demons and push each other, gently, to work through them. There is nothing easy about what they have to do but together they can do it. I love Jolene’s easy understanding of Tucker’s loss but she also has a tough love stance. She knows what she is willing to accept and isn’t willing to accept anything less. Tucker realized that there is something special about Jolene and with nudging from his dead wife starts to open his heart and his soul to her. By proving that he can be the man she needs to him to be, he allows her heart to heal from all the heartache that her past has left within her. "}, {"Review": "Although I like a good romance book, this one didn't make me fall in love with it. In the first few chapters, I didn't like Tucker. I was so frustrated with the storyline that I kept screaming at the book...err.. my e-reader. Ignoring that, I found the setting of the story beautiful. I loved the way Tucker and Jolene finally got together. Overall, it is a good romance book, and I think that many romance readers will love it. Magnolia Brown is my first Carolyn Brown read, and I was impressed by her writing. Thanks to NetGalley and Montlake Romance for providing me with an eARC!"}, {"Review": "Dream home or Nightmare?A quaint Victorian home seems like a dream to Jolene and the start to a new life for her after some toxicity in her life with her mother.Tucker the carpenter at her aunt's B&B is not quite the happy camper.He's acquired part of her dream and won't let go of it.Tucker is bitter after his wife's passing and seems to take it out on the first person he encounters in his inner circle.Restoring the inn and rebuilding Tucker's heart may be two jobs she takes on blindly.I simply couldn't get into this but perhaps you'll feel differently.Thank you to Carolyn, the publisher, NetGalley, and Aldiko for this ARC in exchange for this honest review."}, {"Review": "*I'd like to thank the Publisher for supplying me with this ARC for an honest review.*What a slow and frustrating read!Jolene and Tucker are forced by circumstanced to partner up and work on remodeling the Inn left to her by her aunt and uncle.Most of the conversations between the two throughout the book are about the restoring of the inn. I'm sorry but if I wanted to read about all that, I'd have opted for Home Remodeling for Dummies, instead.We spend 80% of the book with Tucker having conversations with his dead wife and trying his best to not let go of her.When I opted for this book, I was hoping for a healing romance. Maybe a broody hero and an emotionally stunted heroine. A couple of funny incidents while remodeling the home too, perhaps. Instead, I got a cardboard heroine and a - I can't even think of an adjective for what that hero was.I can't think of any scene with Tucker where he was not having an inner conversation with Melanie - his ex-wife or was comparing Jolene to her.Tucker's wife died while going to buy something from the store when he could've gone himself. He was a cop who got fired for drunk-driving after her death. He spends every Saturday drinking himself to a stupor because Saturdays used to be date nights with his wife. He proudly claims that he's only a weekend drinker.Jolene, on the other hand, had an alcoholic mother. She also has had a tough life due to her mother and a father who left. Her only purpose of life right now is running the inn.I couldn't at all emotionally connect with Tucker and Jolene at any point. Tucker talks about his guilt and keeps telling his dead wife that he misses her. But I never felt any of his pain. And we read about Jolene's past difficulties but I don't think the writer touches down on the emotions and feelings of Jolene regarding those things.The romance was unconvincing. It should be when you have a hero spending majority of the book thinking of his dead wife and ensuring that no \"spark\" with Jolene hinder his connection with his dead wife. Yes, there's a 'spark' at times when they touch. That was the extent of their romance for a long time.I was hoping for some pining or emotional conflict from Jolene for growing feelings for an emotionally unavailable man. But there wasn't really much of that from Jolene. And I get that Tucker lost a wife and he's grieving her. But in that process, his romance with Jolene fell flat.There was aunts and family members with their own shenanigans. I wasn't interested by any of it. I found myself waiting for parts with them to end. The pace sort of picked up at the last third of the book. But that was too late to redeem the book for me.If I wasn't clear before, this was a disappointing read."}, {"Review": "3.5 starsAnother great story from Carolyn Brown. Also, another story from her where the characters talk to themselves (or dead relatives) a bit too much. I just need to resolve myself to the fact that this author uses that device a lot and I either have to live with it or quit reading her books. For the most part, I enjoy her stories. So, for now, I’ll have to live with it I guess.Tucker is a very sympathetic character. When he’s first introduced I didn’t think that would be so, but as he started interacting with other people his kindness and good heart shone through. My issues with this author having people talk to themselves did not extend to this character because it really worked for him and his part of the story. If such things had been kept to this one character it would have been completely fine.In all ways but one I liked Jolene. I felt she was way too judgmental of Tucker, even while understanding her reasons for judging him so harshly. It’s not so much her strong feelings about his drinking that annoyed me, it was that she seemed to think there was some kind of bad seed within him. Her aunt had taught her that nobody is all good or all bad, and she often thought about that when thinking of Tucker. But not in the “hey, he’s a great guy but I know there has to be something bad in there, too” way. Nope. It was more like “this guy is bad news but I see that goodness trying to peek through”, which made no sense with how giving his character is throughout this story.Needless to say, Jolene and Tucker had things in their own lives to work through before they could see if there could be something more than a friendship and partnership between them. Throughout the whole story there was definitely chemistry with the characters. I was truly rooting for them to resolve their issues and find a way to reach out to each other.While this wasn’t my favorite Carolyn Brown book, it did a great job of keeping me turning the pages. **I received an ARC of this book courtesy of Net Galley and the publisher. All opinions expressed in this review are my own and given freely**This review can be found at the book blog All In Good Time"}, {"Review": "Jolene Broussard's Aunt Sugar and Uncle Jasper are set to start their new life exploring the U.S.A. in a new RV. They have signed over half interest in The Magnolia Inn, their Victorian home and B&B to Jolene. Too bad they signed the other half interest over to Jasper's nephew, Reuben who was always being mean to her during her visits as a child. Jolene has decided though to pull up her big girl panties and deal as best she can with Reuben hoping he will be easier to deal with as an adult. Nope! When they meet to discuss plans for renovating the inn and reopening it he is just as nasty as he always was. The good news that comes out of that meeting is that he put his half interest up for sale. Jolene is happy to hear this but worries about who might buy his half interest since she is broke and sure can't. Will she be able to work with the buyer?Tucker Malone is living in a trailer and doing carpentry work to keep himself busy after the tragic death of his beloved wife Melanie in an automobile accident. It's been a few years and he still isn't over her death and isn't dealing with it in a healthy way. Getting drunk every weekend is definitely not healthy. He decides that getting invested in the Magnolia Inn might help. What he finds is another soul with a sad history of her own in his new partner Jolene. She spent many years dealing with her alcoholic mother and she still hasn't moved on from that mess. Misery loves company they say so Jolene and Tucker should get along just fine. Will they?The Magnolia Inn by Carolyn Brown is a great big helping of comfort food with characters that will leave you with that warm feeling of having met some great new friends. You laugh with them. You experience joy and sadness with them. You can't help but come away at the end of this story with a wad of used tear-filled tissues and then a big smile on your face. Carolyn Brown never disappoints her readers and The Magnolia Inn is no exception!"}, {"Review": "Rating: 4.5 StarsJolene Broussard’s life is about to change. Tucker Malone seems to have a lonely existence. He’s like a bulldozer that had me looking forward to what I might see on the next page. He also had me wishing that I could be around to help.Tucker reminds me of Don Johnson in the movie Long Hot Summer – I wonder if he has a dimple. The problem I had was trying to think of who would portray Jolene – wonder who the author would want. Once I finished this book, I wanted to go back and actually watch the movie.I came to love our author’s secondary characters. They gave some extra life to the story. Even though they didn’t talk directly to us, they’ll make you feel as if you are a part of what’s happening. I wouldn’t want to get rid of any of them because I’ve enjoyed getting to know them – well, maybe just one and you’ll understand when you start reading.This author will remind you that you don’t need a lot of intimacy to have a great romance. Building the world that our characters are in is what becomes important. Without that world, would they even have met? The inn even becomes an important character to this story – it’s one thing that connects everyone. Any type of relationship that blossoms here is just secondary. People can get pleasure out of the simple things. It’s not hard to see that even though we may have challenges in life, the care of the right people will help make those burdens easier to bear. I can’t wait for warmer weather to get here so I can find the perfect spot with the warm sun shining down as I read this book for the second time.I was not compensated nor was I required to write a positive review. The opinions I have expressed are my own."}], "Genre": "Romance", "ID": "40227501", "Desc": ""}