{"Name": "Searching for You", "Image": "https://images.gr-assets.com/books/1539122798l/38484810.jpg", "Reviews": [{"Review": "Finally getting to know Sophie in Searching for You was a delight. Forced to grow up much too soon, yet still lacking in a certain maturity, her character goes through tremendous growth throughout the story. Her previous decisions were those of a desperate girl and her change from that desperate girl to competent young adult is my favorite aspect of the novel. And, oh, Reinhold, how I just wanted good things for him. His character really tugged at my heart, and he deserved all of the good things that his hard work was beginning to give him. Despite his flaws, and probably because of them, he is an endearing character.The plot line is entertaining and well-paced. Emotional upheaval as well as physical danger come into play, sometimes of the characters’ own making – but isn’t that just like us, to get ourselves into a predicament, then pray God will help us out of our self-made problem? Another thing I love about the story is how is displays so well allowing God to mold our life instead of trying to push it into a form that it was never meant to fit. For Sophie, and to an extent, Reinhold, things turn out much differently than what they had been fighting toward at the beginning of the story. Coming to terms with new paths and the loss that comes with are both poignant and propelling elements of the story. It was also lovely to see Elise and Marianne again at this story’s end.I’m a bit sad that this series has come to an end. It’s been such a joy to anticipate and read each book in the series, and I don’t know that I can pick a favorite between the three novels. However, I’m always eager to see what Jody Hedlund has for her readers next and already looking forward to her next release. Although I do think this story would be enjoyable as a standalone, personally, I recommend reading these in order, as the overall story build with each sister.I received an advanced copy of this novel from the publisher, and a positive review was not required. This review is my honest opinion."}, {"Review": "While it took me a bit to get used to Sophie grown up, the concluding story of the Orphan Train series sucked me in just like the previous novels and immersed me in the period. I loved how protective Sophie is of Olivia and Nicholas and devoted to keeping them together. She doesn't have many choices or resources, but she's scrappy and has made a life for them, however destitute. I've always been fascinated by the history of the orphan trains, and this book was different than the others in the series since Sophie plays the role of an orphan and also sacrifices for Olivia and Nicholas the way a mother would. I loved seeing Reinhold get the farm he worked so hard for and the relationship he built with his neighbors. He and Sophie are drawn to each other not only because of their past history as family friends, but the powerful attraction that springs up and fills the book with romantic tension. I loved their chemistry and the way they cared for each other! The plans they make to try and get Olivia and Nicholas back bring them even closer together, but also brings a vulnerability into their relationship dynamic. The themes of abandonment, guilt, and forgiveness brought depth and I was glued to the pages as I read, and loved the way the characters and story came to life.(I received a complimentary copy of the book; all opinions in this review are my own)"}, {"Review": "Ah! Wonderful end to this series.  Jody Hedlund has given us a wonderful series about the women and children that were part of the orphan train emigration in 1859. Her research is impeccable, laying a solid foundation as she masterfully crafts the final heart-stirring story in this series. Each book can be read as a stand-alone, as it follows three sisters in the 1850's, each sister having her own story. What I liked about this book is that it told the story from the perspective of the orphans that were placed in the homes in the Midwest at this time. Hedlund shows both positive and negative results from these placements.  Separated from her sisters by a series of unfortunate circumstances and misunderstandings, Sophie has been on the run for two years. In Sophie, Ms. Hedlund has given the reader a spunky heroine. We find that she has survived much hardship, willing to sacrifice for the two young orphan children she has grown to love. I think I liked Sophie's story the best. She was the youngest of the three sisters. Some of the decisions she made initially were decisions of a young girl, not an adult, who had to survive. As she matures, she is filled with the burden of guilt, thinking herself unworthy. Reinhold Weiss is a fabulous hero. In Reinhold and Sophie, Hedlund gives us flawed characters that are searching for hope. They realize that God can create something beautiful out of their brokenness. Hedlund is a master at weaving a spiritual thread effortlessly throughout her stories.A couple of my favorite quotes:\"No matter how lost you feel at times, always keep His light burning inside you.\"\"He never treats us as our sin deserves.\"\"Sometimes God allows us to sink down in our own misery until we reach a low place where we're finally ready to look up and reach out for Him.\"\"We're human. We break things. It's what we do with the brokenness that counts.\"I voluntarily reviewed a complimentary copy of this book which I received from the author/publisher. I was not required to write a review. All opinions expressed are my own."}, {"Review": "Full review and favorite quotes on FaithfullyBookish.comSearching for You is a gripping story of love, want, and need. Life's choices aren't always one way or another, the path is winding and the way difficult to discern without nurturing guidance. Despite her youthful naivete, I admire Sophie's gumption and determination to do what (she thinks) is best for them all. Reinhold is one of the good guys without a doubt. He's not perfect but he acknowledges that fact and then punishes himself for it, bless his heart. Friends, family, and affection take center stage in this thrilling conclusion to the Orphan Train series. Hedlund brings this time period to life from the dark metropolitan alleys to the wide-open Midwestern farmlands. I highly recommend this book and its sisters and they are all at home on my all-time favorites shelf!I received a complimentary copy of this book from the publisher and was under no obligation to post a review. The opinions expressed are my own."}, {"Review": "What a wonderful story and a beautiful wrap up to the Orphan Train series. I have read every book in this series, including the prequel novella, yet I believe that Searching for You could be read and enjoyed by someone who had not read the other books that precede it.These two main characters were ones that I really connected with and longed for them to receive their happily-ever-afters. Sophie made some mistakes in judgment through the years, doing what she could to provide for two orphaned children that she loved as if she was their own mother. Her journey was quite a trying one.I was so happy to see things begin to work out for Reinhold, and to watch him grow to understand that he was not the same as his father. He was actually a very kind man, who cared deeply. I loved the way Sophie and Reinhold ended up thrown together in this story and the way it all played out!I received a complimentary copy of this book. All opinions are my own.You can read this review on my blog:https://brittreadsfiction.wordpress.c..."}, {"Review": "Searching for You by Jody HedlundGenre: Christian Fiction/RomanceFormat: KindleTimeframe: 1859Location: Mayfield, ILMain Characters: Sophie Neumann: 18 year old runaway immigrant Reinhold Weiss: Immigrant now farmerJakob Weiss: Reinhold’s younger brotherBarclay, Euphemia and five nearly grown boys: Reinhold’s good neighborsOlivia and Nicholas: Two orphans Sophie took in as her own 2 years agoAnna: Sophie’s friend from New York, also orphanA teenager and orphaned, Sophie ran away from her sisters two years ago, taking with her the two orphaned toddlers who were in her care, whom she loved as family. She learned to be a street kid, doing whatever she could to feed and shelter the children, Olivia and Nicholas.Two years later Sophie and her friend Anna were in trouble because of a street gang they’d become a part of. Pretending to be sixteen they took the orphan train to the mid-west with the children to start a new life somewhere far enough away from New York.There, against her better judgment, but with no choice in the matter, Olivia and Nicholas were separated from her by an adopting couple. Sophie was taken in by kind and generous Irish immigrants, Barclay and Euphemia Duff, who with 5 sons, needed household help from an \"older\" orphan girl.Things didn’t turn out the way Sophie had imagined. She had spent all this time avoiding her sisters who had new lives of their own. Now faces from the past came into her present. Reinhold and Jakob Weiss, who had been like brothers to her in New York, have their own farm not far from her host family. The last thing she wanted was for them to inform her sisters of her whereabouts.**********************************************This was a great story, but had far too much sexual tension for my taste. On top of that, through all the emotional issues, prayer wasn’t considered — just controlling and avoidance, kissing and pushing away, wanting and resistance. It was just a bit much. Without all that it would have been great - just the already good story, plus bringing God into it. There could still be tension, but without all the touching and manipulations. Near the end God became a consideration for the two main characters, but by then it just didn’t seem organic.Other than that it was good."}, {"Review": "Series books and I have a love/hate relationship. I love series because the story continues from one book to the next, and we get a more intimate look at each character. However, like with Searching for You, the series must come to an end, which this reader is not a fan of. The more and more I review the harder and harder it is to put the emotions the story evokes into words.I've been looking forward to Sophie's story since reading Together Forever, and Miss Hedlund does not disappoint with her final installment of this series. This quote \"Sometimes God allows us to sink down in our own misery until we reach a low place where we're finally ready to look up and reach out for Him.\" is the theme of the story. Sophie struggles with her situation, lack of control, and her inability to fix the circumstances that both Nicholas and Olivia are in. Through these struggles Ms. Hedlund places the reader smack in the middle of all that is going on which makes them feel like they are experiencing everything the characters are.The research that Ms. Hedlund puts into this story is evident with her care to the true story of orphan trains. Reinhold is a swoony hero. Not only is he handsome, he is a man of integrity, and his care, devotion, and concern for Sophie and the children is just what you want a hero to be. Sophie is a spitfire which is one of the many qualities I enjoy in a heroine. Overall this is a great finale to a wonderful series. You can read this as a stand alone, however I recommend you read the entire series from beginning to end so you can enjoy the series more fully.I highly recommend this book!Disclaimer: I received a copy of this book via the publisher as a member of a street team. I was not required to write a review. All thoughts and opinions are my own."}, {"Review": "I was fortunate to be able read all three books in the Orphan Train series all together (one benefit of waiting for an entire series to be published before starting book one). And I am so glad that I could, because as soon as I started the first book in the series I knew I wanted more of this charming family facing such difficulties. More of swoon-worthy romance. More challenges overcome through faith and community. As soon as I finished each book I eagerly picked up the next. While each of the three titles in the Orphan Train series could be read as a standalone, I believe that it is much better to read them as a series, better to understand the depth of each of the characters, their relationships and their journeys, separate at times and yet each interconnected.Searching For You is the third book in the delightful Orphan Train series. This historical Christian series is absolutely delightful, combing heartfelt stories of challenges overcome with the love and bond of sisters, as well as amazing (swoon-worthy) romance. In Searching For You the series is brought full circle with the story of the youngest Neumann sister, Sophie who has been missing since she ran away in book one. Sophie has under her care two young children whom she loves as if they were her own. She has sacrificed everything to protect them and keep them together as a family, even as it cost her a life with her sisters. When she and a friend are forced to flee New York they find themselves on an orphan train, with every intention of leaving before being placed with new families. But the draw of a new family proves too strong and soon the little make-shift family find themselves separated in the town of Mayfield. The reappearance of family friend Reinhold Weiss provides Sophie with the perfect opportunity to reclaim her children, even if it means a marriage of convenience and the risk her sisters will find her. But hiding her growing feelings from Reinhold might prove difficult as he continually assists her and a spark heats up between them. But can their arranged marriage be a forever one? This third book was a wonderful addition to the series. I liked Sophie and her determination to keep her little family together, even as she is weighed under by grief for her failings. Once again the chemistry and connection Hedlund creates between her two main characters is tangible - you can almost feel the sparks leaping from the page. I loved Sophie and Reinhold’s relationship, their progression from friends and helpmeets to sharing their feelings with each other. This truly is a beautiful and thoroughly enjoyable series and I highly recommend it to readers who like Christian historical romance. Find more reviews, reading age guides, content advisory, and recommendations on my blog Madison's Library"}, {"Review": "Perfect end to the series <3Reinhold's happy ending has been long coming and well deserved. Not to mention Sophie's and all the mystery surrounding her.Both need healing, but, most of all, to come to a stand of surrender. To embrace the new life despite any past mistake, rooted in grace and love through which life flourishes.Something that I have absolutely loved in this series is how Jody Hedlund creates space for growth. Though not uncommon during their time period, the characters have to make some decisions quite young. I loved how the author was able to show the maturity with which they take up these responsibilities while also allowing insecurity and naive mistakes to be shown and worked on.I was sad to say goodbye to these characters, though very excited to see that Jody has next :)*many thanks to the publisher for providing a review copy; this is my honest review."}, {"Review": "The book fog is real y'all...WOW! I have loved this series right from the very beginning. Jody Hedlund knows how to suck a reader in deep! The heartache, the hope, the faith, the endurance, the ability to rise above from the broken pieces--this is a series that will stay with you long after you've turned the last page. As Jody shares a bit in her Author's Notes at the end of each piece, her research of the orphan trains and the Children's Aid Society is impeccable. She takes readers on a journey deep into the trenches of what life was like for orphans running the streets of NYC in the mid 1800's and how the orphan trains changed their lives--for better or worse.It didn't take long in the story to see just how low Sophie's life had ended up. My heart quickly broke for her. Life had taught her that it was easier to expect the worst in life so that she wouldn't be disappointed in hoping for better. She had come to a point where even the concept of good things happening for her were unfathomable. Despite her love for little Olivia and Nicholas, her heart no longer believed she could be loved herself. She felt like she was a throw-away. This story didn't give her a quick and easy happy ending--it slowly provided opportunities for her heart to mend and grow. As a reader your emotions will rise and fall with each bump in the road she hits as well. Sophie is one character you won't soon forget.Another character I quickly grew to love was Euphemia. Have you ever happened to run into just the right person to give you just the right wisdom and encouragement at a needed time in your life? This was Euphemia for Sophie. She loved Sophie when she felt unlovable. She spoke truth into her life where Satan had torn her down. She provided her with means to give her a jump start in life instead of complaining over her own losses. She shared her own story to inspire Sophie to hope for more. She was truly a remarkable woman.A piece that was interesting to me in the story was the fact that Sophie and her friend Anna lied about their ages in order to be able to join the orphan train with Olivia and Nicholas. It wouldn't happen in today's world with all of the different forms of identity we carry, but it made me wonder how often things like that would occur. I myself am in my early thirties, but every now and then I still hear people ask if I'm still a teenager. I was 24 (yes, 24!) the last time I was asked if I wanted a kid's menu. As a young adult I was constantly met with people wondering \"who I belonged to.\" Would young adults struggling to survive in the city pose as younger children to board the trains and hope for a better life? This thought honestly has me curious.Although I love Reinhold's character, I have to admit this book felt a bit like \"third time’s the charm\" for him. I love his character and his relationship with Sophie, but I wish there wasn't complicated history with her sisters. I loved that he was able to understand her better because of their childhood history together, and in a way he wrestled with the same feelings of inadequacy as Sophie did. Together they really were perfect for each other. I just wish he wasn't someone desired for her sisters in the other books.This was truly an incredible series. I feel as if I'm in mourning over the fact that it has come to an end. I would highly recommend this series to historical fiction fans. Each of the books should be read in order as they are all connected and I wouldn't consider them stand-alones. I highly suggest you take the time to read them-- you won't be disappointed!*I received a complimentary copy of this book from the author through NetGalley. Thoughts and opinions expressed are mine alone."}, {"Review": "I have been looking forward to reading Sophie’s story. It wasn’t easy to wait, but oh so very worth it! Jody Hedlund takes readers on a heartfelt journey through the pages of this book. I felt like I was right in the story with the characters. My heart broke for Sophie and cheered for her breakthroughs and successes!Even at her young age, Sophie had a mother’s heart and a deep love for the two children, Nicholas and Olivia, that were left in her care. She made some very tough choices and sacrificed much to ensure that Nicholas and Olivia were safe and that they had someone to love them. Sophie carried with her a big hurt and misunderstanding. She often blamed God for the hardships she has faced, and her feelings of being abandoned by God. Sophie grows a lot during this story and it was a beautiful thing to be a part of!At its core, this story takes a deep, soul-searching look at the inadequacies that we all feel in ourselves at one point or another. Through the eyes of the characters, we can learn that the inadequacies are lies. We need to know who we are in God and trust in His plan for our lives.One of my favorite lines from this story reminds us that, “Sometimes God allows us to sink down in our own misery until we reach a low place where we’re finally ready to look up and reach out for Him.”Searching for You is a story that you will want for your “keeper” shelf. A story that you will want to pull out and read again. There is so much to love about this story! Multifaceted characters, a deep, heart-warming plot, with page-turning delights. Start to finish, this story wove itself around my heart!(I received a copy of this book from the author/publisher in exchange for my honest opinion. I am not required to write a positive review. My thoughts and opinions are my own.)"}, {"Review": "I really enjoyed this book.Jody is an exceptional writer. Her writing has a way of making you feel like you're in the story with the characters and feel what they are feeling.I admire Sophie for trying to do right by Nicholas and Olivia. Everyone has dirty laundry and Sophie is no different. She's stubborn and strong and always wants to everything all on her own! Wow! Watching her change was a real treat.I really admired her for that reason alone because she finally did what was right.Reinhold is a favorite too. He has demons from his past that he needed to deal with and I really admired him and also enjoyed watching him change.I guess what im trying to say is that we can't do it alone. I feel that without Jesus I am nothing! My life would certainly feel very empty. People need the Lord. I just wish they'd open their eyes and look to Him.Grace is offered through Jesus. Euphemia is certainly a blessing . I loved the way that the Lord was using her. She's definitely my favorite person. I wished my mom was more like her.I will be looking forward to reading more from this authorI strongly recommend this book and I received a copy from Netgalley. All opinions are my own"}, {"Review": "First of all, I want to thank Jody Hedlund once again for allowing me to be a part of the influencing team for this novel. I have not not enjoyed one of her books yet. And I doubt I ever will as all of her books are very well written and enjoyable to read. The story was a very heartwarming conclusion to the Orphan Train series. I have read all three books in the series and enjoyed them all. I loved “getting to know” the characters throughout the entire series and am happy to see the series end in such a way. I would definitely recommend this book, and entire series, to all those who enjoy sweet, historical romances. I look forward to reading more of the wonderful stories that Jody writes!The cover is very intriguing and sets the mood for the book. I’ll give it 4 stars!I’ll also give the book itself 4 stars as I personally liked the first book in the series the best. However, this book is close in second place!"}, {"Review": "Reinhold Weiss!! Swoon!! He has to be one of the most awesome heroes I have read this year. He was a hard working young man who was so disciplined and dogmatic in his work but he was so gentle and loving too.. A man of integrity. And, oh so handsome. I am obviously in love with Reinhold, but I also loved kind hearted and devoted Sophie. She was determined to make a good life and help her two charges who were orphans. This book was a book with historical details of the orphan train. It gave the reader insights as to how it was back then for orphans. It was also about marriage of convenience. Which I happen to love. I highly recommend it. This was the third book in the series, but could be read as a stand alone. It would be best to read them in order though, in ny opinion.*I was given a copy of this book by the publisher. This is my honest ooinion."}, {"Review": "This series has been as educational as it has been entertaining. I had never heard of the Orphan Trains or the huge amounts of Children that were relocated and placed with rural families in the ‘west’. Jody Hedlund has done an amazing job with each of the 3 books (and the intro novella) - detailing every angle from the perspectives of all involved. In this final book we get to see this from the eyes of those being placed, albeit from Sophie’s situation, and she’s not quite child. But we do get an eye opener into what had to be done to survive then - and we get to see the direction her life took after she disappeared from her sisters lives. Elise & Marianne are both settled, and perhaps a little unrealistically to wealthy men. How will Sophie react once she learns this information, she is harboring a lot of anxiety about seeing them, and perhaps the perceived judgement she thinks they will put on her. This story brings us back again to ever constant Reinhold Weiss, who we’ve seen in both previous stories. He’s finally making his own way in Illinois and desperate to bring his sisters to his home. As the orphan train arrives in Mayfield again he never would have guessed who it would bring and how it would change his life. This story has a little more realistic feel to it - with us seeing life through those that had to work hard for what they had back then. The balance between the good and the bad, and as difficult as it was to read, I’m glad Hedlund had us deal with the issues of those who were not good foster parents. Poor judgement, bad treatment, abuse. Then there is the Duffs, what a lovely family. They made a great addition as important secondary characters. I’m normally not a fan of too much over analyzing of ones self and why you can’t step out and do that which we all know would bring happiness, but I kind of felt this time that both Reinhold and Sophie’s self reflections, were a good way to develop the pace of the relationship. The ending was a little rushed for me. Beautiful series that I’ve started collecting in paperback, which means its a winner. Thanks to Netgalley for the eARC. This is my honest review. "}, {"Review": "My mother was born about 60 years after the setting of the Orphan Train Series, but her plight could easily have been that of one of the orphans of the time. Her father died leaving a widow and two very small children. In that time period, widows usually had an extremely difficult time raising small children alone. So my grandmother did surrender her two small children, quite reluctantly, into the care and keeping of a church orphanage.In Jody Hedlund's series of three books about the plight of a few of the children whose fate was to begin life away from the city and move to the wilderness area of America - the country life, and be part of families who were suppose to provide love, care, food, shelter for them is beautifully and succinctly portrayed in the series. The culminating story of the youngest sister, Sophie, and her journey is heart rending.The story opens with Sophia in New York and she is embroiled in the gang life believing she is fine. She then witnesses her boyfriend, head of a gang, murder someone. She flees for safety taking the two young children (not hers biologically, but hers emotionally) she cares for and joining an outgoing Orphan Train loaded with children of many ages being sent West to join new families.The reader's heart is wrenched at the tearing scene when she is parted from the two young children as they are placed in a different home. And then later at an attempt when she tries to see them but their new \"father\" attacks her.Her actions are definitely questionable. But the situation is heart breaking.The book and the entire series is one I can heartily recommend.[A note about book #3:It alludes to child abuse and sexual assault and also the intimate emotional feelings of newly weds. Because of this, I would hesitate to recommend the final book for younger than 18 years.]DISCLOSURE: I was provided a complimentary copy to facilitate a review. Opinions are my own and are freely given."}, {"Review": "Bringing the Orphan Train series to a satisfying conclusion, \"Searching for You\" is another heart-stirring historical tale from the talented pen of Jody Hedlund. Fans who enjoyed the first two books of the series will be pleased to focus on the tale of the third Neumann sister, Sophie, as we finally learn what became of her and the two young children she'd rescued from the streets. Sophie's tale has a bit less of a rags to riches theme than the prior two novels did, and I loved watching Sophie fight for what she believes in, putting the best interests of her young charges before her welfare, often to her own detriment. I also liked getting reconnected with Reinhold, who we had gotten to know fairly well in the second novel, but not the way we do now in \"Searching for You\"! Both Sophie and Reinhold show selflessness in a way that will inspire readers and point them towards a loving God who has given up everything for our good.And while the first two novels in the series had their own share of romance, I must say that this third and final book in the series fairly sizzles with romantic tension! When I first started the novel, I thought things between Sophie and Reinhold were going to unfold in a fairly predictable fashion, but I assure you that Hedlund has thrown in plenty of twists to keep readers guessing. Yet even more than their romantic journey, watching these characters overcome their pasts and their feelings of unworthiness was satisfying indeed, making the end result all the sweeter for the trials they'd been through. The theme of the novel, of God being able to do even more than we can ask or imagine, is brought to life in a truly moving manner and will leave a smile on your face.Hedlund's final novel in the series brings things full circle, and I have no doubt that her faithful followers will enjoy \"Searching for You\". I award this novel a solid rating of 4 out of 5 stars.Book has been provided courtesy of Baker Publishing Group and Graf-Martin Communications, Inc."}, {"Review": "Searching For You by Jody Hedlund is the third book in the Orphan Train Series. I highly recommend that you read this whole series as a group for an enjoyable, educational experience. This book focuses on Sophie Neumann, the youngest sister of the Neumann family. It also deals with what happened to orphans after they were placed in a home in the 1850’s. The journey is a long one for Sophie. She has experienced all kinds of hardship after her sisters have left New York City. She has fought to keep two small children, Olivia and Nicholas from the evils of harsh city life. Sophie is the only mother they have known since they became orphans. The “searching” means different things to each character. Sophie’ sisters, Elise and Marianne are searching for her. Sophie is searching for peace and security for the children and herself. Rienhold is searching for a way to be self sufficient and a way to break free of the stigma of memories of his father’s temper. They are all searching for what God has for them. Can they trust that God has everything under control and that He knows best? This is a fitting conclusion to the Orphan Train trilogy. You can count on Jody Hedlund for a sweeping storyline and great historical detail. She pens characters with flaws that we can identify with. The faith element is such that all can reap the spiritual truths in her books. The romantic matchups exhibit the uncertainty and lack of confidence that can creep into relationships. Ms. Hedlund shows that honesty is something to be sought in any family connection and that reliance on God is a key to harmony. *I received a complimentary copy of this book from the publisher on behalf of the author. I was not required to give a favorable review. All opinions are my own.*"}, {"Review": "Searching For You is my favorite book in this fabulous series. Connecting with Sophie again and following her path through this last book of the series is a sweet and poignant journey. It's an education into the lives of countless orphans transported out of New York City during the 1850s. This is a coming of age so to speak, as Sophie grows as an individual seeking a better life for herself and her little charges, Olivia and Nicholas. Disappointment, heartache and challenges are encountered countless times, but Sophie's love and devotion to \"her\" children keep her moving forward. Bad choices begin to change to better choices along the journey to a stronger and healthier life, but until Sophie surrenders to God her life remains somewhat chaotic. Human connections eventually touch Sophie's heart, and hope, faith and trust begin to take place. Although this is the last book of a series, it could easily stand on its own, but by all means read the entire series.Disclaimer: I received a complimentary copy of this book with no expectations for a positive review. All expressed opinions are my own."}, {"Review": " Sophie knew it was time to stop running from her mistakes and the brokenness of her life. She had to face her sisters before she could move on. She had to do it for them, for her, for them all. (Sophie) Was it possible that God could change him into a better man? If Jakob hadn't lost faith in him, maybe God hadn't either. (Reinhold) It's really hard for me to write up a review for a book that touched me deeply. Hedlund knows how to compose a story that will stay with me for a long time to come. I experienced so many emotions with this one, even to the point of shedding real tears for some things that happened. I always wonder if the author experiences some of the same as they write! My heart ached for Sophie and her feeling so inadequate and bogged down with guilt she's had for so long. Only relying on herself instead of the One who can carry those burdens for her. She's felt like she's made too many mistakes to find favor with God, but that's where His grace comes in to play! And I've admired Reinhold from the very beginning. He's the kind of man who's had to grow up young because of the destitute poverty his family went through. Desperately trying to help provide in any way he can. Also struggling to be the opposite of what his father was, an angry & violent man. He takes on a young man named Jakob that he had saved from the orphanage and strives to make a living from the farm he's purchased. Finding satisfaction in hard work & toil of the land. I loved the moment Sophie and him meet back up when he learns she's living with his nearest neighbors, the Dun family. Euphemia is the mother figure she never had and takes her completely under her wings, reminding her of God's love for her no matter her mistakes. I love it when side characters play a major role, I would have loved to be one of her “kids”! As you can probably guess, these two fall in love, and I love the journey they take to do so. The road is never straight or easy for them and they must overcome a lot to get there. Lastly, there are so many quotable quotes for me to save, reminders of God's truth that echoed in my own heart. I admire authors who let Gods light shine and allow Him to use their words to touch my own life. I always find this in Jody's books! The riveting conclusion of the Orphan Train series comes at last, but this story will resonate with me for a long time. The characters wrapped themselves around my heart through all three books and it's going to be hard to say goodbye. Knowing they all get their happily-ever-after will help ease the sting! I've enjoyed this book so much and think Hedlund wrapped it up perfectly. Please be sure to read the Author's note at the end; I'll conclude my review with this because she puts it into words so well: It was also my prayer in writing this story to help you—wherever you are in your journey—learn to let go of your burdens and guilt, to hand them over to the One who is waiting to bear the weight for you. He can turn your brokenness and messes and shape the into something beautiful and unique and unexpected—if you just let Him. *I received a complimentary copy via Netgalley and Bethany House publisher on the authors behalf. No favorable review was required, all opinions are my own. *"}, {"Review": "If Jody Hedlund's track record for excellence in writing heartwarming, page-turning, inspirational romantic fiction hasn't already won you over, then the stunning cover of Searching for You should have grabbed your eye and beckoned you to have a closer look. I don't know if I'm the only one like this, but when I have an author who I love, (I'm talking about Jody Hedlund) I don't want to read the back of the book or even read reviews, although for some reason I get a little disappointed if I don't like the cover. Anyway, when I have an author I love I just want to read the book as organically as possible, no spoilers or premise. I want to go in \"blind\" and just travel along through the pages and trust in the journey my favorite author has in store for me. Jody Hedlund does not dissapoint!Searching For You is the final book in the Orphan Train series. Searching For You is the story of Sophie Neumann, the youngest of Neumann sisters who has been \"missing\" for years. Sophie is such a dear, loving character. I think she is my favorite of the sisters. She has been caring for a pair of orphans and has a fierce inner mother bear that comes out when she needs to protect them. I once heard that being a mother is like ripping your heart out and having it walk around outside of your body and I think Sophie felt like that through parts of this novel. I loved the secondary character Euphemia Duff and all of the extra love and positivity she had and freely gave to those around her. I have loved Reinhold's character in all three of the novels and chuckled as he tried to keep his marriage of convenience, strictly platonic. I appreciated the message that God can take the broken pieces of our lives and the mistakes that we have made and an turn our lives into something beautiful. All we have to do is reach out and let Him. If you love historical fiction and a sweet romance than you will love Seaching For You.Thank you Bethany House and Net Galley for the free e-copy of Searching for You to read in exchange for my honest review. The opinions expressed here are my own."}, {"Review": "I have been looking forward to this book for so long, and it sure didn’t disappoint. Now it can be read alone, but I would definitely start with the first one and savor each one, they are so good!This is Sophie Neumann’s story her survival and hopes for a secure home, and you will follow her and the two little ones as she makes another attempt at finding a home.We are also back with some of the other characters that we have come to know and love, and there are some great up-dates, I know this is the last book in this series, but I would love to continue on in their lives.Come and get lost in another great read and a conclusion to a great series.I received this book through Net Galley and the Publisher Bethany House, and was not required to give a positive review."}, {"Review": "Jody Hedlund’s third book in the Orphan Train Series, Searching for You, is a beautiful, influential, and enriching story that readers will adore. From page one, Hedlund brings to life the struggle of being an orphan and living on the streets, as well as the dangers and tragedies of families being separated when they go west on the orphan train. This story shows the power of one women’s love for two children that she calls her own and the importance of keeping them together and having them returned to her at any cost. It’s also a story of the power of having a good man and true romance in one’s life. This story is deep, original, and powerful, speaking to readers in a way that will cause them to pause and reflect long after the last page is turned.Series: Orphan TrainGenre: historical, romance, ChristianPublisher: Bethany HousePublication date: December 4, 2018Number of pages: 341Other books in the series:0.5-An Awakened Heart1-With You Always2-Together ForeverA review copy of this book was provided by the publisher via the author’s launch team. A review was not required and all views and opinions expressed are my own."}, {"Review": "Come join Sophie Neumann, the youngest sister in the Orphan Train series, and see her journey of healing as she grows into the person God wants her to be!We begin with a hurt and hardened Sophie, who not only feels abandoned by her older sisters, but who is worn out from trying so hard to care for Olivia and Nicholas. Though she's not related to these children, they were orphaned from infancy, and Sophie has cared for them and has been the only mother they've ever known. But she's had to resort to stealing and sneaking for so long, and her heart has grown hard as she's grown into womanhood standing all alone.Reinhold has already been rejected by Sophie's two older sisters in marriage. Poor guy! He's got a great heart and he's an incredibly hard worker, trying so hard to make his farm profitable with very little help. He's got a streak of anger within him, passed on from his very ungodly father, and he struggles with his emotions.Sophie and Reinhold knew each other when they were younger, and they meet unexpectedly. Will love have a chance to develop? Can they each grow past their own brokenness and learn to let others in? Can Sophie forgive her sisters for allowing her to be on her own? This is a wonderful journey of two hearts finding restoration in God!"}, {"Review": "Sophie’s Story was worth the wait. As I neared the end I was not ready for this series or this particular book to end! I really enjoyed this journey and learning about The Orphan trains that once were. I understand they were necessary and helped many, yet for some it was not a good experience. I think the author did an excellent job in portraying all sides of this. Sophie is still running and thinks she can’t be redeemed. She doesn’t want to see her sisters until she is good enough for them, if ever. We also get to see Reinhold again and continue his journey with farmlife. A new family is introduced that will capture your heart, hard subjects tackled, and grace shown. Enjoy this last installment to the Orphan Train series, I highly recommend it. I received a copy of this book from NetGalley. All opinions stated here are my own."}], "Genre": "Romance", "ID": "38484810", "Desc": ""}