{"Name": "One Day in December", "Image": "https://images.gr-assets.com/books/1543961496l/38255337.jpg", "Reviews": [{"Review": "\nCan a fated glance across a misty bus window = TRUE LOVE?\n\nOne Day in December\n is the kind of book that will touch your heart and make you believe in love. The kind of heartwarming love that is meant to be against all odds. The kind of love that leaves you smiling just reading about it. I opened the book and found myself immersed in Laurie and Jack's story. It was exactly what I needed. An addictive, unputdownable, angsty love story that filled my heart with a solid dose of romance. The story is told from both Jack and Laurie's perspectives, starting from the snowy December day they find themselves on opposite sides of a misty bus window, inexplicably drawn to each other. The moment is brief but the bond it forms within them is strong and leaves them both marked. Can they find each other again or was this doomed to be a missed, fleeting moment in both their lives?This is not a typical love story. It unfolds over the course of ten, angst filled years! In the decade following the moment they first laid eyes on each other we follow Laurie and Jack's ups and downs, their heartaches and relationships, misunderstandings and of course their friendship and undeniable connection. They may have the world's worst timing and a seemingly impossible road to love and happiness together but you can't help but root for them while wondering - will they ever actually get to be together? \nDo you believe in destiny? That we all have that one perfect match - the person we are meant to be with!\n\nOne Day in December\n was charming, complex and romantic. Laurie and Jack are perfectly flawed and the kind of well written characters that feel like friends you want to shake and yell at for not being honest about their feelings. Every romantic at heart needs this book in their life!"}, {"Review": "Laurie sees a man outside of her bus window one day. There are no words, no actions, only intense eye contact but that is enough to make her fall head over heels in love with a stranger. She years for him, she can't stop thinking about him, she dreams of the time they will meet again. Then one day her best friend and roommate, Sarah, introduces her new boyfriend, Jack, to Laurie. Sarah is anxious for Jack and Laurie to meet. She hopes they will hit it off - if only she knew that her boyfriend is the man from the bus. The man that Laurie has been dreaming about.... and he is dating her roommate. UGH!Bring on the angst, the heartbreak, the not wanting to hurt anyone, the wanting to be happy and the quest for the happily ever after. This book follows Laurie, Sarah and Jack through ten years of their friendship. Through their love for each other, their friendship(s), their lovers, their unrequited feelings. This is not a typical love story. It's a slice out of three people's lives. The story is told through Laurie and Jacks perspectives. The reader is privy to their secret thoughts and feelings. This book has heart. I like that these people cared deeply for each other and as a reader, I cared about them. I found this book to be addictive. I had to keep reading to find out what was going to happen to these characters. This is a great book to curl up with a blanket with. My only complaint with this book is that I wanted an epilogue. When the book ended, I thought \"Come On!\". I wanted just a little bit more time with these characters. I found this book to be engaging, fun and a very enjoyable read. It has a little bit of everything: friendship, loss, grief, new beginnings, forgiveness, heartache, and love.Thank you to Crown Publishing and NetGalley who provided me with a copy of this book in exchange for an honest review. All the thoughts and opinions are my own.Read more of my reviews at www.openbookpost.com"}, {"Review": "ARC provided by the publisher in exchange for an honest review. You can buy the book here!“You tread lightly through life, but you leave deep footprints that are hard for other people to fill.”5 starsOne Day in December is an epic story centered around three people Laurie, Sarah and Jack. It all start on a December day.Laurie doesn't believe in first sight love.She sees a man through the bus window.She believes now.She searches for him, every now and then.She thinks is sure he is the one for her.She finally finds him.In a wrong place.And their story begins now.This is what I call an addictive book. You just can't put it down for a second. The story is so engaging and it satisfies you but also leaves you wanting more. And here comes my only problem with the book. In the end I was left wanting more.The characters are amazing and quirky but I wanted to connect more with them. The books focuses more on situations that the characters create, way more than in the characters themselves.Overall, as you can see from my rating, I loved the book. It is such a winter read, where you can take a blanket, a hot cup of tea or coffee and read the hell out of this book.Was it worth reading? - Absolutely.Will I read it again? - Yes of course.Would I recommend it?- Yes yes yes. Save it for Christmas."}, {"Review": "\nHeartwarming!One Day in December is a sweet story about friendship, romance, and true love. \nThe plot centers around a romance that could have been but was not. Instead, wrong matches are made, friendships are put to the test, and the notion of true love is tested. This is the story of Laurie, Sarah, and Jack. Told through Laurie and Jack’s alternating POV’s, the reader learns over the course of time of what was not but what should have been. Will true love prevail or will one be left heartbroken?What I liked about One Day in December is that all of the characters are likable. Even when they are with the wrong romantic matches, the “wrong” partner is never villainized, rather things don’t work out because the wrong match was made. The plot isn’t wholly original and it is a little predictable, but the depth of characters and Laurie’s compelling narrative makeup for these issues. I appreciated that the characters had depth and evolve over the course of the story. Prior to reading this, I was in a bit of a reading slump. Nothing fit or felt quite right until I read One Day in December.  This turned out to be the perfect holiday read as it took away my reading frustrations and brought me into the holiday cheer! "}, {"Review": "5 Heartfelt, Love-Sick Stars!What happens when see him? It’s love at first sight, and then your best friend meets him in person and she gets the guy? For Laurie, there is a moment. Just one. Perhaps it is Kismet or maybe it's Destiny. She sees him at the bus stop. Laurie is inside, he is waiting outside, he looks up at the exact moment she does, their eyes meet and hold and she knows. He is the one. For a year, she looks for him everywhere, but never finds him. Her crush goes unrequited. Her best friend and roommate Sarah, jokes about him constantly. Yet Laurie knows, her feelings for him are true. Laurie and Sarah met while at Uni. They are two peas in a pod, besties till the end of the world. One night, they have a party and Sarah brings her new boyfriend, Jack O’Mara. Laurie meets his eyes and she is gutted. Jack is the guy, her crush, yet she says nothing. Jack recognizes Laurie instantly. He too, has thought about her. How could he not? And yet,.. he is with Sarah now. Told in both Laurie and Jack’s alternating viewpoints and spanning the course of several years, there are missed chances, choices and loads of heartache and tears. As the years passed by, I felt that tightness in my chest that made my throat close up and my heart pound. The pain was palpable, the feelings of jealousy and heartbreak were as real as any I’ve ever felt personally.“One Day in December” by Josie Silver is a novel that broke my heart time and again. My eyes filled and yes, I had to grab a tissue or two because I couldn’t stop myself from crying. Ultimately, this is a story that will make you feel… whether you are unabashedly romantic or not, your heart will soften and you will not be able to stop yourself from wondering, from having hope that it is out there and from showing everyone you love how much you care. If you get the chance to read “One Day in December” please take it! This heartwarming read will be on my best of list for 2018 and I sincerely hope it will be on yours too!This was another weekend buddy read with Kaceey!Thank you to Emily at Goodreads, Eliana at Crown Publishing and to Josie Silver for a complimentary copy of this novel in exchange for an honest review.Published on Goodreads, Twitter, Amazon on 12.7.18.Excerpt posted on Instagram."}, {"Review": "4, 🎶 do you believe in love 🎶 stars!!! Full review featured on my blog Recipe & a Read!It all begins one day in December (I know, shocker, you had no idea). We start our story with Laurie, she doesn't believe in love at first sight, she's having a normal run of the mill day, then BOOM she sees a man outside her bus window. As their eyes meet, she feels an instant connection. Laurie's brain shorts out and she does nothing as the bus pulls away, she then runs through endless possibilities of what she could have done, what she should have done in that moment. From now on, if anyone asks me if I've ever fallen in love at first sight, I shall say yes, for one glorious minute on 21 December 2008.Even though it was just one fleeting moment between Laurie and Jack (AKA \"Bus Boy\") she spends the next year looking for him everywhere she goes. She sees him in bars, at bus stops, in shops because she can't even begin to fathom that it wasn't destiny passing her by. Of course, fate had far bigger things planned for Laurie and Jack and they do reconnect. Only this time, it's on the arm of her best friend Sarah. This is told from alternating POVs between Jack and Sarah. As we receive Jack's point of view, it turns out he actually did recognize Laurie - and he remembers the many times he thought about her after their chance encounter at the bus stop as well. However, nothing in life is ever easy and he genuinely does care for Sarah, so he attempts a friendship with Laurie, despite it's difficulty. You tread lightly through life, but you leave deep footprints that are hard for other people to fill.There was an immediate cinematic quality to this and I will be truly shocked if it doesn't get made into a movie in the near future. This story follows 10 years between Laurie, Jack and Sarah and their ever changing relationships with one another, along with people they meet along the way. While it's a fairly traditional romance there was something effortlessly engaging here that keeps the reader attached to not just the story, but the characters as well.Who was St Valentine anyway and what made him such an expert on romance? I’m willing to bet his full name is St Smugbastard-three’s-crowd Valentine, and he probably lives on a candle-lit island where everything comes in pairs, even bouts of thrush.What's great is that Silver doesn't just rely on angst here, while it's there in spades there's also a levity and humor that carries throughout the story. This isn't just about the dreaded love triangle, betrayal or friendships and relationships lost and found. No, it's about life, about it's triumphs and failures, about success and loss, about growth and learning who we are. While this ultimately fell just a bit short for me because it was quite predictable, I absolutely loved the story Silver wove and it's a quick, incredibly fun read that I had a really fun time with. I'd suggest this for fans of romance or anyone looking for a quick, fun and cozy winter read!Thank you to the ever amazing Traveling Sisters for facilitating this group read and providing us with physical ARCs!!!"}, {"Review": "Josie Silver writes a romantic comedy that is absolutely going to be a big hit, with characters that tug at your heartstrings and packed with laugh out loud humour. It is perfect escapist fare that begins and ends in the festive season. It's December, Laurie doesn't believe in soul mates, but with her hair covered in tinsel, she is at a bus stop in London on a crowded bus heading to her parents home in Birmingham for Christmas. Through the misted window, she sees him outside and deep inside her she just knows he is the one. When he glances up and spots her, his reaction is mirroring her. However, Laurie doesn't get off the bus and he doesn't get on, and that chance for the two of them is missed. However, Laurie can't forget him, and spends the following year desperately hoping to come across him. Laurie's best friend Sarah is as close as a sister to her, they laugh, have fun and support each other unconditionally. Sarah is head over heels in love with her new boyfriend, certain he is the man she will marry, and she is desperate for Laurie's approval. To Laurie's horror, Sarah's new man is Jack O'Mara, her bus stop man, the one. Laurie buries her feelings, her friendship with Sarah is too precious as she tries hard to rein in her feelings and not show her heartbreak. Through the following decade we follow Laurie, her new year resolutions, the kicks and bruises that life hands out that leave her broken, being a pink lady, her never tell a goldfish moments and meeting Oscar in Thailand. Will she and Jack ever get together? If you are feeling under the weather, or if life is too much or is getting you down, this is a great book for giving you a lift. Josie Silver has written a gripping contemporary romantic fairytale with verve, wit and panache. A beautifully told story of love, of tears, of loss, of friendship, and regrets, with characters you cannot help but care for. Highly recommended! Many thanks to Penguin UK for an ARC."}, {"Review": "LOOOVED IT!!! Every page, every sentence, every word, every letter!!!In case you cannot tell I have fallen head over heels in love with this book! It has earned a place on my fave shelf and is absolutely one of my top five reeds of 2018... such a beautiful story, so full of love and heart.... this is an epic love story spanning an entire decade... a story with all the feels, you will laugh, you will cry, you will smile, you will shake your head, you will fall in love... this book will break your heart over and over again and then fill it back up with love just as many times! Simply put it was MAGICAL!Laurie doesn’t believe in love at first sight until she glimpses a boy at the bus stop...Laurie was such a wonderful character so well developed, I felt as though I would know her if she were walking down the street... adored her friendship with Sarah, one of my absolute favorite parts of this book... such a positive realistic portrayal of what a female friendships should be.... of course they have their ups and downs, but at the end of the day they were always there for one another.... all three of the main characters in this book Laurie, Sarah, and Jack were well drawn likable characters that you definitely could relate to...Told from alternating points of view... we got the insights and perceptions of both Laurie and Jack threwout the decade... The book was structured brilliantly you never were confused as to who was narrating and what year it was... in fact the entire book is told linearly, there was no jumping around kind of nice for a change....I absolutely recommend this stunning story to everyone with a heart! A wonderful Christmas read!This was a group read with my Book Besties... Jennifer was approached by Goodreads and the publisher with this book and just as a true friend does she included all of us! How appropriate for a group of friends to read a story with such a tremendous focus on friendship... we had a wonderful discussion, we were all captivated by this story! We also thought it would make a fantastic movies, we even casted it... I thought I’d share our choices with you all!Laurie we thought should be played bye Shailene Woodley, Sarah played by Jennifer Lawrence, and Jack buy either Liam Hemsworth or Zac Efron... have you read this? What do you think?*** huge thanks to Goodreads, Crown Publishing, and Jennifer for my copy of this book ***"}, {"Review": "Do you believe in love at first sight?A chance encounter at a bus stop. Laurie, day-dreaming, gazes out the bus window and suddenly locks eyes with the boy sitting on a bench. One quick glance is all it takes. Young love is off and running! Is it magic? Is it kismet? But the bus has a schedule to keep, and before either one can do anything, it pulls away. Laurie, unable to let go of that single moment, spends the next year searching for her bus-boy. So… you just have to believe it’s more than coincidence when he walks into her Christmas party on the arm of her best friend Sarah!You’re swept away on a journey of three amazing friends through their lives as they navigate life and love. Trying to answer familiar, age-old questions along their way:Do you get over your one true love? What do they say about the one that got away?Josie Silver writes a wonderfully enchanting love story that will tug hard on your heartstrings, making even the most hardened soul believe in love once again.A most heartwarming story that left tears rolling down my cheeks and the biggest smile on my face. I cannot recommend this book enough! One of my new favorites for 2018. Just in time!A buddy read with Susanne that left both of us reaching for the Kleenex😢💖Thank you to Emily at Goodreads, Eliana Seochand at Crown Publishing and Josie Silver for a copy of this book to read and review."}, {"Review": "5 Mesmerizing & Memorable!! Stars \n...I need to get off this bus. I’m gripped by the overwhelming urge to go outside, to get to him. ... I’ve just fallen hopelessly in love with a stranger at a bus stop.\nWell folks, it just gets juicier and more captivating with each passing chapter ;)Of course, I went in blind! Of course, it was the best way to go! Of course, I recommend you doing the same! Of course, I am convinced you will love it as much as I did!!I would describe this story as sophisticated chick-lit. It is full of sass, sensuality and surprises.I so loved this was told in dual narrative. I truly enjoyed getting into the heads of the characters. And these characters, the whole lot of them are a jovial, witty bunch. A bunch I desired to find true happiness.Thank you dearest friend, Jennifer, for gifting me this incredible book!! Don’t let “December” in the title lead you to think this is just a holiday read. Honestly it can be read anytime of the year."}, {"Review": "Smashing, engrossing & devouring!Wow! I absolutely LOVED this book! Laurie, Sarah & Jack were great characters!Random amusing line:“I squint, trying to duck my head to see what he’s reading ....”Oh my, I think all of us book lovers can relate to that sentence. I know that I have done that very same thing so many times!ONE DAY IN DECEMBER by JOSIE SILVER is a fabulous, brilliant, heartwarming and delightful story that completely stole my heart and consumed my thoughts. It took me less than 24 hours to read this book because once I started reading it I absolutely could not put it down. It had me totally absorbed, entertained, and interested in the storyline right from the very first page. The way that this story was told and presented was actually much more than your typical love story. It was such a powerful and moving story that had so much heart and warmth flowing through the pages of this book that I absolutely could not get enough of. I’m actually kind of a little disappointed that the story was over. It definitely left me yearning for more but in a good way though.JOSIE SILVER delivers an engaging, intriguing and beautifully written tale of love, friendship, hope, longing, loss and regret that flowed so perfectly. I was wholly impressed with Josie Silver’s writing style and how perfectly she interweaves the passage of time and storyline with the perspectives of Laurie and Jack. I was totally invested in these characters lives and was definitely hoping for a happily ever after for them.It was one of those books that was definitely an all consuming read for me and the perfect winter escape. *Thank you so much to Emily from Goodreads for making this spectacular Traveling Sisters group read possible!*Norma’s Stats:Cover: I love everything about this cover from that beautiful design to the embossed snowflakes! Title: Appealing, intriguing, and such a meaningful and fitting representation to storyline. Writing/Prose: Well-written, beautiful, impressive, engaging, captivating, and fluid.Plot: Warming, sweet, comical, thought-provoking, engrossing, perfectly-paced, enjoyable and extremely entertaining. I adored this storyline!Ending: A touching and emotional ending that I was extremely satisfied with that left me with that warm fuzzy afterglow feeling. If a book produces that feeling from me then it is a splendid read indeed! Overall: This book was beyond wonderful! Loved, loved, loved it! This book has made my top five books of the year! Would highly recommend!Thank you so much to Emily from Goodreads, Crown Publishing and Josie Silver for gifting us the Perfect Night In book club kit. It was my absolute pleasure reading this incredible book!Review can also be found on our Two Sisters Lost in a Coulee Reading book blog:https://twosisterslostinacoulee.com/"}, {"Review": "2018 has been an amazing year of talent for new releases and I can proudly say that this little beauty sits proudly on that shelf! Oh my goodness Josie Silver you have my heart with how beautifully your words and talent is expressed across these pages of One Day in December. This book was NOTHING that I expected. What a beautiful and powerful tale of love, loss, friendship, and how love can span across a lifetime. One beautiful wintery day Laurie is on the bus and she happens to look out her window to see heart stopper Jack. They both have an instant connection but Jack never got on the bus. A year goes by and Laurie has done nothing but look high and low for this mysterious bus lover. Until one day.. Laurie goes to a Christmas party with her best friend Sarah... who can't stop talking about this new boyfriend she has that she wants to marry. Well..... ladies and gents Laurie has found her bus boy Jack.. who is her best friends new boyfriend. YIKES. Let me tell you this is NOT a typical love triangle. Oh my gosh is this novel so much more then just a love story. I became so invested in these characters and gobbled this book up like a turkey dinner! Josie flawlessly interweaves the path and storyline of the three characters perfectly. \"You tread lightly through life, but you leave deep footprints that are hard for other people to fill.\"You need this book in your life... pre order this one because it deserves a raw and rare spot on your bookshelf!!!5 for perfection!!! Huge thank you to Crown Publishing and Netgalley for the opportunity to read this arc in exchange for my honest review.Expected publication date: 10/16/18Review published to GR: 7/27/18"}, {"Review": "Five stars to this treasure of a book and five stars to the unforgettable experience of reading it! 🌟 🌟 🌟 🌟 🌟 I’m honored and humbled that Goodreads selected me to receive a book club kit and set of copies of One Day in December, graciously provided by the publisher, Broadway Books and Crown Publishing. I was fortunate to have local friends and online friends join me for this heartwarming read, the perfect story to enjoy this time of year, and quite uplifting in the end.It’s close to the holidays, December 21 to be exact, when Laurie is bewildered and exhausted riding the bus home from work. She just so happens to make eye contact with a guy at the bus stop, and she has an instant connection, something she never believed in before. He tries to get on the bus, but it’s too late. The doors close, and off Laurie goes. She makes it her New Year’s Resolution to find the bus stop guy.For a year, she searches for him at every bus stop and bar in London (amazing setting, by the way!). Never finding him, she attends a Christmas party where she is introduced to HIM as her best friend Sarah’s new boyfriend!Ten years go by between these friends, and they experience their share of kindness, heartbreak, disconnects, and could there possibly be second chances?I loved this story from start to finish. The formatting and timeline added interest and even more investment on my part. I found this a cozy, charming read, the characterization was warmhearted, and overall, it was a delicious escape, one where happiness is the ultimate goal. One Day in December is much more than the typical romance read, and that’s why it’s receiving universal love from readers across genres. I hope I can speak for the group in saying that many found this book one of the their favorites of the year, if not their top favorite. We are all avid readers, so that’s saying something. Thank you again to Broadway Books, Crown Publishing, and Goodreads for this special opportunity and for the free books. All opinions are my own.My reviews can also be found on my blog: www.jennifertarheelreader.com"}, {"Review": "Reading One Day in December is a like a getting a warm hug on a chilly winter day. It warmed our hearts and left us feeling like we just experienced something very special. I have been talking about a few books I have read lately that have not been my normal and One Day in December was definitely one of them. This sister does not have a romantic bone in her. My poor husband.One Day in December is warm, captivating, unforgettable and quirky love story not only between couples but within a friendship as well. It’s a story of friendship, loyalty, and missing chances that left us questioning if they really were.Sometimes I think I am more romantic when it comes to friendships. I envied the relationship our main characters Laurie and Sarah had. Both characters were so different from each yet similar in some ways. One of the things that makes this story so great is how it is told over a long period of time. We really get the chance to connect to the characters and see them develop, change, and experience different things. The dynamic between the characters seemed realistic and was heartwarming and truly special.One Day in December made for one of the best group discussions we have had. We received a group kit with discussion questions and it had some of the best questions we have yet used. You can find them online as well. The questions are very thought-provoking, easy to answer and really related to the theme, insight and emotions we felt towards the story.We highly recommend this one and think it is one to put on your do not miss list. If you get the chance to read it in a group we suggest taking it as its one of the best stories to discuss. You could always join the Traveling Friends. This is one I am definitely going to suggest they read.*Thank you so much to Emily from Goodreads for making this spectacular Traveling Sisters group read possible!*Thank you so much to Crown Publishing and Josie Silver for gifting us the Perfect Night In book club kit and sending out copies to some of The Traveling Sisters. It was an absolute pleasure reading this incredible book!https://twosisterslostinacoulee.com/2..."}, {"Review": "It was a scene from one of the hopelessly romantic movies she loves: one late afternoon just before Christmas, Laurie is packed sardine-like onto a double-decker bus, when through a misty window she spots a handsome man. Some mystical force tells her that he is the one, and when their eyes meet, it's like they both know this to be true. But before Laurie can move or the man can try to board the bus and hopefully sweep her off her feet, the bus drives away.Even though she's almost certain that \"Bus Boy\" may never come back into her life, she spends a year looking for him at every bus stop, shop, bar, everywhere she goes. She can't imagine finding anyone else. And just as she gives up hope that she'll ever be reunited with her mystery man, they finally do connect—only he's on the arm of her best friend and flatmate, Sarah. Yes, \"Bus Boy,\" whose name is Jack (and who is more handsome than she even imagined), is Sarah's new boyfriend, a man she's fallen head over heels for.Part of Laurie wants to tell Sarah the truth, that Jack is the man she has been hunting for. But when Jack doesn't seem to recognize her, she realizes she has been hanging on to a foolish obsession, and how can she stand in the way of her best friend's happiness? Of course, Sarah doesn't make it easy for Laurie, since she wants the three of them to spend lots of time together, and more importantly, she wants Laurie and Jack to be friends, too.Jack actually did recognize Laurie, and he can't believe that the woman he may have had more than one or two fantasies about is actually his new girlfriend's best friend. But Laurie and Sarah are complete opposites, and he doesn't want to jeopardize what he's starting to have with Sarah. Even if it's difficult to try and be friends with Laurie, if it means that much to Sarah, he'll put any lingering feelings he has aside and do it.Is there such a thing as destiny? Is there really one right person for everyone? How can you be happy when someone you truly care about gets what you want, what you think should be \"yours\"? Can you move on with your life if your heart isn't quite ready to let go?\nOne Day in December\n follows Laurie, Jack, and Sarah through 10 years of heartaches and triumphs, passion and anger, connections and misunderstandings, secrets and facing the truth. If ever there were a book that highlights how important it is to say what you feel, what you think, when it happens, it's this one.If reading the plot summary in my review gives you ideas of how this book will unfold, you may be right. There isn't anything too surprising here, but that doesn't matter, because Josie Silver's appealing yet flawed characters grow on you, even though you want to shake them at times for not saying how they feel. It's a charming, romantic book, sure to warm the hearts of those looking for a good story about love and friendship and how one can get in the way of the other.I thought this was going to be a breezy, mindless read, but it's a little more complex than I expected. I really enjoyed this, even though I would have liked it more if we didn't run through the same situations with the characters so many times. It definitely appealed to the sap, err, romantic in me though!!See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"Review": "4.5 starsThis book is all about fate, timing, and star-crossed love, told with a side of humor and a lot of heart. You’re not a romance reader? Neither am I! But this book melted my non-romance reading heart into a puddle.In short, I loved it. It turned out to be so much more than I expected. I loved the characters of Laurie, Sarah, and Jack. I also enjoyed how the author explored the friendship between Laurie and Sarah, best friends for life, through thick and thin. We follow these three through ten years, 2008 to 2018. Each year starts off with Laurie’s New Year’s resolutions and we hear both Laurie and Jack’s POV. Honestly, I couldn’t decide how I wanted this messy situation to end up and I changed my mind several times throughout. Things are not always how they appear and there are a few surprises in store. The book ends in the year 2018 and you won’t read any spoilers here. I closed the last page with a tear in my eye and a smile on my face. \u2028Don’t let your dislike of the genre miss this gem! When Renee of https://itsbooktalk.com raved about it I hopped onto Netgalley and requested a copy. And am I glad I did. Do yourself a favor and pick up a copy of this book that will warm your heart on the coldest of days. It would also be perfect for the booklover on your gift list. *I received a copy of this book from Netgalley in exchange for an honest review."}, {"Review": "4 stars! Charming. Witty. Endearing. Refreshing. Heartwarming.I do not generally read romance, but when Brenda and Norma offered the Traveling Sisters the opportunity to read this title, I thought I would take a chance and try it out. I am SO GLAD I did! This is not your typical love story. This novel follows Laurie who believes she has found “the one” when she happens to look through the window of the bus she is on and makes magical eye contact with a handsome stranger. She doesn’t believe in love at first sight, yet she feels an unexplainable intense connection to this man as her bus drives away. Along with the help of her best friend Sarah, Laurie spends the next year scouring the city in the hopes of reuniting with this handsome stranger. Over a year later, Laurie does reunite with this man, named Jack, although it is not in the way she had hoped….. This book spans over a decade in which we follow the ever-changing relationship dynamic between Laurie, Sarah and Jack. The author, Josie Silver, does an outstanding job with character development. I was completely invested in their lives and I simply adored Laurie. The pace and flow of the story was perfect which is impressive considering the many time jumps throughout the plot. I loved the ‘New Year’s Resolution’ sections – they were a brilliant addition to the novel.This was a Traveling Sister read which we all adored! Many of us were pleasantly surprised at how much we truly loved this story. To find this review, along with the other Traveling Sister reviews, please visit our blog at:https://twosisterslostinacoulee.com/2...Thank you to Emily from Goodreads, Eliana at Crown Publishing and Josie Silver for providing a physical ARC in exchange for an honest review!One Day In December is available now!"}, {"Review": "4 stars!! \n\n\nSometimes you just meet the right person at the wrong time.\n\nOne Day in December is a story that follows three main characters, but it's told from Laurie and Jack's pov. It was a loonnnngggg journey to get there, but that ending, it was perfect. Life is about timing. Sometimes we meet people at exactly the right time, and sometimes we meet people at the wrong time.The first time Jack and Laurie 'meet' it's on a bus. Laurie is on a bus and sees Jack. He sees her too. He tries to get on the bus, but it's too late. Her bus is pulling away and that's that. Laurie spends some time looking for him, but it's a big city and she doesn't find him. Until a year later. When her best friend/roommate brings him home and introduces them as her new boyfriend. Ah the stress of this book. I just wanted Laurie to tell Sarah, but she couldn't ruin her happiness with Jack so she keeps quiet. The story spans 10 years. Jack and Laurie become friends and Sarah and Jack continue to date. I had so much anxiety while reading this. It was so hard, because I genuinely liked all three of these characters, as well as Oliver, who is introduced later in the book. One thing I can say about this book is it hooked me early on and captivated me. I love a book that can completely hold my attention and this one did just that. I could see this book turning into a film- I think it would make an epic holiday rom-com/angsty romance. It's a heartwarming and beautiful tale of love, friendship, and how sometimes one choice can change the trajectory of your entire life. I listened to the audio book and the narration was fantastic. Definitely a romance I'd recommend for this winter!"}, {"Review": "I've read SO many books lately about crazy people and missing people and abused people that this was a very welcome change!Grab a cup of tea or hot cocoa ☕,a cozy blanket, and THIS book. 💗This is an extremely engaging story about a love-at-first-sight scenario. It's set during the Christmas holidays (NINE Christmases actually), but it can definitely be read any time of the year.The winter setting just makes it really fun to read right now, with it's atmospheric descriptions of London during the holidays.A girl on a bus (Laurie) sees a guy at a bus stop (Jack), and their eyes meet. There's an instant connection, and they just know, you know? But then... the bus pulls away, pulling them apart.Ever since that day, Laurie and Jack have been trying to find their way back to each other.But, this story is also about an incredibly deep friendship between two young women (Laurie and Sarah), best friends who would do anything for each other, and that relationship is the real gem here. This one will warm your heart and make you smile. 💗"}, {"Review": "The short and sweet version: this was my favorite book of the year, everyone should read it, and it needs to be made into a movie now if not sooner!This is romance done perfectly, yet it’s more than romance - it’s about love and relationships and life and mistakes and forgiveness. So much in one book, wrapped up in a perfect bow that starts on that one day in December. Spanning over several years, this books takes you through the journey of Lu’s life as she’s coming of age after university. I can honestly say this is the most wonderful, funny, delightful trip full of ups and downs and rights and wrongs and love and pain that I’ve read in quite some time. Ms. Silver, you have a forever fan. 5 magical, beautiful, lovely stars!This was a @6bookbesties read, be sure to check out reviews from Mackenzie, Kendall, Holly, Jennifer and Berit! And a huge thank you to Jennifer who included us in her book club from the publisher - I will cherish this book forever!"}, {"Review": "This is such a charming romance with some bittersweet moments that added some emotion.When Laurie spots Jack one day, she \"feels\" something.  I've known people who have experienced similar instant connections, but who's to say if there is anything to it.  Laurie spends the next year \"watching out\" for this mystery man that rocked her world.I loved all the characters, the humor and the overall journey between two people that seemed to be meant for each other.A touch of \nserendipity \nand a \nfairytale-esque \nplot made this one the perfect little story of love, friendship, hope, and missed opportunities.If you're looking for a touching romance with a definite \"sparkle\" factor, this one is it!Thanks to my friend Jennifer and the publisher for my copy to read with my book buddies."}, {"Review": " *Spoiler Alert*Has this been optioned for a movie yet? Watch out, Nicholas Sparks, Josie Silver is snipping at your heels!Despite my sunny cynical disposition, I am a great believer in that ONE TRUE love. So if you get an opportunity to actually be with yours, please, don't hesitate, as that one indecision can easily cause untold damage and heartache. This is what happened to Laurie, one day, a few seconds, and her life changed irrevocably. Silver wrote an incredibly heartbreaking story about missed love, third, fourth second-chances, and finding that one true love. What I need next is Oscar's story (please, no Cressida) because that man deserves his own HEA.I could not put this down and highly recommend!"}, {"Review": "This was just such a good read for me. Right from the start I fell in love with the characters. Usually when I read novels in the romance genre I can find at least one or two things that I didn't like, but this book was pretty darn close to perfect. It is understandable though that this might not be the right fit for all readers as we all have stories that we connect with more than others.Laurie is on the bus when she looks out the window and instantly falls in love with a man standing outside. Their eyes meet and Laurie feels this intense connection. The bus moves on without him getting on the bus and she spends the next year with her eyes peeled hoping she will see him again. And she does. Her best friend and roommate, Sarah, brings him to the London flat they share and introduces the mystery man, Jack, as her new boyfriend. Uh oh.I love how the book didn't just take place over the course of a year or two, and instead followed the three characters over the course of a decade. They experience so many life changes, and deal with heartache, joy, pain, etc.. I immediately clicked with Laurie and Jack and enjoyed how the story went back and forth between their perspectives. Given the premise, you might assume this is just a typical love triangle story but the author made it feel like so much more than that. Highly recommend as I really felt an emotional connection to the characters and I hope others are able to experience that as well.Thank you to First to Read for the opportunity to read an advance digital copy! All views expressed are my honest opinion. "}, {"Review": "Beautiful. I was not expecting the depth that this book provided It's not just a romance, it's the story of two people whose paths keep crossing over the span of 10 years. There are times that I loved these characters, and times that I hated them. They are flawed, they make bad decisions, but the book doesn't brush this aside. These character struggle with and actually process their feelings and their actions. At its heart this story is a romance but it's not an easy, fluffy one. There is a journey these character have to go through. And although it's a romance, I was more invested in the friendships and the characters themselves, which allowed that journey to feel very genuine and fulfilling to me.Audiobook review: I did have both the print and audio version of this, but I have to say that I preferred the audio due to the naration. Both narrators portrayed emotions extremely well. They added sighs, scoffs, laughs, and so on where it fit the scene. The editing had some pacing issues (pauses between lines, or no pauses between scene breaks) but the narration itself was a delight.tw: Cheating/thoughts of cheating. I felt the book processed this well and did not romanticize it, but if that's a hard line for you then you may want to skip this one."}, {"Review": "A love story about what happens after you meet, or rather, don't meet the one.Charming and authentic, One Day in December is a story of love, friendship, and growing up. This book made me so happy! It felt like a film, something that I could envision so vividly. And at the same time, it felt like a real story. The characters felt like friends, and I felt deeply invested in their lives. This was a book club read hosted by Jennifer at Tarheel Reader and sponsored by Goodreads, and I’m so glad to have shared this magical story with friends!ReflectionIt would be so easy for this book to have followed the formula of a perfect couple that by chance found other people first. Laurie and Jack could have been the heroes, and Sarah could have been obviously wrong for Jack. Sarah could have been a friend that betrayed Laurie, and deserved what she got. This book was none of those things, though. When I say it felt authentic, I say that because the characters all just felt like people—imperfect but lovely nonetheless. The fact is, Sarah and Jack are a great couple! When I started One Day in December, I expected to want them to break up and Laurie and Jack to get to be together—don’t we all want to believe in love at first sight?? But that isn’t how the story felt at all. Sarah and Jack are good together. They have a real connection. That makes Laurie’s position all the more raw to read about—she loves Sarah and she’ll do anything to not have the feelings she does.Laurie and Sarah’s friendship was actually my favorite part of the book. Both make mistakes, but both are incredible friends to the other. Sarah is upbeat, inclusive, and loyal. Sarah wants Laurie to be happy and successful. Sarah would do anything for Laurie. And Laurie herself loves Sarah with such heart. Laurie is kind, supportive, and entirely removed from the jealousy many would feel of a girl like Sarah. The moments between these two friends and watching them grow up, from 22 to 32, made my heart sing. Many of the moments that made me laugh and cry and smile were actually moments between Sarah and Laurie, without Jack involved. That’s why I say this is a book about friendship.But of course, there is love! Love and heartbreak and passion and emotions flow out of the pages of this novel. There were so many moments that just made me feel what the characters felt. I cried with them, I laughed with them, I felt confused about was the right path. And ultimately, I let the story unfold and wash over me. I experienced every up and down, and I loved it. I don’t want to spoil anything about the central relationships, so what I’ll say is this book is wonderful! Read it—you won’t regret it!Book BestiesI got to share this read with 4 of my book besties, and I’m so glad! This is a perfect holiday read, when you have a few days to cozy up and get lost in the characters. And it is a great book club read! I learned so much about my book besties through discussing similar incidents from our own lives that reminded us of moments in the book. Also, I wasn’t sure where to mention this because it is kind of an aside, but there’s another part of this book that I loved. That is the movie references. With the exception of two movies, I don’t think the others are mentioned by name, but there are dozens of instances that pay honor to the great romantic films throughout history, beginning with Love, Actually and moving back and forth through time. If you are a movie fan, watch for those! Sometimes they were subtle, but it was such a magical element to this book!Thank you to Goodreads and Crown Publishing for sponsoring this book club read!"}, {"Review": "Unputdownable! Yes, this book is that good! I read One Day in December over the course of one day, here in December. I liked the story right away and just couldn’t stop reading it. Laurie takes the bus home one evening in 2008 and locks eyes with a guy through the window who’s a total babe. He isn’t able to get on the bus before it pulls away. Devastated, Laurie spends the next year hunting throughout London for him, with no luck. She does end up meeting him again though, when her best friend, Sarah, introduces him as Jack, her boyfriend. The story spans the course of a decade (2008-2018) as this triangle attempts to navigate difficult situations involving both friendships and relationships, along with family and careers. I thoroughly enjoyed this story! I enjoyed the style it was written in - Each year beginning with New Year’s resolutions from Laurie, followed by major updates or the progression of events that took place during that time period. The story is told from both Laurie and Jack’s POVs. Overall I felt like Laurie, Jack, and Sarah were pretty likable and I liked the modern time frame of the novel. This was a great story, and while hopefully never challenged with all the difficulties this group faced, there are definitely relatable feelings and elements. It is a romance story which I’m not often drawn to, but this one is not cheesy, unbelievable, or over the top. Two of my all-time favorite books are The Light We Lost and This Love Story Will Self-Destruct. This one reminded me of both in certain ways, particularly with the main characters seeming to be of my generation, and the longer course of time in which the story takes place. That said, this story didn’t feel too similar to either of those books. Highly recommend One Day in December for anyone looking for a moving read that runs the full gamut of emotions. I can’t wait to see what Josie Silver writes next!"}, {"Review": "4.5 StarsWhen Laurie first sees him, she’s on the bus on her way home after work, after her work Christmas party – in fact, she still has a halo of tinsel woven through her hair – and she’s so tired, urging the bus forward mentally when she first notices the young man sitting in the bus shelter, reading a book, seemingly oblivious to his surroundings and the pushing and shoving going on around him. He’s so buried in his book that she can’t see his face, and she cleans the steamed up window with her sleeve in an effort to see the name of the book he’s reading. He looks up, and blinks as if to refocus his eyes, and then she realizes he’s looking at her. She tries to will him with her eyes to get on the bus when his smile slowly surfaces, growing, until they’re both smiling, at each other.And the bus pulls away.\n”For onlookers, it must have been an Oscar worthy sixty-second silent movie. From now on, if anyone asks me if I’ve ever fallen in love at first sight, I shall say yes, for one glorious minute on December 21, 2008.”\nThe following year a great deal of her time is spent, with and without her roommate / best friend Sarah, looking for her “bus boy.”Almost a year later, she’s is at Sarah’s work party and Sarah can hardly wait to introduce her to the guy she’s been seeing for a short period of time that she’s crazy about. \n”I know him.“It feels like just last week I saw him first—and last. That heart-stopping glimpse from the top deck of a crowded bus twelve months ago.”\nA light, frolic-filled fairytale-like love story that follows both Sarah and Laurie through these ten years that follow that moment of love-at-first-sight. The heartaches and heartbreaks, the decisions that are made, the friendships that are tested, all of the annual birthdays, festivities and the resolutions that are made, and some broken, with each New Year. "}], "Genre": "Romance", "ID": "38255337", "Desc": ""}