{"Name": "Gypsy's Blood", "Image": "https://images.gr-assets.com/books/1544875407l/43239166.jpg", "Reviews": [{"Review": "It wasn’t the title that pulled me in…There seem to be two things that make me look twice at a book cover, a striking (not necessarily handsome) bloke and a beautiful cape. I’m not sure what it is about them, but I would LOVE to have a hooded cape of my own. Maybe it's the historical romance reader in me because I'm still envious of the one Jane Bennet wore in Pride and Prejudice (BBC version). Now, the practicality of having a big sweeping hooded cape in Australia has held me back from ordering one. For starters, it would be too bloody hot. Secondly, where the heck am I going to wear it? So, I saw the cover of Gypsy’s Blood from a recommendation (thanks, Lily) on Goodreads and I was intrigued enough to look a bit closer.So, I’m reading the blurb and nodding my head thinking *Yes, this works for me…*THEN\n\nREVERSE HAREM?!?!?!?!?!?!\n\nNow, don’t mistake my explosive reaction as being fully in the negative. It just kind of shocked me for two seconds. It’s been a wee while since I’ve stumbled across any group “action” in my reads so I had to readjust my expectations. I’m feeling kind of risqué and up for taking a walk on the wild side…why the heck not???Ummm…excuse me, I think someone left out the harem action.Ok, what I was expecting and what I got was completely different, but, as you can see by the four stars, I still really enjoyed Gypsy Blood. In my dirty little mind, I was picturing Violet getting ravished by the monsters. What I got was a young woman moving to a town and finding out that all those scary stories she thought were unreal, were very, very real. Violet is surrounded by monsters and some of those monsters won’t leave her alone.Side note - these are my kind of monsters, there are no 3 headed, green-skinned or ugly monsters in sight. These monsters are the bossy, growly, sexy and magical kind that I love.At times while reading Gypsy Blood I was a little frustrated. Things seem to be moving along at a snail’s pace and I had so many questions that needed to be answered. And, of course, I was waiting the whole time for a little of this “harem action” to kick in. But, alas, we’re in the first book of the series, and I need to get to know the lay of the land before I get any action.Honestly, I chuckled when I read the author’s note…”Don’t kill me. Please.” I was lucky enough to have Gypsy’s Blood recommended to me at the same time the second book was released. I went in knowing it was going to have a cliffie ending, but with the second one waiting, it hardly fazed me.The characters were interesting, the storyline, while slow to begin with, definitely picked up speed. There is an underlying hum of sexual attraction between Violet and the monsters but at this stage, we’re still mostly in the dark as to where it will go. I’ve already bought Gypsy Freak and I can’t wait to see if All the Pretty Monsters come together for the reverse harem thingamajiggy."}, {"Review": "🔮 BR with my cake eating gurls at Reverse Harem Revolution #eatallthecake 🔮4.5 StarsAs you might be able to tell I thoroughly enjoyed this book I didn't even know existed three or four weeks ago. I mean, this books' name was thrown to me at random, as most thing are in the RHR lair. The place is wack. There are rooms within which are populated by LOTS of cake, swooning, books and the occasional random stranded male specimen, all randomly and suddenly airborne without notice, rhyme or reason. It is quiet and then *boom* suddenly out of nowhere everyone appears, chaos ensuing shortly thereafter.\nIt was a fine day when I walked into a room and narrowly avoid a book about Archangels or something that was thrown at my beautiful face, along with a piece (or three) of cake. Suddenly out of the chaos a voice rose, saying \nGYPSY'S BLOOD\n. I had only a moment to think of it before Praying Kitten & Aqua Sparkle poofed on either side of me, chirping about it so loud you could hear them from space.Having read her very first book, Four Psychos, I didn't need much convincing to read this one. I read it. I loved it.Now, having not finished her other series and me in reality being three couch potatoes and a muffin in a fifties dress pretending to be human that knows how to people, I can't help but compare these two books in a fashion that greatly resembles nothing of a review.These two books are nothing alike yet they have two key ingredients that are the same in both: The Structure and the Pace.Beyond that everything and everyone else is different.The story is intriguing. I've never read anything revolving around Gypsy's and the paranormal elements blended well with it to create something new and exciting!The characters were great, and above all, distinct. Each one had its own clear voice. To reiterate this was the fact that we got POVs from most all main characters. My absolute favourite one was Anna, The Pet Ghost. Sidekick extraordinàre to our heroine. I can go as far as to say that I WANT AN \"ANNA\" FOR MESELF ASAP! The guys are my seconds. I mean is the sun blue? Yes, yes it is! I love their frienemy status! You can just taste the comfortable & second skin familiar hate that can only be brought forth from the strongest of Bromances.I think there was someone else I had to mention.. Hmm.. Oh yes, Violet or whatever her name is! Lol, don't let me fool you my peoples. She is a good character, she's just quiet. As death. That however, fits extremely well with the rest of the cast. If she was with other people instead of this set then you would have forgotten her before you started reading. I forgot her at times during, if I am to be honest. \nOverall I greatly enjoy French Fries and being as random and as creepy as fuck. You can now pretend you haven't already stopped reading and go away to read this book."}, {"Review": "The Dark Side is one of my favorite series.This one is already topping it though.The world building had me scrambling a tad in the beginning and I sort of had a hell of a time separating the new characters initially. It definitely got better at about 40%.Damian, Emit, Vance and Arion are all separate individuals. I enjoyed their personalities immensely. They are all cursed. They are also sort of bad dudes. I am fairly positive that everyone in this book is cursed a bit. They all apparently deserve it too. Poor Damian has it the worst in my opinion.The curses are not that predictable either so that is fun.I am not sure is fun is the right word...Violet/January is great. I love her. She is in the dark about so much. She has her own secrets too though. Violet moved to town when her mother died because her mom left her the shop in the will, she assumed it would be safe there.The town ends up being full of monsters and monster hunters. There is no way for Violet to hide who she is even though she does try.I absolutely loved Anna. Her character had me laughing out loud so often my family thought I was losing my mind. Anna is so perfectly, insanely, inappropriate."}, {"Review": "I’m uncharacteristically late to this BR with the Reverse Harem Revolution but better late than never! First Cunning gives us Four Psychos, now she gives us four monstersand they are epic!This book has been all I've heard about since Dec. So I had some pretty big expectations, but I'm happy to say. Its worth all the hype.  I wont even be able to review this fully because I am itching to start into the next. yes I am glad I waited so I don't have that awful wait for the next one! haha I can start right now So I'll be brief; Anna is the star of the show I love that crazy ghost! Violet really was the Robin to her Batman The lines she came out with were just, classic. Too many to highlight. Every time she appeared I wanted to highlight the whole thing. “I just gave him a phantom blowjob. If I lick it first, that makes it mine!” she shouts from somewhere behind us.“I’ll stop, Gov’nah!” Anna shouts with a faux Southern accent. “Please don’t throw salt in my vagina again!”I just want to be her when I become an invisible ghost some day. The monsters are just the icing on the cake. Such a great harem. I love it when its a mix of paranormals. So slow burn but it's going to be hella satisfying! The tension is building and I love it \"I’m supposed to be the reckless one. Arion is the psychopath. Emit is the broken, savage beast. Vance is the one who has his knickers jammed up his asshole and is supposed to keep the rest of us in line.\"They haven't shown us too much of their monster side yet but I have high hopes! I live in Ireland right. So my view of gypsy's are not in line with the gypsy's we have here in this book.I need to re-align my mental picture from this to moreThey seem to be a race of supernaturals in their own right but with some of the foresight and potion making we might associate with a gypsy fortune teller. Violet is a powerful one and holds some secrets herself. I cant go on anymore, suffice to say this is making my top 10 RH. but then so did 4psychos by the end of book 1 so I still have my fingers crossed this doesn't head the same way. Maybe it took a nose dive because Kristy was working on this little gem instead "}, {"Review": "So I'm a bit of an idiot and I downloaded a bunch of books after taking some muscle relaxers for my back spasms and when I woke up, I found this book and many others on my kindle as a great little surprise for myself. I started reading this one and got about halfway through before I remembered \"Oh! There was a reverse harem in there!\" This is one of the few times where under the influence me and Amazon actually got along but I do not condone this method of shopping or you will end up with a 5 pound bag of gummy bears delivered to your door and received by a slightly judgmental husband.Anyways, I went into this book thinking it was just a quirky paranormal romance and while it was that, the addition of the reverse harem was just icing on the cake.Violet has old gypsy blood which makes her able to see ghosts and interact with all the spooky spooks in the world, including but not limited to werewolves and vampires. Her crazy albeit charming sidekick, Anna, is the world thirstiest ghost who is about to jump on any warm male that she can find and give you a full narration in the process. Since she can't actually touch anybody (and nobody but Violet can see her) she is more than happy to live vicariously through her friend and encourage her most strongly to get on the pony.Violet is sort of the silent but deadly kind. She is powerful with the magic in her blood and she uses it in unconventional ways. I love that she able to take people by surprise in this book and actually fucking defend herself instead of relying on the menfolk to get her out of sticky situations.This is definitely a promising start to the series. I don't want to get too much into the plot because there is so much that could be spoiled, even by just describing what the hell is going on. There are twists and turns and manly men that like to walk around nekkid. Which Anna is completely okay with. As I would be too. Yow."}, {"Review": "An enjoyable start to the series, just not one I felt immersed in, and the end of this book left A LOT of questions unanswered. For everything that is revealed more questions emerge.Violet is a Portocale gypsy, who has moved to live in the town where her mother was murdered, but with almost no knowledge of her heritage, and the curse suffered by the powerful monsters of the town, she's in for a bumpy and eye opening ride. A ride she shares somewhat with her companion a lying, sex hungery ghost .This is labelled as a reverse harem, but I wouldn't call this a reverse harem book, although there are small, fleeting hints of potential romance towards the end with 3 or 4 of the male leads. Maybe that will be a more potent and explicit component of the next book?Small moments of amusement, but I wanted more depth, heat and intensity."}, {"Review": "4.5. I really loved this!!!The author's Four Psychos series is one of my favourite RH series' and this is an absolutely brilliant start to something I think I might end up liking more!This has, for me, what Four Psychos didn't have, and that's interesting male characters. The Four Horseman became pretty interchangeable for me eventually, which is often a problem in RH, but certainly not here. Vance, Damian, Emmitt and Arion are all very separate and individual and they are, indeed, beautiful monsters. They're all reasonably bad guys, and they have all obviously done something pretty awful in the past to be in their current predicament, but I love them all and couldn't tell.yiu which my favourite is at his point! There's also so much unexplored back story between the four men that I can't wait to find out!Violet is a great character who also has so much about her that we only just scratch the surface of here. She's a monster herself, but neither she nor the reader at this position not really know what that means. I loved her attitude and her reactions and actions towards what happen to her. She's very likeable and I rooted for her pretty much straight away.Her ghostly side kick, Anna was both absolutely helarious and at times a little annoying, but I thought she was a great addition, too. She reminds me a lot of Paca in her crazier moments.In summary, if you liked Four Psychos then I really think you'll love this. It's different, but has a lot of the same vibe and character dynamics, but improved in my opinion. Apparently the next one is out in 3 weeks and I cannot wait and while there is a cliffhanger, things get really interesting!"}, {"Review": "Ok. This was weird and strange and there is a TOTAL LACK OF SEX. I'm talking about not even heavy petting here. There's some kissing...and some tension.......thats totally not my thing, btw. I love tension but if a book is gonna have sexy times, I expect the sexy times......But I really dug this weird ass book. The heroine MC is...super clueless (this appears to be a trend for the author, as I'm reading another series by her right now)...and being lead around the nose. By some dangerous ass people. The shitty part is that this author totally ends her books in cliffhangers. 100%. I mean the old-school, soap opera style cliff hanger where there is action taking place and then BOOM! Last page. This is also a trend for the author.I iz not amuzed. Regardless of said shitty cliffhanger (heroine just collapsed in a dangerous place after dangerous stuff happening), I was super surprised about how much I liked this story. I liked it enough to read a different series (a COMPLETED series) by her. Note to Author if you're reading this: STOP with the cliffhangers!! That shit is not cute. It totally puts YOU (as an author) in a place where I (as a reader) will not pick up one of your series books until you're 100% done. Cause I have picked up book 2 of this series... but I have not started reading because I know you're doing the cliffhanger thing. That's money not going into your pocket... (KU, you know?)"}, {"Review": "To say the pnr market is saturated with RH novels is an undeniable fact. But authors who can actually deliver a story line, a layered world and multiple 3 dimensional characters who can maintain a sizzle factor...? Those authors are few and far between. Certainly making the grade is Kristy Cunning. Her worlds are a little on the dark side, but they are intriguing and like real life have funny, tender, scary and sad moments. I may not stick with the series long term, I will see where this journey leads, but certainly book one captured my attention, and will be diving into book 2 immediately"}, {"Review": "Kristy Cunning writes a fantastic reverse harem. I recently finished her  Dark Side  series, and when I found out she had another reverse harem coming out I was over the moon. While this book ends on a cliff hanger, which I’m not normally very fond of, the next book in the series comes out early January so there’s not too long to wait.The world-building in this book was fascinating, and there were a lot of interesting twists. While the general idea of a parent passing and leaving behind a child who doesn’t know much about what they are or what they can do isn’t unprecedented, the spin that Kristy Cunning takes is unique and intriguing. As always with her books, I often found myself unable to predict the future plot points. There were a few that were easy to see coming, but they were done in a way that built anticipation and made me want to get the reveal faster.It’s so hard to talk about the male leads without spoiling anything, but I want to so badly! Reverse harems often have almost interchangeable male leads, but the ones in  All the Pretty Monsters  were distinct, and I loved each of them for a different reason. The heroine for the novel, Violet, was also awesome. She was a really strong female character, and while it’s easy to write an innocent, naïve heroine in this type of novel I love that Kristy Cunning made her humorous and wily instead. Despite her lack of experience and knowledge for the situation she finds herself in, Violet manages to gain the upper hand in many of her exploits with the male leads. And of course there’s Anna, who kept me laughing throughout the whole novel. I’m excited to hear what she has to say in the next few novels where the relationships will really kick off. This novel is a slow burn in terms of romance, so no sex in the first book of the series.The only con was the occasionally repetitive descriptions or sentence structure. I think this novel was pushed out very quickly, so there was probably only basic editing done. It didn’t occur often, and I’m sure it’s something that will be fixed after a more thorough editing. To be honest, I don’t care much, especially because I only noticed it once or twice and I think it’s a small price to pay to be able to have the books published faster. I need to know what happens next! Even with this, Kristy Cunning’s reverse harem novels are superior to so many of the others out there, particularly in terms of original and interesting plot and characters.I strongly recommend this novel to anyone wanting to read a reverse harem. It’s a great mixture of world-building, romance, and humor, and I couldn’t put the book down."}, {"Review": "Gypsy's Blood is the first book in a new series by Kristy Cunning (a reverse-harem pseudonym for C.M. Owens). It definitely makes for a great and extremely intriguing start. You go through the book (thankfully not as lost as the main female lead) wondering just what is happening, but in a really good way. Each revelation leaves you wanting more. The men share a 1000-year history with each other. Violet is 25. She and us have a learning curve. Since this book is told from multiple POV's - we get more info then she does. But still, she is one really smart girl and I really like it. And I truly love her 'soldier on' attitude. Come what may, she does not let it 'panic' or phase her. I genuinely enjoyed reading this book and I laughed a lot in places. Definitely looking forward to the next one. "}, {"Review": "UPDATEI cannot overstate how much this book made me laugh. Seriously, almost all of my notes are just parts that made me laugh. This book isn’t perfect—some characters were a bit lacking and some plot elements came out of nowhere—but I was too entertained to care.The MC, Violet, is definitely overshadowed by her best friend, the stalker ghost Anna. I thought it was an odd move because the author repeatedly mentions via Anna that Anna is much more interesting than Violet, and I can’t really argue with that. Violet apparently has cool powers and funny reactions to Anna, but that’s about it.Anna, though—omfg, Anna. Pretty much everything that comes out of her mouth is pure gold. She is a compulsive liar who can no longer determine fantasy from reality, so there is no way to predict what she will say next except to assume that it will be highly inappropriate and sexual.One of the funniest things about the guys is how they must pretend that they can’t see Anna, no matter how bad her sexual harassment gets. Yes, I apparently have a double standard there. Anyway, my second favorite thing about the guys is their overall dynamic. Vance is the stiff tough guy, Emit is the pretty-boy dumb-dumb, Damien is the . . . invisible one (?), and Ace is their stalker. I fully accepted Vance into the harem as soon as he started badly painting Violet’s toenails to try to calm her down. I’m going to be honest, I really want to see a hate bang (which I’m usually very much not into) between him and Emit because of how often Emit’s nudity is a topic of conversation between them. I guess I’d say Damien is the weak link here because I’m not sure what really differentiates him from the other guys other than his species. They’re all horny infants, so that doesn’t help in telling them apart. I guess he’s more overtly sexual than the others, though. And then. There’s. Ace. I’m going to be honest, I have some unresolved feelings here. I kind of saw his twist coming but not the full extent of it. He’s the main reason I’m so desperate for book 2 because he was my favorite and now I have no idea where things really stand. Also, I have no idea why he kept telling Violet that Vance is gay . . . unless that was the author laying the groundwork and showing us that he lies 😱! I just figured that out. Ok, moving on.Gah, that ending tho. It wasn’t even really a cliffhanger, tbh. The scene was over; I just wasn’t ready for the book to be over 😂.As much as I was loving this book, I had a few problems with the writing—particularly some plot points that seemed to come out of nowhere: 50% into the book, we suddenly learn about several magic powers that the MC has apparently had all along. I don’t think there was any good reason to withhold that information for that long. And it was just casually dropped into conversation! It really bugged me. The writing mechanics had some issues as well: for example, problems with the inclusion of too many words (e.g., “nothing covering him but an open robe on” and “the overall order of the worldly pecking order”), word choice (e.g., “crucial tone,” “wail” instead of “whale,” “two men strangle against either wall,” “I haven’t been abridged on the pecking order or politics,” “serious” instead of “seriously,” “rooting” instead of “rutting,” and the repeated use of “oblivion” instead of “obliviousness”), periods after questions and question marks after statements, and problems with subject–verb agreement (e.g., “men who can turn themselves invisible has made me paranoid”).I think I only have about a week left to wait based on the afterword, but that still feels too long. I seriously loved this.\nPROGRESS UPDATES\n15% I love these guys SO. MUCH.: \"'Unwind your coattails from your asshole,' I say dismissively to Vance’s rigid back, as he shoves his hands into the pockets of his slacks. 'What the hell does that even mean?' Emit asks me, looking at me like I’m an idiot. 'I don’t think that’s the right saying,' he adds. 'That’s because you don’t know what coattails are, you nude barbarian,' Vance says.\"75% I just laughed SO. HARD.: \"I curse when something wet touches my cheek before I even get a whiff of anything. All I smell is wolf, wolf, and more wolf. 'Why is it wet?' I snap. 'Because I licked it for like a fucking hour,' he says like he’s really pissed off. 'Are you fucking kidding me?' I bark as I toss the bowl at the wanker’s head.\"ORIGINAL POSTI need the next book NOW. Full review to come."}, {"Review": "I struggled a lot with this book. I was so confused for about 90% of it. And Violet was kind of an idiot. She trusted too easily. If it weren't for Anna, I probably would have put this book down. Anna was hilarious and I love her. But I kind of hated everything else about this book.Okay but here's the thing, I HATED the first book of Kristy's other series Four Psychos. Like I hated it. But I kept reading because the MC was funny and I ended up absolutely loving the rest of that series. SO I am going to read the next book and hope that this series is like that one and gets better the more I read.I gave this book 2 stars for Anna alone. "}, {"Review": "What happens when a seemingly fragile, innocent gypsy girl opens shop in a quaint town where she runs into ... monsters?Sounds like a fairy tale, and in a way, this is a dark sexy one with hot alpha male monsters who are strangely drawn to the gypsy because of her sweet smelling Portocale blood and ... oranges!The longish story has many secrets that never quite unravel and central to the plot is figuring out who or what exactly is the real monster.What’s equally entrancing and amusing about the dark yarn is the baffling hold the gypsy has over the males. Expect a cliffhanger ending with apologies from the author! "}, {"Review": "This was an interesting one, and I actually put off reading it for ages because I loved the Dark Side series so much, I was scared I'd be let down. Then I tore through this book in a morning. The heroine I liked a bit more than Paca, I think. I loved Ace the hero. Unfortunately I'm still on the fence about the other three heroes - I preferred the personalities of the guys in Four Psychos a lot more, even though people complained that they blurred together in that series.Safety warning: there's an implication that one of the heroes has an orgy with four other girls a LONG time after he meets the heroine, near the end of the book. Everyone else is safe as houses.[Blog] - [Bookstagram]\n"}, {"Review": "Violet is a Portocale gypsy, a rare one with old blood and gypsy pride. She's lived her life on the move since a cult dedicated to the Forsaken has been trying to kill her as a sacrifice since she turned 13. Her mother was recently killed and left her a house and lucrative business but no warning that she will be surrounded by monsters. Once there Violet also realizes that her mother has not given her vital information on being a gypsy or told her anything about the world of monsters. With her intelligence, her innate gypsy power, and her ghost companion Violet, shakes up this world and the four ancient Alphas bound by the Portocale curse. Violet also has a secret, she's also one of the beautiful monsters. I loved, loved loved this book. Violet is a fascinating combination of innocence and ignorance with power and intuition. It's impossible to guess how she will respond or react at any time. It was also impossible for her not to burrow into my heart. I sympathized with her, got frustrated with her, worried with her, and laughed with her. Her best friend, lingerie-ghost Anna amused me to no end. I was afraid that she would be irritating when she was first introduced but she left me laughing on almost every page. Truly, I can't believe what came out of her mouth. Hilarious. Vance, Damian, Emit, and Ace are all very separate and individual characters. There's no denying they are absolutely beautiful monsters. Their 1000 year history with one another, once closer than brothers, now semi-deadly enemies makes for a great dynamic. Vance's perfection and appreciation for beauty, Damien's mirror-obsession and sex-issues, Emit's nudity all lighten the heaviness surrounding their anger and general unhappiness with life. I am not sure how I feel about Ace. I loved him at first, then saw who he was and what was coming. I'm not sure how we come back from his betrayal and abuse of trust. I enjoyed the initial world-building and look forward to the full history of the Alphas and the Portocale gypsies. I look forward to finding out Marta's reasoning for everything she did and did not do. I want to know more about Violet's secret. I look forward to the point when this series goes RH. It's set up to be one but at this point, there are no relationships. Damien is definitely interested but can't (Deadly, not happy ending). Vance is supposedly gay (Well done, Ace!) Emit is sleeping with every one of his Omegas (not attractive in a harem member). Ace (too many problems to even begin). So many things have to be resolved before I can be happy with this harem. Plus, I have to be convinced beyond that that the Alpha's are interested in Violet for the right reasons and care about her not only about themselves and the curse. This may be an RH that I enjoy for the humor and overall story and not at all for the RH. That would be a first!"}, {"Review": "Kristy has a way of making a plot so unequivocally complex (at least to my wandering mind) that the whole plot kinda just zooms over my head unapologetically while it rains llamas.Let’s be real: did anyone REALLY understand what the flying fuck was going on in Four Psychos? Sort of.My whole focus on that book was KAI KAI KAI, and Jude.And now Kristy bestowes upon us another RH that JUST FUCKING SLAYSSo with this book:THE HUMOR.I don’t think I’ll ever understand Kristy’s mind.Hell, I don’t think Kristy will ever understand her own mind.And that’s what makes her books SO FUCKING PERFECT.The humor really is a 10/10.As are the men, or shall I say monsters.These men are bloody perfect too. None of them sound the same (as happens in some RH series). Violet is... clueless per say, but she’s catching on.(I on the other hand am NOT but whatever this book is hilarious.)ANNAAnna is a treasure we all need in our lives. She completes this book on a whole ‘nother level. She is beauty.She is not grace.She’s MISS WHO GAVE HER A MOUTH.Anna is my spirit animal.Half way through the book and shit is starting to slowly add up. When Violet mentions she doesn’t know what’s going on around her, I find it devastatingly funny.I don’t either, Violet. Let’s go get drunk.Is Dorian Gray a real historical character or did Kristy go down the Sherwin-William paint swatches to get the name? Because for realsies Dorian Gray is the color of my friend’s livingroom walls. Overall, AH-MAZING.Is book 2 out?Is Anna gonna survive?It’s not really a cliffhanger ending. More of an abrupt STOP. Casually gonna state that my suspicions of a certain Ace WERE TOTALLY RIGHT.Camila: 1Book: 4 ⭐️"}, {"Review": "This book was recommended to me by a Goodreads friend. I'm so happy she included me in her recommendations because I loved the story. It was a story that had me captivated, and every time real life pulled me away from it I was upset. The Secondary characters were just as good as the main characters. Anna was my favorite character of this tale. She was a crazy ghost with outlandish statements that made me laugh.I read the story wishing it was a buddy read. It would have made for great discussions. I knew ahead of time that the story would end with a cliffhanger, so I'm heading immediately to book two. The storyline was excellent, and the writing would have been excellent too if it wasn't for the grammar issues. This is my first book by this author, and I look forward to reading more from her. But, I just wish I could tell her that she needs better beta readers. Great Read."}, {"Review": "While not badly written, and the worldbuilding is interesting enough, the entire book is basically talking. Not only does everyone sit around and talk the whole book, but it irritates me when the lead doesn't know what's going on, only has it told to her in bits, and doesn't believe the new information for extended periods of time. I got the men confused on who was who. The ghost was funny, but sometimes even I wanted to salt her when she got on my nerves. Again not horrible, but not much interest for me long-term."}, {"Review": "This was not a series that I saw coming. I love Kristy Cunning aka CM Owens but I didn't even know this was one of her works till it popped up on my Amazon KU read lists. I was so excited! She did not disappoint! I always read her books in one day or in a day and a half. Sadly, never very productive when it comes to these books that I can't put down. I should've waited for the whole series to be published since she loves cliffhangers! There is one here but it isn't too bad. I can't wait to read the next one.Overall: 5/5"}, {"Review": "Gypsy's Blood is an amazingly unique and intriguing fantasy reverse harem story! Kristy Cunning's Dark Side series was fantastic so I was very excited for this book and wow I was not disappointed. Gypsy's Blood introduces us to a new world, one with gypsies, magic, and other paranormal creatures. I've never read a book quite like this one before and I loved the representations of gypsies and their role in the world here. Violet is an awesome character. Having just lost her mother she is lost in the world. She has taken over her mom's business, but has to hide who she is to discover who murdered her. But Violet isn't just any gypsy girl, she is powerful and hiding a darkness that even she doesn't seem to fully understand. Throw in a town full of supernatural creatures, who all know who she is, and a hilarious ghost companion, Violet's life is turned completely upside down. Despite the struggles she faces, she *mostly* keeps a level head.When towards the end of the story she accidentally breaks her number one rule, this book takes a crazy turn. I can't wait to see where Violet's story will go in book 2!"}], "Genre": "Romance", "ID": "43239166", "Desc": ""}