{"Name": "Unzipped", "Image": "https://images.gr-assets.com/books/1535574743l/40793242.jpg", "Reviews": [{"Review": "4 stars!! \nUnzipped was such a fun and sweet friends to lovers story. Even though the two main characters were strangers at the beginning of the book, they became fast friends before any romance stepped in. Kyler- aka Tom is out to get his college sweetheart back. She was his first love and he feels like he’s ready for a relationship now. He’s more settled. He decides to go with a big gesture. He’ll go to her home, play the boombox, all that good stuff. Problem is… he goes to her neighbors house *face palm*. This neighbor, Finley, gets a kick out of this. She explains to Tom that his ex is never there and decides to help him to come up with a less corny way to win her back since they have time. This book made me smile and laugh non-stop. It was super cute. I thought the narrators did a great job with this audio. They were high energy and did an amazing job voicing Tom and Finley. I also loved that even though Tom started out wanting his ex back, wanting Finely just came naturally. It never felt like she was second best to me. And Finely had her show/writing going on but using Tom as inspiration was never hidden. I loved how open these two were with one another. If you’re looking for a light and entertaining romance, check out Unzipped. If you are an audio book listener, I highly recommend it in this format! It was fantastic."}, {"Review": "Lauren Blakely's specialty are lighthearted, easy and fun stories with lovable characters. Unzipped falls in this category. When I started listening to it I just came out of a major book hangover so this was the perfect remedy.Kyler/Tom is adorkably clueless when it comes to women. He's a hot nerd who wants to win back his first love who broke up with him telling him to be in touch again when he has his head on straight. So now he deems himself ready and wants to woo her, equipped with a boombox and his heart on his sleeve. Only, Cassie isn't at home. Instead  he meets Finley, his old girlfriend's neighbor who isn't impressed by his antics and decides to give him lessons in courting and dating women.Finley is such a sweet heroine. Burned by a man because she was his rebound she doesn't want to make the same mistake again so falling in love with Tom seems to be a supremely stupid idea...but soon she's charmed by him.I loved the honesty with which they treated one another. They had so much fun just talking and conversing. Tom's naughty streak was hilarious and often times made their conversation drift into sexual insinuations which weren't cheesy at all because they were done in good fun. These two were so quirky, endearing and entertaining, the book felt almost a little too short.Joe Arden and Andi Arndt did a wonderful job bringing these two characters to life, I actually felt that they had as much fun narrating as I had listening. I loved that they actually recorded alternate narration for the text messages.If you are in need of a light, funny, quick romance fix you won't be disappointed with Unzipped. It was charming and sweet with a good dose of sexual tension and steam."}, {"Review": "A wee bit corny...***3.5 Stars***Unzipped is the kind of audio to listen to when you want a light and easy listen. It wasn't overly complicated, made me laugh a few times, and had some heat. The characters were engaging and you could tell from their first interactions that they had a serious connection.At first, I was a little worried. The hero is planning to woo his first love and make a big gesture to show her that he's a better man now. But, it's not the heroine. Also, the heroine is a comedy writer and it was pun after pun after pun. It did settle down and the storyline became fairly entertaining.The narrators do a fabulous job keeping it light and entertaining. It never felt like it dragged or made me feel frustrated. I could easily tell when the characters changed and I loved the dual reading. This was my first experience listening to an audio with dual readings and I wished it happened more often.This wasn't my favourite Lauren Blakely but it did keep me entertained on my journey to work. I will always come back for this author's work."}, {"Review": "4 Lollygagging StarsOh man, this was super cute and so much fun. The movie quotes and quirky characters immediately won my heart. I loved the fun tropes and movie quote trivia. How fun to incorporate this type of pop culture that permeates TV and the movies and use it in a romance novel? Quite genius really!Unfortunately, I had a trip up in the beginning. It was a bit more of a slowburn than the sexy cover seems to suggest (or maybe I'm a perv) so I was a smidge confused. A sexy nerd and completely unaware male is what we get in this fun rom-com. The nod to some of my favorite romance movies, coupled with my love of roller coasters made this a winner though. Tom and Finley are great together. Their quirks just seem to work. They're both pretty much two goofballs who really get each and have amazing chemistry. It was definitely a lot of fun. The audiobook is narrated by Joe Arden and Andi Arndt, two of my favorites. It's fantastic. So well done and completely fitting of this cute little novel. Overall, I definitely recommend this quick read/listen."}, {"Review": "1.5 NopeOh, Lauren, what have you done?I had high hopes for this one. I didn't expect anything special, mind you, I just wanted a cute, light, maybe funny read. Instead, I got this.The characters were lacking, they were so weird. It was like they had double personalities or something. Not the female MC, but the male one. He was just... it was like there were two of them at times.The plot should have been cute and all, but somehow even that ended up being boring. It was too long (and without a reason for said length) and it rarely made sense.I wouldn't actually recommend this one, especially to Lauren Blakely fans. It definitely wasn't her best work."}, {"Review": "100% of pre-order proceeds & first five days of sales go to California Fire Relief Charities!Finley is the creator and writer of a tv comedy show, but the network is not really excited about renewing her show. She has to write six amazingly funny episodes asap!Enter Kyler. Eight years after his college love Cassie broke up with him and issued the ultimatum that he grow up and make something of himself, he's finally ready to win her back. A la Say Anything - boom box and everything! Only worse. ☺Unfortunately it's Finley's window he's embarrassing himself under! LOL!Fin is super excited by Kyler's story - she could use it for her show!!!And off they go on a mission to win back the love of Kyler's life.But what if you fall for someone else on the way ??? ......What will happen with Finley & Kyler-Tom?Will there be a HEA?READ THE BOOK TO FIND OUT! ☺════════════════════ Awww ... that was adorable and hilarious!Kyler is so sweet. Thinking that Cassie was just pining away for him these last decade! He believes that she will take him back when he shows up with his great gesture.And poor Finley. She's kinda mega attracted to Kyler/Tom, but she won't allow herself to fall for him because the exact same thing happened with her ex - the ex that was still in love with his ex!But of course those two can't resist falling for each other ... and the reader has an amazing time watching it happen!I really enjoyed reading this story!So funny, sweet, California-ish, adorable and roadtrippy and movie-quote-y and a bit heartbreaking too ... I might have cried a tear or two ....Amazing Rom-Com!!Plus also ... I wouldn't mind seeing this on Netflix one day!Oh and the only thing that was a bit weird. All those brothers and cousins of Kyler and the book store owner lady and her guy? What's up with them? Do they have their own books already or are we getting their story one day??? There was to much in this book about people and their story - it was a bit confusing/redundant ... unless we're getting their books soon! In that case: GIMMEEE!☺(edited after finishing the book - it's explained a bit at the end - and also I was doing some goodreadsy research - I now know that Gabe and Arden will be the stars in Best Laid Plans - coming in March. And there are lots of Lauren books coming in 2019 - maybe we'll get more of the people from Unzipped - also - a few are already happily married.)UNZIPPED was such a fun and adorable half meet-cute-getting-to-know-you - half road-trip love story!! Run to your nearest amazon asap for your own Kyler Tom - this one is MINE !!!100% of pre-order proceeds & first five days of sales go to California Fire Relief Charities!\n♡ \n♡ \n\n♡ \n♡ \n\n\n\n \n \n \n \n"}, {"Review": "3.5 starsAudiobook ReviewAndi Arndt and Joe Arden are two of my favorite narrators, so it would have been a massive surprise if they phoned in subpar performances. Fortunately, they did not. The story itself is perfectly fine—it’s just not as laugh-out-loud funny as most of the other Lauren Blakely books I’ve read. The premise is cute and tailor made for fans of romantic comedy movies. There are a ton of references to rom coms made in the 80s and 90s, and it’s borderline overdone, but I’m a child of the 80s who enjoys chick flicks so it gets a pass. I liked both main characters, even though Tom is so adorkably clueless it hurts. The first half lags a bit and I struggled to stay interested at times. However, I enjoyed the second half more and the big finish is really satisfying.Recommended for fans of:Roller coasters80s moviesBig romantic gestures\n"}, {"Review": " Release Date:  December 11, 2018 Genre:  Romantic Comedy  An adorably lighthearted romance that will induce the giggles in any reader  Lauren Blakely is one of those authors that can write numerous books within a year and make every single one a fun and lovable read. And when I say every single book- I truly mean that. Unzipped as just as quirky as the books before it only this time, we get a cool hint of the 80's and 90's (boombox, serenading a woman in front oh her home, you get the drift). While it's not laced with 80's and 90's nostalgia, I will admit that beginning the book with it HOOKED me. I laughed so hard and truly loved it! Anyway, this is a truly lovely read and one I don't think I will be forgetting in the near future. It's got fun characters (both of which I would easily call friends if they were real) and an engaging and original plot. I very much recommend this to anyone in need of a romance fix as this one is bound to lift your hearts and make you smile!"}, {"Review": "This was short, straightforward and enjoyable if not exactly outstanding. Finley and Kyler (who commiserate over having weird names) are practically made for each other with their shared love of cinema and tolerance for adventurous activities. Their meet-cute is awesome and since Finley is a television writer and Kyler is following every romance trope he can think of, we get a lot about romance and romantic story tropes while they navigate their way to being together.Blakely uses Kyler having gone to an all-boys high school to explain how very relationship-clueless he is and why he keeps leaning on movie scenes and lines to express himself to women. So Finley ends up being his translator, deliverer of clue, and spirit animal on his discovery quest for relationship enlightenment. On the other side, Finley finds Kyler an excellent muse for the sitcom she is furiously creating scripts for under the unreasonable demand of her boss at the network. I loved how they are helping each other and came to respect and appreciate their respective strengths.I didn't love so much the contrived backgrounds or the strain the story was put under to have them experience all the romance tropes they were talking about. I mean, it was cute. Maybe? Particularly when (very minor spoiler) (view spoiler)[Kyler hired a couple people to fulfill some of the tropes on their little road trip (hide spoiler)]. But it also bent the story a bit and I appreciated that a good deal less.So I'm leaving this with a solid three stars. It's a good time but it's good that it is so short because any longer and it would have worn thin.A note about Steamy: There are a couple explicit sex scenes putting this in the middle of my steam tolerance (for such a short work). They're NA adventurous so I didn't buy them any better than I did some of the other elements, so this is a part of the underwhelm that lead to the three star final."}, {"Review": "4 Tom and Finley StarsIf you are looking for a light, fun , sexy book....look no further. If you love references to the music and films of the 80's then you should snap this up. A word of caution though - do not drink hot beverages whilst reading Unzipped. Or , as in my case, listening to it on audio. You are liable to laugh hard and choke on said beverage. It was worth it though. Tom (Kyler) is a very likeable nerd who is desperate to win back his College girlfriend's affections , years after they parted ways. In the process of doing so he meets Finley, who is his ex-girlfriend's neighbour. I like Finley very much. She is a comedy show writer and meeting Tom kick starts her struggling career. They fit well together and as they embark on a road trip to help Tom win his ex back, new feelings start to emerge between them. But where will this road lead them?Fun, light and entertaining book. Andi Arndt and Joe Arden do an excellent job of narrating. HEA? YesCheating? No "}, {"Review": "After reading the blurb for Unzipped, I was instantly intrigued. It’s not the first time Lauren Blakely has written about a hero trying to win back the girl of his dreams, but it IS the first time that said dream girl isn’t the heroine. What was even more intriguing was that Unzipped was being released as an Audible original, co-narrated by Andi Arndt and Joe Arden. As a frequent reviewer of the author’s books, I don’t often get to experience her books in audiobook format, so getting to listen to Unzipped was immensely enjoyable, especially in the hands of two such evocative narrators.As a rom-com junkie, I’ve read my fair share of memorable meet cutes but the bungled, Say Anything-inspired first meeting between Finley and Kyler, who shall henceforth be known as Tom (just go with it), is one for the books. After his grand gesture to win back his college girlfriend results in him serenading the wrong woman, Tom is forced to regroup, this time with the help of an inquisitive stranger. Working as a writer for her own TV comedy show, Finley’s brain is wired to see the humor in every situation. She analyzes the world around her, constantly looking for writing material, and inspiration strikes in the form of the sexy bespectacled nerd who’s adorably clueless when it comes to women. Neither expects their harmless flirtation to lead to a mutual attraction that has them dancing toward something deliciously dangerous.Together, Tom and Finley have this indefinable, magnetic connection that’s evident in their effortless rapport. They interweave movie quotes into dialogue and flirt shamelessly, bonding over their idiosyncrasies and reveling in each other’s quirks. Their similarities are embraced, but so are their differences, which was both charming and compelling. While Tom initially sets out to reunite with a former flame, his plans change upon meeting a woman who challenges him, excites him, and surprises him at every turn. In turn, Tom gives Finley hope that real-life romance can be just as swoon-worthy as the fictional love stories of film and television.Packed with flirtatious banter and lighthearted humor, Unzipped is a rom-com that’s cleverly written, refreshingly self-aware, and just plain entertaining. As narrators, Andi Arndt and Joe Arden breathe life into Lauren Blakely’s words, delivering a delightfully fun, unbelievably sexy, listening experience with Unzipped.*complimentary copy provided by Audible for an honest review"}, {"Review": "4.5+ starsI was pulled in right from the prologue. I still have such a fondness for 80's movies and pop culture so this book really spoke to me. It's fun, quirky, and full of romantic tropes.He is an an intelligent man with a unique and interesting career. He is a planner and feels he is ready for love and commitment. But he is also a bit of a clueless male who has been surrounded by brothers who also give not so great advice. So he sets off on an adventure to revisit the girl he last felt strongly for...his college girlfriend.She is a television comedy writer and in need of some fast inspiration for her series. She was not expecting this strange man to show up in her life, but he certainly helps inspire her. She is chatty, funny, quirky, and curious. She loves a good story and he is full of them.When they team up to work on their separate goals, they develop a fun rapport and mutual support system, and can quote with the best of them. But the closer they get, the more confusing it gets. As they are helping each other, they are starting to have to avoid and deny some things that might be changing. They've both got fears and insecurities from their pasts that affect how they see relationships. But sometimes life flips the script. These two are teaching each other. They are growing and changing. They are learning from their mistakes, building self worth, and trying to be better people. But they are dancing around attraction and temptation, while having fun, sharing common interests, and pushing each other's buttons. Reality can slap you in the face when you least expect it. And sometimes plans do not always go as...planned. These two are totally adorkable! Hanging with them was totally fun! They are quirky and imperfectly perfect together. I loved their adventures, their humor, and banter. And anyone who loves 80's movies knows how important grand gestures are and that you have to get it just right. I enjoyed the tropes and plot ideas and how they were integrated into a new unexpected rom com. It made me happy and giddy and I adored it.I received this book for free from the author in exchange for an honest review. This does not affect my opinion of the book or the content of my review.Follow Me: Reviews by Tammy & Kim (Rachel and Jay) | Facebook | Twitter"}, {"Review": "Unzipped is one of those beautiful ab man cover. It obviously got my attention with the abs and it also just happened to be written by Lauren Blakely. My twin and I love her writing/books, so we just had to dive into it!So this book is about two random people who become friends after an awkward incident. Then along the way they start to fall in love. That awkward incident? Well that was him going to ex-girlfriend's house to try and serenade her to the song they made love to? Which is weird and creepy in his own way.. but it turns out that she doesn't exactly live there anymore. Nope, she's renting that place out now and he's serenading the wrong person. Plus, she doesn't like the song choice either.Kyler/Tom (the other name will make more sense if you read it) thinks romance is just like it is in the movies. He's very naive.. and it made me laugh. I doubt most people would want to be serenaded with a boombox nowadays.. because of neighbors.. or the song choice. Then there's Finley, who was wrongly serenaded, and she was just a delight. She made me laugh so much - plus she's a writer and basically living the dream! Throughout the book, Finley is trying to help Kyler/Tom out with his love life. Trying to get him to realize what he did wrong was hilarious. I also found it a bit creepy how they found so much about Cass, the ex, so quickly. They knew where she worked, lived, and basically everything else. Probably her bathroom schedule. Well, as you all know.. they started to fall for each other along the way. Finley definitely made him a better person. I honestly laughed so much throughout this book - especially when Kyler was daydreaming about him being smooth during one of Cass's yoga class. Okay, I died after that part. I also laughed out loud with the whole jack jack reference too. #Incredibles2Overall, I really enjoyed this audio and I can't wait to dive into another one of Lauren's books!"}, {"Review": "5 SMOOCHES!I am an enormous Lauren Blakely fan, and when I read the synopsis for this book, my interest was instantly sparked. I’m a lover of all things romance, especially romantic comedies, whether they be in book form or on film. I love everything about them from the meet-cutes to the sweet and sometimes cheesy way the couples fall in love to the over-the-top grand gestures and everything in between. So when I realized this book kicks off with a play on what is probably the grandest of the grand gestures on film – the Dobler/boombox scene from Say Anything – I was sold.Blakely gives readers a hot nerd hero in roller coaster designer, Kyler. He was so endearing, so adorable in his cluelessness—I adored him instantly. His mangled attempt at the Dobler-inspired boombox moment was a hot, hot mess, but he owned it and stole my heart in the process. Finley, the girl next door to the girl of Kyler’s dreams, is a comedy writer of her own TV show on the verge of being cancelled. She is in desperate need of inspiration when the poorly singing, bumbling Kyler is dropped right on her lawn. After hearing his plan win his former girlfriend’s heart back, she knows she needs to help this guy.Finley and Kyler were both so quirky and very different, but I think that’s what drew them to each other. They naturally challenged each other, and I think that was what initially drew them to each other and sparked the attraction between them. Their flirty banter was quick and hilarious, and despite their differences, this couple had fantastic chemistry. Finley wasn’t exactly keen to take another spin on the “I’m still in love with my ex” rollercoaster ride that is written all over Kyler, but she does want the inspiration he’s giving her—as long as it doesn’t inspire anything other than plot ideas. It doesn’t take Kyler long to realize that he’s chasing the wrong girl, though, and he flips his focus on Finley. I loved all of his movie-quoting, and his whole sweet and seductive routine was utterly swoon-worthy.Unzipped by Lauren Blakely was lighthearted, sexy and amusing, and it was exactly what I was looking to read when I started it. With Blakely’s clever writing and a wholly entertaining storyline, Unzipped was a witty, fun and charming romance that kept me smiling the whole way through. Five smooches from me!~Danielle Palumbo"}, {"Review": " Tom is trying to win back his old girlfriend and it doesn’t go as planned. Tom meets Finley and she agrees to be his dating coach. Tom was a cute nerd but he was clueless when it came to the ladies. Tom meant well but he couldn’t help but put his foot in his mouth and it could be cringe worthy at times. Poor thing just couldn’t help it at times. Finley was a cool character and I liked that she was a comedy writer. This was a cute and funny book and if you are a fan of 80’s movies, you will love the quotes and references. I also listened to this book as I read and the narrators did an amazing job! Joe Arden knocked it out of the park in this book!"}, {"Review": "\nI'll never be able to see/hear 'lollygag' again without giggling.\nI listened to the audible version of \nUnzipped\n narrated by Joe Arden & Andi Arndt. I'm a big fan of Lauren Blakeley's books, but this is the first time I've listened to one. I enjoy listening to books with both male and female narrators. It makes it so much easier to get lost in the characters when you can hear their voice inflections, especially the whispers, growls, and gasps. It's like a guilty pleasure and I might actually blush when I hear the sex scenes, looking around to make sure that nobody else can hear what I'm listening to. And then, when I giggle snort or laugh out loud it's even more embarrassing. But does that mean I'm gonna stop doing it? Hell no!\n\"In comedy, timing isn’t just everything, it’s the only thing. It’s the same in love.\"\nListening to what was going on inside his head as he's attempting to execute a grand gesture to win back the college girlfriend that dumped him years ago is hilarious. Everything that could go wrong, does. It's horrible in the best way. It certainly gets the attention of the wrong girl. At least the woman behind the window that he's focusing his horrible demonstration on has a sense of humor, right? Otherwise, she might have called the cops on him for disturbing the peace.I couldn't help shaking my head at the cluelessness of the poor nerd. While his lack of a clue was amusing, it was also heartbreaking. He had a lot to learn if he ever planned to catch and keep a good woman. Simply opening his mouth could be the end of his search for love if he didn't get some help. What better person to coach him than the object of his misdirected display?\n\"I’ll help you on your quest. And you, in turn, can continue to be one of the most interesting curiosities I’ve stumbled across.\"\nOf course, my romantic heart was matchmaking almost immediately. So, I packed my virtual bags and stowed away on their road trip adventure, shamelessly eavesdropping and taking notes. So, take my advice and grab your audiobook copy of \nUnzipped\n to listen their road trip while you take a road trip of your own. Win/win, right?"}, {"Review": "Unzipped by Lauren Blakely\nNarrated by Joe Arden and Andi Arndt\nStandalone RomCom. Available in Audiobook First.4.25 Stars\nIf I had to pick one author’s audiobooks to be stranded on a desert island with, it would be Lauren Blakey’s. I love her audiobooks so much and I’ve yet to be disappointed. \n\nUnzipped\n\n is the latest of Lauren’s romantic comedies and it was released on audio first The Kindle and paperback will be live December 11.I listened to Unzipped on a road trip, and two weeks after reading it I still hadn’t caught up with reviews. So when I sat down to review it, I realized I had no memory of what it was about! Sometimes I am not all there when I listen and I thought maybe that was the case, so I listened again and it all came back to me within minutes, but I listened again anyway because it was just as good the second time around. (Note: if you want to go in blind, skip to the likes and dislikes)Kyler (aka Tom) is a rollercoaster designer who, after 8 years decides it’s time to get his old college girlfriend back. He goes for the 80s inspired movie gesture and plays their song on a boom box on her lawn. But it’s not her who comes to the window, it’s Finley, a struggling comedy show writer who just met her muse.\n“Look, even though I don’t think you should Lloyd Dobbler your way through life, I did like Say Anything. And I can’t help but root for you to win this woman back. I'll help you.\"\nSo Finley joins Kyler on a road trip to find his ex and get her back.\n\"I’ll help you on your quest. And you, in turn, can continue to be one of the most interesting curiosities I’ve stumbled across.\" \nI loved the way Finley was writing about what was happening for the show as it happened in the book, it was a clever approach to telling this story. She was so much fun! She was a comedy writer and was anything but shy. Kyler was a nerd who grew up with only men and had absolutely no clue what to do with women, so he gets some lessons along the way.  Everything Kyler knew about women, he learned from an 80s Romantic Comedy movie.\n\n\"Dear God, you might be perfect. You went from Moonstruck to Beverly Hills Cop on one date. Are you going to make me a mixtape next?\"\n\n\nI admit, I had a bit of a hard time with the fact that he was going after a girl he hadn't even stalked at all in eight years, but he had tried to be a better man for her. Then suddenly after 8 years, he found another. I mean--he was in love with a memory, so it wasn't a stretch that he would fall for someone else, but the situation was pretty awkward. Finley, however, can't miss how hot Tom is, and the friendship morphing into more was a totally fun read.\n\"Those abs are traceable with my tongue. The grooves, dear God, the grooves.\"\nI love how Lauren Blakely's heroines are all smart career women and the men truly respect them as equals. Her characters are smart, totally sexy, and always form a friendship, not just lust/instalove.Likes:\n •Another smart and sexy romance from Lauren Blakely. \n   •A completely unique premise. \n   •Fun 80s references. \n   •A hot nerd? Yes, please. \n   •Fantastic dialogue. \n   •I love how they ticked off all the RomCom tropes. \n   •I absolutely giggled out loud, maybe even more than other LB books. \n  Dislikes:\n •This one didn't really stand out to me for some reason. I forgot about it so soon after reading. \n   •You really need to know your 80s movies to truly appreciate everything. \n  The Narration:\nI say it every time, Lauren writes these books for audio. I love the duet parts when they text, and you can never go wrong with Joe Arden and Andi Arndt.The Down & Dirty:\nI listened to Unzipped twice, and totally enjoyed it both times but it didn't stick with me as a favorite of Lauren Blakely's. It still had everything I love about a Lauren Blakely book, smart and sexy professional hero and heroine, a friendship that goes with the romance, laugh-out-loud moments, great dialogue, hot sex, and awesome side characters. I think because I am not a movie buff I missed some of the references and it may have held me back a bit. Still, I enjoyed it enough to listen twice, because honestly, you can never go wrong with a Lauren Blakely audiobook.Rating: 4.25 Stars, 4 Heat, 5 Narration\nPurchase Unzipped by Lauren Blakely\n\nAvailable on Audible first, and in the Audible Romance Package\n\n\n\n\nLive Kindle Release 12/11"}, {"Review": "I was pretty much sold from the whole \"Say Anything\" opening/meet cute. I'll admit that I did have a bit of an issue with Kyler's sort of out of touch obliviousness (did he really think he could win the girl after no contact at all over all those years), but as we get to know him, we see that the obliviousness is so much deeper and really just a part of his personality. I loved Finley and her quirkiness - she was so funny and vulnerable and I love how we got to see her insecurities AND how she conquered them. The road trip aspect was so fun and the chemistry between Kyler and Finley was phenomenal. As usual, Joe Arden and Andi Arndt brought the story to life in all its aural glory. Unzipped is definitely a book that I will listen to/reread over and over again! 4 out of 5 wine glasses. "}, {"Review": "🔥🔥 I’m so disappointed in this book. I’m a huge Lauren Blakely fan but this just didn’t do it for me. Most of her book are always laugh out loud funny. Maybe it was the constant over-the-top movie references. I’m not a huge movie buff and most of the references meant nothing to me. I never got the feeling the couple needed or really wanted to be together. It just seemed like they wanted to live out every cheesy movie love scene. The heroine starts off by basically using “Tom” to get ideas for her show not to help him. She then tells him that everything he’s doing and has done in the past is wrong. The only reason I finished the book was the narration. "}, {"Review": "ARC received for an honest review Lauren Blakely, you had me at Lloyd Dobler.Then Kyler had me with all his 80s movie references.From the moment he \"Doblers\" Finley, I was hooked. And so was Finley, and I can't blame the girl.Unzipped is a cute, sweet and adorable strangers-to-friends-to-lovers story, and I was swept up in their lives.I freaking love Finley, her sass and snark towards Kyler made me laugh and smile the whole time I was reading.Kyler is geeky and awkward and kinda clueless when it comes to the lady,however that just makes him all the more adorable.There are lots of brothers and family and other characters that we meet in this story, so I do hope we get more of them in the future (I know some do, but to quote Freddie Mercury, I Want It All)This Kyler is mine, so run out and get your own.\n\n\n \n \n \n \n"}, {"Review": "* A review copy was provided by the author in exchange for an honest review *  ~ 4 It’s All About the 80’s Stars ~ OMG!! This was such a fun, sweet and sexy read by Lauren Blackly. I also loved that this story focused on the 80’s Era… All the tie ins were amazing!! This book brought back some great memories for me while I was reading it.UnZipped is a strangers to friends to lovers story. I know that sounds confusing but it is a story that is about two people who have a chance meeting and over time turn into great friends.This is the latest romantic comedy standalone by Lauren Blakely. This book is a complete standalone and no other book needs to be read before enjoying this story. It is told in Dual POV. I thought the pace and flow was perfect. I loved how she had Tom and Finley become friends before anything romantic developed. Lauren is a wizard when it comes to romantic comedies. I alway know that I am going to laugh throughout the story and end with a HUGE smile on my face.In this story we follow Tom (AKA Kyler) and Finley. Tom is determined to win back the heart of his college sweetheart. So he plans a GRAND gesture….little does he know that it won’t be Cassie in the window….it’s Finley. Finley is so impressed with what Tom is trying to do, that she offers to help him in his mission. Over the course of the story they become fast friends and come to rely on each other. What happens when Tom sees Cassie again?? What happens when things become more real between Finley and Tom?? Can they get their HEA??I have to say I truly enjoyed this storyline and the characters in the story. I laughed throughout the story. Tom and Finley were a great match!! I loved how open and honest they were with each other. Their banter was spot on.If you are looking for a sexy, flirty and overall enjoyable romance story, pick this one up. You won’t be disappointed!! This is also a perfect story to read if you haven’t read anything by Lauren Blakely before.Follow Us at :: Book Bitches Blog | Facebook | Twitter"}], "Genre": "Romance", "ID": "40793242", "Desc": ""}