{"Name": "The Wicked King", "Image": "https://images.gr-assets.com/books/1520620414l/26032887.jpg", "Reviews": [{"Review": "Dear Holly Black,First of all, how dare you?Second of all, you are NOT supposed to go around stabbing people in the heart. That is illegal. This is illegal. Please stop writing illegal stuff.This book has made a great mess of my life. I keep thinking back to when I first read The Cruel Prince and how I was completely unaware of just how much this story would mean to me. My tiny human body isn’t even big enough to hold all the love that’s inside. I could fit a five bedroom house with a conservatory and a parking space in my heart, you can’t even fathom this much love! In fact, it’s now safe to assume that no matter what is happening at any given moment in time, the background noise going on in my heart is always love and appreciation for these books.\nSo what is this book about?\n\nHis mouth curls into a smile. His eyes shine with wicked intent. \n“Look at them all, your subjects. A shame not a one knows who their true ruler is.”\nThe veins of power are not, as the Faerieland of Elfham thinks, radiating out from the beating heart of their new High King. They are radiating out from his mortal seneschal: every thread of power and authority would start and end with Jude Duarte.Pulled under in a too-familiar poison current of enemies and allies (more of the former than the latter), Jude can’t afford to betray the slightest amount of weakness or fear. She must once again fight the battle of manners and politics and crowns that had traded blood-splattered hands quite often. She must learn to navigate the machinations of the court, the calculated plays for power and the truth of where thrones are won and lost—in the favors traded for power, in the gossip and the letters passed in dark corners, in the secret payments and the shadow alliances.But with each day bringing her closer to the end of the deal she struck with Cardan—where he vowed to act in accordance to her will for one year and a day and not one minute more—a miasma of anxious fear hovers over everything as Jude begins to feel these new threads to the throne snap one by one, threatening to undo all her plans like a knot. And seeing as she and the High King are often at odds with each other, enemies as frequently as they are allies, Jude is left, as always, with her only thread of power: herself.\nPower is much easier to acquire than it is to hold on to.\nI don’t think there’s any combination of words that could accurately convey just how good this book is. With a stage magician's flair for misdirection, Holly Black weaves a captivating spell with languorously descriptive writing—the atmosphere was so vividly imagined I felt like moss would just start appearing around me, and branches would just grow from any surface I looked at—breathtaking set pieces, engaging characters, and a gratifying emotional hook that will keep the pages whirring, ending this second installment with a spinning sense of history repeating itself and a cliffhanger that you might anticipate but only as a vague fear that might not come true if you didn’t think about it too hard. The end will seem less of a synonym for ending than it will be for beginning as the characters learn the hard way just how slippery and illusory power is.\nTHE CHARACTERS:\n🌟JUDE DUARTE:First of all, either you love Jude Duarte with all your heart or you get out of my car and walk home. Every time someone hates on Jude, my love for her only grows stronger. I can’t prove this with science but when I was born, Sappho’s spirit must have gently floated into my room and softly bopped my nose and that’s why I am so gay for Jude.I am so fascinated by her character. I love her capacity for holding contradictory feelings in balance, for complexly alloyed affections, for stubborn bravery that seems more of a result of chaining her fears and not unhooking their leashes just yet, for bottomless generosity of heart with undertones of naked lust for power and petty, capricious malice. Jude is full of so many wants, too many to prioritize, and so sometimes, they all feel desperate.  She is a wolf learning the patterns of much bigger wolves. She survived on the jagged edge of a cruel childhood. She let the fear act as a fuse to light her anger. She fought to claim the home that did not deign to claim her. She navigated an enemy court and made it her own. She secured her path to pure unfettered power when she should have been a captive. There's just such a flow and power to her that is so arresting to read about and I love it!🌟CARDAN GREENBRIAR:Can you believe that Cardan exists and the only reason I too exist is to love him? If Cardan were real and alive in the 16th century, he would probably have been the muse of at least twenty different artists who would all fight for the right to paint and sculpt him because he’s just that iconic.To put it simply: this book is just about a bunch of people having the worst day of their lives...and then there's Cardan, who is having the best day because of his tenacious commitment to be a layabout on a throne for which he sees none of the real work and all of the benefit. He spends most of his time lounging carelessly on his throne, his crown standing at an insouciant angle on his messy hair, a cold smile on his face and a glass of wine in his hand, essentially looking like a dreamy renaissance painting every day. And so, the important question remains: Siri, how do I infiltrate a fictional character’s heart and make him fall in love with me?Look, I have a huge weakness for morally questionable characters who only seem like huge dicks because they have the social skills of an agoraphobic lobster, and not much pierces my heart right into my vulnerability like seeing these same characters emotionally flayed, with their skins off, exposing their fragmented, contradictory self to the reader.Cardan has spent most of his life being a soldier in a war where the enemy was everyone else. He’d had one secret and he’d kept it in a portion of his heart that no one had access to: that he was not truly loved and that it made him cruel. And when the delusion that he could earn his family’s love by serving them wore out, and his passion dulled by the long, heavy wear of time and disappointment, the last of the armor he imagined his cruelty has given him had been stripped away and what remained was the undiluted, unedited and uncensored version of him. I can still hear the unmistakable sound of my heart breaking because I love this idiot so much and despite the things he’s done, I just want him to be so happy that it outweighs all the sadness he’s ever felt. [self-insert au fic where I adopt Cardan and raise him with the love and care he’s always deserved]🌟CARDAN AND JUDE (JURDAN?):\nOur eyes meet, and something dangerous sparks.He hates you, I remind myself.“Kiss me again,” he says, drunk and foolish. “Kiss me until I am sick of it.”\nI said this before and I'll say it again: Holly Black has done more for love with Jude & Cardan than Nicholas Sparks ever did. I have a dozen hearts swirling around my head for them and that isn't a filter, it's permanent.I think the crux of this book was the emotional honesty between Jude and Cardan, as they begin to realize that if they want the reward of being truly trusted, they must give in to the mortifying ordeal of being known. There are so many giant set pieces in this story, but nothing really propelled them along more than the authentic moments that happened between them. They know they’re closer than they’ve ever been and that becomes very integral to not just their relationship but to what happens at large for everyone in the story. They’re aware of how much is riding on their ability to maintain this partnership and stay on the same level and not let anyone suspect that there’s daylight between them because a lot of people would not hesitate to take advantage of that. Even when it was tempting for both of them to imagine how they could hurt the other, but only because it reminded them of how fiercely they could fall for each other. \n  I really can't overstate how invested I am in this series. Jude and Cardan make me want to draw tiny hearts everywhere because I'm so full of love for them. This book was everything I wanted and more and with that cliffhanger, I don't even want to think about what I'm going to do with my life until the release of the next book.BLOG | TWITTER | INSTAGRAM | TUMBLR\n"}, {"Review": "1.) The Cruel Prince ★★★★★1.5) The Lost Sisters ★★★★★\n\n“Once upon a time, there was a human girl stolen away by faeries, and because of that, she swore to destroy them.”\n\nMany of you might not know this but on this day many years ago, Holly Black’s biggest fan was born. Spoiler: it’s me! And I figured what better way to celebrate my birthday than to finally post my review for my favorite book of the year! I read this back in May, and it doesn’t come out until January, but celebrating my love for this book and series on my birthday just felt right. Also, I’m just that extra, but The Wicked King is perfection in every way.I love so many different kinds of books; fantasy, romance, young adult, new adult, adult, books with lyrical writing, books that are character driven, books with angsty relationships, books with soul crushing emotions, books that make me feel everything. And I’ve read a lot of books; over 800 according to Goodreads. But every time I pick up a Holly Black book, I feel like she wrote the book for me. And I mean that, because she writes exactly the kind of books that I want to read. Not just key elements or parts, she completely encompasses everything I love in literature. And if I could wish one thing for everyone who reads my reviews, I’d wish for you to find an author that makes you feel this way, too. The Wicked King is the second installment in The Folk of the Air series, the first being my favorite book of 2017, The Cruel Prince! And this book starts off five months after the heart wrenching events in book one. This review is going to be spoiler free, but I will be talking about some key elements that happened in the previous book! So, please do not read this review if you do not wish to be somewhat spoiled for The Cruel Prince!\n\n“I want to tell you so many lies.”\n\n(The most breathtaking fanart by Loweana!)Okay, so basically a brief summary is that Jude is alone with the new High King of Faerie. Madoc and her parted on bad terms, Oak is in hiding with Vivi, Taryn is to be married to Locke, Balekin is locked up, and Cardan is *clutches pearls forever* the new king. Yet, he must listen to everything Jude says because of a trick she played on him, but all of us know how quickly a year can pass and things can change. Especially since the Queen of the Undersea, Orlagh, is thinking about breaking the treaty with the fae folk on land, since she isn’t too sure about the new ruler. And she plans to use her daughter, Nicasia, any way that she can to help secure her place of power in the fae realm. And all the courts are coming together to see if Cardan really can lead and protect them. \n\n“Power is much easier to acquire than it is to hold on to.”\n\nAnd everyone is plotting in this book, I swear. The phrase “twists and turns” doesn’t even begin to describe the events that happen in this book. The political intrigue is so strong in this book. You won’t know who or what to believe, and you surely won’t know who to trust. And all these storylines come together to create something so beautiful. This book was a wild ride from page one to the very last page. Actually, especially the very last page. And I know everyone has already made a very big deal about the end of this book, and they aren’t wrong. You all thought The Cruel Prince cliffhanger was bad? Oh, sweet summer children. And, obviously, I won’t spoil anything, but there are so many different ways to interpret what happened. I’m going to be vague, but when you love someone or something, you will protect it at all costs. Also, the juxtaposition from book one to book two? Probably the best thing I’ve ever read in my entire life. Okay, I’m going to do a little break down for some of the characters in this book. You know, just so I can gush, fangirl, and truly be the hot mess that this book proves that I am. Also, Roiben plays a huge role in this story, which was such a wonderful surprise and I really wanted to mention it! (My favorite fanart(s) by PhantomRin!)➽ \n Jude Duarte\n - My heart, my true love, my icon, my queen. Jude is my favorite protagonist and I would honestly die for her. Like, all I want in this life is for Jude to he happy, healthy, loved, and know that she is deserving of that love. \n\n“I’ve wanted this and feared it, and now that it’s happening, I don’t know how I will ever want anything else.”\n\n➽ \n Cardan Greenbriar\n - And Cardan is probably my favorite character in literature. There, I said it. Are you happy now? Also, this book has a minor scene that really led me to believe that Cardan is pan or bi and the scream I screamed upon reading. (I’m so sorry, neighbors, if you’re reading this!) I thought I was too old or just completely over the concept of “book boyfriends” until Cardan Greenbriar decided to be created. ➽ \n Nicasia\n - I’m not even going to waste my finger strength. Bitch, bye. ➽ \n Locke\n - Okay, say what you want, but Locke is like the greatest antagonist of all time. I am not sure I’ve ever loved to hate a character as much as I absolutely love to hate him. I also completely believe that he’s going to be the “big bad” of this series, eventually. The half-brother development is going to come into play. \n\n“I wish he hadn’t used me to test my sister’s love for him. I wish she hadn’t let him.”\n\n➽ \n Taryn Duarte\n - Friends, I have a lot of feels. But I’m just going to say that I want few things in life as much as I want the novella, The Lost Sisters, that comes out October 2nd, 2018. I think it’s going to completely shatter everything we know about Taryn, and I’m ready for it. Oh, and in case I haven’t gushed enough, the romance in this series is my favorite romance of all-time. And like, I don’t say that lightly. I thought in The Cruel Prince that it might have been because I just love fae stories so much. But while reading The Wicked King I realized that it’s just because this is the best enemies to lovers in the history of the trope. I mean, sex is great and all, but have you ever shipped Jude and Cardan more than any relationship you’ve ever personally been in? Because, same. I honestly don’t even know how I’m functioning, let alone sitting at my desk typing this review, after reading the Queen of Mirth scene. Seriously, Holly Black is a fae queen, none of us are deserving, and her words are magical. \n\n“You are my dearest punishment.”\n\nBut this is also a book all about power, and the ugly things people are willing to do for it. Yet, it’s also about love, and all the beautiful, selfless, hopeful, hopeless, heartwarming, heartbreaking things we are willing to do for it. I honestly feel like the heart of this story is about sacrifice; the things we do for our family, our loved ones, and for ourselves. There is a lot of good on these pages. And I know this is a whimsical, magical book all about fae, but a lot of themes and messages carry over really beautifully. \n\n“It’s easy to put your own life on the line, isn’t it? To make peace with danger. But a strategist must sometimes risk others, even those we love.”\n\nI’m not sure I’ve ever been as happy reading a book as I’ve been reading The Wicked King. Also, I seriously pretty much reread this while writing this review. Like, I opened my book back up to grab some quotes that I tabbed, and I seriously had to stop myself from consuming the whole entire story all over again. Without a doubt in my mind, I will read this again before release. It’s just that much of a masterpiece, in every single sense of the word. \n\n“He looks at me as though we share secrets, although we don’t. We don’t share anything.”\n\nOverall, this review doesn’t do this book or my feelings justice. I have no word combination for how much this book, this series, and this author means to me. Yet, if you peak inside my heart, you might see my loved ones, coffee, video games, tattoos, Frank Ocean, and The Wicked King by Holly Black. Not only is this my favorite book of 2018, it’s one of my favorite things in life. And Cardan and Jude honestly have the best sexual tension in existence. I could read about them forever, with no pay off even, and I’d just ask for more. Blog | Instagram | Twitter | Tumblr | Youtube | Twitch Content and trigger warnings for murder, death, bullying, abandonment, captivity, abuse, talk of past child abuse, and for violence in general.The quotes above were taken from an ARC and are subject to change upon publication.(Thank you so much, Diana. You will never know how much this means to me, but I promise I'll cherish this ARC forever. Thank you, from the bottom of my heart and soul, thank you! 💖)"}, {"Review": "Update Jan 8, 2019: It's here!\nPower is so much easier to acquire than it is to hold on to.\nSo I'm officially ADDICTED.I can't say for sure what makes a good fantasy book for other people but, for me, these books are like crack. I'm like Fever series-level addicted right now and I don't know how I can possibly wait for book three. Also: Cardan is evil and terrible and I am in love with him. I wish I was sorry.This book got me so good. The banter and sexual tension between Jude and Cardan had me on the edge of my seat, all googly-eyed like a schoolgirl with a crush. The political machinations, lying and backstabbing are all so damn thrilling. I saw literally nothing coming, though I don't know if that was the author's genius or just because I was too immersed in the story to play detective.I'll keep this vague for those who haven't read The Cruel Prince yet. This book picks up where the last left off - Jude has negotiated herself into a position of power and she fully intends to exploit it. The dynamic between her and Cardan has to be the sexiest I have read in a very long time. I like that they are both powerful people, both a little morally-questionable, because it makes all the love/hate angst so much fun. I dislike when one character in a relationship holds all the power and uses it against the other, but these two are equals (for better and for worse).\n\"For a moment,\" he says, \"I wondered if it wasn't you shooting bolts at me.\"I make a face at him. \"And what made you decide it wasn't?\"He grins up at me. \"They missed.\"\nThough, I also love all the characters. I love Madoc and the strange relationship between him, Taryn, and Jude - he is their father figure, and yet he also murdered their parents. I love Vivi because she just knows \"Revenge is sweet but ice cream is sweeter.\" I love the Bomb, and all the villains.You know, this is exactly how I enjoy romance - tucked away behind action, kidnappings and betrayal. There's actually a really compelling plot here, full of twists and surprises and the threat of war, and it only serves to make the sexy banter more thrilling when we are finally treated to it. Holly Black is such a tease.And she's also evil. It's not right to call the ending a cliffhanger, and yet it is so deliciously evil. I am dying to know what happens next.Blog | Facebook | Twitter | Instagram | Youtube"}, {"Review": "\n\n\"I want to tell you so many lies.\"\n\nA billion spiteful stars.Everything hurts, and no, I'm not okay. Holly is a delightfully cruel author and I love and hate her for it. It's very confusing. I'm not sure I can write this review as a 'sane' person but I'll try. Disclosure: spoilers for the first book, but not for this one! \n\n\"Your ridiculous family might be surprised to find that not everything is solved by murder,\" Locke calls after me.\"We would be surprised to find that,\" I call back.\n\nSo, we still have Jude, who is as pleasant as ever as she schemes restlessly to keep the power she stole at the end of the first book. Not only does she have to keep Cardan, who is... well, the same Cardan we all came to love, in check, but she now has to deal with the entire court who would love nothing more than to do away with her.But let's start with our favorite resident princeling.\n\n\"You've won yourself a year and a day,\" he told me. \"But a lot can happen in a year and a day. Give me all the commands you want, but you'll never think of everything.\"\n\nCardan, while utterly himself, continued to surprise me. He's one of those unpredictable wildcard characters, and though nothing he does is really 'surprising', he still leaves you baffled and scratching your head at every turn. But the best part? His relationship with Jude is tense, angsty, full of 'what even just happened' moments, and ahhh, I can't say much more but it was so DAMN fun.Maybe grab a fan.\n\n \"I wondered if it wasn't you shooting bolts at me.\"I make a face at him. \"And what made you decide it wasn't?\"He grins up at me. \"They missed.\"\n\nYou never quite know what he has up his sleeve or his true intentions, and trust me, he'll leave you guessing until the very end - not to mention, he might be a tad more powerful than we all expected.\n\n\"Surely you have noticed that since his reign began, the isles are different. Storms come in faster. Colors are a bit more vivid, smells are sharper.\"\n\nThen we have Madoc, Jude's 'stepfather' whom she totally betrayed and made a fool of at the end of the first book. As you can guess, he's not thrilled. So not only is Madoc and the rest of Jude's 'family' on edge and trying to get their clutches on her, we have the rest of the faerie court, all of whom are suuuuper suspicious as to why Cardan has Jude by his side all the time. Oh, and then there's Locke, who is still... awful. And he... of course... causes problems. As he does.Basically, everyone wants to take Jude down.AND.As if that isn't enough, we have our lovely albeit rotten Queen of the Sea and her oh-so-sweet daughter, Nicasia, both of whom hate Jude with a fiery passion.I'm not going to lie - this book is 90% court intrigue, scheming, and angst, which if you know me, that's all I could ever want. If you aren't into that, you might not love it as much as I did. It isn't as if a TON happens, but for me, it never ceased to entertain. Holly is brilliant, not only with her words and one-liners but with her planning and characterization.Jude continues to be a unique, rage-filled yet somehow relatable character who stands out in the YA market. She's fiery, witty, mean, and yet she still finds a way to burrow into your heart. That's good writing, folks. She's easily one of my favorite characters ever, and I can't help but love her no matter what decisions she makes.Full of twists and turns, I couldn't put it down. So many scenes are like a punch in the face, while others made me feel like I was DROWNING, scrambling for air. If you thought the first book was cruel, you-know-nothing-John-Snow.Because that ending.The pain.This is your warning.Prepare yourself.My Blog ~ Instagram ~ Twitter ~ Etsy"}, {"Review": "someone: why do you like this bookme, deep in an elaborate fantasy sequence in which Jude forces me onto a throne for her own selfish gain and is an ambitious bitch to me and treats me like shit but we have a lot of sexual tension (view spoiler)[and eventually we have angry sex to the sound of her gasping “I hate you” (hide spoiler)]: uhhhhh well I just really like the plot twistsOkay but for real. I already talked a lot about why I loved The Cruel Prince, so I guess I’ll just give a quick summary: antiheroes, court intrigue, power plays, and a fish out of water in a world full of monsters - but this time, she’s determined to seize the same power. And it’s badass.Jude… is so great. She's seriously becoming one of my favorite fictional characters of all time, and I don't really know how? Her narrative voice is so strong, shaping and characterizing the world around her. The strength of her voice perfectly counteracts the desperation we see within her to cling to power, to not give up the few gains she has made. She's so delightfully unlikable and yet manages to gain audience sympathy at every moment. The side characters here are particularly great. I particularly like the relationship between the Bomb & the Roach; the backstory we got for them here was excellent. Vivi is as fantastic as ever, but I actually love what was done with her character [I’ll talk about this later]. The Wicked King is also pushed up by a series of interesting villains; while I am emphatically not a Locke or Nicasia fan, Taryn is intriguing and I want more of her, and Madoc is always a delight. Oh, and then there’s Cardan, the Sort Of Love Interest, who I find both incredibly compelling and very dislikable.I think what I’m most fascinated about with this book is how it plays with the dynamic of humans wresting whatever power they can. The idea of fairies not understanding the stakes of their own world on the level that human characters do. Vivi, as someone who grew up a fairy, does not understand how Jude was affected by her childhood - she was never charmed, or manipulated, or forced to play the games that Jude was. And the dynamic between Cardan and Jude is perfect; Jude clinging to the little power she has over Cardan, and Cardan being under someone’s thumb, just one more time.I’m not sure how I felt about parts of the dynamic between Cardan and Jude; there’s a continuous lack of dictated consent in their interactions, which makes sense for the situation and is still bothersome. But also, I’m kind of obsessed with their relationship. They have so much sexual tension and it kills me. I cannot wait to see where it goes. And also, guys, there were so many fucking plot twists I’m laughing. i have no idea how I even felt about the final twist but literally everything else was so fucking legit and I screamed about eight times reading this book. Basically, that was everything I liked about The Cruel Prince, but like... more. Jude is seriously one of my favorite fictional characters ever and the plot twists killed me and I'm super into the romance. And in unrelated news I’m going into a coma now [@Holly you know what you did] and I'll see you all... next year. If I'm not dead yet. Blog | Goodreads | Twitter | Youtube"}, {"Review": "Looks like you’ve got some real competition, Sarah J. Maas. If you want to stay in the lead, I would up my game if I were you.Holly Black sure has.The stakes are higher. The game deadlier. The enemies hungrier. Jude fiercer. She was once deeply betrayed, but instead of destroying her, her past has sculpted her into a new, improved girl.A lethal one. If you thought you knew everything, saw everything and heard everything about the Faerie world, you are about to have the time of your life. Because it doesn’t matter how immune you are to faeries, Holly Black will find a way to break through that barrier and intoxicate you.I feel manipulated. And what do you say to someone who toyed with you, making you feel as though you knew what was going on and could spot future schemes, when in fact, no matter what, you were always two steps behind?What do you say to someone who takes pleasure in your shocked gasps, flushed cheeks, dizzy limbs and heart pain?Damn you, Holly Black. I freaking love you.Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"Review": "\n‘i want to tell you so many lies.’\nhello, police? hi, yes, i would like to report a crime, specifically a murder… what murder? oh, well, you see, holly black has singlehandedly torn out my heart, ripped it to shreds, and then lit it on fire. this book has ruined all other books for me this year. until the release of ‘the queen of nothing’ (that title alone is killing me all over again), i will be crying myself into a deep, dark, and healing hibernation. someone wake me up in 2020. maybe then i will be able to write a more substantial review. but until then, im useless. ↠ 5 stars"}, {"Review": "Power is so much easier to acquire than it is to hold on to.I'm not sure if I should be happy or angry? This book was, undoubtedly, my most anticipated book of the year. But I must confess, it did not quite live up to my expectations. That's not to say it is not a good book, it was just a tad slow for my taste. The book doesn't really pick up until about the 60% mark. After that though, things definitely get interesting. Main Characters' Ranking:Jude = Cardan > Madoc = Vivi >> Locke >>>>>>>>>> Taryn Previously I disliked Taryn for being weak and complicit, but now I just loathe her for being a lousy, backstabbing, sorry excuse for a sister. The Relationships:Madoc & JudeEven though I know they'll never truly reconcile, some small part of me wishes they would because honestly a Madoc and Jude team up would be epic. They would have all of Faerie bending to their will. No question. It is clear that despite her previous betrayal Madoc does still care about Jude and wants her to join his side. \"Does our High King have any idea how good you are at running this kingdom for him?\"\"Keep hoping he doesn't\"\"Oh, I shall, daughter, much as I hope you will realize how much better it would be if you were to be running it for your own family.\"But alas he is still who he is and any sort of personal feelings he may have fall second to his boundless ambition. Jude & TarynIf this series somehow ends with Jude easily forgiving Taryn for betraying her AGAIN. I will riot!\n Honestly, this is the reason I did not even bother to read The Lost Sisters. Because any amount of Taryn is too much Taryn for me. I do not care what anyone says about how she has her own way of coping or surviving in Faerie. Because the bottom line is both Jude and Taryn have suffered in this world their whole lives, but only ONE of them has betrayed the other. TARYN. Sure Jude may not have told Taryn her every plan and secret, but never once has Jude intentionally done something to harm Taryn. NOT ONCE. And just when she starts to let her sister back in, Taryn just slaps her in the face with another betrayal. \nHonestly, I am so done with this relationship. May it wither and die. Jude & CardanTo put it simply this relationship is a mess. A beautiful mess, but a mess nonetheless. Because once again we're forced to watch truly deeply damaged individuals fight their obviously growing feelings for one another because they lack the fundamental key to a healthy relationship, trust. On Jude's part: ...that I like him better than I've ever liked anyone and that of all the things he's ever done to me, making me like him so much is by far the most>...and all I want to do is walk into his arms. I want to drown my worries in his embrace. I want him to say something totally unlike himself, about things being okay. Kill him before he makes you love him \nOn Cardan's part: \"Kiss me again, he says, drunk and foolish. \"Kiss me until I am sick of it.\"\"If you're the sickness, I suppose you can't also be the cure.\"\"I wasn't kind Jude. Not to many people. Not to you. I wasn't sure if I wanted you or if I wanted you gone from my sigh so that I would stop feeling as I did, which made me even more unkind. But when you were gone-truly gone beneath the waves-I hated myself as I never have before.\"\nThese two have the makings of something beautifully tragic. And I suppose the ending of this book makes some people angry. Angry at Cardan. But personally, I found it fitting. A betrayal to answer a betrayal. An eye for an eye. It is the world they live in. The only way to win is to play, and it seems Cardan is finally done taking a backseat. So while I am disappointed our girl got played, I am not mad at Cardan for finally taking his life into his own hands. And that's the tea. \nSidenote: one running theme I found quite amusing is how often people pointed out Jude's affinity for murder.For example: Locke-Jude \"Your ridiculous family might be surprised to find that not everything is solved by murder.\"\"We would be surprised to find that.\"Cardan-Jude-The Roach-The Bomb\"The three of you have one solution to every problem. Murder. No key fits everyone lock.\"\"Someone tries to betray the High King, murder. Someone gives you a harsh look, murder. Someone disrespects you, murder. Someone ruins your laundry, murder.\"All-in-all this was a mighty fine read and a great book to kick off my year. ===NOTE: My Headcanon came true!!!Headcanon: Cardan and Jude will continue to have an unwanted, yet undeniable pull and attraction to one another. And one of those times will involve some fun with Cardan's tail. \n"}, {"Review": "WHY DON'T YOU JUST PICK UP MY LIMP CARCASS AND TOSS IT 50FT INTO THE SEA TOO. omfg. This was excellent in the most ragey beautiful perfectly poisonous and mind twisty way. I am reeling and also want to s c r e a m myself into the next dimension becauseIneedbook3ajfdsaldhgoh these feelings should be illegal. i am not used to feeling all these things. ➸ Again I put forth the fact that these are the MOST Slytherin books.They are about mind games and plot twists. They are about characters outwitting and undermining each other, and not just Jude. We have Madoc playing his own games and Cardan starts to stop being a veritable flop and grows into his sullen mouth and power as the high king, and that's not even counting on the OTHER COURTS who have agendas and wishes. The queen of the undersea, Orlagh, features in this one and she is putting forth her own murder games. And I just !!! you think you know something and then tHERE IS A DECOY PLOT FOR THE DECOY PLOT. I can't even.My heart is just thRIVING on this. I swear. My slytherin soul sings.➸ Cardan and Jude? Slayed me. I am dead. fUlly fully dead.I mean from the moment Cardan sleight-of-hand steals Jude's ring and then wears it, we know he is flirting with her. They hate that they like each other bUT THEY DO. And look: I'm not a romance-inclined person: but omfg these two. They kisses. The murder-flirting (shh that's a term). The tWISTS at the end with what these two do together...I just...I cannot. It gave us more more more of what we wanted and also managed to make it vicious and untrustworthy and intoxicating. THIS IS HATE-TO-LOVE (?? i mean, not quite love but something) AT ITS FINEST.➸ Also the stakes just crawl higher.Jude learns the very important lesson that claiming power is much easier than keeping it. And omg this girl. I want her to have a nap. The book is set 5months after TCP, and Jude basically never sleeps. She needs a soft pretzel and a hug from someone she can trust (WHO, THO. REALLY WHO) and I love her to pieces. But we have murder, betrayal, vicious mind-games, lust and love and entrancing kisses, and friendships you want to trust but oh oh can you trust anything?!➸ And we already know Holly Black is a WRITING QUEEN.Her descriptions just have me falling head-over-heels in love with Faerie. Yes, hopeless mortal here *waves languidly* don't even care. I just LOVE the descriptions, the fey culture, how she weaves in other courts and their games and japes and terrors....am I going to stop gushing soon??? I DON'T KNOW, AM I?!? I freaking adored this book. I knew I would but like holy wow it sets the bar so high for 2019.But what I like best is that (a) it's surprising and maddening, (b) it takes you on an adventure that is like dancing on silver knife blades, (c) it gives you a sliver of what you want and then snatches it away, and (d) THAT CLIFFHANGER. THAT ENDING. JUDE. CARDAN. I LOVE THEM AND MY WHOLE SELF HURTS.PERFECT SERIES IS PERFECT."}, {"Review": "Happy Pub Day!!!Ok so here's the deal-I wasn't crazy about The Cruel Prince. There, I said it. The reason I'm starting this review with a seemingly negative attitude is two-fold: 1) It shows the sheer amount of growth that Black provides between the first two books in this series and 2) It shows that I'm not just blowing smoke up your ass and being pushed to give this a high rating to boost sales. The Wicked King was a true delight and privilege to read, my fellow bookworms, and I hope I can do it a shred of justice while discussing it here. This review is 100% spoiler free!Our story begins five months after the events of The Cruel Prince take place, and we are immediately thrown into the narrative with dollops of those previous five months sprinkled in along the way. While I suppose it isn't ABSOLUTELY necessary, I would highly encourage you to pick up the novella The Lost Sisters as it gives an insightful look into Taryn's side of things during TCP (and also packs an extra emotional punch for a particular twist included at the end of this novel). There are a lot of moving parts to this middle installment, and some may seem fairly unrelated in the beginning, but by the end they all come together nicely for a whopper of an ending.The aspect that stands out most to me regarding The Wicked King is the tremendous amount of character growth accomplished in just a short amount of time (and page count). Where TCP featured fairly typical/stereotypical characters for YA fantasy and only really connected me to the story near the ending when the twists started coming, TWK really fleshed out the deepest, darkest desires and fears of our cast and put them on display for their fellow peers. I don't want to say too much, but by the end of this novel I felt such a connection to many of the characters that I didn't really care about the previous go around.AND THAT ENDING?! It's been quite some time since I've been so taken aback multiple times in the final 25% of a novel. It was waves of twists, turns, and heart breaking revelations. The ending is enough to make you dig out a tub of ice cream and wallow in your emotional breakdown for days. I have some thoughts on how I feel the next book could go, but after the ending here, Ms. Black has shown the reader that she owns these folks and she'll do with them as she pleases. Muahahahaha I think I'll stop here and just let you experience it for yourself, but if you haven't pre-ordered this one yet, what are you waiting for? Despite having read this one already, I have still managed to pre-order the regular hardcover and the BN special edition.... because obviously, my shelves need this blessing in their life. <3"}, {"Review": "#1 The Cruel Prince ★★★★★#2 The Wicked King ★★★★★ #3 The Queen of Nothing ???After the shocking turn of events that finished off The Cruel Prince, Jude is fighting with everything she’s got to keep the kingdom of Elfhame from falling to pieces under its new rulers. Unfortunately for Jude, not only is a war brewing in the Undersea, but the court is full of traitors—and a few of them might be in her own home.I loved The Cruel Prince, but I wasn’t one hundred percent sold on certain factors—yet, from the moment I finished reading it, I’ve been saying the same thing: “Everything I struggled with in book 1, I know will be better in book 2.” Was I right? Let me put it this way: you know the “second book slump” people always refer to in trilogies? NOT AN ISSUE HERE. Everything that The Cruel Prince does well, The Wicked King does \nPERFECTLY.\n\n→ L I K E S :\n\n I’ve wanted this and feared it, and now that it’s happening, I don’t know how I will ever want anything else.\nFirst, without spoiling anything, let’s get this out of the way: the weird, hateful, hot-and-cold relationship between Jude and Cardan progresses flawlessly, and by that I mean I cheered, I raged, I cried, I swooned, I blushed, I raged some more… it’s beautiful. I’ve never seen enemies-to-lovers done quite like this, because at all times, they’re kind of… both? Let me tell you, the phrase “I hate you” has never been this sexy.\nMy body has acclimated, and now it craves what it should revile.\nAnd Jude, my gods, JUDE. She is a masterpiece. I love her so much. She’s coldhearted, cruel, murderous, backstabbing, and a total antihero in all the best ways. She’s earned herself a permanent place on my favorite “terrifying leading ladies I love” list. She’s also so clever and strong; despite being betrayed at every possible turn, she manages to constantly work things to her favor—or, at the very least, to take someone else down with her as brilliantly as possible.\n“The last room Cardan occupied caught fire. Let me rephrase. It caught fire because he lit it on fire.”\nAlso, Holly Black’s writing is just legitimately so funny, I can’t even describe. It’s incredibly rare that a book makes me laugh out loud, but I cracked up over so many weird and ridiculous moments—usually pertaining to Cardan’s absolute lack of any common decency and/or sense.\n Angry was better than being scared. Better than remembering she was a mortal among monsters.\nFinally, of course, there’s the world. I adore Holly’s commitment to writing a version of Faerieland that follows legitimate fae lore, and just like in the first book, that authenticity comes through effortlessly. All the world-building and political complexity she offered in the first book paid off so well in this sequel.\n→ D I S L I K E S :\n\nThat I like him better than I’ve ever liked anyone and that of all the things he’s ever done to me, making me like him so much is by far the worst.\nLiterally the \nonly\n thing I didn’t like about The Wicked King is the fact that I have over a year to wait before finding out what the hell is going on with this terrible, infuriating, priceless cliffhanger ending. I mean, take the way Jude feels about Cardan, and that’s basically me towards Holly Black right now, except replace the “burning carnal desire” with “desperate need to find out how it all ends, right NOW”.\n→ F I N A L THOUGHTS :\nIn all seriousness, The Wicked King was literal perfection in my eyes and I would not change a single thing. I flew through it, I loved every page, I highlighted so many quotes I can’t even fit a quarter of them in this review, and I don’t know if I have ever felt so simultaneously torn and obsessed with any pairing as I am over Jude and Cardan.Oh, and one more thing: TARYN STILL AIN’T SHIT.\n→ RECOMMENDING TO… :\nEveryone. Just… literally everyone.All quotes come from an advance copy and may not match the final release. Thank you so much to a very sweet (and unnamed) friend for loaning me their ARC!"}, {"Review": "Can I just write an entire review repeating everything hurts, over and over again. Because EVERYTHING REALLY HURTS. It's been over a month since I've read this and it still just really, really fucking hurts, okay? Holly Black has done it again. She's ruined my life, made me question my sanity, and need a cold shower after reading this book. Even though I was incredibly excited for this book I still had my doubts that The Wicked King would top The Cruel Prince. I shouldn't have been worried though because this was everything. This book basically solidified the fact that I would indeed lay down my life for Jude and Cardan.The Wicked King has a lot more scheming and court politics in it compared to the first book, and while normally I'm more of an action packed type of gal, this really worked for me. I found myself falling more and more in love with my queen Jude and trying to figure Cardan out. Because I mean, as far as unpredictable characters go he is the most unpredictable, especially in the end 😭. The scheming, the twists and turns, the TENSION, was all unbelievably good. You will need a cold shower before, during, and after this book because the tension is so thick between Jude and Cardan it hurts. Also, here is a friendly reminder that Cardan had a tail, because I forgot and was shook to my core when his pants came off. You be the judge of why his pants came off, my lips are sealed...Anyway, less tail talk more book talk. We still have our amazing group of characters that we've grown to love and hate. Jude, is desperately trying to hold on to her power she tricked her way into. Cardan, is still defying Jude every step of the way. Taryn, is still The Worst Sister Alive. Locke, is awful. Madoc, is less than thrilled with the stunt Jude pulled in the end of the first book. Nicasia, is just as petty and spiteful as ever and ready for what her and her mother, the Queen of the Sea believe should be hers. So yeah, no pressure for Jude to hold on to her power over Cardan.Now, while I won't give away any of the plot twists or the ending, just know you are in for a world of pain. If you thought the ending of The Cruel Prince was torturous, oh sweet child, you haven't seen anything yet. What would this story be without twists and turns that physically make you feel like someone is squeezing you so tight you can't breathe? The ending of The Cruel Prince is laughable compared to the ending of The Wicked King. I would tell you all to prepare yourselves, but let's face it, no amount of preparation will have you ready. 2019 is going to be a year filled with PAIN AND MISERY until The Queen of Nothing is released in 2020. \nFavorite Quotes\n\n\"Your ridiculous family might be surprised to find that not everything is solved by murder,\" Locke calls after me.\"We would be surprised to find that,\" I call back.\n\n\"Watching my back is the perfect opportunity to stick a knife in it.\"\n\n\"For a moment,\" he says, \"I wondered if it wasn't you shooting bolts at me.\"\nI make a face at him. \"And what made you decide it wasn't?\"\nHe grins up at me. \"They missed.\"\n\n\"If you're the sickness, I suppose you can't also be the cure.\"\n\n\"We show her that I am no feckless High King.\"\n\"And how do we do that?\" I ask.\n\"With great difficulty,\" he says.\n\"Since I fear she is right.\"\nAll in all, this book was perfect. It was the right amount of love, lust, hate, and pain. Now excuse me while I lay in bed and cry until 2020 because I have absolutely no idea how I'm going to live with myself until The Queen of Nothing is out!Blog | Twitter | Instagram"}, {"Review": "Once upon a time, there lived a girl named Roshani who was like \"lol, lemme jus sit down with my coffee and read a Holly Black book.\" That was the end of that. The book consumed her. The coffee has long since evaporated and moss and ivy crawled over its porcelain shell and one could not tell it had ever been a drinking apparatus. The girl had become one with the earth. Small thorns and blood-colored flowered bloomed around her head, and she choked out a single word: \". . . C A R D A N.\"And that is why, my children, YOU DON'T READ A HOLLY BLACK BOOK KNOWING YOU'VE GOT BASICALLY TWO YEARS TO WAIT FOR THE FINALE. WTF. WHY DID I DO THIS TO MYSELF. I AM DISTRAUGHT."}, {"Review": "Thank you Edelweiss and Little Brown books Publishing for sending a review copy in exchange for an honest review. \"For a moment,\" he says, \"I wondered if it wasn't you shooting bolts at me.\"I make a face at him. \"And what made you decide it wasn't?\"He grins up at me. \"They missed.\"\n1- The Cruel Prince ★★★★★2- The Wicked King ★★★★★3- The Queen of NothingA beautiful and mesmerizing sequel to The Folk of the Air trilogy. Holly Black managed to captivate me with this book in ways that I can’t even describe. I was constantly guessing for plot twists, and what I got by the end of the book was so far from my expectations. I spent the fifteen minutes after finishing the book sobbing.This book was perfect in every sense of the word. So entirely different from any other YA book series I’ve ever read. Such diverse characters with plots, schemes and motives of their own. Relationships and characters that you honestly don’t know how to feel about or deal with. And just like the first book, I was planning on taking my time with this read. Alas, my excitement got the best of me. \"His mouth curls into a smile. His eyes shine with wicked intent. “Look at them all, your subjects. A shame not a one knows who their true ruler is.”\nThe cliffhanger in this book was shocking. I remember thinking the ending of The Cruel Prince was bad. Goodness, was I wrong. I keep trying to figure out what exactly happened and I have so many guesses. This makes life exceptionally difficult since waiting two years for Queen of Nothing is a must.I often found myself lost in the world that Holly Black weaved together. I’d lose myself in the story completely and then suddenly remember where I am. The most imaginative and complex characters and storyline.♛ Jude Duarte: Probably my most favorite female protagonist ever. There, I said it. She’s just that amazing. Jude plays a lot of roles in this book. She’s constantly trying to balance her acts. Always pretending to be something when she’s in fact something else. She tries to control her new found power without giving herself away and without others noticing, even if it means humiliation.♛ Cardan Greenbriar:A majority of this book was him lounging on his throne like the king that he is. Cardan has in fact been through so much, with secrets of his own that he’s trying to maintain. He has this guise that isn’t visible to anyone. Throughout this book you learn so much about the childhood that he lived. About the pain that he’s been through, and the way he tries to keep it all under a mask. Let’s just say I might start a protection group for this guy. \"I want to tell you so many lies.\"\n♛ Nicasia:I have about had it with this one. I didn’t like her in the first book and I sure as hell hate her now. At some point I might have felt sorry for her (just a tiny bit) but as the story and events progressed I took It all back.♛ Taryn Duarte:I disliked Taryn a lot in the first book. And at this point I have a lot of mixed thoughts. Let’s hope we get The Lost Sisters soon.Holly has a way with her books where she feeds you information little by little, and then shocks you completely in the last few pages. Which is exactly what happened here. I can’t explain how anxious I am for the last book. I feel like my heart is still suffering from the damage this book put me through. Holly Black has become my most favorite author of all time. You’re all in for one hell of a roller coaster.The quotes were taken from the ARC and are subject to change upon publication.|| Blog || Instagram ||"}, {"Review": " Update 1/15/19\"DENY ME!\"Oh, I got the chills again. The drama of it all is so yummy! Still have no idea how I want it to end, besides my ship to continue to rock, obviously.Original review4.5 starsNot sure how much I should write about this sequel. After all, the strength of this series is in a large part in its plot twists and turns. So I'll keep the story details to a minimum I guess.It's 5 months after the ending of the The Cruel Prince. Jude is mostly preoccupied with keeping Cardan on the throne and under her control for a time much longer than a year and a day. Both goals are hard to achieve - there are various factions scheming to take the crown from Cardan, and he himself isn't too thrilled to be a puppet (well, unless this puppet makes out with his puppeteer, then he seems to like it just fine;0). Indeed, it is much harder to hold on to power than to usurp it. The structure of The Wicked King mirrors that of its prequel. It's kind of slow (on drama) in the beginning, with Jude trying to balance all the players in her game. I was entertained, but also a bit tired out by Jude's frenetic, restless search for solutions to multiple problems (that girl gets no break!). I wanted some rest and a bit more... meat in the story maybe, some more world-building, flash-backs or deep back stories, anything to divert me from Jude's constant state of anxiety. I never got that break. What I did get was more drama and heartache closer to the end. That ending was a real punch in the gut, and I loved it (I do like to suffer and be mad though). Kudos to Holly Black for holding my attention way into the 3rd book of this series. I am not sure what I want the ending to be exactly at this point. I am going to settle for JUDE+CARDAN=FRVR for now? P.S. Publishers need to stop releasing ARCs so early. OMG! So much longer to wait for The Queen of Nothing. (yes, first world problems, I know).P.P.S. Some people in this series are incorrigibly crap! Just saying."}, {"Review": " This review and other non-spoilery reviews can be found @The Book Prescription“Power is much easier to acquire than it is to hold on to.” 🌟 After the ending of The Cruel Prince, I was convinced to continue the story as the author clearly had much in store. I guess I wasn’t wrong because this was better in all aspects!🌟 Let’s start with the prose, which is magical and perfect for the story. I was just so intrigued and trying to learn how can she come up with all these descriptions and quotes!🌟 The World building is also great, we learn more about the Seelie and Unseelie court. This had more political intrigue and it wasn’t boring & I always like that.🌟 The pacing in the first book was my biggest problem, I found myself enjoying this way more and the pacing was definitely better! I am not saying it was perfect because there was a part where I wanted things to pick up the pace but that was a small part like (10-15% of the book) but otherwise, I was happy with it.🌟 If you ship Jude and Cardan then you will LOVE this book and I am taking full responsibility for saying this. If you don’t get what is all the hype about (I belong to this group) then you may like them a little better but I also assure you that you will be happy by the end of this book!🌟 I said that Jude was annoying and childish in book 1, and I kind of forgot this from last year when I read TCP till this year. At some point of the story, I asked myself: “Hey, wait! Didn’t I use to hate Jude and think she is annoying, she’s actually well written here!”.🌟 Everyone who got ARCs and read this book were all talking about the ending, and I expected a lot after the ending of book 1. When I got to the ending, I was hit by a plot twist which was like a breeze and I was underwhelmed until I was hit by the final storm and I can freak out now and say WTF was that ending!!!!!🌟 Summary: This book was definitely better than TCP, if you liked the first book, you will love this one. If you didn’t like book 1, then you may like this one. It still had minor problems but I can’t wait now to know what happens in the final book!"}, {"Review": "so i think this is what addiction feels like.to be totally honest, i’m starting to get a little bored of the overdone tropes and predictable storylines prevalent in a lot of YA fantasy. and then there’s Holly Black, Queen of the Faeries. there is something about her mind-bending plots and backstabbing characters that is so energizing and life-giving amidst a sea of unremarkable books.if by some chance you weren’t immediately hooked by The Cruel Prince, i think you will find this one to be much more engaging. it’s everything i loved about the first book but somehow just more of it. more intense, more magical, more cheeky. each page is packed with intrigue, mischief, and all the little details that bring this magical forest setting to life. i devoured it.having read two books in this trilogy now, i’ve realized that a few things still irk me about jude, our main character, but i still liked her more in this book than in The Cruel Prince. it was so easy to become fully immersed into the story through her narrative because Black has done a remarkable job fleshing her out and giving her a distinctive voice that drives the entire story. i am full of admiration of her strength and resilience, even if she is a bit too controlling/overly ambitious for my liking. she might not be warm but she is a total badass.and then there’s cardan. oh, cardan, my chaotic, angry boy. i loved how much depth his character is given in this book! he has come into surprising new powers that gave me goosebumps and i’m most interested to see where Black is taking his part of the story. let’s just say that i am here for this ship, even if i end up going down into the waves.as with The Cruel Prince, this book truly kept me guessing until the bitter (and oh, was it bitter) end. i can just picture Holly Black writing with a mischievous grin, knowing how much of a fool she will make of us, because let me warn you now: whatever you think is happening, is very very likely not what is actually happening. the twists and turns are many, and that ENDING. there is nothing that prepared me for how many pieces of my shattered heart i’d be picking up off the floor. you have been warned.guys, the hype is real and i am hopelessly addicted to these books. it’s going to be long wait until 2020 for The Queen of Nothing.~ 5/5 stabby faeriesARC provided by the publisher in exchange for an honest review."}, {"Review": "Revenge is sweet, but ice cream is sweeter.Me after reading The Wicked King:I originally planned to delay this review, but I think that I should pour my heart out before I forget all of the emotions that I felt while reading The Wicked King. It should go without saying that this highly anticipated sequel is WORTH THE HYPE. The characters, Cardan and Taryn in particular, will drive you crazy. Just thinking about them makes my stomach churn with frustration.After giving 5 stars to two of her books, I'm starting to think that Holly Black is a master of literary entertainment. Even though I didn't finish The Cruel Prince and The Wicked King in one sitting, I was hooked whenever I picked them up. Reading about the political machinations of both Jude and Cardan was like watching an addictive historical drama. It was funny how their cunning wasn't enough to help them predict each other's moves. Although I guess Cardan won in the end. Wahahaha. The hate-to-love romance was also on point, neither too sweet nor too bland. It was quite confusing sometimes because their hatred seemed more powerful than their love. Basically, they hated that they had the audacity to love each other. Like, what???? See what I mean? xD A particular event made me believe in Jude and Cardan's happy ending as a couple, but I was wrong. COMPLETELY WRONG. What's worse is that I didn't know whom to blame. If Jude was manipulative, Cardan was so vengeful.At this point, I'm confident that I'm also gonna love the next book in The Folk of the Air. So far, the only \"negative\" thing I can say about the series is that Taryn sucks. Somebody, please erase her from the face of the earth."}, {"Review": " “Once upon a time, there was a human girl stolen away by faeries, and because of that, she swore to destroy them.”  Story ⭐️⭐️⭐️⭐️⭐️Jude finally has everything she ever wanted. A place in faery. Power. And Cardan as high king. But the court and the faeries are cruel. Their intentions are never clear, even though they can’t lie. Brutality, murder, betrayal and intrigues are a normal thing at the court. And Jude is mortal, fragile, human. But she learns how to play the game, even though so much is at stake. She needs to protect the people she loves, even though she can never be sure if she can trust anyone. What a masterpiece. Oh my god. The ending. I’m devastated. I don’t know what to think. There was so much happening, so many intrigues. It was fantastic, even though I like the first book a little bit better. Character ⭐️⭐️⭐️⭐️⭐️Jude will forever be my favorite badass girl. She’ll do anything for the things she wants. Power. Protecting the people she loves. Protecting their home. She gets crueler, smarter with every move she makes. She’s not an easy character to love, but as soon as you realize how amazing she is - you’ll love her. Next to her is our always favorite prince - Cardan. Cruel to the bone, nearly always drunk and picking on Jude. You could think that he’s a mindless, dumb and cruel king who lets other to the work for him - and you’re so right but also so wrong. Why? You need to read the book to know that! Madoc had a bigger role in this book - betrayed by his own daughter he is filled with rage but he realizes that he always underestimated her. And that was wrong. But should they be in an alliance or enemies on two different sides of the table? All the other characters - Locke, Taryn, Ghost etc etc etc are side characters but still have a significant role in the book that drives the plot forward. I was fascinated by all the characters and I think probably no one could have written them better. Relationships ⭐️⭐️⭐️⭐️⭐️Oh, this wonderful hate-love-relationships. You know they hate each other to the bone, but still are drawn to each other like a moth to a lamp. And cardan and Jude are the perfect example for that. The relationships between all the other characters - Jude and Taryn, whom I never trusted. Locke and Taryn - terribly unhealthy. Madoc and Jude - father-daughter or enemies? Or allies? All in all I thought all the schemes were perfectly arranged and absolutely fascinating. Writing style ⭐️⭐️⭐️⭐️⭐️Holly did it again - she absolutely killed us. She killed our feelings, our hopes and dreams and still left us enough to thrive for more. More drama, more betrayal, more irresistible faerie Kings. All in all I think that was a really really good book and I can’t wait for book three!  “It’s easy to put your own life on the line, isn’t it? To make peace with danger. But a strategist must sometimes risk others, even those we love.” "}], "Genre": "Romance", "ID": "26032887", "Desc": ""}