{"Name": "My Favorite Half-Night Stand", "Image": "https://images.gr-assets.com/books/1533058458l/38357345.jpg", "Reviews": [{"Review": "\nSometimes, the thing we want is right in front of us and we’re the last ones to see it.\nThe writing duo notorious for their unique and fun approach is back with yet another zany twist on the dating scene. This time, through the voices of emotional mutant Millie and her best guy friend Reid, Christina Lauren explores the woes of dating in its most modern form—apps. Having zero experience myself with the pitfalls involved with online dating, My Favorite Night Stand gave this wifey—of almost thirteen years—a tiny peek at what color the grass really is on the other side of a long-term, committed relationship. With an overarching rom-com feel to the pages, an enviable friend group—one this reader hopes will extend from standalone to full-blown series (pretty please, C&L?!)—and the friends to lovers scenario, it’s a wonder this lasted on my nightstand longer than a half-night. Believe me, it was only because there was actual adulting I had to get done that this wasn’t a true binge session. The best descriptor for this collection of words—adjective, thirteen letters, 5 syllables: un·put·down·a·ble. Millie, lucky enough to win her ex’s friends in their breakup, rounds out the quintet perfectly. Like her four platonic guy friends and university colleagues—Reid, Ed, Chris and Alex—Millie is a workaholic, driven by her passion. It would probably be more accurate to call her interest in female serial killers an obsession and something best kept to herself on a first date. Although, her curiosities have landed her a criminology professorship and a book deal, so there’s that. The infamous keynote speaker booked for the upcoming Dean’s banquet prompts the friends, who usually go stag, to find dates. The best course of action they figure, creating profiles on a dating app. Initially, sort of shallow and a tad silly, Millie takes each of their write-ups and transforms them into something deep and honest. Surprising, considering her own profile is much less forthcoming. An emotional mutant in all aspects of life, Millie doesn’t do feelings or really share much of herself at all, even with her closest friends. Interestingly enough, and in defiance of most stereotypes, Reid is the complete opposite—ready and willing to share his truth. The reality check from the guys regarding her self-constructed walls, provokes Millie to create a second profile—different name and an artsy profile pic, accompanied by a much more honest write-up. And wouldn’t you know, the app matches her secondary profile with the perfect specimen of a man, otherwise known as her bestie, Reid. At this point, they’ve shared a few incredibly mind-blowing and unexpected trysts between the sheets—ahem, earning favorite half-night stand status—but still pursued dating other people. All in good fun, Millie throws out some subtle hints via direct message with her new match, figuring Reid will be tipped off. Nope—cue the catfishing scenario, which is equal parts you want Millie to fess up and Reid better figure things out already. You would think that three letter typo would have spelled over for the scenario, but in hindsight, what fun would that be?For those readers having experienced Christina Lauren’s storytelling, this is everything you’ve come to expect—a vibrant dynamic, loveable characters (main and secondary, per usual) and plenty of comedic relief. The writing duo adds yet another couple with undeniable chemistry to the plethora they’ve already gifted to the contemporary romance genre. For new readers, good luck picking a favorite. *wink**THANK YOU to Gallery for providing a review copy in exchange for my honest thoughts."}, {"Review": "IT'S LIVE!\n➳EXCLUSIVE Excerpt now up on my blog (click here) and also a PAPERBACK GIVEAWAY up on my page | Make sure to enter now and read the EXCLUSIVE EXCERPT!\n\n➳Friends wanting much more, letting temptation and attraction get to them in the best of ways making you want more of Reid and Millie's undeniable friendship and charisma...\n➳When Christina Lauren writes a new novel, there is no denying it that I will be hoping to get to read it as soon as possible. Sexy, witty, charismatic, and fun, that is what CLo has to bring in every single one of their novels. This one is no exception of course because everything about Millie and the boy gang is one thrilling ride that I want to be a part of. All individuals whom have been best friends for a long time, and are now professors at the same college dealing with college professor issues that are indeed a hoot to read about. After one drunken night, Reid and Millie learn that their physical attraction is one that cannot be diminished or taken away from since they are just meant to be with each other. Viewing each other as only friends, Reid and Millie slowly learn to realize that there is no way of diminishing their attraction towards each other.➳After going through different online dating profiles, Millie is stuck in a pickle when she encounters herself with a match towards Reid with a fake username that she created just for fun. As she goes along with it, she soon realizes that Reid truly does like her fake \"person\". Millie needs to find the honest truth as to how to continue with this fake friendship and her real friendship with Reid, in which she wishes it were more.➳This review is being kept short and sweet because this is a novel that is MEANT to be read and thoroughly enjoy to the fullest. Every twist and turn, every emotional aspect of it, every reaction towards an action is simply meant to be read because Christina Lauren will never stop disappointing their readers with their marvelous romance novels. I am indeed keeping my fingers crossed that we get more romances of the other characters that were mentioned in this novel, since I am missing how much into different series CLo has written in the past. Thank you to Gallery Books and Kristin for providing me a copy of this beauty. Everyone will enjoy and devour this witty romance!➳ARC kindly provided by Gallery Books, in exchange for an honest review...➳Follow Me On:Blog ♕ Instagram ♕ Facebook ♕ Twitter"}, {"Review": "*HAPPINESS*Emotionally compelling friends-to-lovers romance filled with snark, humor, and lots of love. Millie, a university professor whose specialization is female serial killers, is emotionally available. She is good at keeping people at bay by only sharing what’s on the surface. She is close friends with a group of guys: Reid, Ed, and Chris. Although these men are her closest friends, they don’t know much about her. Millie is closest to Reid and after a drunken night, they have sex. They decide they are better off friends and try their best to go back to “normal.” Except they both have feelings for one another and don’t know how to navigate a romance without putting their friendship at risk.Needing dates for a commencement ball, the four friends try a dating app. Reid is matched with his ideal girl, except that Reid doesn’t know the girl who has caught his attention is his best friend, Millie as Millie made an account using her middle name, Catherine. This, of course, leads to some drama and pain, but also lots of laughter and love.I really felt for MIllie’s character. Christina Lauren does a great job of building her walls and then gradually taking them down. Her intelligence shines through in her witty remarks and banter. Once she lets her emotions out and the reader gets to know the real Millie, it’s hard not to root for her. Millie and Reid have great chemistry and their characters complement one another.I liked the style of My Favorite Half-Night Stand. The narrative is told from Millie and Reid’s POV’s, along with some group text chats and dating app messages. Not only did I get a feel for the dynamics of Millie and Reid’s relationship, I also got to see how the group worked as friends. I really enjoyed their energy and loved the ways they played off of each other.The plot is a bit predictable, but the quirky loveable characters and the writing make up for it! I was surprised I got so invested in these two! This is an easy, light read that left me feeling happy! I received an ARC of this book from NetGalley and Gallery, Threshold, Pocket Books in exchange for an honest review."}, {"Review": " 4 Friends to Lovers never gets old stars for My Favorite Half-Night Stand! Christina Lauren create genuinely endearing characters and write with such witty snark, humor and laugh out loud moments that I can't get enough! In \nMy Favorite Half-Night Stand\n we meet Millie and her male BFF Reid as they explore the triumphs and pitfalls of friendship and online dating. Millie is intelligent, witty and presumably \"one of the guys\" amongst her close group of male friends. One of the things I enjoyed most about her was her career. As an avid fan of shows like Criminal Minds I loved that she was a criminology professor and into female serial killers. Although you might imagine that isn't the best ice breaker on a first date. Millie is guarded and emotionally stunted. Her childhood experiences taught her to bottle up her emotions, compartmentalize them and hide them away. None of this bodes well for her adult relationships. She desires to let her walls down and finally share her true self with someone but she simply doesn't know how. Reid is the opposite of Millie. He is fully in touch with his feelings and not afraid to show them. Amongst their groups of friends he is known as the sensitive one. You know the saying \"opposites attract\"? Well it's alive and well here. Millie and Reid have a special bond. She's as much \"herself\" as she allows herself to be with anyone with him. Reid is her rock. He is always there for her. So when one night of passionate, drunken sex threatens to change things, Millie freaks. She isn't ready to lose her best friend over sex. No matter how great it was. Or is she? With a big gala looming over the single group of friends. They decide to turn to online dating. Millie pens the group's profiles, writing hers superficially. It's no surprise hers leads her to receive various inappropriate pictures and lewd offers. She decides to put herself out there and pens a new one bearing her middle name, Catherine, in secret. Surprise - her new profile is a match with none other than Reid! Written exchanges take place between \"Catherine\" and Reid. Under the guise of this new persona Millie is able to share more of herself with Reid than she ever has in person. Unfortunately, as the two correspond via the online dating app, things continue to heat up between them in real life causing them to question everything. Are they meant to be more than friends? How will Reid feel when he finds out the truth about Millie/Catherine? Is Millie capable of sharing her emotions and truly letting Reid into her heart? This was a fun read that I absolutely devoured as I couldn't turn the pages fast enough. I was rooting for Millie and Reid the entire time. It was fun to see the twist of dynamics here with the guy being the sensitive one and the woman being closed off. There were so many hilarious texts and one-liners between the friends that made me laugh out loud. In short, this was a sweet, sexy & funny read. Pick it up, lose yourself in it.Thank you Christina Lauren, Gallery Books and NetGalley for the opportunity to review an arc of this book! I look forward to whatever you pen next - I'll definitely be reading."}, {"Review": "\nIt's crazy...less than a year ago, I had never heard of Christina Lauren or read any of their books. Last November I read Autoboyography and fell madly in love with it (see my review). Earlier this year I read Love and Other Words (see my review), just to see if my infatuation with them was a fluke. (Spoiler alert: it wasn't.)About two weeks ago I read their latest book, Josh and Hazel's Guide to Not Dating (see my review), and had visions of pacing myself until December, when their newest book was due to be released. But when I saw My Favorite Half-Night Stand available on NetGalley, you bet I pounced, and I was thrilled to be approved nearly instantaneously. And wouldn't you know it? Once again, the duo has struck gold, capturing my heart with another book...and I guess lengthening my wait for the next one. Damn.The only woman in her group of best friends, Millie Morris is truly one of the guys. She and all of her friends are super-smart professors; her specialty just happens to be serial killers—female serial killers, in fact. Millie can drink her guy friends under the table, throw multiple double entendres into a sentence without blinking, and is more than happy to play video games and stuff her face alongside her friends any night of the week.Of all of her guy friends, Millie is probably closest to neuroscientist Reid Campbell. They've always had that half-flirty, half-brother-and-sister thing down pat, and they both feel happiest in each other's company. So it's almost no surprise when a night of celebratory drinking ends up with the two of them in bed, enjoying a few hot rounds of sex before agreeing they're better off keeping their relationship platonic—and keeping their wild half-night stand a secret from the rest of the guys.When a university event becomes a black-tie gala, all five of them are determined to find dates. Millie and the guys agree to try an online dating site, but as is typical with their friendship, Millie winds up creating all of her friends' profiles, yet draws a blank when she goes to write her own. Opening up has never been easy for her, so while her friends start to find potential matches, she mostly hears from creeps sending dick pics or inquiring about her bra size.After getting ribbed by the guys for her failure, she decides to create a second profile, yet for this one she calls herself \"Catherine.\" The very act of creating a fictional persona is freeing for Millie, she can suddenly be more playful, more emotionally open, more honest than she can be in real life. When she and Reid \"match\" online, she tries to provide enough clues so he will realize it's her, but at the same time, she encourages their online conversations until they grow deeper.The more Millie (as Catherine) corresponds with Reid, the more interested he becomes, yet at the same time, Reid is trying to figure out what Millie wants from their real-life relationship. But for some reason, Millie can't open up and be vulnerable with Reid the way she can as Catherine. She wants Reid for real but she can't give him everything he wants, yet she knows there's only a matter of time before her dishonesty destroys their friendship for good.\"Does it matter if you do the wrong thing for the right reason?\"My Favorite Half-Night Stand is a fun, sexy, emotional, thought-provoking look at male-female friendships and how hard it can be to allow yourself to be totally vulnerable with someone you care about. I loved the way Lauren twisted the gender roles in this book, yet the characters' actions and emotions seemed totally true to who they are. I was totally invested in this story from start to finish, and I wished I could hang out with this group of friends, because they seemed like a lot of fun!As with most of the other books of theirs I've read so far, there's nothing particularly surprising or earth-shattering in this book, but I loved it all the same. I wanted to know what was going to happen to these characters. I wanted to root for them and sometimes I wanted to shake some sense into them. There are some big issues at play here, as well as some genuinely loving friendships and some hot sex to boot.The more I read of Lauren's books, the more I love them. They're just tremendously enjoyable reads that hit all of my emotions but don't manipulate them too badly. Pick one up and hopefully you'll become a fan, too! (Oh, and please don't make me wait too long for your next book!)NetGalley and Gallery, Threshold, Pocket Books provided me an advance copy of the book in exchange for an unbiased review. Thanks for making this available! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"Review": "5 Sweet, Sassy and Quirky Stars for this Uber Funny Rom Com by Christina Lauren!What happens when “meet” your best friend on a dating site and he doesn’t actually know it’s you and you fall for each other? Can your relationship ever become the “real thing?”Millie is in her late thirties and is an Associate Professor at UC Santa Barbara. Her four best guy friends, Reid, Ed, Alex and Chris also work at the University and they are all single. Their relationship is the bomb. They hang out several times a week, play board games, make dinner together and text back and forth constantly. Their messages are hysterical. Out of all of them, Millie is closest to Reid. They are two peas in a pod, besties. Fun, flirty and fabulous. After a drunken night of playing monopoly - the two hook up - it’s just that all of a sudden she can’t help but notice how hot he is, his arms, his shoulders and yeah, his washboard stomach. How could she not have noticed this before? Reid has always thought Millie was beautiful, the idea of getting with her has just never occurred to him, not until she gave him that look however.. Once it happens, they know it can’t happen again and somehow, just like that, everything goes back to normal. When an upcoming Gala is scheduled where Obama is going to be the guest speaker, all of them decide to go on an online dating website to find dates. Millie, being the sarcastic, funny and witty one, writes their profiles. Since her real profile isn’t as successful as the rest, she creates a fake one for herself and wouldn’t you know it, Reid takes the bait!Of course, complications ensue! How fun! “My Favorite Half Night Stand” is an endearing, comical, lovable romantic comedy. Millie is an adorable, brilliant, cheeky and sarcastic gal who steals your heart and Reid is honest and refreshing and is an all around good guy! I loved every single character, including the guys who were the ultimate best friends. This rom com was realistic and I loved that - it was not overly sappy or schmoopy and I never once had to cover my eyes (LOL)! This is a novel that I highly recommend! I have now read two Christina Lauren books (“Josh and Hazel’s Guide to Not Dating” being the first), and I can’t wait to read more - as they are light, fun and are all around great reads!Thank you to all of my GR friends who have provided such fabulous reviews for this and who recommend reads like this all of the time, one in particular: Melissa, you rock my friend!This was a buddy read with Kaceey! We had such a great time reading this! We laughed a lot and we basically tore through it on a Sunday afternoon - it was a fabulous end to a weekend! Thanks for an awesome read Kaceey, I’m so happy that you are starting to branch out! :)Thank you to NetGalley, Gallery, Threshold Pocket Books and Christina Lauren for an ARC of this novel in exchange for an honest review. Published on NetGalley, Goodreads, Twitter and Instagram on 11.14.18."}, {"Review": "ARC provided by the publisher via Gallery Books in exchange for an honest review.\n\n“I wonder whether I’m single not because I haven’t met the right person yet, but because I’m not the right person yet.”\n\nOkay, at this point I know I sound like a broken record, but Christina Lauren is such a hit or miss author for me. And I honestly feel like their releases alternate between me loving and me feeling “meh” about. Sadly, My Favorite Half-Night Stand ended up being a story that was very “meh” to me. It wasn’t believable, I was never really invested, and never in a million years would I want to date the main character. So, the basic premise of this book is that there is a close-knit group of friends who all work sort of together. But they constantly hang out outside of the workplace, and they really are their own little found family. Oh, and they are all supposed to be super smart and super unlucky with dating. Yeah, it gave me Big Bang Theory vibes which is never a good sign. But anyways, they all need dates to this big event (which doesn’t even happen in the book, by the way) so they all download a dating app. And this book does have a lot of multimedia, because we get to see these friends text and be in group chats with one another. But I will say, these people aren’t that much older than me, and really have a hard time understand basic internet lingo when they talk to each other. Real talk, my grandma memes better than these thirty-year-olds. But anyway, I should tell you all about the group of friends. \n\n“…no matter how objectively pretty she is, Millie Morris has always been off-limits. But mostly I think she’s been off-limits because she’s never shown any particular interest in any of us.”\n\nBasically, Millie helps all four dudes with their dating profiles. Including Reid, the guy who she considers her best friend, but who she slept with at the very beginning of this book. And basically, the guys don’t think that Millie’s profile is up to snuff, even though she literally wrote theirs for them. So, she makes another one, that’s more edgy and sexy or whatever, and she gets matched with Reid. And sends him something that she feels like will make it obvious that it is her, you know, instead of just telling him, and she basically catfishes him for the entirety of the book. And yikes, it was not enjoyable to read. Millie’s actions are read apologetically because she has had a hard home-life growing up, and has essentially run away from it. She doesn’t talk to the guys about her past, or what is going on back home, but she feels like she can be open and honest with Reid while pretending to be this other woman. Which in and of itself is gross, but then later in the book, she actually reads what he has written to her aloud to other people. It is so gross, and I honestly disliked Millie throughout this entire book. Therefore, it was really hard for me to root for this relationship, because Reid deserved a hell of a lot better. Overall, this just wasn’t for me. Which is actually funny, because Reid and I have similar jobs, which I was so damn hyped about when I first started this one. Sadly, that was the only thing I ended up being hyped about. And I’m so bitter that we didn’t get to see Obama in this, after this party announcement that was the reason the entire book premise started! Also, catfishing is never cool, but especially to your best friend and someone you’re having sex with. I will say that most of my friends who have also received ARCs of this one, have really loved it. So, maybe take this review with a grain of salt, but I just really didn’t like it. But I hope if you pick it up that you will enjoy it more than me! Happy reading! Blog | Instagram | Twitter | Tumblr | Youtube | Twitch The quotes above were taken from an ARC and are subject to change upon publication.Content and trigger warnings for catfishing, loss of a loved one in the past, talk of cancer, diagnosis of Parkinson’s disease, and some questionable comments about people’s physical appearance."}, {"Review": "Hilarious, short and sweet!I don’t know whatever I was thinking in taking so long to read a book by Christina Lauren. I will definitely be filling up my TBR with more books from this highly entertaining writing duo. I absolutely adored MY FAVORITE HALF-NIGHT STAND by CHRISTINA LAUREN and the snarky humour had me literally laughing-out-loud! Not too many romantic comedy books will actually bring out that type of reaction from me but this one definitely made me chuckle out loud. I pretty much had that loving contented feeling throughout this whole book putting a huge smile on my face. CHRISTINA LAUREN delivers a well-written, fun, light and enjoyable read here that totally sucked me right into the storyline with its premise of online dating. I was so emotionally invested and had so much fun with these characters and their love story which kept me highly entertained swiping those pages at lightning speed to reach the conclusion. This classic love story was such a welcoming and refreshing change that I didn’t even care if it was somewhat predictable or not. I just wanted to read and fall in love with every aspect of this storyline right along with the characters which I most definitely did. Publishing Date: December 4, 2018 Norma’s Stats:Cover: That bright, fun, intriguing, and welcoming cover definitely caught my eye and is an extremely fitting representation to storyline. Title: Intriguing and fits the storyline extremely well.Writing/Prose: Well-written, engaging, sharp, amusing and absorbing. Plot: Engrossing, interesting, compulsive, witty, comical, fast-paced, and entertaining.Ending: A swoon-worthy ending that left me feeling completely satisfied and extremely happy. Overall: Would highly recommend to anyone that is looking for a feel-good, humorous, quick and easy read that is pure enjoyment!Thank you so much to Simon & Schuster Canada for the opportunity to read an advance reading copy of this novel. It was a perfect and fun escape!Review can also be found on our Two Sisters Lost in a Coulee Reading book blog:https://twosisterslostinacoulee.com/"}, {"Review": "WHAT A SURPRISE.honestly I just found this book and the characters vaguely annoying. Millie especially was not my bag. Reid was super boring. the squad of friends was more \"let's-have-characters-laugh-and-say-'wow-you're-so-funny'\" than actual, you know, comedy or humor. Millie's oft-mentioned complete inability to get along with or befriend other women was not the only aspect of girl hate to be found here by a MILE. the deceit at the foundation of this relationship was so unnecessary and weird, and the ending was so overexplained. like, characters literally had to come out of the woodwork to be like \"here's why this is actually okay,\" because CLEARLY IT WASN'T. the development arc of Millie was extremely strange, and also she was the only character who changed AT ALL during this book, which felt simultaneously 15 pages and 500 pages long. plus this book had the cheesy unrealistic trope I hate where suddenly every character is happily paired off at the end, no actual explanation necessary.in conclusion: ugh.--------------please don't ask why I'm reading a third book by Christina Lauren when I didn't like the first two. I don't have an answer and you'll only upset me"}, {"Review": "If you’re looking for a light, funny and engaging read, then look no further!This book reads like a favorite chick-flick. (I hope there’s a movie in the making!). I spent half my time envisioning every scene, trying to cast the characters! (Renee Zellweger, Amy Adams or Anna Kendrick?) Ha! Maybe I missed my calling and should have been a casting director!Who says friends of the opposite sex can’t stay “just friends?”So what happens if maybe there’s moment of weakness? Just a slip one night...or should I say a half night? Can you go back to being just friends?The laugh-out-loud antics are plentiful as Millie, and her group of academic friends dip their toes into the dating world through an online dating app.What if everything you’ve been looking for is right there in front of you? Would you even recognize it? Would you take the chance and risk it all?This was such a fun and refreshing read. It may be billed as a romance but don’t let that turn you away. It‘s just an all-around feel good book guaranteed to leave you with a smile on your face and maybe a tear in your eye. So grab your popcorn and settle in! I heartily recommend.This was a super fun buddy read with Susanne that left both of us smiling ear to ear and looking for our next Rom-Com read!Thank you to NetGalley, Gallery,Threshold,Pocket Books and Christina Lauren for an ARC to read in exchange for an honest review."}, {"Review": "4 stars!! \nChristina Lauren are go to authors for me when I want to a fun and entertaining reading experience. They wrote my favorite book of the year (Josh & Hazel) so when this landed on my kindle, I jumped right in. Though this didn’t hit the same love buttons as J&H, I still really loved it and had loads of fun while reading! \u2028\u2028Millie Morris is a professor who is fascinated by female serial killers. She hasn’t been in a relationship in a while, but she has 4 best friends who are all men. When something for work comes up and they all need dates, online dating gets brought up. Oh the shenanigans that this brings!\n\n“There’s an entire language involved in these sorts of things.” “We have six degrees between the four of us.” Reid looks back down to his lunch. “I think we can keep up.” Chris leans in toward Ed. “What kind of language?” “Why do I already know this is going to be like teaching my mom to use the DVR?”“At some point, if we kept going the way we were going, we’d all be seventy and doing crosswords together in Chris’s backyard.” “I mean, that doesn’t sound completely terrible,” I say.\n\n \u2028I laughed out loud through so much of this! All of Millie’s friends have something about them that make them endearing. She’s close to them all, but there is Reid who is just a little more special. Millie and Reid have a connection and attraction, but the thought of ruining their friendship makes them pause. So they continue with the online dating. Things get complicated from there. I’ll let you figure out the little twists on your own, but I was glued to this one! Millie is a fun character, and I loved all the boys. Seriously, there wasn’t anyone I didn’t love in this book. My Favorite Half-Night Stand is charming, fun, sexy, witty and lovable. If you are a fan of rom-coms, pick this one up. And for the love of all things holy, if you haven’t read Josh and Hazel’s Guide to not Dating drop everything and read it now!"}, {"Review": "Have you ever stumbled upon an author who is so dependable that you can reach for their books when you're needing a certain \"something\" in your reading? Well, obviously Christina Lauren is a writing duo, but you get the drift... Recently, I'd hit a bit of a snag in my reading; they weren't bad books per se, but after giving a 3 star rating to 5 books in a row (plus one book I simply couldn't finish) I was beginning to worry that something was wrong with me. Turns out, I'd just hit a bump in the road, because a contemporary romance from CL still gives me a fit of giggles with a side of gushy romance that hits you right in the feels. Reading the synopsis for My Favorite Half-Night Stand, you can probably guess that this is a friends-to-lovers romance, and you'd also probably guess that its fairly predictable. You would be right on both counts, but please do not let the fact that you have already guessed the outcome hinder you from giving this a try. MFHNS is one of those books that you pick up due to its predictability, the kind that brings comfort and stability in a scary, unpredictable world. It's no surprise that I chose to pick this up during midterm election week; while congressmen and women were duking it out on tv, I was able to escape for a bit into this fun, bubbly tale and ease some of my anxiety back into a reasonably contained compartment. I cannot emphasize how perfect a time it was to read this!The format followed traditional CL narrative, meaning we had alternating POV chapters from our main characters, Millie and Reid. As someone who is completely unfamiliar with the world of online dating, it was fun to get a peek behind the terrifying and, mostly hilarious, curtain of meeting romantic interests via the internet. Each character even had their own avatar included in the portions featuring online chats, so it was fun to see if the images of each person matched what was included in the book. If you're looking for a fun, flirty, feel good novel (with a few touching father/daughter moments thrown in as well), you should definitely add My Favorite Half-Night Stand to your winter TBR. This would be the perfect book to read around the holidays; its cozy nature pairs well with a roaring fire, a cup of hot chocolate, and a pair of fluffy socks. *I received a copy for review via the publisher."}, {"Review": "5 perfect stars! Who knew I could love a romance novel this much! ⭐️ ⭐️ ⭐️ ⭐️ ⭐️ I’m not the typical romance reader, but I have to say, some of the trademarks of the genre are present in this book in spades and made for the most rewarding reading experience. Millie is a young professor at UC Santa Barbara, and her group of friends are all male professors. They have a wonderful social life together, but each is single and looking for a date to an upcoming event at the university, so they decide to try their hands at online dating. They create accounts with the same dating app and keep each other updated on their matches and the foibles of online dating. Things are going as planned; however, Millie and Reid, one of the guy friends, spend the night together, and not only plan to keep it a secret from the rest of the group, they also promise to keep their friendship strictly platonic from then on. There’s much more to the story, but just know Millie, under a pseudonym, and Reid end up matching on the app and practically fall for each other through their messages. Will the pair end up together, will they stay friends, or will their friendship fall apart?Christina Lauren is a dynamic writing duo. They write silly banter amongst the friends that made me laugh and smile, and their characters are charmers. I loved each of them for different reasons, and as one of my good friends said, I’d love to see a follow-up for this friend group. There’s more story to tell here! Millie is guarded, and it is understandable due to a tremendous loss in her life. Will she ever be able to let herself go and open up? Reid has a sensitive side that I found really alluring, and with that comes some hurt when he feels manipulated by the group. Will he be able to forgive? So many great dynamics, so much true friendship, so much love. If you are like me, and not the typical romance reader, don’t be thrown by the genre or the title. My Favorite Half-Night Stand is a stunning, witty story about friendship and letting yourself go to fall in love. Thanks to Gallery Books for the complimentary ARC. All opinions are my own. My reviews can also be found on my blog: www.jennifertarheelreader.com"}, {"Review": "*****4.5 STARS*****{ARC Generously Provided by Author}Postsex, I feel like a well-used glove, a warm blanket, a body pillow. Soft and warm and sated. But inside, somewhere deeper, I’m a knot of angst. I want Millie. I think I’m falling in love with her. And she just does not see me that way at all.I honestly can’t get enough of Christina Lauren’s writing. They are one of the greatest collaborative duos in the romance genre today. I fell in love with this super funny, sexy and heartbreakingly angsty ”friends-to-lovers” story. The supporting characters are terrific and endearing in their own super quirky ways. I’m not going to deny that it was Reid who stole my heart from the beginning. He comes in at a very close second behind Will Sumner from ”Beautiful Player”. Reid and Millie’s story felt a little reminiscent of Will and Hanna’s.”MY FAVORITE HALF-NIGHT STAND” is about two besties who have the greatest friendship but underneath the layers there exists a deeply rooted attraction. Neither seems to be self-aware enough to figure out what is developing right in front of their very eyes. The two decide to join an online dating service with three of their other friends, in hopes of landing a date for an upcoming gala event for work. But somehow during the attempt of finding love online, Reid and Millie end up having one passionate night of steamy sex together. The two chalk it up to a one time deal because they’re not willing to risk the friendship, but then there’s an added twist, when Millie creates a ”fake” account on the dating site and Reid ends up being a 98% match with her.They end up carrying on with an online connection via emails but Millie never reveals her true identity to Reid. Her online “self” is not necessarily a lie. It’s the only time she is REAL with Reid. She lets him in on all her fears and sorrows. Things she never lets anyone see in her everyday life. Life has been hard on her from early childhood and her only coping mechanism was to bury her feelings and to keep silent. Reid is torn because he is becoming aware that he’s falling for Millie, but she’s emotionally closed off, and he knows there’s no chance for their relationship to survive if she is unable to trust him and let him in all the way. Then there’s \"Catherine\", whom he’s never met in person yet he feels a true connection to, but somehow it feels like he’s being unfaithful to Millie.Millie struggles with her feelings for Reid. There were many times, I wanted to shake the two of them. For two highly intelligent people, they were beyond dense. That is what made this story so painfully angsty. You keep hoping that they’ll wake up and fight for what’s been right in front of them for so long and then it gets so incredibly painful when things blow up and you know that it’s coming because…how could it not??!!Here are my overall ratings:Hero: 5Heroine: 4Plot: 5Angst: 5Steam: 4Chemistry Between Hero & Heroine: 5MY FAVORITE HALF-NIGHT STAND releases on December 4th! This is a terrific ”friends-to-lovers” romance! One that should not be missed!!kindle: https://amzn.to/2xQg3Y7B&N: http://bit.ly/2QqS75WiBook: https://apple.co/2Qj5dBWTarget: http://bit.ly/2QkJlGsKobo: http://bit.ly/2QjOf6zGoogle Play: http://bit.ly/2QmNM3uThe Ripped Bodice: http://bit.ly/2Qj5HIg"}, {"Review": "My favorite thing about this book is the quirky, witty, likable and intelligent characters!Millie Morris is just one of the guys. She is a UC Santa Barbra professor who hangs with her group of male professor friends: Reid (her best friend), Ed, Alex and Chris. She is funny, intelligent yet emotionally guarded and doesn't like to reveal too much about herself. When their university decides to host a black-tie event, the group of friends decide that they need to find dates and begin by signing up to an online dating site. The guys in the group need help with their profiles which Millie happily writes for them. The profiles she writes for them are hits with the guys, she has captured their personalities and included their areas of interest. During all of this, Millie and Reid share a night (ahem * a half night) of passion but decide to stay friends and not become romantically involved. When Millie does her own limited and non-personal profile, the men in her group declare that it sucks and after receiving some dick pics, she decides to create another secret profile using her middle name where she will share and divulge information about herself. Things become interesting when the computer matches “Catherine” (Millie’s secret profile) and Reid! oops as in a big OOPS. Drama, angst, longing and secrets take center stage. The characters live in the modern digital age, so it was fun to read not only their chats, but the online dating messages as well. The group of friends is cohesive and have a lot of fun together. I enjoyed their chats and found them to be clever and showcased each character sense of humor and intellect. The book is also told through Millie and Reid's POV which helps the reader get to know each character even more, but we also root for them. When I wasn't rooting for them, I was wishing I could shake each of them! The writing duo of Christina Lauren have the gift of creating fun, witty and interesting characters that are instantly likable and ones we want to root for. There is angst, there is love, there is laughter and there are revelations.I found this book to be a fun fast read. It was no surprise how the book ended, but gosh, was it fun watching the characters get there. This book did not disappoint and succeeded in not only entertaining me but causing me to want to binge read the rest of these Authors books! Another HUGE plus for me was that the ending did not feel rushed. My biggest complaint with any books in the romance genre is the rushed endings. The ending in this book felt natural and not rushed in any way. The pacing was spot on!Thank you to Gallery, Threshold, Pocket Books and NetGalley who provided me with a copy of this book in exchange for an honest review. The thoughts and opinions in this review are my own."}, {"Review": "BOOM!Christina Lauren did it again!!!I’ve read three books from this writing duo this year, and all three got a huge five stars from me! Christina Lauren has a way of creating the most wonderful and lovable characters that you just cannot get enough of... layer that with humor and exceptional dialogue/banter and then top it off with romance, and how can anyone resist? Seriously, I see most of my thriller loving I don’t read romance friends giving this book 5 stars! I think Christina Lauren is going to turn everyone into a romance reader... they really have a gift for creating a story that almost everyone can relate to, a story that makes you feel good and puts a big smile on your face!This is a delightful friends to lovers romance, my favorite trope! Millie is the only girl in a close group of friends, all professors at UCSB.... they all work hard, play hard, and party hard, but none of them have been terribly successful in the relationship department.... with an impending event where they need to take a date the group decides to signed up for an online dating site.... millie is close to all the guys but she is closest of all to Reid... so what’s going to happen after they have one night of friends with benefits, one half night stand? To top that off after their indiscretion “Catherine” Millie’s alter ego on the dating site is a 98% match with Reid.... so can best friends become lovers?Or maybe the better question is can Milly open herself up enough to be loved?Love Milly I loved her sass and her sarcasm and her quiet strength... but in a rare turn of events I related to Reid more than Millie... he was emotional an open and really wanted someone to share themselves completely with him, I could see why Millie would drive him a bit crazy, because she would drive me crazy too! The rest of the gang Kris, Ed, and Alex were all fantastic characters and I am hoping that this is not the last time we see these characters, I would love a HEA in each of their futures! And my review would not be complete if I did not give a shout out to Reid’s fantastic parents! Wow there were just so many amazing characters in this book and so much going on, I just absolutely loved it! Please do yourself a favor and read this!Absolutely recommend to anyone with a heartbeat!💗*** many thanks to Gallery for my copy of this most amazing book ***"}, {"Review": "A very very high 4 stars! Have you ever read a book that makes you want to go and read every single last book from that author? This is my second Christina Lauren book, and I feel a binge coming on – these authors can do no wrong in my book!They have a way of writing characters that I want to be friends with – so quirky and cool and funny.  Just sign me up already!It’s another friends to lovers theme here, but with a twist – a group a friends has to find a date for an event and decide to try a dating app. And what ensues is part hilarity and part romance and we waste no time in getting into the nitty gritty of the story.There is sexiness and laughter, and you will run a gamut of emotions while reading this. So much goodness here!This was a @6bookbesties read and we had a great discussion. Tell me, do you think men and women can ever be just friends?Thank you to Gallery books for my advance copy. This book is available today!Be sure to check out reviews from my besties Mackenzie, Holly, Jennifer, Kendall and Berit. "}, {"Review": "This was a light-hearted rom-com. Millie and her four male colleagues (and friends) need to find dates for a work event, so they sign up to a dating website. When Millie creates a profile under a different name and and uses a mysterious photo, she gets matched with her best friend Reid.When Millie and Reid start communicating through the dating website they click immediately and have the best conversations but Reid has no idea he’s been chatting with Millie.Outside the website, they’re attracted to each other but factors are preventing these two from throwing themselves into a relationship.I liked the humorous dialogue in the book, there’s some back and forth banter that’s entertaining. My favorite sections were the group texts, excellent dynamic. This book would make a great, fun, movie adaptation.Overall, I enjoyed it and recommend it to readers of romantic and contemporary fiction.Received ARC from the publisher via Netgalley* I read this book with the Traveling Sisters. Our discussions made my experience more enriching and interesting*"}, {"Review": "Live https://amzn.to/2Ee8v7g❤5 STARS ❤Omg this story is everything, it was emotional and intense .I loved every minute of it and I just wish I had more!I felt so connected to these characters and especially to Millie and I felt like I was a part of the story.Millie,Reid,Ed,Chris and Alex have an amazing relationship. The story line was fun and interesting.I laughed so much with their chat about the dating app, and their profiles!Like I said the concept of the dating app was brilliant!Millie is an interesting heroine, some may be frustrate with her behavior but for some reason I relate with her and I find myself feeling the same as her. Reid is sweet,sexy and smart!All of them have different and original personalities.My Favorite Half-Night Stand is my new favorite book!It was captivating,quick,sweet,funny and steamy.Christina Lauren impressed me for one more time!  \n\n  "}, {"Review": "As expected, I had the best time reading this. I can always rely on Christina Lauren to provide me with stories that are filled with heartwarming, hilarious and witty moments. The friendship (between 4 guys and a girl - I need a book each on the other 3, seriously!) in this book made me not want to part with them. The dynamic between them all was so awesome to read and their love palpable. I felt connected to them since we got to know them so well. Our main woman has a hard time opening up. Our main man is in touch with his emotions and who he is.I liked that this was switched. I liked that we followed Millie on her journey to discover why she was so closed off and how that’s affected every aspect of her life. I enjoyed seeing her blossom. That part of her I related to hard. It was fun seeing online dating being explored in this book and all the awkwardness and the bizarre-ness that comes with it. The awesome platonic relationships. We need more of that!All in all, I never want Christina Lauren to ever stop writing. Their books bring me so much joy, I can’t get enough. I want more and more each time."}, {"Review": "If a book could just be refreshing for mind and soul, this would be it. My Favorite Half-Night Stand by writing duo Christina Lauren is funny, light-hearted, filled with loveable characters, and charming. Though I (unlike our protagonist Millie) am more of a girl’s girl than a tomboy, I ended up really embracing her ragtag group of guy friends by the end. And Millie herself I felt a bit of kindred spirit with! Add that to a truly fun love story filled with witty repartee and a few sophomoric boy jokes, and you have a recipe for a book that will just make you feel happy!See my full review on PhDiva.blog!Well let’s get it out of the way—I was destined to love this book by nature of them all being Ph.D. “nerds” working at a university. My PhDiva heart was thrilled with this setting! Whenever Millie would talk about making her book deadlines—that was too real for me. And then having her favorite spots on campus? Been there, Millie!Millie is a truly wonderful character. She is closed off—a bit of damage from her mother dying young and her father encouraging her to keep it positive when telling her sick mother about her day. After awhile, Millie learns to just keep the negative things pushed down. Now as an adult, Millie hasn’t really unlearned this tendency, and it is creating problems. She doesn’t connect as well with others as she’d like. To be Millie’s friends, you have to accept that there will always be a wall up. Millie’s growth as a character in this book was one of my favorite things about it!And then Reid… Oh Reid. My opinion on Reid changed multiple times through this book! Sometimes I couldn’t stand him, and other times I loved him so much that I wanted to dive into the pages and hug him! I don’t want to spoil anything by saying why my opinions kept changing, but I’ll say I ended firmly in the “TeamReid\" camp, so he is ultimately a great character.And those steamy sex-scenes! Yowsa do these two have chemistry!!! And the genuine love—well that makes it even better, doesn’t it?Thank you to Gallery Books for our copies to review."}, {"Review": "E-ARC provided by Simon & Schuster for an honest review.Coming out of Josh & Hazel's Guide to Not Dating, one of my favorite books of the year, I was convinced Christina Lauren could do no wrong. So this book was a healthy slap in the face. I really, really, really was not a fan. In fact, I think it's the first Christina Lauren book I've encountered where I didn't like the main character, and I hoped she wouldn't end up together with the love interest. This started out so promising. I LOVED the best friends to lovers trope in the beginning. I would give this book 5 stars for the first 10 percent if it were a novella on its own. But I was quickly disappointed.I usually applaud Christina Lauren novels for having characters that are so communicative, but this was the opposite. I hate how Millie misled Reid and tried to catfish him rather than being open and honest about her feelings. This is probably my personal preference, but it’s annoying and unrelatable to me when main characters don’t like opening up about themselves, so all the drama that occurred because of that felt very preventable and exhausting. I really hated Millie for misleading Reid and causing so much drama in their friend group and making Reid look like an idiot rather than simply being honest. It was frustratingly immature, especially because Millie is 30 years old with a doctorate degree and yet couldn't even communicate the littlest details of her life.And that's another thing: this book is definitely not written for someone my age (early 20s). I wouldn’t recommend this if you’re a millennial or younger. It’s about older people with careers trying to navigate online dating apps, and it’s just SO cringy. I’m usually down for how “modern” Christina Lauren romances are, but this one is just downright embarrassing because the characters are writing bios for dating profiles to try and make themselves seem appealing and dateable, but the ones they agree on are so cringy. If I were reading those profiles, I would definitely pass on all of them. I’m sad because usually Christina Lauren books are funny and just the right about of pop culture references, but this one was just… bad. Often. And beside the tech part of the story, a lot of the dialogue was uncharacteristically cheesy in this. Again, I usually like when Christina Lauren pokes at modern references, but more often than not, I feel like they were used clunkily in this story, probably because the characters themselves were weirdly awkward. For example, at one point Reid said something like, \"You should download this app\" and Millie's immediate response was \"I know, you mansplainer!!\" and I get she was poking fun at that word and how it's come into popularity recently but it was so forced and gimmicky. And I felt like this, often.This particular comment didn’t take away from my rating of the book but still was something I got stuck on a time or two—the cast of 5 main characters in this book was diverse racially, but every single one of those people was heterosexual and looking for a partner of the opposite sex. A bit heteronormative.So I don't know if it's because Christina Lauren is publishing two books in 6 months, but this one was so much weaker than Josh & Hazel. I skim read a lot of the confrontation and drama scenes because I was so over Millie being non-confrontational and lying because she was afraid of her feelings. By the end, I understood why she behaved that way, but I much prefer seeing characters who are open and communicative instead of slogging through 200 pages of conflict that is completely preventable if characters just opened their mouths and were honest."}, {"Review": "\nI shake my head. Must resist the cute nerd.\nHilarious, dorky, fluffy, sweet story. Refreshing and not stupid.This book came at such a fortunate time, after reading an intense book complete with a character death, this is exactly what I need right now. I have never read this author before but the writing is really easy to read without being overly simplistic, I am impressed.I would literally read the whole book consists only of their chatroom snippets. They come complete with avatars and everything.PS. Ed is a really good teddy bear of a friend. Loved him."}, {"Review": "I adore this author duo, love reading the stories they create flawlessly. So of course I couldn’t wait to read this new release by them. If you love best friends to lovers stories this is one you don’t want to miss. Reid and Millie have been friends for a few years, inseparable, the best of friends. So their group of friends decide with an upcoming campus gala, they all need to bring a plus 1 date. This is a stretch for most of the group, when most of them don’t date, don’t get out because they are always working, or always with each other. So what better way to find someone than signing up for a dating website. Sparks of jealously are quickly ignited and lines are crossed. How hard would it be to just be honest??Hard. When you have closed your feelings off, when you haven’t talked about your past, your problems, your fears, you name it, it’s hard. And with the threat of sharing your best friend with another woman, what steps will Millie do to stop it. Millie finds herself lying and betraying her best friend, getting herself deeper and deeper into lies. What will it cost her? And what will she lose when she admits her wrong doing but at the same time finally admits her deep love for her best friend?So my big PRO for this book, is the growth of these characters, reading about how they both change and realize the mistakes they make and change things to prevent it from ever happening again.My big CON, gimme more. Gimme more to Reid & Millie ❤️\n\n\n\n"}, {"Review": "What a fun rom-com and another fun buddy read with Marialyce! Millie and her group of 4 guy friends, who are smart and successful in their business life, have trouble finding suitable mates to date. On a whim they decide to enter into the online dating world. But one night Millie and one of her guy friends, Reid, become more than platonic friends. They have a ‘half-night stand’. Afterward, they decide it’s best if they go back to being just friends. But can they?Meanwhile, Millie and her friends create their dating profiles. When hers is mocked by her friends, she creates a fake profile, aka Catherine, and the dating site matches her with Reid. Millie has intimacy issues but she can be more open as the fake Catherine. Reid wants a partner he can share his deepest thoughts and feelings with. A partner like Catherine, who he is starting to fall for. What will Reid do when he finds out he’s been tricked by Millie? And can Millie be as open and revealing in real life as “Catherine” is? I’m not a romance reader but I do love a good rom-com and this book delivers. It’s well-written and fun, with a surprising amount of depth and enough conflict to keep you turning the pages. The ending was satisfying and left me with a smile on my face. Predictable? Maybe, but that doesn’t make the journey getting there any less fun and enjoyable.My daughter met her husband on her 3rd date of her first week on Match.com. But she still received her share of messages that were funny/inappropriate/creepy. She shared them with me and we’d laugh and speculate together. I could identify with that part of the book, as many of the “types” were familiar to me. It makes me very glad I’m a happily married woman of 35+ years! This book would be perfect for fans of ‘You’ve Got Mail’. Yes, there’s romance but not the sickeningly sweet roll-your-eyes type of romance. (FYI there’s language and a few steamy sex scenes so if that would bother you this isn’t the book for you.)This was another read with my best book buddy, Marialyce, and we had a great time reading it together!"}, {"Review": "Happy pub day to this fantastic read!!!Oh my gosh.... I have officially become addicted to these authors! My Favorite Half- Night Stand was sassy, sweet, funny, and just the right amount of romance. I loved this!! I can see why so many fans are googo gaga over these duo writers! Loved the premise behind this story! You \"meet\" your best friend on a dating site and he doesn't it's you until you both have fallen for one another? Can their relationship ever truly become real? I especially had fun with this one... because I'm very familiar with online dating. I met my fiance off of it but man haha hearing some of the profile \"duds\".. I was thinking that happened to me!!! lol.I absolutely loved all the characters... especially Millie. Millie is a professor and hangs around her best group of guy friends Alex, Chris, Reid, and Ed. They all love to goof around, drink, party, and just be their foursome. The problem is that they've all been stuck in this rut of not dating so they all decide to take on online dating. But of course, one night Millie had too much to drink and ended up having a \"half night stand\" with Reid. They both are wondering what have we done? Can we still be friends with this mix haha? Things become a bit complicated when the online dating rounds begin with all four of them trying to find a date to this black-tie event for their university. Yikes ;). I absolutely loved this one! I couldn't get enough of the feels and was sad to see it end. Thank you to Melissa for pushing me towards experiencing these authors! I feel a binge coming on for all their previous books :).5 sassy stars for this one!Huge thank you to Netgalley and Gallery, Threshold Pocket Books for this arc in exchange for my honest review.Publication date: 12/4/18Published to GR: 11/15/18"}, {"Review": "\nMillie Morris, a professor at UC Santa Barbara, has accepted her perma-single status and place as \"one of the guys\", but things get shaken up a bit when a drunken celebration ends in a \"half-night stand\" between herself and her colleague/best friend in the world, the handsome and charming Reid Campbell. Despite sharing a great night together, the two of them decide to stay friends, and even more, to create online dating profiles! When Millie can't find a way to be honest with her own name and picture, she creates a fake profile, but has no idea how to respond when Reid unknowingly \"matches\" with her and begins to fall for both the real Millie and the fake account.\nI am such a sucker for the friends-to-lovers trope it’s not even funny, so when I heard that the writer duo Christina Lauren was putting out this story about best-friends/colleagues turned friends-with-benefits turned lovers? I was all over it! This is only the second Christina Lauren title I’d read, the first being Autoboyography, which I enjoyed, but had high hopes that I—like many of my friends—would like their adult novels even more.\n“Our half-night stand?” he asks, and his smile is an adorable concoction of self-deprecating and sweet. I shake my head. Must resist the cute nerd.\nLuckily, my suspicions were right, because I was obsessed with this read and could not put it down once while reading it. It was one of those things where I started it right before bed one night, planning to read “just a few chapters”, and the next thing I knew, it was 5am and I was finished it. That’s when you know a book sucked you in, right?\nI don’t think I’ve ever been normal. Me? I was obsessed with serial killers.\nFirst of all, the writing in this is absolutely fantastic. I find that a lot of adult contemporary authors are great at writing emotions and feelings, but not amazing at the actual verbiage; that’s not an issue with this duo at all. Millie and Reid both felt like these wonderfully complex, three-dimensional characters. Also, can we talk for a second about how freaking awesome it is that Millie’s main character arc (besides her closed-off nature) is an obsession with female serial killers? Hello, can we be friends?\n“I only have one emotion, and it’s hunger.”\nAnother thing Christina Lauren has going for them is that they are just so damn good at making me smile, because the story is so cute and charming and fun. If I wasn’t cheesing over the cuteness, I was cringing out of my skin from secondhand embarrassment (in a good way, if that makes sense) because some of the interactions are so perfectly awkward.\nTrying to be cool about banging your best friend is a lot harder than I would have anticipated.\nOf course, there’s also the steam factor, and while Half-Night isn’t what I would consider the most sexual adult contemporary read, it definitely has a healthy dose of steamy scenes and they’re really well written—I don’t recall ever grimacing at any phrases or thinking that anything felt corny or unrealistic, which is a pretty common issue I have with sex scenes from lesser authors.Honestly, I don’t have a single complaint about this book—great writing, fun characters, cute story, and perfect pacing.All in all, My Favorite Half-Night Stand is such a delightful and heart-warming read. Whether you like your romance stories sexy, funny, or just sweet, there’s a little bit of something for everyone here. I’d happily recommend this story to anyone who’s a fan of adult contemporary romances, but I also think it would be a great introduction to the adult contemporary genre if you’re someone who’s more accustomed to YA contemporary and is looking to branch out into an older age range!All quotes come from an advance copy and may not match the final release. Thank you so much to Gallery Books for providing me with this ARC in exchange for an honest review!"}, {"Review": "I received this book for free from the publisher (Gallery Books) in exchange for an honest review. I give this book 3.5 stars which rounds up to 4. So I liked this book. But did I fall completely head over heels in love with it? Not really. Basically, I found this to be a solid contemporary romance. It was fun and a little sexy. It hit all the marks on that. I just wasn’t super blown away by it. Millie and Reid are a cute couple, but I I didn’t feel anything particularly special about them. I wanted to fall in love with their romance, but sadly it never happened for me. That being said, there were some things I really loved about it.I loved how current it was, especially with the pop culture references. At one point (page 125) the main characters debate which is the most underrated comic in recent years and my fav, Squirrel Girl, gets mentioned (it’s totally true by the way, her comics are so underrated). I also really liked the layout of the messages that the group sent each other. They had cute little profile pics which I thought was a nice touch. Lastly, this isn’t completely relevant but I just had to share. This book hit close to home for me, but not in the usual way. My grandfather recently passed away a little over a month ago. I found it to be such a coincidence that Reid’s birthday is April 2nd (my grandfather’s birthday) and that Millie’s dad has Parkinson’s (which my grandfather also had). I just thought that was the weirdest thing ever. Overall, this was a really cute romance, but for me it was just missing that special something to really make me fall in love with it.Connect with me!Blog | Instagram | Twitter | Facebook"}, {"Review": "okay, everyone lied to me, this book was fantasticI AM SO WEAK for hilarious, close friend groups and this book featured one along with an adorable mc (my beb, Reid). i seriously love the group dynamic so much, like the opening scene is them playing monopoly and i had to stop and take a deep breath before stanning it on page 1i actually really liked millie as a protagonist. she's flawed, funny, and doesn't open up often (sis, same) she made some really awful decisions and mistakes but you could REALLY see her growth at the end of the novel, and YES give me thatthe romance was so SWEET, like they genuinely CARE so much about each other. it wasn't only about the physical aspects of a relationship and i loved how chill and real they could be with each other this was a really cutesy novel that was SUPER quick to read and the graphics and instant messaging between the group was SO. FRICKEN. FUN.4.5 stars!~~~~~~~~~~~~~~~~~~~~~~buddy read with jia & maramimy first christina lauren book and im excited (though i've seen lots of mixed reviews, yikes)"}], "Genre": "Romance", "ID": "38357345", "Desc": ""}