{"Name": "Me for You", "Image": "https://images.gr-assets.com/books/1548641673l/38532186.jpg", "Reviews": [{"Review": "Moving on takes courage, losing the one you love takes tenacity, finding yourself in the chaos takes heart.This is the story of Rudy who was widowed and is quickly trying to replace the broken pieces of his heart and soul.Finding his passion, uncovering his truths, seeking companionship is only part of his story.Life isn't always as it seems as the bumps in the road sometimes makes an achievable into an unattainable goal.Rudy learns the hard way that life doesn't go as planned.When two imperfect people come together it might just be a beautiful serenade for the world to hear."}, {"Review": "I am and will continue to be a huge Lolly Winston fan, but I have to say I was a bit disappointed in this one. Good Grief is one of my favorite books of all time, and it felt a little like Winston was trying to go back there and bring up all the same feelings, but not as successfully. It was still a sweet story, and I really liked the depiction of grief as being normal and okay. But for me, this was done so beautifully in Good Grief that such a similar story looking to evoke similar emotions wasn't going to measure up. I'm looking forward to seeing her writing go in a different direction."}, {"Review": "*Review is of an advanced copyLolly Winston's Good Grief was one of those books that took me by surprise. It was an unexpected pleasure; sad, funny, relatable. Therefore, I squealed in delight upon spying a third novel from the talented author. I didn't even bother to read the back cover, merely plucked it from the ARC shelf and raced home. At first, it seemed as though Me for You might simply be a retelling of Good Grief albeit this time with the roles reversed. However, although there are definite similarities between the two books, Me for You branches off in different ways and charmed me. (I was going to say charmed my socks off but that's never actually happened.) In Good Grief it was the protagonist I found most compelling where as in Me for You, as much as I liked the two main characters, it was their relationship that I appreciated. Others may scoff at the two novels likeness, but a good story is still a good story.One minor \"flub\" (keep in mind the copy I read is an advanced copy and may be subject to change.) At one point a character is said to be consuming a Pudding Pop. The novel is obviously contemporary. Jello, for some unknown reason, (NOT Bill Cosby, this was long before his fall from grace) discontinued the delicacy in the 1990's. (According to the always factual Wikapedia.) Thus, unless this family had a stash of Pops that were still edible, it would not be possible for character to enjoy one of the greatest snacks of all time. Of course, this has nothing to do with the plot but I am a stickler for details."}, {"Review": "The book is about a fifty-four-year-old man struggling to move on with his life after his wife’s unpredictable death.The beginning seems a lot like Disney’s movie Up. Rudy and Bee were in a happy marriage full of plans for “as soon as they retire” or “as soon as they have enough money.” But one morning, Rudy wakes up and finds his beloved wife not breathing next to him. In shock, it takes him awhile to realize that his world will be changed forever. Rudy is a pianist at Nordstrom where he tries hard not to think of his loneliness while playing for different customers in the store. But he starts to notice one similar face every day; Sasha is a Hungarian woman working in the jewelry department. After their first time talking, they both realize that they have things in common and they have both had very sentimental losses in their lives. Rudy realizes he’s having feelings for this nice and beautiful woman. But is it too soon to move on and fall in love again? What would his daughter think?While Rudy is still trying to figure out how to move forward, a detective gives him some very surprising news - there’s a possibility that his wife might have been murdered. But who could have done that to such a sweet, kind woman?Rudy and Sasha slowly start their relationship and Sasha feels comfortable enough to tell Rudy all about her dark past. They become two broken-hearted souls trying to figure out how to let go of their past and how to be happy together now.I enjoyed reading this book but it wasn’t my favorite. It’s very sentimental and beautifully written but the story didn’t grab my attention."}, {"Review": "So I breezed through this book. It's a solid plot...good characters...well written. At 54 years old Rudy finds himself a widowed man. Let's break our hearts even more...Rudy's job get's downgraded and he finds himself having to turn to other means for income. Those means come in the way of a Piano...which is his once passion and talent. Who knew that Rudy would develop a sweet friendship while playing lovely music to strangers in a department store? Who knew that friendship could be something more? There is heartbreak and humor as Rudy navigates his way into foreign territory after tragedy. Feel good read...a lovely message of hope after loss. Thanks to goodreads, author Lolly Winston and to Gallery Books for my free copy of this book won via giveaway. I received. I read. I reviewed this book honestly and voluntarily. "}, {"Review": "Lolly Winston was new to me as an author. I took a chance on this book because the back cover description sounded intriguing. but I have to say I was a bit disappointed in this one. The first half was good and I truly got the characters but after that, it became kind of redundant. It was like reading an infomercial for mental health. I felt weighted down by sadness without many reprises. Then I got a glossed over happy ending. It was just too much gloom and doom without enough light to help balance it. It was still a decent read, but not one I would want to revisit any time soon. One a high note the characters were really well developed and the story was one many of us could relate to if you have had a loss or any real-life living. Thank you, NetGalley for the copy to read. "}, {"Review": "A touching story of a man who loses his wife suddenly while in his 50s. Rudy, who began working as a piano player at Nordstrom after being laid off from his financial job, struggles to handle his grief as he attempts to continue living his life. As he becomes close to his coworker, Sasha, who has experienced a tragedy of her own, Rudy begins to unravel and winds up in a place he never could have imagined. Winston’s writing is gentle and her attention to the small details of daily life give the novel a warm, welcoming tone. "}, {"Review": "Thank you to Netgalley and the publisher for allowing me to read this ARC of Me For You by Lilly Winston. I put off reading it for just a little bit because I was afraid it was going to be sad, and I needed to be in the right frame of mind for that. I was wrong. It wasn’t sad it was hopeful. Rudy was a sweet genial man who was so lost after losing his beloved wife. He was the same age as me, fifty four, and I could really put myself in his mind frame. He had recently been downsized at work and he had taken temporary employment while waiting for his wife to be ready for early retirement. His whole life was upended. This story follows his journey as he tries to find joy and his footing while playing piano in Nordstrom department store. I enjoyed the respectful manner in which the author handled mental health issues. Aside from the good writing and likeable characters any book set in Nordstrom is a winner for me."}, {"Review": "“Me for You” is a poignant story about heartache and despondency after the sudden death of Rudy’s wife. It’s a book about hope as Rudy later on climbs back and finds a new life and love again. Then life suddenly becomes more complicated than Rudy could have imagined. Rudy learns that things never remain the same. They get better, they get worse, but they will never remain the same. I enjoyed this book, the characters were well developed. It had a very interesting plot. I would be interested in reading more of this author. I was provided an ARC of this book by NetGalley in exchange for my honest review."}, {"Review": "\"Things will never be the same. They'll get better, they'll be different, but never be the same.\"This is a journey of sudden loss, grief and climbing back to find a new life and love.Rudy finds his wife dead in her bed. Why couldn't he save Bee? How did this happen?He finds himself slipping into a deep depression. His friend, Sasha is his biggest support.She knows what Rudy is feeling and makes the time to care. Will Rudy and Sasha find happiness ? I felt the emotions of both Rudy and Sasha as I turned the pages of this novel.Definitely not a light read."}, {"Review": "A quiet book about grief, depression, and hope. Rudy' s wife unexpectedly dies and how he deals with the aftermath is the study of this book. It's soft and gentle in his dealing after being run over by life. His daughter and friend from work help him to find new ways to deal with his crushing grief while finding their own way through life's changes. I was glad to read when mild mannered Rudy got mad and told the detective how he felt, it was about time for Rudy to stand up for himself.. Although the books description made it sound a bit of a murder mystery, it is not at all, just a quiet study of a man's life and finding his way.. Thank you to NetGalley for an ARC of this book."}], "Genre": "Romance", "ID": "38532186", "Desc": ""}