{"Name": "Right Where I Want You", "Image": "https://images.gr-assets.com/books/1544577011l/43200520.jpg", "Reviews": [{"Review": "5 Stars!(ARC provided by author)\nGeorgina Keller is a smart, savvy businesswoman living in New York. She’s fierce when it comes to her job as a PR specialist. She’s a fixer who’s passionate about problem solving, and is known as the best. Her latest project is to work with a popular men’s lifestyle magazine and help to polish up their brand and improve their image. She’s been hired to help them shed their bad boy image, but not everyone welcomes her with open arms.Sebastian Quinn is the creative director at Modern Man. He’s built his career, and made the magazine what it is today. He was well known in the publishing world as a notorious playboy. People envied him and wanted to be him, but lately his reputation was hurting him more than it was helping him when his magazine is under attack and his job is in jeopardy. His routine is disrupted when his boss hires what he views to be a glorified babysitter. \nCan Georgina and Sebastian work together without driving each other crazy? She’s a gorgeous thorn in his side. He’s attracted to her, but acting on it wasn’t an option. Georgina is recovering from a break up that shook her confidence, and she’s not about to let another man push her around in any way. The office gets heated as these two clash. Sexual tension and chemistry overflow as passion ignites. Sebastian’s a distraction she doesn’t need, but she’s drawn to him. He challenges her and pushes her out of her comfort zone. Sebastian is feeling so much, and finds himself wanting more. Is he ready to ditch the role he no longer fits for something real?\n-“Since I met you, I’ve been feeling... more like myself than I have in a while.”\nI loved this enemies to lovers workplace romance! It’s a sexy story full of emotion and angst. It’s packed with humorous banter, great office friendships, and beautiful love. I also adored the side characters, and would love a book for Justin! As usual Jessica Hawkins created another swoony man for me to fall for. Sebastian is everything I love in a book boyfriend! 💛\n***NOW AVAILABLE***https://amzn.to/2QYJROD"}, {"Review": "“𝐘𝐨𝐮 𝐦𝐚𝐤𝐞 𝐦𝐞 𝐦𝐚𝐝, 𝐚𝐧𝐝 𝐟𝐨𝐫 𝐛𝐞𝐭𝐭𝐞𝐫 𝐨𝐫 𝐰𝐨𝐫𝐬𝐞, 𝐈 𝐫𝐞𝐟𝐮𝐬𝐞 𝐭𝐨 𝐥𝐢𝐯𝐞 𝐰𝐢𝐭𝐡𝐨𝐮𝐭 𝐭𝐡𝐚𝐭 𝐦𝐚𝐝𝐧𝐞𝐬𝐬.\"𝗥𝗶𝗴𝗵𝘁 𝗪𝗵𝗲𝗿𝗲 𝗜 𝗪𝗮𝗻𝘁 𝗬𝗼𝘂 by Jessica Hawkins was EVERYTHING I thought it would be, and yet, it was so much more! Ms. Hawkins is known for hitting her readers with the heavy angst, but with her latest standalone, she takes a step back from the angst factor a bit. Don't let that fool you, my friends. She still brings the passion, the emotion, the butterfly-inducing romance…it’s just on a lighter scale, so you can breathe easy. For me, it doesn’t matter what genre, what trope she gives us, the emotional impact ends up being the same. Her stories resonate with me in a way that’s hard to describe. She’s one of a kind, and one of my all time favorite romance writers. It’s on the edge of my tongue to say that Sebastian Quinn is my favorite hero of hers, but it’s just too hard, because I love them all! Her characters have such dimension and complexity and they have no problems carving out a piece of my heart at the end of their stories. They are simply unforgettable…every single one of them. This is one of my favorite enemies-to-lovers romances of the year and Sebastian and Georgina absolutely stole my heart with their banter, wit, and push/pull dynamic. It’s smart. It's sassy. It's everything you could ever want in a MUST READ ROMANCE! 𝗚𝗥𝗔𝗕 𝗜𝗧 𝗛𝗘𝗥𝗘:✓ Amazon ➜ http://bit.ly/rwiwyamazonalert✓ iBooks ➜ http://bit.ly/rwiwyapplebooks✓ B&N ➜ http://bit.ly/rwiwynook✓ Google Play ➜ http://bit.ly/rwiwygoogleplay✓ Kobo ➜ http://bit.ly/rwiwykobo✓ Audiobook Release Alert ➜ http://bit.ly/audionewrelease📌 Add on Goodreads ➜ http://bit.ly/rightwhereiwantyougr📌 Learn more ➜ http://www.jessicahawkins.net/rightwh...\n"}, {"Review": "You ever read a book and you just keep reminiscing certain scenes, and find yourself smiling, giggling and maybe even moaning? That's what this book has done to me.I. LOVE. THIS. BOOK. SO. MUCH! I was in a funk when I started, umm...except I'm now in another funk! It's the kind of book that makes you smile big, swoon hard - and repeatedly, laugh out loud and yes, there were a couple of times I dieeeeed all the deads. The sexy times were HAF, I mean, come on it's Jessica! I get butterflies in my gut when I think about these characters! And YES to the FEELS! I fell so hard for Sebastian and Georgina I never wanted their story to end! One of my favourite hate-to-love romances of the year!RIGHT WHERE I WANT YOU is LIVE!-AMAZON: https://amzn.to/2Swvk9uALL PLATFORMS: http://bit.ly/2VeFjSYAUDIOBOOK Release Alert ➜ bit.ly/audionewrelease"}, {"Review": "I've only read one other book by Jessica Hawkins and I really enjoyed it, but it was a forbidden angsty romance. I was excited to read something more fun from her and couldn't wait to see how this office romance would turn out!Sebastian Quinn is good at his job as creative director at Modern Man. So what if sales have slipped and people are questioning the reputation of the men who work there? They're doing fine and definitely don't need the infuriatingly gorgeous Georgina Keller coming in to \"fix\" things. Georgina is tired of being run over in relationships and tries her best to be the confident person she is at work. When Sebastian Quinn is determined to give her a hard time, Georgian won't back down. The two clash at work, but the lines blur between hate and love very quickly. From the start of this, I loved how much Sebastian and Quinn did not like each other. Sure they were attracted to each other, but they sure did get on each other's nerves and didn't want to back down against the other one. Office romances are my favorite and I loved how they had to constantly be around each other at work and dance around their attraction while constantly arguing. Also, the other guys in the office were awesome, especially Justin, and I want more of them!As for the romance, I was swooning so hard over Sebastian and how charming he was when he wanted to be. I mean, seriously?? He knows how to woo a woman! I was laughing out loud and awwwwwing over so many scenes in this book! There were also so many adorable dogs in this book and I loved how realistic of a dog mom Georgina was. Overall, if you want an adorable enemies to lovers office romance, you HAVE to pick this up! This ended up being one of my favorite romances of 2018 and I already want to revisit these characters. This was just the romance I wanted at the time and I couldn't recommend it more! "}, {"Review": "My love for Right Where I Want You is up there next to: Dunkin’ Donuts iced coffee and cute dogs. Coincidentally, both play a role in this book.I swooned hard, and fell harder when it came to Sebastian. I was left feeling empowered by Georgina’s determination in taking back parts of herself that were stripped away. And I was pleasantly surprised by how incredibly funny and witty it was. Fun, back-and-forth banter in hate-to-love romances are some of my favorites to read, and this one was perfection! Also, I can’t forget my love for Justin. He’s one of my favorite secondary characters ever. The jokes he cracked, or...the fears he forcibly had to face have my face breaking out into a smile just thinking about them. Right Where I Want You was an angsty, smart, heartfelt romance sprinkled with the perfect amount of humor. I couldn’t get enough of Sebastian and Georgina’s electric chemistry! If you love office romances or enemies-to-lovers, then I suggest meeting the team at Modern Man! "}, {"Review": "\nREVIEW: 4 STARS\"When there was no more hate, only love, where was the line?\"\nJessica Hawkins has topped my list of favorite authors for \nyears\n, and I have made no secret of that. Her angst, her storytelling, her characters with decisions and guarded hearts - she's always a win with me. With her latest jaunt into a lighter, sweeter comedy, I knew this was going to test me. I'm used to the pull of my heartstrings and the steady pumping of my heart because the angst is so powerful that I'm on the edge of my seat. I didn't get that angst or tug with this one, but you know what? I'm ok with that. I have had a few days to think about it and while it was a slow comeuppance for me (I had to get with the \"no-angst\" program), it was a story that I definitely enjoyed reading. I am not denying that the story was good, because it was, but it was just different than the \nJessica Hawkins Angst-fest\n I am used to reading. It was also worthy of great amounts of discussion and laughter among the group of ladies I was reading with.As you may know, I don't often do sweet, nor do I do comedies a whole lot, but this was Jessica and I knew I needed to read it. I have read and loved every single book she has written, so this was a no brainer for me. Having said all that, I really did enjoy this book. What I got with this one was a surprise though. I got a down to earth Hero that had all the flaws a young bachelor can and should have. He was crass with his words around his friends, he had a great \"who cares\" attitude caked with nonchalance when it came to dealing with some things, and he had some oddball sayings that made me laugh. But he was \nREAL\n to me. A normal guy with a real personality and real quirks. He wasn't as put together as I originally thought he was going to be, but that reality made him more relatable. This guy was more firmly planted in the ground in his way of thinking, so to add Georgina to the mix was a fun traipse through their volatile relationship. But, that was their love story. That is what kept me turning the pages to find out how they came together and how the walls were going to come down. It took a little time for me to warm up to Georgina because she had a sort of \"switch\" and that flip gave me an Elvis lip twitch. The deal is, once we got down to the roots of these two characters with their issues and their pain, I couldn't help but fall in love with their love story....because it was truly theirs to work through.\n\"You're complicating things. Just be who you are.\"\nSebastian's strength was easily measured in his mental convictions, whereas Georgina's was in her work life. Their dynamic worked well and their banter was the stuff that smiles are made of. I loved when they were at each other! I loved when they tried to show up the other wth their 'knowledge'. That made for good back and forth between the characters. I always enjoy the flow of Jessica's books and the way she builds up her characters. I will say that I walked away with a better appreciation for personal growth and reading it through someone else's eyes after this one. It's amazing how we let fear get in the way of our dreams and doubly insane how we let other people's opinions change how we see ourselves. Jessica had a different voice in this book, and combined with a change of pace, it allowed a new love to unfold different and apart from all her other books.BUT!!! This review wouldn't be complete without mentioning the supporting cast and crew; their friends. I'm sure this is probably one of my favorite group of secondaries. Justin had me rolling at one point - like dying, and Luciano was not much different, but he had some extra sass to him. They added another level of reality and depth to the story and every time they were around, I was laughing. Because this story wasn't just about two people working through their own issues, oh no. It literally took a village. The reality of the characters was there and there wasn't any super-human, thoughtful claims to process, and it just read like an every day, normal life situation, but with the added pleasure of finding your true love in the process - Jessica Hawkins style. It really showcased how good it is to be able to lean on some friends to talk things through. Such great secondary characters and I loved them!! I was completely caught off guard at how hard I laughed in some spots. Seriously, because not only did I fall in love with the primary and secondary characters, I actually would LOVE to hear their stories too!! Let's start with Justin's story, mmkay? Pretty please, Jessica? HAHAHA!I may have sighed when Sebastian got flirty with Georgina, and I may have had the chills when he whispered in her ear from behind....but I'll never tell.\"Don't tell me your flaws aren't my blessings.\"~BEEAA Amazon Purchase Link: https://amzn.to/2RnkoOjEnter here to win an ecopy: http://bit.ly/2QW4cUZ_______________________________ Original post: Easy and fun with all the guaranteed allure of Jessica’s words! Review and giveaway to come on release day, but definitely one to grab. Sebastian and Georgina weren’t a couple without obstacles, but they had the strength to be.....stubborn about it. These two definitely had some great banter and some anger to boot!"}, {"Review": "\nI went into this book with the notion that I would be somewhat disappointed with this being another office romance. I’ve been there, read that, wanted to set the hero on fire while securing my alibi..etc..etc.. so color me surprise when I read the first five chapters and I found myself letting out a little giggle with a few smirks painted on my face. I was in office sexual tension heaven! I fell in love with the banter, the side characters, and the countdown was on for when these two, would finally give into temptation.Georgina Keller is a powerful force when it comes to her work. Hard working, dedicated, a no one’s push over, this woman has it together. Her personal life on the other hand, is a hot mess. When an important job comes up, Georgina knows that this assignment will further her career and make things better. But little does she know, is that the job is about to come with a lot of complications. And sexual tension. Charming, Notorious playboy, and Creative director for Modern Man Magazine, Sebastian Quinn has a life that most men can only dream about. He’s worked hard for that position for years but due to some personal error, he’s found himself in a not so flattering light with his work and has now been forced to have a PR cleanup. But what happens when the new girl literally changes the game? What I really liked about this book was that these characters went form enemies to lovers and I know that this storyline isn’t new, but this author put her own spin on it with some emotional parts as well. Throw in the fact that this was a slow burn, and I was practically in enemy lovers territory. Did I get frustrated at times and wanted to smack some of these characters? Heck yea. but I still adored them and was happy that I got to witness and enjoy their happily ever after. If you’re looking for a slow burn, sexy banter office romance, then you should really give this one a try. \n\n \n \n"}, {"Review": "3.5-4 ⭐'s “You want me to get a noodle?”I really enjoy Jessica Hawkins' books...I mean Manning and Lake are one of the greatest romance couples ever. However, it would be hard for any other couple to stand up to them and that's right where Sebastian and Georgina fell. This is your fairly typical office romance. Georgina is the fixer although her personal life needs a bit of fixing. Sebastian is the man on top tittering to fall. I have mixed feelings about Sebastian. He was the one in my opinion that felt like two different people. He's really a nice guy who portrays himself as more of a jerk. Sometimes, it was hard to get passed that. I liked a lot of the secondary characters in this story, especially Sebastian's sister, Libby, and his best friend, Justin. The dogs, Bruno and Opal, were just the sweetest. The ending made everything better for me. I loved seeing Sebastian figuring out his life and how he and Georgina made it work. ♦ BTW, if you noticed this took me a week to read, it wasn't anything due to the book. I had a lot of things going on in my life ~all good~ and that didn't leave me much time to read unfortunately."}, {"Review": "I feel like when it comes to Jessica Hawkin's books, I will also compare it to her Something In the Way series. I loved Lake + Manning so, I always have a high expectation when it comes to her books.I was genuinely excited about Right Where I Want You. It 'promised' an exciting storyline of enmies to lovers - office romance. But sadly for me, I didn't really enjoy it that much. Sure, I loved the banter between Georgina and Sebastian. I loved their playful sarcasm but I'll be honest, there were times where I wanted to DnF the book.. The slow pace felt almost sluggish and I wanted to flip the pages so that I could 'get a move on', so...that sort of ruined my mood and excitement of reading the book. Anyway, I'm finished the book and I enjoyed reading it but atlas, I don't think I will re-read the book like I do for Lake + Manning. <3Disclaimer: I totally missed Lake and Manning, so I read the series again hehehe"}, {"Review": " Release Date:  December 28, 2018 Genre:  Contemporary Romance (office romance/enemies to lovers) Actual Rating:  4.25 starsI thought I was over office romances. I have read these types of books time and time again and feel like they are slowly blending into one another. But then Jessica Hawkins writes an office romance. One with all the feels. One with interesting and relatable characters that have their own flaws and own them. One where the thin line between love and hate disintegrates at a realistic pace. And all my thoughts about not wanting any more offices romances has dissolved. Jessica Hawkins has a knack for building characters that readers can feel connected to. She writes story lines that are engaging and uses setting that are easy to imagine being a part of. All of this is included in this story and I praise her for the way she writes these stories making her readers feel as if they are a part of the story. This one my friends is one you don't want to miss. It's a slow burn, one that doesn't happen instantly and is charged with passion. I enjoyed this one from beginning to end and didn't want to stop and take a breath between pages. I really liked it and I know many readers are going to feel the same. "}, {"Review": "Find this review and others at Carlene Inspired.4.5 StarsGeorgina Keller assumes the name George during her nine to five, determined not to let anyone take advantage of her good girl ways at work. There she wants to be seen as in control and in charge, especially in her new position at Modern Man. Sebastian Quinn lets the headlines speak for him; party guy, ladies man, and daredevil are just a few things they say about the handsome Creative Director at Modern Man. The magazines in a downward spiral though and Georgina is brought in to repair the reputation that Sebastian has created for it. The two clash from the very first moment and while attraction simmers between them neither wants to let the other win.\"I'd come to Newton that weekend certain Georgina hated me. Now I'd gone and missed my shot with her. Did I even want a shot?\"It is probably no surprise to anyone that I loved Right Where I Want You. I am a self-proclaimed super fan of Jessica Hawkins and I buy anything she releases, so of course I was stoked for this book. Plus, it offered us a contemporary romance, one not driven by angst, but more so by chemistry. While the fan-girl in me loved this book automatically, I made sure to leave her behind for this review. Right Where I Want You thrusts readers immediately into the fast-paced, business-driven New York City streets. There's snippy business women, handsome men in suits, and there's Georgina acting like a bit of a pushover, at least until we see her take charge in the conference room. Sebastian too gives off different vibes, showing a sweeter side to himself until we see him saunter down the office halls. While I didn't quite connect with Georgina's alternate personalities, I loved Sebastian, and I extra loved their insane chemistry. Talk about office romance done right! And if you love enemies-to-lovers tropes, we get that too. Sebastian knows his job is on the line and he certainly doesn't want to give it up to a girl who goes by George, but some of the things Georgina wants to see done make sense and the rest he's forgotten due to staring at her. As they put the bad behind them to give love a chance they discover that sometimes there is some truth to first impressions.\"Finally, I had exactly what I needed to take her out. Now I just had to ignore the disturbing thought that I might rather ask her out.\"Jessica Hawkins takes us on a journey of self discovery with hilarious and heartwarming moments that find the characters unable to deny their attraction to one another. Right Where I Want You was the perfect book for me to end 2018 with and if you haven't read it yet, definitely put it on your January 2019 lineup. It's a must read, full of sweet, funny, and sexy moments that'll have you entertained until the very last page.ARC provided."}, {"Review": "Sebastian - Liked him right away, right off the top. There's this sweet sexy approachable feel to him. He is the type of person anyone would love to meet and have as part of ones life whether it be as a friend or lover (Lover would probly be the better option *swoon*)Georgina - I liked her and I was proud of her. At the same time I was sad for her and mad for her past. Being the beautiful selfless person she is she should NEVER feel the insecurities she did based on someone else's ignorance. This book had me thinking of some personal choices/mistakes. Made me feel that I could be a better person overall. We should all strive for this.My heart kept twitching. My chest felt full and the fluttered feeling in my stomach was constant. \n“Since I met you, I’ve been feeling more like myself than I have in a while.... “I am myself. But what about you? Do I make you better?” He paused. “Can you see yourself with me?”\nI smiled, laughed and thoroughly enjoyed Sebastian and Georgina. Their world had beautiful and fun characters right down to the pets. AMAZING!!"}, {"Review": "Pure perfection!!!A top read for 2018!!This read was a pure joy to read. A definite triple crown of reads, but I won’t reveal what they are... you need to jump in and discover for yourself.Smart, sharp and full of passion. The writing was spot on and all the characters added to the overall story. The main male character, Sebastian is a throat kick, then jump his bones kind of hero. The female lead George aka Georgina had the same effect. As these characters developed they were the type of characters that you loved to hate and you hated to love.The holy hotness factor, the passion, and the struggles they encountered were at times raw and compelling. But then, there were moments that were full, belly laugh out loud funny. Their chemistry and banter alone, was so sharp, it was worthy of five stars. The secondary characters gave so much to the story, they were worthy of their own book. As much as I wanted to fly through the story, I had moments where I had to pause and step away. This unconventional romance stands on its own in so many ways. The plot was unique because of the underlying factors impacting the characters’ behavior. They each have some baggage that gave the story more depth and complexity. There were some heart wrenching moments where they let their guard down and showed their vulnerability, making them more realistic and relatable.Every page revealed something new and exciting, and I’ve never been so anxious to get to the end to discover how it all turned out.This wasn’t just a story of romance but a story of self discovery.What a great way to end my reading experience for 2018!"}, {"Review": "right where i want you started off really promising.georgina, known as george in her workplace, gets hired by modern man’s magazine to help them with their ongoing crisis. after an awkward encounter with renowned asshole sebastian quinn, she finds out that he is the one she is going to be working closely with. because of their previous encounter, in which she ended up crying after he told her off, a few important subjects are tackled, including how differently woman have to behave in the office compared to man, for instance how showing any kind of emotion will lead them to not be taken as seriously. being a sucker for office romances myself, i find it incredibly important that these books take their time to delve into the different treatments between genders, especially in predominantly male jobs, and how women should always stand up for themselves.however, and although i appreciate the subject matter, there was something that put me off the story: the dialogue. the only complaint i have with right where i want you, which ended up tainting my reading experience, was the dialogue between the two main characters. the story had potential, the characters were great, with not one but two characters whose main purpose was comedic relief. unfortunately, having all those things in favor weren’t enough for me to ignore how cliché and unrealistic the communication between georgina and sebastian was, with the latter even going as far as to say”you’re nothing like the other girls i’ve known.”i mean, did he really need to go there?"}, {"Review": "***ARC Provided by the Author***Georgina and Sebastian meet over coffee. And, spilled coffee, and mean customers, and tears. Usually, when a public encounter goes this badly, you get to walk away from it and pretend it never happened. Sometimes, though, in real life (and more often admittedly in books) the other part of the embarrassing encounter is someone who is now a part of your life, in a way that you are not able to easily remove.Sebastian has run Modern Man for years. He pulled it from the brink of disaster, and now it is back to glory. Or it was. Things in his personal life changed, and with that change, he found that he was willing to let the magazine slip a little and not really care all that much about the fact that it was doing so...even though, I think he knew it was happening, he just didn't have it in himself to work that hard, again, to bring it back.Georgina is brought in as a consultant. To put the magazine, and it's team, back on track and to get them back to a functioning team. But, as she is dealing with the after effects of a devastating break up, the only thing that she has together in any real way is her work. When Sebastian challenges her at work, sparks fly and a line is drawn. Hate is on one side of the line, love on the other...and they are both firmly on the \"hate\" side of the line. The majority of the book is a slow burn flirtation with this line, with crtossing it, with pretending they don't want to, with wondering if they have already and wondering how the other feels. Until the line is gine...and in such a clever way that you know what is happening, but that gives both of them a chance to see if this is what they want. I loved this, as it also lets the reader in on the part of the story where they each realize that what is between them is real, and it is not going anywhere, and that neither of them want it to.This book is about people. People who let the things in their lives change who they are, how they react; and the realization that those changes, while honest at the time, may not be permanent and may not lead them to make a permanent change. Life, and it's lessons, are sometimes guidelines and sometimes the lessons are there to put you on a new path entirely. And, figuring out which you are faced with can sometimes take a while.Georgina and Sebastian, in different ways, have things that have happened in their past that are holding them back, that changes them and how they react. That alter who they are, how they trust, and where they are willing to go. But, are these changes the permanent kind or the type that give you guidance for the next phase of your life? What if, as you live, a change that seemed permanent turns out to be one that you needed to work through, and then let go?Sometimes, a life lesson exists to wake you up, to show you a different path, and to then be let go once you have taken a different path...because, as you travel down that path, you realize that the lesson you learned in one situation becomes nuanced in others. Kindness becomes compassion, being willing to give of yourself to those you love becomes love. Your big heart, the one that is so easily broken is where you find home with someone who sees the love you have to give.This. This is what this book is about. Yes, you have the romance, you have the characters you adore, the hot sexy scenes...but you also have the kind of book that sneaks up on you and makes you cry and then leaves you as happy as 2 dogs, cheerfully sunning themselves on the lawn.Jessica Hawkins is a favorite of mine. Her writing is angsty, and it breaks your heart, it makes you cry. More than once as I was reading a line in the book stood out to me enough that I had to pause to read it again.I loved and recommend this title."}, {"Review": "Office romances aren't usually a trope that I lean towards. But something about the cover, the title and the book blurb combined pushed me towards the one-click. A new-to-me-author is always a pull, too. Jessica Hawkins made it work for me, and I thoroughly enjoyed the slow burn -- no robotic, repetitive, needless sex scenes -- that filled the pages. And the eventuality of what transpires between Sebastian and Georgina and their enemies-to-lovers story is well-worth the wait.Full of sexual tension and sizzling chemistry that could ignite at any moment, witty banter and over-the-top clever dialogue made for one very seductive romance. It didn't hurt that both Seb and George were both highly intelligent and strong individuals. Nobody played the other. And there's a bit of angst and heartbreak to climb over, too. A really special feature that I loved is the inclusion of two adorable and lovable dogs who played their roles to perfection.A new term popped up -- one I've never read before in contemporary romance -- \"BDE.\" But I'm not going to tackle the definition. You'll have to get either Sebastian or Justin to explain its meaning. Be prepared to be impressed as Sebastian shows his off, even while the laughter flows.And please oh please bring on more of Sebastian's best friend, Justin. He was definitely a highlight from start to finish. There has to be more from him! "}, {"Review": "5 Stuff-of-dreams stars! What an amazing, sexy and heartfelt read!\"She was small but mighty, ambitious but not malicious, and feisty with a streak of sweet.\"Troubleshooter, Georgina Keller, is fully armed and prepared for her first day joining the male-dominated creative team at lifestyle magazine, Modern Man. What she's not prepared for is Sebastian Quinn's panty-dropping good looks and resentful hostility. Renowned for his bad boy ways and sexist bias, she's unprepared for her attraction to him and she has to dig deep to put aside her natural doormat tendencies to be the strong, professional business woman that she is. However, the more she gets to know him, the more she realises that there's more to him than meets the eye.\"Was Sebastian more than the image he projected, or was he an actual bad boy to handle with caution?\"Modern Man is Sebastian's life's work. He IS Modern Man. Knowing his job is possibly on the line, he begrudgingly works alongside Georgina. Unfortunately, his pesky attraction to her is something else entirely, and he finds himself becoming totally beguiled by her and her kind, sweet ways. And, don't even get him started on her endless physical attributes.\"You have all these little f*cking freckles...It's like someone sprinkled you with cinnamon to serve you up as breakfast.\"Absolutely loved this story! The chemistry between Sebastian and Georgina was electric and tense. Sebastian was just so hungry for her! He can't help but be fascinated by the dichotomy that is Georgina Keller. On one hand, she's meek and sweet, and on the other, she's something of a ballbuster. Sebastian, himself, is not quite what he portrays, and I loved watching Georgina unravelling him and his vulnerabilities.Fabulous, hot, and heartfelt! Another winner from this author."}, {"Review": "Right Where I Want You was slow burn and just didn't really do it for me. I finished reading it a few days ago and honestly all that I remembered at first was that 'mahogany' was referenced several times and each time I read I giggled thinking of Effie Trinket in the Hunger Games trilogy.Right Where I Want You was not only slow burn, but slow for me period. It took me days to get into and even then I had to keep pushing myself along to get the story read. All this time they are fighting each other and then it seemed like once they figured out it wasn't really hate all along, everything happened at warp speed. The highlight of this entire book for and what moved it from a two star to a three star read was Sebastian's best friend, Justin. If it wasn't for him this book would have fallen completely flat for me. He injected much needed personality into Right Where I Want You.Although, Sebastian was sweet and caring once he decided to open up to Georgie, it was like pulling teeth for him and then Georgie, she couldn't decide who she was, I realize that her ex did a number on her mentally, because I'm pretty sure we were reminded just about every time it was her POV, but man. She needed to get over it. She was even seeing a therapist for it. Right Where I Want You made me itchy with anticipation and sadly ended up falling flat for me. If Justin gets a story though, I will be all over that!"}, {"Review": "Jessica Hawkins....oh my goodness! You always seem to give me what I need, when I need it and Right Where I Want You is no exception. This book was a yummy, delicious treat, filled with heart, witty banter, excellent secondary characters and Bruno the lovable Great Dane. With bustling vibrant, New York City as the backdrop, Jessica Hawkins gives us more than just a fun, flirty enemies to lovers read. Right Where I Want You, delves deeper than that. Sebastian and Georgina are both fighting their own inner struggles and despite their differences are more similar than they know. If you are looking for an office romance with a enemies to lovers tilt, that will leave you wanting more and rooting for their HEA then you should definitely check out this new one by Jessica Hawkins. You will not be disappointed."}, {"Review": "4.5 stars. Enemies to lovers in an office romance, need I say more? There is so much fun stuff happening in this book in parallel to the seriousness of the plot and relationship development. Georgina Keller and Sebastian Quinn actually meet firsthand before they are officially introduced in the office later, as coworkers working along side each other in Georgina’s mind, and immediate nemeses in Sebastian’s mind. Their first impressions already color their second impressions. This sets the stage for the tension between them because Georgina is a different person in the office compared to out of it, whereas Sebastian has a real side to him versus his perceived persona at work. I loved these dichotomies because it showcased how multi-faceted people are in different aspects of their life and how to peel back the layers. And if people can’t find common, neutral ground at work, then who can deny a connection when there’s a pet involved? Dogs play a big role in this story and it’s very heartwarming. Georgina is very independent, loyal and kind-hearted, but struggles with balancing her generosity with being taken for granted. She’s very direct and commanding at work without being insensitive and callous. As for Sebastian, he’s proactive, dedicated and hardworking, coupled with comfortable and hot-headed when it comes to his job. Yet he’s very respectful to people from all walks of life and doesn’t expect anyone to clean up after him. They both have personal issues coupled with professional challenges, especially while they’re sharing an office. But I could feel the sparks and detect their fascination with each other. What impressed me about them was how forthcoming they could be with communication and when the walls fell, they saw the other’s weaknesses as strengths instead. The banter was hilarious and the secondary characters were beyond entertaining. Between laughing and swooning, there were some heart clenching moments and angst, too. Georgina and Sebastian straddled that thin line perfectly."}, {"Review": "It's a \nComing Back Home Story\n of a man who's uprooted from his hometown, loses touch with his family, his heritage and his values. In order to fit in, he paints a caricature of himself, way bigger and more colourful than his reality and then he tries to fill it with borrowed props, hangs out with the hipster crowd. He wears a cloak of flamboyance and audacity to appear larger than life. But it's an empty shell.\nFrom Quintanilla to Quinn, Boston kid to city playboy, I’d been trying to keep those parts of myself separate. To slip those identities on and off. But I was still that punk who’d hustled to become the man I was now. I was both. Without Mom to put me back in my place when I needed it, I was clinging to this, an empty shell of a house.\nHe's Sebastian Quinn-Creative Director at-large of Modern Man magazine in Dixon Press and a columnist at\nBadVice\n . With his group of bad boys who basically create raucous havoc in the mag world by objectifying women and inflating male egos. But Karma comes to bite in the ass with an Exposè and an emergency Crisis Manager is called- George(ina) Keller, what she doesnt know is that she's literally stepping in a den of lions and they're pretty much set in their ways. He's the captain of the ship which is sinking under his feet. When the compass breaks Georgina sets the ship right.\n“You’re more or less here to babysit us.”“Don’t be babies, and I won’t have to,”\nSebastian has potent charm and sexist entendres in his arsenal, he picks and books women with ease, so looks like George has her work cut out for her. She tries to clear the layers of silt to dig out the real Sebastian buried within.The story is classified under Enemies-To-Lovers trope, but I think its much deeper and wider in canvas than a simple box its put in. There's two people battling public perception. Both have been burned badly and have mastered the art of dividing their psyche into two seperate compartments.\nit’s like you feel guilty taking up space. I don’t get how you can be so fierce at work and the opposite in your personal life.”\n Both have lost them selves and it's up to each other to help unearth the simple human beings that they are. Jessica has made the characters very real. They're plagued by self doubts, and instead of facing them, they puff up their images to hide behind it. A one-up-manship follows with some supremely sharp and smart banter. It's a joy to read such fantastic lines. Clangs of titans banging heads is like a battlecry in the office of Modern Men. I loved the sharp as whip language, witty retorts, push and pull of positions.\n“I much prefer it that way. I call, you come.”“Call all you want, and see if I come,” I\nBDE force is pretty strong in the story... There's steamy sex and panting chemistry but there's also supporting love and energizing companionship. There's laughter and tears and hope and hopelessness. In the end the question to ask is pretty basic and straightforward. It's finely detailed, has a lot of heart and brings vulnerability to cold power rooms. Jessica gives a us a seat at office politics around board meetings. Up close and personal look at professional rivalry where lines get blurred\n“I asked myself some things. Where do I want to be? Who do I want to be? Who do I want to spend my days with? \"\nThe answer is a KISS-keep It Simple. Stupid. Hold hands and build a home, with smiles, laughter, dogs and kids. Rest will follow\n4.5 stars for Beautiful Ad infinitum\n#BookBistroBlogApproved Follow us on :FB - https://www.facebook.com/groups/BookB...Blog -https://bookbistroblogcom.wordpress.comBlog -https://bookbistroblogger.blogspot.comTwitter - https://www.twitter.com/BookBistroInstagram - https://www.instagram.com/BookBistroBlog"}], "Genre": "Romance", "ID": "43200520", "Desc": ""}