{"Name": "Outlander", "Image": "https://images.gr-assets.com/books/1529065012l/10964.jpg", "Reviews": [{"Review": "I gave up on this book because I was sustaining permanent damage from reading it and I was afraid I'd start hitting back. And it's a borrowed copy, so that wouldn't be cool.In fairness, I should say there's a lot of good writing here. I really enjoyed the beginning chapters. They even kind of cracked me up, because I have friends who love genealogy and their husbands always get that look when they start talking about it and that's exactly how I imagined Claire looking when her husband Frank started droning on and on about his ancestors.And Claire is a nurse, which is a really good transportable skill if you're going to be thrown back in time which it turns out Claire is. (Sorry. Spoiler alert.) Can you imagine if you were one of those Nerds On Wheels computer repair people and you got sent to eighteenth-century Scotland? You'd be totally screwed.But Claire's skills come in handy without seeming out of place. A woman who's a dab hand at healing is always welcome in Olden Tymes, so Claire is able to land on her feet and kind of get a job once she figures out what happened to her and comes to terms with it.Which is pretty much immediately. Which is when the book started to lose me. There's, like, no culture shock whatsoever. She gets knocked back two hundred years or so. She goes, \"WHOA. What the flimminy?\" She starts being The Lady To Go To With Your Eighteenth-Century Scottish Boo-Boos. That's it. There are a few mentions of things like how shoes fit differently back then and anachronistic language, but there's no sense of the kind of thing a person from the future would be startled by. Not the food, not the weird underwear, nothing. Claire just settles in and starts being the resident nurse at a castle. She keeps half an eye out for a chance to get to the place that can take her back to the future, but it has all the deep emotional urgency that I feel when I really should stop by the grocery store on the way home but it won't kill anybody if I go tomorrow instead. Like, whatevs. Still, there was plenty to keep me interested. Like – leeches! The stuff about leeches was cool. And the info about healing herbs. And that kid getting his ear hammered to a board because he was caught stealing.Really, this book would have worked fine for me if it hadn't been for what everybody else seems to love about it, which is the Romantic Interest. Which still would have been fine, even with the whole SHE'S MARRIED ALREADY thingy. But, okay – let's say that she has to marry that guy. They aren't in love when they get married and so the whole point of the book is to watch their relationship develop, while Claire struggles with guilt and fear and thoughts of how her real husband must be worrying about her and how the heck does time-travel work in this book and WHY IS SHE JUST ASSUMING THAT TIME IS GOING BY IN THE FUTURE AT THE SAME RATE IT IS FOR HER? WHY, I ASK YOU?(Sorry. I'm a minor-league nerd, and this part really bugged me.)So what I just described would have been a book I could read and enjoy, or at least read and not scream in pain. But apparently someone gave Diana Gabaldon the creepiest piece of writing advice EVER, and it was this:\"Listen – you know how if you're cooking and you're worried it's not turning out very well, just add bacon if it's savory and chocolate chips if it's sweet and everybody'll love it? Well, if you're working on your first novel and you don't know what to have happen next, just throw in some rape! Or attempted rape! Works like a charm!\"She follows this advice to the letter, and I'm sorry but I have to go home now. I managed to read the \"she disobeys him so he beats her with his belt\" scene. I almost punched the book right in the face, but as I said, it's a friend's copy so I had to be nice.Then I managed to get through the \"she forgives him for the beating, like, the next freakin' day\" scene. I started fantasizing about this book getting stuck in the elevator of a burning building, but I was able to hold on and keep going.Then there was the scene where Big Kilted Oaf – I mean, Jamie – starts laughing about the whole beating thing and reminiscing about how hot she looked when he was holding her down beating the crap out of her and she forgives him for that, too. Like, instantly. And I'm all, \"WHO AM I AND WHAT AM I DOING HERE?\" And still I staggered on. Heaven only knows why. And how did the author reward me for my perseverance? What is this book all about? What's the recurring literary theme?Rape. Attempted rape. More attempted rape. Marital rape. A little more marital rape. Conversations about rape. GIGGLING during conversations about rape. And I'm all, \"I'M OUT OF HERE AND I DON'T CARE HOW MANY OF MY FRIENDS HATE ME.\"I read 444 pages in a row, plus I skimmed a lot of the rest of it including the creepiest, rapiest Chekhov's gun I've ever seen fired. Do NOT tell me I didn't give this book a fair chance. I TOTALLY DID.In case you need proof, here's a list of all the things I learned about rape from Outlander.1. It's a bummer for the woman involved, but save your sympathy for her brother. (Assuming you have any emotional response at all, which you won't if you're Claire.)Jamie tells Claire about his sister Jenny being raped by a dastardly redcoat. He has a good chuckle talking about how Jenny punches and kicks her attacker. She isn't able to hold him off forever, though. And Jamie gets flogged for trying to defend her. Claire's response?\"I'm sorry. It must have been terrible for you.\"It is terrible for Jamie to have his sister \"dishonor herself wi' such scum.\" (Nice.) So terrible that he can't bring himself to go back home to her when he gets out of prison, and \"see her again, after what happened.\" She's impregnated by the rape. Left on her own both emotionally and financially, she is forced to become the mistress of another English soldier. Jamie finally sends her what money he can, but can't bring himself to write to her. Because, you know, \"what could I say?\"Claire's response?\"Oh, dear.\"(Really -- how could I give up on this book when the main character is so sympathetic?)2. Rape can lead to comically inaccurate ideas about how people do \"the nasty!\"After Jamie and Claire consummate their marriage, Jamie confesses that he \"didna realize that ye did it face to face. I thought ye must do it the back way, like; like horses, ye know.\" Claire tries to keep a straight face as she asks him why on earth he thought that.\"I saw a man take a woman plain, once, out in the open. But that...well, it was a rape, was what it was, and he took her from the back. It made some impression on me, and as I say, it's just the idea stuck.\"So of course Claire flips out and asks him what the heck that was all about. Who was it? Why was he witness to a rape \"out in the open\"? Was he able to help the woman? What happened to her?Oh. Wait. This is Claire the Emotionless. She doesn't ask him anything, and he doesn't say anything else on the subject. Instead, they cuddle and talk about how much fun what they just did was. Because a story about rape out in the open is just the kind of pillow talk a woman wants to hear when she's relaxing after a nice bout of bigamy. I mentioned I loved this book, right? I didn't? Good.3. Nearly getting raped turns you on for Mr. Right!Jamie and Claire are off on their own in the woods for a spot of marital bliss when they're set upon by highwaymen. Claire is nearly raped, but manages to kill her assailant. Yes, she was a nurse during World War II, but I think there's a difference between witnessing violence and inflicting it yourself. She kills the guy in the nick of time. He's on top of her, so she undoubtedly gets his blood all over her. Meanwhile, Jamie manages to dispatch the other two guys.And then Claire flips out about the fact that she was just attacked, and she had to kill a guy, and she had to kill a guy at close quarters with a knife.Oh. Wait. This is Claire. She has no response to any of this, now or later. Well, she does have one response:When I put my hands on his shoulders, he pulled me hard against his chest with a sound midway between a groan and a sob. We took each other then, in a savage, urgent silence, thrusting fiercely and finishing within moments.If your marital love life has been a bit blah lately, why not get attacked and then kill the guy? It'll spice things right up!4. It's not rape if it's your husband and he promises he'll hurry...\"Jamie! Not here!\" I said, squirming away and pushing my skirt down again.\"Are ye tired, Sassenach?\" he asked with concern. \"Dinna worry, I won't take long.\"(next page):He took a firm grip on my shoulders with both hands.\"Be quiet, Sassenach,\" he said with authority. \"It isna going to take verra long.\"I gather it's especially not rape if your husband has an ethnic-slur nickname for you. He should use this at least three times a page. (Yes, \"Sassenach\" is derogatory. It'd be like if you were white and your husband called you his little gringo. Although that would actually be kind of funny if he's white, too. I think I want to get my husband to start calling me that now. But I digress.)5. ...or if it's your husband and he just really, really wants it.Claire is saying no, and no again. She's still in pain from the last time they did it, because he didn't take no for an answer even when she told him quite honestly he was hurting her. So how does our romantic lead respond?James Fraser was not a man to take no for an answer. ...Gentle he would be, denied he would not.I quoted that last line to my husband, and he got the same look on his face that I had on mine all through a two-day bout with food poisoning.If this book works for you, fine. I'm not here to judge. I'm just asking that you understand how completely creeped out I was by all this, and not tell me I didn't give it a fair chance. I did. I really hate not finishing a book once I start it, but I just couldn't stand it any more. "}, {"Review": "Quick question: if this book has a quarter of a million ratings and still maintains an average rating of 4.13, why the hell are the most popular reviews the snarky, mean spirited, one or two star reviews? That doesn't match up at all with what I'd assume would be the case, which is that most people who read this book LOVED IT. Including me. Please, people. If you enjoy a book, click \"like\" on the good reviews as well. That's what people see first when they look for reviews on Goodreads...the ones with the most popularity, or \"likes\". Sad that this amazing book's two most populare (and therefore most visible) reviews are not in keeping with most people's thoughts.~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~\n\"Ye are Blood of my Blood, and Bone of my Bone.I give ye my Body, that we Two might be One.I give ye my Spirit, 'til our Life shall be Done.\"\n~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~\nSUMMARY:\nClaire is happily married. She and her husband are visiting Scotland and soaking up the history while indulging in some much needed time alone. One morning, they are witness to a group of women performing a ritual at a nearby stone circle.\"They should have been ridiculous, and perhaps they were. A collection of women in bedsheets, many of them stout and far from agile, parading in circles on top of a hill. but the hair prickled on the back of my neck at the sound of their call.(The modern witches at the stone circle...spooky and oh, such a good mood setter!!!)Claire returns to the circle later. I wonder if she felt called to that magical place, as if fate had plans for her and she was simply following her destiny.The tallest stone of the circle was cleft, with a vertical split dividing the two massive pieces...\"Without warning, and for no apparent reason, Claire is whisked back to the year 1743.I could say that my field of vision contracted to a single dark spot, then disappeared altogether, leaving not darkness, but a bright void. I could say that I felt as though I were spinning or as though I were being pulled inside out. All these things are true, yet none of them conveys the sense I had of complete disruption, of being slammed very had against something that wasn't there.\"There she meets James Fraser, a man who is as complex as their relationship turns out to be. Claire never stops trying to get back home, but this world of the past and her present is slowly beginning to sink into her. She must now decide between remaining faithful to a man she may never see again, or conceding to the realization that she will forever remain in this time, with this fascinating man who has become her fiercest protector. ~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~It's pure craziness to me how this book can be summed up in a couple of paragraphs. And it's both detrimental and beneficial that a summary simply cannot encompass the sheer scope of heart that is in these pages. I was absolutely unprepared.Why detrimental? Because the details did become tedious, even as they were adding to the story. The downtime...instead of a time of building anticipation, became a time of hurry up and wait. This is the only reason that I can't give this five stars...because, for a couple hundred pages, I was 'a wee bit' bored. And I hope that my saying this won't keep someone from reading it. I wish that I didn't have to mention it, but in order to be fair and honest, I feel like it's necessary, if only to keep someone's expectations from becoming too high. And to be totally confusing, it's the details that drag you down into the middle of the eighteenth century, the minor secondary plots that make you live this life for awhile. So I'm not certain that they weren't necessary. I do wish that we got more of Claire dealing with the mundane things, but she just never seems bothered enough with inconveniences to mention them.I don't want to do much of a character breakdown except for maybe the three big key players in this story.~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~\nClaire...\n\n\"You're no verra sensible, Sassenach, but I like ye fine.\"\nOh boy. I had heard that a lot of people didn't like Claire at first. And to be quite honest, for most of the book I really DID like her. She was fairly steadfast to her husband...although circumstances bieng what they were, it would have been nearly impossible for her to stay that way. This was a fascinating look into what it must have been like for a woman back in those times. Not quite the Dark Ages but boy, they were a far cry from modern women's rights. This was a time of witch burnings and mob mentality. Imagine what it would be like to go back to these times, knowing what we know now, remembering what took place in history, and being scared to death to be female. You're completely at the mercy of the men you are with. Thank goodness Claire stumbled upon Jamie.Her character did fluctuate for me, for obvious reasons. I had a few minor hiccups with how wishy washy she was at times, and how little she seemed to think about how her actions would affect Jamie. However, (view spoiler)[ I do think that she had no idea how passionately Jamie felt for her until near the very end. So why would she feel the need to constantly spare his feelings and put him first?  (hide spoiler)] At some point, she has to think of herself. The time frame in which all of this happens is not exactly conducive to accepting her fate and giving up on her whole life before Scotland. So I felt like I could cut her a break. She has an awful lot to deal with and I feel like she did the best she could. And toward the end...she becomes just as much a hero as Jamie does. You just have to wait for her to build up to this amazing person that she was meant to be. ~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~\nJamie...\nYes, I swooned, I gushed, I loooooooved Jamie Fraser! Who wouldn't? Who would admit to it if they didn't? However, he is really not at all what I expected. I like the badass boys, the heroes, the heartbreakers, those men who make you wonder if they will ever be tamed. I like men on the edge of good and evil, the ones that you are always unsure of. But there's just something about the nice guy, the man who...as soon as you meet him, you know his heart is pure and good. There are no questions with regards to Jamie about his purity of character. He's the epitome of good. He's a great mix of beta male (somewhat in the background, not horribly outspoken, usually backup for the leaders) and alpha male (leader, loud and proud, tends to be bossy and pushy.) I expected Jamie to be a more stand out guy but honestly, it was all in the “knowing” of Jamie that made me fall for him. He is one of the most honorable, strong minded, tender, loyal and devoted fictional men I've ever, ever read about. As Jamie himself puts it, he ”I havena the taste for power at the cost of other men's blood.” All of these romance heroes that we read about...the Dukes and Lords and Lairds and such...all of the battles and death and heartache...they're entitled to their place in society, to revel in their own sense of power and self-righteousness. Jamie just wants peace, a home, his wife, and a good life. Simple but so powerful. If only more people felt that way, if only more men were heroes because of the battles they didn't fight.Claire tending to Jamie's shoulder...\n\"Ye need not be scairt of me,\" he said softly. \"Nor of anyone here, so long as I'm with ye.\"\nThat is not to say that he was perfect. One big, huge point of contention for me was (view spoiler)[ when he beats Claire after she tries to find the stone circle and instead ends up getting captured. I don't care what year it is, That's never right. To beat her until she can't sleep, can't sit down, and then allow his men to make fun of her for days afterward while she is healing... (hide spoiler)]this is one of the more cruel things that I've ever forgiven a hero for. I suppose if I'm going to forgive, it may as well be James Alexander Malcolm MacKenzie Fraser.~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~`*`~\nRandall...\nI truly think that he is not only one of the most vile, heartless, disgusting, noxious, EVIL villains that I've ever met, he is also, oddly, an object of pity. Not to be mistaken for sympathy. He deserves a slow, torturous, endless agonizing death. His singleminded foxhunt of Jamie is confusing at first and later, every time his name is mentioned, I literally became filled with rage. I'm one of those that cried when I'm angry and I can't even tell you how hard I cried. Enough that I couldn't read any more. I had to calm down first. Poor Jamie :( Here is my reaction, of which I typed in the buddy read I was taking part in after I read the specific part that made me hate...literally hate Randall. Do not read this if you don't want a huge spoiler. You've been warned!!82% (view spoiler)[ Son of a fucking bitch!!! Not only did Jamie get raped but we don't even get to see that evil, sadistic ass hole suffer? I'm so mad right now. So fucking mad. And what the hell was all the wolf bullshit? Why even put that in there? It has no bearing on the story except to draw out the part where Jamie is once again flogged...tortured, burned, beat, raped. So I say again...what the fuck? I'm a vindictive bitch. I want payback. That fucker needs to suffer. Jamie needs to look him in the eye while he guts him. How fucking anticlimactic to give him an easy out. I am just livid. I'm so pissed off I'm crying  (hide spoiler)]Yeah, suffice it to say that I really hope we get more of Randall and that Ms. Gabaldon feels the black rage that I felt toward him. I hope, I hope, I hope. Even rereading my reaction makes my blood pressure rise.\nFinal thoughts:\nYes, this is a great historical fiction novel but Jamie and Claire..their love, their devotion to each other is what makes this story epic. You just can't get around that fact. This is a love story. And so much more. I was so conflicted from the position that both Claire and Jaime were put in. What is right and wrong here? Claire loves her husband. But here she is, in this impossible situation, of which she can confide in no one. Not a single person. And so she goes first with her gut. Then with her head, and finally, FINALLY with her heart.\"Does it ever stop, Claire? The wanting?\"\"You're mine, mo duinne,\" he said softly, pressing himself into my depths. \"Mine alone, now and forever. Mine, whether ye will it or no.\" I pulled against his grip, and sucked in my breath with a faint \"ah\" as he pressed even deeper.\"Aye, I mean to use ye hard, my Sassenach,\" he whispered. \"I want to own you, to possess you, body and soul.\" I struggled slightly and he pressed me down, hammering me, a solid, inexorable pounding that reached my womb with each stroke. \"I mean to make ye call me 'Master,\" Sassenach.\" His soft voice was a threat of revenge for the agonies of the last minutes. \"I mean to make you mine.\"and later...\"Oh, aye, Sassenach...I am your master...and you're mine. Seems I canna possess your soul without losing my own.\"With the gorgeous backdrop of Scotland, the descriptions alone, and the way the dialogue forces you to sink into the setting is worth the entire read.I'm beyond happy that I finally started this series. I'm trying to pace myself while reading the next stories, as I feel the greatness in ma bones. This book itself was so amazing, I can't imagine what's in store for me. There were a few hints...very, very tiny hints in this book of some strange happenings with regards to the time travel aspect. Things always get convoluted when it comes to the whole switching time thing. What came first, Claire in real time or Claire in 1743? What will she change by going back and messing around with her ancestors, or more so her husband's ancestors? I can't wait to find out."}, {"Review": "A special note to those who say my review stopped them from reading this book: No no no! Read it! I actually reread the whole series last summer and enjoyed it immensely. Just read it for what it is: ludicrous, well-written, humorous, delicious TRASH. Just don't expect it to be the most brilliant novel ever written and you'll be fine.How To Commit Adultery Without Being a Cheap Slutty Whore: A Q&A by Diana GabaldonQ: I love my husband but I'm feeling kind of restless. But adultery is wrong. So what do I do?A: Easy! Go back in time!Q: What do you mean, Ms. Gabaldon?A: If you go back in time, your husband hasn't been born yet. So you can have wild and crazy S&M sex with impunity.Q: But won't I still be married to him?A: Aren't you listening? He hasn't been BORN yet. So you aren't married! But if you are really being such a stickler, then just have someone force you to get married to someone else.Q: But, but, no one can force me to get married against my will!A: Okay, let me lay it out for you: You're really hot for this sexy warrior barbarian guy, right? I know this, because you stop thinking about your husband about 24 hours after you've been dropped in this guy's arms. So you get in this situation where some obscure tribal law insists you have to get married, make a little protest, sign some papers, and voila! Q: But that doesn't mean I have to sleep with him.A: Oh but you do, because some random dude insists that you have to. Don't worry, the sex will be great even though he's a 23 year old virgin. So you see, you HAVE to do it, so it's okay.Q; But isn't it a sin?A: Fine, find a priest at the end of the book to absolve you, whatever. And anyway, it's okay because your husband basically told you it was okay, right before you were whisked back in time. Seriously, go for it. When else will you get the chance? You've been married for years. You deserve a little hot and heavy barbarian action.Q: So what's this hot barbarian guy like?A: Well, watch out, because he loves to reminisce about how his dad used to beat him and how wonderful that was. And he really gets off on beating you, but it's just the once. Oh, and it seems that he wants you so badly he can't restrain from ramming you repeatedly with his male member while telling you how much he can't restrain himself and that gets seriously annoying after the twentieth time. But otherwise, it's all good.Q: Anything else I should be aware of?A: Surprise! Buttsex! But not for you, so it's okay.Oddly, I'm going to read the next one in the series. Because I'm bizarrely fascinated. It's like a train wreck.Edit 1:Someone in the comments said I should copy this into the review, so here you go:Plot SummaryClaire: I love my husband! I love sex!Frank: But it's okay if you have sex with someone else, in certain circumstances.Standing Stones: SUCK! Ha ha, you're in another time!The Anti-Frank: Ooooh, I think I will rape you.Claire: Eeek!Clansmen: Scots to the rescue! Here, meet Jamie and his manly manhood.Jamie: Och, aye, I'm a tough laddie. And I'm going to kill the Anti-Frank for beating the shit outta of me and raping my sister.Claire: Ooooh, he's cute. Hey, wasn't I married? Dougal: Ye have to marry the laddie to get away from the Anti-Frank.Claire: Okay.Dougal: And ye have to have sex wit' him.Claire: Mmmmm.... but.... well, okay.Jamie: I'm a virgin. Oooh, but I love sticking my manhood in ye. It's like a sacrament and all.Claire: I should get back to Frank, I think I will take this opportunity to run away... I guess... sort of... meh.The Anti-Frank: Ha ha! Found you. Now to rape you!Jamie: Och, that's my wee lassie. First I'm going to rescue her, then I'm going to beat her for disobeying me. And then I'm going to tell her about how me Da beat me and how much I liked it.Jealous wench: The village witch is looking for you.Claire: Okay!Villagers: She's a witch! Burn her!Jamie: Over my dead body!Claire: Honey, I have something to tell you. I'm not a witch but...Jamie: Ye must go back!Claire: I can't. I long for your manhood too much. It's a manhood like no other.The Anti-Frank: I too long for your manhood. I think I will bugger you right after I crush your hand with a hammer. But, I love you. You remind me of my dead brother. Here's some grease.Jamie: Ouch. Oooh, but that feels sort of good. Och, I'm so ashamed.Claire: We must rescue Jamie! Send in the cows!Jamie: OCH! Me hand! Just let me die!Claire: Never! Let's go to France.Jamie: Och, aye lassie, I feel much better now.Father Anselm: God says it's okay that you're a bigamist.Claire: Awesome. Time to use my foreknowledge of past events for good!Diana Gabaldon: The sequel will be 900 pages.Finis "}, {"Review": "Yes! I read this. I admit it! You caught me! Not only that... I loved it. It is a double sin I will likely have to one day repent for by reading piles of Dostoyevsky while I tear out my hair. In any case. Right, once again into the breach to defend myself!This book is incredibly long. It's just a fact. All of them are. But they go by so incredibly fast. By the time I got to the third one? I read it in three days. The pages just keep turning. I read at double speed I was so engrossed in the story. And I must admit that usually I hate time travel romances (... I mean.. not that I have any experience trying them before... never...) but this one is not even about that. Or if it is, it just makes it better. Also? There is a pile of historical information in this text. It deals with the Bonnie Prince Charlie uprising, and the rest of the books go on to deal with the American colonies and the Revolution by the time that they're done. It's not just about the romance. It's about medical treatment, what horrid things Scottish people ate, the reality of what people would have suffered through. Which is in some cases I think a direct indictment of the Scottish Highlander bodice-rippers in which everyone is shining and perfect and with awfully clean white teeth. I'd say this is more historical fiction than romance.But fine, let's deal with the romance. Yes. There is a lot of sex. However, I found it to also be deeply intimate and true, brutal, and real. Claire and Jamie, while apart, are deeply attractive and sympathetic characters with a good deal of nobilty about them. Throw them together in love? And they are beautifully frail, selfish, angry, flawed. I love that statement. I really find them so incredibly touching.So there. It's not just a romance novel. I stick my tongue out oh so maturely at the readers of this review."}, {"Review": "I remember my friend in college ( 1992ish ) coming out of her room holding a book to her chest and saying \" YOU HAVE TO READ THIS BOOK\". She said it was a time-travel, romance book set in post world war II Scotland and mid 18th century Scotland. Being as I was a 24 year old stoner and a 5th year college student, Lord of the Rings was more up my alley and I told her I'd \"put it on my list\"!! Fast forward to 2009, I'm on my usual Saturday morning sojourn to Barnes and Noble and I come across \"Outlander\" in the fiction section. As I am currently without any books to read and nothing catching my interest, I decide to finally give it a try.......... All I can say is \" I cannot believe I wasted almost 20 years of my life without reading this book!\" I won't go into the plot as it's already been covered, but, Holy Shit, this is one fantastic book! You've got adventure, drama, history, fantasy and romance. Easily the best romantic story line I've ever read and literally the most charismatic, appealing male lead I've seen. I've since read the whole series and love it even more today. If you've ever read a book and literally gotten so sucked in that you can't possibly read fast enough, then you know what I'm talking about.....Oh, and Jamie Fraser is a God! I've been an avid reader since I was 8 and Jamie is without a doubt my most beloved. Whomever your favorite male protagonist is I can promise you that no one compares to Jamie, no one! Read on, GR friends, this series is epic and you won't regret it!!!P.S. ( circa Fall-2013.....) I usually don't care if someone does not like a book that I love. Everyone's tastes are different. That being said..... I find if someone says something negative about Outlander I have an almost visceral reaction and want to stab them with a fork. So if you're a hater you better watch yourself........and seriously? What's wrong with you?"}, {"Review": "(Ok, first off, there are going to be minor spoilers/hints in this review…read at your own risk, although I’ll try not to reveal too much.)Outlander is a damn good book. Sure, the book has a blue fake leather cover, costs four bucks, and screams “spinning rack at the airport bookstore”. I approached the text with suspicion but found myself invested in the language and storyline within the first hundred pages. Here’s why:TEN GOOD THINGS ABOUT OUTLANDER1.\tThe characterizations of Jamie and Claire, along with a few other less important figures, are stellar. Ms. G. goes out of her way to create rich, deep personalities. If you thought Jamie was only going to be a caricature of romantic manhood, you’d be wrong. If you thought Claire was going to be a plucky damsel in distress, you’re wrong.2.\tAs I’ve said before, Ms. G. did her research. Her sense of detail, whether discussing plants or historical elements intrinsic to the plant, is admirable.3.\tThere are a few truly funny passages in the book. Claire’s interactions with men who try to tell her what to do, and her sharp tongue, are often quite entertaining.4.\tThere are a few very, um, stimulating parts in Outlander. You know what I mean, those of you who have the reached the cave scene and a few others earlier in the book.5.\tMs. G. displays strong insight in trust and relationships. The fights between Claire and Jamie seem real and at times harrowing. Jamie’s recovery near the end of the book and his description of his trials are nothing short of terrifying. She doesn’t spare her reader or the characters tough questions and emotional pain. Outlander is not an easy read.6.\tThe plot moves quickly. I found myself wanting to cheat and page ahead to find out what was going to happen. This book screams screenplay. Why is it not a movie?7.\tMs. G. writes well. I know that sounds trite, but she structures her sentences intelligently and reading rarely dragged. I knocked out 850 pages in three busy weeks but looked forward to picking up the book after the house grew quiet.8.\tJohn Randall and the witch (can’t remember her name, Ginnie or something) were both well-drawn. Randall in particular fascinated me. Villains are usually less complicated than Mr. Randall.9.\tThe “time travel” facet of the book, as Kirk pointed out, is handled very well and not overused in a sensationalistic manner.10.\tOutlander raises some fascinating ethical questions. I could see it as a good book club book. Should Claire get married? Did she put herself in unreasonable danger and some of her friends in danger in turn? What’s up with Randall? Those types of questions.THREE THINGS I THOUGHT OUTLANDER COULD DO BETTER1.\tThere were times when I felt Ms. G. was setting up the sequel a bit too much. You know when you’re watching a movie and you can tell some plot points aren’t going to get resolved until the next one? That feeling? I could feel that a couple times.2.\tThe prison and Lollybrook (sp?) scenes dragged a bit. Outlander really could have been two books.3.\tI wasn’t comfortable with some of the religious discussion during Jamie’s recovery. I’m not sure why Ms. G. put the priest in and the conversation in which Claire’s actions are rationalized. I didn’t think that was necessary.Ok, I have a question. Why is the quality of Outlander so controversial? It’s a flat-out good book. Is it because Outlander is aimed, it seems, primarily at women? Is it the huge, smelly pile of Fabio-covered romance novels tainting Ms. G.’s work? I swear, and I think I’ve said this before, market this book differently and you’ve got a respected hit on your hands rather than a less-respected novel that sold a zillion copies but appears to be of lesser quality than it is (thanks, fake leather cover!). Don’t be afraid of Outlander. It’s a solid adventure story with decent psychological insight and some good sex scenes. I doubt you’ll be disappointed. Take the risk. Don’t be a wuss. "}, {"Review": "I wanted to write a better review for this book to coincide with the release of the new TV series, where Jamie actually does look pretty hot...Back when I read this as a wee lass (okay, like, three years ago), there weren't quite as many interesting interpretations of the novel going on. I remember reading a bunch of reviews that either sold it as sophisticated, well-researched historical fiction, or a trashy kilt-wearing romance full of sex, violence and violent sex. In my opinion, neither is too far from the truth.I'm going to be honest: I never finished the series. And I'm starting to think that it's likely I never will. But this means nothing. I thoroughly enjoyed the first four books, which equates to several thousand pages of enjoyment. They are huge, time-consuming volumes, which is why starting one is such a huge commitment and why I think the remaining books may stay forever unread. But I still think Outlander, at least, is worth reading.This book is an entertaining, fast-paced romp through 1783 and has numerous close encounters with torture, sexual assault, witch trials and a whole lot of bloodshed. I'm not going to sell you some spiel about historical accuracy - I don't have a damn clue what Scotland was really like in the 18th century - but I can promise that it's hard to avoid being dragged in and devoured by this novel that is as gruesomely violent as it is exquisitely romantic.Oh, and about that... this book tells the story of Claire Randall who finds herself suddenly transported back a couple hundred years and lands amid the warfare and dangers of Scottish clan life. In these strange circumstances, she meets Jamie. Readers often end up completely divided over Jamie because, although he is sweet and lovable for the majority of the novel, there is one disturbing scene that saddens and enrages any sane 21st-Century reader, including me (though not sure about the sane).So I will spoil that one thing for you if you like (it's not a major spoiler)... (view spoiler)[there is one scene of domestic violence where Jamie beats Claire with a belt. I am in no way trying to say this act of violence was a good thing or acceptable; it was a sign of the kind of times people lived in back then (sucky times). But I was able to forgive Jamie when viewing the incident within the historical context. I know you're probably thinking \"how the fuck is that possible?\"... well, thing is, if Claire had been a man and she'd done what she did, she would have been flogged to within an inch of her life. As they didn't believe in doing that to women, her punishment was milder and had to be carried out by her husband. Believe me, I raged too. But I was still able to appreciate the rest of the novel. (hide spoiler)]I always found Gabaldon's characters delightfully complex and well-developed. Maybe not everyone feels the same about Claire and Jamie, but I think one of the signs of a great writer is when they can really test my love for their characters, make them do the worst kind of things and still have me angsting over whether or not they would be okay in the end. And I cared for Claire and Jamie. They're one of the few literary couples that I have completely fallen in love with and cared about.I only hope the TV series is just as good.Blog | Facebook | Twitter | Instagram | Youtube | Store"}, {"Review": "Contains SPOILERS ---I was lying in a hospital bed with my leg broken, and once the library trolley came for a round of 'books, anyone?', my hand was in the air in no time. Too late did the librarian notice the foreign literature on my bedside table and with a distraught expression try to recover 'Outlander';I said firmly: 'Oh no, Madam, I'll read that.'. Just enough time left for her to make up with a tome of controversial French literature on the genocide in Ruanda...But as I'd said: my first mission was 'Outlander'.Anyway, it could not be that bad, since I'd seen it sold by the local bookclub before.Ah yes, it could. After some forty pages, my jaw dropped in disbelief, after some hundred pages the case was as good as closed. But then, to tell the truth, Ms Gabaldon's warped morals kept me going.Because this brave woman has achieved what I never thought could be done: she has fabricated some catholically correct porn.Let me point that out:Claire, pretty much a Mary Jane (on the first few pages her lovely -we know it is, curly and unruly, though she claims it is 'not'- hair is described at length, and - did you know she can heal people? Oh yes, and - Did you know she has a spitfire personality, but everybody likes her in spite of that, well not the women, but then, they're either jealous or uptight or both...?) is by some zing of the time-space continuum catapulted back to the Scotland of yore, without her husband (goodlooking, sensitive, a savant), but never mind, she finds some replacement in her husband's *evil* ancestor (looks just like him), who's just as much into Claire, but unfortunately lacks the morals to please and guts to take it up with Ms. Spitfire.This proves to be helpful in forgetting husband#1, handy, since soon Claire arouses the ardour of a young, proud and good-looking Scotsman, Jamie, who, if a bit on the simple side, is as true as gold, not to mention built like....well yes... and just one twist of fate later, they find themselves exchanging vows. Note: The *good* never have extra-marital sex in this book, that's for the evil and sluggish.Surprise upon surprise, actually Jamie is a virgin on their wedding night, but with a few leads, quickly gets into his role: 'Matrimony turns into a sacrament what would otherwise be a sin', or so it goes.In the following, this sacrament is bestowed upon darling Claire with unnerving frequency, about every two pages, but it only gets really colourful if preceded by conjugal beating - Claire did something bad, Claire has to be punished, yes, she herself aknowledges this in the end, or attempts of strangers (or *evil* husband) to rape her.Yes, and of course, after Jamie has de facto been raped and tortured by *evil* husband. He's so desolate. Evil husband forced Jamie into actually enjoying the experience. This is not right, Jamie is straight, Jamie is disgusted by himself. But Claire does some sexual healing and re-enactment and 'pouf'! To top this off, in the end Claire learns from a monk that de facto both her marriages are considered valid by the church, since the one with Jamie precedes the one back in the 20th century.Most distasteful because of the 'wifebeating' episode and the fact that homosexuality is shown as an evil trait adherent to the *evil* guy (some young kid with a bible hung himself because of this, strange enough, female victims of rape are not half as suicidal in this book). So we repeat:-No sex without marriage.-Woman has to obey man. Otherwise she gets into trouble, and he has to punish her.-Homosexuals among the evil only.Any questions? had there been the possibility to bestow 0 stars on this concoction..., ah well."}, {"Review": "Reviewed for www.thcreviews.comI've read that Outlander was originally marketed as a romance novel because the publisher didn't know what else to do with it, but this book is no ordinary romance novel. It doesn't follow any typical romance formula and is a real genre bender that doesn't fit neatly into any one category. Outlander has a swoon-worthy hero and dozens of truly romantic scenes that should be sufficient to satisfy even the most discriminating romance reader, while it's time travel aspect and a few references to witches and fairies should be of interest to readers of fantasy and paranormal stories. At it's heart though Outlander is a historical novel rife with details of 18th century life in the Scottish Highlands both inside and outside a castle or large estate. It also recounts some of the events leading up to the Jacobite Pretender's Uprising of 1745. Diana Gabaldon is an amazing writer who delves deep into her character's lives and the history surrounding them, painting an extraordinary picture that truly transports the reader to another time and place.Claire is an incredibly strong heroine, who can sometimes be a bit brash and sassy, but deep down she is a kind and caring person at heart. She adapts amazingly well to a new time and place, much better than most people ever would if faced with the dilemma she was. Claire is a very intelligent woman who uses every ounce of knowledge at her disposal to reverse her predicament, while helping others, especially with their medical needs, and bringing a much needed modern perspective to ancient methods. She somehow finds the courage to made difficult choices in an era when choices were sometimes few or non-existent, especially for women, and to do what needs to be done, when it needs to be done. Claire is stubborn and persistent even in the face of nearly impossible odds. Best of all she is a pillar of strength to her beloved Jamie as much as he is to her, and she has a powerful underlying passion that matches his own for her.Jamie, in my opinion, is the best romantic hero ever to be penned by an author. He exhibits both physical and mental strength, as well as a strength of character, that go above and beyond any ordinary romantic hero. His word is his honor, and his commitment to that honor is moving beyond words. If only there were more men in reality who could be so easily trusted and taken at their word. Jamie shows a deep respect, not just for Claire, but for all the women with whom he comes in contact, a true gentleman in every sense of the word. On the outside, Jamie is tough as nails, enduring more physical pain than any one person should ever be expected to, while on the inside, he is kind, gentle and sensitive, often instinctively knowing things that others don't. He is thoroughly intelligent and well-educated and often beautifully poetic in his speech. He is lighthearted and self-deprecating, never taking himself too seriously. I loved the way he was always teasing Claire. Jamie is simply a wonderful character, a man who loves selflessly and with his whole being.There is much to enjoy about this book. Together, Jamie and Claire make a formidable couple, and it is obvious from the outset that they are soulmates. Their absolute trust in each other, basically from the moment they meet, is in and of itself, romance at it's finest. There are no contrived misunderstandings between them, only naked honesty, which brings an openness and vulnerability to both characters that is breathtaking. I love the way the author creates a beautiful friendship between these two characters before they end up at the altar and of course then become lovers. What's even better though is how that friendship continues to blossom and grow deeper and deeper even after they are married. The intimacy level of these two characters is something I rarely see in a novel, and most of it has little or nothing to do with sexual interludes. During the times when Jamie and Claire were apart even for short periods of time, I simply couldn't wait for them to be reunited, as the two of them together absolutely electrify the pages. All the secondary characters are extremely well-crafted and surprisingly well fleshed out, even those who play only minor parts. The setting is beautifully rendered as well, almost becoming a character unto itself. The time travel aspect adds an extended element of intrigue, and Ms. Gabaldon has certainly taken the time to think through the ramifications of such a feat if it were indeed possible. Every scene simply adds to the richness of detail in the book, and there is nothing that I felt was excess. The author's care in seamlessly weaving all of the elements together is evident all throughout the book.While there are many things to love about this story, there were a few events that bothered me just a bit. There was a scene in which Jamie beats Claire with his sword belt for disobedience. The scene in and of itself actually did not bother me much, because I fully understood his reasons for doing so and he later took a vow never to do it again. What did bother me was his admission that he enjoyed it. The admission was made in a fairly lighthearted manner. In light of that, I suppose it might have been meant as humorous, but perhaps it was too subtle for me to fully appreciate. Even so, I might not have thought much of it except for the fact that the villain in this story is a brutal sadist. For that reason, I found myself a bit annoyed at having the hero of the story exhibit even a hint of such a tendency. There were also a couple of scenes of what I would term rather intense and rough lovemaking, one of which began with Jamie behaving in a dominant manner, and neither of which were quite to my taste. They just seemed a bit out of character for Jamie, who up to this point, and following, was always a gentle and considerate though passionate lover. I will allow though for the fact that Jamie apologized for the first incident and admitted equality after the second. Finally, there was a scene in which Jamie related a prior incident with a secondary character in his youth, which by today's standards would have been nothing short of an act of child molestation against him, but which was treated rather casually by all involved. I wanted to reconcile this in a historical perspective, but as hard as I tried, I simply couldn't. I also feel compelled to warn sensitive readers that there is an incidence of brutal sexual violence near the end of the book. It is not played out in real-time, but instead is related a bit at a time through dialog and implication, but still is immensely palpable in the intensity of it's aftereffects on the psyche of the character who was the victim. I'm not usually overly squeamish about such things, but I have to admit to having some difficulty reading these passages. More than once, they brought tears to my eyes.In spite of the things I have mentioned though, Outlander is still by far one of the best books I have ever read. I have to give Ms. Gabaldon extra points for all of her attention to details. It is a joy to read such an intelligently-written and meticulously-researched novel that is so rich in detail. It went far beyond my expectations for a debut novel for any author. It even sparked my interest in learning more about the time and place that is depicted in it. Outlander is the type of book that is so engrossing and compelling that it makes one want to read straight through without ever putting it down, though it's epic length makes that somewhat unfeasible. This was my second reading of the book, and it certainly won't be my last. It has a earned a permanent place on my keeper shelf along with it's sequels Dragonfly in Amber, Voyager, Drums of Autumn, The Fiery Cross, and A Breath of Snow and Ashes all of which continue Jamie and Claire's story."}, {"Review": "This series changed my life. I cannot even begin to go into the details of how much I fell in love with the main characters: Claire Beauchamp and Jamie Fraser. The love story between these two beautifully written characters actually transcends time and logic. Their devotion, respect and soul-reaching love was one of beauty and even awe inspiring. Theirs is a long and beautiful historic journey together reaching limits and boundaries of both heartwarming depth and gut-wrenching tragedy. Not to be cryptic, it's just that this indescribable story is meant to be told through the words of the brilliant author, Diana Gabaldon. Fyi...this is an incredibly long series, with 7 books published, (most average 1,000 pages), with an 8th book due in 2014. It's a commitment to say the least, but very worth the absolute loveliness that is Gabaldon's brilliant and stunning love story. My words will never do this series justice."}, {"Review": "Here, I'm going to rewrite the scene that ruined this book for me.Jamie, some Highlander from the 1740's: Claire, you didn't listen to what I said. You disobeyed me, your husband. You risked everyone's lives and I'm going to punish you for your misbehaviour. Yes, I know the evil man abused you and nearly raped you. But that was your own fault. I love you, I really do, and I don't enjoy this, but people expect me to give you the punishment you deserve.Claire, an educated woman from the 1940's: Jamie, first of all, rape never is the victim's fault. And now you better listen, because I am going to say this just once. If you should ever raise your hand against me, if you ever hurt me, I will, and I promise this, I will make this marriage a living hell for you. From now, until the bitter end, I swear to God that you will regret it.Jamie, some Highlander from the 1740's who knows better than to disrespect his wife: You're right, Claire. I am very sorry. Forgive me.Yup. Since that is not what happened, it took all the fun out of it for me. I won't be able to continue this book and forget about what happened. I don't like the way this relationship is portrayed as a healthy one, or how Jamie is a man and husband that teenage girls and women swoon over. We should all know better than this.Find more of my books on Instagram"}, {"Review": "\n4.5 GREAT AWESOME COOL FANTASTIC BRILLIANTSTARS!\nYou can find the full review and more about this book on my blog!I am going to part this review in two sections(parts) because I don't want to give spoilers away but also want to share some of the scenes I really enjoyed with people who have also read the book so we can discuss together.So the first part of the review will be SPOILER FREE and everyone can read it,and the second part will be filled with spoilers so if you haven't read the book don't go there,unless you want to get spoiled.So without making this extremely long I will start with Part one:)\nPart 1(Spoiler free review)\nI will start with how I got into \"Outlander\":I was tumbling and searching the search engines,bored because I had already seen all the mid season finales of the shows I watch,so I had nothing to do.I was in a reading slump somehow,and in a mood for tv.It was nearly New Year,so there was no tv show or series that I wanted to watch currently airing.So I decided to search for some good series,and my eyes caught \"Outlander\".I did not know anything about the show nor book before then.So I read the synopsis and it was intriguing and it was a new show,so I decided to watch it.After like 3 minutes after I started watching the first episode,I was totally hung up to the show and watched all aired episodes on one night.Tomorrow,after like 3 or 4 hours of sleep that I had,I checked for the next episode,and that's when I had a heart attack.The new episode was going to be aired in April.And it was December then.Hopeless as I felt,I started searching for the book,because if you have seen the series you would know the cliffhanger of the last episode.So after 2 freaking weeks I finally got the book and started reading it.The first 300 pages were cool,but not interesting because I had seen the show and believe me the show follows the book perfectly,so it took me sometime to read those pages,but after that,the pages flew.You don't know how interesting this book gets after 200 pages.Because of the school and stuff,it took me 3 weeks to finish this book,and I am so glad I read it.Last night I read the last page and I am really looking forward to the next book.I am sorry if you found the part above uninteresting and unnecessary,but I really wanted to share that with you guys,and if you have a story of how you got into this book,please share with me in the comments.Okay so I promise no more babbling and here comes my thoughts on the book:Outlander is a time travel romance fantasy novel.This is the first book in the series with the same name \"Outlander\".It is about a woman called Claire Randall who is in her second honeymoon with her husband in Highlands,in Scotland.She is a nurse and her husband is a historian I believe,something like this.The year is 1945,after the world war II and it was the first time that Claire and her husband Randall are together after the war.Their relationship has had it's ups and down over the years,but they are pretty devoted to each other and everything seems fine.One day,as Claire goes to ancient circles,a place really old and interesting,through the standing stone,she travels back in time to 1743.Now she is rounded with lairds and people who she doesn't know and has to live a style of life she never experienced before.There she meets Jamie,a young lad,who she shares a long journey with.Now she has to decide somehow between the life here and the life before,and what will she choose?This book seriously has some pretty great characters.Starting with Claire who is the main character,a very intelligent and wise woman,who stands for what she believes.She goes through so much in this story and she is well developed.In the other hand we have Jamie,also one of the main characters,a strong and also wise man.You can't imagine what a life he had,and he's still standing.And maybe it is just be but for a person in 1700s Jamie has a pretty developed sense of humor.Like there were some moments I laughed out loud.Jenny also was a favorite of mine.Beside some scenes,which I am going to mention in the part two of this review,she was a solid character,and I liked that.So you know there is not much happening or going on on this book.You may be surprised because this is nearly 900 pages,they are only a few big moments on this book,but it is not boring.And that because of the writing style.This book contains a lot of harsh and disgusting moments,but there is also peace,cheerful moments that are really good.____________________________________________\n\n“Don't be afraid. There's the two of us now.” \n\n____________________________________________Now I am going to jump on the part two of this review so if you don't want to get spoiled,skip this part to the end where I am going to give my final thoughts about this book.\nPart 2\nOkay fellow readers,now we are really talking freely.First I am going to mention a list of things I liked and didn't in this book.What I liked:-Geillis Duncan-Geillis Duncan's talking-Geillis Duncan's everything-The hot water place in the end of the book-Jamie's jokes-Murtagh-Geillis Duncan-Ian Murray-Geillis DuncanWhat I didn't like:-Jonathan Randall-Jonathan Randall-Jonathan Randall-Jonathan Randall-Jonathan Randall-Jonathan Randall-Jonathan Randall-Jonathan Randall-Jonathan RandallSeriously I have never hated a character this much.Especially the scene with the Jamie and the dungeon.It was one of the worst experienced I have ever read about,truly disgusting.This characters,for me,does not have a good quality,one of the worst characters I have ever read about.And to be honest,I was surprised how Jamie let that happen.He knew that he was going to die tomorrow and Claire was already out,so why did he let him do that,he could have killed him,and he would have nothing to loose.____________________________________________\n\n“I can bear pain myself, he said softly, but I couldna bear yours. That would take more strength than I have.” \n\n____________________________________________One of the best scenes in the book,or let's say the best joke of the book,for me,was when Jamie went out in the end,and Claire was searching for him,and she found him,and she yelled at him saying that you could have been attacked by a bear,and it was Winter so Jamie told her that Bears sleep at Winter.This doesn't really sound funny explaining it,but I laughed so much at this,like it was a burn for Claire.____________________________________________\n\n“Ye are Blood of my Blood, and Bone of my Bone,I give ye my Body, that we Two might be One.I give ye my Spirit, 'til our Life shall be Done.” \n\n____________________________________________Also the part with Gellis Duncan was awesome,when she admitted that she was a witch just to save Claire and Jamie.Gellis was my favorite character of the book,and I was so angry when she dies.____________________________________________\n\n“For where all love is, the speaking is unnecessary” \n\n____________________________________________Parts I did not like were the one with Jenny giving birth.It was so awkward to read,maybe for me,but it felt like I was reading something forbidden,I don't know why.And also the part with Jenny playing with her breast,spilling the milk out,I didn't was to know that nipple trick,and it was awkward also.\nThe part for everyone:\nI highly recommend this book to every reader out there,if you enjoy fantasy and time travel I think this is the best choice.Pick it up and don't be scared of the pages.Pick it up!*Pictures from the review are not mine, I took them mostly from Google images or Tumblr*"}, {"Review": "Man, after the pitch I've heard about this book from basically every (female) reader I've ever met, I was expecting something that was NOT THIS. Fairly offensive, needlessly graphic, and smutty in that skeevy way, rather than the hot way. At one point, Jamie punishes Claire for disobeying him by literally spanking her - which was treated as perfectly understandable, and was quickly dismissed. I know that I cringed throughout the entire thing, and found it hard to believe that any relatively modern woman would have put up with it, especially as Claire is supposed to be extremely well educated, capable and professional. I honestly find it hard to believe that there's five more books of this, and that people read them.That said, I have read worse romance books, but the fact that Gabaldon dragged the novel out across nearly 900 pages just makes me cranky. UGH."}, {"Review": "Outlander is not a book for everyone. I'll put that right out there. If you think you can stomach extreme sexual violence as well as themes of sadism then go ahead. If you can understand good characters doing things in their historical context that would be seen as abuse now, then give it a try.You won't be disappointed.Gabaldon has finely crafted a novel that is radically different to the stereotype. This is no average love story. Her research is extensive and flawless; bringing to life a world that is rich and dynamic in detail and character.Her prose a beautiful and well constructed and the characters. Where do I even start with the characters? They have depth. They're lovable. They're real. The problem with this book lies in two aspects:It's pacing. It's fantastic, non-stop drama and action right up to the last 200 pages or so where it trickles down to a grinding halt. The other problem with it is that many people are going to be uncomfortable with some of the things that happen in the book. Remembering the time difference and the culture that the male protagonist comes from is often hard when we judge his actions by today's standards.But to readers who can over look these things, I highly recommend it as a book that is both incredibly well written, enjoyable and addictive."}, {"Review": "Ok, so historical romance isn't really my thing. I read this book because I got tipsy after a concert and went to the bookstore and bought a ton of \"Highland-hunk\" romance novels on whim and Twittered about it, so I had to read them all. Ugh. So, I read 4 other books that were hideously bad, and then this one was highly recommended to me by many on Twitter/Facebook as the cream of the crop. I was dubious.I have to say, this is a LOVELY book. I'm not CRAZY motivated to read the rest of the series (there are 5) but it had fantastic characters, beautifully researched, a romance that was not predictable, exciting plot and wonderful main character. Again, it's not exactly my cup of tea, but the quality of storytelling is undeniable. I do recommend this book wholeheartedly, it's akin to \"Gone With the Wind\", unapologetically epic, sweeping and dramatic. "}, {"Review": "I figured I would love the book since I loved the first two seasons of the show. Although, I have many more books to go =) I did get the beautiful bound (20th anniversary edition) of the book because it is beautiful! Here's a little picture of the book and some of my stuff around it to make it even more pretty. The book looks smaller in the picture than it is so I don't know. <-- images on your screen are smaller than they appear. I love Jamie and Claire! I just want them to be together and that's the end of it! Unless of course I can have Jamie for my own, but I digress! ♥I will say that I DID skim over the torture/rape scenes with Jamie or other things that made me cringe in the show or book. That's just the way it's going to be with me. Also, I might like to add that there is a red hot poker waiting on Captain Jack Randall. Oh, the glory of wiping him from the world, rapist of children (boys) and men. He can't seem to get it . . . anyway . . . . I love everyone in the Mackenzie crew. I mean, yes they are some stupid stuff they do but you start to love certain ones. Murtagh is my favorite! He's just so damn cool! I had put off reading this book for a very long time. I just wasn't sure I would be able to read about the graphic scenes of rape and torture. I always knew I could skim it but still kept waiting. I didn't think I would like any of it really. Then, I got the dvd's from the library and then I bought the blu-rays of seasons 1 & 2 and then I bought the big ole book and the little paperback book. Then my friend bought me the rest of them and that's my history =) I fell right in love and hate and disgust and more hate and more love and what the, moments. I had read some reviews in the past that said the books have too much history or descriptions but remarkably enough, I didn't feel that way. I might later on, who really knows. I just loved reading about it all. You just never know until you try. I loved when Jamie and Claire go to Lallybroch and spend time with Jamie's sister, Jenny and husband and kids. I'm glad Jamie pulled his head out of his butt long enough to get the scoop on Jenny. And to FINALLY be able to see her and get over it. I mean even if what he thought happened, really happened, that's your sister so deal with it! Of course then we start getting to the part with Jamie and Randall. I must say it was easier to skim over the bad parts in the book than in the show. In the show they just jump out at you and you have to try not to see it. In the book you're going at your own pace so that was better! Anyway, I loved it! So there you have it =) Also, I'm thinking I should have just added Jamie gifs to get most of my feelings across =) \n\n'Ye are Blood of my Blood, and Bone of my Bone.I give ye my Body, that we Two might be One.I give ye my Spirit, 'til our Life shall be Done.'\n\nHere's a youtube link that a nice person added in my Outlander group. I love it so much! ❤The Skye Boat SongMY BLOG: Melissa Martin's Reading List"}, {"Review": "In late 2015, I saw a book in Barnes and Noble (Written in my Own Heart's Blood) by Diana Gabaldon and thought \"This sounds amazing.\" I picked it up (and it was nearly 1000 pages in harcover) and suddenly realized it was the most recent book in a series with books that were all practically a thousand pages long. I can't read a series book without doing it in order, so I put it back on the shelf and said \"Another time.\"Fast-Forward to 2016...I sign up for the 2016 Reading challenge: 52 books in a year (1 a week). I can do it. Great start in January. Epic fail in February with 0 additions. Get myself started again in March. Epic fail in April with 0 additions. Epic fail in May with 0 additions.OK, I'm not one to easily fail so I get myself back on track in June. June is going well, I'm averaging about 1 book every 4 to 5 days so that I can catch up by September. I finish reading a book in late June and realize I don't have anything new to read... I head downstairs to my building's small library and peruse the shelves (about 1000 books to choose from).I see Outlander. I decide to buckle down and read the nearly 1000 page paperback version. I can do this. I can't get it done in a week. It took a little longer as I added in a last minute family visit / trip where I didn't read for about 4 days... (but still had a great time!)And I loved it! I suspend my disbelief at some things and at the amount of necessary repeated violence... then think perhaps I am a little whiny given what these characters go through without complaining. Could I take that much blood loss and hits? Vanity would probably kick in and I'd likely not make it through.I am excited to read the series, but I need to catch up on my 2016 Reading Challenge before I take on another 1000 page book. Target: November when I hope to be almost ahead of where I should be with my 44 of 52 books at that point.Read it. It's part historical fiction, part fantasy (the whole time portal thing), part romance (without too much focus on it) and part pure character study."}, {"Review": "Myriad problems with this one... but several surprising & multifaceted splendors as well!This is an unexpected tome that merges speculative fantasy with true historical events. It does something remarkable in having a target audience that vacillates between YA & the nonFiction prone; in other words, if you are a READER, this one is for you (it's got something for Everyone!).The sex gets racier and racier, but the adventure starts growing tepid. The antagonist is for sure memorable as a, what? serial rapist. But oh, dang, how both women & men, all sexes, wish to have a dual life!I've since ordered the sequel. These books have something Thorn Birds-like in their literary audaciousness. Outlander: it's actually pretty hard to hate!"}, {"Review": "Okay, there are tons of reviews on this book, and I can't add too much to the review ether that hasn't already been said. But, I promised to write a review for every book I read, so I'll do this in an different kind of way. How about a Q&A session about this book?Question and Answer Session With Danielle Regarding Outlander by Diana Gabaldon1. So, you finally read it. How does it feel to read this 850 page magnum opus?I feel a profound sense of accomplishment. I'm glad that I 'womaned-up' and faced this super-duper long book. This is the longest book I've ever read (other than the Bible, which I've read in parts, although I haven't made it through all the way yet). I'm verra, verra glad I chose this book for a challenge, thus had to read it in a certain time period. I might have put it off longer, and missed the marvelous book that it was.2.What do you think of Jamie Fraser?Are there words to describe him? He is just fantastic. I can't imagine how D. Gabaldon created such a wonderful, wonderful character. I have standards for my \"heroes to die for\", and he meets all those standards. What a beautiful, wonderful man! Claire is a lucky woman.3. Was this a difficult read?I have to say that it wasn't. I did have to apply myself. This was more because I don't care for long books. I like to read shorter books so I can move onto the next book faster. This book felt like it could be 2 1/2 books. However, it wasn't boring. It was interesting seeing life back then, and how Claire, who is from the 20th century, reacted to it. I love books about Scotland and Scottish people. Their way of life sort of resonates with me. And the characters were very vivid and fascinating. And the romance was to die for. And Jamie is just awesome!!!4. What was your favorite aspect of this book?Jamie Fraser! My second favorite aspect for the powerful love story between Claire and Jamie. They are definitely a couple that was meant to be together. I thought that the fact that she was married in the future would bother me, but it didn't. I thought of Frank as being her past life, and although she truly loved Frank, he wasn't her soulmate like Jamie was (can I write a review without using that 'S' word? Apparently not). I so wanted her to stay with Jamie. There was no contest. And Claire was used to rustic living, since she'd grown up on digs with her uncle. I also liked seeing Claire do her medical treatments (I love medicine). I also liked the adventure and the fighting. 5. What didn't you like about this book?Well, I hated Randall, but I was supposed to! He was one sick puppy! I can't imagine how Claire felt to meet her husband's ancestor, and to know what a truly awful man he was. I hated some of the situations that Jamie and Claire faced and what they had to do. It made me sad that one evil man had caused this.6. Would you recommend this book to other readers?Absolutely, providing that one was committed to reading a book that is nearly 900 pages, and one enjoys historical books. No book is for all tastes, but I think those who might be interested in a story with a fantastic hero like Jamie, and an outstanding heroine like Claire, and those who are crazy about Scottish subject matter, should read it.7.Has the bar been raised for Scottish Highlander romance?Most definitely. I try not to compare books, because, well it isn't fair. But, now that I've read Outlander, I know in the back of my mind, an image of Jamie will crop up when I read future Highlander books. 8. Were parts of this book hard to read?Oh, there was a couple of parts that made me wince. One part nearly broke my heart, but Claire really came through for Jamie, and it made me almost cry. It was beautifully done. I tend to read romance books for the hero moreso than the heroine, but I love a great heroine, and Claire is definitely that. 9.Okay, what if I don't like romance, and I think it's sappy nonsense. Can I still enjoy this book?Well, I think this might convert you, if you don't enjoy romance. Barring that, I still think you'd enjoy this book. Not only is it a great romance, it's great historical fiction. And the time travel element, although not a huge part, is very intriguing. So, give it a try.10.Danielle, what are you going to do, now that you've read Outlander?Go to Disney World???? Just kidding! Honestly, I'm going to continue my reading adventures in my massive, ever-growing tbr pile, and I know eventually I will be drawn back to this series. But, I think I'll read some shorter books for a wee bit. I might take a break from Scottish Highlander romance for a while. I don't want to be disappointed because the book isn't Outlander.11.It's about time to wrap this up. Anything you want to add?Just a few things: The praise for Jamie Fraser is well-deserved. Ms. Gabaldon wrote a fantastic book, and I'm very glad I read it. I can now pat myself on the back, since I read this book. I'll consider it my War and Peace, in fact. I hope that those who are hesistant to read this book take the plunge. It was worth the time spent on it."}, {"Review": "This is actually a very difficult book for me to rate. Certain aspects of it were very good. Others, I didn't care for at all. I suppose I can say that as a whole I liked it \"okay\". Somewhere between a 2 and a 3, but I'm going to round down due to the seriousness of my dislikes. What worked for me: - Attention to detail (more on that below, however). It was very easy for me to visualize scenes and actions.  - In general, the premise for the novel was interesting. And some parts of it were very exciting to read with lots of good drama.  - Claire was in some ways a decently strong protagonist. I liked her smart mouth and I liked the way she pushed back against her male counterparts. For the most part, I liked her.  - I like Jamie quite a bit (more than that below, however). I found him to be a very likable character and well fleshed out. He was a nice blend of good traits and bad, and he had a lot of depth to him. I'll say that I didn't find him quite as swoony as some do, but I did like him a lot. I loved the way he loved Claire. I bought it - the chemistry and his care for her. And there were more than a few scenes where their relationship was very touching. - I liked the tie-ins with history. The author seemed to have put quite a bit of research into this. It felt fairly authentic, at least as far as books such as this go.  - Some of the secondaries were really well done.  - As a whole, the writing was better than average. What didn't work for me: - First, this book needed a serious round of editing. I like long books and as I mentioned above, I liked the author's attention to detail. But this was long out of mostly author self indulgence. There were several scenes that just went on and on and on, going into far more detail than necessary, to the point of major plot distraction. And then other scenes really added nothing at all. Despite what the length of this novel would suggest, the plot was pretty simple. It was just repetitive and long-winded. I'd say a solid 1/3 of it could have been whacked and the story wouldn't have suffered at all.  - Secondly, the abundence of sexual violence - rape, assault, etc - was a big turn off for me. Or really, not the existance of it in the book, but how the author chose to utilize it over and over as plot devices. I do get that rape and such was common historically. I'm not objecting to the author using it once or even twice. That's realistic. But EVERY plot point in this book was driven by it. Over and over, either against Claire (she was *almost* raped something like 5-6+ times... and was saved each time) or Jamie (who was stalked all over bloody Scotland by a madman sadistic rapist and who was ultimately violently brutalized to what... again, save Claire.)More than anything, I just think it was... lazy and probably a little careless to repeatedly use it as the driver for the plot. - I wasn't keen on the \"beating scene\". Again, I get that it's historically believable and I don't so much object to the beating itself so much as the fact that Jamie enjoyed it. That seemed OOC to me based on everything else he'd shown, and frankly, that took him down a few notches as a character for me. Really, like the amount of sexual violence, the level of general person on person violence/abuse was a little eh for me, too. Yes, people beat each other a lot back in those days, sometimes for very good reasons (i.e. parental discipline). But the author spent A LOT of time discussing it and focusing on it, throughout the entire novel. It wasn't clear to me what exactly she was trying to accomplish in doing so either. In other words, exactly what theme she was going for? Half the time it felt like she was trying to justify abuse by saying, \"Oh, it's just the times.\"ETA: Also, I forgot to mention this when I originally posted this review, but I got rather tired of the continual shooting/raping/beating the hell out of Jamie. More than once, I was like, \"Okay, that's enough. We get that he's tough and noble and has character. You can stop torturing him now. Move on to someone else.\" Like other things, I found it overly repetitive.  - I think Randall was overdone as a villain. He came off as almost a caricature.  - Lastly, and while it probably matters not to most readers (especially those reading for just the romance aspects), but it does matter to me, her time travel logic needed some major help. It's difficult to create a believable time traveling story in the first place, but the author didn't spend any real time making her version seem feasible. If you really think about where she was going with Geilie's date of time travel (1967) versus Claire's (1945) and the fact that Geilie was already in the past when Claire arrived, it leads you to the conclusion that the author's version of time travel is based on some notion that all time exists in the same moment rather than in a line or wave or various other versions some sci fi authors use. And that paradox can take you down a very deep and very confusing rabbit hole. Really, if she'd have left out the bit about Geilie coming from the future, it would have worked better. That she did have it there just made things more complicated than they needed to be. So... in conclusion, I suppose, as I said above, I liked it \"okay\". Some parts were quite enjoyable. Others made me want to throw my kindle (I literally did once). I'm definitely not in love with it like I know many are. But it was still an overall entertaining read. Also, as an aside, after having read some long, detailed summaries of the subsequent novels in this series, I've decided I won't be continuing. The later novels' plots are far too convoluted and really just not that interesting for me. I think I'll just pretend that it all ends with this book and be happy enough."}, {"Review": "This was a tough one to rate. Of the 630 pages, about 200 of them were not great, weird, too much, 1 to 2 stars. A couple of times I wondered why I was still reading and didn't want to go on.But, the other 430 were very interesting and well written. The premise of the story is fascinating and left me pondering a lot of what ifs?. It was very deeply researched historical fiction and I am a fan of decent historical fiction. If the 200 pages or so that I didn't care for were edited out or abbreviated, I may have given it 5 stars.To sum it up - the author seems to have an interest in historical fiction, gratuitous sex, rape/S&M fantasies, and homo-erotic torture. The first of those she is good at. The second was not too bad at first, but after about 100 straight pages of it it got to be a bit much. The last two were a bit disturbing.If you have an interest historical fiction and a high tolerance for questionable sex, give it a shot!"}, {"Review": "\nThe year is 1945. Claire Randall, a former combat nurse, is back from the war and reunited with her husband on a second honeymoon--when she walks through a standing stone in one of the ancient stone circles that dot the British Isles. Suddenly she is a Sassenach--an \"outlander\"--in a Scotland torn by war and raiding Highland clans in the year of Our Lord...1743.\nFirst off, I am not big on “Time-travel” books but this has been on my kindle forever and with the new TV series coming out in a month or so I thought I should read it.I think most of you know the premise of the book. Claire is on her second honeymoon in Inverness with her husband, Frank and literally “time-travels” back 200 years to the 1700s.One of the first people she meets there is Captain Randall. Will not dwell on him at the moment.\n”I am, madam, Jonathan Randall, Esquire, Captain of His Majesty’s Eighth Dragoons.”\nI feel I have already done a review with all the updates I did with this book. Testament to the fact that I LOVE a book – I cannot stop updating. And highlighting. I have been lucky enough to visit Bonnie Scotland on two occasions and it is truly a beautiful place. I am hoping my son will start at Edinburgh University in September and then I will have another excuse to visit there.Jamie, Jamie, Jamie, what to say about Jamie? I know we all have our book boyfriends and read some “swoon-worthy” lines from our heros, but Jamie Fraser tops them all. I mean EVERYTHING he said, everything was sooooo beautiful and romantic. I absolultely loved him.There is one scene in particular. (view spoiler)[The wedding night. OMG, I fell in love with him then. “Does it bother you that I’m not a virgin?\"He hesitated a moment before answering.“Well, no”, he said slowly, “so long as it desna bother you that I am.”... (hide spoiler)] I literally sighed for a full five minutes.\n”Oh, its Fraser. James Alexander Malcolm MacKenzie Fraser.”\n\n“You're tearin' my guts out, Claire.” \n\n“All right you bloody Scottish bastard, lets see how stubborn you really are.” \nI must say, being Irish, I sort of have an affinity with the Scots and their \"oppression\" under British rule. We are all friends now, thank God. Queen Elizabeth had a fantastic time in Ireland a year or so ago. I wish the Scottish people well in their forthcoming referendum for independence. Those bloody Brits still have six of our counties!!! C'mon, you know I have to get a dig in someplace girls!\n“Where are we going?” We were headed away from the house, toward the cluster of sheds in the shadow of the elm grove.“To find a haystack.”\n\n“Then let amorous kisses dwell On our lips, begin and tell A Thousand and a Hundred score A Hundred, and a Thousand more.” \n\n“When I asked my Da how ye knew which was the right woman, he told me when the time came, I’d have no doubt. And I didn’t. When I woke in the dark under that tree on the road to Leoch, with you sitting on my chest, cursing me for bleeding to death, I said to myself, ‘Jamie Fraser, for all ye canna see what she looks like, and for all she weighs as much as a good draft horse, this is the woman.’ ”I started toward him, and he backed away, talking rapidly. “I said to myself, ‘She’s mended ye twice in as many hours, me lad; life amongst the MacKenzies being what it is, it might be as well to wed a woman as can stanch a wound and set broken bones.’ And I said to myself, ‘Jamie, lad, if her touch feels so bonny on your collarbone, imagine what it might feel like lower down…’ ”He dodged around a chair. “Of course, I thought it might ha’ just been the effects of spending four months in a monastery, without benefit of female companionship, but then that ride through the dark together”—he paused to sigh theatrically[…]”\nI will say that the first part of the book was tough going. I nearly gave up on it. I do love descriptive prose but I swear to god if I had to read about another gorse bush or herb I was going to scream. Eventually we get to about 25% and things take off. I loved it after that.I feel I could wax lyrical about this book forever but I fear I best wrap it up soon and head back to the world of Jamie and Claire.\n“Ye werena the first lass I kissed,” he said softly. “But I swear you’ll be the last.” And he bent his head to my upturned face.” \nI am lucky to be able to post so many beautiful pictures. Those of you who read it a while back did not have that opportunity. I really hope that the TV series will be shown all over the world. It deserves to be seen. The casting for Jamie seems spot on.\n“I can bear pain myself, he said softly, but I couldna bear yours. That would take more strength than I have.”\n\n“Ye are Blood of my Blood, and Bone of my Bone,I give ye my Body, that we Two might be One.I give ye my Spirit, 'til our Life shall be Done.”\nTo be honest, the language did not bother me. I love Historicals so I just went with it. Also I could understand some of the Gaelic as it is quite similar to Irish, which I speak.\n“Don't be afraid. There's the two of us now.”\nThere are a couple of scenes in this book that might “annoy”, “upset” some people. But I often think to myself we have to suspend the disbelief a little bit when we read fiction. It is what it is… fiction. It is not a true story. This was set in the 18th century. Men were men and women were to know their place. Do I agree with that sentiment? No, absolutely not. As for Black Jack Randall, seriously that man was a total sadistic bastard. I hated him, hated him.\n“Does it ever stop? The wanting you?\" \"Even when I've just left ye. I want you so much my chest feels tight and my fingers ache with wanting to touch ye again.”\n\n“You’re mine, mo duinne,” he said softly, pressing himself into my depths. “Mine alone, now and forever. Mine, whether ye will it or no.” I pulled against his grip, and sucked in my breath with a faint “ah” as he pressed even deeper. “Aye, I mean to use ye hard, my Sassenach,” he whispered. “I want to own you, to possess you, body and soul.” I struggled slightly and he pressed me down, hammering me, a solid, inexorable pounding that reached my womb with each stroke. “I mean to make ye call me ‘Master,’ Sassenach.” His soft voice was a threat of revenge for the agonies of the last minutes. “I mean to make you mine.” \nOk, I better shut up or I could be here all night. This is truly an epic read and if you have the patience I think you should read it. I said to myself I would take a break now and not start the second one for a while, but I couldna. I had ta start on Dragonfly in Amber and go back to Jamie and Claire and their adventure.\n“It's a good country for myths. Things seem to take root here.” \n"}, {"Review": "Too bad here isn't a rating stronger than \"didn't like\" because I hated this book. In fact, I read the entire thing just so that someone couldn't talk me out of hating it by saying \"Oh, it gets better at the end\" or \"you really needed to read the whole thing to appreciate it\". This book isn't about Scotland or time travel, it's about Jamie and Claire having sex in different locations and positions. Throw in a little wife beating, rape and repeated torture and you've got yourself a toned-down Marquis de Sade. It made me want to take a shower. More later.........."}, {"Review": "This book is featured on this week's Shabby Sunday @ https://readrantrockandroll.com/2017/...\nClaire Randall is a nurse living in Scotland with Frank, her husband, just after the end of World War II. Frank is absorbed in studying his family tree and tracking one of his ancestors named “Black Jack” Randall. Claire has an interest in Botany and studies plants along with their healing factors.One day, Claire comes across a stone circle called Craigh na Dun.\nWhile there, she discovers a plant and can’t stop thinking about it. She comes back another day to collect the plant near the stones and hears one of the stones scream. One after another, they all scream. Something strange is happening and Claire wakes up in Scotland, but in 1743. She witnesses men in kilts and a man that looks like Frank but isn’t. Quickly, Claire is taken away by a band of Scotsmen and this is where she meets Jamie, a man she’ll soon have to marry if she wants to survive.\nThis was an outstanding book that kept me entertained throughout. I was completely immersed in this story from start to finish. I loved Claire and Jamie’s smart, yet stubborn characters and enjoyed the formation of their relationship. All the characters had good development with some that I loved and some that I hated, but most were unforgettable. The pacing was perfect and never once did I want to stop reading, except for the few parts I found a tad difficult to read.Some consider this a romance novel, but I think of it more as historical fiction. It does have a good amount of romance, but so much more than that. I’m not a history buff, but it seems that Diana Gabaldon has really done her research with this series and has spun a tale that can’t be forgotten.My rating on this one is 5-stars."}], "Genre": "Romance", "ID": "10964", "Desc": ""}