{"Name": "The Notebook", "Image": "https://images.gr-assets.com/books/1483183484l/33648131.jpg", "Reviews": [{"Review": "I love the movie, but if you think that was sappy, do not pick up this book. I heard Nicholas Sparks had a knack for sap, but I almost drowned in it and felt no spark at all. The book was so frustratingly simple and obvious and laid out. The dialoque droned. I'll come back and add a real quote, but it was something like this:\"Do you want to stay for dinner?\" he asked, wondering what she would say.\"Okay,\" she said, and than asked, \"What should we eat?\"\"Crabs,\" he said. She never had crabs. They began to cook the crabs... etc. There is a \"quiver in his loins\" when he sees her in her transparent white dress as well. Oh and \"the two become one\" when they make love.And then she is forced to leave when her fiance pays a surprise visit to down and she struggles to drive through her tears, but fights through the blurry vision because she is a strong woman like her mother... lalalalala. Could the book be any more contrived and gimicky? Who rated this above a one? And please enlighten me.Gag, gag, awful writing, what a frustrating bore. He left nothing to the imagination. Unless you like getting dumber by the minute, don't pick this one up. "}, {"Review": "I’m just gonna say it: I expected less.Not being inexperienced in the reading of Nicholas Sparks novels, I somewhat knew this book would contain tons and tons of corny and cheesy replies and gestures. But NOT in every. single. paragraph. I’m not one to discard the idea of soul mates, after all the young adult readings that I have done, but when something is too wonderful and perfect, it’s more annoying than cute. So there is too much of that.Also, the plot is so weirdly shaped. It starts with Noah as an elderly, in the first person, then it continues in the 3rd person with Noah in his thirties, and it finally ends with elderly Noah in the first person again. I know why the author did that and it’s pretty ingenious when you globally think about it… but reading it is a different story. The 3rd person part of the story is cut at the most decisive moment and that is utterly outraging. Moreover, when Noah sees Allie again, she is engaged to a super rich attorney. That super rich attorney, to whom I forgot the name of, is madly stressed out when he discovers that Allie has been with Noah the whole time she claimed to needing time to make some purchases in a specific city. So what does he do? He runs to her and tries to win her back! But does he ever turn against Noah? Bah! Noah is an angel, how can anyone despise him?And finally, the mother. Allie’s mother. She disapproved of them as a couple when they were in their teen years, but now more than a dozen years later she doesn’t even blink when she learns Allie has gone back to Noah and never tries to talk Allie into going back to her super rich attorney. So not realistic. Basically, this book is made of rainbows and sunshine. Not my favorite combination. I expected less of that.Sigh. "}, {"Review": "I read this book on a train from Italy to somewhere else in Europe after graduating from college. I was unfortunate enough to be forced to buy it because there were no other English Language novels to choose from.I know this is a beloved book, by a beloved author, but if I could give it any sort of negative rating, I would. The \"Gag me with a spoon\" category is almost too kind. My apologies to any one who likes Nicholas Sparks - if you're able to find the genius in his writing, more power to you!When I heard the plot - an old man is reliving his personal history with the love of his life as she suffers from dementia - I had much hope for a touching story. Esh - I was sorely disappointed.My favorite memory is reading the scene between the two young (and I'm assuming attractive) lovers...they are in a boat on a lake, romantic setting, yes? It starts to rain. She's wearing a white dress. \"We have to get you inside where it's warm...better remove those wet clothes, you'll catch a cold...\" Commence eye-rolling now.After reading the book, I passed it on to my now husband, who was also on the train. Keep in mind, there were no other English options! He starts to comment, \"Oh, they're on the lake in a boat...okay, it's raining...oh geeze, why do you girls read this crap?\"And that's what I think about this book...why would anyone read this (unless there were no other choices)?!?"}, {"Review": "This is the worst book I have EVER READ. And the fact that this guy is so popular continues to astound me. I would give it less than zero stars if I could. My sister tricked me into reading this book, and I wish I could gain that time back into my life so I could read a different book. This book teaches you that ANYONE could write a bestseller. Just be sappy and corny and have one big-ass deus ex machina and you're all set for stardom. As you can tell, I don't read shit that I think I won't like. I have rated many books as a 4 or 5, and this book pisses me off to no end because it had the audacity to waste my time as a reader. "}, {"Review": "Have you ever come across something so undeniably cute that you feel like you may be crushed by the weight of squee that’s about to explode from you chest.Kind of like when you see this?That’s what reading The Notebook was like. The romantic tone of The Notebook was both its greatest asset and biggest downfall. Nobody wants to be crushed by squee anymore than they want to drown in their own tears and The Notebook wants to destroy you. Never doubt that. Whether it’s leaching your bodily liquids out of you until you resemble The Ice Man or boring you to death. Really, those are the only two options you’ve got with this book. Who can stand to see something as cute as that kitten up there all day every day? You need something not so cute to break up the boredom. Similarly, in The Notebook, the long, romantic verses filled with poetry and stunning imagery will ultimately become tiresome the longer you read it.Probably it’s just me. In case you haven’t figured it out, I’m not exactly the most romantic person out there. In my relationship it’s my husband who is the romantic. He’s the one that makes me breakfast in bed every single morning and puts a rose from the garden on my tray. He’s the one that calls me to see how my day’s gone and sends me soppy, romantic messages. If you’re a sentimental, sweet kind of person (two adjectives nobody has ever applied to me) then I’m sure you’d like this book and it would do you justice. For those who like a little more “action” in the literary sack then this book may tend to waffle on and be overly mushy.Now THAT’S more like it! "}, {"Review": "4 Stars - \nAlso reviewed at: Lady Jayne's Reading Den\nSweet and romantic, but I liked the movie much more. In fact, I LOVED the movie and watched it before reading this. In the movie, the characters of Noah and Allie had more intensity and passion. It is one of those rare moments, for me, when the movie was better than the book.There are some great quotes in this book though. These were my favourite:\"I am a common man with common thoughts, and I've led a common life. There are no monuments dedicated to me and my name will soon be forgotten, but I've loved another with all my heart and soul, and to me, this has always been enough.\"\"We sit silently and watch the world around us. This has taken a lifetime to learn. It seems only the old are able to sit next to one another and not say anything and still feel content. The young, brash and impatient, must always break the silence. It is a waste, for silence is pure. Silence is holy. It draws people together because only those who are comfortable with each other can sit without speaking.\" \"The best love is the kind that awakens the soul and makes us reach for more, that plants a fire in our hearts and brings peace to our minds, and that's what you've given to me...\"\"We fell in love, despite our differences, and once we did, something rare and beautiful was created. For me, love like that has only happened once, and that's why every minute we spent together has been seared in my memory. I'll never forget a single moment of it.\"\"So it's not gonna be easy. It's going to be really hard; we're gonna have to work at this everyday, but I want to do that because I want you. I want all of you, forever, everyday. You and me... everyday.\"\"I love you. I am who I am because of you. You are every reason, every hope, and every dream I've ever had, and no matter what happens to us in the future, everyday we are together is the greatest day of my life. I will always be yours.\"\nCOPYRIGHT DISCLAIMER: I do not hold the copyright to any of the images used in this review. They are posted to add visuals to the review and for fun. If any of these images are yours and you would like me to remove them, please let me know, and I will do so as soon as possible. If I can identify the copyright, I will do so.\n"}, {"Review": "This is my favorite love story ever. It shows what true soul mates are. (I also loved the movie as much as the book.) If you don't cry when you read this then something is wrong with you. I think that you can love someone like ally did the lawyer, but only true love with your soul mate like with Noah. People who don't like this book have never truely been loved, because if you have it hits home.Here are a few of my favorite quotes from the book:\"I am a common man with common thoughts, and I've led a common life. There are no monuments dedicated to me and my name will soon be forgotten, but I've loved another with all my heart and soul, and to me, this has always been enough.\" \"We sit silently and watch the world around us. This has taken a lifetime to learn. It seems only the old are able to sit next to one another and not say anything and still feel content. The young, brash and impatient, must always break the silence. It is a waste, for silence is pure. Silence is holy. It draws people together because only those who are comfortable with each other can sit without speaking.\""}, {"Review": "كالعادة نيكولاس سباركس يطلع لينا لسانهويقولضحكت عليكم وثبتكمالراجل دا ليه بيعمل معانا كدا؟؟ليه عاوزانا نصدق ف حاجات مريبةزي الحبوالصدقوالوفاءوالزواجليه؟؟؟؟؟يكونش ماسوني؟؟؟الغريب ودي علامة ف كل كتبههو ملتزم بشدة متلقيش شتيمةولا مشهد عاطفي حارمع ان مفيش رواية كتبها الا وتستحمللكن هو عامل كنترول لوحدهولا قالك الدراما تتطلب داولا اتفذلك ولا شئوعرف يوصل اللي هو عاوزهمش قصدي ان اللي بيعمل عكس دا زبالهلا خالصبس انا بتغاظ ان فيه روايات بتبقي عبارة مشاهد ابيحةتحتوي علي روايةاو مشاهد مقحومة لا لشئ غير اهو هو كداقصة بسيطة وسهلةمن غير احداث او تفاصيل ومن غير كعبلةما بين بنت و ولديفرق ما بينهم القدرالمشكلة اني لو حكيت هبقي حاسس اني بقولتتر مسلسل عربيالرواية لازم تتقرأ انا مشوفتش الفيلمف مش عارف هما مرمطوا الرواية ولا التزموا بيهارواية لازم تقرأها احسنلكعلشان تفتكر انك لسه انسان[image error]"}, {"Review": "I loved this book!!! I would recommend it to anyone, and it's by far the best romance book I've ever read. It's one of my favorite books, in general, ever!!! I’m pretty sure some guys would like it, too. I just watched the movie, and that was really good too! And like my eighth grade English teacher said, it included everything that was in the book, which is really rare! I loved them both. I don't know which I liked better; the book or the movie! Maybe the book, but only because you get to see how hard it is for Allie to decide who she really wants to be with-Noah or Lon. Either way, everyone should read the book and watch the movie! "}, {"Review": "I read this book because my sister loved it. It made me sad. Not because it was a sad story, but because it was so poorly written. This Sparks character had a fantastic idea for a story, a truly painful and passionate story of love and devotion. But the book? It was like my 14 year old nephew watched this brilliant movie, then tried to write about it on his myspace blog. It was butchered by an appalling lack adjectives and an appalling lack of emotion. Sad. The fact that so many people are willing to overlook Sparks' lack of creativity and inability to, well, write, is also sad. Sad, I say. Sorry Tracy. "}, {"Review": "Besides the awful writing style (just to mention unimaginative, spiritless and full of clichés), I found the story just a little too contrived and far too predictable. I couldn't get over the premise where Noah and Allie meet when they are teenagers, spend one summer together and meet again after 14 years to realise they are still utterly in love?! What?!It irritated me to no end that Sparks felt the need to not leave anything unexplained, describing things in excruciating detail, boring me but more so putting me off reading any of his other books. In the end it just felt like it was dragging on and on and on - I just wanted it to end.Also, since I listened to the audio version I must say that the choice for the reader of the audio book isn't the most brilliant one. His voice is kind of suited for the old Noah but his imitation of a young Allie is just really off-putting. Plus, he's got that kind of voice that makes me want to fall asleep straight away. Combine that with the terrible style and plot, this book can only be described as indigestible. No more Nicholas Sparks for me, thank you!"}, {"Review": "Well, that's one author I can cross off my \"to-read\" list.Noah and Allie fell in love one summer when he was 17 and she 15. She leaves, and fourteen years pass before Allie, now engaged, returns to Noah. Are they still in love? Will she marry her over-working fiance, with whom she shares a passionless relationship and who keeps her from pursuing her passion of art? Or will she choose Noah, the boy she spent a grand total of one summer with and lost her virginity to (and hasn't had sex with another man in the entire 14 years they've been apart)?I see people enjoying this for primarily two reason:1. You adore sappy romances where you can predict the plot from the beginning and have to keep a box of tissues nearby for the monsoon of tears that will be spilled. BONUS: You love the \"Greatest Love of All Ages\" ending with the couple in \"present day\" as 80 year-olds gasping on their death beds, clinging to each other's hands.2. You love to participate in Bad Book Buddy Reads with an amazing compatriot. You love to groan as the plot points are written in big crayon pages before they appear, roll your eyes at the overwrought descriptions of love, and wince at Trio of Terrible Writing, Cardboard Characters, and Zero Subtlety.Guess which one I was?This book was bad; bad as in \"so good it's bad\" category. Meaning, perfect for Bad Book Buddy Reads. And I was not disappointed - this book was a gold mine of snarkable material.The characters are so flat, they are almost invisible. Noah is the Rugged Poet (who writes no poetry), giving him the duo combination of being Deep/Intellectual but also a man who works with his hands (he WORKS for a living gorrammit!). Allie is a Passionate Free-Spirit, who loves to paint and is therefore Deep and Artsy. The rest of the characters (what few of them even exist) are even worse (if that is possible); Lon is the Foil, Anne, Allie's mom, is the Voice of Inspiration, Gus is the Person of Color (no seriously, there is no reason he appears in this book). I get that this book is a mere 213 pages long in my edition, but come on! Fill the world with some color, why don't ya?I was surprised at the progression of what passes for \"story\". I saw the movie, so I remember there was quite a bit of build-up between teenaged Allie and Noah along with the older people. The book totally skips over ANY sort of relationship building between the teenaged protagonists and instead starts the story with a HUGE backstory dump with Noah at 31 and Allie at 29! The problem is, we have spent NO TIME developing their romantic feelings for each other; instead, Allie is back to see Noah after 14 years!By the way, if Noah and Allie were REALLY so deeply in love, why did it take them FOURTEEN YEARS to reunite? Why were they THAT surprised when Anne withheld Noah's letters (come on, Allie's parents weren't shy in letting Noah know they didn't like him!)? Noah tries ONCE in the 14 years to see Allie; that's it! If I'm going to buy this is the Greatest Love Story of All Time (which I don't), I need to see them pursuing it.As for the \"Greatest Love Story of All Time\" - laughable. As I said, there is no chemistry between the two. Sparks relies on TELLING us (frequently!) how his characters burn for each other. That is NOT chemistry; that is a summary.Last thing: I could not believe how awful the writing was. It was so boring! So simple! So fraught with telling and not showing. And I even spotted some grammar errors (tenses changing in mid-sentence and some unclear pronoun usage).There isn't very many times I say this, but the movie was lightyears better than the book (and I wasn't even that big of a fan of the movie!). Rachel McAdams and Ryan Gosling did a great job at personifying the characters and, most importantly, conveying the Greatest Love of All Time. I guess you can give Sparks credit for being able to write a concept that would make a good movie, but when I read a book, I have certain criteria: namely characters, plot, writing. I also hate to say this, but some of the books I've really ranted against (*cough*Danse Macabre by LKH*cough*) look much better against the poor quality of this book.If you are curious about this book, watch the movie. If you are a big sucker for sappy romances or love to snark with buddies, pick this book up!"}, {"Review": "The Notebook (The Notebook #1), Nicholas Sparksتاریخ نخستین خوانش: هشتم فوریه سال 2000 میلادیعنوان: دفتر خاطرات ؛ نویسنده: نیکولاس اسپارکس؛ مترجم: نفیسه معتکف؛ مشخصات نشر: تهران، لیوسا، 1378، در 213 ص، شابک: 9645634032؛ موضوع: داستانهای نویسندگان امریکایی قرن 20 ممهدی سجودی مقدم نیز تحت عنوان: دفترچه خاطرات (و با عنوان فرعی: شورِ عشق) کتاب را ترجمه و توسط انتشارات مهراندیش منتشر شدهرمانی عاشقانه است از نیکلاس اسپارکس، که براساس داستانی واقعی نوشته شده. این کتاب بعدها مبنای اقتباسی سینمایی به همین نام شد؛ داستان در دوران پیش و پس از جنگ رح می‌دهد. نوآ و آلی تابستان خوبی را با هم سپری می‌کنند، اما خانوده ی آلی و واقعیت‌های اقتصادی – اجتماعی آن دوران، مانع از به هم رسیدن این دو جوان می‌شود. اگرچه نوا تلاش می‌کند پس از جدایی نیز با آلی ارتباط داشته باشد، نامه‌ هایش بی‌ پاسخ می‌ماند. عاقبت نوآ در آخرین نامه‌ اش به عشق جاودان و نامیرایش اعتراف می‌کند. نوآ به شمال سفر می‌کند تا شغلی مناسب پیدا کند، و یاد و خاطره آلی را از یاد ببرد، و عاقبت به جنگ می‌رود. پس از خدمت به کشورش، به خانه بازمی‌گردد، تا خانه‌ ای قدیمی را بازسازی کند. مقاله‌ ای در روزنامه در مورد تلاش‌های او برای همین کار، توجه آلی را جلب می‌کند، و پس از چهارده سال نزد او می‌رود. دو روزی را باهم می‌گذرانند و آلی تصمیم می‌گیرد بین دو مردی که دوست میددارد یکی انتخاب کند. ...؛ ا. شربیانی"}, {"Review": "So, I didn't love this book, even though every other girl on planet earth does. Here's the deal: it's an old guy at the end of his life, showing how undyingly committed and in love he is with his elderly wife, who is dying of Alzheimer's. Sweet, right? Except here is how he shows his love: every day, he reads her the story of their love. It involves hooking up as teenagers, then being apart without communication for years and years, yet yearning for one another while sleeping around with other people, then getting back together to fornicate like crazy and cheat on her fiance and break up her soon to be wedding. If that is not eternal and undying love, I don't know what is. There is no way you can go wrong picking a life partner if you are horny and running away from responsibility and commitment, as this book clearly shows. That is the only way to find a man who will love you and change your diapers for you when you get old.Okay, so he wasn't changing her diapers, but you get the point. I try to go with the romance of the book, and it is romantic in the eldery love sort of way (hence the 3 stars, because I figure eventually they grew up), but I can't help but think the main characters are sleazy. The end. Throw tomatoes at me now."}, {"Review": "Where I got the book: I have absolutely no idea what this was doing on the Shelf of Shame. I'm really hoping it was a freebie from some event, because seriously, I wouldn't have bought it would I? Another Bad Book Buddy Read with Crystal Starr Light.Bottom line:Well, there's no accounting for taste, and if you like sappy Twoo Luv stories this is your man. My mileage varied, mostly because I was reading critically with ALL my teeth and claws out, so I'll forgive you if you enjoyed it because yeah, I can see where the enjoyment could happen.My emotions changed as I read through this novel. They were, in order, Incredulity, Boredom and Depression. IncredulityWell, THAT got off to a good start when I realized that pretty much the entire novel was going to be a flashback.And increased exponentially when I encountered clichés such as the poetry-book-that-stopped-a-bullet and girl-undresses-in-front-of-mirror.This is the scene-setting exposition part of the story, which continues for an alarming 38 pages but really should have been much longer, because it's a sketch of a teenage love story (yawn) with parental opposition (YAWN) and How The War Matured Me.And of course Noah is a gentle poet who likes to take things slooooooowly and commune with Nature, sort of like Walt Whitman with less hair (Whitman is liberally quoted, which vexed me because quoting poetry in novels is a pet peeve of mine. Also song lyrics.)BoredomThe yawns set in big time once we got into the Twoo Luv story of how Allie decides to cheat on her fiancé by looking up her old boyfriend, making sure her dress gets REALLY WET so that her nipples stand out like hard little diamonds or something, and then rubbing her hands all over Noah's chest. Oh yeah, and suggesting he crack open a bottle just in case her inhibitions don't drop low enough.This, naturally, leads to a massive bonkathon extending over several days.After which Allie, who should pretty much be unable to walk by now, actually has the gall to do the it's-not-you-it's-me speech and LEAVE. Only to be bounced back by an even MORE clichéd scene involving Mom and, I swear I'm not making this up, the words Follow Your Heart.DepressionAnd then the story jumps forward half a century and everyone's dying which SHOULD cheer me up, given what I think about these two, but in fact it reminds me that all Twoo Luv stories pretty much end this way. There's a REASON why we usually end with a wedding, you know. At my age I do NOT need reminding that if we're lucky we'll end up holding each other's arthritic hands in a nursing home.And what really gets me is that of course they've lived wildly successful artistic lives because OF COURSE Noah has reawakened the artist in Allie that was stomped on by Life and she's become famous. Even though the Allie we see in the backstory is just a bundle of sexual and emotional neediness with none of the drive and passion of a real artist. I mean if she were that great she'd be producing art without Noah having to tell her to do it, right? And then when we jump forward she's completely lost the plot anyway, so basically Allie remains entirely devoid of character. And Noah's just Wet Poet Type, Standard Issue.Did I say earlier that I can see why people enjoy this book? Well, yes. If you like stories without much depth that are engineered to get the tears flowing and make you feel all AHHHHH at the end, grab a box of tissues and dig in. On second thought, watch the movie because I believe it may be better. Oh look, here it is!Yep, its all wet."}, {"Review": "RESEÑA EN EL BLOG: https://bookstwins.wordpress.com/2018...Es el primer libro que leo de Nicholas Sparks y debo decir que me sorprendió. Pensé que eran historias muy melosas y que todas se parecían entre sí entonces nunca quise darle una oportunidad.De esta historia tampoco he vista la pelicula, justamente por la misma razón por la que no leía los libros.Es un libro muy corto que se puede leer en una tarde y cuenta, resumidamente, la historia de Noah y Ally desde que se conocen de jovenes hasta ya ancianos. Los protagonistas ya desde jovenes toman muy enserio en amor que se sienten y por esto la historia se diferencian de otras porque no hay caprichos sino que es un amor maduro.A lo largo del libro vemos como tienen que superar los obstaculos para poder estar juntos. Lo que más me gustó fue como los superan pues demuestra la seriedad de la historia."}, {"Review": "As an author, I learned that this romantic, simple style is not my cup of tea. Although I enjoy cheesy comedies (the work of Capra springs to mind), I don't yearn to write them myself. The original love story of this novel was a little too pat and plain-- it was too clear that this was the love of a lifetime. Perhaps I'm jaded, but I really think a lifetime of love is more irritating-- after all, no two people can be absolutely perfect for each other. In fact, that irritation and friction, and learning how to live with each other is what impresses me so much about long term relationships. I'm amazed that my parents are still together 29 years later because I know they've annoyed the hell out of each other-- and yet they were willing to work through that frustration because they believed their relationship (and our family) was worth it. The writing style in the beginning of the novel reminded me of my own writing during high school-- that rush of first love, that hope that you've found that one person to complete you and make your life worthwhile.For me, the most interesting, compelling part of The Notebook was the last segment. (If you haven't read the book, be aware that rest of this review will contain spoilers.) When the main character's love for his wife of forty-nine years triumphs even through Alzheimer's relentless blanket of memories, I was inspired. More than their love for each other, and the miracle that was their relationship, I was touched by Noah's willingness to live life in the present moment. At the end of their life together, Noah's goal each day is to fall in love with his wife again, even though she doesn't remember him. Even if he never sees that flash of recognition in her eyes, he is satisfied, as shown by this passage:There is beauty where we sit this afternoon, Allie and I. This is the pinnacle of my life. They are here at the creek: the birds, the geese, my friends. Their bodies float on the cool water, which reflects bits and pieces of their colors and make them seem larger than they really are. Allie too is taken in by their wonder, and little by little we get to know each other again.My goal is to say and truly believe that line in the middle every day: \"This is the pinnacle of my life.\" That is the best lesson of the novel: to find happiness in simply being alive and appreciating the beauty and love around us.(What? I read a cheesy book! You'd BETTER expect a cheesy review!) "}, {"Review": "The Notebook is the sappiest, cheesiest, most….er, romantic book I might’ve ever read. Nicholas Sparks weaves romantic lines from the simplest of words and they turn out cringey and good at the same time. So, why the four stars? This book was given to me by my uncle when I was barely fourteen. I remember reading it then and wondering if he had actually read it, and then thinking that if he had, then he must consider me mature enough to read this book, and feeling quite proud of the fact. Back then, I swooned over the romance, though neither the characters nor the romance itself is swoon worthy. I remember really loving the miracle aspect of the novel, of how Sparks thought that miracles really do happen, of hoping I’d encounter a miracle myself and be forced to believe the same. Rereading it now, expecting what is to come, I knew there wasn’t going to be any mind-blowing moments or anything remotely close. This is merely the way it is for me, and not a book I’d recommend to others. Looking at all the one-star reviews, I understand why this novel failed to please so many readers, but nevertheless, it remains one of the very few books I own, and so, it’s too important for me to not love it. I realize I sound as cheesy and corny as Sparks does in this book, so I’d get on with the review. Noah Taylor Calhoun has loved only once. The summer he turned seventeen, he met Allie Nelson at a festival in his home town of New Bern in North Carolina. Allie was there for nearly two months, but those two months lasted a lifetime for the two of them. They met each day and made memories and slowly fell irrevocably in love. Fast forward, Noah is thirty-one and alone, renovating an old house he had always loved - losing himself in work - trying to stay away from the memories of the hazel-eyed girl he’d once fallen in love with. Allie is twenty-nine, engaged, and lives a routine life she’d always thought she’d lead. But an encounter with each other was all they needed. The old memories rush in. Bonding over candle-light dinner and kayak rides, the two once again discover why they’d fallen for each other, and even more, that they’d never stopped.Noah and Allie’s relationship while at first might seem like insta-love, there are a thousand memories that make up their chemistry, but unfortunately the author doesn’t deem them necessary enough to share with his readers. The summer they initially met is mentioned many times, but only in conversation. We don’t get to see what or why they fell in love, nor do we get to see the development that is so obviously there. Sparks makes it work though; he makes us believe that Noah and Allie truly share a wonderful past, that there were some wonderful moments that keep them bonded. I only wish we could’ve experienced it with them.What I loved the most was the family dynamic in this book. Noah’s father has no role here, but he’s so often present in Noah’s thoughts. I love how he made his father sound like this wise old man, who’d loved his son and raised him to be the tough, nature-loving gentleman that he is. And then there is this one instance, where Noah talks about losing a child and how it feels, of growing up together with your family, bringing up kids – they all hit right on the spot. I also loved Allie’s mother, who despite everything, loved her daughter and wanted her to be happy no matter what.The vivid, clear description of New Bern and the natural aura, the kayaking, canoeing, rain, art and paintings; everything felt heartrendingly nice to me. Even though this book is supposed to be set around the time of Second World War, we don’t get to see the bad side – the depression, the deaths, the bloodshed and poverty. I can’t decide if that is a good thing or bad.The Romance? If you have the patience for long-drawn, meant-to-be-poetic-but-are-actually-sap kinda romantic letters and descriptions of sex, then maybe you’ll love this book. There’s no way in hell that actual people speak the way Noah does, there’s no way people actually write such cringe-worthy letters. It is unrealistic, yes, for the most part. But what do you expect from a romance? The chemistry between Noah and Allie felt real to me, but sometimes hasty. I’d say the character of Lon Hammond had no real significance in this book, and the male characters all act a little too gentlemanly (there are only two of them actually). But I loved reading the very realistic concerns of an old man groping over his upcoming death, reminiscing his long life and feeling ancient – they felt real and believable, as if the author himself had such thoughts bothering him. The Ending ? was far too stretched and the author dwelt on the same thing again and again, as if he didn’t know how to end it all and was waiting for inspiration to strike. There were some fillers, some boring parts – unnecessary additions that could’ve been avoided. Otherwise, there wasn’t a real ending at all."}, {"Review": "1 star\nIn a Word\n: boring\nInitial thoughts\n*Opens book**Reads book**Wonders if watching paint dry might actually be more exciting**Closes book**Yawns*\nThe Story\nWe’ve all seen the movie right? So it's that... but with all the emotion sucked out of it.\nPros\nThe beauty of lifetime love was represented in this story. The kind of love that leaves you falling in love with that person every day no matter what life brings your way. Like, real life love. \nCons\nThe romance was a snooze fest.So here’s what I expected from this book...Lots of inner turmoil and heart-wrenching romantic gestures…. Also, kissing in the rain… sexy tear filled kissing in the rain. Like the kind of ugly emotional kissing where you can’t tell whose tears are whose or where your soul ends and his begins. I expected to be rendered an utter emotional mess by this book!This is not what I gotI don’t know if it’s Spark’s writing style or the perspective of the story or what. But I felt incredibly detached from everyone and everything in this story. Seriously, I should have been a blubbering mess! I wanted to be heartbroken and feel struggle and longing and pain and really and truly the only emotion I felt was boredom.It went beyond meh and into the realm of “Please make it stop I can’t handle the extreme nothingness of this book anymore”.\nIn Conclusion\nI would suggest watching the movie and maybe using the book as a doorstop."}, {"Review": "The Notebook by Nicholas Sparks is a story about two teenagers from opposite sides of the track who meet one fateful summer and fall in love for a lifetime. This novel was engaging and steady paced. I was able to read it in one sitting as I was drawn into the lives of Noah and Allie. Nicholas Sparks has created a poignant story about two people who try to recapture the love they once shared despite the passage of time.Noah Calhoun is a simple boy with simple dreams. He loves poetry, his life in a small town, and a girl that was never meant to be his. Allie Nelson is accustomed to a life of riches and luxury, but she desires much more for herself. She loves art, music and spending time with a boy her parents do not approve of. As they explore their love for one another during their summer together, they realize that theirs is a love meant to last a lifetime. However, circumstances pull them apart for over 14 years and they are faced with trying to find a way to get back what they once had.I enjoyed the story, but I feel the author could have spent a little more time telling the readers about Noah and Allie’s reunion and a little more of what they went through to make a life for themselves. It was interesting to experience this story through the eyes of Noah as he enters the last chapters of his life. Compare Book to the MovieI’ve never seen the movie nor read the book, so it was enjoyable to do both back to back. After finishing the book in one sitting, I watched the DVD and was immediately able to compare the differences between the two. I feel the book was well written and the movie did a great job of bringing the main events to screen. One of the differences I noticed was the encounter between Allie and Martha. Martha was a love interest of Noah that never fully developed because he could not bring himself to move on. In the book, Martha leaves Noah well before Allie comes back into Noah’s life. In the book, they break up after Noah and Allie spend the night together, so obviously the timing was off, but it still worked well.Another difference I noticed was the way the movie depicted Noah and Allie’s relationship as somewhat volatile. They fought and told each other on several occasions that they hated each other, when that never happened in the book. In the book, their love was perfect and steady. In the movie they fought quite a bit and their breakup in the movie was disheartening, which didn’t happen that way in the book. So there were differences in their character development between both.The main difference between the book and the movie was the ending. As that would be a big spoiler for this review, I will not provide a detailed account, but let’s just say I felt the ending in the movie was more appropriate for this storyline.Overall, I enjoyed both the movie and the book and I’m glad I chose this for my reading challenge."}, {"Review": "Favorite QuotesI suppose [my life] has most resembled a blue chip stock: fairly stable, more ups than downs, and gradually trending upward over time. A good buy, a lucky buy, and I've learned that not everyone can say that about his life.\"A living poem\" had always been the words that came to mind when he tried to describe her to others.Our lives can't be measured by our final years, of this I am sure.We sit silently and watch the world around us. This has taken a lifetime to learn. It seems only the old are able to sit next to one another and not say anything and still feel content. The young, brash and impatient, must always break the silence. It is a waste, for silence is pure. Silence is holy. It draws people together because only those who are comfortable with each other can sit without speaking. This is the great paradox.And I learned what is obvious to a child. That life is simply a collection of little lives, each lived one day at a time. That each day should be spent finding beauty in flowers and poetry and talking to animals. That a day spent with dreaming and sunsets and refreshing breezes cannot be bettered. But most of all, I learned that life is about sitting on benches next to ancient creeks with my hand on her knee and sometimes, on god days, for falling in love.It is life, I think, to watch the water. A man can learn so many things.And when her lips meet mine, I feel a strange tingling I have never felt before…and suddenly a miracle…and I discover a forgotten paradise, unchanged all this time, ageless like the stars. I feel the warmth of her body, and…I allow myself to slip away. I close my eyes and become a mighty ship in churning waters, strong and fearless, and she is my sails."}], "Genre": "Romance", "ID": "33648131", "Desc": ""}