{"Name": "To All the Boys I've Loved Before", "Image": "https://images.gr-assets.com/books/1372086100l/15749186.jpg", "Reviews": [{"Review": "There are certain lines that you do not cross, and coveting your beloved sister's ex-boyfriend is one of them. That's why this book made me gag a little.This book was purposeless. There was no ending. There was no romance. There was no character growth (and the main character was pretty dumb to begin with). I don't usually read contemporary YA novels, but when I do, I have certain expectations. I want sweetness, I want a character that matures, and I want some really cute romance. Yeah. Me. Wanting a cute romance. It happens!That was what I wanted out of this book. I don't think it's too much to ask. I didn't get much of anything, so really, it felt like I read this book for no reason at all. I am left completely unsatisfied. Why did I waste my time?In short:1. There is no ending!!!!!!! If you want a definite conclusion or an HEA, get the heck away from this book.2. The main character (Lara Jean) is silly, childish, and privileged in a sheltered upper-middle-class kind of way. She never really matured.3. There was no true romance. There is a halfhearted love triangle. The romance is a literal \"contract,\" a pretend one to make an ex-girlfriend and a former crush jealous. They are friends, nothing more.4. The main character has long since been crushing on her big sister's ex-boyfriend. Excuse me while I throw up my recently ingested dinner.5. There is almost no female friendship in the book. Lara Jean has a best friend (Chris) who is an outrageous, loud slut, and they so rarely talk and that their relationship feels pointless and artificial.The Plot:\n\"[Josh] is into you.”I freeze. “No, he isn’t. He loves my sister. He always has and he always will.”\nLara Jean has been in love with Josh for a long time. They've grown up alongside each other for the past five years; her dad and sisters all adore Josh. There's just one problem with her little crush: Josh is dating her older sister, Margot. Margot is about to leave for college, so she decides to do the decent thing and break up with him. Josh is left brokenhearted. Lara Jean sees him crying. She thinks...\nIf you were mine, I would never have broken up with you, not in a million years.\nLara Jean is a romantic. She has had a few crushes in her life, and she has written love letters to all of them. There has been five.And now there's a problem: someone has sent all her crushes the love letters that she wrote them (if you can't guess who it is, we seriously need to have a talk). This is problematic...because Lara Jean wrote a letter to Josh. And Peter.\nThis is a nightmare. Peter Kavinsky is holding my letter in his hand. It’s my handwriting, my envelope, my everything. “How—how did you get that?”“It came in the mail yesterday.” Peter sighs.\nTo a teenaged girl, to any girl or woman, really, this is truly a mortifying experience, having your crushes find out is just an unimaginable humiliation. When Josh finds out, Lara Jean has no choice but to save face. She pretends to be dating one of her letter recipients, Peter. It turns out that Peter is in need of a little distraction himself.\n“Let’s just do this for a little while.”“Do what?”“Let’s let people think we’re a couple.”Wait...what?\nPeter has recently been dumped by his girlfriend, Genevieve. He wants to make his ex-girlfriend jealous, Lara Jean needs to pretend that Josh means nothing to her. They enter into a dating contract. But then Lara Jean finds himself liking Peter...but is Peter truly over his ex-gf? And what happens when Josh realizes that he might have feelings for her after all?\n“Ever since I got your letter...I haven’t been able to stop thinking about you.”\nLara Jean: Inoffensive, silly, stupid at times, and incredibly boring. Lara Jean reminds me of some of my baby sister's friends. She is so starry-eyed with innocence that I just wanted to slap some reality into her. She is stupid at times, she runs a stop sign, she takes some stupid risks involving her own baby sister and a car seat, she would probably buy the London Bridge from you if you offered it to her.\nI have a sudden revelation. I lower my voice and say, “Wait...can you read?”He bursts out laughing. “Yes, I can read! Geez, Lara Jean.” He snorts. “Can I read? I’ve written you multiple notes! You’re hilarious.”\nShe never really matured throughout the novel. Her maturity at the end of the book equates to \"I can order pizza for my dad and sister while my older sister is out of the country now!\" She has the sort of wide-eyed innocence that makes me think, \"Child, the real world is going to chew you up and spit you out one day.\" I want a certain toughness in my main characters, not a starry-eyed fluff of an overprotected, privileged upper-middle-class girl. Her definition of maturity includes admitting to her mistakes...\nI brighten up and then I remember how Margot said I’m in charge now. I’m pretty sure taking responsibility for one’s mistakes is part of being in charge.\nLara Jean feels like a 13-year old.Your sister's EX, REALLY?!: I don't know about you, but I find the thought of dating my sister's ex pretty fucking nauseating, and I'm willing to bet that my sister feels the same way about my ex-boyfriend. Let's get one thing straight, if you're going to be in a relationship with someone, there's going to be some touching involved. You're going to go beyond first base.The last thing I need when I'm kissing a guy is thinking about my sister kissing the same pair of lips. The last thing I need when I'm *ahem* a guy is knowing my sister has probably done the same thing to him. The last thing I need when I'm sleeping with a guy is to be thinking \"Has my sister been in this bed? Under these same sheet?\"Gross. Gross. GROSS. No, thank you.To top it off, do you really want to be dating a guy who was thinking about you when he was dating your sister? What does that say about his behaviors, his morality? What does that say about his character. Is he going to do the same thing to your OTHER sister 10 years down the road? (Lara Jean has two sisters) Do you really want your sister's leftover? Do you really want to date him knowing that he's had sex with your sister? Why would you even consider that? What kind of a sister would you be? I don't care if your sister broke up with HIM. It's still a betrayal of the worst sort.Female Friendship: When I read a contemporary novel, one of the things I look forward to is a realistic, true portrayal of female friendship. Instead, I have this:\nI wish I’d made more friends. If I had more friends, maybe I wouldn’t have done something as stupid as kiss Peter K. in the hallway and tell Josh he’s my boyfriend.\nWhat Romance?: There really is no romance in this book. There is barely anything but Lara Jean mooning and daydreaming that she and Josh were Meant To Be, if only he could see it. Her fake relationship with Peter....petered out. Lara Jean may find herself liking Peter more and more every day, but there's the fact that Peter is not over his ex-girlfriend.\nHe doesn’t know it, but when Peter talks about Genevieve, he gets a certain softness in his face. It’s tenderness mixed with impatience. And something else. Love. Peter can protest all he wants, but I know he still loves her.\nLara Jean is supposed to be developing a true relationship with Peter, but how can she, when it's clear that Peter has a tremendous amount of emotional baggage.\nPeter shakes his head. “What Gen and I have is completely separate from you and me,” he says.\nI was truly disappointed by this book. I wanted a sweet romance. I wanted to be swept away. I didn't get anything, and the ending left me reeling with disappointment because, while it was not a cliffhanger, nothing ever got resolved."}, {"Review": "REREAD #2: February 2018So I absolutely frikkin ADORED this book when I first read it and proceeded to order book 2 immediately and then wait in agony for it to arrive. And then (remember: SO MUCH AGONY)...I proceeded to not read it. Because my ship. My ship. Anyway I went ahead and forgot the whole thing so that's great of me. I'm only now rereading it because I own the second two books and intend to read them soon.SOMEONE HOLD ME TO IT OMG or I'll just keep rereading this one until my heart explodes.Reread Thoughts:• this book is so freaking cute and adorable• and all the fOOD• this is everything I need in a fluff contemporary• lowkey hate Josh and Margot (she is so callous and totally dismissive of Lara Jean's anxiety)• speaking of which I LOVE how Lara Jean's anxiety was represented. I don't think she has a disorder, she's just a bit anxious but !! I love this !! in books !! It's so relatable to have lowkey anxiety in books as well. <3• Kitty is absolutely fantastic and also Slytherin• Lara Jean is like the Hufflepuff amongst all these Slytherins it is good• Lara Jean's life is like \"is this aesthetic because that's what matters\" and that is such quality I can get behind• get this girl onto Pinterest• did I mention how hungry i am• ALSO MY SHIP IS LARA AND PETER SO BADLY I CAN'T STAND MYSELF PLS LET IT SAIL ARTHGGHAGH• omg fan**READ #1: Sept 2016I actually love this book FAR TOO MUCH. And I am actually genuinely in a mood because it's over and I NEED THE SEQUEL AND I DON'T HAVE THE SEQUEL. I'M SERIOUSLY UPSET. I'm supposed to be a Vulcan who doesn't even love contemporary that much...WHO AM I. WHAT HAS HAPPENED TO ME. I freaking loved this book and I'm just over here sobbing.[composes self]Okay okay let's talk about it SENSIBLY. (Omg where is my Vulcan soul, come back here you runaway.) And obviously I'll just write a list of all the things I NEED TO FLAIL OVER in this book:• It's delightfully diverse! With Lara Jean being half Korean ergo biracial.• And IT HAS SISTERS. Like I seriously love sister books because I have one or four of them myself. So it's enormously relatable. Plus Lara Jean sort of has this rift with her older sister when Margot goes off to school...and it just really hit home for me. 3 I really really really related to aaaaall the sisterly dynamics in here. This is so what it is to be sisters. YA WANNA KILL 'EM AND HUG 'EM SIMULTANEOUSLY.• Did I mention Lara Jean is fantastic?!? She is quiet and likes to be at home and she loves baking and she knits and scrapbooks and SHE IS HAPPY TO BE HER. I JUST LOVE IT SO MUCH I COULD CRY!! Plus I generally find the \"quiet\" people in books tend to also be seriously boring. Was Lara Jean boring?? HAHAAH #NOPE. She was so interesting and fun and witty and also scared and reserved and just...she felt like absolutely a real person. Which is what I want to read about!• BLESS THESE CHARACTERS. BLESS THIS BOOK.• Okay it is a love triangle...but it is a downright amazing one. And it's complicated. Because Lara Jean writes letters to boys she's loved as a \"let go\" thing. But someone sends them (!!) and the boys get them (!!) and her sister's ex-boyfriend, Josh, gets one. In order to NOT lose face with Josh (hello, he's her sister's!) Lara Jean \"pretends\" to get together with Peter Kavinsky. Peter and Lara Jean are totally using each other and it's all a fake relationship...at first. But the basic gloriousness of it is: (A) both boys are interesting and complex characters, and (B) I liked them both a lot at the beginning, and (C) it wasn't a case of Lara Jean being \"in love with two people\". IT WAS NEVER LIKE THAT. So I loved this triangle!! Perfection!• I absolutely freakishly enormously LOVE PETER KAVINSKY. I can't breath. Someone send help. No no send cookies.• And Josh started off cool but then?? eh. No.• Also I kind of hated Margo, but whatever. Kitty (who is the 9yo sister) was fantastic so that makes up for it.•  ALSO DID WE TALK ABOUT THE AMOUNT OF FOOD IN HERE YET??? This is true foodie fiction. I'm not even kidding: there is AT LEAST food mentioned in every chapter. Like meals and outings and ice cream and baking (SO SO MUCH BAKING) I literally died several times. NO I'M NOT EVEN KIDDING. I had to stop reading and go eat a banana muffin and sour cream because I was starving. Curse this book omg. • ALL BOOKS SHOULD BE THIS FOODIE. It fully gets an extra star for the food. It does. I'm not even ashamed.• Also the character development?!??!?? I AM IN LOVE WITH IT. I just...I ship Lara Jean and Peter so bad someone hold me I'm crying. I'm a wreck. UGHGGH. But I love how Lara Jean developed over the course of the book and I loved how the book wasn't completely angsty or anything. It was just beautifully written and interesting and fully captivating.• I like it.• HAHAHAH JUST KIDDING I LOVE IT.(Excuse me, I need to go sit down, I've fangirled too much and I don't know what to do with myself.)(Also I want to eat.)(Darn this book.)Lucas smiles. \"You're so cute,\" he says, and I perk up again. Then he says, \"Listen, can you not tell anybody though? I mean, I'm out, but I'm not out yet. You knwo what I mean?\"\"Totally,\" I say, super confident.\"For instance, my mom knows but my dad only kind of knows. I haven't outright told him.\"\"Got it.\"\"I just let people believe what they please. I don't feel like it's my responsibility to quantify myself for them. I mean, you get what I'm talking about. As a biracial person, I'm sure people are always asking you what race you are, right?\"I haven't thought of it that way before, but yes yes yes! Lucas just gets it. \"Exactly. It's like, why do you need to know?\"\"Exactly.\"\"My favourite food is cake\"\"What kind of cake?\"\"It doesn't matter. All cake.\"\"You jsut gave me so much shit for not picking,\" he begins.\"But it's so hard to pick one kind!\" I burst out. \"I mean, there's coconut cake, the kind with white forsting that looks like a snowball -- I like that a lot. But then I also like cheesecake, and lemon cake, and carrot cake. Also red velvet cake with cream cheese frosting, and chocolate cake with chocoalte ganache frosting.\" I pause. \"Have you ever had olive-oil cake?\"\"No. That sounds weird.\"\"It's really, really goood. Really moist and delicious. I'll make it for you.\"Peter groans. \"You're making me hungry.\"YOU AND ME BOTH, PETER. [SOBBING BECAUSE NEEDS CAKE]"}, {"Review": "The Blurb: Lara Jean's love life goes from imaginary to out of control in this heartfelt novel from the New York Times bestselling author of The Summer I Turned Pretty series.The Reality: Privileged, boring, 16-year-old girl (whose \"voice\" sounds closer to 12) feels sorry for herself because her sister's boyfriend doesn't want her. Until he does. Conclusion? There is none. Just a lot of faffing about, moronically pining, and an inconclusive non-ending.2014 Contemporary YA sucks. So many books I've been looking forward to have let me down. Other books that I've taken a chance on have also let me down. Honestly, where are the sophisticated but no less realistic and dramatic voices of authors like Melina Marchetta or Courtney Summers? Why does every YA narrator have the same recycled, immature narrative voice? I am seriously starting to wonder if Young Adult has ran its course. My reading of the past few years has been defined by trends in YA; I've been propelled towards dystopias and fantasy novels with teen protagonists and I've loved, hated, laughed, cried and obsessed. Now I have to wonder: has the \"genre\" finally ran out of steam?To All the Boys I've Loved Before is about a girl called Lara Jean who's been crushing on her sister's boyfriend since before they were together. Her sister, Margot, will soon be leaving for college so she breaks up with said boyfriend - Josh - leaving him behind and single and oh so heartbroken. Then there's the other part of this story: Lara Jean has written love letters to all her past crushes (5). Never sent them, of course, just written down the emotions and angst as a kind of release. Now a mysterious someone (view spoiler)[ (hide spoiler)] has sent all her letters to the respective crushes, including Josh. Obviously, Lara Jean is mortified and decides to deal with the embarrassment by pretending to be in a relationship with one of the recipients who has some issues of his own - Peter. Drama ensues. Josh changes his mind. Lara Jean starts to think that maybe she has feelings for Peter. But does Peter have feelings for her? It amazes me how little Lara Jean seems to realise that it's kinda weird for her to seriously pursue a relationship with her sister's ex. But whatever, it's not like that's my main problem with this book. My main problem is Lara Jean herself. She is immature, naive, silly, spoiled and behaves (and thinks) a lot younger than she actually is. I guess there's a fine line between innocence and annoying, upper middle class ignorance, but I find that Lara Jean is heading towards the latter. I know teenagers tend to have a silly obsession with boys (or girls, whatever) but her narrative voice is so childish, whiny and uninteresting that it's hard to sympathise with her at any point. And she never learns, never develops, never grows. Time and life experiences have come and gone by the time this novel ends, but LJ is the same old girl. Forever lacking in charisma.Very flat, dull and pointless book.For you lil whippersnappers out there who haven't heard the song with the same idea, get to it: https://www.youtube.com/watch?v=ZqryI...Blog | Leafmarks | Facebook | Twitter | Instagram | Tumblr"}, {"Review": "Well... That was disappointing.I absolutely could not stand Lara Jean's voice. She sounded like a child, even though she's 16 years old. STOP. She also cried any time something mildly unfortunate happened, and that got old real fast.I fail to see how any of the romance in this book was cute. There are two love interests, and both of them were horrible. I wasn't rooting for either of them at all.ALSO, the letters, which I thought would be a big part of the story, were really only used as something to spice up the plot near the beginning, and once they had served their purpose, they stopped mattering. Lara Jean didn't even seem to care who sent them out, or why, and that really bothered me. Who would just be like OH WELL. LOL MOVING ON.It started out as a fun, light read, but it lacked substance, which is why I didn't really enjoy it."}, {"Review": "4.5/5Reread in August 2018This was so much cuter than I remember! Though I still have some of the problems with the book that I had the first time I read it (basically, it just annoyed me that she called her dad Daddy - though I did the same thing up until I was like 13? Why am I so judgmental?), it was a very enjoyable experience. It was even more enjoyable since it was a reread in preparation for watching the Netflix original! Though I haven't seen it yet, I had the actors in mind the entire time. And let me tell you, Noah Centineo is a much handsomer Peter than the one I had in my head. I'm not complaining.Though I wasn't planning on continuing on and rereading the rest of the series, I think I just might. I always need more Lara Jean in my life <3Original review (June 2014)I really enjoyed this book and how it wasn't really what I was expecting. The character development was also great, especially Peter's. I still prefer her other books from the Summer trilogy as I found myself loving every single character. In this book, I only really liked Lara Jean, Kitty, Josh (sometimes), Peter, and her dad. The writing also started out a little young in my opinion. I guess I was just thrown off by her calling her mother and father Mommy and Daddy, but I thought I was reading from her POV of when she was 11 or so. I quickly got used to this writing, though, and it made for a quick and enjoyable read! The reason I couldn't give it a full 5/5 was because of the things I stated above and the ending, which ended a bit abruptly."}, {"Review": "I read this in a day. SO CUTE. Follows a girl called Lara Jean and through her life she has written letters to all the boys she has loved in her past, she keeps these letters safely tucked away from the word. However, one day she finds they are gone, her letters have been sent out, and everyone she has ever loved now knows. Including her older sisters ex-boyfriend. This story follows Lara Jean as she struggles with her relationship with her older sister and her past loves. It had so many levels, yes it was a \"love story\" but it also focused on the relationship between sisters and family. I really really enjoyed this, and when I read the last page I actually got angry because I wanted more. I really hope this is a series. "}, {"Review": "(3.75?) With the movie coming out soon, I decided to finally pick this book up. It's a YA contemporary with a romance so really it's not my usual genre but I've been a bit in a slump and needed a pick me up.This was perfect for it! Lara Jean has loved 5 boys in her life and has written to each of a them a love letter that she hid before moving on. One day they are all sent and she has to deal with the consequences.This was cute! It's all about family, relationships and getting out of your comfort zone. It wasn't cringy and yes there's a love triangle but I enjoyed the book.I'm continuing the series. UPDATE: After reading the second book, I'm reducing my rating to 3 stars. I already felt like this could have been a standalone but I now 100% think it SHOULD have been."}, {"Review": "4/5 Stars ⭐️ ⭐️ ⭐️ ⭐️“When someone's been gone a long time, at first you save up all the things you want to tell them. You try to keep track of everything in your head. But it's like trying to hold on to a fistful of sand: all the little bits slip out of your hands, and then you're just clutching air and grit.” I need to talk about something here. By the time I'm writing this review, I have read the entire trilogy. I finished it under three days because, you know, I had nothing better to do these days and I set this fucking goal for myself so whatvs. Doesn't mean I loved this series so much (especially the last book), it was just extremely easy to read and a nice companion for these three days. So, if I confuse a detail or something from another book of this series and write it here, I'm very sorry. Everything is messed up in my brain cause of binge reading. So, now let's go!Sixteen-year-old Lara Jean Song keeps her love letters in a hatbox her mother gave her. They aren’t love letters that anyone else wrote for her; these are ones she’s written. One for every boy she’s ever loved—five in all. When she writes, she pours out her heart and soul and says all the things she would never say in real life, because her letters are for her eyes only. Until the day her secret letters are mailed, and suddenly, Lara Jean’s love life goes from imaginary to out of control.As I mentioned earlier, I read this book very fast. I read it in a couple of hours, watched the movie late at night (I will discuss it later) and then decided I would finish this series in three days. This is a very lighthearted, cute, fluffy contemporary, which is not exactly for my age demographic anymore, but I found it adorable nonetheless. The fake relationship trope is my NUMBER ONE RELATIONSHIP TROPE since I started reading fan fiction so many years ago. Trust me, if I had read this series when it first came out, I would cry my eyes out for it. But now, I'm 21 years old, and I'm starting to become more of a critical reader the more books I read but I choose which ones to judge hard. Like The Selection Series Collection, I will choose to not judge this book harshly, because its purpose it to entertain and not be taken seriously. And I was definitely entertained and I didn't take it seriously. So here we go.The covers of these books are dead on gorgeous. I'm a graphic designer so I know they are easy enough designs, but there's something to them, you know, that drew my attention. Due to my profession, I judge a book by its cover. I'M SORRY. It's hard being a graphic designer and a bookworm because we JUDGE EVERYTHING. Every time I buy a book, I find the most conspicuous details to judge. I have so many books that I know I will love, that I won't buy because the covers are extremely shitty. Mostly older books, because covers now are phenomenal, thank God. I always try to find alternative covers of those books that I like enough to buy. But they are always fucking expensive as shit. So yeah. Fuck. It's hard being a detail-oriented graphic designer like myself and being a bookworm too. Fuck my life. This book was adorable. The plot was adorable, the characters were adorable, the setting was adorable. It was a classic 80s American movie regarding schools. The first book was my favorite of the series. It was more intense, the plot was more interesting, there was shit going on, you know. The love triangle kept me at my toes, even though I rolled my eyes many times. I rooted for Josh at the beginning, but then Peter become THE ULTIMATE BAE. Honestly, Peter was so dreamy. I'm not a pedophile, I swear, BUT PETER HOT DAMN BOI. I found Lara Jean extremely immature, juvenile and annoying, at times. But I mostly rooted for her and related to her. I related to how she couldn't commit, how closed off she was as a person, how she couldn't trust to start a real relationship and kept to her fantasies. I also, related to how much she hated driving. I got my driver's license at 18, the legal age here, and I haven't really drove since. I'm unfathomably scared of driving and I saw myself in her. I see how good she got with driving as the books pass, and that inspired me. I don't understand something. WHY SO MUCH FOOD IN THIS BOOK. This whole aspect dragged the book for me. So many unnecessary descriptions of food that would take up whole pages for no apparent reason. Honestly, Americans eat so many things strange to us Europeans, wtf is all this? American food always confused me. There was also some Greek food mentioned in these books, which I appreciated. Thanks, books. We have better food than you, Americans. SUCK IT. But, for real now, NO ONE IN THIS FAMILY HAS A SLOW METABOLISM? With so much unhealthy food and no exercise, a person like me would be doomed in this family. I wanted an over-weight person in this story, it would be realistic. The only diversity in these books, were the Song sisters, which are half Korean. This is an old book and for a book of that time, this is amazing diversity. Their Korean side wasn't brushed off, we got many mentions of it throughout the book. We also got a gay character, Lucas, which I'm very happy about. But we didn't see him with anyone, basically he was a very forgotten character who wasn't given a singular plot. He was just there, to be a friend to Lara Jean. Lucas deserved so much more!!! Chris was okay. I didn't care for her as much in this book, but my opinion changed in the next books. She became a very good friend to Lara Jean and a very important person in her life. She's not the kind of friend I would choose, but she turned out to be a good person.Now, let's talk the sisters. I didn't like Margot, especially in this book. She was bossy, controlling and she thought she was better that everyone in her family and she always knew best. I was very glad she left for Scotland, which I admired. She is a strong-willed character, unlike Lara Jean. And I admired that about her. And now let's talk about my spirit animal, KITTY. She was HILARIOUS and AWESOME. I truly believe she didn't act her age, she was too mature and she knew too much to be 9. That's why, I believe, they changed her age in the movie. But I loved her so much, she was my fav of the sisters. I wish I were like her, when I was a child and even now. Ugh WHY DO ALL THE SISTERS STILL CALL THEIR FATHER \"DADDY\" AND THEIR DEAD MOTHER \"MOMMY\". STOP THIS FUCKING BULLSHIT, I WAS CRINGING MY WHOLE LIFE. MARGOT YOU'RE FUCKING 20 IN THE LAST BOOK, STOP STOP STOP! UGH!I bought these books a long time ago. I have waited for the movie to come out first, so I could watch it right after I read the book. Which I did. I was in a high from the first book when I watched the movie and I fucking loved it! The same thing that happened with Simon vs. the Homo Sapiens Agenda and its movie adaptation happened here. They changed tremendously many important parts from the books, that couldn't have been changed, but they made something new and unique out of it which kept the essence of the story the book wanted to portray. I was rolling my eyes out at some moments, and I was screaming at the screen \"WHY THE FUCK WOULD YOU CHANGE THAT, IT MAKES NO SENSE\" and \"THIS DIDN'T HAPPEN TAHT FUCKING WAY IN THIS BOOK, YOU FUCKING BAFOON, AND IT DIDN'T NEED TO CHANGE\" but the whole feeling of the book was kept intact in the movie. And it was an amazing one. First of all, they casted actors who look 16! Fucking hallelujah! They kept many jokes from the books, but also invented some. I think the movie made up for all the humor that didn't exist in the book. The movie was dead on hilarious, I couldn't stop laughing at some points. The actress for Lara Jean was perfect, Josh was how I imagined but PETER. PETER MAN. The actor was a younger Matthew Daddario! Oh, I love this bitch. For me, he's the epitome of hotness, below my ultimate bae Zac Efron, of course. I need to talk about something that bothered me a lot in the movie. I loathed how they erased Josh's part in the triangle. I know, triangles are bad boohoo, but I liked this one and it was exciting in this book. I know the triangle shifts in the next book, but it should have been kept in this movie. They made Peter the only valid option and erased Josh from the equation. Which made his character a side character with no purpose whatsoever. They skipped on to the second book immediately. And I didn't enjoy that. Also, when I first watched the movie, some plots were new and I wad confused. Like the pool sex tape plot. Which was unknown to me, before I read the second book. I'm curious to see what they will add in the second film, if they make one. Judging by the last cameo, they will. I'm very excited, to be honest! COME ON NETFLIX. I PAY FOR YOU NOW. DON'T EMBARRASS ME.Overall, this was a very cute and easy to read book. I will never read an entire series without writing a review for each book after I finish it, again. My review in my head for this book was so much different when I pictured it in my head. But now that I have read the next two books, this series has a different light in my mind. Not a good one. But I've learned my lesson, I will write individual reviews for each book before going to the next. Everything is a huge fucking pile of shit mess in my head now, these reviews are hard for me to write. I have learned my lesson. Anyway, till the next one, which will be soon cause I got two more books to review, K BYE!"}, {"Review": "I was extremely shocked when I started reading this book. The intention was to read the first paragraph and if I didn’t feel like it I would pick another book. I couldn’t stop. I read the first sentence, the first paragraph, the first chapter and that's it, I was not going to stop, it just wasn’t an option anymore. There are few books that will rope you in so completely that you can't help but keep reading, this is definitely one of them. I loved everything about this book, the characters, the story, the relationships. This is the fastest I've fallen in love with characters in a long time.Every word, every sentence, every paragraph is bursting with so much emotion, it shouldn’t be possible. The love, the happiness, the sorrow, the regret, all of it is so overwhelming yet so perfect. From the very start all the way to the end there is not a single moment I would change about this book. Every conversation, every interaction will have you hanging on each of the words both spoken and thought. The relationships, let it be family, friends, or something unrealised all have so much emotional weight to them I couldn’t help but love them.The characters are very well thought out. Each of them have a depth and realism to them that drew me in no matter what. Their secrets, the parts of them they refuse to reveal to the world, and all their emotional baggage just adds to my love of them. You'd think with all the love interests going on it would get slightly irritating but it doesn't, not in the least. The love interests and each of their attributes are so well written that no matter what happens with them, and in between them, I will continue to like each of them for the individuals they are. Our protagonist, Lara Jean is an amazing protagonist and for a story such as this I wouldn't have wished for anyone else. The familial bond between all of them, because of the past they share, or because of the responsibility they have towards each other is mesmerising.The story’s plot is that Lara Jean wrote letters to all the boys she has loved, they may be perceived as love letters but to her they are good bye letters. She writes down every single thing she feels towards them and by doing so she is free of the all consuming live she bears for them. But someone has posted these letters to the boys they were written for and her heart will face the most arduous experience in her life. This is the plot but all the little bits surrounding this plot are what makes the story so phenomenal. They add that tiny piece of love that completes this work of art. This story had me hanging on every syllable and I am a fool to have not picked this up earlier. The story was written from the heart and I wouldn't have it any other way. Love emanates from this book and I couldn’t help but reciprocate. Jenny Han has written one of the best contemporaries I have read and I rate it 5 stars without second thought.\n\"Love is scary: it changes; it can go away. That's the part of the risk. I don't want to be scared anymore.\"\n"}, {"Review": "MOVIE REVIEW:I loved it!!! (Hello, Peter! 😍)It was just the goddamn cutest. They captured the feel of the book so perfectly and now I want to reread them again. I really hope there’s an adaptation for the other two books.Netflix did good. Highly recommend. Book review:This is a great book if you're in the mood for something light and fluffy or in my case, you're trying to get out of a slump. The voice and tone of the book is young, which does at times, come across as really immature and childish. But it follows the life of a 16 year old girl and all the drama and pettiness that you have to deal with at that age, I guess. But there's a great family dynamic that I loved. An easy and enjoyable read."}, {"Review": "“Do you know what it’s like to like someone so much you can’t stand it and know that they’ll never feel the same way?” To All The Boys I've Loved Before  is as quirky and cute as its protagonist.After the first few pages, I wasn't sure I would finish this book. Everything seemed so picture perfect, so girlie. The way Lara Jean always said \"Daddy\", how Kitty outwitted any other living nine-year-old, etc. But I'm glad I kept reading, even though the plot wasn't overexciting and very predictable. Nothing new or original, but nevertheless a lot of fun.By the way, the film is one of the best contemporary teen films ever. It added a touch of humour that the book was lacking, it had a super talented main actress, it was completely without second-hand embarrassment and awkward cringe scenes, and I enjoyed every second of it.Find more of my books on Instagram"}, {"Review": "Re-read 8/20/18: Okay so it has to be said: movie Peter > book Peter, and book Josh > movie Josh. However we all know that John Ambrose McClaren >>>>>>>> everyone and that’s the tea Re-read 4/27/17: I cannot even begin to tell you guys how much joy re-reading this book brought me. I love the Song girls so much. So so so so so so so cute. Original read 4/26/14: Hands down, my favorite Jenny Han book. I loved the writing and the fashion and the boys and the FOOD hahahahah it was just so cute! I need the sequel in my life"}, {"Review": "\nReturning To the Starting Point: My (Book)Spoilery Review of To All the Boys I’ve Loved Before\n“You'd rather make up a fantasy version of somebody in your head than be with a real person.”\nKnowing this book would be waiting for me upon completing Always and Forever, Lara Jean made it a bittersweet reading experience, revisiting where it all started.*slowly turns into a fan-page for the TATBILB series.*I took a bit of an odd journey with this series, what with watching the Netflix adaption first (having read the first two books back in 2015, I counted on my scarce memory to have my back when watching the film), then turning to reading P.S. I Still Love You by Jenny Han to refill on the charm that is John Ambrose McClaren, and having to top it off with Always and Forever, Lara Jean. Now, here we are at the end of the road with \n  To All The Boys I’ve Loved Before\n where it all starts: Chris's leather jacket. She must've been right about how bomb that jacket is because it's pretty much what stirred all the following events to fall into domino-like place.All this leads to me finally taking notice of the titles for the series, which all add up to read like a letter: Book 1 is the opening line: To All The Boys I’ve Loved Before. Book two is when you want to add something quickly, just before the end: P.S. I Still Love You. And book three is the big finale: Always and Forever, Lara Jean.Let's recount:• Coming into this from the last book, it's interesting to see the many parallel lines drawn between Margot and Lara Jean's coming-of-age, from leaving home for the first time to first loves and taking care of your family. Margot is one of the most fascinating characters to me in how she took on so much responsibility at such a young age, so my heart went out to her when she finally shared just how much she has to calculate her every move because there are two little sisters looking up to her:“You know what Mommy would always say to me?” She lifts her chin higher. “ ‘Take care of your sisters.’ So that’s what I did. I’ve always tried to put you and Kitty first. Do you have any idea how hard it was being so far away from you guys? How lonely it was? All I wanted to do was come back home, but I couldn’t, because I have to be strong. I have to be”—she struggles for a breath—“the good example. I can’t be weak. I have to show you guys how to be brave. Because . . . because Mommy isn’t here to do it.”She couldn’t even afford to be vulnerable about her aching for them because she needs to set an example. My heart sings when she's with her little sisters. She somehow knows exactly what to say to get them moving in the right diction.“When other adults find out that my dad is a single father of three girls, they shake their heads in admiration, like How does he do it? How does he ever manage that all by himself? The answer is Margot.”• Which brings me to my next point: LJ's infatuation with Josh returning conveniently with Margot's absence is more of a sign of her clinging onto someone that’s similar to her sister, rather than LJ’s radical love for him.• I appreciate how close the film for TATBILB stuck to the source material. I recalled zero-to-none events going into, so it caught me off-guard that the running track where Peter first tells Lara Jean about receiving the letter is present in both the book and movie.#Peter “it’s never gonna happen” KavinskyThe edit nails it, especially in this scene:“During chemistry, Peter writes me a note that says, Can I come over tonight to study for the test?I write back, I don’t remember study sessions being in the contract. After he reads it, he turns around and gives me a wounded look. I mouth, I’m kidding!”• The film succeeds in granting book Lara Jean her wish during the horror revelation of Peter Kavinsky's letter::“It came in the mail? To your house?”“Yeah.”I feel faint. I actually feel faint. Please let me faint right now, because if I faint I will no longer be here, in this moment. It will be like in movies when a girl passes out from the horror of it all and the fighting happens while she is asleep and she wakes up in a hospital bed with a bruise or two, but she’s missed all the bad stuff. I wish that was my life instead of this.”• As soon as I started reading so many incidents from the book came rolling back into my mind, and it made me recall how utterly hilarious To All the Boys I’ve Loved Before is. I read it right after completing the Harry Potter series with The Deathly Hallows, after which I felt... hallow... so having this book suck me right in, which I deemed an impossible task right then, had me beaming.I remember, in particular, hysterically laughing at LJ's incident with Margot's doll (bonus points for naming her Rochelle) and the toothpaste. It had me in fits of laughter for days, so much so that I took a screenshot to keepsake on my phone for those much-needed pick-me-up moments. For old times' sake, I have to share it here:“Rochelle was Margot’s only doll. She adored her. I remember begging Margot to let me hold her, just for a second, but Margot always said no. There was this one time, I had a cold, and I stayed home from school. I crept into Margot’s room and I took Rochelle, I played with her all afternoon, I pretended Rochelle and I were best friends. I got it into my head that Rochelle’s face was actually kind of plain; she would look better with lipstick on. It would be a favor to Margot if I made Rochelle more beautiful. I got one of Mommy’s lipsticks out of her bathroom drawer and I put some on her lips. Right away I knew it was a mistake. I’d drawn it on outside of her lip lines, she looked clownish, not sophisticated. So then I tried to clean off the lipstick with toothpaste, but it only made her look like she had a mouth disease. I hid under my blankets until Margot came home. When she found the state Rochelle was in, I heard Margot’s scream.”That scream in my head is so dramatic.Funnily enough, revisiting those scenes that were so big in my head, now reduced themselves on the page. Same with the epic Halloween scene that I had a weakness for, where I recalled Peter and Kitty bonding, but in my mind, it was with words and not through their (epic) dance-off. In reality, I only laughed at the memory of laughing while rereading.But still, we have to share them moves:“Our big finish is splits, with our arms crossed for emphasis.Peter’s bowled over, laughing his head off. He claps and claps and stomps his feet.When it’s over, I try to catch my breath and manage to say, “Okay, you’re up, Kavinsky.”“I can’t,” Peter gasps. “How do I follow a performance like that? Kitty, will you teach me that pop-and-lock move?”Kitty gets shy all of a sudden. She sits on her hands and looks at him through her lashes and shakes her head.“Please, please?” he asks.Kitty finally caves in—I think she just wanted to make him work for it. I watch them dance all afternoon, my little sister the ninja and my pretend boyfriend Spider-Man. First I laugh, but then a worrying thought comes out of nowhere—I can’t let Kitty get too attached to Peter. This is temporary. The way Kitty looks at him, so adoringly, like he’s her hero. . . .”Honestly so, so mad the movie missed this epic opportunity to show them off like this...• I have to circle back on Lara Jean and Peter way back to her first letter because I didn't remember a thing she wrote, so I have to say I was beyond impressed with thirteen-year-old LJ:“And now that the year is almost over, I know for sure that I am also over you. I’m immune to you now, Peter. I’m really proud to say that I’m the only girl in this school who has been immunized to the charms of Peter Kavinsky. All because I had a really bad dose of you in seventh grade and most of eighth. Now I never ever have to worry about catching you again. What a relief! I bet if I did ever kiss you again, I would definitely catch something, and it wouldn’t be love. It would be an STD!”Savagery.I low-key piqued at future Lara Jean in Always and Forever, Lara Jean because she had the perfect opportunity to revisit this letter she wrote to her seemingly dream-boy to catch her reaction now, and it was totally brushed aside. The timing was perfect, as well, given her confused state on how things will move forward, she could've gone back to how it all started.• Since this book chronicles the start of Lara Jean's thing with Peter, it now makes sense as to why in the following books LJ is constantly on his case, bickering and teasing, given that is how they started out. They're pretty much hate-to-love, at this point.“I think throwing Peter off guard could be a fun hobby for me.”Since Peter K.'s confidence depends upon the approval of others, they start hitting it off when Lara Jean gets along well with Peter's lacrosse team buddies. Also, of course, his mother's approval.Personally, I really came to appreciate the tiny gestures and acts of kindness Peter extended towards Lara Jean, even something as simple as holding her backpack for her. Or that incomparable scene of him coming over to Lara Jean's to invite her to a game, which leads to him helping out with the cupcakes for Kitty’s PTA bake sale, featuring that one moment that makes everyone stop for a beat:“Well, if it’s for Kitty, then Kitty should be helping.” Peter hops off the stool and comes up to me and slides his hands around my waist and tries to untie my apron strings. “Where is the kid?”I stare at him. “What . . . are you doing?”Peter looks at me like I’m a dummy. “I need an apron too if I’m going to help. I’m not trying to get my clothes all messed up.”Kitchen scenes with getting all up in each other's personal space GET TO ME. I can't help but think of this moment with Noora and William from Skam when he's preparing her cocoa drink and subtly leans over:SourceWhen Peter ends up helping Kitty out with her experiment, while waiting for Lara Jean to get ready, it was the cherry on top of one of the best scenes in the book for me.“I run to Margot’s room for her big grandpa cardigan, and I pass Kitty’s open door, where I see Peter and Kitty lying on the floor, working with her lab set.”While I'm at it, talking lazy circles around each other in the library is something I'm always here for:“What do you and Chris even talk about?” he asks. “You have nothing in common.”“What do we talk about?” I counter.Peter laughs. “Point taken.” He pushes away from the wall and puts his head in my lap, and I go completely still.I try to make my voice sound normal as I say, “You’re in a really strange mood today.”He raises an eyebrow at me. “What kind of mood am I in?” Peter sure loves to hear about himself. Normally, I don’t mind, but today I’m not in the mood to oblige him. He already has too many people in his life telling him how great he is.“The obnoxious kind,” I say, and he laughs.“I’m sleepy.” He closes his eyes and snuggles against me. “Tell me a bedtime story, Covey.” Also, the quick road trip to an estate sale, bothering to bring each other food (donuts and a sandwich) and getting to know each other by asking random questions, like specifying your absolute favorite food, or racing The Epsteins, was a nice bonding moment. Though his constant lateness is starting to trip me up...He's very loyal to his people, but I feel like the main conflict for him is that he doesn't quite know where his loyalties lie within this book: Genevieve or Lara Jean. Which makes for some hair-pulling annoying scenes.• I got weirdly emotional with Chris in this book, what with returning to her younger days and her angst after seeing her in Always and Forever, Lara Jean. My heart squeezes at the memory of them. She'll grow so much.• My only hindrance is that I chose to read this on Yom Kippur, knowing this was the only light-hearted book that would keep me intact, but I didn't account for the fact that Lara Jean's whole life circles baked goods and at a certain point it got to be too much for me. There are SO MANY MEALS discussed here, including the intricate details of making them, and I was bursting to shout \"Some of us are hungry, Lara Jean...\"• I was a tiny bit worried that I'd get stuck on the fact this is the Hebrew translated version since I'm always wondering how it was worded in the original when reading translated fiction. But I was pleasantly surprised to find said feeling diminished while reading TATBILB (could be because I originally read it in English, but still). Interestingly enough, Gen and (Lara) Jean are written the same way in Hebrew: ג׳ין, which made me ponder.It's been so long since I devoted myself so fully to marathon a series of books. The last was with Maggie Stiefvater's The Raven Cycle, and not to sound like Granny Lara Jean, as Chris (and Peter) so lovingly calls her, but it was the best of times. If you have a good book waiting for you at home, practically nothing can touch you.If you’re interested in buying To All The Boys I’ve Loved Before, just click on the image below to go through my Amazon Affiliate. I’ll make a small commission!\nSupport creators you love. Buy a Coffee for nat (bookspoils) with Ko-fi.com/bookspoils\nThis review and more can be found on my blog."}, {"Review": "This was...fine.-----https://emmareadstoomuch.wordpress.co...FULL SERIES REVIEW: https://emmareadstoomuch.wordpress.co...-----Like...it didn’t take a long time to read. It was fun sometimes. Significantly less fun at others. Good characters, bad characters, couldn’t-care-less-will-forget-their-names-ASAP-could-you-BE-any-flatter characters. It was just a very eh read this time around.Well, I can say a lot. This is me we’re talking about, guys. You could hand me a sewing machine instruction manual and I’d end up writing a thousand-word review on the “not like other girls” trope.Which, speaking of...That beast rears its ugly f*cking head in this book. Good lord. Most books go for the subtle infusion of girl-hating, like...lowkey slut-shaming, or something. No, this book drops it right in there. Shamelessly, in the middle of some dialogue. Direct and straight to the veins: “You’re not like other girls.”And it doesn’t end there. Okay, wait. I’m getting ahead of myself. For the six Goodreads users who haven’t read this book, we follow Lara Jean, a very cutesy lil thing who wears ribbons in her hair and calls her father and dead mother “Daddy” and “Mommy.” She has two sisters, Margot, the replacement mother who leaves for college at the beginning of the book, and Kitty, who is nine and my absolute life force. When Lara Jean wants to get over a crush, she writes a letter, puts it in an envelope, adds the address and return address for some reason, and then puts it into a box, never to be seen again.God, I love Michael Scott. Anyway, all of Lara Jean’s letters get sent - gasp! Including the one to her family friend and sister’s newly-ex-boyfriend, Josh. In order to avoid any awkwardness, Lara Jean immediately launches into a Fake Relationship™ with popular boy extraordinaire and letter recipient Peter Kavinsky. It makes very little sense. But then again, fake relationship storylines rarely do.So, Josh is the skeezeball who brought you that delightful incorporation of the not-like-other-girls trope, and he has more hits coming! Notably, when rubbing his dumb little nose in Lara Jean and Peter’s relationship: “You don’t act like you. You act like...like how all girls act around him. That’s not you, Lara Jean.”Also, there are like, no healthy girl friendships in this book. Lara Jean has one female friend, Chris, who has no characteristics except being rebellious/slutty and rarely communicates with Lara Jean, except to make fun of her. (Oh, my God. I am barely into this review and I am already so tired of typing out “Lara Jean.” GET A ONE-WORD NAME.) Lara Jean makes a handful of friends in this, kind of, but they’re all male and Peter’s. And a girl is also the total villain here. So that sucks. Not a female-friendly or feminist book.Except...the sisters. Yay, the Song sisters. I love them so much. (Mostly Kitty.) Their relationship is a tad idyllic, except when it suddenly veers into Drama, but it’s so cute and fun to read about them. Especially Kitty. Ah, Kitty. She’s not realistic, but she’s a teeny, manipulative nine-year-old badass who says stuff like “I want to watch my shows.” Ugh. Please give me a book that’s just Kitty. A TRILOGY that’s just Kitty. I'm tempted to put this book on my i-love-these-characters shelf on her merits alone. (But there's an S on the end of characters, y'all, so I can't, and I shan't.)Let’s talk more about the characters. Lara Jean, as I mentioned, is a baby. So that’s pretty exhausting. She’s just, like, very immature and everything freaks her out and she cries a lot. She’s also a bad sister a lot of the time. Like, Margot will be in flippin’ SCOTLAND and she’ll email her like “School is fine for me. Boring, boring. No further questions.” Plus she makes fun of Kitty for having a crush in front of her crush. HOW COULD YOU.In terms of the male characters...Josh is the worst. I never saw his appeal, let alone why all three Song sisters would have a crush on him at the same time. Let alone why Lara Jean would threaten her relationship with her best friend/sister over him. He’s a total snoozefest and a dweeb and he says stuff like what I’ve quoted above and he’s the worst.Peter is also just so eh. I probably liked this book more when I first read it because I probably had a crush on a him-type at the time. Like, some sporty popular guy who was funny but also kind of a d*ck and I wanted to ignore all red flags and pretend he was into me.No shame if that describes you. We all go through it, man. That’s what high school is, in a nutshell.Anyway. I’m not very into that type anymore, so ol’ Pete just didn’t do it for me. He just seemed kind of skeevy, even manipulative - a couple times Lara Jean says things like, “Peter always has a way of getting me to do things I don’t want to do.” Give me the nerdy type any day, man.More good stuff: This book is real descriptive and I loved it. There’s always an in-depth look at Lara Jean’s outfits, and the mentions of food made me get up and cook something twice. TWICE. A grilled cheese and some snickerdoodles. (Well, in reality there wasn’t enough sugar to make snickerdoodles, but I’ll get there.)When I first started reading this - like, first fifty pages or so - I thought this was going to be one star. So many dumped-in descriptions and the writing was really choppy and it was just...ugh. I knew that past-me was a far kinder reviewer, but I didn’t think it was a four-star difference.And then, it got better!And then, it got bad again.The ending of this book was so awful! I can’t believe it was supposed to be a standalone originally. It was just so rushed. The sister relationship was suddenly healed, the relationship drama was suddenly over, Josh suddenly didn’t suck with no explanation. Bleh. And then it just...ended. Literally on a fragment of a sentence. Guh.Bottom line: This wasn’t awful. It was exactly eh."}, {"Review": "EDIT 8/2/2014: Marking this down to one star. My original 3-star review can be found below.Let's kick off this review with a little music:Look at me, I'm Lara Jean!Lousy at figuring out mysteriesWon't drive a car unless I absolutely have toI can't! I'm Lara Jean!Watch it! Hey, I'm Miss Goody Two-shoesI was not brought up that wayScandalized byPeter cheating off a quizBecause cheating is so wrooooong.That, ladies and gentlemen, is our protagonist. The girl whose head we have to live in for 288 pages. The saintly, ineffable Lara Jean.\n\"I brighten up and then I remember how Margot said I'm in charge now. I'm pretty sure taking responsibility for one's mistakes is part of being in charge\"\nIn other words, the new Hannah Montana.Lara Jean is a half-Korean, half-American teenager (the book never lets you forget this) and the story starts with her big sister Margot leaving for college, thus, breaking her now ex-boyfriend's heart. Lara Jean helps pick up the pieces because unbeknownst to anyone, she's been crushing on Josh for years. But since he's Margot's, she bundles up her feelings, only expressing them through a letter and hides that letter away along with others dedicated to the boys she's loved over the years. But one day, those letters are sent out and LJ, on impulse, decides to fake-go out with another letter recipient, Peter from grade school, to show Josh how she's totes not into him. How will this love triangle end?Honestly though, I may make fun of it, but I actually liked the romance element. It was sweet and Lara Jean's gradual feelings for one boy made me smile multiple times while I was reading. The main problem was Lara Jean. She is extremely, near painfully innocent. She calls her dad Daddy. She doesn't like swearing. She is absolutely scandalized when she finds out Peter cheated on a test in seventh grade.This is not a teenager. This is your local kindergarten tattletale, who will inevitably get the stars punched out of her eyes when she goes out into the real world. Or my house works too.Her love interest, Josh is no better. He's the one who told on Peter for cheating. Seriously, who the hell does that?Peter was the most realistic out of the three. He's not perfect or particularly sensitive. He teases Lara Jean. He has a tendency to take the last piece of food without asking people. And when his friends confront him on whether he had sex with Lara Jean, he reacts the way I think a normal teenage guy would—by neither confirming or denying anything and letting the rumors run its course. But he can also be incredibly sweet without bordering on wish fulfillment. He apologizes to Lara Jean for the rumor thing. Peter is not a douche nor is he a Ken doll. He's a regular boy, trying to do right by his fake girlfriend. And I love him for it.The plot is alright, though anyone with two functioning brain cells could've figured out who sent the letters. Plus, I don't see the point of Lara Jean's wild best friend, Chris. Her existence has no weight on the plot or Lara Jean's character. I personally think the author just stuffed her in so Lara Jean can have a semi-social life that consists of leaving the window open so Chris can sneak in after a night of bar-hopping.The ending is satisfying if a tad open-ended. But I cannot, for the life of me, figure out why there needs to be a sequel. (view spoiler)[We've already established that Josh is off-limits and Lara Jean is in love with Peter. The author could've tacked on one more chapter with them getting together for real this time and that should be it. I would've even been happy with the ending as it is now. But I guess cash is powerful incentive for dragging out series.  (hide spoiler)]To conclude, if you enjoy rainbow sprinkled-romances and don't mind Disney-sitcom-ish heroines, this book is for you. At the very least, it'll teach you not to hide your most prized possessions out in the open. Live and learn, Lara Jean, live and learn.Rebel of the SandsTo All the Boys I've Loved BeforeThe Last Ever AfterAristotle and Dante Discover the Secrets of the UniverseThe Afterlife of Holly Chase"}, {"Review": "This book was so dramatic and childish that I just could not enjoy it. Lara Jean's plan was so foolish and the love triangle in this was so irritating that I found myself craving the scenes that focused on family rather than relationships. I gave this book some stars though because I listened to it on audiobook in two sittings and it was rather addicting, even though I hated Peter and the ending was a bit of a let-down. You might like this if you're into dramatic, cheesy YA books about jealousy and angst and love triangles, but it was not my cup of tea. Which is a shame, because I really liked The Summer I Turned Pretty."}, {"Review": " 3.5 Stars \n”It's not like in the movies. It's better, because it's real.”\nDoes this need introduction at this point??Pros:- Asian FMC! And she’s allowed to be soft and tough and everything in between! - Lucas is precious and deserves all the ascots he wants. - Peter Kavinsky comes over and helps Lara Jean bake cupcakes while she’s in her sweats. Need me a freak like that.- It’s actually an inventive take on the fake dating trope. - There’s this whole thing about growing up and learning to say goodbye without writing-off people and experiences that happened? And I just really dug it.- The ending line is perfect and I’m high-key okay with pretending the series ends there. - I’m here for sisterly relationships and Margot was actually my favorite. Sis has a level head on her shoulders.- Lara Jean starts seemed really immature, but it becomes apparent that she’s just never had to do things for herself because Margot and her dad protected her and Kitty? So watching her grow was so nice and she’s such an easy character to root for.- The freaking notes, man. Love me a flirty, confident boy who’s actually all soft and notices the little stuff.- Like that freaking yogurt y’all. - And the whole hot tub scene- and when she screams out the window because they are racing the old couple. I ship it.Cons - Josh was just kind of... there? I don’t understand what Lara Jean saw in him because I don’t understand him. He was so bland and had literally no personality?? LJ acted like they were friends... but I pulled out my spectacles and I still see nothing.- No junior in high-school says beeytoch completely seriously. - Why were these sisters so demanding about the other’s love life- Genevieve was one-dimensional mean-girl and hung up on middle school drama. (And I haven’t forgiven movie-version of her for the scrunchie)- What was the drama at the end and why. Lara Jean just like instantly believed every bad rumor and I’m still not sure why she was mad or why Peter was mad and maybe I’m just old. In Conclusion: It’s cute and it accomplishes what it sets out to. The characters are all enjoyable and though there’s a lot of drama, it’s also hard not to smile.Movie is hella cute too, with awesome aesthetics that match the book.Buddy ready with #1 BJ the dinosaur stan."}, {"Review": "I'm between 4 and 4.5 stars.Lara Jean has written five love letters. There is one letter for every boy she's ever fallen in love with, however brief the infatuation. But she never sent any of the letters to the objects of her affection—she saves them in one of her most prized possessions, a teal hatbox her mother gave her before she died.\"They're not love letters in the strictest sense of the word. My letters are for when I don't want to be in love anymore. They're for goodbye. Because after I write my letter, I'm no longer consumed by my all-consuming love. I can eat my cereal and not wonder if he likes bananas over his Cheerios too; I can sing along to love songs and not be singing them to him. If love is like a possession, maybe my letters are like my exorcisms. My letters set me free. Or at least they're supposed to.\"While Lara Jean has loved five boys, she's never had a boyfriend. She's been kissed a few times (mainly in 7th or 8th grade), but she's always been content to watch from the sidelines, even play third wheel to her older sister Margot and her boyfriend Josh (on whom Lara Jean has always had a bit of a crush). But when Margot goes to Scotland for college, Lara Jean suddenly must start taking more responsibility for helping her dad and her younger sister, while buckling down for the all-important junior year of school.But everything changes in a split second when somehow, Lara Jean's love letters get sent to their intended recipients. Suddenly she finds herself having to confront her feelings, in many cases feelings that had long since dissipated. Yet in an effort to uncomplicate things, she actually makes things even more complicated, and she realizes that there's a fine line between pretending how you feel and really feeling. And either way, someone is bound to get hurt in the crossfire.\"I don't want to be afraid anymore. I want to be brave. I want...life to start happening. I want to fall in love and I want a boy to fall in love with me back.\"I haven't seen the Netflix series based on the book, but I really enjoyed \nTo All the Boys I've Loved Before\n. It's charming, sweet, poignant, funny, even frustrating at times—just like the teenage years. This is one of those books with a lot of heart, one you want to keep reading even though you pretty much know how the plot will unfold, and you don't really care.Jenny Han is a really engaging writer, and she evoked a lot of nostalgic feelings for me about crushes and jealousy and being afraid to share your true feelings. And more than that, she reminded me of the pain and angst and embarrassment which occurs when your most private thoughts get shared with the object of those thoughts! (Ugh.)This is the first book in a trilogy. I hope the next two are just as enjoyable, although it will be interesting to see where Han takes her characters. I'll certainly be checking them out! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"Review": "4.25⭐If you've read my review of  Geekerella by Ashley Poston then you probably already know that I was never a huge fan of contemporary novels. In fact I used to despise the genre as a whole and to be honest I don't know why. After reading this book I kind of grasped at the reason why people enjoy this genre so much because, much to my surprise, I have too.\n “It's not like in the movies. It's better, because it's real.” \nThis book follows Lara Jean who, as your average high school teenager, tends to have crushes on guys. Every time she has a really intense crush, she writes a letter to him but never sends it. Instead she stores the letter-which she pours all her deepest feelings into- in a hatbox in her room. One day, she finds out all her letters have been mailed and her life spirals out of control.Ok so first of all I didn't plan on reading this book. I only read it because my friend was obsessing about it non stop. So, just to see what all the hype was about, I began to read. And read. And read. Before I knew it, I was done. This book got ahold of my complete undivided attention right from the first chapter. I love Lara Jean's relationship with her family and Lara Jean herself so much.\n “You'd rather make up a fantasy version of somebody in your head than be with a real person.” \nWhat I actually didn't like as much in this book were the relationships. Sure, they were fun to read about but I feel like I wasn't as emotionally invested in them as I wanted to be. Or as much as everyone else was but this is just my opinion. I liked Peter Kavinsky as person and sure he and Lara Jean would probably be great friends but beyond that? Maybe to you but not to me.Overall, I would recommend this book to everyone because it's a book that'll definitely make you happy, gushing on the inside and have you picking up the next one right away and I can guarantee that it'll be one hell of an emotional rollercoaster. Also if you've already read this series then watch the movie on Netflix because as far as adaptations go, this one was pretty well done.\n “I don’t have to be so afraid of good-bye, because good-bye doesn’t have to be forever.” \n"}, {"Review": "“Love is scary: it changes; it can go away. That's the part of the risk. I don't want to be scared anymore\".¿Por qué este libro tiene que ser tan adorable? ¿Por qué no lo leí antes? ¿Por qué lo terminé sin tener el siguiente a la mano? ¿POR QUÉ NO EXISTE PETER KAVINSKY?Desde hace siglos no leía un libro que me causara tanta ternura. Aquí todo empieza con Lara Jean, una chica de ascendencia coreana que vive en Estados Unidos con su padre y sus dos hermanas, pues su madre murió en un accidente. Margo, su hermana mayor, está saliendo con Josh, un amigo de infancia de todas las hermanas Song. Ahora, Lara Jean tiene un secreto y es que desde que eran muy pequeños, le gustó Josh. El punto aquí es que Margo y él están juntos y Lara Jean tuvo que lidiar con sus sentimientos de alguna manera... y fue escribiéndole una carta de amor. Y no sólo a Josh. Lara Jean le escribe cartas de amor a los chicos que le gustaron para cerrar ese ciclo, para desahogarse y dejar todos sus sentimientos en una carta que nunca se enviará y quedará guardada para siempre en una caja de sombreros que ella esconde en su armario. Pero, un día, las cartas desaparecen y lo siguiente que sabe Lara Jean es que están en poder de los chicos a los que se las escribió. ¡Y todo su mundo empieza a caerse a pedazos! ¿Qué va a suceder cuando Josh, que acaba de terminar con Margot porque ella se va a estudiar a Escocia, reciba la carta? ¿Y qué decir de Peter Kavinsky, el chico más popular de toda la secundaria? ¿Qué van a pensar de ella? To All The Boys I've Loved Before es la perfecta comedia romántica con un toque de drama adolescente. Lara Jean es una chica que toda su vida ha preferido vivir el amor a través de los libros y las películas, pues la vida real es bastante aterradora cuando se trata de poner tu corazón en juego. Así que cuando todas sus cartas salen y los chicos leen sus palabras se siente más vulnerable que nunca. Lo bueno aquí es que, poco a poco, gracias a nuestro adorable Peter Kavinsky, Lara Jean va a darse cuenta de que disfrutar la vida no es tan difícil como parece, que tener una relación-no-relación con alguien puede ser divertidísimo si encuentras a la persona adecuada. Aunque también se va a dar cuenta de que los sentimientos pueden tomarte muy por sorpresa y poner tu mundo del revés sin que te des cuenta. A lo largo del libro empezamos a conocer mucho mejor a Peter Kavinsky, este chico que dicen que es prepotente, cansino y, sobre todo, mujeriego. Y tiene algunas de esos defectos, pero también es un chico súper dulce, que está intentando superar a su primer gran amor y que, además, se preocupa muchísimo por las personas cercanas a él. Gánate el corazón de Peter Kavinsky y nunca más lo vas a querer dejar ir. Es un chico que tiene muchas facetas, que tiene que mantener una fachada en la secundaria, pero que en el fondo (y no tanto) es tremendamente dulce, dedicado y divertido. Y, por supuesto, Lara Jean va a darse cuenta de esto muy pronto y va a pelear consigo misma para no enamorarse de él... pero todos sabemos cómo acaba eso, ¿verdad? El otro chico interesante aquí, y al que no le hicieron nada de justicia en la película, es Josh. ¿Se imaginan que les guste alguien, pero que ese alguien nunca diga nada y luego aparezca la hermana de ese alguien y te empiece a gustar y entonces decides salir con ella y olvidar al alguien inicial? Pues eso le sucede a Josh con Lara Jean y Margot. Y es complicadísimo. El pobre chico, al que acaban de dejar y al que le acaba de llegar una carta de amor de la primera chica de la que se enamoró, está muy confundido. Dividido entre la lealtad y el querer explorar lo que nunca fue se hace un lío... y por extensión Lara Jean también está en una posición rarísima por aquello de que es el ex de su hermana. En fin, que dramas aparte, Josh es un chico que también se merece un lugar especial. Como les decía, este libro es una comedia romántica llena de líos amorosos, de relaciones de mentira, de sentimientos escondidos que van surgiendo y de pequeños detalles que sumados son el mundo entero. Así sentí la historia de Lara Jean con Peter y con Josh. Y, aunque no quiero decirles cómo acaba, sí que puedo decirles que amé absolutamente todo. Adoré cómo fue creciendo un sentimiento súper especial entre dos de ellos sin que se dieran cuenta siquiera, adoré la sencillez y pureza de los diálogos, de las peleas, de las emociones. To All The Boys I've Loved Before es un libro muy transparente y que tiene suspiros garantizados. Ahora, impresiones cortas: odié a Gen, me cayó fatal Margot, el papá de Lara Jean es lo más cool de la vida, tengo serios conflictos con Kitty aunque era pasable cuando estaban con Peter. El final: EL FINAAAAAAL. O sea, compré este libro porque sabía que iba a salir la película y tal, pero cuando lo terminé y quedó en punta fue como ¿quééééééé? No tenía idea de que esto era una trilogía, silly me. En todo caso, sepan que muy pronto voy a leer el segundo porque necesito que Lara Jean y Peter Kavinsky sean felices por toda la eternidad. "}], "Genre": "Romance", "ID": "15749186", "Desc": ""}