{"Name": "The Paragon Hotel", "Image": "https://images.gr-assets.com/books/1522566322l/37970853.jpg", "Reviews": [{"Review": "Superbly written historical novel exploring racism, violence, and extremist groups in America in the 1920's. While this novel takes place in the past, its subject matter resonates in the current moment.Alice James has a knack for blending in. She can become part of the background, enabling her to go unnoticed and listen in on very important conversations. She also can stand out, if need be. She can be anyone or no one. Her nickname, Nobody, suits her perfectly. In the early 1900’s in Harlem, she uses her unique abilities to become an asset for the Mafia. Portland, Oregon 1922. The Paragon Hotel--an all-black hotel in a state being infiltrated by the KKK. Racial tensions are high, especially since it was not legal for black people to reside in Oregon during this time period. A white traveler with a bullet wound is brought in to recover. A little boy goes missing. Tension builds, the KKK makes their presence known in a brutal and tragic way. I absolutely loved The Paragon Hotel. It’s well-written and the characters are multidimensional. I found Nobody and Blossom’s characters to be especially fascinating. Nobody is a dynamic narrator--her voice is strong and drew me in. I was interested in both her past and present and was dying to know her deep dark secrets. The hotel also plays a dominant role--the different rooms not only embody the different characters and personas, but also they hide the secrets of the guests, keep them somewhat safe, but also can expose them to harm. \n“Its dozens of windows with its hundreds of guests, all of them hiding something. All of them fighting for something. All of them frightened of something”\nWhile The Paragon Hotel is primarily about inequality and power struggles, the novel is also about friendships that defy color lines and gender norms. This is a thought-provoking read about racism, gender norms, and power dynamics. While it should highlight how far America has come, in the current moment it serves as a reminder of how America’s progress has devolved. It's clear Faye did her research--I learned a lot from reading this, as I had no idea about Oregon’s murky past. I loved the message of The Paragon Hotel and the ending. There are some horrifying moments, but also some beautiful ones. \n“It’s not a book. This was never a book. This is a love letter.”\nI received an ARC of this book from Edelweiss and G.P. Putnam’s Sons in exchange for an honest review."}, {"Review": "My Ratings: 3.5 out of 5 starsGenre:\t Historical Fiction MysteryPublisher:\tPENGUIN GROUP PutmamPub. Date:\tJanuary 8, 2019In a nutshell, this novel is about racism and the American underworld in the early twentieth century. The novel begins in 1921, during the time of America’s Prohibition. A young white female protagonist is on a train out of Harlem running to escape her Mafia boss who is displeased with her. She is suffering from an untreated bullet wound. A black male Pullman porter takes pity on her and brings her with him to his home in Portland, Oregon, which happens to be in an all-black hotel. The story goes back and forth in chapters and settings from NYC to Oregon. This is a difficult review to write since I had different opinions throughout the novel on whether I did or did not like the book. I appreciate that the alternating settings begin with a real quote from each area’s non-fictional newspapers. Plus, the author has historical endnotes. Good research is always a plus in historical fiction. I liked that the author chose that the scrappy little kid character, who grows up to be a mobster, is a girl rather than a boy. This is unheard of in most mob stories. I got a kick out of learning that at one time Harlem NY had a large Italian population know as Little Italy. As a native New Yorker, I really should have known this. For me, Little Italy is the infamous neighborhood located in the Lower East Side of Manhattan. (I used to push my, now grown, baby in a stroller right there on Mulberry St.) And I thoroughly enjoyed how skillful the author is in immersing the reader in the feel of the era. I was hooked on the visuals and the slang of the times. I was expecting Bogey or Cagney to materialize on any given page. Then the historical fiction morphs into a mystery. Although it is a well-written mystery, it is not needed to enhance the already interesting tale on the happenings of the young woman’s two lives: One in white America and another in black America. Both are filled with police that are as corrupt as the mobsters. Nor was I wild about a couple of twists that seem thrown in for good measure. They are decent twists, but again, not needed. Maybe I just don’t care for the mixing of genres. I also was not pleased that in this book, and recent others is that the theme and characters are pointedly aligned to this current dysfunctional White House administration. I am growing weary of all the new historical novels that make anti-Trump statements without using his name. (And, I am no fan of the 45th American President). In this tale, I read over and over how in the 1920s the KKK expanded into the north because of the hatred against people who deemed not “truly” American. Their motto was “America First.” Sound familiar? I am aware that these historical connections need to be repeated in words to serve as reminders of what can happen when politics run amok. But, after finding this Trump-metaphor linking trend so often I, as a reader and a reviewer, need a breather from political teachable moments in my fiction. After writing down my thoughts on the pros and cons in “The Paragon Hotel,” I discover I am still confused on whether I would recommend the book or not. I guess it depends upon what your expectations are when venturing into the story. I was not expecting a mystery. Hopefully my confusion will help give you a clear picture of what you may like or dislike in the story. I received this Advance Review Copy (ARC) novel from the publisher at no cost in exchange for an honest review.Find all my book reviews at:https://www.goodreads.com/review/list...https://books6259.wordpress.com/https://twitter.com/NeesRecordhttps://www.facebook.com/martie.neesr...https://www.amazon.com/gp/profile/amz..."}, {"Review": "Who is Alice James? Why does she reference herself as \"Nobody\"? What are the circumstances that led to her being on a train bound for Oregon?So begins the tale of Alice James, aka \"Nobody\", fleeing NYC with a bullet wound festering, on the run from the Mafia. It's 1921, Prohibition has been initiated, Mob violence in Little Italy is rampant and Oregon seems to be a safe distance from those who wish Alice dead. Befriended on the train by Max Burton, the Pullman porter in charge of her cabin, Alice is taken to the Paragon Hotel, an all black hotel in Portland. Alice is white, but in desperate need of Dr. Pendleton, owner of the hotel, and an accomplished doctor. Alice soon comes to learn of the intolerance Oregon has for African Americans, and the rising influence of the KKK. When a young mulatto boy goes missing, Alice feels compelled to help her newfound friends find the child, leading to disastrous consequences.There were so many layers to this story that made it truly engrossing. It delves into racism, bigotry, violence and mental illness, yet also highlighting friendship and love. A couple of my favorite quotes: \"We go through our lives, so many of us, as fractions of ourselves, with all the other puzzle pieces buried where no one can see them. But there's the paradox, and do forgive me for flights metaphorical-we're all of us fractured jigsaws, but we're also the entire picture no matter how far away we walk from what's hidden.\"\"When I've pushed the spinning glass round and the Paragon Hotel spits me out, I turn to look back at it. It's dozens of windows with its hundreds of guests, all of them hiding something. All of them fighting for something. All of them frightened of something. That's the kicker about hotels-they aren't homes, they're more like the paragon of waiting rooms. Unless you're part of the inner circle of this one, and you burrow underneath one another's surfaces, air the cupboards, lift the drapes, and everyone is unhappy, and everyone is both cruel and kind.\""}, {"Review": "The Paragon Hotel is a fictionalized account of the one hotel in Portland that allowed customers of color through the 1930s, and the surrounding racism of the times.(I grew up in Oregon with 4th and 8th grade focused on Oregon history but we never learned about this, however it explains a lot... Even today Portland is 72% white!)I enjoyed the part of the novel set in Portland, but the parallel story set in Harlem seemed less realistic and maybe unnecessary, somewhat clogging the storyline. This is a good read for people who like the flapper jazz era but are looking for a spin on the usual.I had an eARC from the publisher through NetGalley, and the book came out January 8, 2019."}, {"Review": "It's the 1920s, and Alice James, or Nobody, is escaping to Portland when we first meet her, suffering from a bullet wound. She's taken by a porter to the Paragon Hotel, the only hotel in the town that allows African Americans to frequent. She meets a variety of fascinating people who live and work at the hotel. They view her with some suspicion, as she's white and a stranger, and the situation in Portland is somewhat tense, what with the Ku Klux Klan arriving there to cause trouble. With the disappearance of a young boy, the adopted son of a flamboyant night club singer, Blossom, tensions rise further, and the inhabitants of the Paragon, along with Nobody, begin a desperate search.I loved this! This book was phenomenal! Lyndsay Faye provides us with historical context for Portland and Prohibition. She also has Nobody narrate this tale, explaining what her childhood and recent past in Harlem, New York City, was like as a gun moll and her less than ethical past, while she contends with the incidents at the Paragon.Nobody's a fabulous character, as is Blossom, whom I fell in love with. The two of them connected immediately, as I did with this book through Nobody's voice. Which is peppered with nifty turns of phrase that sounded authentically 1920s. The phrases added lovely colour to Nobody and her approach to life. Lyndsay Faye's characterization of all the other characters was terrific and there were numerous chunks of this book that I would have highlighted for the wonderful language, and that the superlative narrator of this audiobook, January LaVoye, brought vividly to life. All I really have to add is, this was one of my favourite books this month."}, {"Review": "Set in 1921, Alice \"Nobody\" James arrives in Portland after a harrowing train ride. Not only has she fled New York, but she's also been shot and now needs a place to hide. Thanks to Max, a black Pullman porter, she finds refuge at the Paragon Hotel. The only problem? This is the only all-black hotel in the city and they are not very keen to have a white woman staying there. But with Max as well as the wonderful club singer, Blossom Fontaine, on her side, Alice stays in the hotel. However, she quickly realizes that not everything is peachy in Portland. The Ku Klux Klan has arrived in the city and a child disappears from Paragon Hotel not long after Alice has arrived...READ THE REST OF THE REVIEW OVER AT FRESH FICTION!"}, {"Review": "Alice James was born in Harlem and eventually runs for her life. Taken off the train in Oregon, the conductor brings her, injured by a bullet, to Portland's Paragon Hotel. Once there her story gets complicated and surprising. We learn why she was shot and why she ran.It is the 1920's and Prohibition is in full swing; racism is prevalent in Portland. Alice is welcomed to the Paragon Hotel to recuperate, even though she is white and the other guests black. She becomes close to Blossom Fontaine, a black actress who lives at the Paragon. She meets Davy Lee, a young black boy whom Blossom has rescued from the streets. Alice, Blossom, Davy and Miss Christina go to a carnival and experience the Fun House. While there Davy disappears. A search involving the local police ensues over many days. The Ku Klux Klan is involved as well. This story is told in first person sarcastic. Sarcastic is the voice I think Alice is using. I actually loved Alice's voice. Very unique and engaging. Reminds me of Stephanie Plum's (Janet Evanovich) irreverence.Recommend to any historical fiction lover. There is mystery and intrigue and looking for a missing child. Those of you who love mystery will love this book also. 5 stars "}, {"Review": "You can find my review on my blog by clicking here.Sometimes we read stories to escape the gruesome reality that is perpetually mediatized and sometimes we visit these stories to remind us of the lessons learned—or not—during the darker days of the past. While the events in themselves are tragic, it is the similarities that we are able to draw between an era that seems so long ago that is the most appalling. Whether it is only a decade or a century ago, mankind loves to revisit those mistakes and find ways to do worse, but even in pitch-black darkness there is light, and even in the ugly, there is beauty. One phenomenon that unfortunately continues to pervade many societies around the world turns out to be the main attraction in this novel and it is none other than racism. And so, leave it to Lyndsay Faye, author of the Edgar-nominated novels Jane Steele and The Gods of Gotham, to deliver a stunning historical fiction blended with a healthy dose of mystery with her latest stand-alone novel The Paragon Hotel that tackles a timely subject still relevant today.What is The Paragon Hotel about? Set in 1921, the story follows Alice “Nobody” James on her journey from a Prohibition-era Harlen to Portland’s The Paragon Hotel. Inflicted with a bullet-wound, looking for a safe haven to hide from a drug deal gone wrong, she rides a train heading towards Portland, Oregan. Struck with serendipity, she meets a black Pullman porter whose unselfishness brings him to offer her a home to rest at. Putting himself and others at risk, Nobody finds refuge in the only all-black hotel where her being white installs tension in the occupants’ lives. Resting, she comes to acquaint herself with some memorable figures, including club chanteuse Blossom Fontaine and understands that there is more going on in Portland than meets the eye. In fact, the arrival of the Ku Klux Klan is the ultimate catalyst to the danger to come.When it comes down to historical fiction, its ability to be immersive will always be primordial and Lyndsay Faye nails it with the era, setting and characters in The Paragon Hotel. Not only is it obvious that she put in some solid work to get the research right for this story, but she also draws upon her unbelievable skills to create authentic characters that are not only easy to imagine but who also fit perfectly within the time period. The Paragon Hotel is particularly heavier in dialogues and offers readers the opportunity to look closely at the interactions between characters, but also the language used by everyone in their daily lives. Shocking at times, they are all genuine and easily sets the conflict-filled atmosphere that still exists within today’s society. The story is also told with two interlocking narratives (past and present), where the past explores Alice “Nobody” James' life within the criminal underworld and the present explores her life among the Paragon Hotel's community. While intriguing, the constant change from one timeline to another was, unfortunately, a little less fluid than expected.What was a bit more of a surprise was how the story starts off as a pure historical fiction only to later find the mystery groove that you would usually see coming from Lyndsay Faye. The distinction between both genres was a bit too raw for my taste and a would’ve been even better if it was seamless, but it didn’t completely take away from the tone set for this story. In fact, Lyndsay Faye delivers some wonderful plot twists as the story reaches its end and does a remarkable job in exploring the history of racism that plagued Portland. With themes of race and identity at the heart of this story, she also does a remarkable job in creating incredible characters that serve as excellent vessels to convey this tale. As much as you’d expect some people to be much more open-minded and considerate about others around them without filtering them based on their race, this story does a great job in portraying the issues through the eye of a character who can take on any personality to blend in with the mass. Her unique position offers us a truly eye-opening perspective into Portland’s Prohibition-era crime romp and racial tension.The Paragon Hotel is an exquisite exploration of race and identity in a Prohibition-era Portland city with unforgettable characters and their deeply-rooted struggles.Thank you to Penguin Random House Canada and G.P. Putnam's Sons for sending me a copy for review!Yours truly,Lashaan | Blogger and Book ReviewerOfficial blog: https://bookidote.com/"}, {"Review": "What a story this is. It's a gangster/mafia story. It's a story about racism, including the KKK. It's a story about intolerance and bias. It's a story about friendship and relationships. It's a love story. It's a sad story, but yet a hopeful one. It's a story about resilience in the face of adversity. It choked me up more than once but had me amused or smiling at times also, thankfully, or I would have been an emotional mess as I finished reading.The tale begins in 1921, during the time of Prohibition, when 25-year-old Alice James, aka \"Nobody\", on the run from the mafia in NYC and with a festering bullet wound, takes the train to Portland, Oregon. She's befriended on the train by Max Burton, a black Pullman porter, who takes her to the Paragon Hotel when they arrive in Portland. Now, mind you, this is an all-black hotel and Alice is Welsh-Italian, but she's in need and Dr. Pendleton, owner of the hotel, is an extremely capable medical doctor, not to mention a discreet one.So here's Alice, the only white resident of the Paragon. She's resented at first by the others, who figure she'll bring nothing but trouble to them. Turns out, however, that trouble would find them anyway. Oregon at the time was very racially intolerant and had the biggest KKK organization west of the Mississippi River. And even many of those whites not affiliated with the KKK still defended the northern chapters as a \"political rallying tool and a charitable club. It's all America first with them...Fund-raisers, not lynch mobs.\" After all, \"they're all church-goers.\"Well, as we all know, there's church going and then there's church going. It all depends on who you decide deserves your Christian charity. And when young Davy, an orphan boy living at the Paragon goes missing, things come to a crisis point.But this isn't just a story about racial intolerance in 1920s Oregon. We also have some very personal stories of many and varied characters. Of course, top of the list is Alice, or Nobody. Born and raised in NYC, with her Italian father deceased and her Welsh mother struggling to survive as a prostitute, it seems that her inevitable career path will also be on her back. Things get complicated by her close friendship with Nicolo Benenati and his family and when their lives are affected tragically by actions of the Corleonesi mafia, Alice finds herself under the wing of Mauro Salvatici, owner of the Arcadia Hotel and major enemy of the Corleonesi. As his protege, Alice use her \"Nobody\" abilities to adapt her personality and looks to any situation, as needed, to uncover information useful to Salvatici.Until the day she uncovers too much and off Alice goes, on the lam. These flashbacks to Alice's life in NYC during the time of Prohibition, all the people she interacted with, whether as friends or antagonists, is quite compelling and is interspersed throughout the book in chapters entitled \"Then\", as opposed to the Portland \"Now\" accounts.There are secrets and lies everywhere. In New York City and in Portland. Alice had unraveled many secrets to her detriment in NYC and now in Portland she may be on her way to uncovering several secrets and lies hidden at the Paragon Hotel.Much of the plot and writing in this book blew me away. I love Faye's descriptive abilities. When introducing young Davy to us, she says he \"sits in the chair Blossom vacated, swinging energetic legs as if remaining still is an affront to personal freedoms.\" About housekeeper Mavereen: \"She'd make an equally fine church board directress or cathouse madam...\" Mrs. Muriel Snyder \"has a face that makes me figure God took his inspiration from a potato.\" There's so much more of this and made it necessary for me to slow down and savor the writing, instead of rushing my way to the denouement.This is a lovely book about the human spirit and condition. It's a sad book about how tragedies can cause irreparable damage to one's soul. And it is also a hopeful one about how love and friendship can help one's spirit be more resilient. It's also a sobering look at how little progress we have made since the 1920s to overcome racism and intolerance. Alice muses toward the end of the book about \"whether there will still be flaming crosses in the unknowable world fifteen years from now, when Davy Lee steps out to make it his own.\" It's much more than 15 years now in 2018 and even if there is less blatant cross burning, that doesn't mean we can be satisfied that the Davy Lees of our times have an equal footing and can make the world their own."}, {"Review": "The first thing I said when I saw this book was—-finally a cool interesting book set in Portland!Living in Oregon, there isn’t an abundance of cool books set here. Sure we have a number of writers from Oregon that have made it into the ‘big time’, but for the most part Oregon isn’t exactly the hippest place to set your novel in.In recent years though I have seen a lot of writers—both from Oregon or the PacNW and not—set their books here in my lovely state but it’s still not as popular as say New York or L.A.. I’ve read a few of Faye’s novels and have fallen in love with her writing so besides the fact that this book has Oregon ties, I wanted to read it because she wrote a new book!This book was such a pleasure to read for one solid reason—-atmosphere. As always, Faye does such a great job at creating a mood in her novels and this one was no different. I loved how the novel split between New York and Portland. I thought it added a lot of interest and broke up the story nicely. So many novels are set in New York so it’s familiar, but not a lot of novels are set in Portland so this adds a lot to keep the reader interested in some place new.I also thought the language of the novel worked well and kept things interesting and true to the period. I am normally not a huge fan of prohibition era books (just not my time period) but this book blended the glamour of the 1920s with the darker side of prohibition and the criminal world.This novel is darker and a little more gritty than her last novel, Jane Steele—at least in my opinion. I like how Faye has this seamless ability to write a darker novel but yet still balance it perfectly so that it will appeal to many readers.This book is rich in historical detail and brought to life a period that was a dark one for American history. In Portland, racism and the KKK aren’t things that a lot of people discuss or even really know about, and I love how Faye brings that side of Portland out in this book. It’s truly a pleasure to read a book so rich in historical detail as this one it. This is a novel that I think would be great for bookclubs. There is a lot to discuss and I think it’s a novel that will appeal to many, especially fans of historical fiction, but it has the darkness and grit of a noir book. I am super excited to share this novel with my friends and family, once again, a win for Faye!See my full review here"}, {"Review": "Well-written and immaculately researched historical novel/mystery. Little known facts detailing the pervasive mafia influence in Harlem alternate with the entrenched racism from Oregon's early days. Despite the serious themes underlying the book, it is just a delight to read. With a bullet wound in her side, Alice James, \"Nobody,\" flees NYC traveling by railroad to Portland. Once there, the Pullman porter, Max, takes her in hand to the Paragon Hotel and to a doctor who won't ask any inconvenient questions.Rich with period details, the story sparkles with unique characters. Don't miss this one!"}, {"Review": "I've been a fan of Faye since Jane Steele and she come back to us again with another stunner in The Paragon Hotel. I'm not much on historical fiction usually but I've ben surprised lately.. however, I already knew going in that Faye has a talent of bringing history to life. She brings Nobody and everybody into The Paragon Hotel.We switch back and forth from NYC Harlem and how Nobody, \"just call me Alice\", came to Oregon, The Paragon Hotel and her reasonings behind what she does. Introducing characters such as the doctor, Davy and Blossom, here comes a mystery I wasn't expecting and the KKK, which I was. I was fortunate enough to meet Lyndsay when she was promoting  The Whole Art of Detection  and remember her mentioning this is where her next book was going to be heading. I was instantly intrigued and SO excited to get my hands on a copy.I'll be completely honest, it took me quite a bit to get into this book. The cadence and language was hard for me to grasp on to right away. \"Quelque\". There's nothing that comes out and nudges you or completely WOWs you in an instant scene or reveal. What we get is a span throughout the ENTIRE read that starts to settle into your soul. If you're a lover of historical fiction and reading about the KKK and prohibition times, this is most definitely the read for you. Don't let what I consider a slow start deter you. At right about the third way into the story, I found myself wanting to take this journey with Nobody. This time period is such a hard one - we still see racism and the KKK is still affluent unfortunately. Some language and scenes really made me angry and I found myself frowning quite a bit throughout the read. If a book can pull these feelings well... I think it's doing something right. 3.5 stars"}, {"Review": "I just couldn't like this book. I really tried. I made it about halfway through and then questioned why I was still reading. The Paragon Hotel has a high rating on Goodreads, so I kept thinking I was missing something or that the book had to get better. The narrators voice just wasn't working for me. I understand that she is a con artist and changes into who she needs to be to suit the situation, but I found her voice hard to read. I typically love historical fiction, but this book wasn't for me."}, {"Review": "The year is 1921 and a young, white Alice James is running from her ties in NYC and from the mafia. Aboard a train bound for Oregon, she befriends a black Pullman porter named Max who finds her story, life and run-ins intriguing. Once in Portland, he takes her to The Paragon Hotel, an all-black residence in the city. Alice soon realizes that the crime on the west coast is just as troubling when she discovers the city is a new stomping ground for the Klu Klux Klan. Slick dialog, a blossoming interracial romance and an ever growing danger from all sides makes for an interesting read. "}, {"Review": "I received this book through Netgalley.With Paragon Hotel, Lyndsay Faye reaffirms that she’s one of the best authors out there of historical fiction. Not only does she illuminate historical eras with stunning realistic detail (see her Timothy Wilde trilogy set in 1840s New York), but she creates utterly human characters you can’t help but love and hate. The way she utilizes period patter with such flow leaves me in awe as an author.In Paragon Hotel, we meet Nobody as she’s dying of a gunshot wound on a westbound train. She was trained to be an anti-Mafia spy, to become wallpaper in any room; she’s not even sure who she is anymore. The kind black porter, a veteran of the War, realizes her perilous condition and takes her to a dangerous place in order to save her life: the Paragon Hotel, an all-black establishment in Oregon, a state where black people are not allowed.The historical facts behind the fiction are stunning. Oregon was established as a white utopia. In the 1920s, it was a hotbed of KKK activity. A black men were lynched for even looking at a white woman, and here is Nobody, requiring the aid of a black doctor and other hotel staff in order to stay alive. Each character is vivid and complex, with many secrets—which Nobody soon begins to uncover.This is a book that is, in turns, beautiful and horrible… and all the more horrible because of the reality it is based upon. As in her other series, Faye does an incredible job of representing diverse perspectives on matters of race, sexuality, and mental illness. This is one of the best books I have read in recent years, and I read a lot of books. "}, {"Review": "Lyndsay Faye is an author whose books I'll pick up whenever I see a new one. I really enjoyed her nineteenth century New York copper mysteries, and Jane Steele was a fun romp. This book is a bit more in the vein of Jane Steele, with a witty young female protagonist who is more concerned with justice than the law. The book is set in the Jazz Age, and goes back and forth between Alice \"Nobody\" James healing up from a bullet wound in Portland, OR in a hotel for colored people in a state where colored people are technically illegal; to flashbacks of Alice growing up in Harlem and falling in with the Mafia in order to make her way in the world. Alice is a fun person as a POV character- she's sharp but compassionate, loyal to a fault, and tries on personalities like dresses in order to fit into any given situation. The book gives gorgeous details about the setting and the characters are complex and authentic. The book does get a bit lost in the weeds at times, because Faye wants to give her characters every chance to act like themselves and for us to grow to care about them. I've have been okay with the plot moving a bit faster, and maybe with a bit less flashback. I'm not sure flashbacks were really necessary for this book to work, but they are de riguour right now, so. A Lyndsay Faye book will always give you a chance to time travel- she's an expert at bringing the past to life, and her research into the past always yields information that is relevant to issues we are facing today. I appreciate her passion for social justice, and the reminder that the fight is never over."}, {"Review": "I loved all these characters! Alice on the run finds a friend in Pullman porter Max, who sees she’s in more trouble than she is letting on. He brings her to the black hotel The Paragon, where we meet a rousing cast of characters, including Blossom who is a very interesting character. Alice is a white woman at a black hotel in the 1920’s so you are kind of on edge waiting for something bad to happen. But with these two tough women whoever messes with them better look out!This book is about friendship, what it means to be family, race relations, the mob and oh so much more that I don’t want to give away because I want you to come to the realization and have the same sense of wonder I did at the reveal!January LaVoy’s narration is fantastic every single person has their own voice you are never questioning who is talking because she gives everyone a unique voice!I really, really loved this book! I highly recommend this book!5 Stars"}, {"Review": "3,75 starsLyndsay Faye is such a skillful and brilliant writer, the way she almost \"paints\" her stories is mesmerising. She also did a wonderful job at making the setting of her novel as realistic as possible, it's such a high-quality historical fiction and I loved it. Unfortunately, at around halfway point I started to have trouble keeping up my interest in the story and I'm still not sure why. Maybe it was because of how tired I was at the time of reading it or maybe the book was getting too long and unnecessary complicated. I also wasn't a fan of the romance so it could contribute to this. Despite all of it, I think this is an amazing novel and I'd love to read the finished copy and possibly enjoy it even more.A big thank you to the publisher and the Edelweiss+ website for providing me with an early copy!"}, {"Review": "I didn't need to know the title or plot of this book before requesting it from Netgalley, because Lyndsay Faye cemented her place in my \"Must Read\" list with Gods of Gotham. Her talent is taking the reader and instantly placing them in a new place/time with no real adjustment required. She writes it like she just came back from a visit there and is very good at telling people everything she saw.I said the plot was secondary to my reasons for wanting to read this as soon as possible, but it became third in importance once I met Nobody. What an amazing character. I didn't care what she was doing as long as I was reading about her, whether in Portland or her past in Harlem. I loved the description of how she became whoever she needed to be depending on the situation, a con artist whose only goal is to stay safe. Lyndsay Faye has staked her claim on the late 19th/early 20th century fiction, and I can't wait to see where (and when) she takes us next."}], "Genre": "Thriller", "ID": "37970853", "Desc": ""}