{"Name": "The Perfect Liar", "Image": "https://images.gr-assets.com/books/1541994257l/39863508.jpg", "Reviews": [{"Review": "\nI know who you are.\nThose five simple words—forming a single ominous line in a note, taped to a front door—set the tone.  Thomas Christopher Greene draws readers in with a compulsively readable and magnificently manipulative storyline that teeters on the rudimentary line drawn between literary and contemporary fiction. This being the third of his books I’ve read and what I would consider the darkest and most suspense-heavy yet.Max and Susannah—along with her fifteen-year-old son—have relocated to a small town in Vermont. Making a name for himself in the art world has afforded Max opportunities, the biggest being a professorship and the use of a gorgeous home for his family. Flying high in their new glossy life, thrown off-course when they're hit with the turbulence the note's insinuation creates. Anxiety rampant, and desperation to keep things under wraps, leads to some morally questionable moves. Just as Max relaxes, thinking he handled the situation, another note pops up, followed by a third. The short chapters, twist riddled plot and engaging flow of the author’s words set a frantic pace. Although, not every twist is what I would call unpredictable. In fact, readers are made privy to some of the foreseeable decisions—unpredictably replaced by gall. Part of the fun comes from the shock value Max’s despicable actions lend to the story and the ease in which he manages to justifies them. Readers are led to contemplate, who of the two—Max or Susannah—is the perfect liar? Is it the dutiful wife who, despite her misgivings, stands by her husband’s side? Or, is it the husband willing to go to any length to keep his secrets from reaching the light of day? Chances are—whichever side you land on—you have no idea what’s in store or who in fact will prove to be the best liar. Until the end that is. The most fitting descriptor for the conclusion: adjective, ten letters, 4 syllables—un·ex·pect·ed. *Thank you to St. Martin’s Press for providing a review copy in exchange for my honest thoughts."}, {"Review": "\n3.5 starsEntertaining psychological thriller constructed around a skillful game of cat and mouse between husband and wife. \nMax and Susannah have a seemingly perfect marriage--but their marriage is built on a web of lies. Max, a rising star in the art world, has a secret past that he has worked hard to bury. However, the more famous he becomes, the greater the chance of exposure. Max is willing to quash any threat, no matter what it takes. Susannah, Max’s loyal wife, has secrets of her own. When someone leaves an anonymous note on their front door threatening to expose their lies, their world starts to crumble. As their layers of deceit begin to slowly unravel, their marriage begins to disintegrate leading to the ultimate betrayal.As many other reviewers have noted, this is an addictive read. However, my enthusiasm waned after the reveal of the first big twist-- It felt like there was a shift in the tone as the suspense died down. Perhaps it was because the characters seemed a little too comfortable which lessened the tautness of their narratives? While I had a lot of fun reading this, there were too many loose threads and I was a little let down by the ending. I found the outcome predictable and given the devious nature of the characters, I was hoping that the author would take Max and Susannah’s deception to another level. The narrative alternates between Max and Susannah’s chapters, often recounting past events. I loved the playful snarky tone of Max’s chapters but I didn’t find Susannah’s voice to be as compelling. I was greatly confused by the chapter between Max and Max W. I don’t know why this one couldn’t have occurred between Phil and Max W. as I often had to reread to determine which Max was which. I had a theory that would have made this ok, but I was wrong, so this chapter just left me confused. \nMy biggest gripe is that If all it took was doing a minimal google search to uncover a HUGE secret, then why hadn’t more people caught on? \nOn the upside, both characters are intriguing, the plot kept me interested, and Thomas Christopher Greene has a knack for drawing in the reader. I will definitely be reading more by this author! \nOverall, I had a lot of fun going back and forth trying to determine just who was the “perfect liar?”\nI received and ARC of this book from NetGalley and St. Martin's Press in exchange for an honest review."}, {"Review": "\nAll consuming and wonderfully crafted story!\nI was hooked from the beginning and it just became more intense as the the author laid out all the clues that would lead to the haunting conclusion.The more I read, the more invested I was in the characters and it just became unputdownable at some point. The kind of addictive writing that causes you to\nstay up past your bedtime!\nThere are anonymous notes, like ticking time bombs, left on the door of the happily married couple- Susannah and Max. One sentence notes that sent chills down their spines and even gave me a sense of fear . So many questions! Who is sending them? This will cause someone to make some calculated and shocking decisions.  He actually did it!!! I was shocked (more than once).This one has some intense and unexpected moments. Don't miss it if you enjoy unpredicatble thrillers."}, {"Review": "2.5*After being widowed in her 20’s, Susannah is bringing up her son Freddy on her own. Into her life waltzes Max. And oh, he’s everything she could want in a man! Handsome, caring and only has eyes for her. The topper? He will fit into her 'artsy' world perfectly. Sure, they met under less than honest circumstances, but maybe she can just shove that little issue aside. When other odd, unexplainable incidents continue popping up, Susannah does her best to squash her fears and trust the man she loves. The question now… how many warning signs can you ignore? How long do you deny the obvious truth?Soon enough, Susannah is fearing for her life and her son Freddy.I was so excited to read this novel. The premise sounded right up my alley for thrillers! Sadly, it started un-raveling right from the start. The story-line seemed disjointed, jumping back and forth too much. There were parts of the story that just didn’t add up. I always do my best to suspend belief when I read a thriller. This one was just too much of a stretch, even for my vivid imagination. I noticed reviews are extremely mixed for this book. It’s a love it, or.... well you get the picture. Unfortunately I fell into the latter category. If this book piqued you interest enough to read, I hope it works out better for you!A buddy read with Susanne!Thank you to NetGalley, St Martin’s Press and Thomas Christopher Greene for an ARC to read in exchange for an honest review."}, {"Review": "3.5 starsA perfect marriage between two imperfect people - both are artists, and both have secrets.Susannah, a young mother and widower met Max W, an artist and popular speaker, at a party. They soon married and eventually they moved to Vermont when Max gets a job there. Max, Susannah and Freddy like it in Vermont. Life is easy there. They are comfortable and happy until one day a note appears on their door. A note which reads I KNOW WHO YOU ARE. An honest person might think \"I know who I am too! I'm Max or I'm Susannah\" but each of them has a secret. Both are nervous - but Max is extremely nervous. He begins to wonder just who knows his secret, who out there is taunting him, who wants to ruin his reputation, his marriage, his life? Soon another note arrives. Suspicion grows. Tension mounts as the reader is left to wonder, how Max and Susannah will react when/if his/her secrets are revealed.I found this to be a fast-easy read. It came with a few twists and turns which made for an interesting read which didn't require much thought. This was pure escapism reading for me. I found the couple’s secrets to be more interesting than the identity of the note sender. Overall, I found this to be quite enjoyable and it was fun to try and figure out just who was the \"perfect\" liar? Who was the note sender? Will their secrets ever be exposed? Who had the bigger secret?Thank you to St. Marin's Press and NetGalley who provided me with a copy of this book in exchange for an honest review. The thoughts and opinions are my own."}, {"Review": "\n\"The scariest monsters are the ones that lurk within our souls\"\n - Edgar Allan Poe3.5 Twisty, love is blind stars ⭐️ for The Perfect LiarAfter being widowed in her 20s with a young son, Susannah meets Max at a work party. Max lies about who he is to gain access to the exclusive event. He is handsome, charismatic and knows how to read/work people. He instantly charms his way into Susannah's heart and they are married within six months of that fateful meeting. Susannah and Max are in love and happy. Max's career has taken off and the family relocates to a small town in Vermont where he will be a visiting professor. Everything is going their way. All seems perfect - until the first note arrives. \n\"I KNOW WHO YOU ARE\"\nAnxiety runs rampant and we begin to see that all is not what it appears within this family. There are desperate actions taken to assure their security. Just when Max think he can relax, another note appears, shortly followed by a third. Who is responsible? What do they want?We begin to see that there is much more than meets the eye with this family. Lies seem to come as easily as the intake of breath. So who exactly is The Perfect Liar? Is it Max - the man who will go to any lengths to get what he wants and keep it? Or is it Susannah - the seemingly dutiful wife with her own secrets and demons to hide? The story had an addictive quality to it with its frantic pace and short chapters. The author is definitely imaginative - unfortunately you have to really suspend your belief to fall in line with some of the twists the plot takes. Some of it proved too much of a stretch for me. I enjoyed the book overall and I definitely liked the aspect of a wolf in sheep's clothing and not all being what is seems despite my inability to fall in line with some of the plot points. Thank you to Thomas Christopher Greene, St. Martin's Press and NetGalley for providing me with an arc of this book. "}, {"Review": "2.25 Stars* (rounded down)Susannah thinks she has met the perfect man and is immediately swept off of her feet. Could it be? When Max W. meets Susannah there is an intense attraction and and a whirlwind romance. Mere months later they are married. Susannah had no plans to get remarried after losing her first husband Joseph but Max W., fulfilled something in her she thought she’d never find. Now she and Max, her successful Professor/Artist husband and her son Freddy, live the quiet life in Burlington VT. Max however, is not who he seems. He has been keeping secrets about his identity for decades and it seems as though someone is on to him. Notes are found outside of Max’s and Susannah’s house, The first states: “I Know Who You Are.” Max is scared - and he knows that he must do whatever it takes to keep his identity safe, no matter what it takes. The premise of “The Perfect Liar” had me from the first and I couldn’t wait to read this book. Unfortunately, there were way too many holes in this novel to save this story for me. In addition, my believability radar was going off the get go and I simply didn’t buy the story. I do however love Vermont and enjoyed the setting immensely! I think that readers who are able to suspend disbelief will really enjoy this novel.This was a buddy read with Kaceey! So glad we read this one together!Thank you to NetGalley, St. Martin’s Press and Thomas Christopher Greene for an ARC of this novel in exchange for an honest review. "}, {"Review": "I was hooked on this book right away. How could you not want to find out why someone is leaving anonymous notes on a couple's door saying things like \"I KNOW WHO YOU ARE\"? Totally creepy, but it made for a really entertaining read.The pacing in this book was excellent as the chapters were short and alternated between the husband, Max, and his wife, Susannah. As the story unfolds, you learn bit by bit about each of their pasts. The book definitely takes some interesting turns and while I wouldn't say they are all predictable, many of them are not really surprising. I don't really consider that a negative thing though because to me the book was so much more about these complex characters rather than a story solely based on catching the reader off guard. I just truly enjoyed seeing everything play out.Would definitely recommend to anyone who is in the mood for a solid psychological thriller. Thank you to St. Martin's Press for sending me an advance copy! I was under no obligation to post a review and all views expressed are my honest opinion. "}, {"Review": "Wow... that was a twisty ass story to the max!!The Perfect Liar by Thomas Christopher Greene is a fast paced, dysfunctional, and gripping story that will leave your mind blown (insert emoji here ;)You know how you start reading a story and have the theory all lined up in that perfect brain of yours... and that moment the author steers you clearly wrong? Well.. that was me in this multiple times.I read this story in a day my friends! That tells you something.... and the writing is plain addicting. Greene sure knows how to hook his readers... because it was simply unputdownable. In my opinion, it's best to go into this story blind. If you love unpredictable characters, intense moments, and jaw dropping conclusions then this story is definitely for you!Huge thank you to St. Martins Press and Netgalley for the opportunity to read this arc in exchange for my honest thoughts.4.5 liar stars! Publication date: 1/15/19Published to GR: 11/6/18 "}, {"Review": "4 stars- I like Thomas Christopher Greene’s style!Susannah and Max are married. It’s the second marriage for Susannah. Her first husband passed away. Max is charming and the life of the party. He is now stepfather to her fifteen-year-old son. Susannah thinks the past is behind her and her new life is idyllic when she receives a note on her door one morning. The note says, “I know who you are.”Max is not worried in the least about the note; however, just days after having dinner with Susannah and Max, someone dies in an accident while on a run…with Max. And that is all followed with another note on the door, “Did you get away with it?” Susannah and Max each have secrets, and they are big ones. Their idyllic world would be shattered if they come to light. I loved hearing from both Susannah and Max, and the ending was out of sight. The whole time I was questioning who is the perfect liar? Or is it both of them? Unexpected and unpredictable, The Perfect Liar is a solid thriller! Thanks to St. Martin’s Press for the complimentary copy. All opinions are my own.My reviews can also be found on my blog: www.jennifertarheelreader.com"}, {"Review": "FIVE STARS\nJust a simple story of a simple American couple. NOT!!!!! There is nothing simple about the couple featured in Thomas Christopher Greene's latest novel of psychological suspense. Husband and wife both have more than their share of secrets and lies. Which one is the perfect liar? Hmmmm. This is a sexy, modern tale of murder and revenge. Only one-half of this couple is left standing in the end. Who will win out? I can't tell you. All the fun is in watching these two crazy characters try to out-manipulate each other and the world around them.I LOVED THIS ADDICTIVE NOVEL!! It's twistaliciously written and surprising to the end. I don't know how Greene has escaped my radar all this time, but now I will be going back to read all of his novels.Thanks to Netgalley and St. Martins Press for the early galley. Note: my copy had multiple formatting issues and I sincerely hope the final product is broken into chapters!!! All opinions are my own."}, {"Review": "Have mercy......I feel like someone just smacked me alongside the head. I took the full brunt of it and my mind is reeling. Loved it/ Not so much/ Then Loved it again/ And Everything in between.If you've skimmed over the reviews, you're gonna see a wavy mixture from intensely salty, to bland, to Five-Alarm Chili flavored. It's all in how deeply mired you become in the tilting CRAZY going on in these pages. If you have a tendency to lift the lid off the pot and re-read the recipe, this one may not thicken to your liking. But on the other hand, if you're open to some combustible ingredients, then this one will get your attention.Our two main characters are hardly likeable. Let's get that out there front and center. Susannah meets Max at a soiree for artists in New York. They are immediately taken with one another. Susannah is a widow with a teenage son. Max has been successful at giving TED talks with a very strange approach to Art. He is recently hired as a temporary staff member at a Vermont university. Freddy tolerates both adults by playing video games in his room. Typical family? Not so much.The shifting sands begin when the first note arrives. I KNOW WHO YOU ARE. Susannah finds it one morning taped to the front door. Max remains calm, but Susannah starts to freak out. As readers, we are uncertain as to whom this note is directed towards. It's followed by two others. It's then that Thomas Christopher Greene begins unpacking the sticks of dynamite from their canvas bags. It appears that both individuals in our sweet couple have Black Belts in Lying. That's where the whiplash comes in from following each of their backstories. Just keep focused on Wild and Woolly. Remember: The puzzle pieces don't always fit perfectly in a psychological thriller. Fear and uncertainty don't think rationally. Just go with the flow.The Perfect Liar is perfectly imperfect. But all along you'll be looking over your shoulder to see who strikes the match on those sticks of dynamite. BOOM!"}, {"Review": "There are two times I say WOW! when I finish a book. The first is \"WOW! How did that even get published\"? The second is \"WOW! That was sooo goooodd. I wish I could make the words flow that well\". The Perfect Liar was definitely the second of the two. It didn't have me on the edge of my seat at every chapter, but each chapter was always only a few pages, at the most. Which I like in books, because I tend to read them faster and the characters and such stay in my head fresher, for some reason. If you like plot twists, intrigue and surprises, I truly recommend this read."}, {"Review": "4 Solid StarsWe all have light, and we all have dark. Sometimes it’s up to us which side wins. And sometimes it is not.This was an unexpected read, one of the good ones! At first, I thought I know it but then I found out I knew nothing! It was my first read by this author and definitely won’t be my last. Told in multiple POV (mostly in dual), 3rd person. It’s a standalone novel, fast-paced with well-developed characters (albeit not likable ones, at least not for me) and the twists that I couldn’t see. It’s well-written with a satisfying ending but I can understand if others don’t like it! Overall, it was an enjoyable read for me and hope you like it as well!"}, {"Review": "I feel like I read a different book from everyone else! If I said that I enjoyed anything about this book, then I would be “The Perfect Liar”! The chapters were long and never ending.The characters were all unlikable. The writing was VULGAR (language, sex) And, the reveal of “WHO” left the note, (and why now?) pretty anticlimactic. Honestly, I could not wait for this book to end! First time reading this author...apparently I am not the right audience for his work. Thank You to Netgalley, St. Martin’s Press, and Thomas Christopher Greene for the ARC I was provided in exchange for an CANDID review! If you are a fan, pick this up on Jan 15th, 2019."}, {"Review": "Thanks to St. Martin’s Press for gifting me a copy of The Perfect Liar. I recently read The Headmaster’s Wife by Greene and it was fantastic. While browsing edelweiss I found The Perfect Liar was being published early 2019 and I knew I had to get my hands on it.Susannah, a young widow and single mother, has found love again, with Max W. They are both artists from NYC but have moved to Vermont to live that family life. While Susannah is out for a run she comes home to find a note that states “I Know Who You Are”. She immediately phones her husband to tell him what she has found. Max believes someone from work must be out to get him. His career has really taken off so it must be someone who is jealous. When the perfect couple are both hiding secrets from each other nothing can wrong, right? Wrong! When the second note comes.. they know they are in trouble!I enjoyed this short, fast paced story. Right when you think the story is going one way, it shoots off in another direction. Great twists. I recommend 4⭐️ "}, {"Review": "The Perfect Liar by Thomas Christopher is a thriller that follows a couple as they receive threatening notes. The story is told by alternating the point of view between them in each chapter giving a reader a look at both sides of the story. Susannah had gotten herself into a relationship with a much older man which led her to becoming a widower with a young son. When Susannah met Max he seemed the perfect man for her seeing that he was also an artist and fit into Susannah and her son's life perfectly. When offered a job in Vermont Susannah and Max take the leap moving from New York to their new quiet home. Quiet that is until one day Susannah finds a note left that reads \"I KNOW WHO YOU ARE\". Max is sure it's just a joke but Susannah can't help but wonder just how well does she know the man she married?The Perfect Liar is another of those books that when done I felt a bit so-so with it but I look around and seem to be missing something everyone else seemed to see. For me, I never really got to care a bit about Susannah or Max but that is something that sometimes happens with thrillers that I go into not trusting the story, you have \"liar\" in the title and it can't be helped.However, it didn't take long for my own theory to form about the outcome and again I pretty much figured out where it led so that was also a bit of a let down. Sure there were twists and turns along the way but seemed predictable to me leaving me with that meh feeling in the end. I will again chalk this up to reading too much for my own good since I seem to be in the minority with most being a lot more excited. I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"Review": "Max and Susannah seem to have a great life. When a mysterious note shows up on their door, they want to ignore it, but then a second note appears.Told from alternating points of view, Max and Susannah both have secrets they don't want getting out. When Susannah met Max, they seemed to fit together perfectly. They met in New York City, but with the success of Max's career have moved to Vermont. Everything is going well for them, until the mysterious notes start to arrive.The plot was interesting. The two main characters are both hiding dark secrets. Someone is leaving creepy notes on their door. It seems like a great read, but I never really connected with the story or the characters.I've seen some great reviews for this one, and I imagine it will be a hit with some fans of psychological thrillers. For me, it was good, but not great. Best for fans of dark domestic thrillers with unlikable characters.I received an eARC of this book from the publisher via Netgalley in exchange for an honest review."}, {"Review": "Susannah and Max are considered the perfect couple. This is her second marriage (her first husband died) and brings son Freddy with her. They seem to have it all .. a beautiful home, a great job, plenty of money to live comfortably.Susanna finds a hand-written note on her front door .... I KNOW WHO YOU ARE. She immediately calls her husband who dismisses it as a prank. A few days later they invite a couple to their house for dinner. Days later the man is killed in a tragic accident. The next note to show up .... DID YOU GET AWAY WITH IT.And then the third note .... I SAW WHAT YOU DID.Both Susannah and Max are keeping secrets from the world and from each other—secrets that could destroy their family and everything they have built.So what did Max do? Why?The story premise is exquisite .... highly suspenseful, full of secrets and lies, twists and turns. Step by step the reader learns what those secrets are..But it's the ending that grabbed my attention. It's riveting and so unexpected.Many thanks to the author / St Martin's Press / Netgalley for the advanced digit copy of this psychological thriller. Opinions expressed here are unbiased and entirely my own."}, {"Review": "Now this folks is a psychological thriller. The Perfect Liar is quite frankly the perfect title because I didn't know who was lying and what they were lying about. I had it figured out about four different times and then well, I was wrong. I was in the dark all the way until the end. Which is my kind of book!Susannah and Max seemed to have it all. The perfect family, marriage, careers. Or was it all a facade? It is amazing how someone can create a persona for the public and yet they are entirely a different person in their private life. Secrets, murder and weird twisted stuff fill the pages of this page turner.  I flew through this in less than 24 hours, it was hard to put down. This was one wicked couple. You won't know who to trust, they each have their own kind of crazy going on. For a quick, twisted suspense filled read, I recommend you pick up a copy. Happy pub day to The Perfect Liar which is out today! Many thanks to Thomas Christopher Greene, St. Martin's Press and Netgalley for my ARC! "}, {"Review": "The Perfect Liar is the type of story that you really need to go in blind. The synopsis already tells you too much and I recommend skipping it. It's a domestic suspense, and someone is lying. That's really all you need. I'll keep this review light and sweet, but it's books like this that get me creeped out about my engagement. Who exactly am I reeeeaallllyyy marrying?! Susannah is a newly married mother and her husband Max has salvaged her from the struggles of being a single parent. Max and Susannah relocate to a small suburban town in Vermont, where people leave their doors unlocked, neighbors become best friends, and secrets can struggle to be kept hidden. After Susannah and Max find a note on their door, strange occurrences begin happening to the family. Susannah and Max are both hiding secrets, but when you find out what it is they're exactly hiding, you'll be left with your jaw on the floor. If you enjoyed 2018's The Wife Between Us, you will love Thomas Christopher Greene's \nThe Perfect Liar\n! I was able to read this book in one sitting, and although the mystery is very light, it's also very intriguing. This was my first read by Thomas Christopher Greene, but now I see why The Headmaster's Wife was so popular. There's many twists and turns throughout this story—some easier than others to figure out. Thank you St. Martins Press for my advanced copy in exchange for an honest review. The Perfect Liar will be released January 15, 2019."}, {"Review": "If we could give 1/2 stars, I would rate this book a 3.5. The main characters in the book are Susannah and Max. From Susannah's relationship and later, marriage, to her therapist, who was 49 to her 21 years of age, when they first started seeing each other, we know that Susannah is strong willed and actively rebels against authority and conformity. Later, after her first husband dies, she eventually meets Max, an up and coming \"artist\" whose talent lies in words and manipulating those who pay to hear him speak. Almost from the time we meet Max, we know he is a murderer and that his life is a lie, as he lives life, using the identity of someone else, to be what he wants to be. He'll stop at nothing to attain his goals and Susannah comes to realize that almost everything that Max tells her, is either a lie, or based on a lie. Neither of these people are likable and for that reason, I had trouble caring much, about their present or future. I did care about Susannah's 17 year old son Fred, but it appears his future will be filled with lies and deceit, too. He is his mother's son and I think that shapes his future. At no time though, did I want to put down the book, before finishing it. The book is well written although the story will move from Susannah's viewpoint to Max's viewpoint, from one sentence to the next, with nothing to indicate a change. I was able to pick up the changes within quickly but it took me a while to get used to this way of writing and I think it'd be easier to read the book with some distinct breaks between viewpoints. Also, Max shaves his head, a habit that Max took on to become another identity, but in at least two areas, there is mention of the hair on his head. I think it's interesting that during Susannah's marriage to Max, she takes on her mother's passiveness (being a homemaker and catering totally to her husband's and son's needs) which others can see, while at the same time, having a hidden part of herself, someone who smokes in secret everyday and who even has a stuffed fox that she hides in her closet. It'll be up to the reader to decide the identity of the perfect liar, because Susannah and Max hide so much of their real selves.Thank you to St. Martin's Press and NetGalley for this ARC."}, {"Review": "Scintillating writing, robust characters and brilliantly plotted. SUMMARYSusannah, a young widow and single mother has remarried. She married Max, a charismatic artist and popular speaker whose career took her and her 15-year-old son out of New York City to a quiet Vermont university town. Strong-willed and attractive Suzanne believes her life is perfectly in place again. Then one morning she finds a note on their front door. “I know who you are.” Max dismisses the note as a prank. But days after a neighborhood couple comes to dinner, the husband mysteriously dies in a tragic accident while on a run with Max. Soon after, a second note appears on their door, “Did you get away with it?” Both Susanna and Max are keeping secrets from each other, secrets that could destroyed their marriage, their family and everything they have built.REVIEWTHE PERFECT LIAR is thrilling. It’s told from the alternating perspectives of Max and Susannah. Each has their own story to tell, and it all unwinds in due course. The story is a ricocheting tale of lies and it’s impossible to put down the book. Max and Susannah’s characters are unique and well defined. Both with strengths and weakness which make them real. You might not like them but they really make for interesting and robust characters. The story is brilliantly plotted and I am sure you’ll find some surprises between the pages. My favorite part was the entire second half of the book. It snaps your mind. Whaaaat!The Perfect Liar is author THOMAS CHRISTOPHER GREENE’s sixth novel. Greene was born and raised in Worcester Massachusetts and earned his BA in English from Hobart College in Geneva, New York and his MFA in Writing from the former Vermont College. He lives in Central Vermont and in 2008 was instrumental in creating The Vermont College of Fine Arts. Greene’s writing is scintillating. It was a great Audible listen. Publisher \tSt. Martin’s Press/Macmillan AudioPublished \tJanuary 15, 2019Narrated\tTania GilbertReview\t www.bluestockingreviews.com"}, {"Review": "I received a free e-copy of The Perfect Liar by Thomas Christopher Greene from NetGalley for my honest review.Susannah is a single mom and a widow who lives in New York. She has fallen in love again with an artist, Max, who uses words not art. They decide to move to Vermont where they can live a nice quiet life. One day she finds a note on her door that says \"I know who you are\".She shows it to Max who tells her it is probably just a silly prank. But then a partner of Max's dies in an accident and a second note appears that says \"Did you get away with it?\"A very quick read with lost of twists and turns. "}, {"Review": "A chilling tale of hidden secrets that surface and threaten a married couple’s new life together. The tension builds as lies are revealed and we’re left to decide who “The Perfect Liar” is. So many delicious twists...as we’re lead to an unexpected and impressive ending! Susannah and Max are a new couple that married after a brief courtship...and each have secrets from their past that they haven’t shared with their new partner. Susannah met the charismatic artist at a NYC party, when he first made his appearance into the art world. She was a struggling young widow with a teenage son...and was drawn to his charm and energy. She’s strong-willed and anxious, but Max has a way of calming her and keeping her grounded. A job offer from the University of Vermont moves them to a slower-paced life...away from the NYC art scene and pasts they want to forget. Then Susannah finds a note on their door—I KNOW WHO YOU ARE—and the new stress-free life starts to crumble. In a panic, she calls Max, who is out of town lecturing. He dismisses it as a prank, but in the back of his mind he begins to wonder if someone has uncovered his lies. Susannah is also wondering if her past is creeping into her new life...or maybe she doesn’t know Max as well as she thought. She was attracted to his mysterious, artistic side, but now she’s curious about his estranged family and lack of friends. He just appeared in the art world—almost overnight.Another note appears, and then one of Max’s colleagues is killed in a tragic accident. It’s clear that someone has an agenda...but whose secrets are threatening their future?Thank you to NetGalley, Goodreads Giveaways and St. Martin’s Press for this ARC, in exchange for my honest review!#ThePerfectLiar #NetGalley"}, {"Review": "I guess I’m in the minority here, because I wasn’t a fan! I felt like the characters actions had zero explanation - there was no elaboration on anyone’s motives, so I had a hard time connecting with any of them or understanding why they were doing what they were doing. I also found it pretty boring. I felt like there were no twists and turns, and the ones that did exist were so minor and anticlimactic that I kept thinking *something* had to be coming down the pipeline, but nope. All in all, this one was disappointing to me. If you like more of a straightforward mystery without the twists, you may enjoy this one more than I did. "}, {"Review": "Susannah is a single mother. She meets Max and he seems to be everything her and her son need. Everything bliss until both Max and Susannah's secrets start to unravel.. When suddenly a strange note appears on their door saying I KNOW WHO YOUR ARE, As things spiral out of control so does Max and Susannah and her son is keeping a secret he has carried for years. I read this straight through. The characters so deeply twisted. The plot is unique and engaging, The perfect thriller. I loved it.I was give a copy by the publisher for my honest review.Dawn Ruby-BookGypsyNovels N Latte Book BlogNovels & Latte Book ClubHudson Valley NY"}, {"Review": "Tl;dr: Short, taut domestic thriller that poses a lot of interesting questions, definitely for fans of psychological suspense.The Perfect Liar is the perfect title for this book because, in the end, who is the perfect liar?This one is sort of like The Talented Mr. Ripley meets Gone Girl with no one being what they seem and it leaves (or at least left me!) really intrigued by the way that central question--who is the biggest liar, are they perfect at it-- or unaware? Or aware yet not, at least on the surface?It's impossible for me to talk about the novel without talking about the end so...SPOILER SPACESPOILERSPACESPOILERSPACEOk! So, that ending! Max, to me, seems to be the perfect liar at first but he's so not--Susannah is. I mean, yes, Max has a great con going, the kind of one you do read pieces on in Vanity Fair or The New Yorker (loved the nod to that at the end, btw) but I think Susannah is really the biggest--and best--liar of all, although I can see the case for everything she does being in reaction to what happens/did happen to her.I think Susannah is not reacting--I think she's whatever she wants who she's with to be until she's done. And then she's *really* done, and unlike Max, who thinks and is presented throughout, as someone who is both immensely pleased by and very, very good at presentation.Max goes from teen/early adult vagabond to on the fly murder to aspiring artist (because the art world, he senses, will be a perfect place to be who people want to see) to a knowing success, to superstar who is \"beyond\" art and in demand for motivational talks that he (and us) know are just him playing to the crowd, to academic (Greene really shines with this, it's clear he's in academia but isn't afraid to call it on its bullsh*t)-- and then murderer again but this time Susannah has it and him all figured out but hey, she's all over the place and he's got it under control and if she has to go, well...And then he's dead. His mistake is seeing Susannah as she presents herself and how she is, on the surface, written. She's a art school dropout who never did what her family wanted, met a therapist who could calm her always busy mind (she thinks of it as panic, her son thinks she's just unmoored, and Max thinks she needs him as an anchor--I think she's just bored until she's ready to make a move) and seduced him, then got pregnant. Susannah narrates that part of her life, and in it, she's a victim. And while there's no doubt that her family turned away from her, and Joseph, the therapist, was questionable at best, and unhinged at worst (that dog cage scene, yikes!)--you have to wonder. She's very open about the defiance (I would call it choice) to get pregnant and huh, the minute Joseph isn't helping her/pushing her as hard as he can because he thinks he can/she realizes he's old--bam! He's dead. Technically, she tells her son when it all comes out, he was mostly dead anyway. (Oh, well then, ok!?)Then there's Max. When Susannah meets him, he confesses he's crashing the party (literally and figuratively) but, in his mind, dazzles her so much he gets her and surprises himself by loving her as much as she does him. Luckily he knows how to handle her, and sure, there are moments when Susannah wonders about his past, but in her recollection they are just little hiccups. He's the father figure she wanted for her son, he's successful enough to get them out of New York City and to a perfect home in Vermont--he's perfect. And then notes start appearing and she's freaking out and Max-- she can see that under that calm exterior is rage. So much rage.It's not aimed at her, but she sees it and it scares her, and in the end, Max has sort of confessed about his past and he's killed someone and the police have been coming around and she panics, grabs her son, a whole lot of cash, and meanders into an escape that's foiled by her boy being a teenager and texting Max because he thinks \"Mom is acting cray cray\"--so she returns home and all is well except for the cop who talks to her but she doesn't say anything, just tells the story of meeting Max ( and whoops, that part where he told her he wasn't exactly an artist yet, but hey, now he is!) So, Max knows he needs to get Susannah calmed down and possibly out of the picture, so it's family vacation time and Susannah is getting all panicked again, phones the cop she spoke to (managed to keep the card the cop gave her, you see) and says she finally realizes she's in danger and then, before he can kill her, she kills Max but she was terrified and the cop says to tell everyone that Max fell off the cliff Susannah pushed him off, to say it was suicide, and Susannah is just so grateful she and her son are safe and besides, with what they know about Max, he's killed before and she was probably next.Except Except for that one sentence about how funny it was that Max died exactly one day after the university where he was working life insurance policy kicked in, guaranteed money even if the cause of death is suicide.And Max becomes even more famous once he's dead, and Susannah, after all this time, finds an artistic streak she thought she lacked and now back in New York, her works (funnily enough, all about murder, but of course in reference to Max's deeds and her surviving him) are very in demand and now she's more than well on her way to becoming famous in her own right.So. Is Susannah just a woman with a knack for falling into one dangerous pattern after another and finally, finally getting lucky enough to escape?Maybe. But I don't think so.Last two lines of the book:\"So many people are dying to meet you,\" Lydia said.\"Bring me to them.\"I rest my case.I was provided with an ARC of this by St Martin's and Netgalley in return for an honest review. (And apparently, in my case, a very, very long one!)Five stars for this disturbing but utterly delightful mindf*ck of a read. I can't wait for this to come out so I can talk it up all the time."}, {"Review": "The Perfect Liar wasn’t a good fit for me. I didn’t hate it, I didn’t love it- it just fell somewhere in the middle, 3 stars. I found it hard to relate to any of the characters or even find them mildly likable which kept me from really enjoying the book and getting lost in it. Thomas Christopher Greene’s writing was strong and I would definitely read another book by him in hopes that the characters were more my speed, I’ll even take a character you love to hate. The Perfect Liar will definitely work for some people. I can even think of a few friends who I will recommend this to despite it not being my favorite read. Thank you Netgalley and St. Martin’s Press for an e-ARC OF The Perfect Liar in exchange for my honest review."}, {"Review": "This rating is really between 3 - 3.5 stars.The first thing I would like to point out is this book has the perfect title. Who exactly is the perfect liar? The book will have you guessing the answer to this several times throughout the story. I loved how the book grabs you in the beginning with Susannah coming home to a note on her door - 'I know what you did'. Does that not give you the chills? The plot is intriguing, though it fell a hair flat for a good bit of it after that explosive opener. Then at about three-quarters through the book it picks back up and ends strongly. While you know that several of the characters are liars, it's surprising what the lies are, who is telling the lies and when - it's deliciously deceptive. I liked the character development, the short chapters and the storyline being told from different points of view. The few unexpected twists makes this an enjoyable read. My thanks to Thomas Christopher Greene, St. Martin's Press and Netgalley for a copy of this book in exchange for an honest review."}], "Genre": "Thriller", "ID": "39863508", "Desc": ""}