{"Name": "Out of the Dark", "Image": "https://images.gr-assets.com/books/1531214030l/39863167.jpg", "Reviews": [{"Review": "This is the fourth novel in the Orphan X series. Again, you could read it as a stand alone, but I wouldn’t recommend it. Evan Smoak was plucked out of an orphanage at the age of 12 and trained to be able to kill anyway you could possibly imagine while remaining totally off the grid. The elements of an Orphan X novel is that Evan Smoak, aka Orphan X, aka The Nowhere Man, has a lot on his plate that mysteriously he never needs to get sleep for. In this one, he has to kill the President of the United States, a selfish man with a history of underhanded dealings. Evan has to do this while being hunted by another Orphan who wants him dead. Also, as the Nowhere Man, he helps out someone who desperately needs his help, in this case a kid who’s on the spectrum (autism maybe) who follows the rules and therefore did not allow a shipment of $18 million worth of drugs smuggled via fish. (He didn’t know about the drugs, just about the shipping irregularities.) Unsurprisingly, this did not go over well with the drug cartel he interfered with. Evan is an assassin who tries to do good for others and only kills known bad guys. (Naturally, he has access to all manner of intelligence to ensure he only gets true bad guys.) I find these novels super fun and fast-paced. The descriptions of fight scenes are incredibly well done. I never understand anything about all the weapons Evan manages to use, but Hurwitz does a great job of getting you to wonder how Evan will prevail, even though you strongly suspect that, in the end, he will. Thanks so much for the ARC from Minotaur Books. This novel RELEASES JANUARY 21, 2019."}, {"Review": "Evan Smoak is a trained assassin known as Orphan X. He was part of the Orphan Program until he broke with it and used everything he had learned to reinvent himself as the Nowhere Man. Now he helps those that are desperate and have no one else to turn to. However, now someone is killing off all the Orphans, someone very high up in the government. Evan decides to strike back to take out the man behind the killings, the man who started the program, the President of the United States.READ THE REST OF THE REVIEW OVER AT FRESH FICTION!"}, {"Review": "He’s your last, best hope, but who can Evan Smoak turn to when he is out of options and his life is on the line? Orphan X is back and he is even more larger than life, more seemingly invincible, yet even more vulnerable and “human.” And. He. Is. A. Target.OUT OF THE DARK is Gregg Hurwitz’s latest razor-sharp tale of Evan Smoak, a product of a life of being trained to kill, no questions asked, but somewhere along the line, Orphan X began to ask questions, and he became a threat to be eliminated. Until then, he is the last resort for those in need, he has found his moral compass and he is looking to pay it forward to those responsible for what he became. Vengeance will be his…Non-stop action, explosive tension and through it all, Evan still finds time for hope and love, if only he could get free of the clutches of his past, but it doesn’t’ stop him from seeing to another orphan’s future freedom…Evan is an over-achiever, the best of the best, but can he stay one step ahead of his fellow orphans gunning for him? High energy action, moments of sweet connections and gut-deep revelations make this addition to the Orphan X series another powerful, and magnetic read!In a world of anti-heroes, Orphan X has set the bar for greatness and Gregg Hurwitz has created a fine line for Evan to balance between good and evil, justice and justifiable a she becomes something between a saint with tarnished wings and a sinner with a crooked halo.I was invited to receive a complimentary ARC edition from Minotaur Books!Series: Orphan X - Book 4Publisher: Minotaur Books (January 29, 2019)Publication Date: January 29, 2019Genre: Vigilante Justice | SuspensePrint Length: 400 pagesAvailable from: Amazon | Barnes & NobleFor Reviews, Giveaways, Fabulous Book News, follow: http://tometender.blogspot.com\n"}, {"Review": "4.5 starsOut of the Dark is the fourth book in the Orphan X series and my favorite since the first in the series. I loved the first book and its balance between the Orphan Program aspects of the story and Evan’s constant urge to atone for his past. Out of the Dark achieves the same balance, and both of his cases in this book are highly entertaining and race along to the fabulous and highly satisfying ending. I particularly enjoyed learning about the multitude of ways the U.S. president is protected, from the outfitting of his limousine to the way his food is chosen, and the thousands of people who work daily to ensure that the person who holds that job is safe. Out of the Dark is a fun, highly-entertaining read, and I look forward to more Evan Smoak adventures."}, {"Review": "Oh boy, do I ache all over.Thank you Netgalley and St Martin's Press for this arc. I loved it!. (Note for Judy D., previous reviewer -- this is not a kindle doc file but an E-pub file.... you'll need Adobe Digital reader installed on your computer to read and it's really not nice to rate a book you haven't read a one star).So I couldn't get all comfortable on a nice piece of upholstered furniture.... I had to read this on my computer instead of my kindle. Didn't matter, I love the Orphan X books and I couldn't wait until January to read it. This is the 4th book in the series and while it can be read as a stand-alone, the previous books introduce the recurring characters (several) and should be read so as to fully understand Evan's heart.The pacing and action were pretty much non-stop in this book as expected. There were also enough technical details (weaponry, computer hacking stuff, vodka distilled from fog) that I was able to continue breathing during the six hours it took me to read this. Were those details accurate?? Were they even plausible? I don't know and I didn't care. They were part of the story and the fun. The hide and seek/hunt and chase game was played on 2 different fronts in this book. One front was personal for Evan and it was interesting to watch the moral conflicts that one raised for him. His role in the other game was as his \"No where Man\" persona and had a bit more heart to it. But then his was fighting for Trevor instead of himself.  It was also good to see Joey again and hope to see more of her in future books. The \"Uncle Cousin\" role she put Evan into was fun to imagine.I am NOT cancelling my kindle pre-order of Out of the Dark so that the next time I want to read this, I can be a lot more comfortable on a nice piece of upholstered furniture and I won't have to re-set the font on the screen every time another e-mail comes in."}, {"Review": "Note this is Book 4 of the Orphan X series but I had not read the previous 3 and was great as a stand alone ( although am going to buy and read the other 3 now )Having seen the authors name for the last few years and the Orphan X books I now, after reading this, regret not taking notice before and for it taking me so long to discover this series‘Out Of The Dark’ deals with Orphan X’s personal mission to kill the President!, this is due to things the President did in his murky past that ultimately led to Orphan X having the life he did, it is really difficult not to say too much and thus give the book and the series away ( although this is Book 4 you get a taste of what has come before)The writing is ferocious and powerful in its delivery and intricatein detail, the parts dealing with the President’s security and protocolsmind boggled me and I re read parts such was the fascination of what I was reading The story, well stories as there are a few sub stories are brilliantly toldand laid out and it was like being in ahigh energy ( was going to say octane but who says that ) film and was tense, exhilarating and so fast moving I felt I had been to the gym after a few chapters, intense doesn’t do it justiceOrphan X is complex, frombrutal to sensitive and I really liked him and would cheer him on in all he did....well almost allThe other characters in the book are very well portrayed from President to Orphan A ( not X but A! ) and every character you were introduced to was imaginable within secondsThe ending of the book was as superb as all that came before it, did Orphan x manage to kill the President?......you will find out when read it 😎Brilliant, just brilliant and an instant fan and cant wait to read the previous 3 booksOne of the easiest 10/10’s and 5 Stars ever given"}, {"Review": "Out of the Dark is the fourth book in The Orphan X thriller series which features a Jason Bourne type invincible secret agent trained from childhood to be the perfect weapon. Orphan X left the fold, went out on his own, and pays it forward by helping people who call his special phone number. He has a sort of secret identity and a high tech condo like Bruce Wayne’s bat cave. He is also haunted by his past and by the efforts of some to erase all evidence that the Orphan program ever existed. He is part of that evidence. This is a solid action packed thriller, just not quite the compelling read the other books in the series were. By about the midpoint, this reader was no longer invested in the outcome. It felt very much like a standard story line found in many thrillers. Many thanks to the publisher for providing a copy for review "}, {"Review": "It was always going to come to this. Evan Smoak, aka Orphan X (when he’s not going by the Nowhere Man), has spent years searching for the man who gave the order to have him terminated–after he broke from the off-the-books government program that made him a killer–hellbent on burning their operation to the ground.Likewise, those in charge of the Orphan Program have been looking for Evan, the only asset to ever walk away, in an effort to tie up the exceptionally lethal loose end.Over the years, Evan’s decision to retire as a government assassin has cost him dearly. From being forced to live a nearly hermit-like lifestyle in his tricked-out penthouse, unable to form any real, normal relationships with others, to seeing the few people he does care about killed because of his past, Evan longs for revenge. Now, he finally knows who’s behind everything after unmasking Jonathan Bennett as the highest predator on the Orphan food chain, and Evan has vowed to kill him. There’s just one problem . . . Jonathan Bennett is the president of the United States of America. Decades before occupying the Oval Office, the horribly corrupt Bennett was the undersecretary of defense for policy at the Department of Defense. The Orphan Program was his brainchild, and he gave the mission orders, including an assignment in 1997 that proved to be especially problematic once his political career took off. In an attempt to erase any trace of that mission–and the Orphan Program as a whole–Bennett, who has strategically placed layers of insulation between himself and the operation, ordered the killings of anyone with direct knowledge, making Evan enemy number one. As if taking out the most heavily guarded man on the planet wasn’t hard enough, things become more difficult for Evan when . . .Read the rest of this review here: https://therealbookspy.com/2018/10/24..."}, {"Review": "Out of the Dark is the fourth novel in the breathtakingly action-packed Orphan X series, and boy it's the best yet from master thriller writer Mr Hurwitz. I recommend reading them chronologically to gain the best experience. This time the tables have well and truly turned on Evan Smoak and he becomes the hunter rather than the hunted. The plot, as always, is intricate and well thought out, with plenty of high-octane action, in fact, the action never ceases. Quite regularly a fast, frenetic pace and a substantial focus on the plot and entertainment value means that the characters are neglected and therefore poorly developed, but not here; here, we have both.We watch as Evan grows and evolves, sometimes as a necessity, as the story rolls on, and you can't help but root for him in his perilous adventures. It's not just Evan, though, the minor or secondary characters that operate on the periphery of the plot are also so, so well drawn. The plot is actually very believable, which adds an ominous undertone that runs for the duration, and although there are a plethora of thrills and spills, murder and mayhem we also learn of Evan's dreams, doubts, desires, hopes and fears and his yearning for a normal life. This is an intense and highly entertaining read, which will feature in my best of 2019 list; yes, it's that good. A must-read.Many thanks to Michael Joseph for an ARC.You can also find my reviews posted here on my blog."}, {"Review": "Evan Smoak has a busy schedule: in between his regular job, protecting a vulnerable young man from a psychotic gangster, he has to dodge other Orphans who may or may not be trying to kill him, tending to his fragile friendship with a beautiful widow and her son, provide long-distance emotional support to his feisty teenage ward, keep his potted succulent Cera alive, oh and figure out how to kill the President of the USA!This is the best so far of the Orphan X books, which should definitely be read in order if you want to understand who Evan is, and why he does what he does.This one had it all - spectacular action scenes, cunning traps for the bad ‘uns, sly humour, definite progression of Evan’s story arc and emotional development, the return of some previous characters now taking surprising new roles, and the creation of interesting new ones, especially Secret Service Agent Naomi Templeton and autistic savant Trevon. The President is wonderfully evil and self-serving and watching him get what he deserves is supremely satisfying.I like that Hurwitz features a range of strong women to complement his action hero, as well as showing a very common problem for modern career women, that of having to care for elderly parents as well as hold down a demanding job. We see the hard female assassin who can’t get close to anyone and the tough prosecutor who has to face rape threats from the criminals she convicts and still decline the offer of vigilante justice. I gather the author has signed up for several more books in the series, which is great news, as I can’t wait to see who Evan will face up to next. My thanks to NetGalley and the publisher for the arc in exchange for an honest review.Out of the Dark is available now."}, {"Review": "Out of the Dark by Gregg Hurwitz is the fourth book in his Orphan X series. This latest offering is a thriller of the first order. Orphan X continues his exciting personal missions. Evan is subject number twenty-four in the Department of Defense covert Orphan Program and has been given the codename Orphan X. All of the orphans were taken from foster homes, group homes or similar housing and trained as assassins. Evan was taken from a foster home at age twelve. Evan left the Orphan Program because he could no longer see himself as a mindless killer sent on missions not of his choosing. As the Nowhere Man, Evan now uses his training and resources to help desperate people with nowhere else to turn. The Nowhere Man currently has two missions. The first is for Trevon Gaines, one of the desperate that he has vowed to help. The second is a personal vendetta against the current President of the United States, Jonathan Bennett. I previously read book one of the series but not books two or three. This novel works well as a standalone, but I found the background from book one helpful in understanding the mindset of the main character. Hurwitz has created a captivating cast. Each character has a complete backstory. These characters are complex but not confusing. Trevon Gaines stole my heart. Thus, the characterization is my favorite element of the novel. The plot is also fully engaging. There are enough twists to keep the reader interested without being predictable. The ending is satisfying but leaves enough mystery to allow for an addition to the series. Out of the Dark is a complete success and I give it 5 out of 5 stars. I recommend it to lovers of political intrigue. There is some violence but not enough to deter the average reader, though the very squeamish may be offended. My thanks to St. Martin’s Press/Minotaur Books and NetGalley for the opportunity to read an advance copy of this book. However, the opinions expressed in this review are 100% mine and mine alone."}, {"Review": "Out of The Dark by Gregg Hurwitz is the fourth full-length novel involving Evan Smoak. Smoak is known as Orphan X and also The Nowhere Man.As a child, Smoak, an orphan, was selected by a secret organization for training to carry out secret government acts, including governmental assassinations. Smoak has created his dual role as The Nowhere Man to help innocent people facing dire circumstances with no one else to turn to as a way to atone for what he feels are his past sins. The fourth novel resumes immediately after the third and continues the story from that novel. Smoak also continues to provide his services as the Nowhere Man and continues his friendship with his single mother and son neighbors. It is difficult to discuss other plot details without revealing spoilers. All that really needs to be known is Hurwitz has created an excellent thriller series with well-crafted plotlines and characters. Highly recommended for those that enjoy Lee Child and Stephen Hunter novels."}, {"Review": "If I'm ever in trouble, I hope someone calls Evan Smoak for me! Orphan X is back in the 4th installment of this fast paced, fun thriller series and he's going after his most hated opponent yet, the President of the United States. The prologue shows us a very interesting scene in Russia in which Evan is out on his first solo mission as a trained assassin for a dark black ops program the US government formed.  I really enjoyed getting a glimpse of Evan as a young man because, cut to current day, he's now in what I guess to be his late 30s and he's no longer in the program. He now spends his days being The Nowhere Man, carrying out his own brand of vigilante justice for those who call his super secret line and are in dire need of help. The two storylines run parallel to each other and the author pulls them off brilliantly.While Evan is doing some serious scouting of the President's agendas, day to day security details, life in and outside The White House , etc we are privy to some fascinating details about the life of The President which I'm assuming are true (at least most) and which seem very thoroughly researched. This was one of my favorite parts of the book actually! While Evan is deciding on his best course of action to assassinate the President, the President has called in Evan's arch rival, Orphan A, to kill Evan. It's all very cut throat, fast paced, and tension filled.Along with these 2 main storylines, we also have Evan's ongoing romantic involvement with his neighbor, single mom and prosecutor Mia, who, accurately enough, suspects that Evan isn't living the most law abiding lifestyle (she has no idea how right she is) so she won't allow herself or her son to become too invested in him. I love how Hurwitz has weaved this thread of Mia and Evan throughout all 4 books.If this sounds like a lot going on in one book, it is but it all works. I've said it before, the Orphan X novels remind me of the Jason Bourne movies so if you like that type of fast paced, action filled thriller with a very smart good guy to root for, who let's face it, seemingly can't be killed and almost never sleeps, this is for you. Do you have to suspend disbelief in parts? Of course, but who cares because this story and these characters are just so well done.I will say, I highly recommend starting with book 1, Orphan X, in order to get the full backstory of these characters but if you choose to start here, Hurwitz does a great job of providing just enough info about important events from the previous books so you won't feel completely lost. If you're in the mood for an action packed thriller, you can't go wrong with this series and good news.... I read that there will be 3 more Orphan X books in the future so you have plenty of time to catch up!You can find all my reviews & more at www.itsbooktalk.com"}, {"Review": "“Out of the Dark” is part of the “Orphan X” series, but it starts with a flash back that introduces Evan and details the relationship between Evan Smoak, Orphan X, and Jack. This gives new readers any needed background and adds new insight for fans of the series.Evan had no idea why his first mission was so important to Jonathan Bennett, now president of The United States. Evan is one person, a representative of the children who had had been taken from foster homes, trained, indoctrinated, and spend their existence serving their country. Bennett is the president of The United States with unlimited power and resources. Ending Jonathan Bennett will be the ultimate Nowhere Man mission. However, killing the president is going to be a lot of work. Whether Evan is successful or fails, nothing will ever be the same for him again. Intertwined story lines also include, Mia Hall with her nine-year old son, Peter, and someone else who needs Evan’s help, someone alone and desperate. Trevon Gaines walks from the bus stop to Mama’s place. He opens the door to find that everything and everyone he has known is gone, dead in a vicious bloodbath. He is alone and scared. 1-855-2-NOWHERE rings, and Evan answers. Now he is “The Nowhere Man,” called by someone in desperate need of his help, lending his services to a truly frantic young man, to someone who has nowhere else to turn. Hurwitz transitions seamlessly between the multiple storylines, and readers easily get a feel for the complex plot details and the multi-faceted characters. They all have neighbors, acquaintances, everyday chores, responsibilities, and tasks that make them familiar and human. Readers also watch Evan changing, opening up to the world and all that is in it. He juggles personal issues and his professional life. Little everyday details bring Evan back to reality, and in his next life, he vows he will be a Starbucks barista.Exacting descriptions allow readers to picture the participants: “He was built like an anvil, a whisper over five-nine, broadened with veiny, bulging muscle.The locations:“The park bench by the artificial pond looked like a movie prop, set at an artful slant beneath a Rockwellian maple tree.And to anticipate what will come:Evan said, “I’ve killed generals. I’ve killed foreign ministers. I’ve killed captains of industry.” The voice came back, calm as ever. “But you’ve never killed the president of the United States.” Evan said “Not yet,” and severed the connection.The details of the storyline are impeccably accurate. The equipment details are so specific and authentic that if one wants to buy a Santa Cruz Slasher sticker, some reinforced luggage, a RoamZone or expensive wine and vodka, all of Orphan X’s favorites are just a click away. Of course, the Tesla incident is every owner’s nightmare. Hurwitz is a master storyteller and in true Hurwitz style, the surprise ending is intricate and startling. I received a copy of “Out of the Dark” from Gregg Hurwitz, Minotaur Books, and Net Galley. It is an understatement to say that it is compelling and action-packed. This is a book that grabs readers right from the start and never lets go. "}, {"Review": "Evan Smoak (Orphan X) and President Bennett are out for blood: each other's, stemming from Orphan X's first job, an assassination in Eastern Europe pinned on a local rival. Bennett frees Orphan A from prison (who also wants Evan smoked) and offers Orphan A whatever assistance he needs. As Evan plots Bennett's assassination, he partners with an old adversary, a female Orphan, since she is also part of Bennett's intended clean-up of the black ops program, which created the Orphans. There is an interesting cat and mouse game with the Secret Service officer running point on stopping the assassination. Meanwhile, in his role as the Nowhere Man, a savior of people who have lost everything, he agrees to help a high-functioning, but developmentally disabled man, Trevon Gaines, whose family is slaughtered by a ruthless gangster because Trevon did not know the gangster's container was supposed to be protected. Good, but not great."}, {"Review": "I love this series so much.If you’re new to it, Orphan X is kind of like the equalizer with heart. While I recommend starting with book 1 just because it’s awesome, you can absolutely start here. The author does an excellent job of giving just enough backstory for new readers without boring longtime fans of the series.As usual, the book is full of drama, intrigue, and pure thrills. The author brings back a character I loved and gives us a new character who almost broke my heart.Expect non-stop action and things that go boom!Very happy with this series and looking forward to another book!*ARC Provided via Net Galley"}, {"Review": "Many thanks to St. Martin's Press, Minotaur Books and NetGalley for an eGalley of this novel.Definitely 4.5 stars would be my rating if I could use half stars. In this fourth book in the Orphan X series Gregg Hurwitz brings back all the characters I want to keep up with as the series has progressed and added in some new people of interest. As the Nowhere Man, Evan Smoak encounters a *civilian* victim who plucked every emotional nerve I have. I kept wishing more attention had been given to Trevon but think the main focus of the novel was so complex and had to be so action heavy that there just wasn't room for more of Trevon's situation. The show-down between Jonathan Bennett, President of the United States, and Evan Smoak, assassin Orphan X, has reached boiling point and Evan is in Washington D.C. to make preparations for his mission to eliminate the most well protected person in the world. This operation has all the hallmarks of a mission impossible.An informative element in this story is going back to Evan's first mission in 1997 when he was 19 years old. This provides another opportunity for readers to understand what effort went into the training of the Orphans and goes a long way to explain why Evan became so close to Jack. I know when I begin reading one of these types of novels that I will have to park my believability detector in the alley behind the house. No way could these things actually happen, but Wow! are they ever exciting to read when the author gets it right. Gregg Hurwitz gets it right with this series and book #4 is no letdown."}, {"Review": "\nJuly 28, 2018Gregg Hurwitz has left everyone wanting more...Wanting more rescues...More Insight...And more Risk Taking...By giving us more, hopefully We will find our way...\nOut of the Dark- January 2019\n Orphan X (Evan Smoak, #1)https://www.goodreads.com/review/show...The Nowhere Man (Evan Smoak, #2)https://www.goodreads.com/review/show... Hellbent (Orphan X #3) https://www.goodreads.com/review/show... Out of the Dark (Orphan X #4)https://www.goodreads.com/review/show... A gifted copy was provided by author/publisher for an honest review.For more Reviews, Free E-books and Giveaways\n\n"}, {"Review": "The defunct Orphan project developed super-killers for the USA, assassins who could kill anyone with a pen ten different ways, who were also clever enough to outthink, outplan, and outrun any adversary. In this, their top assassin was Evan Smoak also known as Orphan X:\"He sensed the men approach’s before he heard them. A vibration of the floor. A scent in the air. A pressure against his skin. He heard the melody of a slender rake tickling lock cylinders at the back door. Beneath the kitchen window, a boot tread compressed a dead leaf. In the living room, the pane issued a complaint as it pressed against the frame.\"His and his fellow Orphans' purpose was to serve the government until that was deemed too dangerous for the men in power. Then, instead of decommissioning them to return to the normal lives of American citizens, the nation's president decided they must be eliminated, every one of them. Many are killed before one of them--Orphan X, Evan Smoak--decides to put a stop to it by killing the President (well, it's a bit more complicated than that, but for the purposes of this review, I've distilled the plot to a thimble). Opposing him is another Orphan, Orphan A, with all the same skills that Evan has but with also the power and brawn of the US Government to support his effort. Evan has retired, hiding from would-be government killers, and now calls himself the Nowhere Man, using his prodigious skills to help those with nowhere else to go for aid. He does it for free with their promise that they will send others in need to him. It's his way of atoning for what he now considers past sins. As he arranges for the President's murder, he gets a call from a high-functioning special man whose family--about a dozen of them--were mass-murdered by drug dealers. To Evan, as important as it is to rid the nation of a leader who is irretrievably corrupt, it is equally important to help this man who has done nothing to deserve what has happened. Throughout the story, we get glimpses into Orphan X's past. Where we would be tempted to drop him into a box labeled \"hopeless murderer\", we find that can't be done. We even end up empathizing with his passion and goals. As a result, he becomes not a nasty bad guy, not a lovely good guy, but a mashup in between. Proof that I was siding with him was later in the novel when he ended up in a life-and-death footrace with Feds and I found myself rooting for him.In this book, Greg Hurwitz has an enviable way of phrasing thoughts and ideas into amazing paragraphs. Some of his books, this hasn't worked as well but in Out of the Dark, with Evan Smoak, Hurwitz has found a character that is exactly right for him and his prodigious writing talent. This is an excellent read, a page-turning thriller like I haven't enjoyed in a while. I can't wait to read more of this character.--I received an ARC copy from NetGalley in return for an honest review"}, {"Review": "Evan Smoak has been known as Orphan X and the Nowhere Man. As Orphan X, he has “killed generals, foreign ministers, captains of industry” to name a few. He was the best in a program that produced only the best. Orphan X has been hunted for three books now, at first, he didn’t know why, but as he was able to put the pieces together, he realized someone is erasing the Orphan program and disposing of all the orphans. Some have walked away from their life as word class assassins and have tried to create a normal life, some have even built themselves a family. Realizing that these orders are coming from the very top of the Government structure, Out of the Dark sees Evan transition from the hunted to the hunter.As the Nowhere Man, Evan helps people in desperate need, grasping for a lifeline before they went under for good. Reaching him on his durable RoamZone, each client he helps is tasked with finding someone like themselves that needs the Nowhere man, the phone number 1-855-2-NOWHERE. In Out of the Dark, the mission is a brutal one. When Evan gets that call on his RoamZone, he is immediately forced to break the Seventh Commandment, continuing with the ultimate Nowhere Man mission, perhaps the biggest solo mission in history and helping his new client. The action is nonstop, the intensity continuously climbing. With Evan, nothing is as it seems, when you think he’s cornered, when you can’t possibly imagine how he will get out of the situation, he surprises you and his adversary, but before he does. He asks them; “Look into my eyes. And ask yourself: Do I look scared?”The new client, Trevon Gaines also lives by a set of rules established for him in an effort for him to live a normal social life. Living with an intellectual disability of sort, but ‘high functioning’ he lives a structured life, following his ‘goals for the day’ given to him, whether it’s at his job, at home, or social cues to help him be accepted by others. At work Trevon found himself filling in for another co-worker that got food poisoning who was supposed handle a task in a specific manner. Trevon was given these new directions, but his ‘disability’ if I can call it that, prevented him from breaking the rules. As I mentioned, Trevon lives a life of structure, only being able to move forward when one task is complete properly. Since Trevon did not complete this task in the manner laid out by his co-worker, his boss decided to make an example out of Trevon to sway any other employee from making such choices. In what I can only describe as a man of pure rage, he jumps from normal to rage in a blink of an eye and decides to literally erase Trevon’s entire lifeline from existence by brutally murdering his entire family and loved ones. At this point, Trevon and his boss realize he has only one family member left that is currently out of the country. His boss’ intentions are clear, his threat real because he has already slaughtered his entire family. Trevon is now hopeless, lost, unsure of what to do, then, a stranger appears, a man with a mission of his own. Find someone that needs the Nowhere Man like he did, and Benito Orellana, the man whose son Evan saved from the gang in Hellbent, asked Trevon “can you remember a phone number?”The U.S. President, Jonathan Bennet hellbent on killing Evan puts together two teams, one official, led by SAC, Naomi Templeton, the Secret Service agent that has been put in charge of finding this threat against the President. The other team, unofficial led by Judd Holt aka Orphan A, this team consisting of a team of misfits, convicted rapists and murderers. With the President driving the bus, Orphan A has all the tools he needs at his disposal to mount an attack on Orphan X. In one instance, utilizing a DoD supercomputer where Orphan A gave it specific hypotheticals that only an Orphan would be able to come up with, this supercomputer spit out a reservation for a hotel Evan was bedding down in. Attacking Orphan X however proved to be a suicide mission, killing his intruders and getting away from Orphan A in the nick of time. Orphan A, working for the President as well as being on a personal mission to kill Orphan X is resilient and won’t stop. However, it’s been proven time and time again that Orphan X is the best and Out of the Dark proves that once again. With Evan announcing his intentions to take on the most powerful man in the world, by sending him a clear message, multiple times. First, by placing a rifle on his route intended to send a message only the President will understand. The second, Orphan X mounts an attack on the President that is risky, but very impressive and brilliant. This mission, while successful, seems like a failure. It does however make the President become very paranoid. Forcing his people to check, double check, then triple check everything from the food delivered to the White House, to its water supply, the chemicals used in the pool, his clothes, even a suit tie made him scared of Orphan X. Which is exactly what Evan wanted!Returning characters not yet mentioned include Joey, introduced in Hellbent as a runaway Orphan. She is back with a foul mouth and brilliant cyber capabilities which Evan utilizes to gain an advantage against the multiple parties pursuing him. Joey, bored with her current predicament, but staying put for the time being will hopefully (fingers crossed) return in future Orphan X novels, maybe even get her own short story that Gregg Hurwitz sometimes gives us. (Check out – Buy a Bullet & The Intern). Another returning character, Candy McClure also known as Orphan V. As elusive and deadly as Evan himself, she and Evan have had a long history of trying to kill each other, one of those times, back in Orphan X, Gregg Hurwitz’s first Orphan X novel, Evan was defending himself and kicked Candy into her own stash of concentrated hydrofluoric acid, her back and shoulders taking most of the damage, now “from the front, a centerfold. From behind, Freddy Krueger.” With Candy or Orphan V Evan must tread carefully, with the Secret Service and Orphan A and his band of misfits working hard to track him down, plus the Nowhere Man mission with Trevon, he can’t afford another target. But why exactly is Orphan V announcing herself all the sudden? This spoiler is too good to let escape in a review, order Out of the Dark and plan to take Tuesday, January 29th off from work. This is the best Orphan X novel to date, maybe the best thriller novel of 2019. It is an absolute Must Read. The only instance I can think of to not read this novel right away, is if you have not read any other Orphan X novels. While this book works just fine as a standalone, I highly recommend you start from the beginning of the Orphan X series and read them in order, you will not be disappointed"}, {"Review": "Thanks to Minotaur Books for the free advanced copy in exchange for my honest review. Hurwitz brings us book 4 in the Orphan X series, and I loved it just as much as HELLBENT. I came into the series late, but I went back to pick up books 1 and 2. I would highly recommend this series to those who love some political intrigue to their thrillers.The Orphan project was an off-the-books operation that was designed to create assassins. At the age of 12, Evan Smoak was taken from a group home and was raised in the Orphan Program – he was known as Orphan X. After using the skills he was taught, he escapes and becomes the Nowhere Man – the person you go to when you’re truly desperate.His new life is in jeopardy when he finds out that someone at the highest level of the government is killing off the Orphans and their handlers. Someone wants all traces of the program to be eliminated. The President made the mistake of killing Evan’s handler, and now he has one mission – to seek revenge. What will happen when Orphan A is brought in to take on Evan?So much action and I love the espionage and intrigue in this. I’ll always be a sucker for those elements in thriller novels. I would highly recommend this series to anyone that’s fascinated with the idea of highly trained secret assassins. It’s quite the battle between Orphans and it’s one you won’t want to miss if you’ve already started the series."}, {"Review": "This was another stellar product from Gregg Hurwitz. Evan Smoak is an amazing tool that the US government used in many ways and some of those might have been more ruthless and undermining to the good order on the international stage. Smoak deals with demons from the past in forms of fairly prominent people. His job as an orphan in one of the most complex black ops communities has led him down a dark path that led him to running from the people that were leading him. They've wiped out a lot that Smoak loved and cared for and its his turn now to make things right. As Orphan X, Smoak fights against and with other orphans to make things right. I have always enjoyed the Orphan X series from Hurwitz and this is another great read that definitely gets 5 stars from me. There is plenty of intrigue and page turning action to keep you driven to want to know the truth."}, {"Review": "First of all, thank you to Netgalley and Minotaur books for this advanced copy. Having just finished Hellbent, I ran seamlessly right into this book.Out of the Dark is a fantastic cat-and-mouse game. It follows Evan Smoak (aka The Nowhere Man, aka Orphan X) where Hellbent left off. The President has interest in Orphan X, specifically the entire Orphan program. Without spoiling the book, Evan is in his usual scenarios. Despite his running, shooting, plotting, and hiding, he still likes his chilled vodka. He still is in a will they/won't they relationship with Mia and her son, Peter. Familiar faces re-appear in this book. Hurwitz does a great job of creating these characters, having them show up in each book, as though no time has passed since we saw them last. He builds suspense in his writing, and has the reader trying to solve what's coming next. I hope to come back to this review once the book has been published. A must-read for any Hurwitz fans!"}], "Genre": "Thriller", "ID": "39863167", "Desc": ""}