{"Name": "The Current", "Image": "https://images.gr-assets.com/books/1533326256l/36387759.jpg", "Reviews": [{"Review": "Tim Johnston has again written an outstanding literary suspense thriller!Having been introduced to the author in 2016 with, Descent, I was highly anticipating getting my hands on his next book. The Current did not disappoint! A page turning, psychological crime thriller with many twists and turns, The Current, is a dark, emotional novel filled with tension and rage, guilt and revenge, but also compassion.Two friends leave college to drive to Minnesota to visit Audrey’s father, retired sheriff Tom Sutter, as he is getting close to the end with cancer. A stop at a gas station in Iowa not far from the Minnesota border brings about an unfortunate event never expected. Hurrying to get back on the road again in the harsh, cold winter, their car goes off the side of the road and unexpectedly plungs into the Black Root River.This book brings to life the atmosphere of small town living. Ten years ago a similar accident caused the death of a young girl, Holly, by drowning in the same river. Circumstances put a young man, Danny Young, under suspicion, but he was never convicted. Filled with likable characters, Johnston shows both sides to each individual. Their kindness, but also the hidden darkness inside all. I loved the storyline centering on Wyatt, a rescued dog of Danny’s, that plays on your heartstrings throughout the book.This is a book about how people, whether they be family, neighbors, or friends, look at a person under suspicion ever if cleared, and which changes their life forever. This is about the strength of two young women under devastating circumstances.Written with beautiful prose, Tim Johnston’s book is his second to be added to my favorite book list. With so many thrillers out there, The Current, stands above them.Highly recommend.5 out of 5 starsThanks to Algonquin Books, Andrew, and the talented Tim Johnston for sending this ARC in exchange for an honest review.Publication Date - January 22, 2019"}, {"Review": "4 Stars.A Taut, Tension filled Thriller that kept me on my Toes! When two girls go into the river, only one comes out, nineteen year-old Audrey Sutter. Ten years ago another girl’s life was lost to that same river: Holly Burke - her death was suspicious and though there was a suspect, he was never charged. The Sheriff at the time was Tom Sutter, Audrey Sutter’s father, he has never forgiven himself for letting the killer go free. Now, his own life hangs in the balance. Gordon Burke re-lives his daughter’s death every single day and wants justice more than anything. Audrey Sutter remembers the feel of breaking through the ice, the woosh of the river, the insane cold against her skin and the break of bones. Most of all she remembers her best friend Caroline. Knowing she can’t get her back, she dives into the past, for her best friend, her father - the Sheriff, Gordon Burke and most of all, for that girl who was lost to so many oh so long ago.Full of intrigue, lies, secrets and suspense, “The Current” is a novel which I loved from start to finish. I highly recommend this mystery if you are looking for a novel to keep you enthralled throughout.Published on Goodreads on 2.5.19"}, {"Review": "Life is about the intrusion of the unexpected.Sun-filled, glorious days fill us with the ease of life and its gentle flow. But it is in the ravaged moments of night that brutal reality visits upon us. And with it comes the jagged scars that are deep, very very deep.Two Iowa college girls take to the road heading north in the midst of an icy Minnesota winter. One girl has home as her destination. The other girl will have quite the unplanned destination. They stop nearly out of gas at a small town convenience store. A simple trip to the outside restroom will place them face-to-face with some hard-boned individuals from hell. They will soon find themselves on the banks of the Lower Black Root River facing consequences that they could never have imagined.Tim Johnston presents a story that will evoke a whole range of escalating emotions. If you have read his previous book, Descent, you know where his talents lie. I simply had to give this one all the stars......the mighty 5-Star medal of honor. The storyline has a definitive ebb and flow like the aforementioned river. But it's his uncanny ability to hone his characters into believable, raw, achingly human individuals who tread the high roads of life as well as the dark, foreboding roads, too. Johnston can take unspeakable grief and give it a face. Agony and vengeance find a voice here. And not all heartbreak in life finds its way to the surface. Real people hold onto it and clutch it because it truly belongs to them alone. Pay attention to each soul that weaves a pattern throughout this story. Savor the dialogue. Prepare yourself for Old Wyatt the cripped up rescue dog. We all serve our purpose in life whether of long or short duration. Tim Johnston gives us a hand on the shoulder to remind us of that truth.I received a copy of The Current through NetGalley for an honest review. My thanks to Algonquin Books and to the very talented Tim Johnston for the opportunity."}, {"Review": "Two best girlfriends were travelling by car from their Southern college to a small town in Minnesota. Caroline Price had generously volunteered to drive Audrey Sutter seven hundred miles to visit her father, Retired Sheriff Tom Sutter. Sheriff Sutter had inoperable lung cancer. A late night gas station stop in Iowa, near the Minnesota border, on a raw snowy night, turned deadly leaving Caroline missing and Audrey barely alive.The gas station, approximately two deserted miles from the highway looked desolate. Two vehicles were parked near the ladies restroom, one being a two-tone truck. A bathroom pit stop...Audrey was accosted...Caroline pepper sprayed the young men...then...Audrey and Caroline stumbled to Caroline's RAV4 and attempted to drive away. As they approached an icy trestle bridge, the car was rear ended and plunged, nose first, into the Black Root River. Audrey woke up in the hospital, Caroline was presumed dead. Who would do such a thing? Gordon Burke used to co-own Burke-Young Plumbing and Supply. A decade ago, his sixteen year old daughter, Holly was found dead in the Black Root River. A car accident...but...when still alive, she was pushed or had fallen into the river. Why did Danny Young skip work that day to go hunting? Danny seemed to be the prime suspect. No case...lack of witnesses or evidence. Immeasurable grief and loss. Sheriff Sutter never found Holly Burke's killer. Gordon Burke wondered, \"What would he do for himself that he didn't do for me?' There is no longer Burke- Young Plumbing and Supply. Rachel Young, the onetime suspect's mother, is somewhat comforted by the presence of Danny's old dog, left behind by Danny. Waging an uphill battle, Audrey is determined to fight back in memory of Caroline and to jump start her stalled life journey.\"The Current\" by Tim Johnston is an atmospheric, psychological, emotionally packed novel. The mysterious, unsolved drownings in Black Root River were difficult to fathom, culpability difficult to unmask. Author Johnston very successfully created numerous twists and turns to mislead and pique the reader's interest. Highly recommended!Thank you Algonquin Books and Net Galley for the opportunity to read and review \"The Current\"."}, {"Review": "“The nose of the car drops over the edge of the bank and the world pitches, and their own weight rolls forward through their bodies as at the top of a roller coaster just before the drop – the deep human fear of falling, the plunging heart, and there’s no stopping it and no getting out and nothing to do but hold on. And down they go, fast and easy in the snow, toboggan-smooth, hand in hand, their grips so tight, the grips of girls much younger, girls who will not be separated, their faces forward, watching the surface of the river, the black glistening ice as it rushes up toward them, larger and larger, until there’s nothing in the windshield but the ice, dark and wide as an ocean and they are going to it, they are going to strike it nose-first with the car and they can imagine that, the sudden ending of forward motion as the car meets the plane of the ice, but after that they cannot imagine, they have never been here before and there is no way to know what will happen next except to go through it…”-\tTim Johnston,The CurrentOn their way to Minnesota, two college girls end up in the Black Root River. One girl drowns. The other girl, Audrey Sutter, is pulled from the frigid, icy waters alive. How they ended up in the river is one mystery. There will be more. When I read Tim Johnston’s Descent back in 2016, it blew me away. It was a surprisingly good hybrid thriller, part Iowa Writers’ Workshop, part James Patterson. The story it told, of the abduction of a young woman, is quite familiar, both in fiction and in real life. The way Johnston told it, though, was unique. He wrote beautifully, with an impeccable sense of place. And he wrote perceptively, with a keen eye for characterizations. He was interested in bigger things, and showed that in the sensitive way he examined how the loss of a loved one leaves an aching hole in one’s heart. Johnston brings those same talents and sensitivities to bear on a story that, on first blush, also seems quite common. The Current is a novel about a small town, and big secrets, and an old murder. All ground that has been tilled before. Yet Johnston makes it all seem incredibly fresh. It is as though a chef from a Michelin-starred restaurant walked into an Applebee’s and started preparing dinner. The main character is Audrey, whose dying father happens to be the former sheriff of her small community. As she starts to investigate the events that led to her near-death experience, she stumbles upon clues that will reopen a decades-old murder that also ended with a girl in the Black Root River. Audrey is a complex protagonist, stubborn and inquisitive, filled in equal measure with courage and half-baked ideas. She follows on the heels of Descent’s Caitlin Courtland, a woman who has been victimized but refuses to be a victim. In that sense, The Current feels very of-the-moment. (Both Caitlin and Audrey are less violent though just-as-determined versions of the forty-years-later version of Laurie Strode in the updated Halloween). Audrey, though, is only one of many figures who capture Johnston’s roving eye. The Current is told from a limited third-person perspective, shifting from Audrey to her father, the ex-Sheriff Sutter, to the dead girl’s father, Gordon Burke, and to the onetime suspect’s mother, Rachel. These people, and more, are finely wrought, drawn with indelible details. Johnston creates these men and women with incredible precision. In just a scene or two, often a quiet scene, he can make these people come alive. Johnston’s efficiency and ease in crafting his characters puts me in mind of Stewart O’Nan. The Current is a genre thriller done with true literary flare. Johnston writes gorgeously, his prose leaping off the page. Always, though, the prose is in service to the story. The structure of his sentences, his choice of words, the cadences and rhythms, all add to the mood. Speaking of mood, this novel has it. The Current is dark and grim and relentlessly focused on its themes of grief and loss, of past mistakes, and of the twists and currents of fate. Along with the mood Johnston provides plenty of atmospherics. The descriptions of the river, the forests, the cold, are almost tactile. Meltwater ran across the roads in streams and hissed under the tires and you could put the window down and smell the earth and you knew the winter wasn’t forever after all and the land would be green again, the river would flow again, and from the bridges you could see the slabs of ice jutting into the air, and if you pulled over and stood on the bank you could see the slabs moving and grinding against each other like icebergs, like ships, all in a tight puzzle-work of pieces and all of it moving together foot by foot downriver, cracking and popping and grinding as the river below swelled with the thaw and pushed and surged and would not be stopped.Complimenting the wonderfully descriptive writing is Johnston’s stylized dialogue, the characters’ speech patterns imbued with a weariness of past sorrows that reminded me of Cormac McCarthy in No Country For Old Men.There is, for example, a moment when Gordon Burke, father of the murdered Holly Burke, talks to Sheriff Sutter about the newest fatality of the Black Root River: “That man down in Georgia,” Gordon said, “that girl’s father? Hell, he ain't even the same man anymore, Sheriff. He’s already some other man.”The Current is suspenseful and well-plotted, meaning that your natural inclination is to read it as fast as you can. That’s probably the novel’s biggest downside. As the momentum hurries you along, you forget to stop and enjoy the craftsmanship. More pertinently, you might miss some of the clues strewn along the way. When I finished, I definitely had to flip back through the pages to make sure I caught everything. The ending here is absolutely mesmerizing. There are two central riddles that require solving. One is the murder of Holly Burke. The other involves the death of Audrey’s friend. In stunning fashion, Johnston delivers two conclusions, one that is fit for the standard potboiler, while the other attempts to wrap its arms around the cosmos. That’s super vague, I know, but I can’t say any more without ruining it. I will say, though, that the last page, the very last page, struck me with a force that stunned me, left me gaping, slack-jawed in bed. It tied things together in a way that I had not foreseen, with a power that is hard to describe. I wish that I could tell you more about it. I wish that we could get together, crack open a bottle of Sutter Home chardonnay, pour some over ice, and have a half-buzzed book club discussion about it. Barring that, you will have to read this for yourselves, on your own. And you should. The Current is smart and sharp and deep and sad. It is easy to read, hard to forget, and thoroughly entertaining. (I received an advanced reading copy in exchange for an honest review)."}, {"Review": "First and foremost, a large thank you to NetGalley, Tim Johnston, and Algonquin Books for providing me with a copy of this publication, which allows me to provide you with an unbiased review.In my first exploration of Tim Johnston’s work, the novel took a journey that may literally chill the reader to the bone. On their way back from college, two young women stop for gas in the middle of winter. A simple fill-up soon turns sour when one is assaulted by two men who prey on her solitude. After fending them off, the women rush to their vehicle and continue on their way, hoping the worst is behind them. Bright headlights soon creep up in the rearview mirror and the vehicle is bumped off the road, teetering on the edge of a body of water. In the moments before they lose consciousness, both women vow to get through this together. When Audrey Sutter wakes, she is in the hospital with significant injuries. Her friend was not so lucky, having perished before a passer-by called the authorities. Now, with her fractured memories (and bones), Audrey must relay what she knows to the sheriff, who tries to formulate a suspect list. Audrey’s father, Tom, is a former sheriff himself and will not stand idly by as he seeks to locate the perpetrators. However, this proves harder than it seems and leads go colder faster than the ice water in which his daughter was once submerged. With a cold case coming to the surface and the local sheriff choosing to run things at his own pace, those who sought to kill Audrey remain at large, but are they watching so that they can finish the job? Johnston weaves an interesting tale that seeks to control the reader’s experience like a strong-willed river current. With all the elements for a successful novel, I am not sure why this one missed the mark for me.Having sampled no past work by the author, I am required to let my gut and first impressions steer me. Johnston utilised many of the needed elements to craft a decent novel, including a crime and assault to open the story. However, it would seem that there was a supersaturation of information that diluted much of the delivery. Audrey Sutter, who plays at least a partial protagonist character, proves to be somewhat likeable, though I did not feel a strong connection to her. She’s young and is forced to come to terms with much loss in short order. Still, I would have liked to feel as though her fate (and finding the person/people who tried to kill her) meant more to me. The same goes for many of the other characters who crossed the pages of the book, including the retired cop Tom Sutter. Instead, many of the names and their backstories blended together to form a giant wad of narrative goop. Johnston had some great ideas amidst the various tangential storylines, something that I think might better have been developed in a series. While the central crime does recur, there are so many people with insights on different plots that the reader is forced to parse through all the discussions and keep things straight. Johnston has a strong writing style and I applaud this, but I could not find a level of comfort to pull me through this piece. Best of luck for those seeking a story with lots to offer, but too much to digest.Kudos, Mr. Johnston, for your efforts. Not my cup of tea, though the premise drew me in from the outset.Love/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"Review": "⭐️⭐️⭐️💫 / 5 rounded up. Well, I did not like The Current by Tim Johnston as much as I liked his novel Descent, but it was still a captivating read that pulls at your heartstrings. What it's about: 2 college students, Caroline Price and Audrey Sutter, are on a road trip from their college campus in Georgia to Minnesota so Audrey can see her dying father. It is the dead of winter, and Caroline's car ends up going into the river, with only one of them making it out alive. Years earlier another girl was pulled from the river, and Audrey's sheriff father never did arrest anyone for it. Could these deaths be related? One father is desperate to find out. I wouldn't really call this book a thriller, but it is definitely a very emotional mystery. I ended up being hooked from the very beginning, and was very intrigued by the writing voice Johnston went with. Like I said at the beginning of my review, The Current is an emotional novel that makes you think about father/daughter bonds, and how far family will go to protect each other. The different perspectives that Johnston chose to use made a small town in Minnesota seem even smaller, and also causes you to think about how crime effects a small town and the people in it. The Current is a thinker of a book that is a slow-burn mystery with lots of focus on the characters.Final Thought: There is a lot of soul to the books that Johnston writes, and they always make me think about things that I normally wouldn't focus on in a mystery. [book:The Current|36387759 is a lot more than your standard mystery novel, and I would recommend to people that like lots of depth to their novels. Both character wise, and plot wise. Just keep in mind that a thriller it is not, but the mystery will surprise you, and the ending seemed to come out of nowhere for me. Thank you to the publisher for providing me with an advance review copy of this book in exchange for an honest review. All opinions are my own."}, {"Review": "Audrey Sutter and Caroline Price drive 700 miles to Minnesota from their southern college in order for Audrey to be with her Dad who is dying of lung cancer. They stop at a dodgy gas station, and encounter two ‘good-old-boys’ that want to toy with them. Fast thinking allows them to escape, but they end up driving too fast and slipping on the icy road next to the frozen Black Root River. And then a vehicle comes up behind them and nudges their RAV4 onto the ice.The ice breaks and the current takes the girls away—one dies and one lives. But more than that, the frozen shards of ice pierce the small town’s memory of another death that happened ten years previously. The murder of teenager Holly Burke still haunts the community. Gordon Burke, Holly’s father, seems paralyzed with grief. Danny Young was accused of the crime, but lack of evidence kept him from being charged. No matter, he lives his life like a doomed man in exile. His twin brother and mother hope that he will eventually return home. In the meantime they care for his beloved dog Wyatt. And Audrey’s dad? He was the sheriff that conducted the initial investigation and replays the cold case repeatedly in his mind trying to find answers.Johnston imbues this story with heavy atmospherics—the brittle cold of Minnesota, the smells of the river, and even the taste of oily, grease-encrusted fingers. But his forte is developing characters that are believable as they ache with unspeakable grief. This is an emotionally packed novel where secrets seek to pull them under and drown them. The predator is counting on those secrets being kept. Audrey Sutter is breaking that ‘ice’ with all of her questions. Could that put her in danger? You bet.Not all of Johnston’s story is temporal. Audrey meets ghosts in the river when she falls through the ice. Marky, Danny Young’s twin, has knowledge of his brother through dreams. Johnston even adds a spiritual conclusion to his temporal one. Highly recommend this ‘literary’ murder/mystery."}, {"Review": "Well I find myself thinking of The Current and it is like a force of something powerful that reminds me of sitting in high school English reading something that is supposed to be profound about mankind or nature or life or maybe all three but all I was thinking about having to work later and how long could this book be would it ever end and how could so many words that were supposed to mean something be so tired?The Current reads just like that word salad. It is trying to be deep but it's so busy filling in every space with thoughts that aren't half as clever as the words it wraps them in that it forgets things like character development and plot. The Current is a meandering ride to nowhere."}, {"Review": "5 \"treacherous river current\" stars to this oneI was utterly captivated by the writing in this book. The story was very compelling, and the suspense built throughout the book, but I wouldn’t characterize it as your typical thriller.The book opens with two college friends on a road trip to Minnesota when things take a terrible turn. The rest of the book deals with the aftermath and the connections to a similar crime ten years ago. Small town life is explored, secrets unearthed, and old suspicious aroused. Themes of grief and unresolved tension fill the small town. The characters are achingly real. The main character is Audrey, who has returned home full of guilt and facing an uncertain future. She is the daughter of the dying former sheriff who regrets never solving the case from ten years ago. There is the grieving father and the young man that everyone thinks committed the crime ten years ago, yet he was never charged. We can’t forget the beloved dog in the mix, too. There are a few unresolved points at the end of the book, which makes me wonder about an interesting sequel in the future. Or, perhaps, like in real-life, some things are never resolved.I highly recommend this one, I predict that it will be a favorite read of mine for 2019. This is a fantastic read! The writing is top-notch, the story is chilling, and I even had a dream about it!!A few passages I liked:He walked around to the driver’s side of the truck, the night so still and cold there was only the sound of his boots on the packed snow, the sound of his own breath, but then, under these sounds and far off, he heard a tinny jangling, a faint rattling that was the sound of a dog running somewhere and he turned back toward the yard, toward the fields beyond. But there was no dog, no dark shape moving fast over the white. There was only the snow and the farm light and the dark, unmoving shadows on the snow. He pointed to the trees as they walked and seemed to give them their names: Jack pine. Black spruce. Balsam fir. Hemlock. White pine. He told her his old grandad was a logger from the old days and knew everything there was to know about trees. Signed up when he was fourteen and worked every job there was, you name it: Chokerman, chaser, high climber, Faller. Bucker. “Funny thing is, I do believe a tree was the most beautiful thing in the world to that old man. When he looked at one, he saw a hundred things all at once. Logging put clothes on his kids backs, food on their plates. That’s all there was to it.” Early thoughts:*update: Tim Johnston was funny and engaging in person, comparing the craft of writing to carpentry. Lucky for us, carpentry gives him time to think of the next book!I finished this one just in time for my event today. I will write my review after gathering my thoughts and hearing what Tim Johnston has to say."}, {"Review": "From the very first page, I could tell this was going to be an atmospheric read. There's country/small town and big city books. A lot of what we read in the mystery/thriller genre is based in larger cities such as London and New York. Then we get ones like this that are catered to that small town feel. A more intimate setting where people know each other and their families for decades and the sting is sharper and the reveal or overall coming is told in a more subtle, concise way that still leaves a mark. That is what this story did for me. This book transverses from past to present and could be a little confusing at the beginning. I'm a big believer in using quotation marks for dialogue and the author doesn't for the past conversations but does for the present. It didn't quite bother me in this book as it has in others because at least there was a pattern to it - I think some of you know what I mean. The way this was written was absolutely beautiful. I enjoyed this style a lot - at times it felt (to me) like that narrator from the movie 300 telling me the story.. but then my mind is a strange place. 🤣I felt great compassion for the characters - Johnston really brings out their raw emotions and makes you feel each and every one of them. From the girls and their skin crawling encounters, to the men and women who have lost their children. I'm a tad confused at the ending and would have like a little closure on one particular part... however, this is an extraordinary book. Absolutely solid in the somber feel from page one to the very last. This book gave me a little bit of Reconstruction Amelia and Good as Gone feels but I couldn't tell you exactly why. Sometimes a book just reminds you of another one and they could have absolutely nothing in common but evoke a feeling. Atmospheric, Emotional and Raw.Thank you to Algonquin Books for this copy."}, {"Review": "Tim Johnston has written an excellent novel, the kind of book that's timely without being repetitive, and horrifying without being repellent. The Current is the kind of book that sucks you in and holds you in place until it's finished with you - I read it in one sitting - and it's not until you realise you haven't moved in hours that you notice the grip it's taken on you. It's the kind of fiction that feels like a snapshot of reality; characters and places so real and so perfectly written that you'll remember them as people, rather than part of a book you read once. At the heart of the book are two incidents, separated from each other by a decade. But the unresolved past never did like to lie quietly, and when two college girls have an accident that sends their car into a frozen river, it's not only the ice that breaks but the silence that held a community in stasis for so long. Though I usually find myself suspicious of books with so many glowing reviews, this one really lives up to the hype. This one will be with me for some time."}, {"Review": "A cadaverously cryogenic, criminal suspense novel, deftly structured, though it can be difficult to catch the flow for the first 100 pages as it switches between 6/7 characters since the shifts happen mainly from ruminations of a character to those of another with sparser dialogue in the book's first half. I suspect most readers hit high gear by a third of the way through. Once I got there, I found it hard to put the novel aside for the comfort of sleep.Grade A Prime 4.5 star feed for my thrice-yearly need for the speedy crime read."}, {"Review": "If you read DESCENT, you know that Tim Johnston writes anti-thrillers, crime novels that are purposely slow. A mystery may be solved but sometimes it seems that that is secondary to a larger goal. If you use the term \"literary fiction,\" this is certainly a \"literary\" mystery, with prose worth paying attention to.THE CURRENT starts fast and then becomes very slow, especially because it considers the way a new crime brings an old one to the surface, which means you have twice as much backstory to consider and a lot of moving through time. It took me a long time to feel like I had a solid handle on both stories and could tell when we were in the present and when we were in the past. But if you're willing to invest the time and be patient with it, it's a rewarding story that ends up having way more twists and turns than you'd expect.I like Tim Johnston and I like his books, but I do think this one could stand to be 100 pages shorter. Ultimately there's more thrills and plot here than in DESCENT but there's also more work to do to get to those rewards. "}, {"Review": "Another page turner from Tim Johnston. A drive home from college for a local girl ends in tragedy for a small town in Minnesota that has already experienced its share. What follows is a series of events that tie together many of the individuals involved in a cold case over a decade old and a chance to either solve the case or come to terms with what happened next to an icy river one night in winter.After the action started, I found it hard to put this book down, even when the pace slowed a bit through the middle of the book. I appreciate a plot that takes its time to both cover the points of the mystery but also to tell a story and build on character histories. My thanks to Algonquin Books for an advance reading copy. An enthusiastic 4.5 stars."}, {"Review": "Thanks to the publisher, via Netgalley, for an advance e-galley for review.Marketing this book as a thriller is going to do this book a disservice. It's a solid literary fiction book, but thriller it is not, and readers going into this story expecting the suspense of a thriller are going to be disappointed (I'm not generally prepared for literary fiction style structure when I am reading a thriller). About 2/3 of the way through this book I finally became pretty invested in the story and found that the pacing was more like a traditional mystery vs. literary fiction, and the last third of the book was a fairly quick read. However, readers who have a better relationship with DNF'ing books might not make it that far, so I'd be cautious in who I recommended this to and how I talked about the book.Excellent setting and sense of place and intriguing, interwoven and complicated characters were this story's backbone. "}, {"Review": "This does not come out until Jan 2019, but please put it on your to-read list. As in his previous book The Descent, Johnston excels at slow-paced yet steadily increasing tension. Twice was sure I had solved the crime, but plot twists kept the story moving in new directions. An unresolved death of a young woman ten years ago is somehow part of a death of a young woman today. Both situations become urgent problems to solve. This explores the grief of parents of young adults, strained relationships, and the life of secrets. Characters are believable and the Midwest setting is perfectly depicted for those of us who live here."}, {"Review": "I loved this book. A slowish start but then I couldn’t turn the pages fast enough. Caroline is driving her friend Audrey home to Minnesota to see her father who is dying of cancer. They have a run in with creeps when stopping for,gas and then end up on the icy river and then into the river. Audrey lives but Caroline doesn’t.Ten years ago in a parallel story Holly Burke is hit by a car and thrown in the same river where she drowns. Both stories are investigated by various engaging and likable characters. I loved Audrey and Holly’s dad Gordon. More character driven then mystery we get to meet the residents of small town USA tied in some way to the two river incidents.Well written, filled with grief and so suspenseful. I will read Descent next."}, {"Review": "I don't know if there is a category for books called \"lyrical thriller\" but if there is, that's what I would call Tim Johnston. The current is a multi-level story which is set in motion when a car carrying two college-age friends enters an icy river on a dark night. One girl lives and the other dies. In a strange twist of fate, Audrey, the girl who lives, was on the way to visit her father who is dying of lung cancer, and who also used to be the sheriff when, several years ago and in another state upriver, another young girl went into the river and drowned. Her attacker was never caught.The current is about the ways life flows and changes in a small town. It's about the interconnectedness of people and places and stories. It's about the dark secrets we keep and how those secrets can pull us under and drown us without any warning.Tim Johnston doesn't rely on gimmicky twists or unbelievable plot devices to manipulate emotion, He creates an exquisite tension which slowly ratchets higher until it's so deep you could drown."}, {"Review": "This was a new author for me. I needed a change of pace since I read so much romance. I was looking for a thriller, a little mystery to shake things up. I found the premise enticing, two girls driving home from college end up in an icy river, only one survives. The surviving girl returns home, searching for answers to another murder of girl in the river ten years prior.This story had the makings of a great thriller. However, I found myself confused, even unsure of what was happening. There are so many characters, so many different perspectives running underneath what I thought was going to be the unraveling of who killed Caroline. Instead the story focuses on the murder of Holly Burke. I couldn't connect with any one character, as much as I wanted to. In fact, so many of the characters were really interesting that I wish more time had been spent developing their stories. I needed a more cohesive storyline for these two very distinctive stories. Yes there are parallels between Audrey and Caroline and Holly. However Audrey and Caroline's story is completely separate from Holly's. The Current is really Holly's story alone in my opinion.With every page I turned, I found myself waiting. Waiting for the story come full circle, to connect all the dots, to answer all the questions I had. Instead I was left...incomplete. There's a lot of story in The Current, almost too much narrative. I almost felt bad for Audrey as the book progressed, it became less and less about the crime committed against her and Caroline and more about Holly Burke's murder. Where is Audrey's closure? Where is Caroline's justice? While I enjoyed some of the back story, it was still confusing putting it all together. I'm sitting here not entirely satisfied. I'm all for imagining what happened after the last page, but this is different. It's like I got part of an ending for part of the story.In the end, the reader is left to make their own conclusions about what happened to Danny (who I didn't even mention), and about Audrey and Caroline's accident. * I voluntarily reviewed an Advance Reader’s Copy of this book *"}, {"Review": "Thank you to Algonquin Books via Netgalley for my advanced digital copy of this book!It took me a while to pick up this book because I was unsure how I would feel about it. I ended up loving it so much more than I thought I would! The Current begins as two college girls, Caroline and Audrey, make their way to Audrey's father's house in Minnesota. They crash before they get there and the car is pulled from a river. Audrey is the only survivor. The accident brings up flashbacks of a similar ten years before, where another young woman lost her life. It begins to seem that a killer may live among them, and Audrey learns she is connected to this other young girl.The Current does not move like your classic thriller or murder mystery. It is much more character driven and eerily atmospheric. Don't come into this book expecting something fast-paced. I love Johnston's fluid writing style, and I thought he developed his characters so well. Even the ones that only had a brief section in the book were still complete people. It made it so easy to get wrapped up in the story and immersed in the words.There was a bit of switching between past and present that I found to be slightly confusing at times because I only knew it was the past through context. However, other than that I found this to be a beautiful work of fiction. I also listened to the audiobook and the narrator is fantastic. I was convinced there were really five narrators instead of just one. If you like audiobooks you should definitely check it out! "}, {"Review": "I don't know if there is a category for books called \"lyrical thriller\" but if there is, that's what I would call Tim Johnston. The current is a multi-level story which is set in motion when a car carrying two college-age friends enters an icy river on a dark night. One girl lives and the other dies. In a strange twist of fate, Audrey, the girl who lives, was on the way to visit her father who is dying of lung cancer, and who also used to be the sheriff when, several years ago and in another state upriver, another young girl went into the river and drowned. Her attacker was never caught.The current is about the ways life flows and changes in a small town. It's about the interconnectedness of people and places and stories. It's about the dark secrets we keep and how those secrets can pull us under and drown us without any warning.Tim Johnston doesn't rely on gimmicky twists or unbelievable plot devices to manipulate emotion, He creates an exquisite tension which slowly ratchets higher until it's so deep you could drown."}, {"Review": "Thanks to Netgalley for a digital ARC of this book.This was one intense read. I went into this not knowing much about it other than I had read Johnston's first book and thought it was pretty good. In this one, the hits keep on coming. There was a particular moment in the beginning--when I really didn't know what the book was about or what to expect--when I gasped, realizing what was happening to the two young, female characters. Overall, this isn't one person's story; rather, it tells the story of a number of people from the same community, each of them dealing with hardship and loss, many of these areas connecting in known and unknown ways. I found it to be very readable and became emotionally invested in the characters. If I had a gripe about the book (other than the lack of formatting in my ARC--I assume the final version will help a great deal with the POV switches when it's properly formatted and edited), it's that the end didn't provide that final click I needed. The author gives you all the information you need to construct a strong theory about what happened--and I'm pretty sure I can come up with an answer for most of my questions--but you don't know for sure. And as I closed the last page, I was concerned about my theory because early in the book, Johnston shows us that you can't always believe the story you construct for yourself. Without giving anything away, he presents a version of events that even one boy's mother believes about him (and it's not good for him). But you start to realize, bit by bit, that there could be another narrative if you'd only consider it. When I got to the end and thought I knew what happened, I couldn't help but wonder if I really did or if Johnston was presenting me with another conundrum. So I'd like something a bit more concrete upon which to base my final interpretation. One other thing I liked was the use of occasional supernatural in the book. There are several moments scattered throughout that suggest, like the overall plot, that currents run deep and you don't always know what's under the surface. You can choose, again like the plot, to interpret the supernatural elements however you like: does the twin brother have some kind of second sense about his bother? Or is he only engaging in fanciful thinking, fueled by his mental disability? Does the girl from the river really know the thoughts of other girls who have gone into the river with or before her? Or is she recalling dreams and nightmares from her horrific experience combined with the medicated rest afterwards in the hospital? It was a nice, subtle touch and well-done. Overall, I recommend this novel. This is not, however, for the faint of heart. "}, {"Review": "Via my book blog at https://cavebookreviews.blogspot.com/Two college friends set off to visit Audrey's dad who is ill with Stage 4 lung cancer. Caroline offers to drive, so Audrey doesn't have to come up with the bus fare. They go to school in Minnesota. Caroline is from down south and not used to driving in heavy snow. Something tragic happens, and the narrative takes us through the stories of all the lives affected by what happened that snowy night.Audrey's father is a retired sheriff, who lost his wife when Audrey was very young. Father and daughter are close and care for each other more than anything else. Audrey begged her dad to let her take a semester off, but he insisted that she keep moving forward in her young life. Now, she had to see him. He was getting weaker by the day.Audrey's decision to go home, through no fault of her own, creates collateral damage that ripples through families and won't quickly be forgotten or repaired. TJ's novel moves at a good pace, and the clues of this mystery sent me in many different directions. There is a lot of empathy needed for the characters of this story. Living in a rural area isn't easy, and when people have a fixed opinion of you and your children, life can be a continuing nightmare.I enjoyed the story, the characterizations, and the bravery of the women demonstrated through TJ's writing skill. I recommend this book if you can take in the predatory character of a man who people have always trusted.I received an advanced copy of this novel from the publisher through NetGalley."}], "Genre": "Thriller", "ID": "36387759", "Desc": ""}