{"Name": "The Reckoning", "Image": "https://images.gr-assets.com/books/1527031057l/38389488.jpg", "Reviews": [{"Review": "4+. It has been a while since I have read a Grisham. Not sure why, but I can say I'm glad this is one I read. It combined my many book loves, a legal story, a mystery, which is really at the heart of this book, and a look back to a terrible time in history. It is the 1940' in the Jim Crow south, a farmer whose large farm has been passed down through generations, Pete Banning does what he needs to do for the immediate future. He then walks over to the Methodist Church and shoots the Pastor three times. Why? He has no intention of saying, no explanation, no excuses. His wife had been committed to a mental institution the year before, his two grown children away at their respective schools.So that is the mystery, and of course the court case. We then follow him back to the war, and the Bataan death March in the Philippines. Hard to read, but well researched, well written, the merciless Japanese and Bannings time in the military. Too many he became a hero. There is one part near the beginning that was very emotional, he was loved by many. This was a book I couldn't put down, it just pulled me into the story of this family, and of course I needed to know the why. So,even though I don't always fsvor narratives that go back and forth, here I can't see this story working any other way. It truly has a little of everything, plus a family that one can't help but embrace, and a man who makes a decision feeling he has no other choice. In this book I feel as though Grisham has out done himself. ARC from Doubleday."}, {"Review": "4.5 to 5 starsThis was the most epic and intricate novel Grisham has released in quite some time. It's a mixture of legal drama and historical fiction that keeps you guessing until the very last page. Most of his recent books have been fairly quick reads with a basic storyline. The Reckoning is anything but basic or quick.If you are into Grisham mainly for his legal dramas, I think the historical fiction may distract you too much. If you are really into historical fiction, you may not be patient enough to get through the legal stuff to get to the World War II story. But, if you are a fan of both, you will get the best of both worlds; the first third is legal, the second third historical, and the last 3rd brings it all together.Note on the content: the story takes place during and post WWII with narrative taking place in both the American South and the Pacific Theater. Grisham wrote it to keep true to the attitudes and the dialogue of the time period. This means that some words and opinions are controversial and could be upsetting. If you are okay with prose content being raw for the sake of realism, you should be fine. But, if you think this might make you uncomfortable, approach with caution.This was an enthralling reading experience and one of the best I have had with Grisham. It's great, unique storytelling that I believe lots of book fans will enjoy."}, {"Review": "I hated this book. It was racist, sexist, and most damningly - boring. The way Grisham talked about the black characters was condescending and the way he talked about Mary Ann was both racist and sexist. The reasons behind the crime were obvious and boring. If Grisham wanted to write a book about the horrors of the Pacific theater during World War II he should've just written that book, but those chapters merely served to point out the lack in substance in the rest of the book. I don't have sympathy for a family losing their land because their patriarch committed murder and I don't have sympathy for someone who planned a murder and refuses to divulge a motive to help their family understand.I've loved some of Grisham's past work and this was so bad that it makes me suspect that I was wrong to have enjoyed his writing ever!I read an e-ARC through NetGalley."}, {"Review": "John Grisham continues his long-running string of novels with another piece that offers some unique legal discussions. Pete Banning is a well-respected white farmer, a war hero, and an all-around amiable man around Clanton, Mississippi in 1946. This is why it is so troubling when Banning walks into the office of black Methodist minister Dexter Bell and shoots him dead. Banning refuses to elude the authorities and will not speak about the crime. Going through the motions of a trial, but choosing not to offer a formidable defence, Banning is found guilty and sentenced to death. After a few delays, Pete Banning’s day with the electric chair is set. Banning is executed while his adult children and some other family are left with more questions than answers. After a thorough flashback depicting Pete Banning’s life and time in the Pacific arena during World War II, it is back to the late 1940s, where Joel Banning is trying to hold down the fort as the new man of the household. His mother, Liza, has been in an institution since before Pete’s death, another mystery that no one can answer. With wrongful death suits circling around the estate, Joel juggles his legal studies with trying to dig a little deeper to understand why Pete Banning might have felt the need to kill Dexter Bell. There are some loose ends that do not make much sense, but the Bell family remains focussed on punitive damages. With everything up in the air, Joel Banning watches all he has known circle the drain in a family mystery that no one seems able to decipher. Another great Grisham piece that develops slowly and will take a dedicated reader to finish. Recommended for fans of Grisham’s ‘southern legal matters’, though it is apparent that the novel has significant filler sections to pad its length.I have long been a fan of John Grisham’s work, which approaches the law and courtroom matters from unique perspectives, investing the responsibility in the reader to piece the larger narrative together. That being said, some of his latter work seems to stuff a great deal of information that dilutes the legal arguments with too much backstory. Pete Banning plays a key role throughout the novel, with his development arising through significant backstory recounting in the middle portion of the book. Leaving his family to wonder what happened to fuel his need to commit capital murder, Banning’s life story comes to life when he is a POW in the Philippines, where Grisham offers a detailed narrative that keeps the reader enthralled. The latter portion of the novel shifts much of the focus on Joel Banning, legal mind and amateur sleuth. Trying to piece the great family mystery together, Joel seeks to turn over many stones to see what might slither out. The numerous other characters offer some interesting 1940s South flavour to the story, particularly the legal matters that address how a white man can be charged and fond guilty of killing a black man in Mississippi. Grisham is keen on stand-alone novels, though there are usually some interesting stereotypes that emerge throughout. The story in this piece is strong, depicting both the legal issues around race and murder, as well as estates and wrongful death suits. Most interesting of all is trying to determine what might have led Pete Banning to commit the ultimate crime and toss his family into significant distress, which comes together in the final chapter. I will admit that the middle section of the book, that exploring the time Banning spent in the war, presumed death and being tortured, seemed to be a great deal of drawn out character depiction and backstory. Some have bemoaned its presence in the novel, though I simply wonder if it could have been curtailed to a refined few chapters. While I choose not to spoil this for anyone, that backstory portion does not play into the foundational arguments for the murder he committed. I found the writing to be quite captivating as I pushed through the story in short order. Another Grisham success for those with patience!Kudos, Mr. Grisham, for entertaining the reader from the outset. This is a story that will keep the reader thinking throughout as they become enthralled with the detailed writing. I cannot wait for the next piece you have planned.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"Review": "Far From One of Grisham's Best: I typically enjoy anything by Grisham and rate them in the 4 star range most always. The Reckoning fell well short of what I would expect from Grisham. Most disappointing was that at about 30% of the book reads like an historical fiction account of World War II battles and not something I expected from a read of the book jacket - or a typical Grisham novel. While there is legal challenge and courtroom storyline- this part of the story had little drama, no surprises and an ending to the legal challenge that was obvious from the beginning. Was hoping for a plot twist somewhere to redeem the book, but it never came. This seems like a story that Grisham just put out to meet a publisher's deadline as readers like myself expect more. A few nagging elements also including the fact that the son and daughter in the story refer throughout to their father and mother by first name- Pete and Liza- which seemed odd and out of place with the time and setting for this story. Even if you are diehard Grisham fan, believe you can pass on this one without feeling you have missed anything."}, {"Review": "The latest novel by John Grisham, The Reckoning (release date October 23), is a sprawling and enthralling read set in the Ford County of A Time to Kill, Sycamore Row, etc. By setting this story of murder and Gothic-esque family drama in the county most familiar to longtime Grisham readers, The Reckoning mixes the pleasures of familiarity with the new, experimental territory upon which the writer embarks. If anything, this novel is certainly not Grisham on auto-pilot.This will likely be the most divisive Grisham release in some time, if ever. The author playfully mixes up and challenges the courtroom drama standard he set, choosing to tell the story in an almost non-linear fashion. At the heart of this novel is the question: What makes a beloved war hero and successful small-town sharecropper murder his pastor in cold blood? The consequences set in motion by the murder — which happens in the first chapter, and is mentioned in the synopsis — are gritty and cold and real. Grisham’s focus is not so much the legal system (though it does play a part), but the dissolving of two American families. This reader respects Grisham for shaking things up and penning what could be the darkest, and most literary, novel of his career. I certainly did not see it coming. If 2017’s The Rooster Bar was a slick crowd pleaser, The Reckoning is a raw challenge . . . one of which William Faulkner, perhaps, would be a fan.Thanks to Doubleday Books for the free hardcover copy of this book, which was given in exchange for an honest review."}, {"Review": "I've read many Grisham novels and have enjoyed the first several. And I've have even read one recently....last week to be more accurate. In that review, I couldn't quite name the thing that kept me from liking it like I've liked his older stuff. But now after reading this one, I think I know what that \"thing\" is. Grisham can come up with a story...that isn't a problem. He can create suspicion and suspense. Great. But the problem I've had with this book and with the one I read last week, is the writing. There is so much telling. He explains everything. It feels like he sees the scene in his head, and writes exactly what he sees. Nothing more. Nothing less. That is why I'm having a problem with the characters. They feel like cardboard....like they are in a painting and I'm trying to guess, who they really are, what they are thinking and feeling, etc. Also, this book was predictable in the \"what really happened\" arena. My advice, read the first part to get the info on the crisis at hand....then skip right to the very end. I promise. It will be okay. "}, {"Review": "The 1940's was a very dark time in our world, so why do authors keep going back to it? I believe it's because in darkness there are stories that need to be told, and that it's not a morbid fixation or nostalgia but rather an attempt to share with readers the voices and tales left behind. John Grisham does this perfectly by giving us a vivid and realistic portrait of the Jim Crow south, and one man haunted by the ghosts of his past. We often like to mask the harsh realities of war, terrorism and genocide, hiding it beneath patriotism and gung-ho enthusiasm. In the age of the internet we no longer bother to hide such things, but in the 1940's Pete Banning's stories as a POW and the things he went through during the Bataan death March in the Philippines are slowly revealed during a lengthy and harrowing trial. It wouldn't be a John Grisham novel without a court case and a lawyer, but in The Reckoning, he makes it clear that this is Pete's story. Readers learn of a man's life and the toll it takes on a person when their secrets are hidden away, whether it's the trauma of war or the shame and stigma of a mentally ill spouse back in the days when mental illness was a thing still stuffed away in gothic asylums so we didn't have to look at it in a gentile, polite society. Why though would Pete choose to shoot his pastor of all people? The mystery behind that is even more interesting.This tragic and deep story isn't your typical legal thriller, nor is it just another copycat of To Kill A Mockingbird. In many ways it reminded me of some episodes in my favourite TV series, the CBS drama Cold Case, in the way it explores war, mental health and frustration in earlier eras. Grisham sets the scene flawlessly and makes the story genuinely feel like a 1940's tale, but not in a way that's too sentimental or rose-coloured."}, {"Review": "417 pages. Four HUNDRED and seventeen pages. For a story that could have been told...in fact SHOULD have been told...in about 250, and that is being generous. I liken this novel to a trip I once took with my parents when I was a child. We drove from Pennsylvania to Florida to visit my grandparents. Along the way, my father thought he had some moral obligation to pay homage to every roadside attraction within 50 miles of our route. It was torture. So was this book. Every time Grisham seemed to return to the actual plot and gain momentum, another shiny object would grab his attention and send him racing in the opposite direction. It was maddening. Fans of historic fiction will appreciate the prolonged and painfully detailed descriptions of the main character’s military experiences in WWII. Folks who thought they were buying the story billed in the summary will not. Seriously. Page after page after page about an American soldier captured by the Japanese, who then escapes and joins guerrilla fighters. Pages that added NOTHING in the way of furthering the plot. I had other issues with this novel as well. The theme of segregation in the Deep South took such center stage that to miss the significance and not predict the outcome was virtually impossible. Additionally, the entire book alludes to a justifiable vengeance. In the end, it was, however, such an overreaction that every bit of sympathy, or sense of likability, I had built for the main character dissolved. Clearly Grisham can write. He is an accomplished author with a huge and loyal fan base. Why he veered so far off the beaten path on this one is the true mystery. Two stars just because the writing was sound, but what a profound disappointment."}, {"Review": "This novel was incredible! This is one of my favorite John Grisham’s novels since A Time to Kill. It was a powerful story with so much mystery right up to the end. I could not right for the secrets to be revealed, and they were not exactly what readers would predict. I seriously enjoyed this book to the point of losing sleep over it. I would have read in one day if my schedule would have permitted. It was that good! My quick and simple overall: mystery and an incredible story with intriguing characters. A really great standalone novel! "}, {"Review": "Thanks a million to @doubledaybooks for this free review copy!.I’m an old school Grisham fan. I absolutely adore all of his older titles, with my very favorite being The Testament. I will never forget listening to that book! His newest book is out on 10.23 and I’m so excited to share with you that The Reckoning not only brings us back to the Grisham of yesterday, but also adds in some absolutely fascinating WWII history about the Bataan Death March in the Philippines that I really had almost no knowledge of. This book sucked me in, kept me guessing, and had me reading about military history with a completely new level of interest..I wouldn’t classify this newest Grisham so much as a legal thriller as I would call it a grief-filled family mystery/drama with a LOT of legal plot. There were parts that weren’t perfect in my eyes and I wish some things had been done differently in the last quarter of the book, but overall this was a compelling 4 🌟 read for this Grisham fan (since high school!)..If you or a friend or family member are also old school Grisham fans, or love reading about WWII, get your hands on a copy of this book! "}, {"Review": "I hadn't read a John Grisham novel for quite awhile and very quickly after starting 'The Reckoning' I started thinking about other books of his that I also wanted to read. Unfortunately the book was a bit hit and miss for me, I enjoyed the first part of the novel where the killing and the court case happened but my interest waned when the second part of the book spoke of the main characters war time experiences and by the end I really didn't care a lot what the outcome proved to be. Overall disappointing and too drawn out."}, {"Review": "Without doubt, this is one of the saddest and most haunting books I've read in a while (close to downright depressing, in fact). What's more, about a third of it was so unsettling that insofar as possible, I skimmed through it. It is written matter-of-factly, without emotion - but the emotion comes through loud and clear nonetheless. Did I love it? In many ways, no; but in the overall scheme of things, it's pretty darned awesome.Let me clarify. The depressing part came near the end, when facts not previously in evidence were revealed (let's just say that O Henry's \"The Gift of the Magi\" came to mind). The unsettling part came in the middle, when details of the World War II military life of Pete Banning, one of the main characters, was outlined in all-too-vivid detail. If there's anything in this world I'd rather not read about, see, or listen to, it's the horrors of war. And the entire middle section of this book, Titled \"The Boneyard,\" lays it all out. Yes, it's a very important part of the story - but had I known it was coming I'd have left sneaker tracks on the sidewalk running the other way.That said, what a story it is. Set in small-town Clanton, Mississippi, after World War II has ended and Pete, thought to have been killed, returns home to his extensive cotton farm as a decorated hero. His wife, Liza, is in a mental institution - at Pete's orders - and their son and daughter are grown. In 1946, at the age of 43, Pete is about to do something virtually unthinkable, especially for a man of his stature; commit a cold-blooded murder. He freely admits to his guilt; what he refuses to admit, though, is his motive. He will, he insists, go to his death - a very real possibility if he's convicted by a jury - with his secret intact. His long-time family lawyer, nor his sister Flora, who lives on the farm, nor his children will ever hear the reason behind his action - at least never from his lips.From that point on, much of the narrative focuses on Pete's family background and what and how his children are doing, all of which takes place in a deep-South setting in which \"coloreds\" handle menial tasks and are not allowed to sit on the front porch of any home nor anywhere in a courtroom except the balcony. And of course, let's not forget the section that details what happened to him in the war when he was part of the historic Bataan Death March in the Philippines. Even though I didn't want to read it, I can't imagine the research it took to pull all that together. In the final section, \"The Betrayal,\" readers, along with Pete's two children - find out what really happened. "}, {"Review": "This started out so promising. The first 1/4 of the book (give or take) was fantastic. And then we got to the courtroom scenes and aftermath which dragged on but it is a Grisham book so fair enough. The second part of the book is 100 pages or so of WWII combat, specifically in the Philippines and the Bataan Death March. Compelling enough I suppose but completely out of place in the rest of the book. Yeah, I get he was trying to demonstrate Pete's PTSD but it just didn't work for me and wasn't at all what I had signed on for. By the time he got back to the primary story, I had lost patience. This one felt like Grisham wanted to write two different books and probably should have. The current day (not *our* current day) part of the story was far more compelling than the rest and, honestly, would have worked just fine without the WWII detour. "}, {"Review": "Author John Grisham never fails to tell a story well, but in this instance, I question whether the story needed to be told at all. In a departure from his typical legal thriller, Grisham tells the story of Pete Banning, favorite son of Clanton Mississippi and a surviving WWII POW veteran. After being declared dead, yet somehow miraculously surviving the horrors of the Bataan death march and POW Camp O'Donnell, Pete Banning returns home for a joyous reunion with his family. But shortly thereafter, something goes horribly wrong: his wife ends up in a mental institution and Pete is charged and convicted with the cold-blooded murder of his pastor, Reverend Dexter Bell. In the drawn-out legal battle that ensues, Pete's only statement to the sheriff, to his lawyers, to the judge, to the jury, and to his family—was: \"I have nothing to say.\" There is no happy ending here folks, my only satisfaction was to finish the book. I would not call it Southern Gothic, merely gruesome. #TheReckoning #NetGalley"}, {"Review": "It has become one of my annual late Fall rituals. The leaves are falling. College and Pro football are in high gear, which means it is time to open the new John Grisham novel, “The Reckoning”, and re-visit the law in action in the South.This time out, Grisham shares a family saga combining the elements of a World War II time period, a secret mystery, and plenty of court room drama. It is 1946. Pete Banning is a successful farmer and patriarch of a prominent family in Clanton, Mississippi. He is a decorated World War II hero that should have been killed many times over rather than safely return home. He is also a faithful member of the Methodist church. Then everything changes for him and his family when one October morning he drives into town, walks into his Church, and calmly shoots his spiritual leader, Reverend Dexter Bell, to death. If the murder was not shocking enough, Pete turns himself in and takes accountability for his actions. However, Pete’s only statement to the arresting sheriff, his lawyers, his family members, judge and the jury was that he had nothing to say. His actions were between himself and the Reverend, and no one else. Pete refuses to provide any reason or information whatsoever, regardless of he is facing either life in prison or the death penalty. Grisham tells Pete’s story and the impact of his actions on his family in three distinctive parts, some of which work better than others in providing a cohesive story. He moves through the bias and prejudicial legal process of the Jim Crow South to the horrors of modern warfare in the jungles of the Philippine islands during World War II to the outcome and impact of a family falling apart in the overwhelming layers of legal liability. Grisham’s strengths as master storyteller shine throughout this gothic and emotional story, demanding your attention most of the time, but at sometimes the story either slows down a bit or becomes predictable, forcing for you to wait for plotline related dots to be connected. Over the last several years, it seemed to me that Grisham was shifting his writing to leave more of a legacy. His writings have been moving away from his earlier legal thrillers in which individual protagonists were on the run from large corporate greed or evil mobsters and were saved in the end in dramatic and climactic fashion. He is focusing more on 20th century period stories set in his home state of Mississippi, with many of them occurring in his fictionally created Ford County. His themes have been more aimed on exposing serious societal issues like the death penalty, race inequality, and how the law can be abused by those in positions of power.You don’t have to look far to see that Grisham’s model and example is none other than his southern predecessor, William Faulkner (1897 – 1962), a famous American writer and Nobel Prize laureate from Oxford, Mississippi. Faulkner wrote many novels, short stories, screenplays, poetry, and essays during his lifetime. He is primarily known for his novels and short stories, especially those set in his fictional Yoknapatawpha County, which was based on Lafayette County, Mississippi, where he lived during most of his life. Faulkner even makes a guest appearance in this book, interacting with one of the main characters in an interesting restaurant scene. Grisham has used the same blueprint for his novels and short stories, using Ford County to reveal and examine social issues and inequalities that he feels need to be brought to the public square for debate and improvement. He’s come a long way from his legal thriller, “The Firm”, to this current novel, “The Reckoning” which concentrates on the horrors of war, it’s impact on the human psyche, and more importantly, how family secrets, lies, and the inability to forgive those we love the most, can tear apart a family for generations following. Overall, I wanted to like this book more than I actually did. It is that Faulkner gothic and Southern working-class story telling style that makes this both a good read and a tough read. It is a good read because Grisham is a master storyteller. He can make anything interesting, demand your attention, and keep you fully engrossed until the end, even if you think you know what the outcome will be. It is also a tough read because it is not a book, after finishing it and knowing the answer to the secret driving the central plotline, that I will come back to read again. It was full of negative and emotional experiences for many of the characters and their outcomes, which weighs heavily on the reader. I realize Grisham intended a certain emotional outcome, and he delivered it. It’s an outcome that causes me to think and explore ideas on how I can help contribute to making society better. However, it’s also an outcome that leaves me lacking interest in ever wanting to re-read it again. At least not in any foreseeable future… "}, {"Review": "This is a sweeping saga recalling the finest Southern Gothic tradition. \"The Reckoning\" is a captivating story penned in gorgeous prose with full-bodied characters and a vivid sense of place.A tale to take pleasure from and in which to lose yourself.Part One - The Killing:  On October 9, 1946 in Clanton, Ford County, Mississippi Pete Banning, a decorated war hero and prominent citizen, awakens early and calmly goes about his morning routine. He then drives into town, walks into the Methodist and shoots and kills Reverend Dexter Bell.All he says to anyone, including his lawyer, is, \"I have nothing to say.\"With Pete's motivation unknown and no defense, the case goes to jury trial, as per Pete's wishes.The county prosecutor loves it.We are shown how Pete's family, his children Joel and Stella along with his sister, Florry, struggle in the aftermath of the trial.Now with their Mom, Liza, already committed to a mental hospital for reasons they do not know, Joel and Stella are left to wonder at what's happened to their family.Part Two - The Boneyard:This section is a war story recounting Pete's harrowing experiences in the Philippine jungles. The Battle of Bataan. The death march. The death camp. Guerrilla warfare.We get a feel for how these experiences will shape and affect him upon his return home.It's full of danger, horror and action. Gripping.Part 3 - The Betrayal:We continue to follow the Banning family's turmoil in the wake of Pete's trial.There are mounting legal troubles and some fine courtroom drama. (C'mon, it's Grisham!).There's Joel and Stella's quest to find out why their Mom is at Whitfield Asylum.When they discover this, it will lead them to their father's motivations for doing what he did.Killing Dexter Bell.Pete Banning's reasons for his actions and the real story might not be the same thing.A narrative of tragedy and scandal beautifully told.This is fiction at its best. A suspenseful tale of family to become engrossed in and to savor. Enjoy!This was an ARC Giveaway in exchange for an honest review."}, {"Review": "John Grisham’s latest, the Reckoning, takes place in rural 1940s Mississippi. World War II veteran Pete Banning wakes up one day, goes about his business as usual and then proceeds to murder in cold blood the beloved preacher of the Methodist church. Pete refuses to tell anyone the reasons behind the killing and he and his family both suffer the consequences. The story also takes us back to Pete’s days as a war hero in the Philippines and also to the insane asylum inhabited by his wife.I’ve read most of Grisham’s books and I have to say that this was one of my favorites. It is suspenseful right up to the very last page. There are elements of the legal world, typical to Grisham’s works, but there is also some fascinating, if brutal and bloody, history of the Philippines in World War II, something I knew little about. After reading so many Works War II books centered around Nazi Germany, I found this to be a refreshing take. Overall, a thoroughly entertaining and enjoyable read recommended to all. 5 stars!Many thanks to Netgalley, Doubleday books and John Grisham for my complimentary e-copy ARC in exchange for an honest review. All opinions are my own."}, {"Review": "I'm a big Grisham fan and have read all of his adult books. The Reckoning would have been so much better as a short story. Grisham should have written another volume of Ford County and put a short story version of this book in the collection.The book was too long, the recounting of Pete Banning's time in WWII had no bearing on the rest of the novel, the back and forth about the land and the estate was too much. The whole time I was reading this I just wanted to know why he did it. The ending was fine but I think it would have had more shock value if the rest book had been more succinct. If you really want to get to the point, I suggest you read all of Part 1 and the last chapter. "}, {"Review": "3.5 stars. A Southern Gothic tragedy about the decline and disgrace of a prominent and respected family who own a valuable plantation in rural Mississippi.The time is the 1940s and the racial divide affects the social standing and legal justice for the Blacks. There are harsher penalties for blacks than for white citizens charged with crimes. The vast number of executions in the district have been carried out on blacks and the death penalty of a wealthy white man has been unknown. Judges and all white juries are the rule, and the wealth to afford the best defense lawyers is a deciding factor. We get a chilling description of botched hangings and electrocutions.  Pete Banning was a highly respected family man, a successful farmer, and war hero. One day he enters the Methodist church which his family attended, and shoots their beloved and popular minister. The mystery and suspense lie in his motive for such a bizarre crime. He refuses to explain his reason to anyone: not his family, not to the judge, jury, his lawyer or the governor. The first section of the book deals with legal maneuvering and the trial.  The second part of the book focuses on Pete’s horrific experiences in the Pacific during WW2. I found this to be the strongest part of the book. Grisham writes vividly showing superb ability to describe the indescribable tortures, illnesses, and death. We follow Pete during the Bataan Death March, the deprivation and suffering in a Japanese POW camp, in one of the overcrowded, filthy ships carrying prisoners to Japan for slave labor and finally as a guerrilla fighter in the Philippine jungle. Pete was classified missing and believed dead for 3 years. He returns home to an overjoyed wife, sister,and two children after being hospitalized for war wounds and the after effects of dysentery and malaria. The happiness doesn’t last long. He commits his wife to a mental institution and the grown children are forbidden to visit. Then he murders the minister.  The third section of the book shows Pete’s children, now attending college, tied up in a wrongful death suit filed on behalf of the minister’s widow. As the family fortune declines, there are several more tragedies. Surely things will be turned around to provide a happier ending. Suspense which sustained the story is finally resolved when the motive for the murder is finally revealed.  I felt the book was longer than necessary. All the legal appeals were informative but caused the plot to move at a snail’s pace. The WW2 flashbacks were the most powerful part of the story for me and which could have been a separate novel. The structure bothered me at first, starting out at the family in their present time (1940s), then flashbacks to WW2 events, and finally a continuation of the character's story. Overall I concluded this format worked well. Definitely not a happy, relaxing read. but it was compelling."}, {"Review": "Somewhat of a departure for Grisham, though his recent books The Rogue Lawyer and The Rooster Bar haven't perfectly fit the mold of \"legal thriller\" (which he pretty much created) either. This one is about a World War II hero named Pete Banning who kills the preacher Dexter Bell for reasons unkown. Suspense in the novel is two-fold. Question one, will Pete be executed for his crime, and two, will we ever learn his motive? I found the first part of the novel, which deals with question one, to be very suspenseful, and I stayed up reading the first half of the book the first night I cracked it open. The answer to the question of motive, which is the driving force to the second half of the book, I found less satisfying. It seemed like Grisham wanted us to believe in Pete Banning as a war hero, but even during his heroic story arc, he's not a great person. He's apart from his family for three years and makes only minimal effort to contact them. Though the end of the book isn't happy for anyone, Pete's punishment and the ripple effect his crime has on the next generation seems ultimately just. Seperately, it was refreshing to read a World War II book that largely ignored the Nazis and Hitler, but the words \"Japs\" and \"Nips\" were used too much. I didn't know what would be lost by just calling the enemy \"Japanese\" and not having the characters refer to them in dialogue. Race and Racism is a theme here, and race plays a role in the tragedy at the center of the book, but to say the tragedy is caused by anything other than Pete's selfishness and self-righteousness is a stretch. "}, {"Review": "The book takes place in Ford County, Mississippi, the site of many of Grisham’s early books. The reader must remember the story takes place in 1946 and the relationship between black and whites in Mississippi was different than today. The book is divided into three section. The first is about the current time (1946) with the story of Pete Banning. The middle is about Pete’s time during WWII and the last part is back to the current time (1946) with the problems of Pete’s children.Grisham grabbed me with the calm killing by Pete Banning of the Methodist Pastor, Dexter Bell. Our protagonist is Pete Banning. Grisham also spends some time telling about Banning’s time during WWII. The story is a bit different from the usual Grisham story, but it is interesting. Grisham always makes a great read; he is a master storyteller. Unfortunately, the story left me feeling sad.I read this as an audiobook downloaded from Audible. The book is seventeen hours and thirty-six minutes. Michael Beck does a good job narrating the book. Beck is an actor and audiobook narrator."}], "Genre": "Thriller", "ID": "38389488", "Desc": ""}