{"Name": "Come Find Me", "Image": "https://images.gr-assets.com/books/1534875871l/35065766.jpg", "Reviews": [{"Review": " 4 Stars!!🌟🌟🌟🌟This was crazy different and a lot of fun to read. In Come Find Me, we follow MC's Kennedy and Nolan. Two teenagers-both whom which have experienced great tragedy, find themselves drawn together by a strange signal. Together, they try to find the source of the mysterious signal. The more they try to find it, the more clues they find things that seem to connect their pasts. The signal seems to be for them alone, something only they both can understand. Who is out there? Is something coming for them? Or is the frequency warning them about something that's already here? I was totally not expecting something with a Stranger things vibe to it, but it has that vibe- in a small way which added so much more to the story. I really liked Kennedy, she was brave and strong willed. She has dealt with a lot of pain in her life but that wont stop her from getting answers. Nolan is dealing with the same thing. Both characters, as they work together- experience a good bit of growth. Each one was there for one another and only made the other stronger. I had no idea where this book was headed and I spent half the book scratching my head. I like when a mystery/thriller ends up stumping me. I was pleasantly surprised with the outcome and totally recommend it!"}, {"Review": "3.5 StarsThis is a story of two teenagers who have endured tragic loss. Nolan's brother is missing but he feels as if his brother is reaching out to him from beyond and he's determined to follow any and all leads. Kennedy's living with her uncle and finds a signal on her brother's equipment that doesn't make sense. Where is this pattern come from. Circumstances bring Nola and Kennedy together in their search as it appears things are too coincidental to not have a meaning and they are determined to find it.The book starts off a bit slow but pick up towards the middle of the book. This is a story about grief, the aftermath of tragedies, how families cope and unstoppable need to two people who need closure but to do so, they need to look to each other, within themselves and at those surrounding them.A proper sci-fi-ish, paranormal-ish, suspense that's a thrill for a younger audience. While the themes can get a bit morbid, I did enjoy the two different sides in how families are dealing with their own personal tragedies. Maybe it was because of the slower start that the ending felt a little bit rushed but for the most part, this one delivers. I've always enjoyed all of Miranda's novels and will certainly read anything she puts out for us readers. Those who love the YA thriller genre should surely pick this one up - don't let the slow beginning deter you. The build up of these characters resonate. Thanks to Crown for this copy."}, {"Review": " “sometimes i think he can sense something we don’t. and sometimes i think how things can still come back, even after we stop looking for them.” throughout this book, i kept having this nostalgic feeling while reading. i can’t quite place what it was about this book, perhaps the setting, but because of this, it will be secured in my mind and heart for quite some time. this is a story about two teens who have both suffered through a tragedy. who are lost and are trying to figure out what went wrong in their lives. it’s a story about them looking for answers, and instead finding each other. friends, this book is a wonderfully devastating mystery that you do not want to miss out on. at first, this story starts off with a little bit of  stranger things  vibes, which is what hooked me from the beginning. but, as you keep reading, it becomes more of a tragically endearing story. kennedy and nolan have both suffered through tragedies involving their siblings. they both believe they have evidence that might give them answers as to what happened with their siblings. kennedy posts on a website and asks if what she’s found is possible, while nolan has experienced the same thing and goes looking for answers on the internet, where he stumbles upon kennnedy’s post. from there, they chat to each other and eventually meet one another. they both struggle with what to believe and feel as if they have no one who wants to listen to them. but, as they soon realize, they have each other. and they cling onto that so hard and they never let go of it. i really loved watching their relationship blossom into something beautiful. they both have problems but they’re always there for each other, and support one another. but it’s in a healthy way, and i really appreciated that. i wasn’t sure what direction this story would take, but i guess that’s why it has a “mystery” sticker on the spine rather than a “sci-fi/fantasy” one. (i borrowed it from work aka my library) but, honestly, this has elements of both. it’s a mystery with a little bit of sci-fi sprinkled throughout. (hence the  stranger things  vibe) overall, i loved this story and it’s one i will think about often. i definitely recommend this if you’re looking for something that will make you think, as well as characters who will tug on your heartstrings.  tw for: loss of a loved one, loss of a sibling, talk of missing people, murder. "}, {"Review": "The cover and title caught my eye for a listing of YA thrillers and then the blurb sealed the deal with mentions of missing people and hidden messages in strange signal frequencies. Everything about Come Find Me was new to me and I was all set to plunge in for an exciting listen. My instinct was spot on. I loved this one and it only got better as it went down it's twisting path to the end.Come Find Me is a standalone YA thriller with sci-fi elements. It is dual narrated by the pair of protagonists who each have their own horrific past experiences of loss and receive the mysterious signal. Kennedy and Nolan were strangers until they joined together in a quest to get the answers to the signal which led them to facing the dark shadows of their past which has reached out to them in the present.I enjoyed how the book gave me one impression, particularly about Kennedy, when the story began and then peeled back the layers to reveal that things were something different. I don't have a lot of patience for teens causing more drama than necessary or being so self-absorbed that adults look stupid or like the enemy. It started down that road with Kennedy and her young uncle who was doing the best he could along with her withdrawal from the other kids, but then more comes out and her issues made a lot more sense. Nolan's situation was pretty cut and dry, sadly, from the beginning until much later.While I do have to constantly remind myself that I'm listening to a book about and for the Young Adult crowd, at the same time, I found that this author nailed it on the right maturity level for thinking and actions of her teen leads and for how they would be after experiencing the tragedies they did. In fact, I found them more well adjusted than I'm pretty sure that I would be. Their gradual strangers to friends and then friends to romantic interest was at a good pace and their relationships with others around them were right where they needed to be, too. Considering what she was dealing with, Kennedy landed well with her mom's young grad student uncle who I really liked even when Kennedy put him through his paces with her grief, anger, and secrets. But, it was Nolan my heart went out to. His older brother disappeared and from then on, he became a non-entity in his own home and with his parents. He lost everything when Liam disappeared and not just Liam.The mystery of the signals was sensational. I loved how the author had me totally guessing what we were dealing with there. Extra-terrestrial? Paranormal? Ordinary mystery? I kept bouncing around with my guesses as twists unveiled more.YA Warnings: mild language, moderate violenceCome Find Me had two narrators with Michael Crouch taking Nolan's part and Jorjeana Marie narrating Kennedy. I thought they were both fabulous narrators and this story came alive and was taunt with suspense and emotion because of their work. Their voices were a tad too mature for the teens, but I didn't mind, and would definitely rather that than trying too hard and distracting me. They certainly caught the tone and voiced the whole cast of characters well.All in all, this was an incredible listen and I would recommend it to YA and adults alike who enjoy sci-fi thrillers.My thanks to Listening Library for the opportunity to listen to this book in exchange for an honest review."}, {"Review": "I'd give this 3.75. As always with Megan Miranda, the book is well written, but I think \"the plot lost track of itself\" - if that makes any sense. Seemed to be doing very well, but slow, at the beginning. Then, I think the ending kind of went in a different direction from where I thought the story was headed, and got a bit \"meandering\". Still a good read, because her writing is always good, but the plot went off on a tangent and got hung up on several details which distracted you from the main action. Still worth the time to read it."}, {"Review": "3.5/5 stars - rounded up for GoodreadsThanks to the publisher for the free copy in exchange for my honest review. This was very different from what I was expecting! COME FIND ME is the newest YA thriller from Megan Miranda, and she will continue to be an auto-buy author for me. I would probably classify this one as more a sci-fi meets paranormal thriller - something to keep in mind is that it does have a slower build to it (I always like knowing this going into a thriller).Nolan and Kennedy have something in common, they have both experienced a tragic loss of a loved one. Something that is never easy to cope with or come to terms with. As they both are looking for answers they happen to cross each others' paths and join forces to get to the bottom of things.I feel like this is more character driven than plot driven, which isn't bad. Miranda does a great job developing the characters and really showing us their struggles to come to terms with the tragedies they have experienced. We get to see how two families try to move forward but also the determination Nolan and Kennedy have to know what truly happened.This is more YA and is a great way for those to get into the thriller genre (if you're looking for something lighter to start with). I will continue to keep my eyes peeled for more from Megan Miranda in the future!"}, {"Review": "Thanks to Netgalley and the publisher I was able to read this book in exchange for an honest review.***Come Find Me is about two teenagers, Kennedy and Nolan, brought together by loss and a signal that connects them,Two years ago Nolan’s brother went missing without a trace. His parents become consumed by their grief as they drown themselves and their home in the search for not just their son but other families missing kids as well. Nolan seems like a good kid whose really, really lost. His parents are so focused on other people’s problems and 100% completely avoiding all their own with the exception of their missing older son. Since his brother went missing Nolan has become fixated on finding his brother in his own way, paranormal/ghost hunting means.Kennedy herself has gone through something herself recently, losing her mom and mom’s boyfriend in a tragedy that takes a long time to be addressed and finds herself living with her uncle. At night, when her uncle is asleep she sneaks back to her home to retrieve data from her brother’s machines that he created to seek out answers from the universe. After one such night Kennedy pulls a signal that shouldn’t be possible, a signal that Nolan also has.These two join together for different reasons, thinking the signal ties into their own personal tragedies and can find the answers they need. Along the way they find an understanding friend in the other that may be just what they need to keep moving forward.The first half of the book is a little slow and bogged down with a lot of hints at Kennedy’s “that night” story. They dance around it for a bit and give you Nolan’s story straight up. After that though the second half moves fairly quickly and things are figured out and discovered.I enjoyed both main characters. Nolan is a quiet, contemplative guy that has gotten used to playing second place to other people (his parents barely seem to remember they have a second son, tbh he makes me sad. The kid deserved better.) Kennedy is bossy and assertive, she knows what she wants and she’s not going to let people’s view on her family tragedy hold her back. As a side character Kennedy’s guardian, the uncle, has his hands full, he wasn’t expecting to ever be guardian to his almost 17 year old niece, he’s pretty young himself and he is definitely trying his best. I really appreciated his character.This books is a fun, enjoyable read, but it’s also a YA mystery, so teenagers make some pretty dumb decisions... looking at you Kennedy, but if you enjoy YA mystery definitely hit this book up."}, {"Review": "I love Miranda’s writing talent since she fills her novels with suspense and down to earth characters. The idea of this story was a good one. A girl who lives with her uncle after her mother and mother’s boyfriend were murdered. A boy whose brother disappeared two years earlier. A signal that connects the girl and boy together as they start a mission to find answers for the things left unsaid.I couldn’t get into the story. One of the reasons was because we’re not told any information until 40%+ that was purposely written that way to keep the reader engaged. The opposite happened with me and I was frustrated that both characters were tiptoeing around “that day” and “that night”. I also wasn’t fond of Kennedy. She was impulsive and uncaring when it came towards her uncle. Multiple times she sneaks out of the house to go exploring/finding answers with Nolan and she doesn’t tell her uncle where they are going. Her uncle freaks, lectures and grounds her, and guess what happens the next day? She does it again. The process repeated a few times and added to the frustration factor.If Kennedy had told the truth to the police from the beginning, then she would’ve been in a different situation regarding her brother. But then we wouldn’t have a plot since the focus would be on Nolan and his missing brother sans Kennedy. Kennedy also lacked awareness which was another reason the obvious answers didn’t connect for her. I wish this had been written to focus solely on Nolan instead of two mysteries that both teens were trying to solve. Nolan’s brother’s disappearance could have been explored more deeply instead of random memories leading Nolan to the answers and a subplot on Kennedy’s memories.Still, I was glad I read this and will pick up Miranda’s next novel.Thank you NetGalley for an ARC."}, {"Review": "I will never not read a book by Megan. She is such an awesome person and author and I have loved all of her books so far. Have been so very excited for this newest one, and read it as soon as I was able to. And my gosh. This book was worth the wait. Once I began reading I simply could not stop. It was so good. Five stars.There is so much going on in this book and I have no idea how to write it all down. Will not include any big spoilers, I will only share my feelings about it all. And gosh. I have a lot of those. This book was such a huge mystery. And I loved every moment of it. It was full of secrets and I loved that I had not guessed a single one, lol.This book is told from two different point of views. Sixteen year old Kennedy, whom I adored so much. And seventeen year old Nolan. Whom was the cutest. These two characters were just so amazing and I loved them to pieces. Both written very well. And both point of views so good. It takes about a hundred pages for them to finally meet, how rude, haha. But I didn't mind, because those pages were needed to get to know them better. And they did sort of talk together a little before, without knowing who the other one was. But oh. When they finally do meet. Gosh. I shipped them beyond words. And reading about them becoming friends and getting to know each other was the very best. Especially loved their small romance. Not too big, but so very good.And that is all I will say of the romance. It was small, but it was perfect. No drama. No jealousy. So good. And these two precious characters fits together perfectly. This book is about getting to know them both. Getting to know the tragic things that have happened in their families. They had different stories, but the same heartbreak. And getting to know everything about all of it ruined me. There are new things getting told through the whole book and that was just so well done. So many surprises. Good but also bad ones.So very much heartbreak. I will not say too much about it, only the things that we get to know right away. Nolan lives with his parents, and he had an older brother. Whom disappeared two years ago, along with their dog, while they were in a park together. There was zero sign of him. And there has not been for two years. His parents grew a bit obsessed about wanting to search for other missing children too. And they sort of forgot about Nolan in the process. This precious boy needed way more love than what he got. Aw.For Kennedy her family tragedy happened only half a year ago. It is not revealed what really happened for some time, only that is was bad, and she now lives with her uncle and not her mother and brother. It was easy to imagine what could have happened, as there was a murder. But it was also so complicated and full of secrets and I loved getting to know it all. It was beyond heartbreaking and sad, though, and my heart was always aching for Kennedy. I loved how she was able to live life, after everything. I adored her.This book tells the story of Kennedy and Nolan. How they meet, and why. She is looking into space for her brother, searching for alien life. He is looking for ghosts, searching for his brother. They both end up getting a weird signal on their search things, and they end up speaking about it online. I liked how all of that happened. I liked learning about searching for the signal, trying to figure out what it all meant. A little bit supernatural. And it was awesome. I loved reading how everything fit together. So clever. So so good.There is much going on in this book. Yet it was also not nearly long enough, and I wish there was more of these most precious characters. Sigh. I haven't mentioned much of the plot at all. But gosh, it was beyond amazing. There are new leads on what happened to Nolan's brother. It was cruel, the whole investigation. Hmph. But so interesting. I loved all the small clues. I loved all the reveals. Although the ending was very heartbreaking. Oh. But so good too, and written very well. This book ruined me. In all the best ways too.I will not say more about this one. Only that Come Find Me was perfection. Full of mystery and suspense. Filled with surprises and some romance. Getting to read about Kennedy and Nolan spending all the time together was so so good. This book freaked me out. And I loved every moment of it. My heart was always breaking for both the characters. Yet there was hope too. And it was precious. I think you should all read this book. Because you will love it. Heartbreaking, but so very good. And very worth it. Megan is the best.---This review was first posted on my blog, Carina's Books, here: https://carinabooks.blogspot.com/2019..."}, {"Review": "This book is the young version of close encounters and passengers at the same time. Such an enticing engaging book that takes you away to help Kennedy and Nolan discover what happened to their brothers and why their families all of a sudden disappeared and why they are left behind and most importantly, find out if they are going to be next. Every chapter got better and better packed with action and drama that keeps you engaged that you will not want to stop reading. Thank you Netgalley and Random House Children's for the ARC in exchange for an honest review. This will definitely do well in our YFantasy collection at our library. That is why we give this book 5 stars."}, {"Review": "This YA thriller will give you a few chills with it's somewhat paranormal theme. Two teenagers who have both suffered mysterious losses just want answers and when their search for the meaning behind a strange signal leads them to each other, things start to unravel in the strangest ways. The theme of grief and coping is really strong in this story and you feel it. It starts slowly and I really wasn't sure what the story was going to be about, ghosts? aliens? But you really get into the mystery of it all and become eager to find out what happens next. The ending comes on fast and when it all links up you're definitely surprised."}, {"Review": "Come Find Me was a little slow getting up to speed, but once we got to the last few chapters, it moved at a very quick pace. Something has happened in Kennedy’s family and she is forced to live with her uncle. Nolan’s brother has been missing two years, and his family has turned their grief into trying to find him and other missing children. Somehow Kennedy and Nolan’s worlds intersect, and they begin working together to solve their families’ mysteries. Thanks to the publisher and NetGalley for allowing me to be an early reader in exchange for my fair and honest review. "}, {"Review": "From Megan Miranda, the New York Times bestselling author of brilliant novels such as FRAGMENTS OF THE LOST and THE SAFEST LIES, comes COME FIND ME.Not a day that passes is typical for Kennedy. How could it be when you recognize that the truth is not actually the truth, and that if you leaned closer to your reflection, the answers could be linked to the problem? Kennedy is the only witness to a crime, the murder of her parents, and only she can elucidate the matter. Following the murder of her parents, Kennedy is drawn to her brother Elliot’s satellite. Using the satellite, she hopes to discover the source of a mysterious frequency only she can hear and that may relate to her family’s tragedy. In a nearby town in Virginia, a boy named Nolan wonders where his brother has gone off to. For two years, it seems there is no hope, though his family is constant in the search. That is, until a signal identical to that of Kennedy's is received.Nolan and Kennedy find themselves acquainted with each other after endless curiosity about whether or not their pasts could relate. Perhaps the pattern conveys a message...from something beyond anyone’s right mind. Nevertheless, possibilities slink just past the atmosphere, taunting these two young people, and they’ll stop at nothing to sift through their woes and misfortunes. Come to think of it, could it not have been misfortune --- and perhaps something closer to themselves? SomeONE, even?This novel is a tearjerker and ideal for those with tastes for science fiction or realistic fiction, as well as romance. It was difficult to tell which genre this book should be categorized in the midst of all the twists and turns, enhancing my liking of the story line, which I think other readers will also enjoy. I believe countless adolescents and adults would take interest in COME FIND ME. It has moments that are utterly heartwarming, as complex and well-built characters come to terms with reality while connecting with family more closely. I love how all aspects of the text were given a neat ending and explanation, though I cannot say that it closed in the way I expected. The best of what the characters had to offer could be seen in the clearest light. It is guaranteed that any teenage audience will find it impossible to not leaf through this book in just a night.Personally, COME FIND ME has become my ideal literary piece to reread, for each thrilling whirl in the plot made me greedy for the next. It has also become one of my top five favorite books! I will definitely be recommending this novel to my classmates, and I hope for this book to find its way into our school library collection. COME FIND ME is one book to keep you guessing and masterfully suggests the idea that we do not have to be alone."}, {"Review": "I received this through NetGalley in exchange for an honest review.Two teens who have suffered a serious loss are brought together by an unexplained phenomena. Maybe if they work together, they can find the answers that will bring their families peace. It is through their shared loss that they find potential friendship and romance in each other. Kennedy lost everything after her family was involved in a deadly tragedy. She is currently living alone with her uncle and he is preparing to sell her family’s home. Kennedy doesn’t want to lose her home or its connection to her family. Also, she has continued to check her brother’s super computer in the shed for any contact from outer space. After a typical check on the readouts, Kennedy notices something strange. Seeking advice from scientists who might know more, she posts her findings on a discussion board. Two years ago Nolan’s older brother vanished without a trace. His parents threw themselves into finding their son and helping other families look for their own lost children. Nolan thinks that there is a better way to find his brother, especially because he instinctively knew when his brother disappeared. Nolan uses ghost hunting equipment to search for leads back to his brother. When one of his machines gives off a weird reading, he checks the internet and finds a post on a discussion board that is describing the same thing. Kennedy and Nolan are brought together and it is through their shared connection that they hope to find answers. I enjoyed this book. I thought it was great pairing alien hunters with ghost hunters. I loved that it was never entirely clear what genre this book fell into. Is it sci-fi, is it a realistic mystery? Are aliens abducting teen guys, or is there a killer on the hunt? The plot moved quickly and I liked the main characters. "}, {"Review": "[Review Contains Minor Spoiler]I loved the characters, Kennedy and Nolan are well developed and have a distinct voice of their own. The side characters are also well developed and add to richen the story. While the pacing of the story is a little slower, the mystery and suspense of the book keep drawling you forward. The plot is well developed and all of the reveals I didn't see coming. However, I was disappointed about the direction the book took. The book gives strong vibes that all of the events that launched this story have alien/paranormal ties. But that is not the case. While the ending is done well and it ties everything up and leaves no strings, I still felt disappointed. This book is definitely more relatable to Frequency [without the time travel] than it is to Close Encounter. I wouldn't necessarily compare it to Strange Things, as that definitely goes in a wild direction. But it does share the same mystery and weirdness aspect as the beginning of the first season. I just really felt the promise of something other and was left with a completely different book.All in all. Definitely pick this book up, but know that you will not find aliens or alternate dimensions, but a story with unexplained events and connections.[ Honest Review of Advanced Reader Copy received at Yallfest]"}, {"Review": "Actual rating: 2.5\nFirst line: \"They say the universe is constantly heading toward disorder, and I believe it.\"\nThe beginning slowly got me hooked but I found my enjoyment waning as the story went on. When the story was over I was kinda surprised by everything that had unfolded because I feel like I missed it all? Like the explanation behind Liam's disappearance made me think I had just completely skipped over the hints earlier in the book but then it was all explained and my reaction was okay??? Like the reasons just suddenly appeared? I dunno, I'm clearly confused but don't really care anymore?Kennedy was also super impulsive and how she got away with so much baffles me.Obviously not my fave Megan Miranda, but she has another adult mystery coming out soon that I'll probably enjoy more."}, {"Review": "Hmmm it’s either a 4 or a 3.5 so 3.7? I liked this book a lot, it was a quickish read for me, and if I had more time in general I would have finished it super quick. I got this book as an ARC at Yallfest 2018. It’s my first book by Ms. Miranda, but now that I’ve had a taste, I will read a lot more. The issues I have with this book are how scattered things seem. I enjoyed the characters though and the suspense. Just when it came to the conclusion, I didn’t feel any clues were ever given. Most importantly: this book is not aliens. It is not close encounters, or space related, except for that Kennedy’s brothers satellite captured the message. I saw some people saying that before I read the book, so it made me feel a certain way, but once I got in I was hooked. I’m thinking this book will appeal to fans of mystery, puzzles you can’t solve and all around unexplained ."}, {"Review": "Thanks to Netgalley and Random House Children’s for the advance Kindle copy of this 1.29.19 release. All opinions are my own.•⭐️⭐️⭐️💫/5 for Megan Miranda’s newest YA release. I have enjoyed some of her adult thrillers and was super psyched to see something that could potentially go in my school library. It is told in the alternating voices of Kennedy and Nolan, two teens who are each looking for something in the universe. Kennedy seeks to make sense out of a satellite her brother set up; Nolan searches for answers regarding his brother, who vanished years ago. It starts with a paranormal feel, but the ending definitely goes in a very different direction than I expected. It’s a bit bloody, and while it isn’t a book I would suggest to my younger readers, I think it’s something that will interest my eighth graders, and it definitely has a place in my collection."}, {"Review": "A story of 2 teenagers drawn together by a mystery that ties them together, both of their lives turned upside down by very different tragic events. Both teens independently investigating an occurance that pulls them in further like a magent. Kennedy, a girl who hears a strange repeating signal from her brother's amateur radio telescope and Nolan a boy who finds electromagnetic field distortions in his missing brother's room. They doggedly pursue clues that take them both on a Stranger Things type adventure that takes the reader along on an adventure that has a underlying paranormal twist. A very well written novel with well developed characters and plot. I have to say the end didn't turn out the way I would have thought after following along with the story, but a good read nonetheless. A 4 out of 5 star read!"}, {"Review": "Wow! This was definitely one of the best books I’ve read this year! Come Find Me is an exciting mystery/thriller told from the perspectives of two teenagers who are both searching for answers to what happened to their brothers. This book will hook you right from the start with Megan Miranda’s masterful storytelling and have you working with the teens to figure out their mysteries! I loved all of the unexpected twists and turns this book took and the awesome thought provoking ending! I would definitely give this book 5 out of 5 stars. It has quickly become a new favorite thriller! "}, {"Review": "First, I’d like to thank Netgalley for the ARC in exchange for an honest review.This book reminded me of a book version of Stanger Things. I was always looking for the connection between Kennedy’s and Nolan’s stories. Was it paranormal, another dimension, fate? The author kept me guessing until the very end. At times, the story got really slow and disjointed. The ending did a good job of tying in most of it together, but I still felt like I was wanting a little more from the ending and characters. Overall, this was good read, and I look forward to its release date."}], "Genre": "Thriller", "ID": "35065766", "Desc": ""}