{"Name": "Looker", "Image": "https://images.gr-assets.com/books/1545495213l/36553406.jpg", "Reviews": [{"Review": "This book is being marketed all wrong by saying that this is a mystery or thriller. It is neither one of those and if that is what you're expecting then you will be disappointed. This is a character study of a woman that is slowly losing her grip on reality. Our unnamed narrator has recently separated from her husband after several years and attempts at having children. They endured rounds and rounds of IVF that nearly depleted their savings. While she yearns for the children she will never have she also loathes herself for being the spouse whose \"fault\" it was that she couldn't conceive. The idea that her soon to be ex-husband can start his life again with someone new and could have the family that she envisioned for herself is causing her mind to break.Just up the road from her a young actress and her family move in and our narrator becomes obsessed with them and observes their daily life with a hawks eye. She has tried to get the actresses attention on several occasions as a feeble attempt at making a friendship with her only to be politely avoided. Let's just say that our narrator doesn't really like that. While I was reading this I was at 30% and wondering when is something going to happen? Again I was expecting a mystery / thriller yet their was no mystery to be solved and there was nothing particularly thrilling happening. Interesting, yes, but thrilling, no. That's when I decided to read this as the character study that it actually is and from there I couldn't stop flipping the pages. This lady is unlikable but yet I was able to muster some sympathy for her due to her situation. I can't imagine what it would be like to be a woman that was unable to have the one thing she wants more than anything in life, children. How devastating it must be to feel like you can't provide your husband with the family life he was expecting when he married you. The loneliness that comes with knowing your husband is moving on yet you remain stagnant in the apartment you rented together, close to the park, for when they inevitably had children. Now to have to sit and watch the mothers and nannies pushing strollers and lugging diaper bags to the park while you sit on your stoop chain smoking, observing, judging, in envy of their lives. \n\"I think life must have been easier for early humans, crouching and sheltering in caves. When the only form of entertainment was watching shadows move on the rock walls, in the firelight. When what mattered was shielding our tribe from saber-toothed tigers. Giant bears. There were actual dangers then - not beautiful, loose-limbed women gliding across the screen and past our doors in costly dresses and costly versions of our own drugstore lipstick, showing us who we aren't, what we haven't done, can't do, and will never have.\"\n This book isn't all that dark until near the end and I loved the ending, for me, it was perfection! Thank you to Edelweiss and Scribner Books for providing me with a digital ARC in exchange for my honest review. "}, {"Review": "3.5 stars.\"I'm grateful they've never thought to install blinds. That's how confident they are. No one would dare stand in front of our house and watch us, they think. And they're probably right, except for me.Laura Sims' \nLooker\n is a story about obsession, about how easy it can be to transfix on something when everything else isn't going your way. The unnamed narrator has had a tough time lately—her marriage has ended, partially because of her fertility problems, and her job as a lecturer at a local college is in jeopardy. All she has left is the cat her husband left behind, and the actress.Ah, THE ACTRESS. She lives on her block, in a beautiful brownstone, with her screenwriter husband, their three young children, and a host of staff. The narrator is a bit obsessed with the actress—she's watched her career go from small indie films to blockbusters, and watched her profile grow. But more than that, she believes that she and the actress have so much in common, and that they could even be friends, if the actress would just give her a chance.As things start to spiral out of control in both her job and her relationship with her estranged husband, she begins to focus more on the actress and her family. She even has a room in her apartment which she has filled with the actress' cast-offs, and she thinks the actress might even appreciate that. She just needs to figure out her approach, and when an interaction at the annual neighborhood block party shows promise, she gets excited and anticipates the start of a terrific friendship.But that is not meant to be. And while most people would recognize the gulf between the two women, she does not. She is determined that the actress will notice her, no matter what it takes.At just under 200 pages, \nLooker\n is a quick read that rapidly picks up steam. At times, you're not quite sure whether what the narrator is telling us is true, or if it is just a scenario she has created in her mind, so that adds another layer to the story.Sims does an excellent job creating a portrait of mental illness and obsession, and how easy it is to focus on something you perceive to be happy and successful when you feel your life is in turmoil. The book is so short, however, that I felt things ended just as they were really taking off, and the ending itself was a little abrupt. But it's a suspenseful, sad, slightly creepy story that definitely kept my attention.There is some animal cruelty in the book, for those of you who avoid books that include that. While some of the story certainly is predictable, some of it didn't quite go the way I thought it would, which actually pleased me, and kept me reading. You may think differently about your local celebrities after this!See all of my reviews at itseithersadnessoreuphoria.blogspot.com.Check out my list of the best books I read in 2018 at https://itseithersadnessoreuphoria.blogspot.com/2019/01/the-best-books-i-read-in-2018.html. You can follow me on Instagram at  https://www.instagram.com/yrralh/."}, {"Review": "This is yet another book that will suffer in the ratings for no other reason than it doesn't fit into any genre.There really needs to be a category for deep, dark psychological studies devoted to primarily one character. If a reader chose this book based on that description and because they enjoy those types of stories, then this book would easily have a 4+ average rating. Instead it has been billed as a psychological domestic thriller leaving fans of thrillers disappointed. I, however, love these dark descents into the mind of one character without all of the distractions involved with a true thriller. Stories narrated exclusively in the psyche of an unstable person as they battle their own demons makes for an incredibly intense read and Looker ticked all of the boxes for me. Looker follows an un-named woman whose husband recently left her after a long battle of infertility. Everything she ever wanted in life just fell apart and now she herself is following suit. The internal dialogue of this woman is equally disturbing and fascinating as the reader follows her slowly circling the drain until she finally disappears. Laura Sims is a brilliant writer and Looker is a triumph in foreboding cerebral storytelling. I received an ARC from NetGalley in exchange for an honest review."}, {"Review": "Looker by Laura Sims is a thriller that is narrated by an unknown woman with stalkerish tendencies. The book is written in the style of YOU by Caroline Kepnes in which the reader is getting the story through the thoughts and interactions of the main character but it didn’t take long to distinguish itself from reminding me of that book.The main character in Looker is a female going through divorce from her husband and becomes obsessed with a neighbor who is a famous actress. As our character spies upon the actress she sees nothing but perfection as her own life is falling apart.Now to explain my rating without giving away the entire story since the story honestly didn’t consist of much… Right after I began reading this I thought to myself that a certain event better not happen or I will be one unhappy camper and as you might guess that event did happen. On top of my disappointment and disgust there wasn’t much else to this as to me it reads more like a mid-life crisis during the other 98% of the story than a thrilling read. Needless to say this one wasn’t for me.I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"Review": "What the fuck did I just read?This book is marketed as a main character becoming obsessed with the actress who lives on her street, but after reading it - that’s not really what this book is about. I’m actually left wondering what the point of this novel is exactly?? It’s an incredibly boring story that doesn’t ever really go anywhere? By the end I was confused... like how was that the end? That is what the story was building towards? What a let down.I don’t know what it is with these thrillers and comparing themselves to Hitchcock... This one and The Woman In The Window both do that and I honestly don’t get it. This book is actually about a woman who is dealing with a divorce from her husband because she can’t get pregnant and she’s really fucked up because of that and sometimes looking through the window and watching the actress and her family. It’s a really lame, mild stalker story. I was expecting it to get a lot creepier or at least not exciting. This main character is also really obnoxious and immature with how she deals with her divorce and she makes a lot of really stupid decisions that just had me rolling my eyes. The only reason I kept reading was because it’s so short and I wanted to see where it would go - but the ending was massively disappointing. For such a short book I felt like so much of it could’ve still been cut out.. I just didn’t see a point to any of the story to be honest idk. I’m so disappointed because after reading that description I was PUMPED and I thought it might be a new favorite but instead I’m left feeling like I just wasted my time. I don’t mean to be so harsh with a one star rating but I can’t give it any higher than that because I can’t think of one thing I liked about it. Thank you to Scribner for sending me an ARC!"}, {"Review": "At only 180 pages Looker by Laura Sims packs quite the punch and has the elements here to make this a pleasing dark and unsettling story. It has those intriguing unsettling elements of jealousy, obsession and resentment. Laura Sims takes us into the mind of our unnamed narrator as we watch her obsessions with a neighbor start to push her over the edge. Laura Sims does a good job balancing the dark thoughts with some wit and humour, allowing me to feel some sympathy here for our main character.Laura Sims does a good job creating an interesting unreliable character here and at times I was questioning what was real and what was a delusion. The ending took me a bit by surprise and left me wanting more and I haven’t really decided if that was a good thing or not. I am leaning towards good because I was satisfied with the way it ended.Thank you to Simon & Schuster Canada and Laura Sims for my copy to read and review!"}, {"Review": "i know this book feels scorned, borrowed from work ONLY to fill the one-day reading gap before Black Leopard, Red Wolf came out. i keep telling it i was going to read it anyway, although between you and me, i was most likely going to wait for paperback because 25 dollars for a book with fewer than 200 pages that’s not photos of kittens? that's bonkers. there’s no need for this book to pout, though, because not only did it serve the exact purpose i needed it to - being my short reading bridge between bardugo-and-james -but it was also a bridge i enjoyed crossing. in the grand tradition of Eileen, Notes from Underground, American Psycho, etc, Looker is a claustrophobic character study of an antiheroic unreliable narrator, wedging the reader right up in the psychological landscape of a woman in the violent throes of a spiraling nervous breakdown after a series of failures and disappointments have frayed her nerves, causing her to succumb to her lonely despair and rage, grasping at anything to stop her spinning.her anchor of choice is a fixation on her neighbors: a famous actress, her screenwriter husband, and their children. what was once a harmless proximity-fascination with the actress; that nyfc thrill of “oooh, we live near a celebrity!” becomes a full-blown obsession whose emotional tone is as unstable as everything else in the narrator’s life; shifting back and forth between adoration and envy, wanting to befriend her and wanting to destroy her, admiration, jealousy, covetousness - fetishizing this woman and her “things” into a symbolic representation of everything she herself has lost. Later that same night, I pause by her house on my way home from work. Lights on in the kitchen. The actress stands at the island, opening a bottle of wine. Children in bed. The husband upstairs somewhere. Alone with a bottle of wine, how luxurious. I’ll be alone with one, too, in a few minutes, but the quality of her aloneness differs from mine. Hers is fuller: surrounded, swaddled even — an island on whose shores laps a vibrant, busy sea. Her aloneness is temporary; mine is infinite. Mine spreads out from the center like a puddle, muddying everything it touches. the narrator’s husband nathan has just moved out of their posh-but-poorly maintained brownstone in what i assume is park slope, after round after round of IVF treatment has left her exhausted, depressed, and still childless. and - man - that whole process of struggling to conceive sounds barbaric and horrible. she teaches adult education at \"an overpriced, second-rate city school,\" but enrollment has dwindled and she only has one poetry class, leaving the bulk of her time wide-open for painful reflection and succumbing to bad impulses, like a sexual preoccupation with one of her male students and the voyeuristic ritual of staring through her neighbor’s kitchen window - treating her private space like a scene from one of the actress’ movies, which she watches and rewatches night after night. she has few friends, and her only companion is cat, the… cat that nathan left behind and whom she had always disliked until nathan tries to make arrangements to retrieve her and then cat becomes the last strand tethering her to sanity. her head is messy, chaotic, full of fantasy and hallucination, memory gaps and emotional extremes. she feels like a 'woman-shaped shadow,’ imagining herself unseen, invisible, and her sense of how she is perceived by others when she is seen is all highs and lows; sometimes pitied, sometimes rallying herself into a theatrical version of herself, where she imagines all eyes are on her, awed by her stage glamor and confidence. some of it hit a little too close to home, in a \"there but for the\" way: the professional and personal disappointments, the strain of maintaining the façade that everything’s A-OK, being surrounded by people more affluent and seemingly untroubled when you feel like a hunched-over cave troll flattened by vicious mood swings... and then that self-destructive but also purely relieved feeling in letting it all collapse at once, the papercut pleasure in one’s own defeat like a dog rolling in stink. it's a slippery slope into the straightjacket-hug of madness - it begins with the instagram-stalking of a rival and before you know it, the line between fantasy and action have blurred and you're filling the spare room intended for your never-coming baby with a celebrity's garbage.don't let it come to that. use this book as cautionary tale. note to self: find recipe for orzo-watermelon salad. mirror narrator in no other way. **************************this is me borrowing the shortest book - the shortest book i actually wanted to read- from work, because i told myself no matter what i'm reading on feb 4, the MOMENT my copy of Black Leopard, Red Wolf gets here on the 5th, that's the only book i will have eyes for. so hopefully i'll have enough reading time today for a one-day read because i would hate to throw a borrowed book against the wall in my haste to get my marlon james fix.come to my blog!"}, {"Review": "A woman is obsessed with a neighbor. The obsessed woman's life is slowly unraveling, and the neighbor is a beautiful actress who appears to have the perfect life.This novel is narrated by an unnamed woman who is going through a divorce, infertility, and a failing career. While struggling with various areas of her life, she becomes entranced with her neighbor's perfect life. As the narrator's life continues to unravel, she becomes more and more obsessed with her neighbor.A dark tale of one woman's descent into madness. This is a slow-paced story, but one that kept my interest. If you're looking for a twisty thriller, then pass on this one. If you're looking for a dark character study, pick this book up. Dark, complex, and disturbing.I received a free eARC of this book from the publisher via Netgalley in exchange for an honest review."}, {"Review": "\nInstagram || Twitter || Facebook || Amazon || PinterestLOOKER has a somewhat misleading summary on Goodreads which I think accounts for some of the negative reviews. The summary makes you think it is going to be like Caroline Kepnes's YOU or Gillian Flynn's GONE GIRL, but this is not the case. In situations like these, I want to take the publishers aside and tell them, \"Look, even if blurbs like these sell copies, they aren't going to get you good reviews, because if there's one thing that pretty much everyone universally hates, it's being lied to.\"The unnamed protagonist's obsession with the actress who lives in her neighborhood is not what drives her to madness. She is woman who (I'm guessing) is in her mid-thirties. Her husband has just left her and is in the process of getting a divorce from her due in part to her infertility. She is an untenured professor teaching night classes on poetry at the local community college. Her identity as a woman, measured on the superficial standards of success set by society based on motherhood, sex appeal, and self-control, have been compromised. She feels panic, anxiety. She focuses on the woman who seems to have it all so, so easily: the actress.I think if you read this as a traditional mystery novel, you're going to be disappointed. There aren't any last act splatter-fests, as in AMERICAN PSYCHO, no abrupt twists as in GONE GIRL. The worst thing that happens in this book is that the cat dies, and I'm sorry if that's a spoiler, but it's something I wished I'd known going in because animal deaths upset me, and maybe they upset you, too, so please consider yourself warned. LOOKER is instead a brutal character study into one woman's midlife crisis turned psychotic break. Initially, she sells her unreliable narration but pretty soon it begins to fray at the seems, as she herself begins to lose her tenuous grip on reality.If anything, LOOKER feels like a condemnation on the unrelenting standards imposed upon women: we have to be attractive, we have to want and/or have children, we have to be poised and impeccable, we have to have careers and be successful at them (but not too successful). In short, we have to have it all. It's bitterly unfair that some women have to work 200% harder for things that come to men (specifically white men) with relative ease, and it's even more bitterly unfair that those things that come to women with difficulty are about 1000% harder for women of color. LOOKER reminds me of those books that I call \"proto-feminist books,\" like MADAME BOVARY or THE AWAKENING or THE YELLOW WALLPAPER, where this sheer unfairness drives a woman to madness after she breaks social convention and finds the social ostracism and guilt too much to psychologically bear.I don't think this is a happy book, or even a particularly satisfying one, but there is something honest about it that hits a little too close to home in the age of Instagram and FOMO and celebrity advice.Thanks to Netgalley/the publisher for the review copy! 3 stars"}, {"Review": "I started reading Looker on 12/5/2018 and finished it on 1/24/2019. (Please ignore the date in this case because it has nothing to do with the book being good or bad. I experience the worst reading slump ever.) This book is a great read, though more on the depressing side. I enjoy reading the IVF process. I like the realistic feelings of a woman wanting to have a baby but couldn’t. It’s interesting to follow a scorned woman feeling like she has nothing to live for and unworthy of love and looking at someone else, an actress neighbor who seems to have the world in her hand. The realistic jealousy makes this book a page turner even though readers can foresee that nothing positive will come to this unnamed woman when she begins to tell readers that she obsesses over the perfection of her neighbor and continue to live in negativity, constantly viewing herself as less than.This book is told in the first person point of view following an unnamed woman as she observes an actress and her husband with three children at a distance through their window. She lives alone with her ex-husband’s cat. Further along into the story, readers will learn that this unnamed woman is angry because she wants to have a baby but couldn’t. She underwent many IVF treatments but still couldn’t get pregnant and her marriage ended in the result of that. She becomes angry and obsessive at other women who are able to easily have children, especially the actress neighbor, who seems perfect in every way. In her depression, she often fantasize herself living a better life, more similar to the actress. She imitates the actress from her movie roles when she goes to teach her poetry class to increase her self confidence level.Looker is well written. It depicts a scorned woman perfectly. The reasons for this unnamed woman to feel unhappy and unloved are right on point. It shows how far an unhappy person will go and unexplainable reasons for her actions. She continuously making bad decisions because she has nothing good going for her and the constant pressure from her ex and judgement from nosy neighbor just doesn’t help at all. The ending, I understand why she did it. She doesn’t want to lose it when she finally grow fond of something. So she did that as a way to win, as a way to have control over something than not having control of everything else that fail in other areas of her life. The other ending, I was expecting something spectacular with the actress she obsesses over, but it didn’t happen. Though this book doesn’t give a positive image of a person, it reminds readers that comparing ourselves to someone perfect is too high of an expectation. That’s why there are groups of people with common grounds to get together and support each other. This unnamed woman should have done that instead of surrounding herself with people who have everything she doesn’t.Pro: fast paced, IVF process, obsession, scorned womanCon: a bit depressing to readI rate it 4 stars!***Disclaimer: Many thanks to Scribner for the opportunity to read and review. Please be assured that my opinions are honest.xoxo, Jasmine at www.howusefulitis.wordpress.com for more details"}, {"Review": "Reading early reviews of Looker, I can already see it's suffering from what I think of as the \nEileen\n problem. Like Ottessa Moshfegh's debut, this novel is being marketed as one thing (a psychological thriller) when it is actually something subtly but significantly different (a character study). Viewed as a thriller, it is not particularly satisfying. Read as a character study, however, it opens up into a brilliant portrait of a difficult and complex protagonist, layered with darkness and obsession.The narrator is a woman in early middle age who has recently split from her husband after years of unsuccessfully trying for a baby. She's a lecturer at a local university, teaching evening poetry classes. She lives in an affluent NYC neighbourhood – but only because her ex, Nathan, paid a year's rent upfront before he left. She shares her apartment with his cat (named Cat) and passes her days watching, walking, daydreaming. She mocks and scorns the things that used to seem important, such as the passion she had for poetry.\nI could roll on the floor in hysterics at such naïveté now, if it were at all funny. The life of the mind! FUCK the life of the mind.\nHer existence now, she believes, is that of a 'woman-shaped shadow'. Her only friends are people she loathes ('I said yes to lunch with Shana only because I didn't have the energy to explain that I never wanted to see her again'). She plainly hates herself (but likes to remind us she is 'movie-star thin'). Mired in bile and bitterness, she reminded me a lot of two Moshfegh protagonists: the eponymous antiheroine of Eileen and the nameless narrator of My Year of Rest and Relaxation.A third of the way through the book, following an encounter with the meddling elderly neighbour she calls Mrs. H., the narrator tells us:\nI am sick to death of women. Kind women, careful women, strong-and-silent women, caretaking women, lonely women, old women, young women, perfect women, dead women, crazy women, haunted women, bitter women, hateful women, harsh women, hounded women, all women! I am not one of you! Leave me alone, leave me to the straightforwardly horrible men.\nAnd a little later, after a rendezvous with a student that may or may not be imagined:\nI am sick to death of men. Buzzing, angry men. Hot liquid men. Men wanting sex. Men wanting to touch and be touched. Men wanting to drain you of every last ounce of energy you've reserved for getting through the days. Men under streetlamps, men on my stoop. Men fucking someone against my very gate. Men leaving their refuse everywhere: inside, outside, all over the world. Until the world fills up and spills over as it may soon do: The End.\nThe line that comes straight after this passage is: It's the actress who calms me, of course. The narrator's obsession with a woman who lives in her neighbourhood, a famous actress with a young family, is central to the story. (Neither character is ever given a name: the actress is always 'the actress', though physical descriptions of her made me think of Emma Stone.) The actress has a picture-perfect life: fame and money, a devoted husband, a beautiful home, staff to pick up all the dirty work, and – of course – children. Children, whose absence from the narrator's life seems to be the fuel for so much of her hatred.What's ironic about the narrator's ferocious desire to have a baby is that she would surely make the worst mother imaginable. She doesn't even seem to like children, except as another object she wishes to possess. Her treatment of Cat is an ominous foretelling of her probable parenting style: she hates the animal at first – 'I feed her to keep her alive – that's it' – until Nathan declares he wants her back, at which point she begins to lavish affection on her. This sudden outpouring of 'love' made me much more uncomfortable than the previous neglect.\nIt amazes me. And yet I feel repulsed, too. If I could suckle a child myself, would I feel the same? Maternally virtuous, like I was growing a future citizen of the nation, but simultaneously disgusted and trapped, clamoring to be free from the leech at my breast?\nThe narrator is a fantasist, and there are points in the book where it becomes difficult – nearly impossible – to pick her daydreams apart from reality. As is the case with many an unreliable narrator, what she leaves out of her account is often more significant than what she puts in. It's also deliciously rewarding to observe other characters' interactions with her, particularly when it comes to her preoccupation with the actress.And yet – is the narrator entirely unsympathetic? Like Moshfegh's Eileen, or Anita Brookner's Frances, or Zoë Heller's Barbara, she disgusts us because her miseries are largely of her own making, but compels us because we see something of ourselves in her. I cringed with recognition when she window-shops at an expensive organic store, contemplating blowing the last of her money on outrageously overpriced salads, just because the actress shops there. Throughout the book, she's always a step (or ten) away from understanding that having things in common with the actress, even possessing the actress's actual things, will not make her any more like the actress. In the age of the 'influencer', I suspect many of us are more intimately familiar with this sentiment than we'd like to admit.I read Looker hungrily over the course of two train journeys. It is truly an unputdownable read, one designed to be devoured at speed (no chapters, all one breathless diatribe), but also one you want to reread almost immediately. There's so much more I loved about the book that I haven't even touched on here (the fantasies about the actress's husband! the Bernardo incident! the block party!). It's an excellent debut, and I'm excited to read more from Sims. Recommended to fans of the aforementioned Moshfegh novels and Patty Yumi Cottrell's Sorry to Disrupt the Peace.I received an advance review copy of Looker from the publisher through Edelweiss.TinyLetter | Twitter | Instagram | Tumblr"}, {"Review": "SIGHT SPOILERS... but important to know ahead of time.... “Looker” was an interesting page turning short psychological study of a complex unnamed main character. Not particularly ‘dark-Dark’ as in horror - until closer to the end. The ending itself might be reason enough toss this book out the window for readers with a strong sensitivity for any animal harm in their reading. Personally - if an animal dies in a book by accident- or natural causes - I don’t have a stand against reading about it any more than I might when people die in our stories - but I, too, cringe with animal - or - people physical cruelty....- And there is a very uncomfortable scene in this novel.....associated with a cat...But.... I admit to being hooked from the start - curious - wondering - “where is this book going”? .........I was compelled to keep reading. It’s haunting - even sometimes ‘hilarious-in-thought’ that one woman could be sooooo over-the-top obsessed with having a baby.Everything in this woman’s life is coming undone- her marriage - her job- her inability to have a baby ( the one thing she wants more than anything else in life).....She falls deeper and deeper into loneliness- depression & isolation - ( other than her ex- husbands cat that she doesn’t like - other than liking that her husband can’t have his way in getting to keep the cat).....She’s gone MAD-with ENVY....Obsessed with a celebrity neighbor who has everything she doesn’t. She’s COME UNDONE.....Well written.. ......Laura Sims has made a mark with this debut with her ‘fly-on-the-wall’ look at a very unglamorous woman’s mind.But in my opinion - I can fully understand a wide range of reactions and ratings to this type of book. ....It’s not a mystery thriller - ....and the main character is ‘not’ cozy-likable.Yet... I found it fascinating! "}, {"Review": "Pre-review note: Looker is, for reasons I can't fathom, being billed as thriller/pseudo-thriller. It is not that, but it is a harrowing and haunting look at one woman's unraveling, and for those interested and willing to travel to a very dark place, this beautifully written novel is absolutely worth checking out. Ok, review:I loved Looker. Loved it, even as its brutal rawness left me reeling. It is unflinching and unafraid in its depiction of how its unnamed narrator, newly separated and living in an unnamed city, veers to ever deeper, bitter, and angry despair while becoming increasingly obsessed with a famous actress who happens to live next door. She becomes the representation of everything the narrator wishes she has and feels she does and doesn't deserve. It's this fracture--the narrator's belief she deserves a better life than the increasingly painful and bleak one she has while wrestling with a simultaneous belief that she cannot do better, isn't worth anything--that leads to the ending, to her ultimate fracture. I don't want to spoil the ending but I will say I think it's perfect as our narrator breaks just as she sees/gets the kind of moment, the interaction that she has been dreaming of because by the end, she's part of something that cannot be erased, cannot be undone, which is what she fears and what she's become.I also have to say that Looker is gorgeously written. I'm not normally one to highlight passages when reading but I left Looker devastated by what happened to the narrator, by all the moments that lead to her loss of everything, including herself, while elevated by prose like this:\"She will swoop in, bearing bags full of delicacies, and redeem the rotten mess of my life with one swift touch of her bird's wing. I close my eyes to everything else.\"And my favorite:\"...feeling everything that is rich and terrible and dark and lonesome in this life, feeling abandoned and full of despair, and beaming it out to us. Beaming it to me.\"Overall, Looker is an audacious and powerful and unflinching look at the way we can unravel, the darkness that can overtake us. An absolute stunner, that I preordered (it will be released on January 8th) as soon as I finished the ARC and is already (in my mind) solidly on the list of best reads of 2019."}, {"Review": "In NYC, this unnamed narrator is living alone with her ex-husband's cat, miserable and desperate for revitalizing her life after her countless pregnancy failures and dissolution of her marriage. Working as a literature professor, the narrator takes us on a stroll through her life, reminiscing about her marriage, and mentally sexualizing a student in one of her classes. As the story in \nLooker\n moves forward, she also begins to obsess with her famous actress neighbor of hers in full detail. Is she envious of her life or has the stress of what's unfolding in her life gotten the best of her? \nLooker\nprovides you with a bird's eye view into the life of a woman coping with trauma, emotional stress, and psychologically induced obsessions. This quick read is a combination of the classic Hitchcokian thriller infused with Bridget Jones Diary. \nLooker\nonly dives us into a surface level storyline, and I left this novel wanting more! We only get to see what the narrator wants us to, but as the story develops, you quickly start to see exactly what is happening. I don't know whether to hug the narrator or get a restraining order. "}, {"Review": "Thanks to Scribner Books for gifting me a copy of Looker by Laura Sims. I’ve seen a ton of mixed reviews for this one and I can see why. Normally, I don’t want to know ANYTHING before I start a book but with this one I’m glad I had some information on it before i started it. I wouldn’t consider Looker to be a mystery or a psychological thriller. Character study maybe? Our main character is unnamed and her thoughts are wild. Pretty sure I actually laughed out loud a few times at her ridiculous thoughts. She is obsessed with her neighbor, “the actress”. She watches the actress through her windows, sees the perfect actress with her family and imagines having conversations with her.There isn’t much of an ending and I knew that before going in. So, I really enjoyed Looker, I thought it was entertaining. The length was perfect for what it was. I’m going to rate it 4⭐️! "}, {"Review": "3/5 stars - While this book was certainly suspenseful I don’t really consider it a thriller as much as an intriguing character study of an educated woman losing her mind. The main character/narrator spirals out of control, eventually losing her job and making one bad decision after another.The narrator’s husband leaves her after they battled with infertility for years and she focuses her energy on another obsession, the actress that lives next door. It’s not entirely clear to me how the two women with obvious different income levels live so close to one another, but you must accept this to get into the story.The narrator stalks her neighbor becoming more and more delusional every day until she completely loses it. The parts of the story that focused on the narrator’s career as a professor teaching a poetry class were boring and made this short book (180 pages) feel much longer, but the rest of the story kept a good pace.Overall, if you go into this story expecting a character-driven book with a side of plot, you will probably enjoy it. Unfortunately, it was just so-so for me.Trigger warnings: Animal cruelty is present in this book. Also the main character struggled with infertility in the past and she reflects on that journey negatively throughout the book."}, {"Review": "A woman is falling apart. Her husband has left her ... and left his cat with her. That's all she has because she has no children. After years of needles and tests and the loss of lots of money, she finally gave up. She teaches part-time at a college. But she is one extremely unhappy woman who is walking on the edge.From her view in her house she can see into the neighbor's kitchen at night. Living there is an actress, her screenwriter husband, and their three kids. They are living the life she should have had.She begins stalking ... although that's not what she would call it. She stares at their house ... she starts to dress like the actress, act like the actress. Imagines what it would be like to be her. She fantasizes about the actress' husband. She rubs elbow with the actress during their block party. But soon those happy 'wants' turn deadly.When envy and jealousy turn dangerous ... anything can happen. She is quickly spiraling out of control. Her husband wants his cat back and what she does is pure evil. She has a flirtation with one of her students that turns really wrong. So where is this all headed?The book is told only by this anonymous woman. She ruminates her early life with her husband from her viewpoint only. The reader gets a peek into her mind, what she thought, what she felt. And the reader also watches as she stalks, her mind already turning to darker things.Although the author has written other books (poetry), this is her first novel. It's powerful in its emotions.Many thanks to the author / Scribner Books / Edelweiss for the advanced digital copy of this psychological thriller. Opinions expressed here are unbiased and entirely my own."}, {"Review": "\"It's disappointing only because she belongs to us.\" While I absolutely love the idea of Looker, I was not a huge fan of the execution. Even though I sometimes get burned out on them, I can always be sucked in with a good stalker novel synopsis. I feel like this book is being incorrectly marketed as a thriller, and it's really more of a character study.There were not any \"thrilling\" or suspenseful scenes in this book at all. That's totally fine, but it's just setting Looker up for failure when the synopsis says things like \"taut and thrilling\" and \"propulsive Hitchcockian thriller.\" Please stop doing this. This story has some elements that reminded me of Watch Me by Jody Gehrman and The Woman in the Window by AJ Finn, but it's not enough to call it a thriller. Although I had issues, I did enjoy some aspects of the book. I feel like envy is portrayed very well in this story, and it's easy to see how much the main character has let it mess up her life. Looker is really about the main character's mental unraveling. A lot of her breakdown has to do with infertility, and it starts to drag after a while. I ended up skimming the baby rants after a while. I'm not unsympathetic, but it was very repetitive to read for an extended period of time. There was some animal stuff I could have done without, and I feel like it was predictable. Everything got very disjointed, and the book does not wrap up well at all. The end is abrupt, and I feel like the build-up of the story was not really worth it to get to the ending. Thank you to Scribner for sending me this one. Looker will be out on 1/8."}, {"Review": "One sentence summaryLaura Sims has a unique and interesting writing style.My thoughtsI felt this book deserved more than 3⭐️’s, but less than 4. The story held my interest, but I was anticipating more suspense. I’ll admit sometimes it takes some twisted thrills to keep me flipping pages! Although I enjoyed the book, I would have devoured it in one sitting with more suspense/thrills.LikesI was hooked by the cover...FABULOUS...and pulled in by the description. This was a debut, so I’d like to see what else Ms. Sims comes out with. The storyline of a woman just abandoned by her husband, fixated on her neighbor, as she’s bitterly reminded of the life she imagined for herself...sounds pretty serious, but bits of humor added appeal to the story.DislikesOne thing I didn’t care for was the fact that it ran on, as one long chapter. I need chapters...and shorter ones are better. I need a clear stopping point when I put the book aside. Chapters make me feel like I’ve accomplished something. But that is a personal quirk and shouldn’t reflect on the book or author!I also yearned to give this unstable stalker a name. It’s easier to picture the character. The book had many great reviews, so I think my opinions are in the minority. Recommend: Yes...it’s short and worth trying!My Rating:  3 ⭐️’sPublished: January 8th 2019 by Scribner Pages: 182Thank you to NetGalley / Scribner / Laura Sims for this digital ARC, in exchange for my honest review!#NetGalley #Looker #DebutBook BlurbA dazzling, razor-sharp debut novel about a woman whose obsession with the beautiful actress on her block drives her to the edge.I’ve never crossed their little fenced-in garden, of course. I stand on the sidewalk in front of the fern-and-ivy-filled planter that hangs from the fence—placed there as a sort of screen, I’m sure—and have a direct line of view into the kitchen at night. I’m grateful they’ve never thought to install blinds. That’s how confident they are. No one would dare stand in front of our house and watch us, they think. And they’re probably right: except for me.In this taut and thrilling debut, an unraveling woman, unhappily childless and recently separated, becomes fixated on her neighbor—the actress. The unnamed narrator can’t help noticing with wry irony that, though she and the actress live just a few doors apart, a chasm of professional success and personal fulfillment lies between them. The actress, a celebrity with her face on the side of every bus, shares a gleaming brownstone with her handsome husband and their three adorable children, while the narrator, working in a dead-end job, lives in a run-down, three-story walk-up with her ex-husband’s cat.When an interaction with the actress at the annual block party takes a disastrous turn, what began as an innocent preoccupation spirals quickly, and lethally, into a frightening and irretrievable madness. Searing and darkly witty, Looker is enormously entertaining—a psychologically suspenseful and fearlessly original portrait of the perils of envy."}, {"Review": "Pre-review note: Looker is, for reasons I can't fathom, being billed as thriller/pseudo-thriller. It is not that, but it is a harrowing and haunting look at one woman's unraveling, and for those interested and willing to travel to a very dark place, this beautifully written novel is absolutely worth checking out. Ok, review:I loved Looker. Loved it, even as its brutal rawness left me reeling. It is unflinching and unafraid in its depiction of how its unnamed narrator, newly separated and living in an unnamed city, veers to ever deeper, bitter, and angry despair while becoming increasingly obsessed with a famous actress who happens to live next door. She becomes the representation of everything the narrator wishes she has and feels she does and doesn't deserve. It's this fracture--the narrator's belief she deserves a better life than the increasingly painful and bleak one she has while wrestling with a simultaneous belief that she cannot do better, isn't worth anything--that leads to the ending, to her ultimate fracture. I don't want to spoil the ending but I will say I think it's perfect as our narrator breaks just as she sees/gets the kind of moment, the interaction that she has been dreaming of because by the end, she's part of something that cannot be erased, cannot be undone, which is what she fears and what she's become.I also have to say that Looker is gorgeously written. I'm not normally one to highlight passages when reading but I left Looker devastated by what happened to the narrator, by all the moments that lead to her loss of everything, including herself, while elevated by prose like this:\"She will swoop in, bearing bags full of delicacies, and redeem the rotten mess of my life with one swift touch of her bird's wing. I close my eyes to everything else.\"And my favorite:\"...feeling everything that is rich and terrible and dark and lonesome in this life, feeling abandoned and full of despair, and beaming it out to us. Beaming it to me.\"Overall, Looker is an audacious and powerful and unflinching look at the way we can unravel, the darkness that can overtake us. An absolute stunner, that I preordered (it will be released on January 8th) as soon as I finished the ARC and is already (in my mind) solidly on the list of best reads of 2019."}, {"Review": "Thank you so much Scribner Books for my free copy of LOOKER - We dig deep into a woman’s psyche who is enraptured by envy and obsession in this fascinating, addictive character study.We follow an unnamed narrator: a woman who is recently separated, has a failing career, and who struggles with infertility. Since her husband left her, she lives alone with their cat and starts to become seriously unhinged. Her life becomes so unbearable she completely obsesses over her actress neighbor who appears to have the most perfect life, the perfect husband, career, children; everything she has not been able to obtain.I devoured this book as I love Sim’s writing style and the dark themes portrayed via the main character. I really enjoy character study type novels especially when they involve a character descending into madness. This is not a thriller but a slow and steady bird’s eye view into a tortured woman’s life. And can I just say BRAVO for this spectacular cover!"}, {"Review": "I won this in a goodreads giveaway. A decent read, but is mislabeled regarding where it fits in terms of genre. There’s no mystery and little suspense. This is a character study of one woman whose life is crumbling all around her. The main character leans on an actress who lives nearby for support. Granted the support comes from her mild (in the beginning) obsession of her. The story is highly unlikely to occur. Given the actresses popularity there would be no way for the MC to stalk her to the extent in the novel. However certain characters actions rang true to life and I believe this author has the ability to really capture emotion and human behavior. I mainly saw this in the secondary characters, and a bit in the MC. I think a few more books and this author could have a hit"}, {"Review": "I am glad this book was short, it was very hard to get into. The story and writing are ok and the plot was different than any other I'd read, but that was about the only thing that kept me reading. Talk about unlikeable characters, I didn't care for any of these self-centered people and therefore couldn't really be interested in any of them and the ending felt a little flat. I wish the author the best of luck with this book but it just wasn't my cup of tea.Thank you NetGalley, Scribner and Laura Sims for the opportunity to read this book in exchange for an impartial review; all opinions are my own.#Looker #NetGalleyAll my reviews can be read here: https://shelleyann01.blogspot.com"}, {"Review": "\"I see you. But I also know how hard it is to be seen.\"Looker is a character study of a woman struggling with loss. It tracks her emotional and mental turmoil and her descent into obsession. At the outset, the unnamed narrator has lost nearly everything - her marriage, her hope of becoming a mother. She becomes fixated on the blockbuster star actress who lives on her street, with her gorgeous home, seemingly perfect family, and ideal life. The narrator feels like nobody. Like nothing. We watch her as she makes increasingly unhinged choices, each one isolating her more, as she moves farther away from reality.Looker was not what I expected. Other readers have noted this too. Based on how it was marketed, I expected a thriller. Looker isn't one. It is a study of a person suffering from intense loneliness and mental illness. It always takes some adjusting when you're reading a book and it isn't what you'd thought it would be. The strengths of this work include the sense of claustrophobia as you move through the narrative. Sims does well in making us feel how the woman's world is shrinking as her grip on what is real loosens. There's almost a whirlpool like quality to the narrative. The main character keeps returning to certain thoughts and emotions and this creates a believable feeling of things spinning out of control. So once again, this is not a thriller. It's a book about loneliness, and what it can do to someone who is already fragile emotionally.My main objection comes from how tired I am of seeing female characters like this one (especially in thrillers, which is what I expected this to be, even though it wasn't in the end). How many more novels do we need with a central female character who is at rock bottom, who is desperate for a man and motherhood because she sees both as the only imaginable pathway to give her life meaning? At one point she observes herself, \"zero kids, zero husband, a woman-shaped shadow.\" I'm tired of this. I've read enough characters like this one that I'm actually starting to feel angry when I encounter another one. A woman so lonely that she is losing her grip on reality. That could be a very interesting, complex story. It was disappointing that Sims didn't create a character who felt new. Also, the ending is one of the most abrupt I've read in a while. I don't need to have things tied up neatly - far from it. This one felt jarring and a bit random. "}], "Genre": "Thriller", "ID": "36553406", "Desc": ""}