{"Name": "My Sister, the Serial Killer", "Image": "https://images.gr-assets.com/books/1523366732l/38819868.jpg", "Reviews": [{"Review": "My Sister, the Serial Killer by Oyinkan Braithwaite is a 2018 Doubleday Books publication. Genius! That provocative title and amazing cover art certainly piques one's curiosity. Noticing all the positive reactions the book received, I just had to see for myself if it was worth all the kudos. Well, I have to say, this is my kind of book!! Seriously, I really, really, really love satire and dark humor. I do understand it is often an acquired taste, but it takes a special kind of creativity and balance to pull it off. Dark humor and satire are often very subtle and if you aren’t in on the joke, it can sail right over your head. It requires a little more effort, from the reader, too, on occasion, and that is the case with this book.Family is supposed to help one another out, right? Set in Nigeria, amid a corrupt system of law and order, Korede is forever coming to the aid of her beautiful, but kooky, younger sister, Ayoola, who has a bad habit of killing her boyfriends. She always claims self-defense, but she’s never injured, and her conscience never seems to suffer. Korede, is a borderline, antisocial nurse, more comfortable around her comatose patient, to whom she bears her soul, than with anyone else. She has a crush on Tade, a doctor she works closely with. However, when Ayoola shows up at the hospital to visit her sister, Tade is immediately smitten with her. So, not only is Korede hurt emotionally, with her sister’s history with men to consider, this development is quite troubling. Deep down, Korede is angry, jealous of her beautiful, favored sister, but she always comes to her rescue. Ayoola is self-absorbed, flaunting her beauty, and appears not to notice the stress and strain she causes Korede.Both sisters are flawed, with abominable character traits, but at the same time, they both managed to, inconceivably, elicit sympathy from me. The author creates a unique brand of suspense, an ever- present sense of dread, while toying with the readers' emotions. The social commentary could be at the core of the story, perhaps playing a key role in the sisters’ pathos. “I cannot imagine her resorting to stabbing if that particular knife were not in her hand; almost as if it were the knife and not her that was doing the killing. But then, is that so hard to believe? Who is to say that an object does not come with its own agenda? Or that the collective agenda of its previous owners does not direct its purpose still?”There’s much to ponder on in this amazing debut novel. Kordede’s stoic inner thoughts stole the show for me, though. The story is meant to be dark, meant to be taken seriously, but so sardonic, it is morbidly funny at times. But, one thing is for certain, this author has done an incredible job creating these wickedly entertaining characters, adding rich layers to the story, while keeping the prose pointed and sharp, even minimal, and still manages to add the rarity of humor into the mix with perfect balance and poise. I simply could not tear my eyes off the pages. It is also a rarity for me to say I liked a book better than I thought I would, but this one caught me completely off guard. Overall, I am mightily impressed with this stunning, but unsettling debut, and yes, it deserves the kudos"}, {"Review": "4, the sisterhood of the traveling...serial killer stars!!!Full review featured on my blog Recipe & a Read!I finished this quite a bit ago, so I’m going to do my best to remember everything I thought about this book. This is at it’s heart a story about two sisters, Korede and Ayoola. Korede is pragmatic, level headed and sensible. Her sister Ayoola, is none of these things. Ayoola is rash, beautiful, vibrant, the favored child and deeply irresponsible. Oh, also – did I mention she’s a sociopath? Yeah, well that too. This story takes place in Braithwaite’s birthplace of Nigera and follows these two sisters through a series of situations Ayoola thrusts them into.You’re a big sister now, Korede. And big sisters look after little sisters.You see, while Korede loves her sister and protects her, things get a little out of hand as Ayoola continues to make choices that leaves Korede having to clean up her messes…literally and figuratively. Korede is a nurse, and above all her practicality is the sisters saving grace. She knows all the best ways to clean up blood, her trunk is big enough to fit a body and not only that but when Ayoola wants to do crazy stuff, like posting pictures of her food when she should be mourning her dead boyfriend, she stops her from that too. Korede is a good sister, if covering up your siblings murders is what makes you a good sibling.However, things change when Korede’s long time crush – a kind, handsome doctor who works at her hospital, Tade, asks Korede not for her number, but for Ayoola’s. Ayoola has shown no remorse for her actions, she’s simply moved on and is keen to get over her dead ex, by getting under some one new. As Korede stands helplessly by, watching Ayoola seduce Tade with her charisma, charm and beauty she struggles with her wish to leave this life and her obligation to look out for her sister. Korede, having no one to confide in, turns to a comatose patient and she grapples with the knowledge that if she does nothing – she is well aware of what the outcome of this new relationship will be.It takes a whole lot longer to dispose of a body than to dispose of a soul, especially if you don’t want to leave any evidence of foul play. This was quite a different type of story than I anticipated when I first added it to my TBR and when I first started reading it. At just 226 pages, this baby packs a serious punch. Not only that, but as Braithwaite’s debut novel I am left feeling incredibly impressed by the skill and finesse shown in weaving this story. The layered characters she created were fresh and vibrantly written – most notably Korede. Braithwaite wrote Korede in a way that you could deeply feel for her plight – especially if you know the bonds of siblings – but at the same time, I regularly found myself wanting to shake Korede as hard as I can and yell in her face “WHY ARE YOU DOING THIS, GIRL, THIS DUMB!”. This also had a very dark, campy humor that I found utterly refreshing.Ayoola has her knife on her, since she carries it the way other women carry tampons.In the end, I adored this story and am excited for future works by Braithwaite. However, there were a few things that left me wanting, just a bit. First, the chapters are very choppy. This is a short book, and I absolutely flew through it, but I wish the read had been a little more fluid and less jerky. While I appreciated the social commentary on societies obsession with beauty (especially since beauty, in general is fleeting and society equates beauty and youth) it did get a little tedious to focus on so much. I wish there had been just a bit more depth to their differences, instead of focusing so much on appearance. The ending quite surprised me, which I’ve found rare these days but I also wish this aspect had been fleshed out just a bit more. All in all, I think this is definitely one to add to your list, or read it if it’s already there!"}, {"Review": "Femi makes three, you know. Three, and they label you a serial killer. In case you haven't noticed, Oyinkan Braithwaite’s My Sister, the Serial Killer has been taking the social media scene by storm the past few weeks. And I get it; the cover art is (pardon my pun) killer and the title exudes a certain titillation that will make a reader quickly reach for the book on the shelf. For me, My Sister, the Serial Killer, was an easy, brisk read that I mostly read in one sitting. And I was additionally excited to read it when I realized that the author and I graduated from the same university in England and likely had the same creative writing instructors! The short chapters (some only a few sentences long) created the effect of breezing through the novel at record speed, which is a plus, but it also created a few issues for this narrative.Oyinkan Braithwaite’s debut novel follows sisters Ayoola and Korede – Ayoola kills ‘em and Korede cleans ‘em up. But this isn’t just a novel about the boyfriends falling like flies; it’s a novel about the trials and bonds of sisterhood, an exploration of childhood abuse and a would-be love story all wrapped up tightly in the culture of Lagos, Nigeria. Now, that’s a lot to try to cram into 240 (not even full) pages, but it can be done; I’ve even seen it done well. Here, I wasn’t mind-blowingly impressed by the execution (again, couldn’t resist!) of My Sister, the Serial Killer. If you’re a reader who puts a lot of weight on pace, you might find that you’re in for a rather jerky ride with this novel. It flowed neither at a lyrically smooth pace nor at a heart-pounding thriller pace. It just sort of jerked from scene to scene with very little, if any, narrative connective tissue to sew the chapters seamlessly together. In short, while it a had a great plot and an ending that did manage to surprise me, it was not written with a lot of finesse. It read, to me, like a very first draft, not quite filled in enough to give us readers an entire picture. It was like a well-done sketch of artistry that hasn’t yet been filled in with color, like the structure of a building that has not yet been painted and offered windows and balconies. Now, ONWARD to the pros that you’ll find within these pages, because there are several of those. For one, it was a plus that this novel read so fast. While the plotting was jerky, the pace was quick, and that pulls you in to the story fast as you realize that you’re already so deep into it with so little time spent on it. And one of the real gems of My Sister was how Braithwaite interlaced the heart-pounding narrative of the killings themselves with the humor of said serial killer’s indifference and feigned naiveté:\nThere is music blasting from Ayoola’s room. She is listening to Whitney Houston’s “I Wanna Dance with Somebody.” It would be more appropriate to play Brymo or Lourde, something solemn or yearning, rather than the musical equivalent of a pack of M&Ms.\n\tThis novel is fully current, with narrative tools and chapter titles like “Instagram.” Ayoola is addicted to SnapChat and Instagram, often being scolded by Korede for posting frivolous updates for her followers when she’s supposed to be mourning her missing boyfriend, whom she herself has killed. Ayoola has forgotten, just that quickly about the fallen men and goes on with her life in a way that baffles her sister – enter The Comedy. \tSo, while I wished that My Sister, the Serial Killer was better built out as a narrative, there is merit to it as a quick, amusing little read. It all comes down to what you’re looking for on your TBR. If you’re interested in a narrative set in Nigeria, this may be a great pick for you. If you’re looking for lightness and humor, a read you can breeze through easily that still offers some suspense, then you’ve absolutely come to the right place. But, if you’re more in the market for a side of intellectual stimulation with your killer thriller, then you may want to side step this one; you want find a lot of that here. 3 stars. ***I received an advance-read copy of this book from the publisher, Doubleday, via Netgalley in exchange for an honest review.FOLLOW ME AT: The Navi Review Blog | Twitter | Instagram"}, {"Review": "\"I can't pinpoint the exact moment I realized that Ayoola was beautiful and I was...not. But what I do know is that I was aware of my own inadequacies long before.\"Korede is a nurse in Nigeria, dedicated to her patients and well-respected by her superiors. But no matter what her achievements are, she knows she'll always play second fiddle to her younger sister, Ayoola. Ayoola is the pretty one, the favorite—and she's a psychotic murderer.One night Ayoola summons Korede to her boyfriend's house. Ayoola says he attacked her and in self-defense, she stabbed him. It doesn't matter what the facts really are—who would disbelieve Ayoola? Korede is the sensible one, the calm one, the logical one who takes charge of the situation. She knows how to clean up the blood so no traces are found. She knows how to get rid of the body. It seems she has had a great deal of practice with this sort of thing, since this is the third boyfriend Ayoola has killed.\"Femi makes three, you know. Three and they label you a serial killer.\"Ayoola isn't the slightest bit remorseful about what happened. She's ready to move on, find another man to charm. Korede thinks she should lie low for a while, even though she knows it won't be long before Ayoola bats her eyes and more men will come running. But this time Ayoola sets her sights a bit closer to home, as she alights on Tade, a handsome, kind doctor Korede works with. He's also the doctor that Korede has been secretly in love with, but she knows she's no match for Ayoola's charms.As Korede watches Ayoola ensnare Tade, she feels powerless and frustrated. What she wants more than anything is just to reveal her sister's nefarious side, but she knows Ayoola will turn the evidence against her. She wishes she could just escape this life, but she has an obligation to protect her sister. With no one to turn to, she vents her anger and fears to the only person who will listen—a patient who has been in a comatose state for years. But she knows all too well what will happen if she doesn't stop it.\"I am the older sister—I am responsible for Ayoola. That's how it has always been. Ayoola would break a glass, and I would receive the blame for giving her the drink. Ayoola would fail a class, and I would be blamed for not coaching her. Ayoola would take an apple and leave the store without paying for it, and I would be blamed for letting her get hungry.\"\nMy Sister, the Serial Killer\n is a darkly funny yet disturbing story of familial obligation. It packs a powerful punch for a book that is less than 300 pages long, and that is because Oyinkan Braithwaite has created two complex, fascinating, not necessarily likable characters. You get glimpses of family history in order to understand where Ayoola developed her murderous tendencies. You both feel for Korede and want to shake her for allowing herself to be so fully manipulated. More than that, however, you'll want to know how this book ends. I had lots of suspicions and wasn't disappointed where Braithwaite took her story. It's certainly a troubling book about a woman so fully overshadowed by her sister that she's forced down a path she never would have taken, but it's also commentary on how unfairly women are compared to one another, with the most attractive one almost always winning out.I really enjoyed this, and read the entire book in a day. It certainly is a bit farcical, yet at the same time, you could believe this actually might happen, particularly in a society that treats women as second-class citizens. Braithwaite's storytelling was dead-on (no pun intended), and I look forward to seeing what comes next for her career. See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"Review": "Now, that’s what I call a damn good story!Wow. Where do I even start? Firstly, the story, coupled with the setting, alongside the characters, all resonate at a level only a fellow Nigerian would understand. Besides all that, the plot itself is unique, the prose is crisp and evocative; the characters, multilayered. Then there’s that dry sardonic humour that Braithwaite sprinkles throughout the story, causing me to laugh out loud when I probably should have been aghast. Additionally, what Braithwaite does with the titular characters - the ditzy yet extremely manipulative “serial killer”- Ayoola, and her long-suffering, perpetually angsty sister- Korede, is nothing short of magical. Love, love, love!"}, {"Review": "If you appreciate dark humor with a side of social commentary this is the book for you! The novel is set in the author’s birthplace of Nigeria, and follows two sisters, Ayoola and Korede. Ayoola is beautiful, irresponsible, and has a habit of killing off her boyfriends. Korede is the older, less attractive sister who literally cleans up the messes her sister makes and protects her at all costs. Ayoola lacks self-awareness and goes about her life being adored and indulged due to her great beauty. As the eldest, Korede is loyal but underneath she harbors feelings of anger and resentment, which reveals itself in surprising ways. But what happens when Ayoola sets her sights on a man that Korede has feelings for? This is when things really get interesting.There is a backstory that helps to explain why Ayoola and her sister are the way they are, but the first-person narrative by Korede prevents us from delving too deeply into Ayoola’s psyche. It would have been nice to know more from other character’s perspectives. At 240 pages, it's a quick read and the dark humor and subtle social commentary keeps this tale from becoming grim. Nothing should be taken too seriously, as it’s the underlying themes that make this such a thoughtful novel. Topics such as the sibling bond, sociopathy, social media, abuse, and the role of women in a patriarchal society are explored. The book also led me to the internet to explore the Nigerian culture. I love it when a book inspires me to do my own little bit of research on a topic. I buddy read this with my friend Marialyce and this book generated some surprisingly deep discussions. I think this would make a terrific book club discussion book."}, {"Review": "FIVE STARS I LOVE THIS!!“Femi makes three, you know. Three and they label you a serial killer.”Ok, truth here--this is not a suspenseful thriller, despite the enticing title. It IS a novel about family dynamics, love between sisters and loyalty to the ones that matter in your life. The minute I started this short, richly dark and funny book, I was HOOKED! It is elegant and lovely, all gorgeous words on a page. Set in Nigeria, very up-to-the-minute contemporary, and oh so addictive! The story centers around a beautiful 20-something that is so alluring, every man falls in love with her at first sight. Unfortunately for them, our pretty girl tends to murder the man after she grows tired of him. Her older sister is the slightly bitter one, responsible with a full time job and a neatnik cleaning fetish. This comes in handy since her little sis calls her after every murder to help clean up and dispose of the body.DOES THIS SOUND CRAZY???? Yes, it is. And like I said, I love it!! I don't think it is for everyone, but if you are open-minded and adventurous in your reading, I highly recommend it! It is actually a very sweet story with just a bit of a sting.The audio version is superb. I could listen to that gorgeous Nigerian accent all day long!"}, {"Review": "4**\"You're a big sister now, Korede. And big sisters look after little sisters.\"Korede: nurse, responsible, plain, big sister.... and a meticulous cleaner. Ayoola: flirtatious, beautiful, reckless, selfish, a manipulator of men.... and a serial killer.Ayoola has killed before and each time, Korede has been there to clean it up. After the third kill, Korede wonders whether her sister did kill all these men in self-defense... but of course, she's the younger sister, of course it would be in self-defense, Korede needs to protect her younger sister in case the reasons for these crimes are misconstrued in court. However, one day, when Ayoola visits Korede at work, Ayoola takes an interest in the handsome Doctor Tade, someone who Korede fancies and knows all too well what happens to the men her sister dates. Stuck in a moral dilemma, Korede must decide whether to protect the one she liked or her blood. This was a story of a moral dilemma's, thrown in with a dysfunctional family and the occasional occurrence of fatalities. This was also a story of sisterhood, examining the sisterly bond and how far one will go to protect the other. It also shows the jealousies and differences between the sisters and how they are approached and treated differently by other people, especially the differences in treatment style by their mother.I thought this book was so interesting, being set in Lagos, it shows how these character's are trying to move against a society, and a traditional family, that expects women to conform to one traditional role; that is, to aspire to marriage and have children.In addition, the author makes good use of today's technology and social platforms, easily relating the story to today's culture.This book felt pulpy, witty and humourous in a black comedy kind of way. This was not a long book with only 200+ pages, but it was utterly unputdownable. The short chapters also aided in the impactfulness of the story."}, {"Review": "**3.5-stars rounded up**My Sister, the Serial Killer is a unique novella following the perspective of a young woman, Korede, living in Lagos, Nigeria. Korede is a nurse and seems to lead a fairly normal life; she is on the straight and narrow, if you will. 'Normal' until you discover that Korede's younger sister, Ayoola, kills all of her boyfriends and then calls on Korede to help clean up the mess!\"You're a big sister now, Korede. And big sisters look after little sisters.\" Apparently, this is the sentiment that Korede was raised with and now, no matter what her sister does, she feels obligated to PROTECT HER from everything. Protect her?!? The witch is crazy. She shows no remorse or empathy for the things she does. At one point, Korede muses, \"I am more haunted by her actions than she is.\" Yeah! No kidding!I did fluctuate throughout the story between feeling bad for Korede for all the bullshit she had to put up with and being angry at her for not standing up to her damn sister. It was like every other chapter, like a seesaw. Ultimately, I wish it would have gone a different way. I really was hoping Korede would make more growth as a character and fight back against the treatments and judgments laid on her. This is a novella though, very short, and I just don't think there was enough time for her character to get there.Overall, I felt the story was compelling, it definitely kept me interested and was unique. Thank you to the publisher, Doubleday Books, for providing me with a copy to read and review. I always appreciate the opportunity and I know a lot of people will enjoy this little tale. I look forward to seeing what comes next from Braithwaite. I like her style!"}, {"Review": "This book reads like a bowl of popcorn. Fresh, light, hot and salty. Each very short chapter going down with a crunch, my hand already reaching greedily into the bowl for the next. It's so very easy to read - but it contains complexity that satisfies. All at once it is mysterious, funny, disturbing. The current of feminism-gone-awry runs through it. Family ties that strangle. Korede is the responsible sister. Ayoola is the serial killer. She's the perfect black widow, beautiful and charming. She lures men into her web and then punishes them for their stupidity. Korede cleans up the mess. But for how long?I admire the way that this author walked the tightrope of satire, keeping the story from slipping into genre or farce. At no point does the reader feel comfortable or vindicated by the murders. In fact, we are disturbed - the victims are intelligent, kind, talented, nothing like a \"Dexter\" approved prey. But at the same time, Braithwaite's killer embodies a woman who is completely empowered. The opposite of victim. And that is something quite fascinating to see. An excellent debut by Nigerian author Oyinkan Braithwaite. Can't wait to see what she writes next."}, {"Review": "This book is a complete gem and I enjoyed every moment I spent with Korede and Ayoola! Firstly, I have never read a book that took place in Africa...Lagos Nigeria to be precise and it made this book much more interesting for me. Korede and Ayoola are sisters. Korede is the sensible one that makes her living as a nurse and also cleaning up after her sister Ayoola. Ayoola is flighty, addicted to social media, but mostly Ayoola is beautiful. No man can seem to resist her charm. Or, better yet, her appearance. The thing is that Ayoola bores of her men quickly and when she's done with you she is DONE with you and she may even get a little stabby to prove her point. When Ayoola has these moments of murderous intentions it is Korede to who she calls to help. The always efficient Korede comes to save her time and time again. But what happens when Ayoola sets her sights on the doctor that Korede is infatuated with? You'll have to read it to find out. Oyinkan Braithwaite, I adore you and your humor. You made these characters come alive. And THAT COVER is perfection! I'd like to frame it and hang it in my house. My only gripe is the ending. It was very abrupt and I'm going to spoiler tag this (view spoiler)[WHO IS THE GUY AT THE VERY END? Another of Ayoola's conquests? Was it Muhtar? I wasn't quite clear on this. (hide spoiler)] 4 stab worthy stars! Thank you to NetGalley and Doubleday Books for proving me with a digital ARC in exchange for my honest review. "}, {"Review": "\nCampy, weird, and off-beat\nI've struggled with how to review this oddly addictive book. I listened to the Audible version and the narrator was really enjoyable.  Her Nigerian accent added to the allure of the sister bond that was built into the plot and I loved how she pronounced their names, Korede and Ayoola.It isn't so much about Ayoola's little problem of killing her boyfriends, but more about the relationship of the two sisters and how she dealt with her in many wild situations. Korede is a nurse and ends up cleaning up after her sister.  Ayoola is the beautiful one and perhaps Korede is a bit jealous, but she feels a deep need to \"protect\" her little sister.Things get complicated when a handsome doctor named Tade has his eyes on Ayoola.  Korede wants to \"warn\" him about what may be in store for him.I did enjoy listening to this one, although it seemed a bit short and left me wanting more of a conclusion.I'm giving this 3.5 STARS rounded up to 4 for the intriguing narration!"}, {"Review": "How could you not be interested in this one? The title, the cover, the subject matter. I was sold immediately. I got the audio, rather quickly too from my library, and jumped right in.Two sisters. One a nurse, one a psychopathic serial killer. Korede works hard as a nurse. She is very frustrated, to say the least, with her sister. Her sister, Ayoola, is beautiful, she stops men in their tracks. Though, she is quite aloof. Men practically throw themselves at her. But....she's crazy and kills them on what seems like a whim. Is Korede jealous of her sister? Is she protective of her being the older sister? Perhaps a bit of both. But Ayoola keeps killing these men and asking her sister for help cleaning up her mess. You have to wonder if they are the way they are due to the abuse they suffered. Or are they both are just certifiable? It's quite the story, learning of the strong bonds of sisterhood.It's odd....but I really liked this one. I liked the sisters. The way the story is told, they seem like OK girls. Well, except for the whole murder/covering up thing. The chapters were short. Some, very short, perhaps a page or less. The story was told from the point of view of Korede. I listened to the audio and really enjoyed the narration. I was drawn in and did not want to stop. If anything, I wanted to hear more. Find out more of how the story of these two played out. A great read if your looking for something quick, strange, and a bit unique. Looking forward to more from this author!"}, {"Review": "3.5 starsHonestly, this book immediately drew me in, and has been rolling around in my head since its completion. Yes, it deals with two sisters, and yes, one of them is a serial killer. However, there is something alluring, something so sinister, and something that draws you through this short book to a conclusion that was totally bizarre, perhaps not understandable, and yet seemed to utterly fit.Ayoola, the younger sister has a penchant for killing her boyfriends, while big sister Koreed, has a penchant for covering up for her sister and protecting her knowing full well what she is. The ironic part is that other than protecting a murderess, Koreed is a nurse supposedly dedicated to preserving life. Yet, her sister takes precedence in Koreed's mind and heart and as her sister seems to be heading to more boyfriends's demises, Koreed stays firmly in her corner.This was such an interesting character study. One sister is crazy and the other one is not far behind, probably even crazier. The girls, whose father was abusive, seem to have coped with him in their own way, though Ayoola, the beautiful one, seems to be forgiven all her mistakes and is the sister some will \"die\" to love. Koreed, the ugly sister, stays in the background, the unloved, the unwanted, and yet she is the one who sallies forth always in defense of what most would categorize as the indefensible. Can this be love? The obvious question is how far would you go to protect the one you love? Would you venture into a world of murder to insulate the one you love from being brought to justice? Or would you just let the bodies add up, knowing that you yourself could stop this at any time.This was a buddy read with Jan. We were fascinated by the way this small book managed to worm its way into our imagination. Thanks to my local library for having this book on hand to lend to me!My reviews can also been seen here: http://yayareadslotsofbooks.wordpress..."}, {"Review": "Nifty debut novel for Braithwaite - and love that crazy book cover!Korede and Ayoola are sisters in Lagos, Nigeria. Korede is the older sister; sensible, practical, plain. Ayoola is the younger sister; flighty, charming, spectacularly beautiful. Ayoola has an unfortunate habit of murdering her admirers and depends on Korede to help her conceal her crimes. Only Ayoola doesn’t think of them as crimes, because Ayoola is a narcissistic sociopath. When Ayoola sets her sights on Korede’s secret crush, Tade, Korede has to decide if she will continue to protect her sister’s secret.Very well written, with sharp insight into the characters. This is a winner and a quick, riveting read. Highly recommend!"}, {"Review": "\"On their one month anniversary, she stabbed him in the bathroom of his apartment. She didn't mean to, of course.\" Braithwaite has written an exquisite dark tale about murder that bind two sisters together. I loved Braithwaite's sense of humor and sass in this mix of murder! Korede has always come to her younger sister Ayoola's side when she needs her even when it involves dead bodies upon dead bodies. The story starts out with a bang.... as we see already a murder that is being covered up by Ayoola and Korede. Talk about a kicker to this start of a novel! This story definitely packs a punch in this 180 page book! I would definitely recommend this novel to anyone that has an interest in human psyche, murder, and crazy characters! Overall, 4 stars for this unique and dark tale.Huge thank you to Doubleday and Netgalley for a copy of this arc in exchange for my honest thoughts.Publication date: 11/20/18Published to GR: 10/15/18"}, {"Review": "Find all of my reviews at: http://52bookminimum.blogspot.com/\n“Three, and they label you a serial killer.”\n\nKorede has always felt it was her responsibility to look after her younger sister Ayoola. Not only is Korede older, but she’s also the sensible one, the one with the good job. And while she may not be the “pretty” one – at least she doesn’t have a habit of murdering her boyfriends.Thus is the plot behind this compact little slice of fun. If you enjoy the stabby stabby over the bump and grind while sitting poolside, My Sister the Serial Killer might be right up your alley for a fun little time killer.3.5 Stars because that cover deserves at least a half star all on its own . . . . \nARC provided by NetGalley in exchange for an honest review. Thank you, NetGalley!"}, {"Review": "Well, it's true that this book is marketed so well , and has a very striking title and cover, which will grab your attention immediately. I was one of these people, who was beaten by this curiosity.While this book is a quick, fun read, I don't think the blurb is entirely correct. I was expecting this book to be darker, but in a humorous way. I was also expecting it to be about the sister being a serial killer, more. However, it reads like more of a contemporary to me. Oyinkan Braithwaite’s debut novel follows sisters Ayoola and Korede. Ayoola is teh beautiful sister who kills her boyfriends. Korede is the merciful nurse, who helps her clean up the mess. The book has more of this sisterhood bond, a bit of their childhood, which was full of abuse, and a bit of a love story. The book takes place in Lagos, Nigeria. Honestly, I couldn't say it's full of its culture. I wish there was more. Here comes the real problem of the book, its execution. For me it was really sloppy, chopped, with short chapters (some, even unnecessary). And this made the book extremely on the surface, with no depth in it.  It felt like this was a first draft of an idea of a new writer, and it had to be developed much more to become a book. All in all it could be an interesting idea, with a better execution. But, if you're looking for a book to read in one sitting, have a bit of fun. This can be an option. "}, {"Review": "Update: Powells Books has listed this novel in their \"Best Science Fiction, Fantasy, Horror, and Graphic Novels of 2018\". So Powell's evidently thinks this novel is \"Horror.\" Not farce. Not feminist satire. I agree with Powell's. The lightness of the novel, physically and semantically, makes it easy to forget that it is fundamentally a horror story, and the tension between the lighthearted writing style and the horrific story is what made this such an unsettling read for me.original review:This review is spoiler-y but nothing that isn't given away in the title, I suppose.My Sister, the Serial Killer is a perfectly-executed story about a woman who kills men, and a sister who helps her cover up her deeds. On the surface the story seems simple and straight-forward. The author moves us briskly from Death A to Death B, etc., with very little introspection or digression. The novel seems on the surface to be meant to be a bit of fun, a broad farce, a comical statement about two women living in a misogynistic world who have had enough. But the novel is far more than this. On almost every page, some kind of niggling subterfuge happens to us readers, where you are never quite sure what is going on, or who to believe, or how you are meant to feel about it. The novel never lets us slide into the complacency of \"it's just a story.\" The victims are kind men. One writes poetry and his family mourns him deeply. Another is a beloved doctor. There is a sub-plot where one sister treats a man with profound compassion, after his own family has rejected him, and this sub-plot further muddies the moral waters.As I read along, my \"hey, this isn't funny\" feeling increased. I grew uncomfortable with my complacent amusement at the role-reversal, where women are the dangerous aggressors. The lack of clear resolution to the story, at its end, left me stranded with a moral puzzle that has no clear answer. It left me thinking about how we readers have a choice, when we read fiction, to either think of a given story as a self-contained reality, with its own, self-contained moral rules; or to think of it as saying something about the real world. This novel's refusal to descend entirely into farce is what made it a great read for me."}, {"Review": "I wasn't quite sure what to expect with \"My Sister, the Serial Killer\" by Oyinkan Braithwaite but once I'd started to flick through it and read a couple of pages I was hooked and before I knew it, I was a third of the way through!Thoroughly modern and set in Lagos, Nigeria, this is a quick, enjoyable read that is dark, humorous and shows the bond between two sisters that stays strong no matter what....including murder.Every man falls in love with young and gorgeous Ayoola, the minute they set eyes on her. Fatally for them though, when she has grown bored of them she kills them and then calls her sister Korede to help clean up the mess. Crazy right? But with her sister a neat freak and a hospital nurse who better to call on to keep her secrets?This mad but exciting and thoroughly enjoyable read is addictive and has characters you can't help but endear to, both sisters have unusual qualities and the story was a pleasure to read.A completely original and unique premise that offers the reader a touch of humour to an otherwise dark and twisted tale, you can't help smiling at many of the quirky chapters and is guaranteed to have you turning the pages quicker than you can read them.If you're into intelligent, complicated and descriptive literary novels this won't be for you - this story is easy to follow with a simple storyline that's fast, enjoyable and leaves you feeling so glad that you've found such a fun read.4.5 rounded up to 5 stars"}, {"Review": "My thanks to Doubleday Books, and Netgalley for this arc.I really thought I'd love this book. It had some fantastic reviews on Goodreads. Turns out I hated it. I'm one of those people who have to have somebody to like and root for. I couldn't abide the sister's in this book. One bemoans her fate, and the other is a selfish, spoiled serial killer. One cleans up her sister's messes...ach! To hell with it. The book sucked. The writing was well done, and I'd read something else by this author. But, I need to like someone!"}, {"Review": "Audio – 5 stars. The narrator was incredible. She totally had the deadpan thing down pat. I had to mask so much of my laughter with fake coughing because I was listening at work.Story - 3.5 starsIt was entertaining but not what I was expecting. I see the word serial killer in a title, and I expect a lot of bloody/violent scenes, disturbing thoughts and/or some level of suspense, but they were minimal.As stated in the blurb, Korede cleans up after her serial killer sister’s kills. As much as she resents being the older, responsible, less attractive sister, she’s always covering up for her sister Ayoola. I never got a clear understanding as to why, Ayoola, the serial killer sister, kills her boyfriends. I can only assume it’s because of their abusive father. The story is given only in Korede’s pov. There are flashbacks and a lot of day to day happenings. I can totally understand Korede’s bitterness towards her sister, because Ayoola gets away with everything and her beauty makes her the favored daughter by their mother. Even the man that Korede has been in love with has eyes only for her sister. The ending felt abrupt and unfinished. Maybe there will be a book 2? If so, I’d listen to it. In my opinion, the audio is well worth the listen, I don’t know if I would have finished, let alone, enjoyed the story without it. "}, {"Review": "‘Ayoola summons me with these words — Korede, I killed him. I had hoped I would never hear those words again.’Thus begins Oyinkan Braithwaite’s debut novel My Sister, The Serial Killer. The book has had an interesting history. It first appeared as an ebook in 2017 under the title Thicker Than Water. Publishing rights were then quickly snapped up by Atlantic and it was published, physically, with its new eye-catching title, at the end of 2018. And what a title it is. I must admit that it's what first drew me to the novel when I came across a review of it at the end of last year. You have to applaud whoever came up with it, it’s a brilliant piece of marketing, because this novel could not be further from what its title suggests it is.Continue reading my review on my blog: https://liquidays.wordpress.com/2019/..."}, {"Review": "Ayoola summons me with these words - Korede, I killed him.I had hoped I would never hear those words again.The most important word in the above sentences is again. Three times now Ayoola has \"killed him.\" And, three times now, Korede has helped clean up the mess. Korede and Ayoola are about as different as two sisters can be. As Korede puts it, . . . Ayoola looks like a Bratz doll and I resemble a voodoo figurine. Everything about Korede smacks of the utilitarian: her angular shape, and her take-charge demeanor. She works hard as a nurse at the local hospital. Her younger sister Ayoola, well, she's another story: Hers is the body of a music video vixen . . . a woman who rarely hears the word \"no.\" Ayoola lives in a world where things must always go her way. It's a law as certain as the law of gravity. Men are naturally drawn to Ayoola, but she knows the score: \"He isn't deep. All he wants is a pretty face. That's all they ever want.\" But, sometimes . . . things go horribly awry, and she's forced to get out her knife . . .This was a fast, and fascinating read. Though the serial killer angle was interesting, it was the dynamic between the sisters that kept me turning the pages. I honestly had no idea what would happen next. What would it take for Korede to say \"no\" to her sister's manipulations? And, how would Korede respond when the one man she is interested in takes a shine to Ayoola?Truly, what are the limits to one's loyalty to a sibling?This was a fine, whip-smart read, and a surprising debut from a talented young writer. I'm looking forward to her next book."}, {"Review": "“Ayoola summons me with these words – Korede, I killed him.”Korede is a nurse, who is obsessed with cleanliness. That is quite useful where her beautiful, younger sister, Ayoola is concerned, as she has now killed her third boyfriend. Indeed, Korede has become adept at cleaning up after such crimes, and disposing of bodies. So begins this enticing, deliciously dark, novel. As the story progresses, we learn more about the characters, and why, perhaps, Ayoola – so enticing to men – just cannot seem to stop killing them. However, there is one man at the hospital, handsome doctor, Tade, who Korede secretly desires. Of course, though, once he meets Ayoola, he is instantly smitten. Can Korede keep him from Ayoola’s clutches? Can she keep him safe?This is such an original crime novel, which moves along at a fast pace, with short, sharp chapters. Braithwaite paints a picture of Lagos, where bribing corrupt police is seen as normal, as well as making the places within the novel feel extremely real – the family house of Korede, her sister and mother, and the hospital where she works. Ayoola is casually complacent, almost childishly sure of herself, while Korede feels she has to protect her younger sister, even when she is horrified at her selfish behaviour. I also enjoyed meeting the other nurses at the hospital and the coma patient who Korede poured her thoughts out to.I loved this original crime novel and would certainly read more by this author. I received a copy of this book from the publisher, via NetGalley, for review. "}, {"Review": "'Let's not just assume that a woman isn't capable of doing certain things, because perhaps she is, and perhaps we should watch out for her.'THAT'S IT, THAT'S THE BOOK. (Also that whole article by the author is all kinds of amazing and you should read it. Preferably after you've read the book.)LIKE I CAN'T BELIEVE I READ A 228 PAGES LONG BOOK, A DEBUT, AND FUCKING LOVED ITMy Sister, the Serial Killer is a bit of a mindfuck of a book with the only person who's really having any fund at all (while, the others are all clearly distressed LOL) is the female serial killer. I really loved Braithwaite's take on the subject and how the book is definitely funny in a gory way and does such great satire.Moreover, the characters of the two sisters, Korede and Ayoola, (and really, all the cast) are all well-developed and it's very clear to see where they're coming and possibly where they're headed. The trauma that they both went through and how differently they came through it and what bonded them and what drove them apart. Ayoola is not really an unlikeable character but she's also not likeable and I loved that because at the end of the day, she's a murderer and then there's her sister, Korede the main character, who has to deal with that fact and how she deals with is quite something in itself. HONESTLY, WHAT A BOOKAs for plot, it's a mix of old and new but not enough to make it predictable especially when it came to the actions of the character themselves.I loved all of the social commentary, the discourse on gender roles and physical appearances, navigating the world of social media and the relationship dynamic of Korede and Ayoola, which is the essence of the story. Also, then the fact that it's set in Nigeria and JUST ALL THE GOOD STUFF, 10/10 WOULD RECOMMENDFavorite quotes: 'It takes a whole lot longer to dispose of a body than to dispose of a soul, especially if you don't want to leave any evidence of foul play.''Who is to say that an object does not come with its own agenda? Or that the collective agenda of its previous owners does not direct its purpose still?''I wonder what the chances are that the death of a person in the company of a serial killer would come about by chance.'--------------One sister murders, the other sister cleans up the mess. HELLO, I WANT"}], "Genre": "Thriller", "ID": "38819868", "Desc": ""}