{"Name": "Girls of Glass", "Image": "https://images.gr-assets.com/books/1522805055l/38496213.jpg", "Reviews": [{"Review": "Let me introduce you to the players aka The Burke family: Sterling Burke - The most prominent judge in Florida. He's such a charming man that he has everyone from the mayor to the governor in his back pocket. Nothing bad ever happens to Sterling and nothing ever will. Hollis Burke - Sterlings wife and mother to Charlotte and Mellie. She rules the house with an iron fist and spews vitriol to anyone that dare disagree with her. A loving mother she is not. Mellie Burke - Oldest daughter, mother of 18 yr old Trudy, she spends most of her days self medicating with alcohol while laying about her parents house. Charlotte Burke - Youngest daughter, mother to 5 year old Ruby, a shell of a woman really. Her fathers favorite and her mothers nemesis. It appears the Burkes like to keep their children close. Why else would two grown woman and their children still live at home? Clearly something is amiss. Then one day Ruby goes missing and soon her body is found on the beach. Detectives Alice Garner and Joe Nakamura are called in to investigate. What exactly goes on behind closed doors of the Burke mansion? It appears everyone has secrets. \n\"It was curious how so often people saw only the surface of one another. They filled in the blanks they didn't know or couldn't understand with preconceived notions that had no grounding in reality.\"\nThe chapters alternate between \"Before\" and \"After\" where we get the perspectives of Alice, Charlotte, and Trudy. This was a little bit confusing at first but after a few chapters I was able to grasp the back and forth. While in the Alice chapters we find out in flashbacks that her own daughter was kidnapped and killed which is the driving force behind her solving this crime.I really enjoyed the banter between Detectives Garner and Nakamura. Garner is tough as nails after losing her daughter while Nakamura was the surprisingly kind and understanding older seasoned detective. They really seemed to have a deep connection even though they were complete opposites. My one complaint is that for some reason I never felt any real empathy for the Burke girls and I most certainly should have. It's a strange feeling when you read something like this but feel emotionally cut off from the characters. The book was a slow burn but an interesting one. The twist and the ending were a complete shock. Like, never in a million years would I have predicted this outcome. Well played! 3 stars! Thank you to NetGalley and Thomas & Mercer for providing me with a digital ARC in exchange for my honest review."}, {"Review": "***Thanks to NetGalley for providing me a complimentary copy of GIRLS OF GLASS by Brianna Labuskes in exchange for my honest review.***Alice, a detective, investigates the kidnapping of a five-year-old girl, five years after her own daughter was kidnapped and murdered.Based on what I enjoy and dislike about thrillers, I shouldn’t have been glued to GIRLS OF GLASS, holding my breath in anticipation. On the surface most of the characters were truly unlikable and unsympathetic. Ruby’s mother Charlotte and aunt Trudy made me cringe, until I got to know them. Then, I could root for them, hope they weren’t the perp, while still not actually *liking* them as individuals. Rudy’s physically and emotionally abusive grandmother and her grandfather who may have been worse were as one dimensional as villains can be, yet somehow I bought into their awfulness. My favorite character was Zeke and Trudy grew on me in the second half of GIRLS OF GLASS.Labuskes drops twists seamlessly into the plot, making sense while creeping me out. My theories on the perp never felt strong enough to make me certain. I didn’t see the very satisfying end coming.GIRLS OF GLASS is a must read, edge-of-your-sear thriller that I will reread to see which clues I missed."}, {"Review": "4.5 suspenseful stars for this taut thriller centered around the kidnapping of a five year old girl - a girl who is also the granddaughter of a prominent judge. When Det. Alice Garner catches the case, the similarities to the kidnapping and murder of her own daughter a few years prior start to bring up old emotions - in both Alice and me as the reader! I thought Labuskes hit it out of the park with this one and I was eager to find out who was to blame here! Thank you to Thomas & Mercer for an advance copy. All opinions are my own. "}, {"Review": "\"There was a human need to be known by others. It drove criminals to confession; it withered the souls of those who had no one to be known by.\"A very dark drama that simmers with hints of the revelations to come. Secrets and pain that overwhelm and result in the kind of tragedy that should never happen. What a story! Although this is, on one level, a detective novel, it's so much more psychological and domestic noir. It starts out with a kidnapping and ends with a shocker. NO SPOILERS.The Burkes are St. Petersburg, Florida, royalty. The patriarch is Judge Sterling Burke who has complete control over his 2 daughters, Charlotte and Mellie, and his granddaughters, Trudy and Ruby. His wife, Hollis, is a cold and calculating jailer, and nothing escapes her notice and scathing punishments. When Ruby is kidnapped and the police are called, it's detectives Alice Garner and her partner, Joe Nakamura, who take point on the investigation. Three women share the narrative point of view: Alice Garner, a recent transfer from DC to this beach town, she's still grieving after the kidnapping and death of her own 5-year-old daughter, Lila. She's emotional and fragile (and you won't be able to forget that because the author keeps reminding you). She is determined to figure out what is going on behind the Burke's mansion doors and to keep control of this case. Charlotte is the second Burke daughter and she's a bit of a mess with all sorts of psychological issues stemming from her personal situation in the home and the horrible circumstances surrounding her daughter, Ruby. And lastly, there's granddaughter, Trudy, who is only 18 but still has a little bit of strength and rebellion left inside. She adored Ruby and goes to great lengths to uncover what happened. At first it's a bit hard to keep all the characters straight and the shifting time frame with each new chapter, but it quickly falls into a rhythm.One thing that becomes obvious almost immediately is that the writing is so darn good. The author has a way with a turn of phrase that just jumps off the page. \"The Burke women were the snakes who couldn't bit the foot that stepped on them.\" Wow. And so many more that help with making the characters and their motivations become more clear -- \"It had already been her cage. Now it was her prison.\" I was so torn throughout trying to figure out what really happened to Ruby and who did it and why. Did I connect with the characters? Some more than others but many made decisions and acted in ways that I found hard to understand. The Burke women...well, I wish that the book hadn't ended as it did because I wanted to know the aftermath. The detective due was an interesting pairing as their personalities were night and day and Alice was an enigmatic mess who seemed to want it that way. Very interesting individuals.So, I really liked this one. It was the first I've read by this author but I intend to look up anything else she's written and delve into that. I like a slow build and surprise. Thank you to NetGalley and Thomas & Mercer for the e-book ARC to read and review. "}, {"Review": "Girls Of GlassByBrianna LabuskesWhat it's all about...Detective Alice Garner and her partner Detective Nakamura are thrust into the kidnapping of a young child who is part of a prominent Florida family. The crime resonates with Alice because her young daughter was also taken and murdered years ago. Alice can barely hold on as she and her partner get deeper and deeper into the lives of this family. There is an evil abusive mother in this family. The father is a prominent judge who has a less than stellar reputation. Two grown daughters...Mellie and Charlotte...and their children...Trudy and Ruby...live with them...obviously all under their mother’s control. My thoughts after reading this book...Wow! This book set a fast pace from the start and kept a fast pace with incredible twists and turns throughout. Hollis...was a most evil mother. Her grown daughters were under her control 24/7. She monitored their money, credit cards and comings and goings. Trudy...the teenager...is desperate to break away from this family. There is obviously some horrible secret within the walls of this house. Rumors about the father are everywhere but no one dares to confront him. From the start I got the feeling that the father was a predator and an evil one, too.What I loved best...The interactions of this family were what carried this book. Alice and her issues added to the suspense, too. By the time everything was disclosed I was reeling! What potential readers might want to know...This is a great story. It has all of the requisite twists and turns to keep a reader guessing about the ending. I borrowed this book from Prime Reading through Amazon. It was my choice to read and review it. "}, {"Review": "Why do I seem to love stories of kidnappings? Maybe to remind me to hug my children and grandchildren more often. But when this young girl goes missing and there is no ransom demand, police are surprised when her dead body is found several days later. Lots of suspects as the family is wealthy and connected, lots of hostility as the patriarch seems a little to close to the young females, and lots of questions about the internal dynamics of this odd and dysfunctional family. Add to the mix the two detectives investigating and one who lost her own daughter to murder years ago. Tensions run high but this book will keep you reading until you discover the killer. It's a whirlwind of a ride!"}, {"Review": "When you read as many books with varied plots as I end up doing in a single year, it is hard to surprised by the turns a plot might take. You anticipate the possible discrepancies in the narration by all the main characters and sometimes revel in being proved right and sometimes be disappointed by it.Sometimes, like in this case I do not see a lot of the book's story coming until it was too late, and I was surprised more times in this one book than I have been in the recent past in multiple ones!The story is told in a very random chronological order, moving forwards and backwards around the pivotal point of Ruby Burke's kidnapping. The see-sawing of the times was annoying initially but the ending proved why it was the only way the story could have been told. The beginning also had so many facts that should have been crucial to the outcome of the tale with the revelation of evil living under the guise of genteel local nobility. (All of this is revealed very early on, so I am not providing any spoilers) I say should have because it did not matter here and as the story progresses and things get murkier, it paid to read/listen till the end.It could have been shorter but the length does add to the atmosphere and gets you more invested in all their lives.Alice Garner and Jo Nakamura are assigned to the case and they spend sleepless nights worrying about all the dead ends. Each person in the Burke family, are dealing independently with the aftermath of the kidnapping. The only reason I was unable to give the full five stars to it was because I could not digest a few things that happen in the tale, and will find it hard to shrug off and resume the reading of another book nonchalantly. It lives up to the thriller genre and for those used to the emotions that come with reading a well written thriller, do give it a go!Unrelated reviews at : www.superfluousreading.wordpress.com"}, {"Review": "Oh my God!! How do I even start to review this book? This has been easily one of the best books I've read in this year, one of the best book I've read ever. Such a brilliantly written book, such a brilliant style of writing. The story was always fluid and never made me feel like it was trying too hard. It had me hooked from the very beginning. When the prologue starts like that, what else is supposed to happen! And another thing which I've written in many of my mystery/thriller book reviews, whenever I've been reading a book like that I've always been trying to figure out who the killer was and 7 times out of 10, I've guessed it correctly. But this one when the big reveal was made, the way my jaws responded to the force of gravity. it has rarely done so. I could have never ever guessed it and I was never able to in the end. And a tip of the hat to the author, the characters that she created for this book were absolutely brilliant. You felt sorry for the characters that you were meant to feel sorry for and you hated the characters that you were meant to hate. Brilliantly written wonderful book, This was my first book by Brianna Labuskes but most certainly will not be the last.. I want to give this book 5 million stars but since only 5 is available, 5 stars it is. A big thank you to NetGalley and Thomas & Mercer for giving me an opportunity to read this wonderful book as an ARC in return of my honest review."}, {"Review": "Oh my God!! How do I even start to review this book? This has been easily one of the best books I've read in this year, one of the best book I've read ever. Such a brilliantly written book, such a brilliant style of writing. The story was always fluid and never made me feel like it was trying too hard. It had me hooked from the very beginning. When the prologue starts like that, what else is supposed to happen! And another thing which I've written in many of my mystery/thriller book reviews, whenever I've been reading a book like that I've always been trying to figure out who the killer was and 7 times out of 10, I've guessed it correctly. But this one when the big reveal was made, the way my jaws responded to the force of gravity. it has rarely done so. I could have never ever guessed it and I was never able to in the end. And a tip of the hat to the author, the characters that she created for this book were absolutely brilliant. You felt sorry for the characters that you were meant to feel sorry for and you hated the characters that you were meant to hate. Brilliantly written wonderful book, This was my first book by Brianna Labuskes but most certainly will not be the last.. I want to give this book 5 million stars but since only 5 is available, 5 stars it is. A big thank you to NetGalley and Thomas & Mercer for giving me an opportunity to read this wonderful book as an ARC in return of my honest review."}, {"Review": "Does the audible narrator know that St Pete, Florida natives DO NOT have country accents? I mean that really bugged me with the audio bookI’m super excited this is set is St Pete because that’s my home town, but also I think it made me more critical because the audio book narrator gave them southern accents and that’s soooo wrong. They don’t have them and in fact they make fun of them. And St. Pete was also described as a nasty, drug infested place and that’s not true at all. It’s really awesome and everyone is open minded. I mean it has bad parts but what city doesn’t?  This is VERY VERY DARK *TW for child rape, child molestion, murder, physical and emotional abuse. I enjoyed the Burke’s parts of the story, I really didn’t care for Them but still thought the story was good. Trudy was a HUGE bitch allll the time and yes she had been through a lot and had a lot of anger but I just her like it made ZERO sense for Charlotte and Trudy to treat each other the way they did when they were in the same situation? The plot twist smacked me right in the face. I never saw it coming and I loved it!!!! This book was actually very entertaining even through its flaws and the ending is so worth it. "}, {"Review": "I was very excited to read a suspense book set in Florida. It had the makings of a great story with an unspeakable crime and tremendously flawed characters. The story itself was good with some nice twists. What detracted from the story was the setting. When reading a book you don’t realize how much that plays into a story until you read one that just doesn’t work. When picking an actual city that exists you need to have little landmark references even if there are only a few. This story was set in St. Petersburg and I came away feeling that it was a seedy place to be with no redeeming qualities which is so far from the truth. Even if it was just mentioning seeing the pink Don Cesar Hotel in the distance on the beach that would have helped. It would have been better to have the setting in a fictitious Florida city. Once I got into the heart of the twists and turns the book was better. Thank you NetGalley for a copy of this book in exchange for an honest review."}, {"Review": "The story of the elitist deranged Burke Family.Charlotte's daughter, Ruby is abducted and the Burke family is in turmoil. The patriarch of the family, Sterling, a judge who knows everyone and influences alot of high profile people...Hollis is the domineering hateful mother...Melle, is the drunk mother of rebellious Trudy. And Charlotte....Charlotte is a sad spineless mother of, Ruby. When Ruby goes missing, Alice and her partner are assigned to figure out: Who would do this?, Why would they do this? Everyone in the Burke family looks suspicious and everyone lies. What I really liked about this book is the story gave me so many juxtaposed feelings about this family and I questioned myself every chapter about 'Who Did It?'"}, {"Review": "I just didn’t find this compelling or page turning. I didn’t see the twist coming but I also didn’t feel emotionally tugged by the protagonist who spent a lot of time explaining that she was broken, damaged, and irredeemable. I never doubted her. So the twist, which should have been a surprise was not and, in fact, I found the motivation and connection so artificially constructed that it just didn’t work for me. John Grisham could have pulled this off, perhaps. You need carefully constructed characters with enough complexity that you care about them despite their flaws. Girls of Glass was too brittle for me in the end. "}, {"Review": "Dramatic and Surprising. ***SPOILERS IN 2ND PARAGRAPH***Throughout most of this book I wondered why Alice was constantly overwrought and pin the verge of breaking. Her daughter's murder had occurred five years earlier and she was an experienced homicide cop. I thought she should surely have been less stressed out and more able to detach while investigating the murder of Ruby, a child she didn't even know. I became annoyed with the author's insistently brittle portrayal of Alice, so much so that I played right into the writer's hands. She floored me with a surprise ending that, had I perhaps been less distracted by Alice's unprofessional lapses and self recriminations about repeatedly losing her cool, I might have seen coming. I enjoyed not realizing it until the last, though. I appreciated the plot much more after new information prompted me to replay events through a different filter than the one I used in my first reading.**Spoiler alert** It turns out that Alice didn't have closure regarding a man named Nathan Beckett. By tragic coincidence, one of Nathan's teenage buddies grew up to be a judge powerful enough to let Nathan off lightly on a murder charge. This fateful decision resulted in evil Nathan's freedom to subsequently kill again. He murders Alice's little girl Lila merely out of boredom. Nathan gets life in prison, where Lila's cop mother Alice can't make the deadly retribution she burns to deliver -- so she plots an elaborate revenge against the judge who let his twisted pal go. Here's where some readers might find the plot stretches a bit too far. Sterling is not only a crooked judge but also an incestuous child molester with a wife whose complicity makes her even more monstrous than he. Alice's plot becomes ever more complicated by the unwelcome realization that she must somehow try to help the deeply damaged victims of the most horrid parents imaginable, while still avenging Lila."}, {"Review": "I listened to this book on Audible. It is very long and wordy. I'm sure I missed some important information because it was easy to tune out some of the overly descriptive phrases. About a third of the way through I wanted to quit, but I kept listening. I wonder if I would have enjoyed it better had I read it and not listened to it. The reader used an artificial Southern accent typically used in movies. Picture \"Gone with the Wind.\" The reader voice for the main character was the worst. It sounded like a woman trying to sound like man; yet the character is a woman. Her voice for the children characters was cringe worthy. The main problem I had with this book was that it was unbelievable and unrealistic. I know that it's not a true story, but it's not the least bit believable. Maybe it's just for entertainment. There would have been a lot more investigation and evidence presented in a real murder case. The main character and her partner wouldn't be the only ones actively investigating this high profile murder of a little girl. I could go on and on, but I don't want to give too much away. Alice's character is the most unrealistic, and by far, the most annoying character in the book. Her detective character was cliche to the point of being absurd, from belittling \"rookie cops\" to hanging out in cop bars. I'm only writing the review because I invested so much time in listening the story, and I thought I might warn others. The ending made the rest of the book seem like a trick and a waste of time. That's just my opinion. If you don't mind reading a depressing book with cliche characters and predictable dialogue, you may want to try to read it but I wouldn't pay too much for it. Maybe wait until it's in a library. I listened to it for free with my Audible trial. "}, {"Review": "The elevator pitch: Female rage is all the rage. A female cop on a case that forces her to relive her trauma.Why I liked it: First because it's well written with gorgeous descriptive passages, even if the plot is expertly laid out, there is plenty of space for flourishes. Second, you can't help but judge a book by comparison. I recently read The Disappearing by Lori Roy, a very similar book: Based in Florida, a prominent family with a dominant pater familias, it deals with the disappearance of the daughter. But where The Disappearing was heavy-handed, sometimes vague, and tried to stuff too much story in the plot Girls of Glass has way more direction, it's a no fuss, trimmed down, gripping mystery, that uses emotional turmoil for its twists and turns. There is a slew of books, TV shows and movies dealing with female rage these days. What is interesting about this suspense novel is that it plays around with victimhood. The girls in this book are not at all made of glass, it creates that illusion, of them being weak and fragile, all the while offering interesting fully formed characters, that remaine opaque till the end, to then show you they are made of steel.What it is about: Detective Alice Garner and her partner Joe Nakamura are tasked to investigate the disappearance of the granddaughter of judge Sterling Burke, one of the more influential men in Florida. After the little girl is found dead, her mother Charlotte becomes the prime suspect. And Alice is confronted with her past: the death of her daughter."}, {"Review": "Girls of Glass by author Brianna Labuskes has a shocking conclusion! I could not stop reading this book once I started and when I realized the ... Wait I cannot post spoilers!! This is such a heart-rending story. Alice is a detective in search for answers regarding missing five-year-old Ruby. This case is especially hard for Alice because her daughter was abducted and murdered a few years earlier. She has purposed she will not let her past grief interfere with her pursuit of Ruby and later the murderers. Charlotte is from a wealthy family. She has tried to be the perfect daughter, but she learned at an early age that monsters are real and sometimes they live in your own home. Her daughter Ruby is missing and she fears for her fate and the secrets which have affected the choices she has made in their lives.Trudy is a teenager and lives in the home of her wealthy grandparents with her mom, her aunt Charlotte, and cousin Ruby. She knows what is like to be a prisoner in this home. She wants to escape her domineering grandmother, her nighttime monster grandfather, and her clueless mother. So much conflict in one home comes together to form the perfect storm for this whole family. The ending is riveting!Publication Date: January 15, 2019"}], "Genre": "Thriller", "ID": "38496213", "Desc": ""}