{"Name": "The Woman in the Window", "Image": "https://images.gr-assets.com/books/1528225499l/40389527.jpg", "Reviews": [{"Review": "\nWho knows what goes on in a family?\nOkay, I really don't want to misrepresent this book: The Woman in the Window is a pulpy, fast-paced popcorn thriller. It's not mindblowing or groundbreaking, but it is pageturning goodness. And it was exactly what I needed to get lost in right now.The premise is a little bit of The Girl on the Train and a little bit of The Woman in Cabin 10 (what is it with these girl/woman/wife titles?!), with an unreliable narrator, faulty memories, alcoholism, and the author playing around with our perception of what is true and what is imagined. My need to know what would happen kept me turning pages late into the night until I was physically incapable of keeping my eyes open a moment longer.The Woman in the Window treats a rather obvious plot element as a spoiler for most of the book, so I'll play coy too. It's about a woman called Anna who lives alone ever since separating from her husband and daughter. We're not told the circumstances of the separation, but we do know that Anna has a drinking problem and severe agoraphobia that prevents her from leaving the house.Housebound and drunk, Anna spends her days spying on her neighbours, until one day she witnesses something shocking in the window of the Russell's home. Everything begins to unravel when Anna attempts to report what she saw, and soon everything is being questioned: Did Anna hallucinate? Is it a combination of alcohol and pills? Can she even trust herself?The chapters are short and hard-hitting, making the fast-moving plot zip by even faster (\"This is the LAST chapter. Oh wait, the next is only two pages? Okay, this is the last chapter\"). I think the author does a great job of capturing both the fuzzy-headed confusion brought on by Anna's alcoholism and the suffocating claustrophobia of staying inside for almost a year. She makes for a pretty great unreliable narrator, and it is easy to feel her frustration when she can't even be sure herself if what she says is completely true.I also really liked how the author included Anna's passion for classic thriller movies. These offer interesting parallels with her reality and make you question whether something really did happen, or if Anna just saw it in a movie. Plus there's something a bit creepy about all these black and white flicks playing out in the background.The Woman in the Window is the kind of cozy psychological thriller that is easy to gobble up in a sitting or two. I didn't even mind that some things were obvious because the getting there was so damn fun and suspenseful. I'll be on the lookout for more from Finn.Blog | Facebook | Twitter | Instagram | Youtube"}, {"Review": "NO SPOILERSThis is a solid 4 Stars for me. It’s been awhile since I’ve read a psychological suspense thriller —-a surprise gift in the mail. My copy says a film is already in the making. I can definitely see this novel as a movie. It should be good! The book is good. There are a few other reviews about the plot already ....so I’m going to simply list some random thoughts about my experience reading it. ....I enjoyed the premises of this story. Anna Fox being a child psychologist with a psychological disorder herself was interesting: agoraphobia. ....I liked Anna ....I liked Anna as the narrator. She kept me reading through the dark hours of the night. .....Nothing was ever too chilling or too graphic. The one violent scene was pretty mild for a book like this.... which I appreciate.....I never thought Anna was looking out her window - with her camera in hand - just to be creepy. From the start - I suspected her looking out the window had another element- but nothing to do with the purpose of stalking, per say. It’s hard to explain, but it was a ‘feeling’ I had....yet she did look through neighbors windows.....There was one surprise that was ‘really’ big for me — so much so -that I said to myself: “HOT DAMN, how do you like those crackers”? .....The title of this book is great - and not ‘as’ obvious as seems from the start. .....EACH of the characters are developed enough - just enough actually - they ride along with us ( the reader) as we are trying to figure what the heck happened:1. To Anna2. To a neighbor.....The 5 Story house that Anna lives in creates a great atmosphere.....Anna’s pill poppin wine drinking throughout didn’t alter my basic impression of Anna. I always felt that she was level-headed, and playing with a full deck - ( no matter how much drinking she did).....but was I wrong?Hmmmmm I’m not sayin!For a psychological thriller......this was unputdownable for me.... but not in a nailbiting way. I didn’t find it slow - or riveting....rather quietly gloriously-awesome.***note: This book sounds 'long' with almost 450 pages --but.....they are 'very' short chapters.Some pages only have a few words. Its a fast read!"}, {"Review": "5/5 Stars. I am SO BLOWN AWAY BY THIS NOVEL. The Woman In The Window is an absolutely amazing debut mystery-thriller. I cannot recommend it enough.CW: agoraphobia, anxiety, depression, substance abuse/alcoholism, murder, death, griefMy favorite part of this novel is the writing style. A.J. Finn has the perfect sort of prose that forces you to think, “How can someone ACTUALLY think like this? How does someone forms the words to illustrate such a perfect passage?” This book is descriptive in a way I did not know ordinary things could be described. The writing is so beautiful. SO BEAUTIFUL. I am not the type of reader to get hung up on amazing vs. terrible writing, but I found myself pausing frequently while reading just to appreciate the sheer talent A.J. Finn possesses. I will literally read anything this man writes. Being honest, The Woman in the Window is a bit slow to start. I listened to the audiobook so I don’t have an accurate understanding of the book page-number wise, but it took quite a few hours for the plot to really settle in. I feel the best way to describe the beginning of the book is “mundane” – It’s normal, ordinary, typical. We follow Anna through her routine, isolated days for many chapters at the start of the story with few peaks in plot to keep the story exciting. That being said, I can’t truthfully say it was boring. A.J. Finn’s writing is so intoxicating that reading about Anna sitting at her computer was enjoyable. It is slow paced to start, but not at all dragging and still enjoyable.But of course, one of the absolute best aspects of the book is the immaculate plot. I love a thriller novel that has so many plot twists which all can convince me that the following twist is more believable than the last. Despite it’s slow pace, I felt as if I was at the edge of my seat for the entirety of the novel. I’m not the most prolific reader when it comes to thrillers, but The Woman In The Window is one of my favorites that I have ever read. This book was absolutely amazing. I want to recommend it to absolutely everyone. I’m confident that A.J. Finn has become a new favorite author of mine and I’m so excited for the film adaptation of this novel and his future works."}, {"Review": "I don't know if this is an unpopular opinion but I'm getting a bit tired of reading mysteries where the main female character is an alcoholic. I get it, it makes them unreliable (and relatable for some maybe?) but it's a cheap way of doing it. With that said, I'm usually not too difficult with mysteries. They just have to not do anything stupid (racism, sexism...), be entertaining and have twists I don't see coming.In this book, you're following a psychologist who went through something traumatic that left her agoraphobe and... an alcoholic. Sadly I saw the twists coming and some parts towards the end just didn't feel right.However, I definitely felt like staying home and drinking... and I don't drink so I guess something in there worked... maybe?If you're looking for what others have described as a \"popcorn read\" then this might be it for you!"}, {"Review": "3 STARSYou don't know how happy I was to get my greedy little paws on both the audio and Kindle versions of THE WOMAN IN THE WINDOW. My expectations were through the roof! Have you seen all those 5 star reviews? As it turns out, the book doesn't live up to the hype. Yes, it is as addictive as popcorn, I couldn't put it down. But, there are so many disappointing drawbacks that I couldn't rate it a 4 star read.For audio-lovers, do not waste your precious Audible credit on this one. It is absolute trash. The actress portraying our boozy, traumatized victim/narrator is chirpy and confident sounding. Talk about a mindf*k! It does not work. In contrast, a similar book, The Girl on the Train is sheer perfection on audio. At about 40%, I turned off the audio, opened my Kindle and aaaaahhhh...the world made sense again. You know how much I love my unreliable narrators and our girl, Anna, is a doozy. Although she is terrified to step outside of her home, all kinds of interesting events still manage to take place in her small neighborhood. She spies on the nearby residents out of boredom. She's a regular Gladys Kravitz (you know, from Bewitched?). We can't trust Anna's narration because she is depressed and suffering from a traumatic event. And she pops a lot of pills and glugs wine as a chaser. Yeah, her take on the neighbors is suspect at best. All this is great. Absorbing. But, you know those people that use too many words and make simple matters overly boring? AJ Finn is one of those kind of writers. My patience runs thin with passages like this:Frigid air seizes my body, so raw that my heart feels faint; storms my clothes, sets them trembling around me. My ears brim with the sound of wind. I'm filling up with cold, running over with cold.Ugggghhhhh. I think she's cold. The book is so long and repetitive. It has an interesting, yet heavily borrowed upon plot and there are a couple of major twists. The plot twists are predictable, you will see them from a mile away, but it is still fun to see if your hunches were right (they will be). Just one more thing. Finn shoves a ton of film references into the storyline. At first, I loved it. Then, it becomes too much. It's as if he's saying, \"I'm not borrowing plot lines, I'm just referencing them.\" Wink-wink. It's all too heavy handed and cutesy, we know what's really going on. There is not a single original concept about this book. Ultimately, underwhelming."}, {"Review": "4.5*\"Agoraphobia is an intense fear and anxiety of being in places where it is hard to escape, or where help might not be available. Agoraphobia usually involves fear of crowds, bridges, or of being outside alone.\" -NIHFor the past 10 months Anna has been trapped inside the four walls she calls home. She can’t bring herself to take a single step outside. No grocery shopping, no walks through the park, not even to pick a package from the front stoop. Anna is an agoraphobic. Her days are filled with pills to control her anxiety and other ailments followed by a bottle or two (sometimes more) of wine to wash it all down. Her life outside her home is only viewed through her Nikon camera, where she watches her neighbors’ daily routines. (Much to their chagrin).When she witnesses an attack in the home across the street no one will believe her. Not the home owners, not even the police!Anna begins to question if it’s a side effect of her medication, or is there a reason no one wants to believe her.This book started out very slow for me. With most of us saying “huh? I’m confused!” That confusion quickly cleared as the pace revved up. Soon I was in full speed thriller mode! What an incredible ride. A.J. Finn had me questioning everyone from Anna herself to a grandmother in Montana! Some of the twists were predictable - but that didn’t take away from my enjoyment. The big finale of a twist was absolutely perfect! Didn’t see that one coming at all! It’s a fairly long book but reads super-fast and keeps you glued to the pages! This is my favorite kind of thriller!!Highly recommend!A Traveling Sister read with Brenda, Norma, Susanne, Lindsay, Diane, Kendall, Jan and Holly!Thank you to Edelweiss, HarperCollins and A.J. Finn for a copy to read and reviewFor this review and our full traveling sister review please visit Norma and Brenda’s fabulous Traveling Sister blog: http://www.twogirlslostinacouleereadi..."}, {"Review": "oooh, goodreads choice awards semifinalist for best debut AND best mystery & thriller 2018! what will happen?so, add my name onto the long list of superheroes who are conflicted about their powers, moaning about how alienating it is to have superhuman abilities, how it is truly more curse than boon. because i have emerged from two weeks of debilitating illness physically enfeebled, but with a new power, like john smith in The Dead Zone - i can now call all of the twists. not one or two, but all. of. the. twists.and this does not please me, or make me feel superior or smug. in fact, it’s kind of like a little magic went out of the world. that’s not to say i didn’t enjoy this book - it’s a chewy psychological thriller with a good instinct for pacing and a juicy, if familiar, premise. basically, it’s Rear Window where agoraphobia is standing in for “broken leg,” and with another layer of unreliable narrator smooshed in by pretty much grabbing that drunk voyeur lady from The Girl on the Train to be the main POV narrator - a wine enthusiast on many prescription pills who cannot leave the house and whose main tether to the world is through the internet (which we all know to be the purest reflection of humanity), and spying on her wealthy neighbors through the zoom lens of her camera, when one night she witnesses a woman being murrrrdered; a woman she’s met and tentatively befriended, a woman she is told, after reporting the crime, simply does not exist. already, it’s got great bones, and i understand why this is being hyped up as THE book of 2018. for a debut, it’s very impressive - the claustrophobia of trauma-based imprisonment is palpable, and the narrator’s love of classic films adds to the fraught atmosphere where references and scraps of dialogue blur the real/fantasy line from the constant background presence of something hitchcockian flickering on her laptop. and even the reveal/withhold ratio is well-maintained, for those of you whose high fevers and persistent hacking coughs have not left you with advanced sensory perception.it’s a microwave popcorn book - fast and satisfying and buttery-slick, with SO! MANY! POPS! OF! SURPRISE! and even if you call every one of them, it’s still a satisfying treat. now i am off to brood some more about my magical burdens.come to my blog!"}, {"Review": "I had “The Woman in the Window” on my list to read, but thought it would be awhile before I got to it. But then I came across it on Audible. So I decided to use one of my credits for it. I am starting to enjoy audiobooks a lot more, though I do find them harder to review. I usually have a ton of post-it tabs in the books I read that help me keep track of things. With audio, I’m usually relaxing and don’t want to stop to make a note.Anna Fox was once an active child psychologist with a wonderful life. But after a traumatic event almost a year ago, everything changed. She now suffers from agoraphobia. Her home is her entire world…she no longer goes outside. Anna’s life now consists of old movies, a lot of wine (and prescription pills), and online chat rooms. But she’s also found another way to spend her time…. watching the neighbors through her camera lens. She knows everyone’s schedule; she even knows who is having an affair.Anna notices a new family has moved into the house across the street. They are the Russell’s, a married couple with a teenage son. From everything Anna has seen they look like the perfect family. But of course, looks are often deceiving. One evening, as Anna is watching the Russell house she sees something she’s was never meant to see, something horrible… and it sends her life into a tailspin.Did Anna really see what she thinks she did or is it possible she was wrong? Could she have hallucinated or had a bad dream? She doesn’t know who she can trust. She’s positive of what she saw but can she make others believe her? And if she’s right…could she be in danger too?To be honest, I had a hard time getting into the story at first. I wasn't connecting to the story and characters as well as many other readers did, which is fine as we won't all love the same books. I think I may have been expecting something different. I was a bit confused at times and although I eventually warmed up to the story and to Anna, it did take longer than I expected. I did enjoy the last part of the book so I am glad that I didn’t stop reading.There were some very good twists, though I did figure out a few things ahead of time. I did like how everything came together in the end with a twist that I did not see coming.Overall I thought this was a decent psychological suspense novel and I’m looking forward to seeing what A.J. Finn writes next."}, {"Review": "** Possible mild spoilers **Yet another super-hyped 'psychological thriller' which seems to think readers are innocents new to the genre... it's starting to feel like each new author just selects from a pack of established set pieces and gives them a bit of a shake hoping for something original. Here we have the traumatised, agoraphobic woman on a self-destructive binge of booze and pills keeping watch over her new neighbours and spotting a murder which the police claim never happened. Alongside that we have a menacing intruder in her house, online friends who may not be quite what they seem, a weird sexual encounter (what was that all about?), and the cliched climax where the insane psychopath confesses everything for no good reason other than to bring the book to an end. And how many times have we now seen the protagonist's traumatic secret used in other books? I'm afraid I spotted every twist and with so few characters it's not hard to guess the psychopath. It's a shame as Finn writes fluently, but, honestly, I was bored senseless with the agoraphobic narrator and her endless witterings about old films and how many bottles of wine she's drunk each day with her pills. If you read regularly in the genre, this is a hokey tale that you'll have seen before. I wish I'd resisted the hype. "}, {"Review": "A.J. Finn respins a contemporary version of Rear Window set in Manhattan, New York. This dark psychological thriller has the pill taking, wine drinking, ex-child psychologist, Dr Anna Fox, residing in a three storey home that is the sum total of her world. Anna, you see, is an agoraphobic, and cannot step outside her home, she has lived like this for 10 months after a mystery trauma blew apart her world. She lost her marriage, her family and her career, although she does spend considerable time in communication with her ex-partner and her daughter, who is in his custody. Anna spends her days engaged in various activities, such as chess and learning French. She is a old black and white crime noir film aficionado, that includes watching Hitchcock movies with their motifs that spill over into Anna's actual life. Anna gets her dose of the outside world by people watching, observing the lives of her neighbours, like the Millers, through her window with her camera. A new family moves in directly opposite Anna, Alastair and Jane Russell with their son, Ethan. One day she observes a shocking event taking place in the Russells home. However, no-one believes her, including the police, and the Russells deny the allegations. Anna is your unreliable narrator, can she really be trusted? As Anna's paranoia levels reach sky high, she finds herself in increasing danger. She finds her past history colliding in her horrifying present. This is a story of twists, short chapters, and a narrative that proves to be fast paced, full of fear, tension and suspense. An engrossing and highly entertaining read that succeeded in holding my attention throughout. Many thanks to HarperCollins for an ARC."}, {"Review": "3.5 Anna Fox, now living alone in her three story brownstone, well alone that is except for Daniel, her basement tenant. Her husband and daughter, are elsewhere, though she talks to them daily. A trauma in her near past, has left her an agrophobic, subsisting on items from the internet that can be delivered. Her main activities were watching Black and White movies from old, and peering into the lives of her neighbors. It is while peering through one of these windows, that she believes she is witnessing a dangerous incident. An updated take on the movie, Rear Window, perhaps. But is she, and why will no one believe her?The suspense and the wanting to know is a prevalent factor here. One just keeps turning the pages, it was rather engrossing, but.....the execution could have been better. There were things that bothered me, didn't make sense within the context of the novels. Some large plot points that just withered away after being so prominent, leaving me unsatisfied. Disrupted the flow of the story, and made everything that happened unbelievable. Did love the ode to the old movies though, and as I said it did draw me in, there were just a few things I could not overlook.ARC from Netgalley."}, {"Review": "It isn't paranoia if it's really happening... \nThe Woman in the Window\n is intoxicating, dark, and simply unputdownable. AJ Finn's debut novel is placed in current day, gentrified Harlem, New York City, where Dr. Anna Fox spends her day in her five-story townhouse drinking Merlot, spying on her neighbors, and mixing pills to numb her thoughts. She has theories and pseudo-storylines for her neighbors, each one being unique and different in their own way. When she is not photographing and spying on her neighbors, Anna watches famous black and white movies to pass the time and regularly checks in with her daughter and husband, who she recently has separated from. Anna suffers from agoraphobia, preventing her from leaving the confines of her house and limiting her ability to experience the real world effectively. Her hours, days, and weeks are consumed by fear and curiosity. When her new neighbors move in across the park from her house, Anna is intrigued at their anonymity. As she begins to investigate the story of her new neighbors, something horribly goes wrong. Anna witnesses something that shouldn't have happened—or did she?I won this ARC in a Goodreads giveaway and literally jumped out of my bed and yelled, \"YESSS!!!\" I immediately was drawn to the story because let's face it, spending time spying on your neighbors while drinking too much wine sounds like my Friday nights. I was curious to see how this story would develop and see what the hype was about. After getting hooked in right from the beginning, I figured out why. \nThe Woman in the Window\n will definitely not be for everybody. The initial pacing is moderate, to say the least. I wouldn't classify it as a slow burn however, because as the story progresses, the character development of Anna and the provided characters becomes ever more intriguing. Nothing is rushed or overlooked—everything is portrayed at exactly the right time. Why is Anna agoraphobic? What's her mental state like? How is she coping? What's going on in the outside world that she's missing? Who are all these people around her? These are just some of the questions that pulled me in while starting \nThe Woman in the Window\n and it kept me guessing until the end. \nThe Woman in the Window\n breaks away from the mold of some of the more recent in-your-face psychological thrillers that have been sprouting out more and more since the release of the book that shall not be named, and that's very refreshing to me. This type of psychological thriller really gets you in the mindset of Anna's psyche without throwing everything at you at once. As I've stated earlier, this book will not be for everyone. This thriller breaks the mold and sets a new standard—so buckle up 2018! Thank you Goodreads and William Murrow Books for my advanced copy."}, {"Review": "\"I am locked in. I am locked out.\"Anna Fox has more intricate layers than a double-decker BLT tilting towards the mayo. Ain't no toothpick strong enough to keep this one from skidding off the plate.Anna exists behind the shuttered doors and windows of her four-story home in New York City. Dark and dreary are the colors that paint her reclusive world both on the exterior and on the interior. Anna suffers from agoraphobia that keeps her locked in as a prisoner of her own home and of her own mind. Those mind gremlins have taken residence and Anna sedates them with plenty of prescription drugs. She sloshes around at the bottom of a Merlot bottle like an Olympic drinker.....takin' the gold every time.Day by day she locks into perpetual viewing of old black and white movies including Vertigo and Rear Window. Her only interactions with the outside world are through weekly home visitations with her psychiatrist, her physical therapist, and her basement tenant, David. Anna is separated from her husband, Ed, and their young daughter, Olivia, which brings about a lonely, suffocating existence. Daily phone calls just don't seem to fill the void.But one bright spot comes with Anna's monitoring of her neighbor's comings and goings. She uses her Nikon camera lens to zoom in for a closer look. Such an activity brings the outside world in and gives Anna a bit of control as to when and as to how long she wishes to view their movements. She becomes particularly attached to the Russell family across the small park.Enter: Bizarro World in Living ColorAnna's black and white movie world will suddenly take on techno color hues. With her up-close-and-personal camera lens, Anna witnesses something horrendous happening in the Russell's home through that window. Paralyzed with fear, Anna reports it. Let's just say that no one is buying what our Anna is selling. But, you and I the readers, we know the truth. But A.J. Finn will see to it that the truth comes in variations and all sizes......Wowzers! The movie rights have already been sold for this one. It's a winner. But I must honestly say that the pacing is all wrong. The beginning chapters are slow. We, the readers, circle around the storyline puffing up cushions trying to get comfy and ready. It's gonna take a while. Prepare for that. But then, it finally takes off. My other concern is the amount of pills and Merlot that Anna consumes on a daily basis. In the real world, she'd be face down, not breathing, and with carpet marks all over her face. I'll leave it there and hope the screen writers will nip and tuck.I encourage you to take this one out for a test drive. Cushions propped up, you might just be in for a surprise. And no Merlot required....."}, {"Review": "I'm between 3.5 and 4 stars.Paranoia, the destroyerSelf-destroyer, wreck your healthDestroy friends, destroy yourselfThe time device of self-destructionLight the fuse and start eruption\u0097The Kinks, \nDestroyer\nReading A.J. Finn's new, much-hyped thriller, \nThe Woman in the Window\n, I had lots of paranoia-related songs running through my head (including Garbage's \nI Think I'm Paranoid\n and the line from Harvey Danger's \nFlagpole Sitta\n which goes, \"Paranoia, paranoia, everybody's coming to get me...\"), but I felt the above lyrics by The Kinks described this book's protagonist perfectly.Anna Fox used to be a successful child psychologist. She used to have her life together—marriage, family, career—but 11 months ago, a trauma left her with agoraphobia, so she's been unable to step outside of her New York City home all this time. She spends her days watching black and white movies, playing chess and learning French online, drinking too much while ignoring or doubling up on her meds, and counseling others like her in an online forum for people with agoraphobia.She also has a bit of a photography habit, which stems mostly from her interest in watching what is going on outside her home, particularly in the homes of her neighbors. She's seen some pretty interesting things, including the recent afternoon activities of Mrs. Miller, who moved in across the street with her husband.\"Watching is like nature photography: You don't interfere with the wildlife.\"When a new family, the Russells, move in directly across the park from her, Anna is quickly transfixed by them. They seem almost perfect—husband, wife, teenage son. She meets the son first and then the wife, and is amazed at how much she enjoys the wife's company. And then one night, as she watches through their windows, Anna sees something her eyes cannot believe. She knows it's something horrible, something she must alert the police about, and even provide help herself.And that's the moment when everything turns upside down. Did Anna actually see anything, or was it a hallucination from her medicine or the old movies she has seen over and over again? What is she to believe, her eyes or those who tell her what her eyes have or haven't seen? What, and who, is real? Does she have anyone or anything to fear?This is a taut thriller that definitely hooked me from the get-go. I had a lot of questions as I read, and wondered how Finn was going to bring everything together. While I felt like the book borrowed a lot from other thrillers and even some of the old movies Anna watched, the suspense definitely gets under your skin, and you absolutely want to fly through the book to see what the truth really is. Throughout most of the book, Anna feels like an old woman, but that's because of her condition. I had to keep reminding myself how old she really was.I felt like the whole story took a little too much time to play out—there were only so many times I could handle Anna's drunken binges, her not being believed by those she trusted, and her intense paranoia, which pushed everyone away. But there are some great twists here, some I didn't quite see coming and one I suspected (which disappointed me), and much like many thrillers and crime novels, the perpetrator spends far too much time explaining themselves and their motivations.I read a lot of thrillers so I tend to be really cynical about them. This is a good one, and I'd imagine this one is going to have many people eagerly turning the pages and staying up late because they can't get enough! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"Review": "Who's that woman in the window?Dr. Anna Fox has spent the past 10 months inside her NY home. Her home is her safe place and she is too afraid to venture outside her door. She entertains herself daily with the following activities:-downing bottles of Merlot and popping pills prescribed by her physician-following the lives of her neighbors through the lens of her camera-playing online chess -watching black and white films from her large collection of DVDs/mostly Hitchcock with some themes that may later be back to haunt her-talks on the phone to her ex-husband and her daughter (who he has custody of)This is all fine and dandy until one day while \"getting to know\" her new neighbors through her lens, she sees something harrowing!So very clever!! Yet all the clues are set out if you can \"catch\" them! Beware that the beginning is a bit confusing and takes awhile to set things in motion, but even with that I couldn't pull myself away from the story. Very fast read for me! Not edge of your seat, but more like the pull of a magnet. Loved this one!Super time reading this one with Traveling sisters! Thanks to Edelweiss/Wm. Morrow for my arc."}, {"Review": "I'm really torn on this one, because on one hand I was able to see all the twists coming (see Karen Brissette's review for my similar feelings on this), and it was a long book to feel entirely predictable, but on the other it was still a fun, enjoyable novel and I whole heartedly embraced the inclusion of the black and white movies and Alfred Hitchcock favorites that I grew up on. I felt neutral on the narrator here; she wasn't a long term favorite but she didn't grate on my nerves either. Overall, I would count it a success and I'm floored that this was a debut novel. Eagerly anticipating the author's next work!"}, {"Review": "3.5 starsThis was a highly suspenseful, anxiety-filled, page-turning wild ride! The main character, Anna Fox, suffers from agoraphobia (hers is a fear of being outside). She can’t leave her home and finds herself obsessed with the “hobby” of keeping tabs on her neighbours by watching them through the many windows in her large house.I liked Anna, but found that after the halfway mark, her paranoia and constant coping mechanisms started to get slightly annoying. The author, A. J. Finn, did a fantastic job pulling me into Anna’s world – feeling her terror and contemplating her thoughts, but I feel that some of it became slightly repetitive.I found myself flipping the pages quickly as I was very curious to see how everything would come together in the end. My interest and curiosity was piqued from the very start. This was a Traveling Sister Read with Norma, Brenda, Susanne, Kaceey, Holly, Kendall, Jan and Diane. It was fun to discuss this one along the way, everyone having their own suspicions and theories. To find this review along with the other Traveling Sister Read reviews, please visit Norma and Brenda's fabulous blog at :https://twogirlslostinacouleereading....A big thank you to Edelweiss, William Morrow and A. J. Finn for providing an ARC in exchange for an honest review!Expected Date of Publication : January 2, 2018."}, {"Review": "Dr. Anna Fox used to have a successful life as a mother, wife, and child psychologist, but something happened several months earlier that has given her agoraphobia. She can have her prescription medications and endless bottles of wine delivered, so she never has to leave her house. If she does want human contact, she calls her estranged husband and the daughter that lives with him. Her physical therapist and doctor come to her. There is also the online community of other people battling agoraphobia.Anna spies on her neighbors, camera in hand, reminiscent of Rear Window, which is the kind of movie she watches endlessly—black-and=white classics with an edge. When she sees a neighbor in trouble and the police get involved, she is not a reliable witness. People who mix prescription drugs and copious amounts of alcohol rarely are. It gets to the point she doesn’t know herself what is real—and therefore, neither do we, the readers.I enjoyed the suspense of this novel. For more of my reviews, please visit: http://www.theresaalan.net/blog"}, {"Review": "This review is a hard one for me. I struggled with the first half of the book, only to be totally drawn in by the end. The book starts offs slowly, setting the stage. Anna Fox is a child psychotherapist who suffers from agoraphobia. As she’s trapped in her house, there’s not a lot of action to begin with. But that kind of works. But a little of that goes along way and I kept waiting for something to happen to turn up the pace. I definitely didn’t relate to Anna, but I also had a hard time finding her believable. The idea that she’d be able to consume multiple bottles of wine at one time, on top of prescription drugs and be able to speak or walk at all seemed unbelievable. I’d be comatose, not just slurring my words. However, I didn’t think of her as a stalker or a voyeur, I didn’t find her creepy that way. As the story goes along, I started wondering about some of the twists I assumed were coming. I correctly guessed the first big reveal well before it comes out. This book is a homage to old movies, especially Hitchcock and other film noir directors. But the movie this most reminded me of is a more recent one. I can’t name it without giving out a spoiler, which I refuse to do in a review. Flip side, I totally blew how I envisioned the ending. Grading this is hard. The second half of the book is much more engrossing than the first. It really took a long time to grab me. The first half of the book is barely a three, the second half is somewhere between four and 4 ½ stars. I listened to this and the narrator, Ann Marie Lee, did a great job. Her voice was a rainbow of nuances and emotions. But I’m wondering if this would have worked better as a book than as an audiobook. I find I like my audiobooks to be fast paced. I heard glimpses of good phrasing, something I always appreciate when I’m reading. Unfortunately, good writing is harder for me to appreciate when listening rather than reading. But that’s me, I’m definitely more visual than aural. So, in the end I'm going with a 3.5 stars. "}, {"Review": "In a nut shell... I wasn't that impressed with this debut.Dr. Anna Fox lives in her townhome in New York struggling with agoraphobia. She has taken on some unique activities to help pass the time.... drowning herself with Merlot with a mix of pills, watching her neighbors, playing chess, and an obsession with her black and white movies. In between Anna's struggles with her agoraphobia she talks to her daughter and ex-husband frequently. One day Anna is looking through her window and sees something horrifying. Anna is so determined to find out what she saw in the window.... and exactly what did she find?!! So.... bottom line I was really not that impressed with this one. I have seen raving reviews for it but here are some of the issues I had with this one:1) Black and white video obsession (this absolutely drove me insane and honestly this just made it so confusing for me to have random quotes from the movies that the author put in the novel)....... lost me completely2) Anna was getting on my nerves with her paranoia.. which I felt the story dragged on..... just get to the conclusion already.3) There were some surprises at the end but overall it was lacking BIG time for me. This was a traveling sister read. Please check out their amazing blog to see the full sister review :). Thank you to Edelweiss for the arc. Overall, 3 stars for this one."}, {"Review": "This book is a psychological thriller starring agoraphobic Dr. Anna Fox. Anna is a house-bound psychologist that spends her days drinking wine, popping benzos, watching films, and spying on her neighbors with the powerful zoom of her camera. One day, Anna is doing her usual snooping when she sees a crime being committed and her life is then turned upside down. This is the setup for this thriller and is all I'm saying about this novel, you must read it to find out what happens. I enjoyed the novel and experienced many thoughts and emotions while reading it. At the beginning I thought 'I'd love to spend my days like Anna relaxing at home' UNTIL the main character described the crippling aspect of agoraphobia and how the mental illness has limited her life and the lives of other sufferers like her. The author did a great job of chronicling the symptoms and thoughts of the main character, Anna's anxiety and powerlessness. It is extremely difficult to cope with a mental illness, however, the main character annoyed me at points because she did not help herself by constantly missing her doses, erroneously taking double doses, and mixing them with alcohol despite her Doctor's stern warning to NOT mix her prescribed medications with alcohol. However... if we didn't have conflict we wouldn't have a novel, right? Overall, I enjoyed the novel and recommend it to readers of thrillers and contemporary fiction."}, {"Review": "I loved it! This book has restored my faith in psychological thrillers and was a solid 5 star reading experience. It’s well-written, perfectly plotted, and riveting. I had trouble putting it down and became annoyed when life interrupted my reading – it didn't feel like >400 pages and I could have happily read it cover to cover in one sitting. Anna is a 38 year-old child psychologist with agoraphobia, who hasn’t left her home for over a year. Her husband left her some time ago, and took their 8 year old daughter with him, but Anna talks to them nightly. She spends the rest of her days and nights watching old black-and-white movies on TV, chatting and dispensing advice in an online forum, and spying on her neighbors, all while downing large amounts of Merlot with a concoction of prescription pills.  I loved the psychological aspect of the novel and being privy to Anna’s thoughts and actions as she struggled with depression and agoraphobia. I had enormous sympathy for her. One day, while spying on the neighbors across the street, Anna witnesses a crime, but, because of her alcohol and pill addiction, she has trouble getting the police to believe her – that and the fact that there is zero evidence of a crime, but compelling evidence that Anna is unstable and imagining things. In fact, Anna begins to doubt herself.  One of my favorite parts of the story was Anna’s love for old black and white classic movies, such as Rear Window, Gaslight, and Stranger on a Train, etc. Did Anna really see what she claimed happened, or is she blurring the lines between reality and what she was watching on her tv screen every night? The author does a marvelous job keeping the reader guessing. And this reader had an urge to pour a glass of Merlot and watch a Hitchcock movie ;-) There are twists along the way, all revealed at just the right time. I appreciated that the author didn’t insult the reader's intelligence by using one particular revelation (that I had already figured out) as a 'shocking twist'. I thought it was brilliant to plant the necessary clues along the way but not until the end do we see how they all fit together. And what a surprising ending it was! This is an amazing debut, and I’m not surprised that the movie rights have already been sold, as well as foreign publication rights. It deserves all the accolades it's receiving. I'm only sorry Hitchcock isn't around to produce and direct :-) This was a traveling sister read and we were split down the middle on this one and you know which camp I'm in :-) The review this book and others can be found on the Sister's blog:https://twogirlslostinacouleereading....*Many thanks to Edelweiss, the author A.J. Finn, and William Morrow publishing for a copy of the e-galley for review."}, {"Review": "If you are looking for a gripping book that will capture your attention and keep you turning pages late into the night, The Woman in the Window is for you! It's been noted the story is similar to The Girl on the Train; that's true, but I found this story much more exciting and engaging.Every part of this novel was just amazing. Anna was such a multi-faceted character. After leading a fairly \"normal\" life, she had undergone a series of tragedies in the previous year. Some of her reactions seemed completely typical, while others simply outrageous. The details of the catastrophe which lead to her agoraphobia are withheld until the end of the book. There were so many twists and turns; as soon I thought I had it figured out, something would completely change!I enjoyed the shorter chapters with each date listed as the focal point. Written from Anna's point of view, we closely witness her mental battle with herself. The book is a beautiful rendition of her struggle to simply survive, especially when her entire world is only her house. I received this book as a giveaway through GoodReads and William Morrow for an unbiased review. Thank you so much for this opportunity! I highly enjoyed this book and would recommend to all readers of psychological thrillers and mysteries! "}, {"Review": "ليس أقسى من الوهم الذي قد نبيعه للناس، إلا الوهم الذي نبيعه بأنفسنا لأنفسنا؛ فنصدقه ونعيش عليه..!لكن صدقني، ليس هناك لحظة في الدنيا تعدل لحظة تحررك من هذا الوهم إلى الأبدكرواية جريمة مشوقة فمن المحتمل أن تعجبك، لكن لو قاسيتَ معاناة البطلة مثلما فعلتُ فالأكيد أنها ستغير فيك كل شىءبعد شهور، ربما سنوات، سأنظر إلى المسار الجديد الذي اتخذه قلبي وعقلي، سأنظر إلى حياتي كيف كانت وإلام صارتوسأعرف أن تاريخها الحقيقي بدأ يوم أنهيتُ فيه هذه الرواية، وودَّعتُ تلك المرأة في النافذةكل الشكر للصديقة العزيزة ناهد على الترشيح الجميل، ولرفيقة القراءة الرائعة هدير على مشاركتي الرحلة 17.06.2018"}, {"Review": "Women, girls... they are everywhere, man. They’re in cabins, they’re on trains, they’re in spider’s webs or hornet’s nests. Sometimes they’re gone. Sometimes someone let them go. Sometimes they’re in a group. In this case, there is a woman in a window. She’s not a woman or white or a lady in shadows or a girl who circumnavigated anything. She’s just a woman named Anna Fox in a window. And, like all of her friends from all those other books, she likes to drink a lot. And, just like her friends, maybe she’s crazy! She is so unreliable! The drinking and the agoraphobia and all! Who can trust her? Oh boy oh boy this feels just everything else, doesn’t it? This sounds like every other book you’ve read in your life these days. A girl, a woman, some other pronoun like “you” or “I” in the title. You’ve been here before. You’ve seen this trick too many times. Who is this A.J. Finn person and what makes them so special coming out here in 2018 with a title and a plot we have all seen dozens of times already? More importantly, how does this A.J. Finn person manage to breathe new life into something that I vehemently hate? I mean it is well documented all over Goodreads how I often find these books to be OK best, and that’s rare. Now, here I am cranking this book on up to 4 stars like a total hypocrite. I get it. It’s fine. This is a perfect summer read. I read it on a plane, but it would mix well with a beach or mountain. Whatever you wanna do. It is extremely fast paced, edge-of-your-dear kind of stuff. Very light and easy to breeze through. The plot twists and turns (although some of the big twists feel like something you already knew) are plentiful and press on to the very end. The ending tire everything up nicely, and while not too jaw dropping, it was satisfying. Finn also got me with the constant classic movie references and Hitchcock stuff. Anyone else feel like watching Rear Window or Vertigo now? I should go back and make a list of all the movies referenced in this thing. So yeah I enjoyed it. I felt like it was a cut above other psychological thrillers in this day and age. I went in not knowing much of the plot and with an open mind, and I am glad I took the time to knock this one out. Give it a whirl this summer while you’ve got some time to just escape for a bit and sink into a good Hitchcockian tale about another woman in another window. Thank goodness she wasn’t on a train this time. "}, {"Review": "3.25 Stars* (rounded down).Anna Fox is home bound. She hasn’t left her home in almost a year. She has groceries delivered and keeps all the windows closed. She watches old black and white movies, takes anti-depressants and mixes them with alcohol, lots of alcohol - which her doctor has strongly advised against. Besides watching old movies, her only other source of entertainment is watching what goes on outside of her windows. Sneaking peaks of her neighbors activities. One day, what Anna sees outside of her window blows her mind. A woman, her neighbor’s wife, who she met a few times before, getting stabbed and falling to the floor. Anna calls the police. They don’t believe her as they investigate and everything checks out. Her neighbor’s wife is alive and well. Yet as it turns out, nothing is as it seems. The Police think Anna is simply a drunk, who isn’t quite herself - and they think she who imagined the whole thing. Anna begins questioning herself and when strange things begin happening to her, she wonders if she is, in fact losing it. Who can Anna turn to? Who can she trust? Can she trust herself? For Anna, there is only one way to find out. “The Woman in the Window” started out slow and was a little confusing at first. Though the story then picked up, it started to drag for me at about the midway point and unfortunately I found the novel to be full of plot holes, which affected my enjoyment of it. This was a Traveling Sister Read. It included Brenda, Norma, Kaceey, Lindsay, Diane S., Jan B., Holly and Kendall. The sisters were split down the middle for this sister read. It made it lots of fun. Thank you to Edelweiss, Harper Collins, William Morrow and A. J. Finn for an ARC of this novel in exchange for an honest review. Published on Goodreads, Twitter and Instagram on 12.18.17.*Will be published on Amazon on 1.2.18."}], "Genre": "Thriller", "ID": "40389527", "Desc": ""}