{"Name": "A Killer's Mind", "Image": "https://images.gr-assets.com/books/1526358406l/37647561.jpg", "Reviews": [{"Review": "\n3.5 stars “Corniest serial killer ever.”A Killer’s Mind is an entertaining, easy to read thriller about “the corniest serial killer ever.” This book is full of snarky characters, wacky murderers, and quirky characters (including a cat and fish). \nZoe Bentley, a forensic psychologist who consults for the FBI, has a unique connection to her job. She loves what she does for a living, which allows her to get inside the sick and twisted minds of psychopaths and unlock their motivations in hopes of helping the FBI identify them. When a serial killer in Chicago begins embalming victims, Zoey, along with agent Tatum Gray, are brought in to help local police stop the sick and twisted killer before it’s too late.Told in alternating point of views, this is a fast-paced read that doesn’t waste any time getting into the nitty-gritty of the crimes. If anything, it moves too quickly as it doesn’t really allow the reader to unpack many nuances. At the same time, I enjoyed this element as I often read this after work and needed a mindless diversion from reality! I chose A Killer's Mind as one of my Kindle First reads and went into it with zero expectations. I was quickly drawn by Zoe and Tatum’s snarky wit, as well as by the demented killer’s POV. Zoe and Tatum have great chemistry, but I am not sure if I would like a romance to develop between them. It seems as if this is going to be a series, and the ending left me looking forward to the next installment. Overall, A Killer’s Mind is over-the-top, mindless fun! "}, {"Review": "My first venture into the world of Mike Omer’s writing will surely not be one I forget. A serial killer novel that flips the genre on its head, Omer keeps the reader guessing throughout, in a piece that loses no momentum the deeper the plot. Dr. Zoe Bentley is an accomplished forensic psychologist with a passion for her work. When she is contracted to consult for the FBI, she leaps at the opportunity, getting neck-deep into a case that has been chilling Chicago to its core. While the local profiler scoffs at her ideas, FBI Special Agent Tatum Gray takes a liking to Bentley’s quirky side, though is kept in his place throughout the investigation. Someone has been murdering women and leaving them on public display, but not before embalming them, a unique act that has dubbed the killer the Strangling Undertaker. While investigating, Bentley cannot help but think back to a string of serial murders from her youth, which shocked her small town in Massachusetts. Bentley was sure she could identify the killer, but no one would listen to a teenager at the time. Back in Chicago, the killer seems to be getting sloppy and is almost caught, offering up a number of digital breadcrumbs on which the authorities can capitalise. When Bentley’s past and the current investigation collide, she cannot help but wonder if the horrors from two decades before might be rejuvenated, allowing a killer to whet their appetite again. Omer chills the reader to their core and provides the perfect mix of action and killer perspective to ensure the reader will come back for more. Those who love serial killer thrillers (what a tag-line for the sub-genre!) will want to keep this one on their list.With the rise of certain television programmes, FBI profilers tend to be protagonists that are appearing throughout novels of this genre. That said, while anyone can spout out theories and ideas, it is the killer who deserves the praise, should they be thoughtful enough to provide a unique approach to crimes. Readers want to see new and intriguing ways to have their spines tingled, while trying to see what clues are left for synthesizing. Mike Omer does both very well and was able to keep me hooked, wondering throughout each passing chapter. Introducing Zoe Bentley’s character with such a backstory did much to convince me this would be a novel worth my time. I found her to be not only well-grounded throughout the investigation, providing both a serious and lighter side, but also to have a lovely, if dark, past as a teenager, which surely got her interested in all things serial killer. Omer balances these well and mixes them throughout the narrative, helping develop an attachment for the reader. Tatum Gray and some of the other characters laid the foundation for what could be a great series, should Omer continue with his strong FBI pairing, though there is likely a twist or two coming by next summer. The story was strong, yet did not get bogged down in too much psychological analysis, providing readers from all walks of life to feel comfortable navigating through the novel. Things flowed well and there were enough moments where the story took a twist so that the reader could not predict too much as things developed. Having not read any of Omer’s earlier work, I cannot comment on whether this venture into the genre is new or surprising, but I will say that he has made a fan out of me and I will keep my eyes peeled for the second Bentley instalment next July. Kudos, Mr. Omer, for entertaining and educating in equal measure. You’ve made a fan out of me and I would venture that many others who take the time will sing your praises too!Love/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"Review": "Like many books in this genre, “A Killer’s Mind” began with a description of the killer at work, putting the finishing touches on his latest conquest. What was refreshing was that author Mike Omer gave us just enough of a taste in the first chapter to entice readers to keep turning pages.The author introduces us to Zoe Bentley, a forensic psychologist who is good at her job but doesn’t feel she gets the recognition she deserves. Tatum Grey is an FBI agent, “promoted” to his current position due to an event that the author purposely shrouds. The shadows in both their paths are initially left hidden, creating curiosity. Despite their faults, I found myself liking both of the characters.Mr. Omer tells the story through multiple eyes, giving us a chance to experience the story from Zoe and Tatum, as well as sharing occasional glimpses of the killer. It was interesting for the author to develop the character of Zoe with flashbacks to her high school days during a time when a serial killer was terrorizing her community. The book has a good, even flow to it, the action proceeding at a steady pace and the police procedural aspects carrying a realistic feeling. This is a story that you can sink your teeth into, and I never got the feeling that the author would let me down by introducing surrealistic twists or having Zoe or Tatum do things that were drastically out of character. For those concerned about language, Mr. Omer has managed to craft a book that features very little cursing or swearing, relying more on his talent rather than shock value.Overall, an entertaining read, and definitely a positive start to a series. Five stars."}, {"Review": "4.0 Stars—- I just finished my first book by Mike Omer and for the most part I thoroughly enjoyed it. The book tells the story of FBI consultant/psychologist Zoe Bentley and her work assisting the FBI and Chicago police in working the case of a serial killer with the worst nickname ever —-“The Strangling Undertaker.” Bentley is assigned to work the case with FBI agent Tatum Gray, who is an enjoyable cut-up and the antithesis to the no-nonsense, no-fun, all work Bentley. The book alternates between the current case and a case from 20 years ago (when Bentley was 14) in which Bentley was personally involved in solving a different serial killer case. Although it is obvious to the reader she solved this case, the police do the dreaded ‘don’t take her serious because she’s a kid’ routine and blame it on someone else. These two investigations inevitably come together but with some very different outcomes and twists. Personally, I believe this is why I enjoyed the book so much. Just when I thought that it was going to turn into a boring book that I have read 20 different times with 20 different names, it surprised me by going in a totally different direction. It also has one of the better climactic scenes to bring the story to an end I have read in quite a while. If it wasn’t for some typical stupid local law enforcement overreactions and one completely ridiculous out of character Bentley field trip, I might have given the book the full 5 stars, but a solid effort nonetheless. "}, {"Review": "Pretty good but predictable ending.A Killer's Mind was one of those kindle books that jumped at me. Having no idea what it was actually about - I was still intrigued to read it. Yes, I am one of those people who barely reads the synopsis before clicking the book. It usually ends up being a good.. but for the terrible ones. Well, I end up having trust issues with myself.In this book, you will meet Zoe. She basically grew up around murder mysteries. In the town she grew up in, three murders happened. However, they quickly stopped once the \"murderer\" committed suicide. Since then she went to school for psychology and ended up working with the police on murders/crimes. Then the day that she meets the new agent, Tatum Gray, does her world sort of get flipped upside down. She's thrown right into an interesting murder case. One that makes her think of her hometown murders and the guy she always saw as the suspect.Of course, this book gives you some twists and turns.. and I was trying to figure out if there was more than one case or murderer in this book. Again, my mind was all over the place in this book and still the ending was predictable! I just knew that it was going to happen because of all the little clues throughout the book. She poked the bear.. and the bear poked back.I can't wait to dive into the next book."}, {"Review": "full review...A Killer's Mind was easily one of the most 'surprise-reads' I've read all year! The book is a real page turner, and I can't recommend it enough for all suspense-murder-thriller lovers!The book came to me as a freebie with 'prime book of the month', and I literally picked it up in a whim! You know they say never judge a book by its cover or title...but that's exactly what I did! 😂The book tells the tale of 'Zoe' a forensic psychologist, who works in conjunction with the FBI, in trying to solve an ominous serial killer. The killer is a real sicko-scumbag, who kills women, rapes post-mortem and 'embalms' them just for shits and giggles! 😬😱The book is brilliantly crafted, and the suspense mounts throughout the story organically. The author Mike Omer, did his research and through nitty gritty detail of the embalming process, the reader feels 'entrapped' into the murders! Also, Zoe the protagonist is quite fucked up herself, with a messed up childhood which involved a murderer in her home town. Omer flashbacks constantly, and gives the reader tidbits of Zoe's past and the murders involved in her childhood...the results are powerful and completely relevant to the present story.  A Killer's Mind, easily surpassed ALL my expectations and provided non-stop suspense thriller, and a nasty serial killer that doesn't shy away from 'Hannibal Lecter'! 4 1/2 Stars"}, {"Review": "I really enjoyed this book! It is one of the most interesting and entertaining books I've read this year. I wish I could give half stars (I find myself wishing this a lot), but this book for me is 4.5 stars. The basic plot isn't anything new, but it was well written and for me it had just the right amount of suspense. There is a serial killer on the loose and the FBI is sent in to assist a police department. Of course the agent is set up to be a rogue agent with a problematic past and the police are somewhat resistant to assistance. Adding a twist to the mix is a forensic psychologist who is a consultant for the FBI and sent to help with the investigation. The Pros: I thought at the beginning that I was not going to like the FBI agent Tatum. From the book description it seemed like he was going to be obnoxious and full of himself. But in reading the book he wasn't. He was very likable and played the partner role well. He also had a soft side evidenced by Freckle the cat and his grandfather. I would have to say that Tatum was actually my favorite character...next to the cat! The forensic psychologist, Zoe, was quirky and had few social skills, but this worked to make this more interesting than the standard whodunit serial killer story. I also enjoyed the pace of the story. It took them quite some time to find the killer, but the story was never boring. The amount of time it took to find the killer gave the story more credibility in my opinion. There were mistakes made and a lot of time spent trying to find the killer's motivation. On tv or other books there is some \"genius\" who puts things together quickly and everything is solved, but that is clearly not how it happens IRL. There was a plot twist and portions of the book are in flashbacks. The book never gets confusing and the flashbacks were integral to understanding more about Zoe. I did figure out who the killer was before the reveal, but that didn't impact the enjoyment of the story. Tatum and Zoe have good chemistry and I liked the fact that the author did not immediately throw them into a relationship or into bed together. I think that is probably going to happen at some point if these stories continue. Note to the author  Mike Omer, when that happens, I hope that it is handled with the right amount of awkwardness on Zoe's part and the complimentary amount of patience, understanding and sarcasm from Tatum. I'm not even into romance novels, but these two getting together after the right amount of build up and tension...yeah, I'm here for that!The Cons: There were two points in the book where I didn't like how something was handled, but neither effected my overall enjoyment of the book. One being how casually Zoe showed pictures of the crime scene and suspects without any approvals, which seemed like it would be against some type of protocol. The other, when Zoe decides to go off on her own and of course it doesn't work out too well. Just once I'd like an author not to use this, the reader knows that something is going to go wrong because it always does. Without giving too much away, I would have preferred for that sequence of events to have taken place in her hotel room, apartment, etc., someplace where she should have reasonably been.I would recommend this book and I can't wait until the next book."}, {"Review": "I picked this up on Kindle First and had no expectations of it. This was an intriguing story about a serial killer who tries to embalm his victims to keep them with him as long as possible.Zoe is a psychologist who is working as a profiler with the FBI. She met her first killer at the age of fourteen, but no one took her seriously. As she gets closer to this current killer she starts to see a connection from the person who got away from her when she was a teen. Will people listen to her this time?"}, {"Review": "What if you knew her and found her dead on the ground..This was my Amazon First choice for July. Zoe Bentley is a forensic psychiatrist who is a civilian consultant for the BAU. She has been fascinated by serial killers since coming into contact with one, when she was fourteen. Agent Tatum Gray was just 'promoted' to Quantico from L.A., after making too many waves. Tatum and Zoe are sent to Chicago to consult with police about a bizarre serial killer known as the Strangling Undertaker. He's already killed at least three women, and shows no sign of slowing down.This story takes place in 2016, with several flashbacks to 1997. Although I'm not a fan of flashbacks, this book wasn't overloaded with them, and they aren't too distracting.Results: I thought this was very interesting and well-written. There were a few minor details that were irritating, like placing a dead body in the trunk of a van. What model of van has trunks? Overall though, the story kept my interest, and I would try another book by this author.I would give this a P.G. rating. I would be able to read this to my grandmother, but not to children under the age of fourteen."}, {"Review": "A killers mind is an amazing thriller that will keep you guessing until the very end. I love that the story is told from all points of view, from Zoe Bentley (profiler), the FBI agent, to the killer and even the victims, this give a truly excellent and well rounded account of the crimes and detective work. I feel this is how all thrillers, crime, and mysteries should be written. I found the characters endearing and made you care what was going to happen to them next, the story draws you in with not just the investigations and crimes but also the humour, character interactions and the amazing twists you do not see coming, there was even a “ oh my god know” moment that pushes a thriller from good to extraordinary.This was a truly excellent book and I would highly recommend to everyone, I can’t wait for book 2."}, {"Review": "Are you serious?!I was enjoying this book up until the end it went downhill quickly. In what world would a doctor that is untrained in hostage situations decide that running into a crime scene and stripping was a good idea. Seriously?! The entire situation would have never worked. Zoe would have never been a suitable replacement for his current victim as she was badly beaten from a previous altercation. The author basically contradicted his entire book at the end. Zoe would have known based on his profile that her body was in too bad a condition to interest the killer. Unnecessary! The author should have spent more time crafting an ending instead of setting himself up for a series. It would have been a much higher rating if the ending flowed with material set up through out the book."}, {"Review": "DNF @ 103 pages.The novel really isn't working for me. The premise is interesting, but the writing so far reads as shallow and cheesy; and all the characters come across as juvenile, which is an odd feeling when they are supposed to work in law enforcement. Zoe, especially, is introduced as an expert in her field, but she sounds like a total hack most of the time. It's very hard to believe her observations have any value when she whips them out without having investigated... much of anything, really."}, {"Review": "I didn't love this Kindle First book, but I didn't hate it, either. I am on the fence as about reading the next book (thank you Mike Omer/Amazon for making it clear this was the first in a series).The majority of this book is set in present day, but there are a few chapters that take place in 1997, when Zoe is a teen and there have been multiple killings in her small town. I actually liked those chapters the most, because Zoe seems to have a lot more personality. Present day Zoe seems to look for occasions to take offense, and other than anger, she has almost no personality. She exhibits nothing that makes me want to know more about her. And for all of her accolades/highly respected/professional...she suddenly becomes convinced that no one will believe her theory and decides she needs to go it alone (ah yes, the rogue agent, I'm sure nothing could go wrong).Thankfully Tatum has more personality, but he is a bit of a \"bro\": cocky, always right, thinks he can charm his way into getting information. He also seems to have no problem with going rogue. Tatum lives with his 87 year old grandfather, who's kind of a player and likes recreational drugs. He also seems to be in some kind of power struggle with Tatum's cat. I wish he had been in the book a little more, he was entertaining.The serial killer had a few POV chapters, and they were pretty chilling. Points to the author for really upping the creepy factor.The case does get solved, but the book still ends on a bit of a cliffhanger."}, {"Review": "I received a copy of this story from my husband after a friend of his suggested it to him. Needless to say, this was an interesting pull-you-in kind of story. While I have read crime/mystery type stories before, I'm usually hesitant when it's by a male author. Sorry, but the few I have read were written by men and somewhat boring, in my opinion. Perhaps, it was because the main character was a male? Yet, I'm not sure that's right since I've read lots of stories with a male lead and have never had issues. IDK. But I liked this one! The story was well written, and I loved the funnies he threw in. For example, his interactions with his grandfather. Those were hilarious! \"Do you know what's in my lap? My penis! My penis is in my lap.\" Or Mancuso's 'bastard' fish. Thankfully, I didn't see many mistakes and those that I did see were missing commas. No big deal. Questions/Comments:I couldn't help but smile when I saw the two main characters in this story were living in Dale City, VA. That's where I grew up and met my husband! If this is part of a series, I'm curious to know if the next book will have anything more regarding the Highway Serial Killings Initiative that Zoe was working with at the beginning of the story. So, Tatum is sent to Chicago to see if he can help the PD there with the serial killings. He meets Martinez, heads back to Virginia to let his grandfather know he's going to be in Chicago for a while, then heads back to Chicago. Why wouldn't he have done that prior to leaving? What was the point of the back and forth?Martinez, Zoe, and Tatum are talking after finding Lilly's body. It's stated what she was wearing when she was found and how she was killed. Martinez states \"She was alive at nine thirty.\" Tatum says, \"Unless it wasn't her on the phone.\" What would have even made them think that a possibility? I mean, they located her phone signal in that area, did they seriously think a different female had used Lilly's phone? Yet, they happen to find Lilly's body? That didn't make any sense. In the beginning, Lilly's body is described as having blood all over it. Jeffrey takes note that her \"...chest is a mess\" because of all the blood (or so I assume). Yet, when they're talking later about her, it's stated that \"There was blood all over her neck, but her shirt was mostly clean.\" Yes, she was already dead when he slit her throat, but she hadn't been dead long, so her blood was still flowing, hence the killer was drenched in her blood. So how would her shirt had been clean still?Jeffrey kills his brother's fiance. So he killed her because he was scared she'd say something about his weirdness to his brother? I was confused about that part. I'm sure his brother would have already known he was a weirdo. The whole process of him killing her then going to animals, then back to women again, seemed questionable. If he'd been embalming animals, wouldn't his human embalming kills have been better? Zoe realized that Glover being the serial killing was a dumb idea. Why? How? I mean, he was still sending her the ties, which could have easily been used to strangle the women and he knew he'd already killed.Zoe has a glued wound on her shoulder and a stitched wound on her neck. When the hot water hits her, it's her shoulder that hurts. Critical thinking skills coming into play here. When thinking about stitches where the two sides of the skin aren't together/healed yet, and a sealed wound, I'd imagine the stitched one would be more painful. Just saying...Why does Tatum call his grandfather by his first name?Andrea has black hair, while Zoe has auburn. Again, just something questionable that stood out to me. How much time had gone by when Lilly's body is found and when Jeffrey finds his \"family?\" The way the story is written made it sound like it was just a few days later, but \"The woman was still alone, just like she had been a month ago.\" So, obviously, it's been more than a month.Why were no charges brought against Dr. Foster, considering she lied, which resulted in the suicide of Manny? I found it questionable (I like that word) that Glover happened to be in Chicago the same time as Zoe. Obviously, he'd been there for a bit since he'd killed a few women there years prior. Speaking of Glover, Harry Barry, in his article about Zoe, states that she was able to capture two serial killers. She got Jeffrey, but she never captured Glover.I didn't understand why Tatum and Zoe had a hard time determining what Jeffrey used the women for?! Even if his POV wasn't in the story, knowing that a male was kidnapping, murdering, embalming and dressing up females, well it seems obvious. The fact that his embalming skills were improving with each female was further proof that he wanted to keep one/them for as long as possible. Since he couldn't have sex with them after being embalmed, keeping them as company was the only other option, at least in my mind.Tatum and Zoe are talking about dolls. Zoe states that she had dolls when she was younger but didn't play with them. Tatum states that he played with Playmobil figures. I get the author wanted to give the readers/characters a hint as to the reasoning for the killer embalming the females, but the fact Tatum goes on to say that he \"...remove[d] their hair and change[d] it around...\" just seemed weird. Like it's one thing to say what kind of toy he played with, but to further state that he'd take the hair off...what would have been the point of that unless it was the author's hint.How did Zoe ever think that Clifford could have been the killer? What about the fishing trip and the fact that his fiance was gone by the time he got home? That seemed to leave her and Tatum's minds for a good while before they thought of his brother. \"Clifford has an employee named Jeffrey who seemed to be really close to him. And he called him Cliff. That woman said his mother used to call him Cliff when he was a boy, so his brother probably calls him the same.\" I'm sure everyone probably calls him Cliff! Just seems strange that the author would have gone on about his nickname like that.Prior to asking Clifford about his brother, Tatum and Zoe try to sneak a peek in one of the work vans. The doors are all locked though. Tatum ends up joining Zoe at the back of the van. Now it doesn't say whether the doors were open, which seemed unlikely considering Clifford was the only one in the shop (why would he have left the doors open). But Tatum ends up stating \"No blood, no formaldehyde...\" How did they know this though? Again, if the doors were open they would have been able to smell the formaldehyde, HAD it been spilled, and they might have seen blood had there been a good amount. But just glancing in doesn't seem like it would have told them much without having forensic people there testing the inside of the van. Of course, if the doors were closed, they wouldn't have known anything either. When questioning Clifford the final time, Zoe states that \"You said you went fishing with him several times two WEEKS ago. But on that night (the night his fiancee disappeared), he didn't join, did he?\" Why in the world was she comparing their fishing trips from a few weeks prior, to years ago? Jeffrey wants to start his new family. He forces his way into the house. Why didn't he lock the door behind him? Obviously, he didn't want anyone bothering them...I get that Zoe wanted to go in place of the mother. Got it. She took off her shirt to show that she didn't have a gun. Yes, because she couldn't have just lifted it up. Jeffrey seems smart, so why didn't he think to have her turn around? Whatever. She then takes her skirt off. Why? She wants to see if he's attracted to her. \"She didn't interest him.\" Really? That just seemed dumb there. I mean they already knew that he was sexually attracted to corpses. She then takes her bra off...again...why? The best part is that she doesn't put anything back on (yes, her blouse was bloody) but what about the bra? Or ask the woman for something? So she basically just stood there in just her underwear when the police showed up? And Tatum never commented about her basically be nude in front of him? Plus, him swapping the mother for her wouldn't have happened. Did the author forget that she'd been beaten? Was black and blue? Yeah, that wouldn't have interested the killer.Lastly, in the end, Zoe thinks that it \"...probably wasn't a good time to ask Mancuso for anything...\" Why? Yes, her and Tatum weren't supposed to go back to Chicago, but they did catch the killer. "}, {"Review": "4.3 Out Of 5 \"Profiler\" STARS A Killer's Mind is morbidly fascinating and generally creepy.  Compulsively readable, or listenable, I couldn't put it down.  I had some issues with the way some elements played out and some minor believability issues, but nothing too major.  I got this book as a Kindle First and bought the narration and it was totally worth it.  I really like stories about Profilers, I find the whole process quite intriguing.  Narration by Brittany Pressley was very well done…I liked the way she did Zoe's accent, making it more pronounced when she was agitated. ๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏~~~~~MY RATING~~~~~☆4.3☆STARS - GRADE=A-๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏๏  ~BREAKDOWN OF RATINGS~Plot~ 4.3/5Main Characters~ 4.3/5Secondary Characters~ 4/5The Feels~ 5/5Pacing~ 5/5Addictiveness~ 5/5Theme or Tone~ 4.5/5Flow (Writing Style)~4.5/5Backdrop (World Building)~4/5Originality~ 4/5Ending~ 4.3/5 Cliffhanger~ Sort of…๏๏๏Book Cover~ It's eye-catching…Narration~ ☆4.5☆ for Brittany Pressley. ☆4☆ for overall because I believe this would have been top notch if they had a male voice for the male pov's.Series~ Zoe Bentley MysterySetting~ Chicago, IL, Dale City, VA, & Maynard MASource~ Audible Audiobook๏๏๏\n\n"}, {"Review": "This review was originally posted on Books of My Heart 3.5 hearts A Killer's Mind is a book I got as a Prime member in their Kindle First program. I generally seem to chose mysteries, action or thriller, or suspense stories.  Zoe is a forensic psychologist consultant to the FBI and works with their agents.  She is currently based at the BAU near Washington, DC.The focus was primarily on the case and its details. The chapters alternate between Zoe's past, when she developed the desire to become a forensic psychologist, and her present case. There are enough similarities to trigger some memories and insecurities from a time in high school when there was a serial killer in her home town.The character development is mostly limited to Zoe. Everyone else is there but I don't really feel connected to them. The new case takes her and a new agent from the BAU to Chicago.  Politics make things more difficult. Zoe works hard and tries her best to figure out how to catch the killer and save lives. She seems realistic, but a bit too willingly to place herself in bad situations.The plot is good and reasonably twisty. There are various problems which slow things down but they slowly make progress. There is a new twist at the end which sets things up for another story. \"She had managed to creep out a man who had performed autopsies for a living.  Achievement unlocked. \" "}, {"Review": "I'm hooked on this new series! For me, characters come first. I need to feel their emotions, and care about what happens to them. That can mean I want them to succeed with a happily-ever-after ending or die violent deaths, but either way I have to feel the intensity. Mike Omer brought me characters I immediately connected with and cared about. They're realistic and quirky and unique. Even the minor characters stand out. I absolutely loved Marvin, who is Tatum's grandfather and had me laughing out loud.The plot is complex without being overly complicated. Omer doesn't overload us with gruesome scenes, but instead gives us just enough to be repulsed by and get a clear sense of the killer's actions.Pacing is steady, with a good mix of humor to offset the dark topic.I have one grumbling point. The author drastically overuses the words 'bit' and 'very', to the point where I was editing the sentences as I read. Each word appears roughly 100 times in the book. This cheapened his writing 'a bit'. It's an easy fix, because his writing is quite strong, and I only mention it in the hopes that the author and/or his editor will catch and correct this habit in book 2. I'm looking forward to spending lots more time with these characters!"}, {"Review": "I started this book without reading the reviews or other works by the author. It was recommended via kindle unlimited to me. I read a lot of books, 300+ a year so I do love when I get a new author suggestion. A few chapters in to the book I was concerned that I had already read it and forgot to mark it but I continued anyways, Thank goodness i did! It has some parallels with a book I have read before but it is definitely unique. I loved the writing, characters, backstory, time flips, ending... actually to be honest I think I pretty much loved everything. It is a great book, with a great story, written well. I would highly recommend. "}], "Genre": "Thriller", "ID": "37647561", "Desc": ""}