{"Name": "The Au Pair", "Image": "https://images.gr-assets.com/books/1524088885l/37561550.jpg", "Reviews": [{"Review": "*3.5 stars*The Au Pair is more than a decent read, the difference between good and great coming down to the reader’s acceptance of the serpentine ending—a la  V.C. Andrews—and the author’s reliance on a particularly weak plot device.Stylistically,  Emma Rous blends contemporary fiction with domestic noir, setting her mystery at a country home. A yellow-bricked, seaside, family estate, Summerbourne's history and its inhabitants shrouded in secrets. The most jarring tale making the rounds, twins not faring well. Except for the last set that is, the summer born at Summerbourne—Seraphine and Danny. Following the accidental death of her father, Seraphine, now twenty-five, comes across a photograph of her mother holding a baby. Having thrown herself from the cliffs behind Summerbourne the day she gave birth to Seraphine and Danny, makes her pleasant expression and the single baby she’s holding suspect. The family has never discussed that fateful day, prompting Seraphine to start asking questions. Seraphine’s underlying feeling of not belonging ignited, she’s inspired to track down the one woman who might have answers. Laura, her older brother Edwin’s au pair, was the one to take the picture, before fleeing into the night, never to be heard from again.The mystery unfolds with rivaling chapters, Seraphine—present day—and Laura—twenty-five years earlier, as the young au pair—taking turns at the wheel. The result, a journey that takes little effort, the pages almost turning themselves. Although, the experience isn’t without a few potholes. Rous opts to move the plot along, on more than a few occasions, by administering her characters doses of the *oh, I remember now* serum. It's storyline development that feels lazy and uninspired. Memories resurfacing at the most convenient of times, in conjunction with the convoluted climax, knocked my overall enjoyment down a few notches.The page-turning quality to the story isn't enough to overcome the identity crisis faced by many of the characters or the blurred familial lines the reader is left to make sense of in the end. Best described, in my mind, as confusing and overdone. But have no fear, all of that messiness is still somehow wrapped up with a neat little bow. *Thanks to Berkley Publishing for providing a copy in exchange for my honest thoughts."}, {"Review": "\nMystique, atmosphere, and surprising twists!\nThis novel was so captivating that I did not want to put it down! There is a compelling aura of mystery that hovers around the birth of the twins- Seraphine and Danny.The twins were born at home at the family's beautiful, sprawling Norfolk estate. A photograph is taken of the parents, their older son Edwin, and their mother, Ruth. Although, she is only holding only one of  her newborn twins.  Where is the second twin? Which one is in the photograph? The novel will reveal the unpredictable answers.The setting with the estate's beautiful gardens, the near-by beach and the menacing cliffs was atmospheric. The gardener who tells spooky tales. and a young nanny hired by the family, make this story enchanting and seductive with some gothic vibes.The secrets come out in the second half of the story and you may be able to catch some hints to what is going on along the way.  I was flipping pages as fast as I could while more twists continued until they turned into a \nfull blown tornado!  \nI thought I was ahead of the game, but OH NO, take my word for it, I was stunned.An elegantly written suspense novel with some gothic vibes. Highly recommend!"}, {"Review": "\n3.5 starsTwisted, compulsively readable psychological thriller that centers on deeply hidden family secrets.\n25-year-old Seraphine buried her father 3 weeks ago and is struggling. While she has her twin brother, Danny, and older brother, Edwin, to offer support, she feels like an outsider in her family--she always has. Her mother committed suicide the day she and Danny were born, and now parentless, she seeks to find answers to the questions she had about her mother’s death. As she tries to uncover what happened the day her mother died, she begins to question her own origins. There is only one person she believes has the answers she seeks: Laura, Edwin’s childhood Au Pair, Laura, who was present for her birth. She tracks down Laura, but in doing so finds herself in danger. But one begins to wonder if Seraphine really is in danger or if there is something else at play? The narrative alternates between the past in 1991 to the present, with the events being recounted by Laura and the present by Seraphine. Seraphine made for an enthralling narrator. Many a time, I was questioning the reliability of her version of events. I couldn’t put this book down--it takes a bit for the story to really take off, but as it became clear that there were many secrets and lies to uncover, I got sucked in! I had a theory early on about some of the mysterious secrets and I was correct...but while I figured out the who, I could never have guessed the how and the why. I love a book that keeps me guessing! I knocked this down a half a star due to the believability factor. It gets a little overly complicated and convoluted towards the end but at the same time the fascinating narrators and web of lies to expose kept me riveted. Overall I found this to be a captivating read! I won a copy of this book from a Goodreads giveaway!"}, {"Review": "An exquisitely spun web of spellbinding secrets and dark deceit! This suspenseful story Will keep you riveted from first line to last... a magical tale that will awaken your imagination and stretch your mind....Emma Rouz has woven together an enchanting story that will make the unbelievable believable....This book is like a walk on a foggy morning... when you start out you can barely see your hand in front of your face... but as you go on the fog begins to Clear... The path is Windee with some unexpected twists and you may not end up where you originally thought you would.... but every step was SO worth the satisfying end....A grande estate, a set of twins, a mysterious photograph, and a rumor of a curse... Seraphine has always felt as though she didn’t quite belong... so when she discovers a picture after her father passes away... A picture with only one baby...Seraphine is more convinced than ever that things are not as she’s been told her entire life.... is the baby in the picture her or her twin brother Danny? And why are both babies not in the picture? And how can her mother look so happy when merely hours later she takes her own life? So many questions and only one person who knows the answers....This book was told from duel perspectives... Seraphine and her struggle to finding who she really is... and Laura, The au pair, in 1991 when she was working for the family taking care of Edwin the twins older brother.... both these characters were likable and sympathetic, but I have to admit Laura really stole the show for me.... A better au pair you could not ask for.... not to mention the girl was thrown into this dysfunctional family’s drama...A captivating creepy story with a gothic vibe that will keep you glued to those pages! A dark deceptive tail that will leave your mind reeling and your heart racing! An absolute must read! Strongly recommend!*** huge thanks to Berkley for my copy of this book ***"}, {"Review": "Oh, what a tangled web! 🕸 3.25 convoluted, family secrets filled stars ⭐️ for The Au Pair Within hours of her birth Seraphine Mayes' mother Ruth had thrown herself from the cliffs near their family home. 25 years later, as Seraphine mourns the death of her father she comes across a hidden, old family photo. Seraphine never had a photo with her mother but in this photo dated on the day she was born her mother sits, smiling, cradling an infant, surrounded by her older son and husband. This photo would be a welcome discovery if not for the fact that there should be two babies in the photo. Seraphine has a twin brother, Danny. So which of them is in the photo and why is one of them missing? Seraphine's mind becomes a swell of emotions, memories and stories. Growing up there had been many rumors shared about the Summerbourne twins. That they were not really from Summerbourne, they were sprites or worse - children Ruth had stolen at the height of her madness before killing herself. Seraphine can not shake the uneasiness this photo ignites in her. She becomes obsessed with finding out what happened on the day she and Danny were born. With both her parents dead and her grandmother Vera unwilling to discuss anything about the past Seraphine is determined to track down the only other person who knows what truly happened that day - her older brother Edwin's Au Pair, Laura. The mystery unfolds, via alternating chapters of the past detailing Laura's eleven months spent as an Au Pair with the Mayes family and the present chronicling Seraphine's journey towards discovery of the truth. It is a slow unraveling of long hidden family secrets brought to light in much too convenient ways at times. I had definite theories early on about who was responsible for certain acts in Seraphine's present as well as what went on in the past. I was correct in both cases though I did have the twin aspect figured out incorrectly. The story gets very confusing and convoluted at the end- a bit too much for my liking. I had a hard time accepting some of the reveal but overall the story was entertaining and definitely kept me turning the pages. If you enjoy stories about family secrets, tragedy, mental instability and deception everywhere then this one is definitely for you.Thank you Emma Rous, Penguin Publishing Group and Edelweiss for an arc of this book."}, {"Review": "FIVE STARSThe Au Pair is a delicious, old-fashioned mystery complete with a gothic setting and a clever plot puzzle that just begs to be solved.While not exactly a psychological suspense type story, I found it to be just as page-turnable as any thriller. I thought I had most of the puzzle figured out, but it is a bit complicated and I could never work out one piece of the puzzle. That piece, indeed, turned out to be the biggest reveal at the end.If you are an Agatha Christie fan at heart, you will adore this haunting and lovingly told cozy mystery. Also, perfect for fans of Rebecca  and The Death of Mrs. Westaway.Many thanks to Netgalley for my early copy! Strictly my own opinions."}, {"Review": "Seraphine Mayes recently lost her father in a tragic accident. When cleaning out his belongings from their home, Summerbourne, she finds a long lost picture she had never seen before. In it is her mother, Ruth, and her father, Domenic, holding a new born baby. It was taken the day she was born but where is her twin brother Danny? Why wouldn't all four of them be in the picture? And why did her mother throw herself off the cliffs into the sea below only hours after their birth? Seraphine questions her older brother Edwin about the picture. He can't tell her much except that the picture was taken by his au pair, Laura, who never returned after their mothers suicide. Seraphine makes it her mission to track down Laura in hopes that she'll provide her the answers she's looking for. The chapters alternate between Seraphine in the present and Laura in the past when she moves into Summerbourne as their new au pair. I could not stand Seraphine. I found her completely annoying. I thought her behavior more often than not was atrocious and I found it very hard to garner any sympathy for her plight. This woman went from 0 to 60 in 1 second after finding that picture. She went from a grieving daughter to - Who am I? Who are my \"REAL\" parents? From here she accuses pretty much every one around her of lying to her. My urge to smack this woman grew with every turn of the page. I found Laura's chapters much more interesting which gave me the resolve to finish this book. While it may of been interesting it quickly morphed into the ridiculous towards the end. (view spoiler)[You aren't going to tell me that NO ONE knew or even suspected that Laura was pregnant because she was tall? How coincidental that after birthing Ruth's baby that she herself would go into labor? That's just a little too convenient for me. (hide spoiler)]And what's up with that ending? The \"who\" and the reasoning for it (not to mention you never really do know anything for sure because the \"who\" never does admit to anything)~ Not impressed! I won this book in a Goodreads giveaway. Thanks, Goodreads! 2.5 stars!"}, {"Review": "4.5 starsSuch a page turner, I ended up finishing it in a day. It's just one of those good old popcorn eating reads in which you can't wait to see how everything unfolds. Seraphine and her twin brother Danny were only hours old when their mother committed suicide off the cliffs of the Norfolk coast. Now an adult, Seraphine is mourning the death of her father. While going through his possessions at the family estate, she uncovers a family photograph of her parents, older brother Edwin, and a baby on what looks like the day she and Danny were born. But what strikes Seraphine is odd is her mother is smiling in the photo even though in a mere matter of hours she kills herself and there is only one baby in the photograph. What does this mean and will she be able to find the answers she is looking for even though so many years have passed?In terms of sheer entertainment, this was a 5 star read. I loved the dual timelines of the present with Seraphine and the past with the au pair, Laura. The story does become a little complicated towards the end and there were times I had to pause and get everything squared away in my head before I could continue reading. I think some valid points could be made on whether the story is realistic however this book has that weird, creepy but fun, trainwreck type vibe that whether or not it is believable doesn't really matter much to me. This is the type of book you read when you want to escape from your life and read about the crazy, messed up lives of other people. A perfect vacation read!I received a free copy in the mail from the publisher but was under no obligation to post a review. All views expressed are my honest opinion."}, {"Review": "3.5 Doesn't it just figure that after making the decision to read many less psychological thrillers next year, I would finish this year with a couple I actually liked. This one begins with a death and a picture. A picture that sends a young woman, one of a set of twins, scrambling for answers. One baby, when there should have been two.A gothic toned storyline, a past that holds many secrets and deceptions, and a determined young woman bent on finding answers. There were so many babies in this, it made my head hurt trying to figure out whose baby belonged to whom. Where do they all belong? A young au pair that finds herself right in the middle of a drama. Folk takes about twins where one doesn't survive, because of a myth, a curse, human hand? Quite interesting trying to figure all this out before the denoument. A big bad wolf in someone else's clothes? That part I didn't figure on, but I actually did quite well with the rest of it.The end, a little too dramatic for me, almost lost me there, but did enjoy getting there so...... Why don't authors realize that less is sometimes more and that they can leave out the kitchen sink.ARC from Edelweiss."}, {"Review": "Thank you to the publisher Berkley who provided an advance reader copy via Edelweiss.Summerbourne is an English country estate set against the beach and cliffs, a beloved refuge of the Summerbourne family. However, over the years it has suffered heartbreaking tragedies involving the death of a twin, and the suicide of a mother. In 1992 Ruth Mayes (Summerbourne heir) threw herself off the cliff in back of the house on the same day she gave birth to twins Seraphine and Danny. Several years earlier she had given birth to twins Edwin and Theo, but Theo died after falling from the cliff shortly after his second birthday. In fact, Summerbourne has a mystic reputation among the villagers for not letting the family keep their twins. In the years since their births, Seraphine and Danny have been nicknamed the \"Summerbourne Sprites\" by some of the neighbors. There was no midwife at the house when Seraphine and Danny were born. Also, Seraphine was much larger and robust than Danny, and she sported a different skin tone. As they grew their sizes became comparable, but the mystery and horror of what their mother did always left an unsettling feeling and unanswered questions.Seraphine loves the Summerbourne estate more than her twin brother Danny and hopes that one day her grandmother Vera will leave it to her. She's still reeling from the recent accidental death of their father Dominic, who was found bloodied and fallen from a ladder by the garage. She's exploring the contents of her father's desk and finds a family photo from the day she and Danny were born. However, in the photo her mother Ruth is holding just one baby. This fact ignites the old uncertainties surrounding her birth and that of her twin brother Danny. Her mother looks serene in the photo, with no inkling that she would throw herself off the cliff just hours later. Also, Seraphine remembers that an eighteen year old au pair named Laura had worked for the Mayes that year, but left the family right after the births. Did Laura take the picture? Maybe she can provide critical insight of that momentous day in 1992, because SHE WAS THERE. To that end, a determined and driven Seraphine sets off to find the former au pair.This is a story of a privileged family that has known tragedy and is guarding secrets. It is a slowly unraveling mystery that culminates in a riveting, yet sobering conclusion."}, {"Review": "4 gothic and complex stars to The Au Pair! ⭐️ ⭐️ ⭐️ ⭐️ Seraphine and Danny, twins, are born on the coast of Norfolk, England. Not long after their births, their mother commits suicide, and their au pair flees. After that, the village goes wild with rumors about dark things that may have happened within the grand estate. Seraphine is now an adult grieving the loss of her father when she finds a mysterious family photograph. The photo is from the day she was born, and in it, her mother appears happy, but she’s only holding one baby. What happened that day and where is the other baby?The Au Pair is a solid page-turner with a gripping premise and a haunting mystery at its heart. The narrators’ voices are fascinating, and I was absolutely riveted by this story. Consumed, really! An intricate web of lies is exposed, the atmosphere is perfectly drawn, and finally, that ending: it blew my mind! Overall, The Au Pair is a remarkable literary thriller, and Emma Rous is an author I’ll be keeping on my radar. Thanks to Berkley for the complimentary ARC. All opinions are my own. My reviews can also be found on my blog: www.jennifertarheelreader.com"}, {"Review": "4 stars! A gripping, atmospheric and jaw-dropping read!This novel follows the Mayes family, whose history holds many secrets. Seraphine Mayes is grieving the death of her father. While helping to clear out her father’s vast estate, she stumbles across a photograph that leads to some unrelenting questions. Seraphine knows that on the day of her and her twin brother’s birth, their mother took her own life, leaving the family in complete devastation. She has always harboured countless questions about that time, never receiving explanation from her father or grandmother. Laura, the au pair living with the Mayes family during that time, fled that same day, never to be heard from again. I thoroughly enjoyed the unfolding of this engrossing mystery. The pace was perfect, the dual perspectives were excellent, the flow was seamless. I absolutely loved the “feel” of this story. It was a thrilling ride that had me itching to click on that 5 star rating, until the last 20% when the story lost some steam. There was too much drama at the end and I felt some storyline twists were over-the-top. I do recommend this novel as the writing, the characters and the atmosphere are all unforgettably exceptional, just be prepared for a lot happening at the conclusion. This was a Traveling Sister read. To find this review, please visit our blog at:https://twosisterslostinacoulee.com/2...Thank you to Edelweiss, Berkley and Emma Rous for providing me with an ARC in exchange for an honest review!Expected Date of Publication: January 8, 2019."}, {"Review": "The Au Pair by Emma Rous is part gothic suspense with a full measure of domestic noir!if I were asked to choose the perfect suspense novel, it would  There is absolutely nothing that I love more than dark, domestic tales of suspense and murder. The Au Pair has it all. Seraphine and Danny are twins who, along with their older brother, Edwin, have been raised on an old Victorian estate in Norfolk (UK.)  Their lives would appear charmed to the outside world, but there is a darkness within the family that pervades their existence. On the day that the twins were born, their mother threw herself off of a cliff. Now the siblings are attempting to cope with their father's tragic, accidental death. While going through their father's belongings, Seraphine discovers a photograph of their parents with one of the twins taken on the day they were born. Their mother looks blissfully happy. What possibly could have happened to make her kill herself and why is there only one twin? With stories of changelings, faeries and sprites haunting them all of their lives, Seraphine is determined to find answers. But will those answers be the ones she is hoping to find or will it lead to more heartbreak for this cursed family. Told from two points of view, Seraphine's and that of Laura, the au pair at the time of their birth, Rous weaves together a story of a wealthy family with mental instability, far too many secrets and characters who will stop at nothing to keep those secrets hidden. The complex plot twists and turns in very unexpected ways and takes the reader on a journey from the present to the past and back again. Although I am one who does not like surprises in my noir novels, this ending will absolutely blow your mind! The resolution, however, is perfection! For those who love domestic drama, suspense and fast paced fiction, this is definitely a book you will want to read! Mark it now, order early, it will be published January 8thThanks to @BerkleyPub for my copy of this fantastic book! "}, {"Review": "A House of Mirrors......You know the experience. Where things are completely distorted and take on highly exaggerated shapes of their own. What exactly is real and what is not?Seraphine Mayes returns to the family estate on the coast of Norfolk. She is joined by her twin brother, Danny, and her older brother, Edwin, for their father's funeral. There was a terrible accident when Dominic fell off a ladder while repairing the garage roof.But the Mayes family have experienced great tragedy in times past. Their mother leaped to her death from a cliff on the estate. It was the exact day that the twins were born. The three children were raised by a revolving door of nannies through the years. Their father tried his best. Their grandmother, Vera, the ruling matriarch of the family, had a say in all things. As her brothers return to London, Seraphine finds herself going through boxes and drawers. She comes upon a photo of her father, Edwin, and her mother holding only one of the newborns. It must have been taken only hours before her mother's death. Who had taken the photo and why was there only one baby in the picture? This simple photo will be the impetus that sets this family unraveling at a frantic pitch. As Seraphine digs deeper into the past, she will come upon rumors that the little village keeps on a slow boil for years.Emma Rous begins her story with quite the appeal. It's a debut novel. As readers, we are intrigued with the premise and find ourselves leaning into it. But as incidents begin to surface, we find that there's a sunami of threads to unpack here. The knots become more and more apparent as they tangle and fray. Because of this, there requires page after page of explanations and ironing out the wrinkles to tidy up before the final curtain. Perhaps in her next offering she won't be as tempted to take on quite so much extraneous baggage.I received a copy of The Au Pair through Berkley Books. My thanks to them and to Emma Rous for the opportunity."}, {"Review": "This was a gripping, mysterious, and captivating read. Once I started it, I could not stay away from it.Seraphine is mourning the death of her father and looking through old pictures when she stumbles upon an odd photograph, in it her mother is posing with a baby the same day she and her twin brother were born. She asks herself why is only one baby in the picture when her mother has just given birth to twins? And she won’t stop until she finds the answer to this question.I absolutely loved this novel. It is an entertaining tale of dark family secrets, an engaging page-turner.The story is told in alternating timelines and takes place in a small English town. The setting was perfect for this type of mystery with all the gossip and tragic events surrounding the estate.Overall, I highly recommend this novel to readers of mysteries, thrillers, and contemporary fiction.Received ARC from the publisher via Edelweiss"}, {"Review": "Even deeply buried secrets have a way of coming out. It takes only a small thread of information to unravel a tightly woven web of lies. And when we find those threads, it’s pretty hard not to pull them. But what if the truth is worse than the lie? That’s always the problem with secrets… Once a secret comes to light, it can’t be reburied.In the stunning debut novel by writer Emma Rous, an old photograph leads to the discovery of a terrible secret. With a sense of mysticism and lore, a seaside estate with a dark past, and dual timelines, The Au Pair is truly captivating. I couldn’t put it down!See my full review on PhDiva.blog!ReflectionThis book had a bit of a gothic feel mixed with domestic noir and a splash of folklore. The names of the two houses alone have an atmospheric vibe—Summerbourne and Winterbourne. Winterbourne is the much-needed escape from Summerbourne, where a darkness and loneliness seems to plague the yellow-bricked escape.Twins never survive at Summerbourne, states an old curse. The villagers love to talk about Summerbourne because of the wealth, society, and tragedy plaguing the family homestead. Amidst whispering of changelings, babies replaced by sprites, and more sinister stories, Seraphine and her twin Danny managed to survive when their mother did not. There’s the sense that perhaps she was the sacrifice for the Summerbourne twins to finally survive.I loved the town stories and the characters in the village. I could so vividly picture all of the settings in this book. Rous has a way with descriptive language that really builds an atmosphere to the story. I felt the swirling mist upon the cliff, and the heat of a summer day. The perfect place for a child to grow up, if it weren’t for the stories…Seraphine was a completely fascinating character. These very differences that make Seraphine feel isolated also lead to her allure. Seraphine doesn’t think about things the way her brothers do, and that’s why she can’t drop it when she finds the photograph.Every other chapter is narrated by the mysterious au pair, Laura back in the year before the twins were born. Laura is a bit withdrawn, but incredible as an au pair to Edwin. But as time went on, everything became twisted. Laura becomes more and more embedded in Summerbourne. Isolated from her friends and family for the year, Laura is the one who holds the secret to what happened that day… As the clues start to be uncovered, this book is nearly impossible to set aside. I found myself thinking about the mystery while falling asleep, turning over possibilities. I completely loved the entire novel—and I loved the way it haunted my thoughts when I put it away. Rous has an incredible talent, and I’ll read anything she publishes next.Thank you to Berkley for my copy to review"}, {"Review": "An eerie, claustrophobic family saga. Cross V.C. Andrews with Agatha Christie and you have The Au Pair. On the day twins, Seraphine and Danny Mayes, were born, their mother jumped from the cliff at their Norfolk estate – Summerbourne. Twenty five years later, mourning the recent death of her father, Seraphine stumbles across a photograph among his belongings that she’s never seen before. It’s a family snapshot taken the day of her, and Danny’s, birth – showing her father, older brother, and mother – happy and smiling only hours before committing suicide. And in her mother’s arms is not two babies, but one? Where’s the other baby, and what really happened that day? Desperate for answers, Seraphine is determined to track down the Au Pair, Laura, who fled Summerbourne House that same day under mysterious circumstances.Suspenseful, moody, and atmospheric! Crammed to the brim with all the gothic horror elements I love so much. The isolated, gloomy, yet picturesque setting, befallen by unspoken tragedy, and shouldered in mystery, hidden family secrets, a village riddled with rumours of stolen babies, forbidden romance, and creepy Norfolk folklore had me turning the pages at lightning speed. And then there was the ending – as twisty and shocking as it was emotional and moving. Chapters alternate between Seraphine and Laura – past and present on a non-stop collision course to reveal the truth. I cared about both characters, and their narratives had me fully immersed from the get go. Supporting characters were just as interesting and intrigued, especially the brothers/sister bond between Seraphine, Danny, and Edwin.A quick, engrossing novel, that I couldn’t put down. One of my top ten reads for the year no question. I will be waiting with bated breath for Emma Rous’ next book.UK Edition: 6th December 2018 (Out Now!)US Edition: 8th January 2019"}, {"Review": "4 Stars!\nWhy did he say I was impossible? Who Am I?\nSeraphine is mourning her Dad's death with her twin brother Danny and their older brother Edwin. They recently buried him when Seraphine starts searching through his things. She comes across a questionable photograph that sends her mind into a million questions. The biggest one is Am I who I think I am? Seraphine starts to do some research and finds out who the Au Pair was the day she was born and who else was close to the family. She tries to track these people down and tries to get answers. Each time she finds someone they tell her to stay away and they continue getting threatening letters. That then raises the question of Who is sending these threats and what are they trying to hide?The book switches from Seraphine's story during present day to Laura's story back in 1991-1992, when everything transpired. It was an interesting parallel as we were finding out what happened as Seraphine was discovering it. I personally enjoyed the flow of the book and thought it went back and forth nicely. Each chapter continued to keep me engaged and I really wanted to continue reading through as I really wanted to know what happened and who was sending these threats, although I had my theories and was right a few times!I read the title of this - The Au Pair and went in expecting there would be a family and then there would be an affair with the Au Pair and the father. Typically that is what happens in these kinds of stories. However there was more to it than just affairs. There were a lot of intermixing of characters and their story lines which gave it a lot more depth than just an affair or maybe affairs...you'll just have to read to find out.This is the author, Emma Rous's first novel and I will definitely pick up her future novels!Thank you to Berkley Publishing for sending me an advanced copy of this book. This one comes out January 8, 2019 and I highly recommend picking it up!"}, {"Review": "I won this book in a Goodreads giveaway. Yay me!I entered the giveaway because the blurb compared it to V C. Andrews work which, we all know, is beyond compare. I know, you don't need to say it. Lesson learned.I kept putting off reading it in favor of other books that I felt I would enjoy more. Then all of the raving reviews started coming in and I quickly moved it up my TBR list. Again, I know, you don't need to say it. Lesson learned.As usual I am going to be the Debbie Downer with my review of this one. It's taken me five days to get through this book. FIVE LOOOONG DAYS. This is a domestic thriller told through two POVs, Seraphine from present time and Laura from the past. There's nothing worse with a dual POV narrative than enjoying one and equally hating the other. The Laura chapters were by far the more interesting of the two. Her character was engaging and the story that unfolded in her chapters was fascinating and believable. Her storyline hints at a tragic past that is glaringly obvious. I'm thinking maybe her chapters only SEEMED more readable because of the complete absurdity of the alternating POV....and that brings us to the Seraphine chapters. I found Seraphine, as well as all of the other players in her chapters, frustrating, tiresome and one-dimensional dolts. Seraphine's actions were so unwarranted and ludicrous. A seemingly innocuous photograph sends her off on a farcical journey to discover a truth that she had never before questioned. Nothing about this photo suggests a long covered up family secret. The ending was so elaborate in it's attempt to be shocking that it became tangled in an almost comical way. The estate of V.C. Andrews should send a cease and desist order to the publisher."}, {"Review": "Happy publication day to this mysterious read!! WOW...... what a book! Mysterious, beautiful, and addicting! Ok... let's all acknowledge that cover... ok it's fantastic! This was one of my most anticipated reads for 2018 and I have to say that Emma Rous did not disappoint ;).There is a underlying mysterious story to the two twins Seraphine and Danny. Both twins were born at the beautiful family's estate in Norfolk. A picture is taken of the mother Ruth and their older son Edwin, and only one of the twins. Which one is it and where is the other twin? This story will take you on one nail biting ride behind this family and the underlying secrets that will have your eyes bugging out. The story is seductive with a gothic mystery at your hands. Emma Rous beautifully interweaves her characters with ease through this story that you will not want to put down. The only minor issue I had with this one was once the story finally was revealed it was a tad bit unbelievable in some parts. And the drama between the family members was a little over the top towards the end. Despite this minor issues, the web of dark lies kept my interest peaked to the core!!!You won't want to miss this novel!! Must read! Huge thank you to Berkley Pub for my copy in advanced for an honest review.4 riveting stars!Pub date: 1/8/19Published to GR: 1/5/19"}, {"Review": "4.5 Stars → Seraphine and Danny are twins, and on the day they were born back in 1992, their mother jumped from the cliffs behind their coastal estate of Summerbourne. Much later, after the death of their father, Seraphine comes across an old photo from that fateful day that raises suspicions about their family. The one person that may have answers to her questions is Laura, the au pair who disappeared shortly after her mother's suicide. But as it turns out, someone is willing to do whatever it takes to keep the truth buried.I greatly enjoyed this twisted tale of family secrets, told in dual timelines and points of view with Laura in the past, and Seraphine in the present. I couldn't resist the Gothic feeling and setting on the windswept coast of England. The writing and descriptions were lovely, and I had to pause and reread certain passages to savor. I enjoyed trying to figure out how the puzzle pieces fit, and nope, I did not have it right! I was easily entangled in the mystery of this dysfunctional family. Highly recommended for fans of domestic suspense.Disclosure: I received a copy of this book from the publisher in exchange for an honest review."}, {"Review": "4.5 StarsEverything began with a photograph…Seraphine has a twin brother, Danny, and an older brother, Edwin. The day they were born their mother died. Now after 25 years their father is dead and Seraphine found a family photograph from the day they were born when they were only a few hours old. But something is wrong with that photo! In the photo, their mother had held just one of the babies and there wasn't any trace of the other one! And their mother seemed so calm in the picture, so why did she kill herself a few hours later?? She had held which baby!? Where is the other twin? What happened that day?I can’t believe it’s her debut novel! So good and so enjoyable! From the first, I started guessing and I couldn’t guess right till the near end! So well-written and hard to put it down! Loved the plot, a real page-turner! It took place in a small town with mysterious gossips, alternating between 1991 and Now, almost chapter to chapter. It’s fast-paced with well-developed characters. Told in dual POV, 1st person. It’s a standalone novel. Overall, loved it and hope you enjoy it as well! "}, {"Review": "3.5 Stars! Gripping, twisted & captivating!THE AU PAIR by EMMA ROUS is an engaging, dark, mysterious and gothic tale of suspense that immediately piqued my interest and took me on a thrilling and bumpy roller coaster ride. I definitely found the premise of this book quite appealing and totally embraced the feel of this novel. I felt all those dips and curves while I was reading this story but then the ride took a drastic turn near the end to leave me feeling quite perplexed and spent. EMMA ROUS delivers an atmospheric, entertaining and well-written read here with a great mystery to unravel. I absolutely loved all of the many secrets and lies that there was to uncover along the way that definitely made this quite the page-turner. Even though I thought I had some of those secrets figured out there was absolutely no way that I was ever going to guess the actual reveal of the who and why.The story is told in dual timelines by Seraphine (love that name) in the present and by Laura, the au pair from the past. I thoroughly enjoyed both timelines and perspectives equally.Norma’s Stats:Cover: Intriguing, gloomy and a fitting representation to storyline. I actually quite like the scenic artwork to the cover.Title: The title immediately intrigued me and definitely enticed me to read this book. Writing/Prose: Well-written, entertaining, and engaging. Plot: Engrossing, suspenseful, atmospheric, interesting, complex, fast-paced, and entertaining with some over-the-top elements.Ending: Convoluted, dramatic and complicated that left me feeling a little blasé when everything was all revealed. Overall: Even though I was a little bit disappointed in the end it was still a worthwhile, pleasurable and entertaining read and I enjoyed the ride! Would recommend!Thank you so much to Edelweiss, Berkley and Emma Rous for providing me with an ARC in exchange for a review!Review can also be found on our book blog:https://twosisterslostinacoulee.com/2..."}, {"Review": "Seraphine returns to her family's home after her father's funeral. She is joined by her twin brother Danny and her older brother Edwin. While cleaning up her father's possessions, she discovers an old photograph that raises some troubling questions. The photo is dated from the twins’ birth but their mother is only holding one baby. Which child is her mother holding and why aren't both babies in the photo?The photo also shows her mother very happy and proud yet that is the same day she committed suicide. Seraphine decides to pursue the irregularities surrounding the photo and her mother’s death. She starts her search by contacting her former nanny who snapped the photograph. This is a debut novel by Emma Rous. The story is told from two points of view referencing the past and present. The Au Pair was a suspenseful and well-paced story with engaging family dynamics. "}, {"Review": "⭐️⭐️⭐️⭐️ / 5If you want a book that ends with a huge, unbelievable twist, then The Au Pair by Emma Rous is going to be the one for you!What it's about: Seraphine Mayes and her brothers Danny and Edwin lost their mom to suicide when she and Danny were newborn twins. Their older brother Edwin's au pair disappeared shortly after that, and the surrounding village buzzed with gossip. Now at age 25, Seraphine has just lost her father to a freak accident when she finds a strange picture at their family's summer estate. It is a picture of her mother, but holding only 1 baby, not 2. Seraphine becomes consumed with finding out what really happened that day her mom died, and even after mysterious threats, will not stop until she finds out the truth. I basically read this book in one day because I couldn't stop turning pages and it was very consuming. It took me just over 5 hours so I would consider this a very quick read. The viewpoints switch between Seraphine and the au pair Laura, and it was such a great way for the author to make everything come together. Seraphine's POV was in the present while Laura's was in the past so you got an idea of what was happening at both times.Then.. the shocking conclusion!! I kind of had an idea of part of a twist, but I was pretty shocked at most of what happened. I do have to say though, that the ending did get a little far-fetched. And I don't normally say that because it's fiction so that's kinda what I expect. It wasn't particularly believable but it was definitely shocking. NOTE: I am fine with the ending, I just want to make sure people are aware that it is pretty far out there. Final Thought: The Au Pair was a novel that I had been looking forward to, and it did not disappoint me! The pacing is quick, it's chalk full of mystery, and there is plenty of drama. What more could a gal ask for? I can't wait to read more from Rous!Thank you to the publisher for providing me with an advance review copy of this book via NetGalley in exchange for an honest review. All opinions are my own."}, {"Review": "I received an an advanced readers copy of The Au Pair by Emma Rous from Goodreads for my honest review.The Au Pair, was a wonderfully twisted and sinister read. It is the story follows two women, Seraphine Mayes and Laura Silveira. Seraphine finds an old family picture, taken on the date of her birth, in her deceased father's belongings. But, there is something very wrong with this picture. There is only one child in the picture and Serpahine is a twin. A few hours after this picture was taken, Saraphine's mother jumped to her death. No one in her family discusses the events of that day. What drove her mother to commit suicide? Seraphine has questions that she needs answers too, but who has the answers?"}, {"Review": "This read was out of my normal daily reads routine; but I am glad that I picked it up and gave it a try. I am finding that it is nice to read something a little different as it is getting harder to find unique books in the romance genre lately. \"The Au Pair\" is not a romance....more of a mystery/thriller, and it was described to me kind of like a VC Andrew's kind of book! I have always loved her books, so I definitely had to give this a go. I was kept in the dark about what was going on through out pretty much the whole book! The mystery was surrounding by the family that lived at \"Summerborne\" and it unraveled slowly through each chapter.The way this book was written was two different characters POV, at two different times. One was Seraphine's POV, and the was in the present time...Then there was the Au Pair's POV ( Laura)and the was her view in the past. There was no confusion about whose pov was in each chapter, and I found the transition all very good. It was two journeys and both were necessary to be told.This was my first book that I have read by Emma Rous, but she has caught my attention with her story. I will absolutely be checking out some of her other books. My only complaint would be that at times the story dragged a bit, but I think that was more that I wasn't feeling well when I was reading it...The only other thing was that the ending was just kind of \"blah\" for me...I think I am being picky though, as everything was answered, and it wasn't really the type of book that required an epilogue!!! So again, it was probably just me!! I for sure recommend this if you are looking for something different than the same old we have been reading!!! Give it a go, sit back and put your detective's cap on...it was fun to try and guess what all was going on!!!"}, {"Review": "*https://mrsbbookreviews.wordpress.comThere has been a significant amount of hype attached to The Au Pair, the debut family mystery come thriller from British author Emma Rous. Touted as ‘the biggest debut of 2019’ on the front cover, it certainly has some great initial pull power! What first presented to me as a thriller novel concerning a long hidden family mystery, actually developed into something much more surprising. I would be more inclined to shelve The Au Pair into one of my own personal favourite book categories, a gothic family based thriller. If you enjoy dual narrative timelines, such as the work of Hannah Richell or Kate Morton, do not delay in picking up The Au Pair!Mystery, secrets and dark family truths, which are all encased in a tight narrative, defines The Au Pair. The story centres on the discovery made by Seraphine Mayes, who is a twin. When Seraphine unearths a family photograph that she has never seen before, which was taken just moments before her mother died in a tragic accident near the sea cliffs that surround the family home of Summerbourne, Seraphine has so many unanswered questions. Seraphine is determined to get to the bottom of this family mystery which she senses is linked to her identity somehow. What surmounts is plenty of rumour, suspicion, strange figures and the mysterious presence of an au pair, who may hold the link to Seraphine’s past.I wasn’t aware of just how much this novel was going to tick all my book boxes when I first embarked on the process of reading Emma Rous’ debut, The Au Pair. I do enjoy taking a chance on debut authors and I was richly rewarded by my first experience with the work of Emma Rous. I always like to peruse the author bio information in books, especially debut novels. I was surprised to read Emma Rous studied veterinary medicine and zoology at the University of Cambridge. After graduating, Rous practiced in this field for eighteen years, before turning to full time writing. What an interesting previous career! I’m so pleased Emma Rous followed her long held dream of wanting to write stories. The Au Pair is a spectacular debut that I rate very highly.I must open my review with the wow factor I received from the setting of The Au Pair. There is an overwhelming sense of place in this novel. The Au Pair is deeply rooted in an ominous, spiralling and malevolent eeriness that drips through the pages and onto the reader’s hands from the very moment you pick up this novel. Summerbourne is the set locale of the events of this novel and like the very famous Manderley from the iconic novel Rebecca, this estate has immense stage presence. Alongside Summerbourne sits its city based estate owned by the same family and the focus set of the novel, called Winterbourne. There is also a rich sense of atmosphere that follows Winterbourne, but Summerbourne is in a class above. The tension is further heightened in the novel by the seaside cliffs that surround Summerbourne, which we soon learn was a place of great tragedy. If you can take one thing away from The Au Pair, it would be the dramatic surroundings of this stunning novel.I am sure by now you can hazard a guess that I am quite in love with this book! My love for The Au Pair also extends to the characterisation, which is set to a high bar by first time novelist, Emma Rous. The narrative is cleverly split down the middle, alternating between Seraphine, the present day daughter of the tale and Laura, to the au pair sent to Summerbourne that fateful summer of 1991. Rous is careful to balance the novel out evenly. We gain a clear picture of the impressions of both of these women, in conjunction with a number of periphery characters. These outer characters range from family members and siblings, to love interests. Each is sculpted to utter perfection by Rous, but she still maintains a shroud of mystery over the tale, so we are never entirely sure who or what to believe. It is difficult to maintain a high level of suspense and secrecy for an entire novel, but Rous succeeds in this feat. There were only a couple of unanswered questions that remained when I reached the close of this novel.Categorised as a modern thriller, The Au Pair is so much more. There are some underlying themes of romance that held my interest. In addition, the gothic direction that the book took was the most surprising element of the tale. I enjoyed the references to fairies, twin curses and the mysterious gardener. The sinister presence of the cliffs that surrounds Summerbourne also adds an extra layer to the tale. The family mystery that is at the very core of the novel was incredibly astute, it really tested my mind limits as I came to grips with the well timed puzzle pieces that were gradually handed over by Emma Rous. This is a book that really demonstrates the depths of self sacrifice, with a meaningful touch of unity at the end.The Au Pair is a tremendous debut novel that provided a perfect end to a big reading year. It isn’t often that a book arrives in your hands that contains eloquent writing, clever plotting, an amazing narrative drive and strong characters, which are all set to an overwhelming sense of place. I am so looking forward to the next novel by Emma Rous, I’m sure it will win me over, much like The Au Pair.*I wish to thank Hachette Australia for providing me with a free copy of this book for review purposes."}, {"Review": "Totally entrancing domestic drama! This is quite the page-turner and will keep you racing through to the end. You will be rewarded with all kinds of surprising twists. This entire story revolves around what actually happened on the day Ruth Mayes fell/was pushed from the cliffs on the same day she gave birth to twins. Seraphine is determined to unravel the truth, especially after finding a picture of her mother with just one baby. The story was presented from two time periods; one from the past with Laura (the Au Pair) as narrator, and another from present day with Seraphine as narrator. Information is doled out slowly throughout the book holding your interest even though knowing this could never really happen - could it? Overall a great mystery with a complex plot.Thanks to Edelweiss for an advance copy."}], "Genre": "Thriller", "ID": "37561550", "Desc": ""}