{"Name": "Death Prefers Blondes", "Image": "https://images.gr-assets.com/books/1534396048l/39073399.jpg", "Reviews": [{"Review": "Rupaul's Drag Race meets Ocean's 8 in Caleb Roehrig's upcoming \nDeath Prefers Blondes\n. This upcoming YA novel was really fun to read, folks. The non-stop action at times was slightly overwhelming, but overall \nDeath Prefers Blondes\n is a fun, fast-paced, multidimensional read, that will be perfect for those seeking a light mystery with a little flair. I'm not going to dive into the plot with this review, because I feel like it's best to go in with no expectations. Margo Manning, the protagonist, is a socialite by day, criminal mastermind by night. Breaking into museums, stealing diamonds from banks, you name it—Margo can do it. Margo teams up with her best friends, a group of men who like to partake in drag culture. #werk What a spin! With the group's attempts growing more and more difficult, Margo and team must decide if this life of crime is actually worth it—before it catches up to them. This novel was very reminiscent to the Bling Ring that happened in California circa 2008-2009. I think there was a movie about it as well...oh yes, with Emma Watson and crew. If you enjoyed that movie, I think you'll love \nDeath Prefers Blondes\n.\nDeath Prefers Blondes\n is not going to be for everyone. In fact, if I wasn't so saturated with psychological thrillers, I may not have been able to pick this story up. It's non-stop action 24/7, which can get grating for those looking for more character development. This dialogue based novel really polarize readers, and I think it will! I really enjoyed the humor, mixed with mystery in this novel, and I also really enjoyed how non-young adult \nDeath Prefers Blondes\n was, without it deviating too adult. Caleb Roehrig, \nDeath Prefers Blondes\n was a fabulously fun novel and I expect to see more from you in the future. "}, {"Review": "This review originally appeared on Novel Ink.I received this book for free in exchange for an honest review. This does not affect my opinion of the book or the content of my review.As soon as I saw Death Prefers Blondes being pitched as Ocean’s 8 meets RuPaul’s Drag Race, I was all in. (Because if there’s one thing I love more than queer YA, it’s queer YA that ALSO involves drag queens). And, friends, this one did NOT disappoint. Not only did the action scenes keep me on the edge of my seat the entire time I was reading, but I couldn’t help but fall lace-front head over six-inch heels for this whole cast of characters.I won’t go into any specifics about plot in this review, since Death Prefers Blondes is so action-packed from start to finish. However, I will say that we follow a main character named Margo Manning, a Hollywood socialite by day and LA’s most capable criminal by night. Along with her team of drag queen accomplices (and a little help from her own drag persona, Miss Anthropy), she pulls off some of the toughest, most high-profile break-ins around the city. We’re talking everything from stolen jewel heists to stealing priceless art from a well-guarded museum. One day, though, Margo’s fence offers her a sum of money she’s only ever dreamed of– but it would require her team to pull off a seemingly impossible job. Everything takes off from there, and the mystery at the heart of the book becomes increasingly more personal to Margo as new information is revealed.As a very character-driven reader, I sometimes struggle with plot-driven stories. However, in Death Prefers Blondes, even though I honestly could not care less about the elaborate action sequences– although, let me be clear, they are objectively VERY well-written– I was still 100% invested in the story because of how much I cared about the characters. Each queen in Margo’s crew has very specific motivations for their involvement in organized crime. There are Axel Moreau, AKA Leisl von Tramp, and Joaquin Moreau, AKA Anita Stiffwon, two brothers trying to keep their family afloat after their Hollywood royalty father landed in jail due to stealing money from the entire who’s-who of Los Angeles. There’s Leif Darby, AKA Electra Shoxx, who needs money to pay his dance school tuition in order to remain in LA, far from his homophobic family. There’s Davon Stokes, AKA Dior Galore, who is forced to pay off the drug dealers who his drag mother can’t stop paying visits to. And, of course, there’s Margo herself, who has her own myriad reasons for her involvement in LA’s criminal underbelly.In so many ways, Death Prefers Blondes was a love letter to found families and to queer culture. Every queer person will tell you that you naturally seek out other queer folks for understanding and acceptance, and nowhere is this more evident than in drag sisterhoods. In addition to all of our leading men in this book being queer, Margo is also bisexual, which is representation I was so not expecting but that made my heart SIIIIIING. This label is explicitly stated on page, and we also see her involved in relationships with people of multiple genders. There is also nonbinary rep in a side character, another wonderful surprise! And 3/5 main characters are POC, as is the love interest. Basically, Death Prefers Blondes proves that drag is not just for white, cis gay men. As a huge fan of drag, but a not-so-huge fan of RPDR and mainstream drag’s frequent disdain for trans, nonbinary, and bio queens– and also the RPDR fandom’s racist tendencies– this book was a much more inclusive portrayal of drag, which felt so much more true to the queer community that *I* know and love. Fans of drag will recognize a lot of the colloquialisms commonly associated with the community, which made me smile every time they appeared.Death Prefers Blondes also features a romance that I adored, between Margo and Henry Yang, a half-Asian, half- Hispanic law student who begins an apprenticeship with the Manning family’s lawyer. I especially appreciated how sex positive this book was in general, but particularly in regards to Margo and Henry’s relationship. Also, there was witty banter galore between these two. And if you’re going into this book looking for a cute #ownvoices m/m romance, you also will not be disappointed on that front! A romance develops between Leif and Joaquin, as well as the budding chemistry between Axel and Davon.As I already mentioned, the action sequences in this book, while not something I particularly cared about, were so well-described. Each high-stakes scenario had me on the edge of my seat. Really, the adrenaline never left me while reading Death Prefers Blondes, because there was always some looming threat on the horizon. The story is full of twists and turns that keep you on your toes. I also loved how dialogue-heavy this book was, mostly because the dialogue was extremely well-written.Overall, if you’re looking for a queer YA mystery with no shortage of thrilling twists and turns, Death Prefers Blondes is the book for you. It may be long, but it will keep you engaged and flipping the pages the entire way through, and you’ll totally fall for these characters."}, {"Review": "A heist-y book with drag queens, I’m here for it. I liked Margo and her friends. They’re smart and fierce af and absolutely loyal to each other. I enjoyed getting their own stories and that everyone had a specific and different reason for participating. And hooray for all of the representation: queer, bi, non-binary, and POC characters. Plot wise, it was a bit of a struggle at first. It took some time to get invested in what was happening, but once I was in, I was 100% in. This book starts off with a bang and doesn’t let go and it was quite a roller coaster. Yes, I’m being vague because I think it’s better to go into this story without a lot of info. Overall, the characters kept me reading. The ending definitely left an opening and I’m curious if there will be more. **Huge thanks to Feiwel & Friends for providing the arc free of charge** "}, {"Review": "Want to see more from me? Check out my youtube channel: https://www.youtube.com/channel/UCfer...*I received a copy of this book from the publisher in exchange for my honest review*Video review: https://youtu.be/rNqa0hZSoUUMargo Manning lives a double life. By day, she is a teenage socialite with a reputation for trouble. But by night, with the help of four Drag Queens, she pulls off some of the toughest heists imaginable. But, when bad news regarding Margo's personal life comes to light and a job goes wrong, Margo needs to decide what to do and who to trust before she puts those she loves in danger. The book is pitched as RuPaul's Drag Race meets Ocean 8 and if you know anything about me, you know that I FREAKING LOVE DRAG QUEENS so ass-kicking Drag Queens? EVEN BETTER. I was beyond excited to pick this one up and it DID NOT disappoint. The book is so fast-paced and action-packed it keeps you on the edge of your seat the entire time. I love d all the heist and fight scenes and the twists I didn't see coming. I think the book was very well-written in a way that made you fully invested in the story, its characters and the secrets they were hiding. I really loved the alternating perspectives between paragraphs, I think it was a really unique and fun way to tell the story! The book has such an amazing diverse cast. You can't help but becoming fully invested in each Queen and their backstories. Each Queen has a reason why they've joined Margo's crew of thieves and you root for each one. Axel Moreau (AKA Leisl von Tramp) and Joaquin Moreau, (AKA Anita Stiffwon) are brothers trying to keep their family afloat. Leif Darby (AKA Electra Shoxx) is trying to pay his tuition for an elite ballet school and Davon Stokes (AKA Dior Galore) who is trying to pay off the debt his Drag Mama has wracked up with her pill habit. Then you have Margo Manning (AKA Miss Anthropy) who is not only fierce but extremely loyal as well. The relationships explored between all of these characters were so well done. The brother relationship, romantic relationships between certain Queens as well as all the friendships formed were so carefully executed and I loved every second of it. The diversity in this book is so well done as well. 3 out of the 5 crew members are persons of colour, and Margo is bisexual and appears in relationships with multiple genders, including a person of colour as well! There is a non-binary side character which I was so happy to see the representation for. I absolutely loved Margo's love interest, Dallas. He is so sweet and the banter between the two of them is hilarious. I also loved the two relationships that formed between the four queens. I think that the book was very sex positive and I loved seeing that in a YA novel. If I had to give ONE complaint for the book, it would be that it did drag on a bit in the middle (clocking in at almost 500 pages), but I was so invested in these characters and the story line that it didn't affect me too much. I could go on and on about how much I love this book, but I really think you should pick it up for yourself and be immersed in this amazing cast of loveable Queens."}, {"Review": "tl;dr:Unabashedly queer and diverse, full of the importance of found familes, and a little bit about stealing from the rich to give to the poor! Death Prefer Blondes was a hell of a ride! Drag queens, art heists, found families, and of course some drama. The high stakes, and thrilling adventure is reason enough to read, but the exploration of themes of finding yourself within your community and being accepted for who you are and not just who your parents might have been really seal the deal.Ok let’s be honest, I love books, you know what I love more? Books about queer characters with unabashedly queer situations. If you haven’t figured this out yet, but there are drag queens in this book! DRAG QUEENS. Yes, the group of rebellious older teens dress in drag when they go on their heists, but some also perform at a night club. Hell to the yes! The book has been comp’d as RuPaul’s Drag Race and Oceans 11. So much yes, and so much more.Each person in the crew has their own backstory, some tragic, some are less than ideal, but they all have their reasons for becoming master theives. For Margo Manning, she may be considered “Mad Margo” by the media, but inside she’s a real life Robin Hood. Growing up rich, doesn’t mean she has it all. She doesn’t need the money she gets, like her cohorts, but she has been funding projects for the less fortunate. There is one thing Margo is, and that is fierce. She’s taking control of her life, even when it seems she’s out of control.We also have Axel and Quino, two brothers who were born into hollywood wealth, but lost everything when their father stole from his clients. The brothers bring their own level of drama, but they are both so necessary. Leif is risking his life to stay in LA and to pay tuition to his regal dance school and to finally be somewhere away from his homophobic family and community. And last but not least, Davon, who is helping pay off his drag mother’s debts.Each member of the crew has their specialities and their own reasons for being involved. I loved the fast paced, action packed heists.Let’s also talk about the representation in this book. Every main character is queer, and most are men of color. Margo is our token rich white socialite, but she is bisexual and finds herself interested in another person of color. So much rep that just made everything matter so much more to me while reading. Plus, I read some of the queerest phrases in this book that I kept screen shotting for my friends while reading! Because not often do I see things like this phrase in any book, but I am here for it! I literally laughed so loud.“And nobody says ‘floozy’ anymore. You’re in America. We say ‘thot’ now.”Death Prefers Blondes is full of thrilling adventure, sassy drama, high stakes, and all the wittiness you expect from Caleb’s books. I don’t care if you are straight or queer, read this book for a look into queer culture, importance of found families, and stay for the banter, romance and adventure!"}, {"Review": "FINISHED: 1/24/19Thank you to Macmillan for an advanced reading copy! I was a big fan of Caleb’s White Rabbit (I’m still meaning to read Last Seen Leaving), so Death Prefers Blondes was something I’ve been looking forward to. And, I mean, with a title like that, who isn’t intrigued?! This one took a while for me to get immersed in, and I think that’s because it’s plot driven, whereas Caleb’s other novels are debatably character driven. The characters in DPB are all extremely colorful and diverse — and their dialogue is FANTASTIC — but this is in no way a character driven novel, and I think that’s usually my personal preference. So that said, I probably wouldn’t have picked this up if it weren’t written by Caleb, but I’m glad I did. It was nice to step out of my reading comfort zone and try something different. Caleb obviously is a huge 90’s fanboy and loves the same things I do; his main protagonist, Margo, is on the level of Buffy Summers and Veronica Mars. And you can’t go wrong with drag queens thrown in the mix! If you’re looking for a super queer and fun YA heist, with some Veronica Mars and James Bond textures, look no further. 4/5 stars."}, {"Review": "If Robin Hood Were A Rich Teen Girl With A Crew Of Drag Queens! (TW addiction)This novel is a heist thriller with a murder mystery starring Robin Hood–if Robin Hood were a rich teenage girl with a crew of drag queens. I adored it! Margo Manning is a socialite whose father has more money then a person can spend in a lifetime so naturally she steals from the rich. And I mean she has a full-on operation with a fence, and help with gadgets, and a crew of teenage drag queens. The heist scenes are kick-ass, and read like scenes from awesome thriller movies–but this novel is far from just flashy fun scenes. Rather than stereotypical drag queen characters used just for fun quips we get to know the entire crew, including their personal lives and the how and why they ended up as thieves. The novel is about birth families, found families, trying to make the best out of terrible situations, social justice, and the wrong path for the believed right reasons. I absolutely loved every second of this ride Roehrig took me on. And if that isn’t enough of a sell, think of this book like Ocean’s 11 dated RuPaul’s Drag Race and the wedding reception got crashed by Hamlet.--from Book Riot's Unusual Suspects newsletter: https://link.bookriot.com/view/56a820..."}, {"Review": "I need to write a full review, but for now: OMGUpdated Review: Caleb Roehrig’s Death Prefers Blondes is a fantastic foray into the world of sophisticated crimes–all committed by teenagers. Margo Manning is well known for who her father is, the CEO of Manning Corporation. But Margo Manning’s crimes are well known too–from art theft to jewel heists.While Margo is rich, she has reasons for what she does: namely, Axel, Joaquin, Leif, and Davon also known by their drag queen names: Liesl Von Tramp, Anita Stiffwon, Electra Shoxx, and Dior Galore. While Margo and Axel began this out of boredom, they now do this because the crime pays well. After Axel’s and Joaquin’s father was sent to prison, their family was left fairly destitute and desperately in need of money. After Davon’s mother and father died, he was sent to live with a relative that didn’t approve of who he was so he finds himself homeless. And Leif is at a dance boarding school that his mom won’t pay for and needs a way to pay for it and to be free of his overbearing mother who wants to pray the gay away.Did I mention the drag queens? Yes, the crimes are committed by Margo, Liesl, Anita, Electra, and Dior. All highly trained in the art of various combats with Margo’s access to high tech tools through her father’s work, they haven’t been caught yet.Death Prefers Blondes begins right in the middle of a heist at the Los Angeles Museum of Fine Art. This book will immediately draw you in and will not let you go until you have finished the very last page.Throughout the story, we see the team pull several more heists before heartbreak and the heist pulled on the wrong person leads to impending disaster. If the team can pull off one last heist, they can potentially save what remains of a legacy, but in order to do so, they will need to rely on someone that they hardly know.Aside from the amazing plot, the details that Roehrig has put into each character makes this story even more special. Margo is bisexual, and we actually see her romantic interests in same gender and different genders. We also see gay rep and a little nonbinary rep as well.Roehrig’s Death Prefers Blondes will also have great crossover appeal to those fans of adult thrillers that normally scoff at YA literature. However, not to fear: this is definitely a YA work and not one where an adult book was written with adult characters were aged down to sell as YA. (I’ve read ones like that which is the ONLY reason I make the comment.)For those fans of Roehrig’s earlier works, while Death Prefers Blondes does feel quite a bit different, overall, it is without a doubt a signature Roehrig work. In fact, I think it’s his best work yet.Definitely preorder this one. "}, {"Review": "Thank goodness I am finally done with this. If you like heist novels and are okay with not knowing what is happening for the first quarter of the book, you might like this. I had such a hard time connecting to this novel. I did not like the characters at all in the beginning and by the end they were just fine-ish. I am not sure if this is due to the fact that I read an eARC, but we would just switch points of view in the middle of chapters, with no warning. There were no indications that we switched, which confused the heck out out of me. Also, since most of these characters do drag and we are introduced to them while they are in drag, I had no idea who any of the characters were and kept getting them confused for at least 15% of the book. Overall, this book has some great queer characters and the drag queen element was fun (if not mentioned enough), but I would have DNF'd this if I had not received a copy to review. *Thank you to NetGalley and the publisher for an eARC in exchange for an honest review*"}, {"Review": "Pitched as Ocean’s 8 meets “RuPaul’s Drag Race,” Caleb Roehrig’s newest release, DEATH PREFERS BLONDES, follows Margo Manning and her team of four fierce drag queens as they take on high-stakes heists. When Margo’s personal life takes a dark, rapid turn, she and her crew take on a job that could cost them everything.Ever since the fall of 2017, I have been a huge fan of Roehrig and his novels. I was highly anticipating DEATH PREFERS BLONDES and, let me tell you, it did not disappoint. I will be honest that this novel did catch me off guard in the beginning because it is very different from Roehrig’s previous two releases on many different levels. Despite the changes made, I found that DEATH PREFERS BLONDES is by far my favorite of his three novels.For one, I love that the audience gets to see a female protagonist at the helm of this story. Margo Manning is such a strong, kickbutt leader who I absolutely adore. Her ability to take charge and take risks to defend her family is highly admirable. Her crew definitely is not left out of the spotlight, though. Each of the drag queens gets their own unique storyline that allows their individual personalities to shine. My favorite thing about Margo and her team is that, regardless of their fun and entertaining nature, they are all still very flawed and complex. They each have their own personal struggles that help make them more three-dimensional, honest and human. Roehrig is truly phenomenal at developing characters and this novel is no exception to that rule. I hope everyone else who reads this story falls in love with this crew as much as I did.As readers in the young adult community, we strive to make diversity in the stories we read a priority. We want to read about stories different from our own to be more educated and to be more empathetic. DEATH BEFORE BLONDES is the perfect diverse read to help any reader towards this goal. I know that I have very little knowledge on drag queens, but I loved getting to learn more through these characters about this culture and lifestyle that is such an integral part of their identity.While I don’t want to spoil too much of the plot, I will say that the story in and of itself is very fun and fast-paced. There are constant twists and turns that leave the audience fully immersed in the story and invested in the characters and their stakes. The novel has its lighter moments, but time is devoted to discussing some rather serious issues. I loved getting to see this added dimension to Roehrig’s story as it only helps to make the novel more complex and intriguing for the audience.I absolutely adore Caleb Roehrig and his novels! If you love for fast-paced, entertaining and diverse thrillers, I could not recommend DEATH BEFORE BLONDES enough! It may just end up being one of my favorite reads of the year!"}, {"Review": "So many stereotypes, so little time. Death Prefers Blondes is yet another promising premise failing to live up to its potential. There are a few things that are great about this book but they aren’t enough to lift it out of the morass. Drag queens, socialites, robbery, and revenge should be a winning combination, a fresh twist on a tired genre, but Roehrig fails to deliver. Switching POV from one paragraph to the next is only one of several major faults in this work, jarring the reader out of the narrative and leaving them scratching their head. There’s nothing wrong with internal monologues but in this case the inconsistent shifts, coupled with telling, rather than showing the reader the significance behind words and actions, took a great deal of fun out of the narrative. And the generic characterizations, barring the drag queen aspect, were just that: generic and boring. Add ten or even twenty years to each of the stated ages of the characters, and almost nothing in the story would be any different. Their interactions, the problems they face, their dialogue, everything with the exception of high school attendance, would be exactly the same and it wouldn’t change the story at all. Substitute college or job and it’s still exactly the same motivations and relationships. There’s really nothing that sets these characters or their worlds apart. Tired tropes of “poor little rich girl,” “misunderstood loner,” and “little-brother-fighting-for-recognition” have all been done before, and much better. It’s sad when a story that could be great has a stumbling start and never succeeds in rising to the occasion. Two stars (one for the premise and one for pity.) Thanks to NetGalley for providing an e-copy of this book in exchange for my honest review. Sorry I didn’t like it. "}, {"Review": "\n4/5 stars\nYES YES YES. I KNEW I WAS GONNA LOVE THIS BOOK. What’s there not to lose?? Undercover teenagers going on heists and robbing for millions??? And then murder plots and SO MANY STAKES!! Also, queer characters!! YES PLEASE.Oh my god, I loved these characters so much, I cannot even begin to describe. It’s a close choice between this group and Severin’s posse from The Gilded Wolves. But, I mean, I just loved this so much. And there was Margo, who pretty much takes the crown for the most slaying blonde, after Reese in Legally Blonde. And then the four drag queens!!! AAHHHH I LOVED THIS SO MUCH. They were all so good at thievery, and I just loved this concept so much; it’s the most unique group of damaged teenage rebels I’ve ever read about. SO LIT.The Axel-Davon dynamic took me completely by surprise, and Joaquin-Leif was just the most adorable thing ever. I really liked Dallas’ role in this book, and it was awesome how he wasn’t just the love interest, but played a part in their final heist (or, pre-final, actually). I loved how each character grew, matured, but remained true to their integrity. It was the true spirit of radical teenagers with shitty lives.I didn’t have it in me to give this a full five stars, since I was lost in their missions sometimes; I wouldn’t read it all thoroughly because sometimes, I just couldn’t picture what was happening, and it was all so fast. But, it’s a definite recommend for LGBT rep, action and conspiracy, and hints of subtle romance.Death Prefers Blondes is an addictive, riveting, stunning novel, and I got all that I expected when I dived in, plus some more."}], "Genre": "Thriller", "ID": "39073399", "Desc": ""}