{"Name": "Two Can Keep a Secret", "Image": "https://images.gr-assets.com/books/1531316524l/38225791.jpg", "Reviews": [{"Review": "\"If I believed in omens, this would be a bad one.\"This is a difficult review to write, as I was so taken with McManus's debut last year, but as an adult reader I didn't feel her sophomore effort lived up to the hype I had created in my head. Obviously this is no one's fault but my own, and as a novel for YA readers I think it will be well received as it still gives off a similar vibe as One Of Us Is Lying, although I found this one to be much slower paced and less twisty than her previous work. Personally, this was more of a 2-2.5 star read, but I feel the YA audience will feel this is an overall positive experience and the final twist in the last line of the book will blow a good number of readers out of the water. ----------Beyond thrilled to announce that this is our #ScaredSuspenseBookClub pick for January 2019! If you'd like to join in with our discussions, please follow our new account over on Instagram, @scaredsuspensebookclub. <3"}, {"Review": "the saying goes that ‘two can keep a secret if one of them is dead,’ but what isnt mentioned is that secrets like to be shared. its in their very nature and karen mcmanus definitely understands that. this book is full of secrets just dying to get out!and whilst i didnt think this was quite as good as ‘one of us is lying,’ it definitely does not feel like a sophomore slump of a novel. its fast-paced, clever, and downright mysterious. i actually didnt find this to be predicable, which is the case with most YA thrillers, so that was exciting for me. i enjoyed how my opinion of everyone and everything constantly changed as the story progressed, and i think thats a sign of good storytelling. and really, the only issue i have is with some particular writing style choices that made the story feel a bit disjointed. for example, a chapter ends right in the middle of a scene/situation. the reader is then told what occurs next through little introspective flashbacks via a main character in the next chapter, which happens to begin halfway through the day after said scene/situation. this happens consistently - its just a weird way of telling a story to me and not really beneficial in any way. i feel like a much more consecutive storytelling method would have been more effective.regardless of my nit-picking, i really did enjoy the book. its entertaining, discreet, and everything i would expect from KM. if you enjoyed ‘one of us is lying,’ then you really need to pick this up ASAP! ↠ 3.5 stars"}, {"Review": "4.5 stars.With \nTwo Can Keep a Secret\n, her follow-up to the excellent \nOne of Us is Lying\n (see my review), Karen M. McManus proves she's not a flash-in-the-pan talent, but rather a pretty terrific storyteller, one who is tremendously skilled at depicting the complex behaviors of teenagers, and the mysteries that unfold in front of our eyes.Ellery and her twin brother Ezra have to leave their California home and move to Echo Ridge, a small town in Vermont, and live with their maternal grandmother while their mother goes to rehab. They've never been to Echo Ridge before, and barely know their grandmother, despite the fact that their mother grew up there, and was even crowned homecoming queen. But that night, their aunt (their mother's twin sister) disappeared and was never seen or heard from again.Their aunt's disappearance wasn't the town's only tragedy. Five years ago, Lacey Kilduff was crowned homecoming queen and was then found murdered shortly thereafter. It's a crime that affected many in Echo Ridge, as the murder was never solved, yet many town residents have their suspicions about who is guilty, and they take it out on anyone connected to him.\"'I should probably preface this by saying...I think about crime a lot. Like, an abnormal amount. I get that. It's sort of a problem. So you have to take what I say with a grain of salt, because I'm just this...naturally suspicious person, I guess.'\"For someone fairly obsessed with true crime, a town with as many secrets as Echo Ridge is a treasure trove for Ellery. Not only does she want to understand what happened to her aunt Sarah all those years ago (not to mention why her mother has kept them from Echo Ridge), but she begins finding clues to what might have happened to Lacey. And when it appears that someone is threatening to harm another candidate for homecoming queen, Ellery is determined to uncover all of the answers—but it may put her own life in danger in the process, because someone wants to keep the town's secrets hidden.Just like anytime I read a book that has any type of mystery component, I'm immediately suspicious of everyone. A new character shows up? Bam, they're a suspect. The funny thing is, McManus really did keep me guessing here, and while I wasn't shocked with how things resolved themselves, I wasn't disappointed either. There definitely were some good twists to be had here, and McManus gave you characters to root for and characters to instantly dislike. (And here's a funny point—this is the third book I've read in the last year with a main character named Ellery.)A hallmark of YA books is characters that are more articulate and sarcastic than most adults, and while that's certainly the case with the characters in \nTwo Can Keep a Secret\n, it felt right here and didn't detract from how much I liked this. I also liked the way diversity was presented as almost an afterthought—there was too much going on in the high school and around town for anyone to focus on someone's sexuality or ethnicity. (I would have liked a same-sex relationship thrown in, but I know that wasn't the focus of the story.)As far as I'm concerned, McManus is now two for two, and seeing as I started this book the day after it was released, I'll probably have a while to wait until her next book. I'm sure it will be worth the wait, but until then, I love marveling at the incredible depth and breadth of talented writers creating such fantastic YA books these days. See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2018 at https://itseithersadnessoreuphoria.blogspot.com/2019/01/the-best-books-i-read-in-2018.html."}, {"Review": "Ok so this was EXCELLENT and exactly what I want a thriller to be! Usually I'm tentative about thrillers and One of Us Is Lying, while I admire it for being super-famous, it didn't click so much for me. However this one?! Miiiiine. It had the small town vibes, an autumn-y Halloween aesthetic, siblings dynamics, took time to develop the characters, and it had muuuuurder. Obviously. It is literally a murder mystery. But someone must be Captain McObvious here and I volunteer.anyway. ➸ I really cared about the characters!That's what I want out of a book, ok!? Make me CARE. (Which is hard with my stone cold little rock of a heart.) But the book balanced developing the twisty murder mystery AND developing both the narrators (Ellery and Malcolm) into dimensional and complex humans who need a hug several times during the course of the book. Or two hugs, in Malcolm's case. Kid had it rough.✧Ellery: So she just moved to Echo Ridge (while her mum is in rehab) and she and her twin brother, Ezra, are staying with their estranged grandma. Ellery has a bushel of curly hair, possibly Latinx complexion (unsure of her dad), and a deep love of murder mysteries. Her brother is the chill sweetheart who frequently has to say things like: \"NO MURDER BEFORE BREAKFAST ELLERY.\" And I loved them so much. (I wish Ezra had been more developed though. He's queer, but he's just a sliver of the storyline so.)✧ Malcolm: Ok so his older brother is the aggressive angry jock dude, who was heavily suspected in his girlfriend's murder several years ago. Never arrested though. But Malcolm lives in that shadow, despite his mum having remarried this rich flashy lawyer and now Malcolm's actual step-sister is like the QUEEN BEE of highschool. But anyway. Malcolm is a little nerdy and dorky and Soft™. I absolutely adore how his relationship with Ellery was really slowburn, despite the shortness of the book. I lowkey suspected him of murder at one point but like ¯\\_(ツ)_/¯ I SUSPECTED EVERYONE. SUREFIRE WAY TO BE RIGHT AT THE END.➸ The plot had me super invested.I think because I cared about the characters so easily? But I wanted to know if these string of missing-girls was connected. It reminded me of Sadie a bit, when they called out how missing girls need to be taken seriously, not just called a statistic. It's twisty and there's lots of theories with Ellery playing detective (but she's not obnoxious about it). I called one of the twists about her mother's past! I'M PRACTICALLY SHERLOCK. Nevermind that I was lmao so wrong about the murderer. Anyway.➸ I do confess the amount of characters had me afloat down a river with just a paddle-pop stick to cling to.There were so. many. names. I forget my own name frequently and have been known to collectively refer to my nephews as Frank because *waves vaguely* too many. help me. Occasionally they'd throw in a name and I'd be like: WHO. But otherwise, I did ok! I think! Especially when everyone had like super common names (LIZ, SARAH, MIA, DAISY, BROOKE, OH GOD).➸ It was really satisfying.I just enjoyed myself ok?! I had a thoroughly good time reading this and ok ok it wasn't the wildest mystery every. My heart didn't bust out of my chest. But it felt like a sinister contemporary, full of autumn leaves and family secrets, with a background of murderrrr. Perfect for me."}, {"Review": "Here's the thing: I'm not necessarily the biggest fan of YA thrillers as an overall genre, but there's something about Karen McManus's work that pulls me in and keeps me frantically flipping pages until the end. Definitely part of it is the characters, who are given just as much weight as the plot. But there's also how the overall tone strikes an uncanny balance between dark and light, seriousness and levity, respect and irreverence, that is so exactly the teenage way.Also: while I loved Ellery and Malcolm, a lot, Ezra and Mia need their own book."}, {"Review": "4 I Didn't See That Coming StarsEllery and her twin brother arrive at their mother's hometown of Echo Ridge in a hail storm to discover a body on the road - a local high school teacher victim of a hit and run. That welcome was merely the beginning. The twins quickly find their new home is seeped in secrets, disappearing girls and murder. It all began with the disappearance of their mother's twin sister on Homecoming Night. Her disappearance may have remained unsolved but its effects ran deep both within their family and the community at large. Fast forward 5 years and another Homecoming Queen, Lacey goes missing and ends up dead. Now, the twins find themselves in the middle of yet another mystery when the town in besieged with bloody messages, broken dolls and other ominous threats to members of the current Homecoming Court. \nAre all these events related? What evil lurks in Echo Ridge?\nI was a huge fan of McManus' first book, One of Us is Lying so I had high expectations for her second novel. While I found this one engaging I definitely wasn't as blown away as I was with the first book. Still, it was a fun read. Echo Ridge and its inhabitants were interesting, creepy and felt like a guilty pleasure to read about. It seems like everyone had some skeletons hidden in their closet which added to the whodunnit aspect. I kept going round and round, changing my mind on who the \"bad guy\" was and speculating on their motive. I was a bit underwhelmed by the reveal but I think I just wanted/expected a bit more after One of Us is Lying. My mind had certainly come up with a few outlandish theories that I was hoping would be correct! All in all, a strong sophomore effort by Karen McManus. I look forward to seeing what else she comes up with. Keep it BIG Karen - you know how to do that well!"}, {"Review": " All of Fright Farm's success is based on how much people love to be scared in a controlled environment. There's something deeply satisfying about confronting a monster and escaping unscathed. Real monsters aren't anything like that. They don't let go.\" 3.5 ⭐️I did enjoy Karen McManus' second novel, but it didn't blow me away as much as One of Us is Lying did.Ellery and Ezra have moved to their mother's home town of Echo Ridge with their grandmother, while their mum is in rehab. Echo Ridge is famous for its Homecoming Queen murder. Lacey, a few years older than the twins was murdered in the fair ground then known as Murderland before it changed its name.Before that, when their mother was in school, her twin sister disappeared, but was never found.Now it seems the Murderland Killer is back. There is graffiti everywhere with threats; who is behind them and why? And when another girl going missing - things are looking grim.When Ellery is one of the targeted homecoming Queens, tensions are high. I liked that the plot kept me guessing, and that we had no idea who could have been behind it. I was pleased with the final reveal. The only part I didn't like much was (view spoiler)[we are told that Sarah (Ellery and Ezra's Aunt) was killed mistakenly, because the killer thought she was her twin sister Sadie. But 1. how does a killer not know who he is killing? And 2. Why did he want to kill Sadie in the first place? The other girls are killed because he was sleeping with them and they were going to blab. Is this the same case for Sadie? As it is never entirely explained. (hide spoiler)]Overall, entertaining enough. Just not enough lovable characters as One of Us is Lying, and a few loose ends I felt needed tying up, just not as polished I thought."}, {"Review": "3.5 Stars! This was a fair and enjoyable read.I have no intentions of picking up One Of Us Is Lying, but I decided to give Two Can Keep A Secret a chance. It was not the most notable young adult thriller on the market, but I enjoyed my time reading. CW: murder, grief, talk of substance abuse, statutory rapeIf any other readers happen to be confused if they must read Karen M. McManus’s first novel to understand her second (as I initially was), you don’t! They’re totally separate stories. As I have not read One Of Us Is Lying, I can’t exactly compare the two. Based off of reviews, what I can say is that Two Can Keep A Secret seems to have made great improvements in terms of representation. I was surprised to find out the main twins are latinx (one of them being gay) and there are two Asian side characters (one being bisexual). I can’t say for sure, but it seems as if the author made deliberate improvements in creating characters free from stereotypes and I was pleased to see this inclusion.I did enjoy the writing of this book. It’s not super flowery or dense and was easy to devour. One issue I did pick up on is the novel was VERY repetitive. I feel like every chapter, we were given a recap on what had happened in the past and how it ties into what is going on in the present. I just did not need a constant summary of the girls who had gone missing in past years and it did weigh down the book at times.The characters were fine, but nothing special. I actually think each person would have benefitted from more development, as I can’t say much about them beyond their role in the story. The mystery was alright, but the majority of the novel didn’t WOW me. I was shocked by the final reveal, which is a plus because I’ve been fairly underwhelmed with some of the thrillers I have read recently. The END END of the novel was also super unexpected. It left a lasting, chilling impression I was not prepared for.Two Can Keep A Secret isn’t at the top of my favorites list and there are distinct problems I had with it, but I overall really enjoyed my time reading this book and am definitely happy I spent my time on it. If you’re looking for the most amazing thriller to ever grace bookshelves, this ain’t it. But if you just want a simple mystery thriller to have fun with, I think it’s worth the read. "}, {"Review": " 4 stars! Every single time I read the title of this book I had the PLL theme song running through my head.Gotta say, McManus's sophmore novel knocked it out of the park! She is a officially an author I will be revisiting again and again in the future. If only she would write faster......TCKAS is about twins Ellery and Ezra who move in with their grandmother after their mother goes into a care facility. Before they were born, their aunt had gone missing, about 5-6 years before another girl went missing. And not soon after the twins arrive in town threatening messages begin popping up everywhere leading the town to believe there's a killer ready to strike.I really enjoyed this book, it was a great balance of teen soap (like a CW show) and a genuine mystery novel. I got some serious Riverdale and Pretty Little Liars vibes from this story and the characters. I honestly did not guess who did it, which I normally do. It may be obvious to other readers but I was stumped and that was a refreshing change for me.I devoured this book, if you are on the fence I highly recommend giving it a try!Follow me on ♥ Facebook ♥ Blog ♥ Instagram ♥ Twitter ♥"}, {"Review": "Two can keep a secret...if one is dead.i.e. Two alive people could never keep a secretAnother absolutely fantastic book by the author of \"One of Us is Lying\"!This is another book that confirms the truthfulness of the following rule: “NEVER start a new book, when you go to bed\". You may not get any sleep. If it is a mystery book highly anticipated to read, you know that you will love it and you most probably stay up all night trying to solve the mystery and find who is the murderer before the last chapter.Well, I never listen to advices anyway, I never learn....and I always repeat my previous mistakes. Maybe because they made me have fun.So, yes I stayed up all night reading and trying to discover the murderer of the two homecoming Queens from a small school in a small town in the middle of nowhere near a Halloween inspired theme park. The disappearance (murder???) of the first girl and the death of the second girl had many years difference and the murderer and his reasoning were never found out.Now there is a new school year, a new homecoming party and three new girls for the role of the new Queen. One of them is the niece of the first Queen who disappeared. Ellery and her twin brother Ezra are new in Echo Ridge. Their mother is in rehabilitation and the two teenagers will need to live with their grandmother.Ellery has a sharp mind and the attitude of an investigator.When strange things set in motion, when scary threats are made to the girl who are nominees for the role of the Queen, when one of them disappears Ellery will decide to investigate.The brother of the guy who is suspected for the murder of the second Queen will be her assistant, aka Malcolm. Nice and quite guy. He had never become the star athlete that his brother was in high school. And after the murder of the second girl, his family tried to lay as low as possible.The atmosphere of the book is mysterious (ha ha).There are so many players to keep track of. And the story and the solution in the end are really complex.Let me just mentioned a few questions that kept popping up:1.\tWhat happened to the first girl2.\tWhat happened to the second girl3.\tIs another girl going to disappear and who will that be4.\tWho killed the teacher 5.\tWhy Malcolm’s brother is back6.\tWho puts scary graffiti on the walls7.\tWho is Ellery and Ezra’s true father8.\tWhy the post popular kids in school act so strangely 9.\tWhy the police investigator always so nervous around the twins10.\tWhat happened to Ellery's suitcase 11.\tWhy Ellery’s mother never talks about her sisterEtc. Etc. Etc.And are all these events interconnected or they are random facts and events?The story has two points of view by Ellery and by Malcolm and the main events take place in just two months time.Highly recommended, just don't started before bedtime 😋"}, {"Review": "McManus does it again! Certainly no sophomore slump with Two Can Keep a Secret! I absolutely loved this story of a town with dark secrets that are seemingly resurfacing again. Twins Ezra and Ellery are staying with their Nana while their mother is doing a stint in rehab - however, they don’t know much about their mother’s hometown, where her twin sister was killed years before and when they move to the town and hear of other murders, they start asking questions, but what happens when they hear the answers?Told in a suspenseful way that had me guessing and theorizing until the very last page, this book gave me everything I love from my YA books!Thank you to Random House Kids for an advance copy. All opinions are my own. "}, {"Review": "\nalright, alright, alright.....\nThis may come as a slight surprise to some folks who already know that I DNFed McManus' previous book, One of Us Is Lying, but I'm going to give this one a rating of 4 stars. \nAll three of them look like the kind of teenagers you'd find on a CW show—too beautiful to read.\nLiterally, this whole quote encompasses everything I feel about this book. Think Riverdale, Pretty Little Liars, and even The Vampire Diaries. What do they have all in common? Pretty people in the midst of tragedy and horror— a mysterious circumstance, a harrowing mystery itself, surviving amongst themselves and falling in love here and there. Not saying that that's whole book but then again,....it kinda was. I went into this book with very, very, and when I say very....I mean hell of a very low expectation. Thank god.I don't think I would have give this book the rating I did just now. It's somewhat slow and trudging, a quiet and ambivalent mystery set in a small town with a tragic past.....the usual trope most thrillers go by with a setting in a small town. However, however.....there were so many aspects I liked about this book that elevated the story from my rather 'low expectation' into something better, something more enjoyable, and surprising. 1) Twins. I really liked these two characters although I wish we had a main focus on the brother twin, Ezra, and not just the sister, Ellery, who had the main POV. 2) Poking sentimental fun and knowing where it stands. I think this book knows where it stands on a line of believability and realism. It pokes fun and calls back tropes of certain soapy high school TV, like the CW, mean girls 'wearing pink on Wednesday. It knows exactly what it is and I respect that. 3) The last 10 pages. I would have given this book a 3 star rating if it hadn't been for those last ten pages. The book itself didn't bring anything new to the table; but there was such a monstrosity of surprise out of nowhere I was completely delighted to find that I enjoyed it immensely. The ending was somewhat rushed and I wish it could have expanded juuuuuust a bit.....but that very ending.....wow. What I didn't like: 1) Romance. UGH. Of course. Not really great and could have skipped it altogether. 2) Not enough thrills or tension. 3) Small towns with too many blonde-hair and blue-eyed people scare me more than Michael Myers or Freddy Krueger......pretty sure they were white too but the point is, there are some diverse characters sprinkled here and there. But then again, they either don't do much or get sidelined. Actually come to think of it, most YA books are better with representing diverse and queer characters more than the actual adult thrillers I usually read. Holy shit this review is looooong wtf I was not expecting to write this much or be as critical LOL. Honestly, if you're looking for something thrilling and fast paced, I'm not too sure this might be the book for you. It's rather unremarkable in terms of the small town mystery so many other books have done before and rather slow and unprecedented in it's mystery and pacing but........I think if you go into this one without expecting much, the outcome will be much, much greater, with happier and better results. \nPerfect\n for anyone looking to try out the genre though. Definite recommend if you're looking for that. Twitter | Bookstagram | Youtube |"}, {"Review": "*Thanks again to Penguin Random House for sending me an ARC of this book via NetGalley in exchange for an honest review.* Last Christmas, I read One Of Us Is Lying and I really enjoyed it, so I was very excited about getting an ARC of this book and thus being able to spend another Christmas reading one of Karen M. McManus's novels. Just like Karen's first book, Two Can Keep a Secret was a very quick read and I really enjoyed it. I'm still absolutely in love with her writing style because she just has a way of drawing you in and glueing you to the book. But while Two Can Keep a Secret was another very gripping novel by her, I have to say that it just wasn't as suspenseful as One Of Us Is Lying was. That book just left me guessing a little more and almost till the very end, I didn't really know how everything would be wrapped up. This time around, it was definitely a little easier to guess what had happened. However, one thing I really loved about this book was the cast of characters even though I wish that Ezra and Mia had gotten a little bit more screen time. Also, I sometimes mention great first sentences in my reviews of books but Two Can Keep a Secret had an amazing last sentence instead!So all in all, Two Can Keep a Secret is definitely a 2019 release you should check out. It's a great mystery novel with a gripping plot that one can easily read in one sitting and I definitely don't regret that I preordered a final copy of this several months ago.instagram || my blog || twitter "}, {"Review": "3.5 stars. I think I can safely say I loved One Of Us Is Lying much more than this one. It was a 5 star read for me. I also enjoyed reading Two Can Keep A Secret. I think McManus is a very good writer. She builds suspense very well and makes you read the book without being able to put it down. However, this book was not flawless for me. First of all, there was an obvious cue to the killer. Second, the simplicity of the first book was not in this one. I think she wanted to create a more complicated scenery and overdid it. There were too many coincidences, unrelated suspenseful events and people trying to take your attention from the main plot. But, according to me these lead the book to be more cliche than anything else, because these are the classic methods crime writers use to make you confused so that you don't guess the criminal. Apart from this, because we had so many things going on, the criminal remained as an unopened chapter. There was no development on that, no background, no reasons explained. So, the build up was very good, but it was complicated with too many sub plots which lead to a somewhat unsatisfactory ending. This put aside, it was still an enjoyable, very suspenseful read, and I'd read from the writer for sure in the future. If you haven't read anything from her, I'd recommend One Of Us Is Lying more than this one. Thanks so much to the publisher for providing an ARC in exchange for an honest review. "}, {"Review": "After last years big success of One of Us Is Lying I couldn't wait for the author's next book to be released.If you love mysteries, and you enjoy contemporary YA novels - this book is the right one for you. It had everything I liked about this genre. Lots of twists and turns that kept me guessing from beginning to end. Some YA drama and many likable characters. And a wonderful crisp and vibrant writing style.Two Can Keep a Secret was told through both Ellery and Malcolm's POV.Both characters were down to earth, likable and added their own flair to the story. Ellery was new to town and had this knack of asking all kinds of questions. After her aunt went missing she really got into the true crime subject and it showed. Her entire persona was slightly mistrustful and skeptical - which worked well for a mystery. Malcolm, on the other hand was slightly dorky, but very kind and a perfect partner in crime. Interestingly enough, both were connected to the town's macabre past in different ways. And both had reasons to be vary about the new missing person's case.I would never compare this mystery with one written by Robert Galbraith or such. But for me it delivered exactly what I was looking for. An entertaining read, that kept me guessing, and made my car rides so much more enjoyable. The writing was excellent, and easily sucked me in. Dual narration made the entire listening experience pleasant and easy. Additionally the plot was very well executed, like I mentioned above I didn't know who did what until the end.I didn't personally love how the climax was resolved, it felt kind of sudden and not as exciting as it could have been. But other than that I adored this YA mystery/suspense novel, and can't wait for the next book by Karen M. McManus to be released.✵ ✦ ✷ ✫ ✷ ✦ ✧ ✵ ✧ ✵ ✦ ✷ ✫ ✷ ✦ ✧ ✵ ✧ ✵ ✦ ✷ ✫ ✷ ✦ ✧ ✵ ✧ ✵ If you want to chat with me about books, find me on Instagram For more of my reviews:My Blog: Book Twins ReviewsFacebook Blog PageTwitterSubscribe to Blog"}, {"Review": "5 “never guessed who did it” stars First of all I want to thank Random House Children/PRH Global to give me this opportunity to read this advanced reading copy of Two Can Keep a Secret. Karen McManus confirmed her title of queen of YA murder/mystery!\nI rarely do read mysteries but I happened to have read an ARC of One of Us is Lying in April 2017 and I was blown away. Karen McManus had my rapt attention right from the start of the story and had me finish the book readwalking to work. When I knew she would release \"Two Can Keep a Secret\" I was overjoyed to get the opportunity to review it in advance!Would it be as good as the first one?When you hit it big with your first book it can put tremendous pressure on the author for the second book so would Karen deliver?\nYes, she did!\n It all began with the twins Ellery and Ezra going to live with their grandmother in the small town of Echo Ridge as their mom is being forced to attend rehab.It is a dark and rainy night when they land and going to Echo Ridge they discover a dead man on the street victim of a hit and run.You already are into the story: night, pelting rain, abrupt stop of the car and the discovery of a corpse.\nWho did it? Why was this beloved science teacher killed? Is it fortuitous or premeditated?Next question: is this linked to the disappearance of the twin’s aunt twenty years ago as it is hinted in the book summary?If so how? Soon enough there will be more threats happening at Echo Ridge with bloody messages and broken dolls, targeting the future homecoming queens. As another homecoming queen Lacey was murdered five years ago. If your dream is to be crowned prom queen you'd better not live in Echo Ridge or risk a bloody death.The story centers around a few key protagonists and we have it told from a dual POV.\nThe first one is from Ellery.\nEllery is passionate about true crime stories. Imagine a teenage Miss Marple trying to solve the mysteries: that of her aunt’s disappearance twenty years ago, Lacey’s murder five years ago and the serial killer leaving bloody threats everywhere.Who is guilty?\nWas it Declan, Lacey’s boyfriend like every evidence pointed to years ago? He is back in town so maybe he would fit?Was it Officer Rodrigez? Always clumsy and seeming troubled when Ellery meets him.Was it …. The second POV is Malcolm’s.\nHe is Declan’s younger brother and living with her mom and his rich stepdad’s family.Discreet, handsome and …wondering why his brother is back in town. Five year after the death of Lacey and just when strange events take place and threatening messages appear. Round and round we go. Karen McManus once again aligns her clues like a game of chess. Leaving hints here and there to keep the ball rolling. Every hypothesis seems plausible until we hit a loose end.Talk about a goose chase!I loved how my brain at to work extra hard to guess the murderer and till a very long time I was so far off the mark! Granted I am no crime specialist but it still seems that Mrs McManus has the knack to hide her game and keep us guessing all along! Mystery to solve aside, the characters are easy to connect with and provided with enough background info they feel real and relatable. Ellery was a typical teenager who is obsessed with solving mysteries while struggling with bad parent’s problems and going for the cute nerd.Malcolm played his part of a little brooding, a little shy love interest with the added bonus of trying to help solve the mystery. He was not so close from his brother and was never certain that he was not involved one way or another in the dramatic events. Handy when you want to keep the reader on his toe! Everything ran smoothly like a well oiled machine and I could not find many faults in this gripping YA murder story.I simply had a fantastic time! Recommend it? Oh yes! I already know that I am in for the next book of Karen McManus!  Have you read her other book One of Us is Lying? Do you like YA mysteries/murders? Thanks for reading! Sophie Find me on:Wordpress:  Beware Of The ReaderFacebook:  Beware Of The Reader Facebook group :  Beware Book Boyfriends Alert Instagram:  @bewareofthereader Twitter:  @BewareOffReader "}, {"Review": "If, like me, you are a fan of Kara Thomas then you will love Karen M. McManus.Echo Ridge is a small town marred by tragedy.1996 – High school senior Sarah Corcoran vanished while walking home from the library. She was never seen again.2014 – Homecoming queen Lacey Kilduff, was found dead beneath the Ferris Wheel of the appropriately named Murderland Halloween Park. Her Killer was never caught.2019 – Someone is targeting the girls elected to homecoming court – leaving threatening messages in public places around town. Then, another girl disappears.My first read by supremely talented Karen M. McManus was a phenomenal experience. A few pages in and I was hooked. That last page sent chills down my spine. (view spoiler)[DO NOT READ FURTHER IF YOU HAVEN’T READ THE BOOK. Even though I understand Ellery’s reasons for wanting to protect her vulnerable mother from the truth, I think going through life not knowing what happened to her twin sister is worse. And what about her nana? Doesn’t she deserve closure? Not only that, she is keeping secrets from Ezra, a person she has shared everything with, as well as being less than honest with Malcolm. Isn’t there a possibly Sarah’s fate might come out at trial? Peter Nilsson could make some kind of deal? Ellery’s putting a lot of trust in him staying silent? (hide spoiler)] The first half was very much character driven, which really worked for me, because I loved these teen characters. POV’s alternated between Ellery Corcoran (her Aunt Sarah went missing twenty three years ago), and Malcolm Kelly (his brother was the police’s main suspect when Lacey Kilduff was murdered). Not only were both characters likeable and relatable, but even if there hadn’t of been a mystery element, I would’ve enjoyed reading about Ellery’s twin bond with her brother Ezra, Malcolm’s friendship with Mia, his troubled relationship with his brother, Declan, and the budding romance between Ellery and Malcolm. This is very much a novel centered on trust and loyalty between siblings.The two past mysteries had me feeling uneasy right from the beginning. Because of this it didn’t matter that the present suspense was gradual. Gave a chance for my anticipation and expectation to build, and for me to become embroiled in the lives of the characters of Echo Ridge. Then, when something did happen, I was a lot more emotionally invested, afraid, and tense. A punch to the gut, for sure.Echo Ridge was the perfect setting for this novel, with feelings and resentments running deep, because in a small town everything is that much more personal, since everyone knows everyone. The town layout was described in rich detail, and a large cast of characters added depth and realism, bringing the setting to life. A pet hate of mine in YA is an under representation of adult characters, so I’m happy to report that wasn’t the case with this story. Our two protagonists interacted with adults on a regular basis, and even better, parents, guardians, older siblings, etc, were given actual, crucial-to-the-plot, backstory’s Outstanding YA tends to be a bit hit and miss for me, so when I discover an author like Karen M. McManus I’m going to stick to her like glue."}, {"Review": "This was intriguing but I did like the One of Us is Lying more, but that should not take away from this book because it was good. I found the characters interesting to read about and I was completely into the plot. Those final words of the book were some of the most chilling I have read in a while. Creepy for Ellery! Oh and this town does not know normalcy. That is for sure. Simply put, this is an engaging book even if you find you are not as satisfied as One of Us is Lying made readers! My quick and simple overall: intriguing and highly engaging! "}, {"Review": "Did you read There's Someone Inside Your House by Stephanie Perkins last year? If so, you just figured out the plot to Karen McManus' new young adult novel \nTwo Can Keep a Secret\n. If you loved Karen McManus' debut novel One of Us is Lying, like my obsessed self did, please go into this story with an open mind, or else you'll end up disappointing yourself like me at this very moment. The story takes place in a small Vermont town called Echo Ridge. Echo Ridge is very reminiscent of Riverdale, from the CW's hit show Riverdale (duh!), and its vastly different than where our main character Ellery grew up. Ellery (and her brother Ezra), move to their grandmother's home in Echo Ridge while their mother is sent to court ordered rehab. Their relationship with their mother Sadie is very unorthodox, and their Los Angeles lifestyle may be too big for Echo Ridge to handle. Echo Ridge may appear to be picture perfect, but it also has a dark history—a woman was murdered and her killer has never been found. Sadly, the victim's ex-boyfriend was wrongfully accused and the blame has still not diminished. As the school season begins, Ellery is shocked to find herself among the homecoming court this year. Why would she be nominated when nobody knows her? Also, fellow student, Malcolm finds himself in hot water after murders start popping up out of nowhere—and so has his brother. You know, the one who was accused of killing his ex girlfriend. Ok, ok, ok... I feel terrible about giving a bad review, but young adult novels don't always work well with me. Sometimes I need to take a sabbatical from young adult books to cleanse my palate before I jump into a new one. They can be very similar in plot and style, and it's not fair to the author when I read 100+ books a year and hold them to the fire about it. Karen McManus has a great style in her writing craft to grasp you into the story shes molding for the reader, but this time with \nTwo Can Keep a Secret\n, I just felt like it was too generic for me to digest. Been there, done that! I know it's very difficult to write an original YA mystery at this point, but I really wasn't gripped at all. Maybe the first chapter? While I was bored with the plot, I did think Karen's writing is still stellar and worth a read, especially if you love young adult novels. For me, I will just wait here for her sequel to One of Us is Lying, and pray that there's some new content for me to enjoy."}, {"Review": "Hmm. I appreciate that I didn't predict the end at all, but... I just didn't really care? The ONE thing I liked about McManus's first book was her ability to keep me on the edge of my seat, and that's the reason I gave her another shot and picked this up. Unfortunately, this didn't capture that feeling for me at all. It's not bad and wasn't problematic like One of Us Is Lying was but I had no suspicions and felt no tension, build up, or investment. There's only one clue given and the 3 separate events didn't seem well tied together. I'm disappointed because I WANTED to like this. I also think maybe I'm just over YA missing girls mysteries?It did have similar vibes to There's Someone Inside Your House and some of Sara Shepard's books, so hopefully that helps you know if you'd enjoy this.Audio review: One narrator was good and the other was terrible. I'd recommend print over audio.tw: hit and run, suffocation, murder, missing people, (view spoiler)[ Older man seducing underage girls. (hide spoiler)]"}], "Genre": "Thriller", "ID": "38225791", "Desc": ""}