{"Name": "Freefall", "Image": "https://images.gr-assets.com/books/1529056927l/39855088.jpg", "Reviews": [{"Review": "This is the kind of pulpy, plot-based read that you can power through in a single sitting, preferably on the beach or during a plane ride (if the plane crash aspect doesn't make you too nervous). The short chapters keep the pacing up and make it easy to zip through.However, seasoned thriller readers might be a little disappointed by the lack of surprises. Most of the plot is fairly easy to predict and the one promised \"twist\" felt a lot more like deus ex machina to me. That being said, this can be forgiven if you just sit back and enjoy the ride, which is admittedly a fun and easy one. Maggie learns that her estranged daughter Allison died in a plane crash with her fiance and attempts to piece together the last couple years of her life. Meanwhile, Allison's perspective instantly reveals that she is not actually dead but running from a mysterious someone. Maggie's digging and Allison's desperate bid for survival race against each other, until it all comes together at the climax.The characters are somewhat interesting. They have a sort of general appeal to anyone who is a worried parent or has a difficult relationship with their own parents. But fans of lots of character development should probably seek out a  Tana French or  Jane Harper instead. I felt it was a book focused on discovering the whats and hows, without spending too long on the whys. Freefall is an easy, escapist piece of fiction. Nothing demanding or life-changing, but fun nevertheless.Blog | Facebook | Twitter | Instagram | Youtube"}, {"Review": "I don't know about you, but sometimes when I'm reading a book, something about the title triggers a song (or even two) in my brain, something that keeps running through my head the entire time. Needless to say, I was glad I devoured Jessica Barry's \nFreefall\n in one day, because I don't know if I could have handled Tom Petty's \"Free Fallin'\" running through my head longer than that! (If it gets stuck in your head, you're welcome.)\"Here are the facts: I am alone. I am on a mountain. The plane I was on has crashed. My body is covered in bruises and cuts and my left leg has a wound that will soon become infected if I don't clean it. My finger is strained or broken and quickly swelling. I have very little food and water. The sun is still high but it will be dark in a few hours and my only shelter is a twisted hulk of metal that could, at any minute, explode.\"Allison Gardner survived the crash of her fiancé's plane in the Colorado Rockies. But even though she is battered and bruised, she knows the last thing she can do is wait at the crash site for someone to rescue her. If they know she's alive, they will find her and kill her. She has to force herself to get as far away from the crash as possible, because she's come too far to die now.When Allison's mother, Maggie, learns that Allison is presumed dead, she is devastated, confused, and shocked. She and Allison have been estranged since a family tragedy two years ago, so she had no idea why Allison would be on a private plane, nor was she even aware that Allison was engaged, much less to the handsome CEO of a successful pharmaceutical firm. Maggie wants to understand the woman her daughter became in the two years since they've spoken, and the more she starts digging into things, the more she realizes things in Allison's life weren't what they seemed.Two headstrong women are determined to succeed, Allison in trekking across the mountains in order to find a safe place to hide before she is found, Maggie in uncovering the secrets no one is telling her about Allison's life the last two months. Maggie has no idea of the danger her daughter was in, and has no idea of the risks she is taking looking for answers. \nFreefall\n alternates in narration between Allison and Maggie, and most of Allison's chapters flash back to her life before getting on that plane, and why she needs to keep alert and keep going. It's a fascinating, fast-moving story that has some twists you can see coming if you've read any thrillers, but some twists surprise you. Barry keeps you hooked on both of their stories, and keeps you hoping that both women will be successful in their quests.I really enjoyed this book, and as I mentioned, I read nearly the entire thing in one sitting. Barry has a great talent for teasing out the suspense and unfurling secrets little by little, almost in real time as Maggie starts looking into what happened to Allison. This was a great thriller for a snowy day, and I look forward to seeing what Barry comes up with next!See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2018 at https://itseithersadnessoreuphoria.blogspot.com/2019/01/the-best-books-i-read-in-2018.html."}, {"Review": "4 exciting stars!Freefall opens with Allison surviving a plane crash. She is the lone survivor, and she’s in the mountains with a smashed cell phone and few supplies. The pilot was her fiancé, and she has lost everything. And guess what? She actually doesn’t want to be found. On top of it all, someone is following her. Across the country, Maggie, Allison’s mom, has been told that her daughter likely died in the crash…but Maggie refuses to give up hope and sets out on a determined search for her daughter. She’s also seeking understanding because she and Allison have been estranged. Maggie and Allison are desperate to be reunited, and in their search and survival, that special, but complex, bond between mother and daughter is explored.Wow, Freefall is a page-turner! It shows why survival stories are among my favorites. Allison is strong and determined, and Maggie may be even more so. Maggie became the power player, and I could feel her thirst for answers. The pacing is exceptional, and the intensity continues to build. Jessica Barry has written a fab debut. I will be waiting in line for her next effort.Thanks to Harper Books for the complimentary ARC. All opinions are my own. My reviews can also be found on my blog: www.jennifertarheelreader.com"}, {"Review": "This is well plotted, if unsurprising, and the pace is fast. It’s told from the alternating voices of the daughter and mother which work but there are mistakes that the editor should have caught. Firstly, it is a character driven novel and the characterization should have been accurate. The mother is depicted as nearing eighty years old as opposed to her actual age. Next, please remember where your characters are. The daughter receives a phone call while on a treadmill in the lower level of her building. Huh? She is living the life of luxury in a spacious home. Finally, there is dangling loose end. A body is left in a hotel room where presumably it will be found but I may be mistaken. The murder has no consequences and the entire incident is simply dropped. These flaws, although small, mar what could have been a terrific read."}, {"Review": "3.5 starsThis turned out to be a pretty solid thriller. Maggie Carpenter is devastated to hear the news her daughter, Allison, died in a plane crash. Even though they have been estranged for the last two years, Maggie is determined to find out more about Allison's life leading up to the crash. Except wait, Allison didn't actually die, but she doesn't want people to know she survived either. Told from the perspectives of a grieving mother searching for answers and a daughter who seems to be running from her past.Even though the story isn't exactly perfect, I really couldn't turn the pages fast enough on this one as you can't help but feel invested in the characters, particularly the mother. Maggie is what really drove the story in my opinion. I'm not even a parent but you do almost feel like you are grieving with her and understand her determination to find out more about what was going on with Allison during their estrangement. The thriller aspects of the story are done pretty well although there were a few times when you wanted to shout at the characters, \"Come on, wise up!\". Overall, it is a decent thriller, but an even better story about a mother's love for her child. I won a free copy of this book in a giveaway. I was under no obligation to post a review and all views expressed are my honest opinion."}, {"Review": "You guys! I just finished the most amazing book! Twilight! Just kidding. I just finished Freefall by Jessica Barry, my first favorite of 2019! Congrats, Jessica! Freefall is my kind of book. Most books take forever to actually start the story but unlike most books, Freefall hits the ground running (Literally 😉) The book opens with a plane crash with a sole survivor, Allison. The book then switches back and forth between Allison and her mother, Maggie. As Maggie tries to find her daughter and Allison tries to survive on her own, more and more gets slowly revealed. As the story goes on both Maggie and Allison have flashbacks and slowly reveal the story. By the end, I was wide eyed and stunned at what I had learned and was even more amazed by the way it had been slowly revealed. Almost like when your in the shower and it slowly starts to get cold but you don't notice it until your shivering. That's goes this book was.Thank you to HarperCollins for sending me two copies 😂😂 (Accidentally)blogBottom Line:5/5 StarsCover: 4/5 (Pretty simple and yet very pretty)Plot: 5/5 (A slow burn thriller that amazed me.)Characters: 4/5 (Badass, brave characters that I was constantly rooting for)"}, {"Review": "⭐️⭐️⭐️⭐️💫 / 5WOW you guys! Freefall by Jessica Barry is a fast-paced survival story that I absolutely could not put down!What it's about: Allison Carpenter is on her fiancé's private plane when it goes down over the Colorado Rockies. The pilot doesn't make it, but amazingly enough Allison survives. But Allison knows a terrible secret, one that some very powerful people will kill to keep under wraps. So she must run, and not let anyone know she is alive. Meanwhile, Allison's mom Maggie is told that her daughter is presumed dead. She is shattered but also has a secret of her own - she hasn't spoken to Allison in 2 years and didn't even know she was engaged. Even though she knows nothing of this new life of Allison's, she is desperate to find out what led up to the plane crash, and will not give up hope that her daughter is still alive. Freefall has a survivalist aspect that I know many people enjoy, and not only do we get to follow Allison on her journey through the mountains, we also get the benefit of her having flashbacks of all the things that led up to the plane crash. I do have to say, that she spends quite a lot of time out there on foot, so it was really helpful that there were flashbacks in her POV. I don't know if I could have handled only hearing about her surviving in the Rockies. I loved the pacing of this novel, and I was hooked from the very first page. I've seen a few people that said it took them a bit to get hooked, but not this girl. It was a riveting story, and I loved having both Allison and her mom Maggie's POVs. There ends up being a bit of gore in this book, but nothing too major, and I think Barry did it in a way that it wasn't incredibly gruesome which is hard for me to read. I was also pleasantly surprised by the dash of humor the author manages to throw into Freefall. Every once and awhile I would find myself laughing out loud at something, and that is truly one of my favorite things in a book. Final Thought: I HIGHLY recommend Freefall and I can hardly believe it is a debut novel. I think this could be one of my top books of 2019 if you can believe that. Even though it was not a 5 star read for me, I was still blown away by the excellent pacing, the mystery, and how well this book is written. If you like a bit of a survivalist story with a strong mother/daughter bond aspect then I definitely recommend checking this one out. I can't wait to read more from Barry, and I hope she has another novel very soon!"}, {"Review": "4.5/5This is my first review of the new year and what a read it was, this one begs to be read in one breathless sitting, a total binge read. From the brief, incredibly fast paced chapters to the switch between points of view it’s a truly entertaining read with a fresh premise, what more could you want?!This flips between Allison for one chapter and then her mother Maggie the next, Allison’s story begins from the minute her plane crashes and Maggie’s from the moment she finds out about the accident. As Allison fights to stay alive you slowly and steadily find out about her life over the past few years and the events that led to to the crash while simultaneously Maggie struggles to piece together what her daughter had been doing for the past two years. I was so invested in these two women and so eager to find out what was really going on, both possessed an inner strength that was remarkable and then add in a super tense environment for both women and I was all in.While I did see a few things coming, the author did shock me in the end, and the aspects I did work out on my own didn’t take away from my enjoyment whatsoever. A really impressive debut, recommended for fans of pacey, exciting thrillers.Freefall in three words: Entertaining, Dynamic and Fast."}, {"Review": " Allison by her own choice had no contact with her mother for two years, and then her mother found out that Allison had been killed in a plane crash.Maggie had not talked to her daughter since her husband had passed away, knew nothing about her life, and was at a loss to answer questions about her daughter.Maggie did what every mother would have done to keep in touch, but to no avail, and I admired her for searching out details about her daughter’s life under the circumstances.Maggie could find no one who knew anything about her daughter or rather anyone who would say anything about her. They became silent when she asked. Maggie wondered what the reason for that was.Maggie had an inkling that her daughter hadn't perished in the fiery crash but kept that thought to herself for her own sanity.\u2028\u2028We follow Maggie and Allison in alternating chapters both past and present as the story unfolds.\u2028\u2028Allison's life the past two years had been a bit tough at first, and she had a secret that prevented her from her wanting to be found.\u2028\u2028The tension mounted on Allison’s side of the story as we find out things about her past, what she was up to, and perhaps the reason for the crash.\u2028\u2028FREEFALL keeps you rapidly turning the pages, has good writing, great detail, and enough suspense that you won’t want to put the book down. \u2028\u2028Through bits and pieces everything slowly came together, the mystery unraveled, and the intensity of the situations increased.\u2028\u2028If you enjoy suspense, secrets, and twists, FREEFALL fits the bill.\u2028\u2028It takes a few pages to grab your interest, but be sure you don’t have anything else to do because you won’t be able to put this book down. 5/5\u2028\u2028This book was given to me as an ARC by the publisher via Edelweiss in exchange for an honest review."}, {"Review": "It's quite possible that I sometimes rate debut novels a bit higher than I would other books. Maybe it's because I always feel that the first book may be a little bumpy and therefore it's a learning process. So when I come across a debut that just bites at me like the bugs did to Allison in the woods... well, I just can't help myself. Ok ok, I realize that might not have been the best analogy but I hope you get where I'm coming from.Told in alternating views between Allison and her mother, Maggie, who she's estranged from - Barry takes us not only on a journey of Allison's surviving a plane crash, the mystery behind who is after her and how she got into this predicament, but most importantly into the relationship between a mother and her daughter. Maybe because it's my mother's birthday today and I'm missing her more than usual that this is what hits harder for me over everything else. *Sorry Jessica, if this was not your intention.There are definitely things that seasoned thriller readers will see coming a mile away. But who cares?! The short chapters make this book a one sit read... not only because of how quickly each part seems to go but because this starts out strong and well, YOU JUST NEED TO KNOW! Like most debut novels, there are certain things that could probably be improved upon, but I can't pick apart a book that I just absolutely was drawn right into. From pages one to the end, I was hooked.Barry, bring me more. I'm waiting on you. 😉"}, {"Review": "My Thoughts: One hell of a debut! A well-written, gripping and positively unputdownable thriller! I can’t wait to see what Jessica comes out with next!This book looked so good, I had to start reading it as soon as I was approved! First...the cover caught my eye. Although it’s nothing spectacular, there is something catchy about it. Then...I read the description. A plane crash in the Colorado Rockies. I’ve lived in Colorado most of my life, so this was the clincher!The chapters alternate between the POV of the mother—Maggie—and the daughter—Allison. The chapters get you all pumped up, then boom...chapter change! You’re usually left with a cliffhanger, so you CAN’T STOP READING! I kept telling myself...just one more chapter! Allison’s chapters were the most interesting. I couldn’t get enough of her...her life leading up to the plane crash, her relationship with Ben and her struggle after the crash. I was on the edge of my seat, flipping pages as I was BLOWN AWAY...one shocking twist after another! And finally, the ending...WOW! Highly recommend!Book Description:A propulsive debut novel with the intensity of Luckiest Girl Alive and Before the Fall, about a young woman determined to survive and a mother determined to find her. When your life is a lie, the truth can kill youWhen her fiancé’s private plane crashes in the Colorado Rockies, Allison Carpenter miraculously survives. But the fight for her life is just beginning. For years, Allison has been living with a terrible secret, a shocking truth that powerful men will kill to keep buried. If they know she’s alive, they will come for her. She must make it home.In the small community of Owl Creek, Maine, Maggie Carpenter learns that her only child is presumed dead. But authorities have not recovered her body—giving Maggie a shred of hope. She, too, harbors a shameful secret: she hasn’t communicated with her daughter in two years, since a family tragedy drove Allison away. Maggie doesn’t know anything about her daughter’s life now—not even that she was engaged to wealthy pharmaceutical CEO Ben Gardner, or why she was on a private plane.As Allison struggles across the treacherous mountain wilderness, Maggie embarks on a desperate search for answers. Immersing herself in Allison’s life, she discovers a sleek socialite hiding dark secrets. What was Allison running from—and can Maggie uncover the truth in time to save her?Told from the perspectives of a mother and daughter separated by distance but united by an unbreakable bond, Freefall is a riveting debut novel about two tenacious women overcoming unimaginable obstacles to protect themselves and those they love.Thank you to Edelweiss / Harper Collins / Jessica Berry for this digital ARC / in exchange for my honest review."}, {"Review": "Wow!!! How can this be a debut novel for this author?? This book had me on the edge of my seat from the very first page wanting to know more!! So many lies, deception, twists and turns throughout. I loved it! 5 stars ⭐️ ⭐️ ⭐️ ⭐️ ⭐️Looking forward more by Jessica Barry!! "}, {"Review": "What do you do when you are in a plane that just hit the ground. Hard. The pilot is dead and you are wounded. You know you have to save yourself...The first chapter of this interesting tale is very captivating. Allison, one of our main characters, finds herself wounded, physically and mentally (why that is will be explained later) and knows she has to save herself. Although for the past few years she's led a very sheltered life, she is deep down still the same resourceful young woman. She doesn't sit down crying but takes what she needs and does what she needs to do to save herself... and her mother.Her mother meanwhile cries her eyes out when hearing about the accident with the little plane, where supposedly her daughter died. Underneath all the crying and the deep, deep grief is a very strong woman, intent on finding out what really happened. Apart from some small flaws that I won't mention here, a very good debut that makes me hope we will be reading more from this author in the near future. Thank you Netgalley and Random House for sending me this book."}, {"Review": "I need to get something off my chest. Writers, a thesaurus exists to help you make better word choices. Please do not use it to help you make worse word choices!Okay, back to the review. Freefall is a great story. The author, Jessica Barry, is a standout when it comes to pacing. She moves the story along quickly, keeping the reader interested with a steady supply of information – just barely enough, never too much – that’s both satisfying and tantalizing. I was interested all through the first half, absolutely riveted through the second half, and finished the same day I started. Freefall is an impressive combination of thrills and character-driven storytelling. The mother-daughter element is fantastic, with its sympathetic portrayal of two imperfect women who are doing their best, as is Barry’s gift for presenting characters that you really don’t know whether to trust or not. I also appreciated the portrayal of two “strong women” who come by their strength honestly. For example, the protagonist finds herself in the wilderness and displays a very realistic set of strengths and weaknesses. I respected her and I respect the author for providing the backstory to her skills.Lots of reviewers (on the back of my ARC) are talking about a surprise twist. I must say, I don’t see it that way. To me, and to the novel’s credit, the story does not depend on the kinds of twists that seem to be required of thrillers these days. It starts out strong and builds, builds, builds steadily to a powerful, thrilling conclusion that satisfies on all levels, rather than merely giving you a surprise. A little editing would have helped, though! The author soaked up British usage while living in London, and it comes through, annoyingly, in her writing (“sea view” instead of “ocean view,” “women’s refuge” instead of “women’s shelter,” etc.). It makes the characters’ voices less authentic. And sometimes the occasionally too-flowery writing highlights Jessica Barry at the expense of her characters’ experiences, especially when her metaphors flop (a dragonfly’s “febrile wings,” the “wince of citrus,” etc.). A couple of grammatical errors also had my teeth grinding, as did occasional lapses in a sense of place (in Colorado, coal heaters are extremely rare, and I’ve never seen crabgrass in the Rocky Mountain wilderness). And, also, hey Jessica? Most middle-aged people are perfectly competent users of the internet, okay? Like, we were still pretty young when the worldwide web came on the scene, and believe me, we can set up our own Facebook accounts, and do Google searches, and all that, without surprising anyone (anyone but you, apparently). Other than that though – and it really wasn’t that bad – this book is one amazing debut that gives you thrills while exploring meaningful questions, such as, What are your responsibilities to yourself and to those you love? What can you manage on your own, and in what ways do you depend upon others? How does love strengthen you, and how does it blind you? Whom do you trust? How do you know? Four very enthusiastic and appreciative, if occasionally irritated, stars."}, {"Review": "A fantastic debut from Jessica Barry. This has all the makings of a binge read. Short chapters, multiple POVs, and a twist at the end that I did not see coming. This book reminded me a bit of The Banker’s Wife by Cristina Alger which was a favorite of mine earlier this year. Fierce female lead characters, corrupt business men and the great lengths people go to make a buck.It all begins with a plane crash. Ally is fighting for her life and Maggie is confident her daughter is still alive. The story alternates POV as everything unravels. How has Ally come to be on this flight and who is she running from? Ally’s mother Maggie hasn’t given up hope and is determined to find her daughter and discover the truth behind it all.Fast paced and gripping I highly recommend this to all the thrill seekers.4.5 stars"}, {"Review": "In this narrative we follow the alternating perspectives of Maggie and Allison, a mother and daughter, just after a plane crash. What starts as a straightforward missing person story soon transpires to be a little more complex. The operative word here is “little” - for the first 200 or so pages I felt like we moved incredibly slowly in each of the narrative threads. The story lacked the typical pace of a thriller for me for most of this early part. This isn’t to say it wasn’t well written, I just felt it needed more “oomph.”.That said, once the pace quickened this really came through with the goods. There weren’t twists per se, more slow reveals that were quietly clever and well constructed. I enjoyed this and recommend it if you’re looking for a book to curl up with for a few hours (it’s a super quick read despite coming in at over 350 pages). Perhaps not one to read on a flight though! 🙈"}, {"Review": "Lindas Book Obsession Reviews “FreeFall” by Jessica Barry, Harper,January 8, 2019Kudos to Jessica Barry, Author of “FREEFALL : A Novel” for writing such an intoxicating, addicting, intense, captivating, intriguing and thrilling novel. The Genres for this story are Thriller, Mystery, Suspense, Action and Fiction. The timeline of the story is set in the present and goes to the past when it pertains to the characters or events in the story. The author describes her characters as complex and complicated. There are dark and deep secrets that have many consequences.The story is told by two narrators, a mother and daughter. Although Allison Carpenter and her mother Maggie Carpenter haven spoken in two years, there is something that unites them in spirit. This is a story about the love and support of mothers and daughters.Allison Carter is in her wealthy fiancé’s private plane when it crashes. Somehow, Allison manages to crawl away injured but alive. To stay alive, Allison knows she must keep moving. Allison has dark secrets and information that many powerful men will kill her for. This is only the beginning. Allison has to stay alive on a dangerous mountain, and wilderness, with lack of food and water. Allison is motivated to make it home.Maggie Carpenter hears that her only daughter is supposedly dead. Maggie had no idea that Allison was engaged, and from pictures she sees it is hard to recognize her daughter. After a family tragedy, the mother and daughter have been estranged, but Maggie has a feeling that Allison is alive and in trouble. Maggie starts investigating facts surrounding the crash and her daughter’s life in the last two years.There is such intense activity that I was at the edge of my seat, biting my gel nails, luckily not breaking my teeth or my nails. This is a page-turning, riveting, enthralling book that I could not put down. There is murder, violence, and action. I would highly recommend this novel to readers who enjoy an intense , engaging and intriguing book. Warning: Don’t read before you go to sleep.!! Happy Reading.!"}, {"Review": "3.75 (rounded up)First of all, can we talk about this lovely cover? It's just so beautiful I was so scared that I would damage it or drop anything on it. Freefall is a suspenseful novel about a couple whose plane has crashed in the middle of nowhere. Allison's husband is dead, but she is on the run. If they find her they will kill her. The plot of this novel was so intriguing and I knew that I had to get my hands on it when I read it. I've read a few plane crash stories before and this one really stood out to me and I'll tell you why. The fact that it wasn't only a thriller, it was also a story about rhe relationship between the mother and her daughter. Since Allison and her mom haven't seen or talked to each other in two years, Maggie is shokced to hear the news about her daughter in the plane crash. But when no body is found, she begins to question if she is really dead and who is the man on the plane with her? It's told in two point of views, Allison's and Maggie's and although they are in present tense, we get the full story of how Allison got to where she is now (on the run) and we are withg Maggie on her journey as she digs for answers on her daughter and the people around her. It really is a good novel with many suspenseful moments and wonderful twists (especially that last one.) I',m so glad I got my hands on this novel!Thank you to Harpercollins and Harper Books for providing me with an advanced copy of this novel in exchange for my honest review."}, {"Review": "*Source* Publisher*Genre* Crime, Thriller*Rating* 3.5*Thoughts*Freefall is an edge-of-your seat tale of suspense about two women (Allison & Maggie Carpenter) who find the strength to take control of their lives in the face of adversity. Jessica Barry’s debut grabs you by the throat and doesn’t let go until its intense finale. Featuring a pair of rich, full-blooded women, this emotional page-turner beautifully captures the fraught yet unbreakable bonds between a mother and daughter and renders their stories in vivid, authentic detail.*Full Review @ Gizmos Reviews*https://gizmosreviews.blogspot.com/20..."}, {"Review": "A fantastic thriller, real life got put to one side as I became engrossed in the superb, tension filled plot! Alison is the daughter presumed dead when the plane she was travelling in crashes. Maggie is her mother, desperate to find out what happened to Alison and still clinging onto the belief her daughter is alive. As she begins to delve deeper into the accident and Alison's life in the past few years, secrets are revealed that could have deadly consequences! Honestly, I was gripped from beginning to end. Barry's writing is amazing here, I felt every inch of pain both Alison and Maggie went through, and loved the way the taut plot unravelled gradually, with teasing little twists and turns. Nothing bad to say about this book at all, I loved it, and you'd be mad not to grab a copy upon publication!*I received a copy of the book from the publisher via NetGalley in exchange for my honest review."}, {"Review": "I received an advanced copy of this book from Penguin Random House in exchange for my honest review. It didn't take long for me to become immersed in this book. There were no chapter numbers to mark out this book. Instead, the novel was divided into Allison's and Maggie's point of view and alternated between them. If the chapter told from Allison's point of view ended in a big reveal and twist in the plot, I read a chapter of Maggie's point of view before I got back to find out more from Allison. There were also small section scattered throughout the book which were narrated by an unknown narrator at the beginning, but eventually everything falls into place. The way the author did definitely added a suspense and intrigue factor to the novel. I kept reading to find out what would happen next, for both Allison and her mother Maggie. The second half of the novel dialed up the suspense and the adrenaline. I got a major adrenaline rush from the ending. I really liked the determination of both Allison for her will to survive and for Maggie fighting to find out the truth."}, {"Review": "Freefall 3.75⭐️She needs to survive even if the rest of the world thinks shes dead. I really liked her experience on the island and if it was more of that and less of her life leadingup to it, it would have been a 5 star but it was still good. I liked the characters and she did a good job jumping back and forth in time leadingup to how she got on that plane. "}, {"Review": "This book was bananas. B-a-n-a-n-a-s. A slower burn in the beginning in terms of getting answers, even when nothing much was happening, it felt very tense. A triumph, to say the least. When the reveals ended up happening, I can say with absolute conviction that I had no idea where the story would go next. I loved the alternating POVs of Allison and Maggie, and shorter chapters kept the pace tight. The plot's depth was a surprise and delight, and I thoroughly enjoyed the way it unfolded. The sort of book you could read in one or two sittings, FREEFALL is a heavy-hitting debut and an excellent choice for fans of thrillers and suspense. Big thanks to HarperCollins Canada for an ARC!"}], "Genre": "Thriller", "ID": "39855088", "Desc": ""}