{"Name": "A Merciful Fate", "Image": "https://images.gr-assets.com/books/1526204302l/39888482.jpg", "Reviews": [{"Review": "In this 5th book in the 'Mercy Kilpatrick' series, the FBI agent investigates a decades old armored car robbery. The book can be read as a standalone.For those not familiar with the series: Mercy Kilpatrick grew up in a prepper family in Eagle's Nest, Oregon but she fell out with her kinfolk and left. After becoming an FBI agent Mercy returned to Eagle's Nest, where she works in the local FBI office and solves crimes with her partner, Eddie Peterson. Mercy is now on good terms with her mom and siblings, but still has a difficult relationship with her dad.Mercy is engaged to Sheriff Truman Daly, and they sometimes collaborate on cases.*****As the story opens, a skeletonized body is found in an isolated shack in the Eagle's Nest woods along with empty money sacks from a 30-year-old armored-car robbery. The holdup, called the 'Gamble-Helmet Heist', resulted in the death of a guard and the arrest of a perp named Shane Gamble - but four gang members got away with the cash. One robber, Ellis Mull, didn't get far though, because it's his body in the shack, and he's been dead for decades - shot in the head. Mercy Kilpatrick and Eddie Peterson get the Ellis Mull case and consult with Art Juergen, the FBI agent who led the original investigation three decades ago. Art is retired now, but he's more than willing to lend a hand. For the most part, the FBI agents are trying to trace the three remaining gang members, identified as Nathan May, Trevor Whipple, and a driver known only as Jerry. Meanwhile, there's other trouble brewing in Eagle's Nest, with two women experiencing malicious mischief. Sandy Foster's bed-and-breakfast was targeted by a vandal who broke car windows in her parking lot and spray painted profanity on her wall; and Bree Ingram's pickup truck and stable doors were defaced by large red X's. Sheriff Daly and his detectives look into these incidents - unsure whether they are pranks or threats. Mercy and Truman think the confluence of these events - the discovery of the body and the vandalism - may be more than coincidental....and a reporter seems to agree with them. To ﻿Mercy's chagrin, an ambitious young journalist called Tabitha Huff is determined to write about the corpse related to the Gamble-Helmet Heist. So Tabitha stalks people who have information about Ellis Mull.....and interviews Sandy and Bree about the sabotage. All this leads to violence and death before the various cases are solved. Other characters that add interest to the story include Lucas - Sandy's son, who works for the Sheriff's Department; Rose - Mercy's blind sister, who's engaged and about to have a baby; Karl - Mercy's father, who (reluctantly) helps out in a pinch; Kaylie - Mercy's pretty teenage niece, who works in a coffee shop; Ollie - Truman's teenage ward, who has a crush on Kaylie; and Shep - Ollie's dog.I enjoyed the mystery, which has an interesting plot and provides a peek into the prepper community. Thanks to Netgalley, the author (Kendra Elliott) and the publisher (Montlake Romance) for a copy of the book.You can follow my reviews at https://reviewsbybarbsaffer.blogspot...."}, {"Review": "With this being number five in the Mercy Kilpatrick series, it’s beginning to feel like reuniting with old friends. I consistently like this series and the characters. I will say, I’m a mystery, not a romance oriented gal, so sometimes the romance portion comes on a little strong for my taste. But it is refreshing to have a female main character whose personal life is not in pieces. This time the story involves the found skeletal remains of someone involved in a bank heist that occurred 30 years earlier. A parallel storyline involves two women being harassed by an unknown vandal. Mercy is investigating the first; Truman the second. Both both issues are being tracked by an internet tabloid reporter. The pace here is fast and the plot is suspenseful. I had my suspicions and it was fun to see if they were right. A great ending! Keep it up Ms. Elliot. I’m already anxiously awaiting book six.My thanks to netgalley and Montclair Romance for an advance copy of this book. "}, {"Review": "Reading A Merciful Fate is like coming home and slipping into my jimmy-jams, robe and slippers, turning on the fire and gathering up the dog, throw and glass of wine.  This is absolutely not to imply the books in this, series, including A Merciful Fate are cozies. Au contraire, mes amies. This series has kept me on the edge of my couch and turning pages as quickly as possible. I still have not totally recovered from the last book  A Merciful. Silence Of course these books can be read alone, Elliot does a good job of catching you up on the players.I might not have read of any cop/FBI with a background as unusual as Mercy Kilpartrick’s, (outside of the realm of fantasy). Mercy is a secret prepper-actually the smartest kind to be. She was raised by prepper/survivalist parents until she broke away. I’m gonna quote myself, “You can take the girl out of the family circle but you can’t take the prepper out of the girl.” So she still embraces parts of the philosophy. The always be prepared part, just to an unusual degree. She is an FBI agent in love with and engaged to the local police chief, Truman Daly. When Mercy finds herself proposing a wedding trip to Italy its wonderful to see that Mercy is no longer a half bubble off plumb, but just a smidgen. Can y’all tell I’m fascinated by Mercy?Okay now back to our regularly scheduled programming. Truman’s ward, Ollie, finds a skeletonized body in the woods. The body turns out to be a member of the Gamble-Helmet bank robbery gang which ended in one death, one arrest, four escapes and the money disappearing. The Gamble-Helmet crime became second only to the D.B.Cooper hijacking in myth and mystery in the Northwest.Thirty years is a long time for people to re-invent themselves so Mercy finds herself eyeing long time friends in a different way. She is just not eying the right people.Meanwhile, back in Eagle’s Nest, Truman is dealing with two, seemingly unconnected spates of vandalism. I would have to say the complex plot, and the fascinating characters are evenly matched in A Merciful Fate. It was especially lovely to see so much of sister Rose, her FBI partner Eddie Peterson and young hero Ollie. I know also that this sounded like a review of Mercy. But why not, there seems to be a competition between authors to make their cop/FBI agents as damaged as possible. Mercy fits into that category, but I think in just about the most interesting way.Elliot could have done a bit better research about retired FBI agents. They are fully able to carry concealed weapons. No concealed weapons permit needed.I still admire the way Elliot writes in such a respectful way about the prepper lifestyle. She makes it understandable, not a joke.Elliot also has a fine way with her occasional metaphors, “ ...but an experienced reporter would dip him in batter, deep fry him, and then eat him for dinner”Thank you to NetGalley for an ARC in exchange for a fair and honest review."}, {"Review": "This case tested FBI Agent Mercy Kilpatrick and her fiancé Police Chief Truman Daly and provided an addictive tale that pulled me in and never let go. An armored-car robbery turned deadly, before the mastermind of the heist is captured. However, four conspirators vanished with a fortune. Now, thirty-years later it appears one of the four never made it out of the woodsWhile out hiking, Ollie and his dog stumble upon a grizzly discovery in an abandoned cabin. When Truman discovers bank bags, he calls in the FBI. I love old unsolved mysteries and was all in.Meanwhile, a purple-haired reporter seems to have insider information. Two local women have had their homes or businesses vandalizes.  Rose is sick but has some exciting news and things are hopping at the coffee shop.  Mercy and Truman are busy rebuilding her survivalist homestead as they make plans for the future.I loved returning to the Cascade Foothills and the town of Eagles’ Nest. Surrounded by farms and mountains this is a popular place for survivalists and preppers. It is a tight community where everyone knows what car you drive and who was out late last night. But even in a small-town folks still hide secrets.Elliot outdid herself with the mystery and investigation from red herrings to twists I never saw coming. From the pacing to the different crimes, I was all in and enjoyed this over the holiday break.   This review was originally posted at Caffeinated Reviewer"}, {"Review": "Advanced Reader Copy (ARC) provided by the Author and Publisher via NetGalley in exchange for an fair and honest review.Love, LOVE, \nLOVE\n this series and this book is just awesome. The mystery plot is fantastic and not having the baddie's POV just keeps the suspense building from beginning to end. Lost of twists and turns and no end of suspects and motives, just the way a really great mystery should be.Nearly thirty years ago an armored car in Portland, OR was robbed. A guard was killed, a robber shot and captured. The remaining three robbers and their driver escaped with $2 million dollars. While on a hike in a remote area near Eagle's Nest, OR, the teenage ward of Police Chef Truman Daly, Ollie, and his dog, Shep, come upon a deserted, falling down cabin with a skeleton and empty money bags. At long last a link to the infamous Gamble-Helmet Heist has finally been established. And now there are three people with a real interest in the true facts of this case never coming to light.FBI Agent Mercy Kilpatrick is assigned the cold case and taps retired Agent Art Juergen, lead investigator on the original case, to help her and partner, Eddie Peterson, finally solve this decades old case. For some people of this tight-knit community there are secrets they would have just as soon seen buried forever. When a tabloid reporter starts raising questions and turning over rocks, a killer crawls out. As the danger strikes too close to Mercy and her fiancé, Truman, they now have to face to possibility that someone they know is a murderer."}, {"Review": "Check out all of my reviews at: https://www.avonnalovesgenres.comA MERCIFUL FATE (Mercy Kilpatrick #5) by Kendra Elliot is the latest romantic suspense, mystery/suspense, FBI procedural, who cares what you call it, cannot put it down read featuring one of my favorite main characters! This is a series I recommend you read in order because each book builds on all of the characters’ relationships and secrets besides giving you new crimes and/or mysteries in each.Special Agent Mercy Kilpatrick is thrown into a notorious, decades old bank robbery when the skeleton of one of the robbers is found in a decaying cabin. The mastermind of the team was captured and put in prison, but the money and the rest of the gang seem to have disappeared into thin air. Just as Mercy starts re-investigating the robbery, a young tabloid reporter shows up in Eagle’s Nest asking questions that are threatening long buried secrets.Police Chief Truman Daly gets pulled into the investigation when the reporter is found dead in her car. Some of the people have secrets and are not who they appear in the Eagle’s Nest community. Whether they are related to the old robbery or not, they want them kept secret. Mercy and Truman need to reveal them all to find the threat to their community and family. Some long held friends and neighbors are not who or what they seem.This series just keeps getting better and better. The old, unsolved robbery is an intriguing crime plot that builds the suspense and threat level at a rapid rate throughout the story. I was very surprised throughout the resolution. I love Mercy and Truman’s relationship and how Mercy is learning to navigate their relationship while balancing everything with her long held prepper lifestyle. All of the secondary characters are becoming fully fleshed out characters that I look for now in each book. My only slight criticism of this series is that I believe Mercy’s father may have a point. Not his indifference or stubbornness, but the people around Mercy seem to be injured or killed quite frequently. In most series the main character is injured or almost killed so many times you wonder how they can keep recovering and working, but it is those around Mercy who suffer this author’s wrath. That said, I highly recommend this series and Mercy! I always look forward to reading these books and catching up with all of the Eagle’s Nest community."}, {"Review": "You can find this review in English below.En esta quinta entrega de la serie, y pese a mis expectativas, la señora Elliot ha vuelto a sorprenderme. Después del último libro pensé que ya no habría mucho más que contar de este pueblo y de estos personajes, pero estaba equivocada. De nuevo el suspense es original. Está hilado fino, es meticuloso y no deja nada al azar. Es casi perfecto. Y las pocas imperfecciones que tiene no hacen más que darle un toque realista. La trama mantiene tu atención desde el primer minuto y las pistas se van desvelando poco a poco a medida que avanza la investigación. En todo momento el lector sabe tanto (o tan poco) como los protagonistas, así que es muy interesante ver cómo piensan y actúan en función de los acontecimientos. Hay un giro tan interesante como inesperado casi al final de la historia que le da un vuelco a la trama de 180º. Realmente inspirado. Lo dicho, casi perfecto.Soy lectora de suspense y de thrillers desde que tengo uso de razón y raramente encuentro una autora (o autor) tan inspirada y meticulosa como la señora Elliot. Es fantástica. He leído ya casi una decena de sus historias y siempre son originales y diferentes. No puedo decir eso de muchos autores.El romance, como en casos anteriores, es muy sutil y está totalmente en un segundo (o tercer) plano. Las tramas familiares y relaciones personales siguen ocupando algo de espacio en la historia pero de forma muy poco intrusiva. Y las relaciones familiares siguen preocupándome por su dramatismo. Pero si hay alguien capaz de convencerme de que las cosas son así y punto esa es la señora Elliot. No sería la primera vez…En resumen, un suspense de 5 estrellas y con algo de romance para acompañar. No puedo pedir más.\ne-ARC kindly provided by Montlake Romance via Netgalley.\nIn this fifth installment in the series, and despite my expectations, Mrs. Elliot has surprised me again. After reading the last book, I sincerely thought there would not be much more to tell about this town or these characters, but I was wrong.Once more, the suspense is original. It is thoughtful, it is meticulous and nothing is left to chance. Is almost perfect. And the few imperfections that it has do nothing but give it a realistic touch. The plot keeps your attention from the first minute; the clues are revealed little by little as the investigation progresses. At all times the reader knows as much (or as little) as the characters, so it is very interesting to see how they think and act according to events. There is a turn, as interesting as unexpected, almost at the end of the story that gives the plot a 180 degrees turn. Really, really inspired. As I said, almost perfect.I have been reading suspense and thrillers for as long as I can remember, and I rarely find an author as inspired and meticulous as Mrs. Elliot. She is fantastic. I have already read almost a dozen of her stories and they always are original and different. I cannot say so about many authors.The romance, as in the previous instalments, is very subtle and is totally in a second (or third) plane. The plots about familiar and personal relationships continue to occupy some space in the story but in a very non-intrusive way. The family relationships still worry me because of their drama. But if there is someone able to convince me that that´s the way it is and end of the story that would be Mrs. Elliot. It wouldn´t be the first time…To sum up, a 5 stars suspense with some romance on the side. I couldn´t ask for more."}, {"Review": "This review was originally posted on  Books of My Heart Review copy was received from NetGalley. This does not affect my opinion of the book or the content of my review. I was happy to continue the \nMercy Kilpatrick series. \nThis feels more  crime/ mystery suspense than a romance. There is kissing but the sex is mostly off page. I've enjoyed the world-building of this small town in a rural mountain area with many survivalists. The preppers are fascinating to me and cool; I love DYI and self-sufficient people.A Merciful Fate is probably my favorite in the series so far, but it may be because I have come to love these characters. I do have to wonder how many people can die in a small town. Since there is a large prepper community, I'm NOT surprised with how many have secrets.So much happens on a work and personal level for Mercy. At work, there is the new case which ties into an old bank heist. I did figure out one culprit without really trying.   There are also many acts of vandalism in town which may or may not be related to each other or this case. And then people are getting shot and some are dying.Personally, Mercy is still dealing with the loss of her prepper cabin.  She has her niece living with her and is settling this into her world. Now she and Truman have Ollie working into their family life and routines, and Shep. Her father is still one cold fish. Her sister, Rose, is nearing the end of her pregnancy.  Mercy and Truman have yet to make their wedding plans.Even with some disbelief at the quantity of incidents in a small town, this was a fun, fast read.  With all the gun violence these days, it might be very realistic, especially around preppers who are independent, anti-government NRA types.  Many characters are quite well-developed.  I just enjoyed reading."}, {"Review": "Thank you to NetGalley and the publisher for an ARC of A Merciful Fate in exchange for an honest review. A Merciful Fate is the 5th book in the Mercy Kilpatrick series. Mercy was raised in a survivalist family and left to pursue a career with the FBI, which was not welcomed by her family. When she returns to her hometown of Eagles Nest, she reunites with her old boyfriend,Truman Daly, who is now the police chief. Thirty years ago, an armored-car robbery turned deadly. The mastermind was captured and remains in prison. Four conspirators vanished with a fortune. One of them, it appears, never made it out of the woods alive when bones are found in an abandoned cabin. It becomes clear to Mercy that someone in their community is connected to the heist and is not who they appear to be.Great story complete with bank robbers, tabloid reporters and plenty of intrigue. Elliot always comes through with a well-written, captivating mystery."}, {"Review": "How well do you really know someone? That’s a question posed more than once in this intriguing thriller by Kendra Elliot, fifth in the Mercy Kilpatrick series about an FBI agent in Bend, Oregon. Raised by a family of off-the-grid survivalists, Mercy’s instincts die hard, but when you’ve known someone for a decade or more as a pillar of the community, it’s unimaginable they could be involved in a major crime.When an ancient skeleton is found in a crumbling shack, one of the greatest unsolved mysteries in the FBI’s files suddenly comes to life again, and it lands right in Mercy’s lap. Chasing a trail 30 years cold leads down a lot of rabbit holes until a dead journalist makes her realize one of those threads she’s pulled must lead somewhere. Somewhere she could never have expected.I make no bones that I love this series, and A Merciful Fate is a great addition. If you haven’t read the others, though, I would advise going back and starting at the beginning, because though the author does her best to give you an outline sketch of the major characters without infodumping, there’s been a lot of worldbuilding over the previous four books which will give you great insight into the mindset of all of them, particularly Mercy, Truman and Ollie (possibly my favourite character of all). Five stars for another great installment in the series!Disclaimer: I received a copy of this book for review through NetGalley."}, {"Review": "Over thirty years ago, there was an armored car robbery. There were said to be five people involved. Only one was ever caught and sentenced to prison which was Shane. The others vanished without a trace along with the money. Now years later, out in the backwoods, a body has been found, and it looks like it is connected to the armed robbery case. Mercy who is now an FBI agent and her partner Police Chief Truman is on the case as they set out to identify the dead body. Doing this means re-opening old wounds as they head to the prison to talk to Shane. It looks like someone else is in town knows more about the case than they are letting on as a tabloid journalist Tabitha turns up asking questions.Meanwhile, in this small town, there are also a few cases of vandalism occurring, is this all connected or something entirely different? As Mercy and Truman start to dig deeper, it seems that a few people in town might want the truth to remain hidden as they have created new lives for them and their families. Also as more victims start to pile up and one of the last calls is Mercy's father, it looks like she may have to pay her estranged father a visit. Can Mercy and Truman solve the case of the century before more people are injured or worst killed? Find out in another fast-paced mystery by Kendra Elliot. Also, I quite liked the cover of this book with the beautiful woods scenery. The Mercy Kilpatrick series is also a good read if you love strong female leads. "}, {"Review": "There was a lot going on in this one and at times it seemed really simple, but at other times you really weren’t sure who to trust, who was the bad guy and who the was the good guy. Sadly, a lot of them were in the gray area. Mercy kept chipping away at things, determined to get to the bottom of things. By the end of the book she was a bit disillusioned, but there was a new bright spot in her life. It was nice to see Mercy look to that and finally set a date with Truman to get married.The one person who really surprised me in this one was Ollie. He came out of nowhere in the last book, yet he fits in really well with Mercy and Truman. It was fitting that he opened and closed the book. I will say though, I’m not sure that I would be as strong as him with the choice he made at the end."}, {"Review": "Another win from Kendra Elliot. I don't think Ms. Elliot can write a bad book. Mercy, Truman, Rosie, and one heck of a mystery. This book is about a 30 year old bank heist. Once again, Kendra has written a tale that weaves us through a wonderfully suspenseful tale sprinkled with the right amount of romance. This book kept me reading well into the night needing to get to the end to see where Ms. Elliot would take me. Would I recommend? Heck yeah! I love this series. If you love suspenseful stories with romance, pick this series up!!!"}, {"Review": "This story begins when Ollie's dog Shep finds a bone when the two of them are out on a wilderness walk. Ollie is quick to call Truman who alerts the county cops. When it is discovered that the bones are with some empty bank bags, Mercy is called in - bank robbery being a federal crime. Suspicions are quickly confirmed that the body was probably one of the Gamble-Helmet killers. There was an armored car robbery some thirty years earlier in which one of the guards was killed and one of the robbers shot and left at the scene. However, the other four robbers and the $2 million they stole disappeared without a trace. Now it appears that one has been found and has likely been dead since very shortly after the robbery.Shane Gamble is the one robber that was caught. He has been in prison since the robbery and will be there for the rest of his life since he killed another prisoner inside. Mercy goes to see him to see if he can shed any light on the new discovery. However, Gamble is a game player and sees no reason to do anything but mess with Mercy's mind. Meanwhile, other things are happening in town. There have been incidents where a couple of the locals - Sandra who runs the B&B and Bree who is an English teacher - have reported vandalism. Both women have sort of shady pasts. Sandra reinvented herself when she came to town ten years earlier after a past with an abusive husband. Bree's secrets are more deeply hidden When a young female reporter from a tabloid shows up wanting more information about the newly discovered body, Mercy wonders how she found out about the discovery and wonders what she is trying to find as she interviews many people in town including Bree and Sandra. Things get even more confusing for Mercy and Truman when the reporter is found murdered. Because the Bend FBI office is small, Mercy is glad when Art Juergen is called in. He is retired now but was deeply involved in the original Gamble-Helmet Heist and is an expert on what was done and who was looked at. Mercy has worked with him before and liked him. He, Mercy and her partner Eddie are shot at and Eddie hit while they are pursuing some information from Victor Diehl who could be a witness. Art kills him when he almost gets the drop on Mercy and Eddie while Mercy is trying to treat Eddie's wound. Things get even more complicated when Mercy learns that two of his recent phone calls were to her semi-estranged father Karl. As Mercy continues to try to find out what happened to the other robbers, she begins to have questions about some of the new friends and neighbors that she has met since she came back to Bend. Then her niece Kaylie is shot and Bree is assaulted in her home and the investigation really heats up.This was a fast-paced enjoyable mystery with engaging characters and a well-developed plot. I love Mercy and Truman's relationship and I love the way Mercy is letting more people into her life. I like that the story begins and ends with Ollie who is one of the new people in Truman and Mercy's life. "}, {"Review": "An absorbing mystery about a 30 year old armored-car robbery. Mercy and her FBI team get the first big break about the age old mystery when a body is discovered turns out to be one of the robbers. As Mercy and the FBI are trying to uncover more about the heist, Truman and the Eagle's Nest police department are trying to figure out who is vandalizing two prominent women in the town's businesses. Are these two things completely unrelated or is there a thread tying them together. An enthralling read from start to finish in an engaging series. "}, {"Review": "I was given a free copy of this book to read and review for Wicked Reads. After five books, this series is quickly becoming addictive. Mercy’s creepy backwoods community gets both stranger and more familiar with each story and this one kept me guessing right to the end. This book starts slowly. A long dead skeleton. Graffiti. As always, Truman and Mercy’s cases overlap and things start to escalate. I love the way this story only gets more complicated as Mercy and Truman uncover tiny pieces of information that link together to create bigger truths. And I love that it took me a long time to figure out Mercy’s case in this story. The ending of this story had me on the edge of my seat - I honestly couldn’t put it down.When I think of Oregon, I think of Portland and hipsters. I think of a liberal corner of the US with values more similar to Canada or Europe than the American south. This series, with its preppers, independent citizens and fugitives, is eye opening to say the least. I’m beginning to feel like I know the characters in Mercy and Truman’s community but there are so many secrets to keep track of. I love the contrast of small town charm and creepy backwoods nuttiness. And I love that it’s often impossible to tell them apart. I love how Mercy attempts to balance her professional role and her small town prepper upbringing.I really love this series. On a basic level, the books are well plotted and well written crime thrillers. But there are lots of great crime thrillers. It’s the wonderfully complex characters and the overwhelming sense of place that makes the series special. "}, {"Review": "I always know I’m in for a treat with a new release from Kendra Elliott. When I received an invitation from the publisher, via Net-Galley, I eagerly agreed to read and review the fifth book in her Mercy Kilpatrick series. My opinions are my own and are not influenced in any way.As with all of Ms. Elliot’s books, the characters are real and flawed, the plot is intriguing and there’s plenty of emotions running high. One of the things I enjoy most about her books is the suspenseful scenes. She has a way of keeping me on the edge of my seat from the first page until the last.I love Mercy’s character and in each of these books, it only grows stronger. While she’s complicated and has a lot of pent-up issues, she never lets them hold her back. She’s fierce in her determination to be the best FBI agent possible and protects her niece like a mama bear.Truman is a drool-worthy hero any woman will love, and I’m one of them. He’s an honorable, caring man, and he’s so patient with Mercy. He never lets anything rattle him, whether it’s a case or Mercy. While the romance is secondary in Merciful Fate, it’s still strong and adds a lot to the story. In Merciful Fate, Mercy and Truman’s relationship has progressed quite a lot, which pleased me immensely. The suspense in this book builds as the tale of mystery and intrigue unfolds. Lots of good things to move the plot along. Ms. Elliott keeps her cards tight against her chest, so I was completely surprised by the characters involved in the heist.If you enjoy a novel with plenty of high suspense with a great “who-done-it plot,” then you will love Merciful Fate. I do recommend reading the other books in this series before reading this one, so you’ll fully appreciate Mercy and Truman. Happy reading!"}, {"Review": "I received a free copy of this book to read and review for Wicked Reads.\t\tThis series just gets better and better.Ollie has found a skeleton and Mercy and others suspect it could be related to an old unsolved bank robbery. One of the gang is in prison, but the other four accomplices disappeared without a trace. Not only is Truman trying to help Mercy figure who the died in that remote cabin long ago, he's also trying to solve the new spate of vandalism that is happening over at Sandy's inn. Sandy isn't being very helpful as to who may behind it, until she realizes that unless she's honest, her whole life will come tumbling down around her.Bree is also having problems. Someone tagged her car and barn with \"X's\" and her son, Lucas, is furious. Truman at first thinks its related to Sandy's cases, but something doesn't quite fit.Mercy is doing her best to keep the investigation moving regarding the old bank robbery, but its getting harder and harder to do. Her partner, Eddie, is shot while trying to interview a potential witness. Art, the former lead investigator on the case and now retired FBI agent, is being investigated as she shot the man who shot Eddie. And everyone else around her, has the flu. When Mercy's niece is shot, Mercy is inconsolable. One of the things she prides herself on is being prepared but after Eddie's shooting, she didn't restock her med bag. Feeling foolish and helpless, she turns to the one person who has never let her down - Truman.I truly enjoyed this book and can't wait to see where book 6 takes us next.~~Wicked Reads Review Team~~"}, {"Review": "\nBook Info\nPaperbackExpected publication: January 15th 2019 by Montlake RomanceOriginal Title A Merciful FateISBN 1503903303 (ISBN13: 9781503903302)Edition Language EnglishSeries Mercy Kilpatrick #5Other Editions (3)Source:Netgalley EARC\nBuy book from\n\n\nAmazon\n\n\nB&N\n\n\n\nBOOK BLURB\n\nIn the next book in the Wall Street Journal bestselling Mercy Kilpatrick series, there are no such things as little secrets…Raised by preppers, survivalist and FBI agent Mercy Kilpatrick has a deep-rooted need for a safe place. Her getaway in the Cascade Foothills is her secret. But when skeletal remains are unearthed—those of a murdered man linked to a notorious heist—Mercy realizes she isn’t the only one with something to hide.Thirty years ago, an armored-car robbery turned deadly. The mastermind was captured. Four conspirators vanished with a fortune. One of them, it appears, never made it out of the woods alive. For Mercy and her fiancé, Police Chief Truman Daly, their investigation opens old wounds in Eagle’s Nest that cut deeper than they imagined. Especially when a reckless tabloid reporter draws fresh blood. It’s clear to Mercy that somebody in this close-knit community is not who they seem to be.Some are still shattered by the heist. Some still have reason to be afraid. But which one will kill again and again to hide three decades of secrets? To land this case, it’s up to Mercy to unmask a familiar stranger before someone else dies.\n\nMy Thoughts\n\nWhen a skeleton is accidentally discovered in the woods outside Eagle's Nest it is determined to be a member of the group who committed a thirty-year-old armored-car robbery.Unfortunately for Mercy and Truman this discovery sets off a chain of events that neither one expected or of course were prepared for.Who is responsible for the successive fallout following the remains identification becomes the couples number 1 priority, especially when things turn deadly for Mercy once again.Mercy Kilpatrick is truly coming into her own as a sympathetic character to others rather than only thinking of her own self and her own needs as she has in the past.Although in this book there are different protocols in place the edgy and sometimes dark areas which are explored in the story still grab the reader as effortlessly as previous 4 books have done.For me there is a lot of growth in many areas for the main characters with room for more to come in future books.The mysteries surrounding the crime investigations were at times transparent to this reader as I managed to correctly interpret clues sooner than our intrepid FBI agent and her fellow Law Enforcement personnel.However, that being said there are still many ways for Mercy to still be a character I want more from in the future as she and Truman still have a wedding ceremony to come.\n[EArc from Netgalley]\n"}, {"Review": "Não consegui concentrar-me para acompanhar o caso policial; ou antes, não o achei tão bom que me cativasse. No entanto, achei interessante que a identidade de alguns assaltantes fosse de pessoas da comunidade de Eagle's Nest.No entanto, foi ótimo rever Ollie e saber como está bem, 2 meses após salvar Truman de morte certa. (view spoiler)[O bebé da Rose já nasceu! Pensava que era uma menina, afinal é um rapazito. Agora falta o casamento dela com Nick ;) Aquele pai da Mercy é uma besta, ao recusar-se a ajudar Truman a encontrá-la para ir para o hospital quando Rose entrou em trabalho de parto. Rose tinha pessoal médico e mais família perto, Mercy estava sozinha e em perigo de vida, qual era a dúvida a que filha devia acudir primeiro?! Que nervos!E o pai de Cade ser o último assaltante que faltava identificar! Ora essa...  (hide spoiler)]"}, {"Review": "Wow, I’ve had a love hate relationship with this series. I’m glad I stuck with it. I’m so connected and invested in these characters. How this author has no fear in killing people off and that makes me nervous. I’m a HEA kind of girl.Anywho, this was an interesting installment. U didn’t figure out who done it which is always a good thing.Side note- I’m rooting for Cade to win the day. I fell for him in an earlier installment. Keep him sweet no matter what. If the author makes him an ass as an excuse to get rid of him, I’ll be mad. Kaylee and Case now have something more an common than ever with their dads.Anyway, good installment that held my attention. Narration was really good."}, {"Review": "This is book five in this series, I hope you started from the beginning just to get more out of the story and in this one we tend to get reunited with some from the other books. We have a story we they find the skeletal remains from 30 years ago someone who was involved with a bank robbery. Mercy is investigating the remains while Truman is involved in a case where two woman were harassed and they do not know who it is. I tried to figure it out and I wont tell you if I got it or not, but encourage you to grab a copy and try to figure it out..Enjoy! Rcvd an ARC at no cost to author..(netgalley) Voluntarily reviewed with my own thoughts and opinions."}, {"Review": "would like to thank netgalley and the publisher for letting me read this gripping novela robberya murder scene found that was proven to be around the time of the robberyonly one of the robbers was found and tried the others disappeared...but is the remains that have been found part of the gang of robbers....two incidents of vandalism with two separate women...are they connected in anywaythis was my first book from this author and it wont be the last...her characters came to life and i felt that i knew them for ever...the book draws you so much that you cant put it downanother author added to my growing collection of authors to keep an eye out for"}], "Genre": "Thriller", "ID": "39888482", "Desc": ""}