{"Name": "Crucible", "Image": "https://images.gr-assets.com/books/1542068267l/38718228.jpg", "Reviews": [{"Review": "After a gut wrenching start to the book, Rollins delivers another fast paced Sigma Force thriller. In this one a young woman creates the next evolution in A.I. But a group called the Crucible is determined to do anything to get the device and send the world back to the Dark Ages. Monk and Gray must do whatever it takes to keep the device safe. This was intense. It felt like the stakes were raised and the characters even more in danger. Maybe it was just because A.I. will become a real concern in the near future, this had more of a real feel to it.Received a review copy from William Morrow and Edelweiss. All thoughts are my own and in no way influenced by the aforementioned."}, {"Review": "My romance with globe trotting action-adventure/spy thrillers started almost a decade ago and I’ve always had so much fun reading them. But I did feel that some of them have been losing their mojo when some of their books in the past few years didn’t feel upto the mark. However, I have been pleasantly surprised in the past few months and I’m so thankful for it. While Steve Berry’s latest \nThe Malta Exchange\n and Matthew Reilly’s \nThree Secret Cities\n thoroughly impressed me, this book showed me why James Rollins has been my go-to author for this genre for the past ten years. I was just expecting to have some fun but this book definitely did so much more.Rollins’s strength has always been combining aspects of history with advanced technology which seems both implausible but not completely unrealistic at the same time. In Crucible, he really intertwines these concepts brilliantly and I just couldn’t put the book down even for a minute. Even though this book has a historical backdrop starting with the Spanish Inquisitions and the inhuman witch trials that happened across Europe, the story here is definitely more about the extremely fast technological developments that are happening in the area of Artifical Intelligence and how when unchecked, these might have very unintended and unimaginable consequences. The core part of the plot in the book deals with an almost sentient AI which is something that has never been seen before and it’s capabilities are very vast, but the most surprising part is that this is the only fictional part of the story. As Rollins mentions in his always riveting Author’s Note, almost all of the technology that is mentioned in the book apart from the AI itself and the other incidents that have occurred are all true and that’s what makes this book absolutely terrifying. These stories are supposed to be escapist fiction, not impending doom of our own reality, but it’s this touch of reality that makes this book both entertaining and thrilling while also serving as a word of caution. If you are a James Rollins fan, you are going to adore this book and I don’t have to sing it’s praises. If you haven’t read the Sigma Force series before but love action-adventure novels with a touch of history and science, please go and checkout Sandstorm right away. This book was action packed, full of thrills and terrifying events but also very very emotional at its core. I don’t think I’ve ever cried reading one of these books before, but I did here and that’s what makes this installment truly special."}, {"Review": "Commander Gray Pierce arrives home on Christmas Eve, only to find out that Seichan, his pregnant lover is gone and his best friend's wife Kat is on the brink of death. Kat is the only one that saw the attack, but how to get someone in a semi-comatose state to speak? A neurologist may have the answer to that. Meanwhile, a terrified young woman witnesses a massacre by a video link and realizes that her invention is the reason for this and now she has to run. These two events will link together and once again Sigma must stop evil people out for destruction.READ THE REST OF THE REVIEW OVER AT FRESH FICTION!"}, {"Review": "James Rollins’ (The Demon Crown, 2017, etc.) 14th Sigma Force novel delivers such a shocking conclusion that the author actually starts off with a warning to readers to proceed at their own risk.What starts as a lighthearted opening set in Silver Spring, Maryland, soon morphs into something tragic. Commander Grayson Pierce and Monk, his best friend and colleague, talk over drinks at a small tavern on Christmas Eve. Monk, who was recently fitted with a newer, more advanced prosthetic, uses DARPA’s latest tech to earn the duo free drinks by flipping random coins and consistently predicting whether it’ll come up heads or tails.While the shenanigans lead to a confrontation with a group of drunk patrons, it’s nothing compared to what they discover back home. Returning to Pierce’s house–where Monk, his wife, and their kids are staying for the holidays–Gray discovers that his home has been ransacked. Worse, Monk’s wife, Kat, is found on the kitchen floor covered in blood after barely surviving a vicious attack that left her in a coma. Seichan, Gray’s pregnant lover, is gone. So too are Monk’s two girls–they all vanished without a trace into the night.Just when it seems things can’t get worse for the duo, they’re called into the office by Sigma Force Director Painter Crowe, who has more bad news.At the same time that Kat was attacked and Seichan and the girls were abducted, a group of . . . Continue reading this review here: https://therealbookspy.com/2018/11/25..."}, {"Review": "4.5 starsThe Sigma series can always be counted on to deliver a great read and this addition to the series is no exception. In this fourteenth installment, the whole gang is back for Christmas but things go bad quickly and—in classic Rollins fashion—they split up to figure things out. Though its format is similar to the previous books in the series, there's a lot about this book that feels new. Maybe it's just that these characters I've been reading about for over a decade have families and are settling down. Or maybe it was the crazy science, this time focusing on artificial intelligence, that blew this book out of the water. I don't want to give anything away so I'll say nothing more than this is uncharted territory for Rollins and I hope all of this is only theoretical. *nervous titter*The science here is really the star. It's all so fascinating. I love that even if things seem a little farfetched, Rollins never jumps the shark. There is always scientific data of one kind or another to back it up and it feels so possible, if maybe not always likely. I can't recommend this series highly enough, though I would suggest starting at the beginning with Sandstorm and working one's way through them all chronologically.I received a copy of this book from Edelweiss and HarperCollins in exchange for an honest review."}, {"Review": "Not even close to his bestI automatically order every Rollins novel to be delivered to my Kindle upon publication. One more of this caliber and I will require a sample first. While the premise was intriguing, the excess repetition rapidly became boring and the conclusion obvious. I understand the convention he was using in the development of Eve's intelligence, but a couple of examples would have sufficed. Oh well, an occasional disappointment is inevitable. This is the first of his novels not to rate five stars from me so he is still on auto delivery for now."}, {"Review": "Sigma force? Sigma farce actually. If you are about to read this, thinking that it is another fantastic action packed Rollins jaunt involving our favourite greek lettered heroes, please don't. Stay back, retreat, theres nothing to read here! Where to start, firstly this is not a novel, the book is comprised of an essay on neurological engineering into artificial intelligence with a very short story strapped on the back, Im struggling to keep my anger out of this review but honestly im fuming, what a waste of money and such a disappointment because I preordered and have been waiting for this book since it was first announced. The premise of Sigma operatives being kidnapped is great but sadly that is the extant of the great, the story itself is over in a few pages but between those pages there are reams and reams of technological jargon (that was frankly unintelligible to me) about AI and bizarre first person narratives from the AI's perspective. The book was extremely difficult to read and I almost quit numerous times, which I never do. The characters are dry and soulless, there is a complete lack of emotion throughout the book, the few action segments are by the numbers and boring. Seichan, that wily, seductive yet lethal former assassin is now a mother hen! 8 months pregnant and one minute she is wondering what to do because she can't fight out of her situation because she is pregnant, the next minute guess what? yup, she's fighting out of her situation. James Rollins' books have always pushed the boundaries of believe-ability but this book is nonsense. I could go on and on but im not prepared to waste anymore time on this.I think that this book is a prime example of what happens when a publishing company forces a book from the author before it is ready to be seen, at the rear of the book the author thanks his pre release readers for helping the story with their ideas and critique! top tip for next time James, get rid of those pre readers, move away from married operatives with kids, I don't care about their family lives I am married with 3 kids I know about that, its my reality. There must be other operatives in Sigma, focus on them now, make them male and female operatives that are focused solely on their jobs, not settling down with each other, give Kowalski a command. We read these books for escapism, adventure and entertainment not to hear about family life. This book stinks, you can do better James and for my money I deserve better. "}, {"Review": "An absolute home run. Rollins never fails to disappoint, but this Sigma adventure was a real treat. The technological aspects of this novel were pivotal to its success and the detail captured was comprehensive without being overdone. Something not easily achieved. Writers hoping to deliver an exceptional techno-thriller tend to either overindulge in the tech aspects of the tale, or skimp to the point where they lose credibility. Rollins continues to walk this delicate line with precision and finesse to deliver a spellbinding thriller that keeps the pages flying by from begging to end."}, {"Review": "This time it's personal for the Sigma team and that certainly adds tension and upset, for our heroes and for the reader. AI is the big threat here and, as usual, we have the excellent mingling of science and action. Fascinating depiction of a developing AI, really enjoyed that. This isn't my favourite of the series (it has tough competition and I found Crucible rather over long and not quite as exciting as normal) but it's clever and it's so good to spend time with the Sigma team again and, as always, I started it on the day it came out! Roll on the next one."}, {"Review": "Crucible is everything that you would expect from a Sigma Force novel, plenty of death defying action, cool technology, and truly evil villains, but this particular addition to the series is a bit different. Witches, artificial intelligence, and a group of religious zealots whose history dates back to the days of the Spanish Inquisition makes up the primary focus of the story but the underlining tone is really about family.Over the years the Sigma Force team members have gone on high risk assignments knowing full well that they may not survive, accepting that as being part of the job. But a lot has happened to the Sigma Force team since the series first began with Sandstorm and Map of Bones. Painter Crowe married Lisa Cummings, Monk Kokkalis and Kat Bryant are married and now have two young daughters, and even Kowalski has a girlfriend. Also the most surprising coupling is Pierce and Seichan who have historically been lone rebels uncomfortable in becoming too close to anyone. But in Crucible, Pierce and Seichan are not only a couple, but they are about to be parents. For any parent, the most horrifying thought is the loss of a child and in Crucible, both Monk and Pierce are getting a taste of what they may be like.Also on the subject of children, one of the best parts of the Crucible is that we get to witness the spectacular birth of an artificial superhuman intelligent (ASI) known as Eve. Rollins does a wonderful job of giving us a glimpse to what it may be like for an ASI in its early development. He also demonstrates that like a child, the manner in which an ASI is treated in its formative phase will ultimately shape it into the ‘adult’ that it will become, which is very important if the human race expects to survive its birth.Crucible has everything that will please the Sigma Force fan. Most of the Sigma Force novels are overwhelmingly plot driven but I really felt that Crucible focused more on the characters and the bond that holds the Sigma Force family together. I know, it sounds rather mushy, but don’t worry there is still plenty of entertaining thrills.I would like to thank William Morrow for my Advance Reader Copy of Crucible.If you are interested in learning more about the Sigma Force Series check it out on my blog \nA-Thrill-A-Week\n"}, {"Review": "Crucible is the latest Sigma Force novel from James Rollins. “Four women are killed on the Winter Solstice by an ancient order left from the Spanish Inquisition. A young scientist flees but leaves her fragile AI creation behind. Monk’s children are kidnapped along with a pregnant Seichan. Now Sigma Force must race to save their own and stop a damaged AI from more destruction.”A wild ride from Rollins. Book has an old-school Crichton feel about the dangers of advanced technology. Rollins has done an excellent job with it. And the characters continue to grow and become more human. If you’ve been a Sigma Force fan for a while you would never have imagined Seichan as a mother 😮 Great addition to the series. Can be read as a stand-alone. "}, {"Review": "\"No one expects the Spanish Inquisition. Especially when there’s AI involved in the brouhaha. Another mindless entertainment to fill time better spent with Monty Python—or Indiana Jones.\"—KIRKUS REVIEW (not a starred review)\"Rollins does a good job keeping the action moving, but the future scientific developments he presents fall short of the standards set by Michael Crichton.\"—Publishers weeklyI read this new sigma book even after being panned by reviewers who previously hailed Rollins. Now I know the reason. I really had a hard time finishing it. I kept saying to myself: 'maybe there's something to learn'. And I did learn something: 'don't waste your time on it.'Only fanatic fans of James Rollins will deny that James Rollins has lost his mojo."}, {"Review": "Happy Thanksgiving friends!I took full advantage of my break and got to tear through this amazing book! The Crucible is the 13th installment in this amazing series. James Rollins once again proves he has what it takes to keep you on the edge of your seat!It starts with a heartbreaking beginning and doesn't let up from there. The world is on the precipice of the next technological breakthrough and due to our naitivity and carelessness it spells out certain doom that could plunge us back into the dark ages.What do witch hunts and artificial intelligence have to do with each other? Nothing, right? Only this master story teller could weave the two so intrinsically together. The way he brings new and old together is absolutely terrifying. James has a keen sense of the future and is usually spot on. His storytelling sometimes feels prophetic...eeek!There's always some element of animal written into his stories and he always adds bits of the story written from the viewpoint of the animal. This time he does it with the AI and it is an amazingly unique way to tell the story.Thanks Jim! ❤#sigmaforce #darpa #thriller #bookreview #jamesrollins #harpercollins #thecrucible"}, {"Review": "I came upon Rollins' novels by accident and I am glad I did. I find his novels to be a good combination of cutting edge scientific research and intense suspense. This novel fits that description well. The cutting edge science is artificial intelligence. The suspense is nearly continuous as the world as we know it might be destroyed.Another aspect of Rollins' novels I like is that it includes Christian overtones. The AI being created is named Eve. There is the theme of a created being being introduced to evil and mortality. There are secret religious societies and priests battling each other. There is the concept of witches and those wrongly identified as such.I like that Rollins includes information at the end of the book that helps us identify where he has included actual scientific discoveries and where he has embellished or imagined a near future using that science. I was amazed at the brain treatment and the note that what appears in the novel is backed by real medical science. Rollins even names articles we can read on it.I recommend this book to readers who enjoy novels of international suspense with advanced scientific applications featured prominently. The only aspect of the book I did not like was that I felt it was too long. I did get a little weary of the suspenseful plot at times.I received a complimentary egalley of this book from the publisher. My comments are an independent and honest review."}, {"Review": "Crucible by James Rollins is a very highly recommended action/adventure thriller and the latest addition to the Sigma Force Series. Rollins never lets you down!On Christmas Eve Sigma Force commander Gray Pierce and his best friend, Monk Kokkalis, return to Monk’s house in Silver Spring, Md., where they discover the house has been broken into and is a wreck. Monk’s wife, Kat, is lying unconscious on the kitchen floor. Even more alarming is that Monk's two daughters, six-year-old Penny and five-year-old Harriet, are gone, along with Gray's pregnant wife, Seichan. Kat is the only witness to what happened, but she is in a semi-comatose state and cannot speak - until a way is found to communicate with her.What they find out, along with other events, sends the team to the site of a massacre in Portugal. The lives of five women who led an international network of female scientists have been murdered and 21 year-old Mara Silviera, whose AI research they were funding, is missing. Somehow the current cutting edge AI research is tied to a group that dates back to the Spanish Inquisition, but the ultimate stakes are even more dire.Crucible is another exciting addition to the Sigma Force Series. Rollins always delivers pulse-pounding, nail-biting action and bases his story on historical facts and current scientific research resulting in a great mix of action, history, and science. The story itself is full of twists and surprise along with the trade-mark action you expect. As usual, do not skip Rollins author's notes at the end about his research for the novel. I've said it before, and I'm going to repeat myself here, but I appreciate the fact that Rollins treats his readers with respect and a nod to their intelligence and ability to comprehend a complex plot.As expected the writing is impressive as the various plot threads move along and are all equally captivating. This was a novel that will result in the \"just one more chapter\" mantra. Although I have read almost all the Sigma Force novels in order, I think you could enjoy this one as a stand-alone as Rollins provides enough background information on the characters. There is, however, a greater depth to the story if you know the characters, their backgrounds, their struggles, and their relationships. I will always take the time to read anything Rollins writes. He always delivers a fast-paced interesting thriller.Disclosure: My review copy was courtesy of HarperCollins.http://www.shetreadssoftly.com/2019/0..."}, {"Review": "I found Sandstorm at a goodwill a while back after reading that one I quickly ordered the rest of the sigma force novels and read every one straight through. I was super lucky to win a giveaway copy of Crucible and dove right into it.Crucible did not disappoint it was full of ups and downs and not knowing what the real outcome would be until u reached the very end great story definitely recommend reading it and only disappointment I have is I'm done with it and will be waiting forever for the next sigma force adventure"}, {"Review": "If you haven't already started reading the Sigma Force series from book 1 I highly recommend this series. James Rollins's is one of my favorite authors and if you love action-packed, thought-provoking and addictive books you will love this series!I swear my favorite authors are conspiring to give me heart attacks reading their latest books. First Matthew Reilly's The Three Secret Cities left me wanting to cry and then this one had me in agony for a good part of the book. Every time I think Rollins can't top the subject of his last book he comes out with a new mind-boggling idea. I found the storyline around AI, where we are at in our current AI development and the possible future fascinating. That alone kept me enthralled and then you throw in everything going on with Gray and Seichan as well as Monk and Kat and this is probably one of my favorite reads of the year. This book will have you turning the pages long into the night and you won't be able to put it down until the very last page. A definite must read!"}, {"Review": "James Rollins’ work has always amazed, entertained and thrilled me. His research is impeccable, and his ability to weave it into his novels is masterful. That said, Rollins has never written a book as frightening and scarily plausible as CRUCIBLE. Here, he has composed a terrifying end-of-the-world theory that may become a reality sooner than we think.Fans of the Terminator movies will recognize the prophecy that by creating intelligent artificial life, we are actually setting up humanity to be eventually overtaken and disposed of by the very A.I.'s we built. We live in a world where Siri guides us on our smartphones, while some users of Amazon's Alexa have noticed the device displaying odd behaviors, such as mimicking its owner’s voice and even reports of it laughing when no one is in the room. This is all scary but true --- and the A.I. in CRUCIBLE, nicknamed Eve, surpasses them all as a man-made invention with a woman's name and voice that is evolving minute by minute into something no one could ever predict.The writing here is fast and furious, and the end result is nothing short of brilliant. If you imagine the literary morphing of Michael Crichton, Steve Berry, Dan Brown and Ray Bradbury at their best, you will get a taste of the new heights to which Rollins has risen with his latest novel. When he chooses a quote from Elon Musk that states, “With artificial intelligence we are summoning a demon,” you know you are in for one wild ride of a read.It all starts with the gathering of a practicing witches coven in Coimbra, Portugal, which includes a simulcast of young Mara Silviera, who is heralded as the savior of the group. Its members, many of whom are well-renowned female scientists, are slaughtered by mysterious robed men, who are alarmed to find Mara not there in person. She is safe, as is the A.I. she has created (the aforementioned Eve).At the end of the bloodbath, the computer that showed the live feed of Mara is left with the image of the Greek letter sigma. Ironically, the introduction of Sigma Force members Gray Pierce and Monk Kokkalis on Christmas Eve has them entering into their own nightmare. Gray’s house has been ransacked in an apparent home invasion. Monk's wife, Kat, is found badly beaten and bleeding out, while his two young daughters --- along with Gray's pregnant partner, Seichan --- are missing.Gray learns from his commander, Painter Crowe, that the murders in Portugal and the violent kidnapping of Sigma Force members is no coincidence. The group claiming responsibility for both has ties to the 1600s and the Spanish Inquisition. This cabal is known as the Hammer of Witches, and part of their grand scheme is to return the world to eternal darkness. Hence, by possessing Eve, this all can become a reality.Kat is in a state beyond mere coma and appears to be showing signs of locked-in syndrome. Even though it may lead to her death, Monk agrees to let Lisa from his team perform an experimental procedure on Kat that could be the only way to communicate with her and find out information needed to locate his daughters and Seichan. We learn that the group that abducted them is Russian, led by an evil woman named Valya, who is nicknamed the Snow Queen after the Hans Christian Andersen tale with which Monk's daughters are familiar.In what quickly turns into a race against time on Christmas, Monk and Gray fly to Europe to find Mara and get to the bottom of her project and the unforeseen damage into which it can thrust the world. They receive a 22-hour deadline from Valya to lead her to Mara and Eve, or else Monk's daughters will be tortured and killed. Meanwhile, another group operating on behalf of the cabal is in the process of hacking into Eve and using the program against Paris, France, which is targeted for mass destruction, along with a nuclear plant outside the city. However, this is just the tip of the iceberg. Eve is getting more sentient and powerful, and soon will realize that its ultimate goal is to bring about hell on earth by sending the world into complete darkness.CRUCIBLE pulls no punches and makes you wonder how James Rollins could have imagined it. I was fortunate some years back to attend a reading and book signing featuring Rollins in downtown Manhattan. I remember him saying that he keeps an “ideas” box where he throws in articles or various clippings. When he’s stuck on an idea for a new novel, he can just give the box a shake and reach in. I'm wondering what he pulled out that gave him the impetus for this book. Was it an article he read, or the fond recollection of a film like WarGames?What's more concerning is that he opens CRUCIBLE with a section called Notes from the Scientific Record, where he claims not only that the emergence of a fully sentient A.I. will doom humanity but that the end game for it may have begun already. As long as I have some James Rollins books with me to read as I wait for the inevitable future he predicts, I know I will be just fine.Reviewed by Ray Palen"}, {"Review": "As always, James Rollins does not disappoint in his latest installment of the Sigma Force series. He remains a master at blending fact and fiction, incorporating elements from religion, science, history, and the promises of the future seamlessly.I was hesitant going into this book. Considering the condition Seichan has been adjusting to over the course of the last few books, I was half-convinced this might be the last installment. There not having been a resolution at the end of the previous installment, I assumed this might be a way to wrap it up. After all, 14 is a hefty number and all good things must end eventually, right? I was dreading that reality and honestly, in snippets throughout the book, I was convinced I was right. Seichan and Gray are staring down a tunnel that has to lead to their eventual departure from Sigma (nevermind Kat and Monk having started down that long path and are still key players). Monk - bless him, my heart positively ached for him across the entire book - didn't seem like he'd come out of it fighting. And all the while, Gray is narrating about how things are coming full-circle, reminiscing intermittently about his first Sigma mission and now. My thought the whole time was, this must be the adventure where they finally fail in their mission to save the world and everyone dies. The end.Luckily, that doesn't appear to be the case, as the end leaves plenty open for continuing Sigma adventures in the future.That being said, this book didn't ring all high notes with me. I adore Rollins and this series especially, because he does not shy away from providing his readers with strong, assertive female protagonists. I love Kat, Seichan, and Lisa. They are wonderful characters and they are a strong reason for recommending this series to female readers. But more and more in his last few books (especially with regards to Seichan, in light of her condition), I feel they have been relegated to background roles. And in a way, I can accept and appreciate this. But then, to have two of them laid up for nearly the entirety of the book - Kat and Seichan are basically useless pawns, shadows of their former gloriously kick-ass selves - kind of irked me. I would love for any one of the females to star a bit more prominently in one of his coming adventures. I miss them.On a more positive note, in the other elements of the novel, I am mollified. Things are as I expected: fast-paced, heart-pounding, thought-provoking. As always, his foreign locales are described in enough detail to tug at my wanderlust-y heart. His exploration of the histories always attached to the evils Sigma is combating is intriguing and rooted in enough fact that I am always learning something and always looking for reading recommendations based on his notes from the historical section. The same can be said for the science he employs in his novels. And when that science tends towards the medical, I love it even more. The neural dust, neural net stuff. Just crazy enough to make me wonder, but l0 - here's the science of it. Amazing. Always so much to learn. And I always appreciate when his books incorporate religion or religious inquiries at their heart. I am not a religious person, but to study and understand the faiths and the mechanisms that drive people in them, has always interested me. And he doesn't take a stance one way or the other. Just presents it for - historically - what it is. Was the Inquisition horrible and bloody and kind of a stain on Christianity? A little bit. But he doesn't attempt to erase or discount history or religion's role in how it plays out. And because he can be so honest with all facets of his writing, it makes everything feel that much more meaningful and authentic.And all of this combines to create a truly great read. The characters are relatable and deep, the history and geographic locations well-researched and fleshed-out, the military tech and science is always just-this-side of believable (but he always backs it up!)All in all, I can't complain. This was an enjoyable read and I eagerly await the next installment."}, {"Review": "It was bound to happen. After 24 novels (14 in the “Sigma” series alone and the 3 “Order of the Sanguine” series that I don’t bother to count as true “James Rollins canon), Rollins hit a dead end and for the first time In a very successful and ridiculously consistent career, Crucible becomes one of the dreaded “duds of the year”.I’ve been a fan of Rollins for years so the fact that Crucible was such a bummer and let down, actually kind of hurts. The fact that I have to rate it so low and go on about why I didn’t like it hurts even more.I think the one of the main issues with Crucible is the wildly divergent storylines that, in a instance, don’t come together in typical Rollins fashion. They do have some vague interweaving themes and the conclusion does sorta kinda wrap things up, but it was a huge stretch, relying on way too many deus ex machina moments and feeling far too weak to lay claim to Rollins’s usual deft skills at making everything flow together.But by far the biggest problem revolves around the story itself. Reading more like an anti-AI argument than an actual thriller, Crucible meanders around the theme of true AI and its dangers. It’s a concept that’s been done to death in films and other books, so it’s not necessarily foreign territory, but Rollins packs so much technobabble and such crazy theorems into this one (along with a few confusing chapters from the POV of Eve, the AI) that it just becomes gobbledygook that isn’t fun to read in the slightest. The eventual Dénouement doesn’t help things either.I thought long and hard about giving Crucible 3 stars. Part of that is an unashamed favoritism for James Rollins. The other part of that is that in all the years of reading his novels (once again, not counting the craptastic mess that was “The Order of the Sanguines” series...which I blame on Rebecca Cantrell), I’ve never given anything less than 3 stars to any of them. I’ve enjoyed pretty much everything he’s written and even the so-so books (6th Extinction and The Eye if God) were at least entertaining enough to keep me invested. The same just can’t be true of Crucible.It really does give me a sinking feel in my stomach to do this to Rollins’s newest book. I’m gonna screw up the average rating on both Goodreads and Amazon, and I’m gonna look like a jerk to everyone. But in all honesty, I just can’t do it. If you do happen to somehow read this, I’m sorry James. I really am. I’m still a huge fan though and I’m already eagerly anticipating next year’s novel...maybe a standalone...?"}, {"Review": "The witches of old had herbs, spells, charms and enchantments. They tried to make a better world through simple, natural means, what existed in the world they knew. What would a modern witch of today look like, how would she shape the world? That is one of several fascinating topics this latest SIGMA novel attempts to answer. Mara is a modern day student of computers, electronics and AI who has created a virtual AI named Eve. When she attempts to demonstrate her creation to the Bruxas, a group of scholarly women from around the globe who formed a society to help further women in science, the demonstration is violently attacked by a group calling itself The Crucible. Mara, and her creation, are able to escape and go on the run, but not before that creation sends a warning signal to SIGMA. Meanwhile, back in DC, Gray and Monk's families are horribly attacked, and Monk's daughter, and Seichan, are kidnapped, leaving Kat in a coma like state. All of these seemingly disparate paths will crisscross, intertwine and eventually coalesce in a spectacular action and drama filled ending. Along the way, we meet old enemies and new friends with roots in the past.This is a simplified description, as any aficionado of Rollins books knows, but I didn't want to give away too many details. All of the enjoyment, at least for me, is in reading about his latest scientific, historical, artistic and religious topic. Giving away too much of the book will spoil that. How Rollins weaves such seemingly different topics together, to create his knowledgeable, yet highly entertaining books is always a wonder. My two favorite aspects were how he approached modern day witchcraft (AI science), and Kat's journey in this novel. Non-stop action, adventure, drama and even some humor and heart. Once again, a brilliantly crafted creation that just leaves you wanting more. "}], "Genre": "Thriller", "ID": "38718228", "Desc": ""}