{"Name": "I Am Watching You", "Image": "https://images.gr-assets.com/books/1500655149l/34879754.jpg", "Reviews": [{"Review": "I read this for \"Free Space/Creepy Raven\". \"I am Watching You\" by Teresa Driscoll which is a thriller/mystery. Eh where to begin. Besides the poorly developed characters, the switching from first to third person, and the slut shaming that was thrown in for good measure, I don't know what to think of this book. The initial premise intrigued me, too bad that Driscoll decided that instead of sticking with one character throughout which would have made the book stronger, she jumped around to four other characters. I started seeing shades of \"The Girl on the Train\" with this book and for those that read my review of that book, it's not a compliment.I just ended up losing interest in everyone. I only kept reading to see if I was right about the villain in this one. I was off, but honestly, the author doesn't even lay out any clues for you to get this is the bad guy/girl (being vague on purpose). It comes out of left field and the wrap up is just ham-fisted. Ella (The Witness) is taking the train and noticed two young girls. She immediately decides she should keep an eye on them when two young men board the train and start talking to them. She eavesdrops and realizes the two men are fresh out of jail and the girls and the men end up talking and drinking together. She overhears the one girl's name (Anna) and is able to piece together that she lives on a farm. Ella is tempted to call Anna's parents or warn the girls for talking to these men. When she walks to get something and overhears one of the girl's having sex in the bathroom (Sarah) she gets upset that she thought they were nice girls and washes her hands of them. When Ella wakes the next day after getting blitzed she is afraid she may have done something like call the girls mothers. Turning on the TV she is floored to see a broadcast talking about one of the girl's she saw on the train.Cue a year later.Driscoll follows several people throughout the book. The chapters are titled \"The Witness (Ella), The Father (Henry), The Friend (Sarah), The Investigator (Matthew) and Watching....no spoilers to who that is.Honestly the whole book reads as repetitive as anything. Ella's sections are just her defending why she didn't get involved (she brings up Sarah having sex in the bathroom and her own son watching porn and reading magazines with a disapproving air) and then realizing she needs to get some help when she starts receiving mysterious postcards in the mail blaming her for Anna's disappearance. Matthew, is dealing with the fact he's about to become a new father amd is still adjusting to his life after leaving the police force. Henry keeps going over the last thing Anna said to him. And Sarah is hiding a lot more than you would think about her home life. Driscoll chooses to tell Ella's sections in first person and the other sections except for the Watching sections in third person. It's hard to keep adjusting to the shift in narratives. Especially because each chapter is only a couple of pages long. I'm baffled that Driscoll just didn't stick with Ella. Maybe she didn't cause there's not a lot there. Ella is a florist, happily married, and has a son. Her focus on Anna would make sense if we got to see any semblance of the things that Driscoll describes after the fact.Ella apparently got harassed when her name as a witness was released. People blamed her for not intervening. In the day of social media I can believe that something like this could have happened. It would have made sense if Driscoll showed that. Because a year later it seems most people have forgotten her except for Anna's family and the police.The writing was so so. I realized after finishing this the main reason I got annoyed is that there is literally no clues to who the killer is and why. I think the main reason I loved \"The Tokyo Zodiac Murders\" is that the author makes sure that there are real clues for you to follow as a reader. You can solve the crime. The author for this book throws out a twist that is ridiculous and you get no hint of who the killer is at all. Heck, I don't care for \"The Girl on the Train\" but at least the author left enough there for you to connect the dots.The flow isn't great. The book has bright spots here and there. I liked Matthew and that was about it. I'm realizing now maybe him being the main character would have worked better. Heck Driscoll could have turned this into a series if she had him be the lead.The ending was just the author trying to tie up loose ends. I honestly think there was a lot left to explain, but I was just glad to be done with this. At least I got it as a Kindle First pick for September."}, {"Review": "I Am Watching You is a thrilling suspense novel by Teresa Driscoll. There is a reason it has been on the Amazon Bestseller charts - it is a very gripping, well told tale! Ella watches on a train as two local girls on their way to London get mixed up with two unsavory men just released from prison. She wants to say something, but doesn't. The next day she finds out that one of the girls has gone missing. Consumed with guilt, she goes to the police but, of course, it's really too late. This, however, is just the beginning of the harrowing tale. The girl is missing, the two men are missing, Ella is receiving threats and everyone has secrets. Perhaps because I, too, live in a small community but all aspects in this story seemed quite real. The inter-connectedness of everyone, the secrets and lies. Told from multiple view points we, the reader, see how each person's involvement overlaps and the butterfly ripples were created. I also now see that there were so many clues along the way that I completely overlooked! Most likely I will re-read it just to spot them all! I highly recommend I Am Watching You and hope you enjoy too! Thank you to Amazon Kindle and Teresa Driscoll for my Goodreads Giveaway copy. "}, {"Review": "I listened to this audiobook at the beginning of January. As soon as I was done, I typed my review into a Word document. However, I can't find it anywhere now. I also deleted all of my notes (since I was done my review). So I am going to try my best! I am still relatively new to audiobooks but I'm starting to enjoy them. I find them perfect to listen to while doing chores or when I'm in the car. It's also nice to give my eyes a break sometimes. I was really intrigued after reading the description for \"I Am Watching You\". If I was on a train or other public transportation and I saw young women getting ready to head off with men just released from prison...would I intervene? First of all, I would probably have earphones in and wouldn't hear their conversation. But if I did hear it? I'm honestly not sure what I would do.The story was told from multiple points of view and I normally don't have an issue with that. We had Ella, The Father, The Friend, The PI, and more. With so many characters and their individual stories, there was a lot to keep track of and at times things didn't seem to fit. For the most part, I was able to keep up, but I occasionally found myself getting distracted, thinking of everything but what I was listening to. The multiple characters and story-lines left me feeling a bit disconnected from the story, but I was still intrigued and really wanted to find out what happened to Anna! Though I did have a few issues with the novel, overall, I enjoyed it. There was a decent amount of mystery and suspense, and I was very surprised by the ending, I never saw it coming!"}, {"Review": "A riveting thriller that sees Ella on a train bound for London, seated near he two teenage girls. Two young men enter the carriage and it soon becomes apparent that they are fresh out of jail. This doesn't deter the girls however, and they soon strike up a friendship. Ella becomes increasingly worried about them, but then stops herself from intervening at the last minute.The next day one of the girls, Anna, is reported missing, and Ella is beside herself, wondering if she could have helped the girl instead of turning away. Anna's friend Sarah is saying much about what had happened to them the previous evening and the police soon run out of leads. But what is Sarah hiding? Who else in the girls' families are keeping secrets? And who is sending Ella anonymous postcards? I found myself frantically racing through this book in one sitting, trying to work out what had happened and kept coming up with what the police did, dead ends! I will definitely be looking for more of this authors work and recommend this book to all lovers of mysteries and psychological thrillers."}, {"Review": "Unfortunately, this was a it of a meh read for me. So many people and POV's (which I usually enjoy), and shifts between first and third person muddled up the plot for me and even though the writing was good, I never felt the characters developed very much apart from Ella. I was definitely intrigued by the story, but by the half-way point, found myself a little confused and not terribly invested. Still, I wanted to know how it would end and what had actually happened to Anna, the missing girl. The resolution felt a little rushed after such a long build-up and a little unsatisfying at that. All the same, I didn't think it was a bad book, just not a great book either. Find more reviews and bookish fun at http://www.princessandpen.com"}, {"Review": "A teenage girl goes missing after a special night out with a girlfriend. Story told primarily from the viewpoints of the witness, the private investigator, the father, and the friend. I really didn't mind the way this was put together, although at this point it would be positively refreshing to read something that does not employ the use of a multiple POV framework. I enjoyed it well enough, but found myself thinking about what I wanted to read next before getting this one finished. This was a Kindle First offering, and I do appreciate the opportunity to read it at no charge."}, {"Review": "This is a well-done, well-paced mystery. The main mystery is what happens to teenager Anna Ballard. She and her friend Sarah are on a train to London when they meet two men carrying garbage bags who admit to just getting out of prison. Mother and wife Ella overhears this and wonders if she should call the parents. When Anna goes missing overnight, Ella is wracked with guilt for not acting sooner and is also vilified in the media—including social media—for not doing something before it was too late.Everyone has secrets, which we know because the story is told from multiple points of view. Sarah doesn’t tell the police the whole truth. Anna’s father isn’t telling the whole truth. Ella’s son has secrets. What’s initially ominous to Ella, however, is the series of threatening notes she receives—and also doesn’t tell the police about. She does let a private investigator know. Matthew quit the police force to become a PI for reasons that are kept secret to the reader for most of the book.I had a little trouble buying that everyone would blame a mother who didn’t call the parents on the fact the girl went missing. Other than that, though, I really liked the characters of Matthew in particular. Ella’s guilt seemed misplaced, but I’m not a mother and, happily, I’ve never been in the position of watching a teenage girl make terrible choices and then go missing. I thought this was fun and an easy, fast read. Thanks to NetGalley for the opportunity to review this book.For more of my reviews, please visit: http://www.theresaalan.net/blog"}, {"Review": "3 StarsAnna and Sara lied to their parents and instead of going to watch a movie, they were seen in a train. That night Anna was missing and Sara couldn’t remember what happened. But there is a witness who saw them in the train with two men who got out of prison. Ella, the witness, heard their conversations and wanted to call but she was distracted at that moment and sometime later she saw Anna’s picture as a missing girl. One year later, Anna’s still missing, Sara still can’t remember and Ella feels guilty and blames herself for not calling. And let’s not forget about nasty notes she receives, like:WATCH YOURSELF.I DO…It was an okay read for me. It was real slow. But my main complaint is the author wrote more about the characters’ personal life and less about Anna’s missing or the mystery. It’s told in multiple POV (both in 3rd and 1st person) and one of them was a private investigator that Ella was hired but I really didn't understand his role in the story because until the first 70% he was with his wife and his newly born daughter, like all the time! Anna’s father most of the time thought about his past with his father and his past with his girls! Ella was stressed out about her son! The Watcher’s POV was too short and actually it didn’t have anything to say, it wasn’t even thrilling! Sara was involved with her personal life! So there was less about Anna and her missing! The characters’ personal life was a bit too much in this story for me! But it was unpredictable!Thanks to Teresa Driscoll, Netgalley and Thomas & Mercer for the advanced digital copy in exchange an honest review."}, {"Review": "Ella Longfield was on her way home on the train when she notices two young girls flirting with two men that she is sure are just out of prison. Ella is of course concerned and debates on what she should do to make sure the girls are safe. Should she call someone? Approach them? But as the trip goes on one thing leads to another and Ella finds herself home without having done anything. The next morning she awakens to see on the news that one of the girls, Anna, had gone missing the night before. A year goes by from that fateful night with Ella still upset that she hadn't done anything and possibly stopped Anna's disappearance and with the girl still gone someone else decides Ella is at fault and begins sending her threatening letters. Ella hires an investigator to look into the letters and with the anniversary of the disappearance a public appeal is planned but before long it becomes clear that others are also hiding secrets about that night and just what happened to Anna. I Am Watching You by Teresa Driscoll ended up being one of those thriller reads that to me just wasn't as thrilling as I hoped it would be. There are a few reasons I could think of that kept me from completely becoming immersed in the story and on the edge of my seat like I prefer to be in this type of book. I thought maybe a part of that would be the simple explanation of the huge time jump shortly after the story began. Jumping a year into the future after a person goes missing seems to leave little hope for a good outcome so as much as I was still a bit curious it failed to really grab me just at that point early in the book. Now another thing with this one that seemed to make it a bit tougher to connect to the story for me was the way the book changes the point of view between several different characters. The chapters are titled with things such as The Witness (Ella), The Father, The Friend and eventually The Private Investigator along with a couple of other POVs later in the book so as it's switching I was struggling to match who was who and the characters were just not popping out to me and taking a life of their own. Perhaps it was the style or perhaps I just didn't feel there was enough depth to them to really connect but it gave the story another bit of slowness to it. In the end this one was simply one of those books that to me was just an alright read that hadn't really grabbed me as much as I prefer. It wasn't that I didn't like it but more of one that I will find a bit forgettable once moving on from it since nothing really popped out to me or became overly exciting in my opinion. Perhaps other will enjoy it a bit more than I did with the style in which it was written though. I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.wordpress...."}, {"Review": "A fast, enjoyable read that held my interest but ultimately left me disappointed. The final reveal lacked excitement for me. All the build-up and backstories were suspenseful and they definitely served their purpose, but the resolution was rushed and unanticipated. Every character had something they were hiding which made for a good suspect list. I had to keep reading because the next chapter might be the one where the really big secret was revealed. While I was able to pick up some little things here and there, I did not figure out the story behind Anna's disappearance. Some small elements of the story seemed unnecessary; they didn't add anything to the plot. (Sal's pregnancy is one example)I enjoyed this book and it was a solid 4 star read... until the disappointing ending. I struggle now with how many stars to give this -- it was an enjoyable read and just because I didn't care for the resolution (and I didn't see it coming) doesn't mean I should rate it lower. In fact, maybe I should rate it higher because I didn't see it coming. I've settled on somewhere between 3.5-4, so I will round up to 4 stars."}, {"Review": "A fairly well done mystery that takes place after a teenage girl goes missing while on a trip to London. It shows how everyone suffers the ripple effects from a single event. Told from multiple points of view, we hear from the parents, a friend, a witness and a private eye. All the immediate friends and family have secrets they are hiding which we are let in on bit by bit. I found myself fascinated by the witness and how she was treated by the community. So many of us would have done the same, not taken the extra step to get involved, especially given she didn’t know the girls or even their last names. In fact, when we read so often of people directly witnessing crimes and not stepping in, her actions seem almost minor and definitely understandable. There are some parts of the book which I struggled to figure out why they had been included. The book could have been compressed which I think would have led to a much more streamlined, better book. Did I really need to hear how Ella puts together bridal bouquets? It’s not a fast paced book by any stretch. It’s more of a steady Eddie. I really wanted to see what had happened to Anna, but I wasn’t enthralled by this one at all. And I was dissatisfied by the ending, which seemed a bit of a rush job after all the lead up getting us there. The narrator does a decent job. She doesn’t attempt to make the voices different. "}, {"Review": "I LOVE this author's writing and her previous two novels are among my favourite reads ever so I was eagerly waiting for this book. And wow! With this amazing, unputdownable, suspenseful masterpiece, Teresa Driscoll proves that she is right up there with the best thriller writers of today. This book is genius! What I admire most about this author is her beautiful writing, spare and yet heart-wrenching, and this book combines that wonderful writing with a tense, page-turning plot. A tense, pacy, sensitive and emotional story, written in the author's stunning and heart-tugging prose. A book that makes you think, one that will stay with me for a long time. One of the best psychological thrillers I have read! Right up there with Gone Girl and in my opinion better than The Girl On the Train. Cannot wait for more from this brilliant, versatile and incredibly talented author. "}, {"Review": "3.75 stars.This is the story of Ella, who was sitting on a train listening in on a conversation between two girls and two young men that they have just met. She considers phoning someone as the men are newly released from prison, but then something happens and she changes her mind. The next day she finds out that one of the girls, Anna, has gone missing.This story actually starts a year after the disappearance, and is told from different viewpoints. Only the chapters from Ella are in first person, the others are all told in third person. We hear from Anna's father, from the private detective that Ella hires after she starts receiving threatening letters, as well as from a few others.I did enjoy this book, but at times I got a little frustrated as one chapter took the story so far and then the next chapter changed perspectives. I did want to keep reading, to find out what was going to happen, and I did like the writing style too.All in all, this was an entertaining read."}, {"Review": "At times intriguing, at times difficult to follow, I Am Watching You was a three-star reading experience for me personally. Overall, I liked it but I wouldn't read it again. However, fans of various psychological thrillers may enjoy being thrown around in a story with incredibly secretive characters and find it well worth the read. If this applies to you, check it out!My favorite quote:“Because once you become a parent, you learn that love can involve more fear than you had ever imagined, and you never quite look on the world in the same way again.”"}, {"Review": "Well great to join in a buddy read, with a group of us reading this book for January.Some great points about this book, firstly I do enjoy the stories/chapters from all the different main characters in the book. A great opportunity to build the story through the characters and plots, build the tension and it does work so well.When Ella Longfield overhears two attractive young men flirting with teenage girls on a train, she thinks nothing of it—until she realises they are fresh out of prison and her maternal instinct is put on high alert. But just as she’s decided to call for help, something stops her. The next day, she wakes up to the news that one of the girls—beautiful, green-eyed Anna Ballard—has disappeared.A year later, Anna is still missing. Ella is wracked with guilt over what she failed to do, and she’s not the only one who can’t forget. Someone is sending her threatening letters—letters that make her fear for her life.Then an anniversary appeal reveals that Anna’s friends and family might have something to hide. Anna’s best friend, Sarah, hasn’t been telling the whole truth about what really happened that night—and her parents have been keeping secrets of their own.Someone knows where Anna is—and they’re not telling. But they are watching Ella.So many hidden secrets from a wide array of great characters, great tension, gripping and well told especially from the main character Ella.A great first novel, although I did not guess the end, it all happened a little quickly, this was the only weak link in the book.So four stars."}, {"Review": "Disclaimers: The synopsis section is ©Goodreads but the rest of the reviews are completely my words and of course the quote section is obviously from the book reviewed. 4/5 ⭐⭐⭐⭐  Definitely Recommend \n Also On My BLOG (Sun Oct. 15, 2017)@6am \n  Synopsis: What would it take to make you intervene?When Ella Longfield overhears two attractive young men flirting with teenage girls on a train, she thinks nothing of it—until she realises they are fresh out of prison and her maternal instinct is put on high alert. But just as she’s decided to call for help, something stops her. The next day, she wakes up to the news that one of the girls—beautiful, green-eyed Anna Ballard—has disappeared.A year later, Anna is still missing. Ella is wracked with guilt over what she failed to do, and she’s not the only one who can’t forget. Someone is sending her threatening letters—letters that make her fear for her life.Then an anniversary appeal reveals that Anna’s friends and family might have something to hide. Anna’s best friend, Sarah, hasn’t been telling the whole truth about what really happened that night—and her parents have been keeping secrets of their own.Someone knows where Anna is—and they’re not telling. But they are watching Ella. Overall Opinion: It's on the Amazon Bestsellers List, which is why I bought it. It earned it's ranking. The novel is very engrossing. Every chapter has you on the edge of your seat. I haven't read a novel that has taken so much control over my days in a long time. I actually had this one RTC for a few weeks because I simply had so much to say and no idea how to. You become insanely absorbed in the plot, when you come to your senses, you just think \"How are these people around me acting like it's a normal day.\"  Book Brain. It's a thing now. Lol.  SURPRISE  I invented a new thing,  once again. Are you shook? You should be. This one takes an emotional toll on your mind. You instantly are worried and always questioning every character. You don't know, who did it until the end. One second I thought it was the main character, the next I thought it was a less important character. You constantly assume it was someone else. It is told in dual-pov. You see the side of the Best Friend and the side of the Witness.I didn't really grow feelings for that characters which is slightly disappointing. It's always  fun  sarcasm to get your heart broken by a fictional character. I felt sorry and hopeless for a lot of them, though. I often found myself confused because it was such a puzzle. My mind was running on overdrive and playing detective the entire way through. Every time you turned around you're twenty steps backwards. There was always new information being nonchalantly slid into sentences, but none that actually led to the answer. It's one hell of a rollercoaster for a thriller. I thought James Patterson was the best at morphing the unexpected, but Teresa Driscoll played her cards so right. This was better than  The Girl On The Train by Paula Hawkins.  I never thought I'd say that for at least another few years.Best book I've read all year in this genre. It excels a majority of Thriller/Suspense legacies.  Quotes: 🌑  \"What would you think if you saw two men board a train, each holding a black bin bag - contents unknown?\" 🌑  You're supposed to care more about what you think of others that what they think of you - so why is it I am still waiting for this to kick in?\" 🌑 \"Once you become a parent, you learn that love can involve more fear than you had ever imagined, and you never quite look on the world in the same way again.\" Short Girl Out; Signed,-Ash"}, {"Review": "What would it take to make you intervene?When Ellie Lovefield overhears two handsome young men flirting with two teenage girls on a train,she thinks nothing of it - until she realises that the two men are fresh out of prison.Worried about the girl`s safety she decides to call for help but something stops her.The next day she wakes up to the news that one the girls - Anna Ballard has disappeared.A year later,Anna is still missing,Ella is wracked with guilt over what she failed to do and fearing for her life because someone is sending her threatening letters.Then an anniversary appeal reveals that Anna`s friends and family might have something to hide.Anna`s best friend,Sarah,hasn't been telling the whole truth about what happened that night and Anna`s parents are keeping secrets of their own.Some knows what happened to Anna - someone who is watching Ella.This at times gripping mystery is told in short,snappy clearly headed chapters by Ella (the witness) Sarah (The Friend) Henry (the father) Matthew (the private investigator) and some italicized chapters by the mysterious watcher.Ella`s chapters are in the first person point of view while the others are in the third,the swapping and changing of the perspectives didn't bother me or spoil my enjoyment of the book.I loved the short chapters and that there was a cliff hanger at the end of most of them which gave me a very bad case of just one more chapter syndrome.My favourite character was Matthew,I felt a lot of sympathy for Sarah (we have all been young and made mistakes that we regret),Luke and Anna`s mum Barbara.I found Ella`s constant habit of feeling sorry for herself and going on about her guilt annoying and rather repetitive,she was not the most likeable of people,I didn't like Henry very must either.The identity of the watcher was a surprise,I would have liked to have read more chapters told from that person's point of view and also more clues scattered throughout the story to encourage the reader to work out the person's identity by themselves.The mystery of what had happened to Anna was intriguing and i liked the way the author kept the reader invested in her story and wanting to know what happened.I did enjoy this book but I can't give it five stars due to the constant mentioning of flowers and flower arranging,it became frustrating and repetitive and also a unnecessary bit about a fly,they added nothing to the story but that's just my opinion.Many thanks to Thomas & Mercer for a arc of this book via netgalley in exchange for a honest review."}, {"Review": "Ella Longfield becomes an unwitting sort of witness when she overhears a conversation while on the bus. Two young teenage girls start flirting with two young men .. but then she realizes that they men are fresh out of prison.What to do? Call the parents of the girls? Tell the young men to leave the girls along? Talk to the girls and warn them? Just as she decides to call for help, she overhears something else that stops her in her tracks.The next day one of the girl's picture is splashed all over the media. She disappeared the night before.A year later, Ella still feels guilty that she did nothing and someone else thinks she should pay, as well. She's received a series of threatening letters.Someone knows where Anna is—and they’re not telling. But they are watching Ella.I AM WATCHING YOU is told by different voices... Ella, the friend who was with the missing girl the night she disappeared and her family, and the private detective that Ella hires to track down the person sending her letters.These are all credible characters ... and some of them have secrets .... and some are buried in lies. Many twists and turns will have you momentarily forgetting to breathe. "}, {"Review": "🥀 Harrowing Halloween Book! 🥀OK, this book doesn't fit in the horror genre nor is it set on or around Halloween. So why does it belong in this month's theme? It's about a teenage girl who goes missing and hasn't been found a year later. If that isn't one of the scariest, most horrific concepts ever then I don't know what is.Trigger Alert for sexual assault, self harm and eating disorders. The Witness became suspicious of the motives of the men on the train and thought about calling the Police but something stopped her. The next day one of the girls was reported missing. A year later she has yet to be found. The witness is wracked with guilt over their failure to act.The Father is haunted by his missing daughter's last words to him. He lied to the Police about where he was the night she disappeared.The Friend has never told anyone what really happened that night.The Private Investigator was in the Police force until something happened that haunts him to this day.The First Postcard: \"WHY DIDN'T YOU HELP HER?\"I Am Watching You takes you inside the search for a missing teenage girl. It draws you in and doesn't allow you to sit comfortably on the fence. You are faced with the decisions each character made and forced to wonder what you would have done in their place. You may find yourself silently judging someone's choice and later provided with further information that turns your preconceptions upside down.Are we too quick to judge people based on what we see on the surface? What is the media's role in helping or harming an investigation? Who's to blame when someone goes missing? What would you have done if you were the girl's mother, father, sister, friend? What would you do if you saw something that made you uncomfortable? Would you stand up for what you believe is right? Or would you look away and pretend you didn't notice?How do you live with the choice you made when that choice comes with ripple effects?Told in third person, with the exception of the witness whose story is in first person, each of the alternating chapters leaves you on a knife's edge. You're craving resolution of the cliffhanger in that person's story yet you're so quickly immersed in the next person's narrative that you find you can't decide which answer you want first. Usually this sort of suspense would have me ready to throw my Kindle at the wall but that wasn't the case with this book. I Am Watching You had me diving straight into the next chapter so I could uncover the answers sooner.I found this an easy read in that the narrative flowed well and I didn't have to work hard to immerse myself in the story. I got sucked straight into the story and each time I returned to it the vortex reopened and it felt like I never left. I also found it a challenging read as it required me to ask myself what I would have done over and over, and sometimes I was uncomfortable and didn't like my answers. I remained dry eyed but my heart ached for the anguish experienced by so many people I met through  Teresa Driscoll's words, and not solely because of the missing person case. While everyone's story touches the missing girl's life in some way, they each had their own lives with joy, torment and a depth that you rarely see with multiple character perspective novels. I look forward to reading future books by this author.I received a copy of this book from NetGalley (thank you so much to NetGalley and Thomas & Mercer for the opportunity) in exchange for honest feedback. I'm going to be watching this author, just not in a creepy way. 😜 "}, {"Review": "Confusing This did improve as I approached the end , but not enough to make it a good book, just Ok. I felt that it was told from too many points of view, which I usually like, but not in this case. Didn't help switching from 1st to 3rd personI kept drawing parallels with The Girl on the Train, which in my case is not a compliment. I lost interest and only carried on to see if my guess was correct, it wasn't, but to be honest the answer comes out of the blue. Really don't think there were any clues as to what had happened. It was if the author didn't really know how to end it and made some random stuff up. Only good thing about it, I managed to read in a day, so didn't waste too much time on it."}, {"Review": "I am Watching You is a gripping psychological thriller that I found very intriguing and almost impossible to put down right from the start. This book felt very real and I was so engrossed in it, I completely forgot I was reading.There was a great mix of believable characters and I really wasn’t sure who to trust, due to secrets certain characters were hiding. Despite having my suspicions, I didn’t guess the outcome in advance.This was a tense and exciting read, and I even had tears in my eyes at the very end. I do have a bit of a phobia of travelling alone on trains as I have a habit of attracting weirdos, and I also find London scary, so I’m sure these things increased the intensity of the experience for me.I loved Recipes for Melissa and Last Kiss Goodnight by this author, so I was really looking forward to this book. I’m pleased to say it’s another cracker, and I can’t wait to see what this author comes up with next."}, {"Review": "There are elements that are very good in Teresa Driscoll’s book, “I Am Watching You.” At the same time, there are other aspects of the book that were bothersome.The book is composed of short chapters, with a number of characters relating the story. The main character is Ella, identified in her titled chapters as The Witness. Ella was on a train ride and thus became one of the last people to see Anna before she disappeared. She was also able to describe the two young men who had approached Anna and her friend, Sarah. Anna’s disappearance and probable murder haunts Ella throughout the book, as she blames herself for not doing anything to protect the young girls, who are both 16 years old.Other characters are introduced, and some are painted as the potential guilty party. Ms. Driscoll makes the guesswork murky as many of the characters have secrets that may or may not be connected with Anna. The overall plot is good, and the author continues to keep us questioning who might have been involved right up to the book’s end.What bothered me about the book was the writing style and some plot specifics. Ms. Driscoll has a habit of using partial sentences, and while these can be effective, they lose their power when used excessively. At first, because the story started off with Ella relating everything in first person, I believed it to be more of a stream-of-consciousness thought process. However, when the author moved to subsequent chapters (everything else in third person), the phrases and partial sentences continued. While it would have worked for Ella to tell her story in that manner, having every character think the same way seemed to blur the characterizations. The other stylistic device used over and over was the introduction of a secret at the end of almost every chapter. Again, this can be a powerful tool, but when used constantly, the story becomes more bothersome than exciting. Most of the story is told a year later, and the investigation into Anna’s disappearance is still being worked on by the police. When the guilty person is finally revealed, it was difficult to believe that the police would have neglected to perform a full investigation (the author tells us at the end that police only did a “cursory” investigation on the person). I hesitate to say more as it would potentially become a spoiler, but for me, this became a fatal flaw and made the ending feel forced. Coupled with the writing issues described a few paragraphs ago, I ended up with mixed feelings the book. I thought this could have been a great story, and there were elements – characters, a good plot idea, a number of misleading side stories, good dialogue – that might have added up to a fantastic read. Unfortunately, the writing style and the inefficient police investigation brought this down to a better-than-average tale. Three-and-a-half stars."}, {"Review": "So this book begins on a train ride where, Ella, overhears a conversation being had between two sixteen year old girls and two very handsome men that, as of that day, were just released from prison. The conversations are flirtatious. So much so that one of the girls, Sarah, and one of the ex-cons decide to have a quick romp in the train bathroom and Ella is completely beside herself. Now Ella’s motherly instinct kicks in and she wants to intervene. Make the young ladies call their parents but she doesn’t and instead she moves to another part of the train to create distance. The next day she hears on the news that one of the girls is now missing and she is completely devastated that she didn’t listen to her intuition and now feels she is to blame. Okay, so, when I first started reading this I thought of myself as a 16 yr old and how I would react to a complete stranger demanding me to call my parents. Uh, I wouldn’t have taken it so well and probably would have told her to go screw. Now, as an adult and mother, I can understand Ella’s concern but that still doesn’t make me too thrilled with the slut-shaming that happens. She is so incredibly horrified and disgusted that one of these girls would have sex with a complete stranger in a train bathroom but she insists she is not a prude and, maybe she’s not, but she is very naïve. Being that she is a mother of a 17 year old son she definitely has no clue as to how teenagers behave. I’ll admit that this beginning didn’t hook me because I was annoyed with Ella and her train of thought but I persevered and I’m glad I did because this book has a shit ton of SECRETS and man do I love those! This book follows three perspectives. There is the aftermath of Anna’s family dealing with their missing daughter, Ella whose name was leaked to the media and she has now been publicly shamed by nearly everyone for not intervening, and we also have Sarah who is Anna’s best friend and travel companion during the night of the disappearance. What really happened to Anna? You’ll have to read it to find out! Quick chapters that all leave cliff hangers and more puzzle pieces until you’re able to see the big picture. This is why I kept flipping the pages! Very entertaining.Oh, and what is the likelihood of two ex-prisoners being released from prison on the same day and BOTH are model gorgeous?!?!? That’s some good fiction right there! Thank you to NetGalley for providing me with a digital ARC in exchange for my honest review. "}, {"Review": "Thank you to Kindle First for allowing me to read this before the publication date in exchange for an honest review. This book was not for me. I tried and tried to get into it, but I struggled a lot. I finished it and I feel like I didn’t really even read anything. I was pretty disappointed with all of the things that went on through this story.First, I had a really hard time with the characters. The characters intrigued me in the beginning with the story and how things were progressing, but as I got further and further in, I couldn’t find a character that I liked or related to. There were so many point-of-views that I found myself confused and having to restart.Next, I didn’t really find this book to be all that grasping or mysterious. By the end, I was a little confused and the last chapter just tried to bring everything together. The writing definitely wasn’t my favorite thing, but it did have it’s moments.Lastly, I think this book would have worked better if there was a difference in either the choice of main character or the plot. I think that this book had a lot of different promising qualities. There just wasn’t enough mmph in the characters or plot for me to thoroughly enjoy this book."}, {"Review": "I received a copy of this book from Netgalley, in exchange for an honest review.Ooh, what a gripping thriller!I'm not normally one for a classic 'page-turner', but for this book, I'll happily make the exception. It's an absorbing, deftly crafted suspense novel, with twists and turns a-plenty, minus the hackneyed cliff-hangers featured in so many other books of this genre.It starts with two girls on a train, and a woman observing them as they chat away to two older lads (who have just been released from prison). Ella - the observing lady - debates whether to get in touch with the girls' parents, to make sure they're safe. However, after hearing one of the girls getting up to some rather indecent activity in the toilets, she decides against. It's a decision that she'll soon live to regret.This book covers the classic 'missing girl' plotline - but it's about more than that - about the effects of a disappearance on the witnesses, as well as the family itself. It's about family secrets too, and how these can result in a domino-effect leading to a cataclysmic outcome. And it's about solving a mystery, of course. I'm delighted to say that I did not see the end coming at all.If you love a gripping, cleverly written plot, this is definitely the book for you. "}, {"Review": "Ella is on the way home when she overhears two men flirting with two teenagers in the train. Her amusement turns to concern when she learns the two men have just been released from prison . She thinks about warning the girls but at the last moment decides to mind her own business. The next day to her horror she realizes one of the girls , Anna Ballard , is missing and nobody knows what happened to her . A year later there is still no trace of Anna and Ella is racked with guilt about not warning the girls off. The police still don’t have clue but when an anniversary special about Anna airs on TV, Ella starts getting threatening letters and hires a private detective Matthew to get to the bottom of it. When Matthew starts investigating different things come to light and everybody including Anna’s father and her best friend have secrets to hide.An interesting story line narrated with different POV’s in third and first person . A good enough mystery with a lot of suspects but for some reason I could not relate to the characters. There was a lot of backstory and details about the flower shop that was unrelated to the plot which made me skip through some pages. Overall 3 ½ stars as the suspect was a complete surpriseMany thanks to a Thomas & Mercer, Kindle First & NetGalley for providing an ARC of this book in exchange for my honest and fair review.This and more reviews at https://chloesbooksblog.wordpress.com/"}], "Genre": "Thriller", "ID": "34879754", "Desc": ""}