{"Name": "The Forgotten Hours", "Image": "https://images.gr-assets.com/books/1537230024l/41574593.jpg", "Reviews": [{"Review": "2.5 starsI appreciate the author's attempt to tell a story with complex characters and tough subject matter, but for me this one missed the mark. The bare bones of a good story were there but the transitions from the past and present timelines felt disjointed at times and lacked a cohesive flow. When I finished the book one thought that crossed my mind was it felt more like a good rough draft of a book but needs some work and polishing to turn it into something more meaningful.When Katie Gregory was a teenager her best friend accused Katie's father of sexual assault. He was convicted of the crime and after serving time in prison he is set to be released. Old memories pop back up to the surface and coupled with new information, Katie seems to question just about everything in her life.The premise for the story had potential but the execution for the most part fell flat. I wish I would have felt more for Katie than I did because obviously she was in such a tough spot given that not only was her father accused of a horrific crime, but her best friend was the accuser. But other than a few moments here and there, I just never felt all that invested in the story. There's a similar type storyline in a book I read awhile back, The Best Kind of People, and in my opinion that one is a better read than this one. This was my free Amazon Kindle First selection for January 2019. "}, {"Review": "Please note that I got this via Amazon's Kindle First Reads. I really loved the premise of the \"Forgotten Hours\" (a teenage girl loses her best friend and father after a rape accusation and trial). This type of plot feels very timely. That said, I thought that the story being told in third person point of view actually pushed me away as a reader. I think if it was told in the first person point of view I would have felt more entwined with Katie and her choices. Also, if it had been first person point of view, I would have given more leeway on the secondary characters (Zen, Lulu, her father, mother, brother, etc) being written so shallowly. However, writing in third person point of view, I think she could have tapped into everyone's emotions a lot more and the backstory. I needed to get into Lulu's and her father's head more. \"The Forgotten Hours\" goes back and forth following the events that broke up Katie Gregory's family more than 6 years ago. Katie's best friend from childhood accuses her father of rape, after two years of investigation/trial, he is found guilty. This ends up causing her family to fracture. Now that he is getting out of jail, Katie is focused on getting her family back to the way it was. There are complications however with her father wanting her to return to their family's cabin, and make it ready for him. This leads Katie down a path to figure out what really happened, and was it her fault.Katie is really the center of this story. I wish that Schumann had her come to some realizations a lot sooner. She has had to draw herself in due to what happened to her family, and I get that. However, her relationship with Zen had her being ambivalent about it for reasons dealing with her father. It's pretty obvious that Katie sees herself as her father's daughter and him being sent to jail for something she doesn't believe he did has broken some part of herself. I just wish that we had seen more interactions between her and her brother David. That character is written as being more aware of things then Katie ever did. I just wish that they had more honest conversations. The same with Katie and her mother. Back to Katie, we get more insight on what occurred 8 years ago (when Katie and Lulu were 17) and how Katie worshiped Lulu until a boy comes between them. The book flips back and forth between present day and the past.I think Lulu was written well, but I wanted more there. Her story made me sad and I think it got passed over a little too quickly. The question that Katie has is why would Lulu lie about her father. However, we are given hints here and there what was going on with Lulu and I wish that had been the story. Katie's father, John Gregory, is charismatic. There is a pull to him when we have the story in the before time period. He is the guy that everyone is drawn to, wants to make happy. Even Katie contrasts him with her mother and she finds her lacking due to her withdrawal from their family. Katie is haunted by her teen crush and I just thought that whole thing with him was a waste (the present time period). The before time period, once again, Schumman types into something when she goes back to first loves, summer days and night, and the smell of the sun and the lake on your skin. The writing was good, though sometimes a bit overworked. I have to say that I loved all of the sections dealing with Katie and Lulu showing them growing up together and their summers together. Schumann taps into being a young girl and how hard it is sometimes to be best friends with someone. We also get Lulu's longing to be part of Katie's family and how Lulu's life is so different from Katie's.When we switch back to the present time frame, I just see Katie as a pale shadow still being jerked around by Lulu. You would think that she would be separate from her at this point. We know that the two had no contact after the rape accusation besides a nasty email that Katie sent. But you have Katie wondering why Lulu never reached out to her. I just rolled my eyes a bit at that.The setting of the book bounces between New York, upper state New York, and London. I have to say that Schumman writes of New York, and summers on the lake very well. The parts in London were very thin to me. We/Katie get info dumped about some things and I just wish it was done differently.The ending was bittersweet. I wish it had ended differently because I honestly don't think that the Gregory family ever really comes to term with things. Ostriches, the lot of them. "}, {"Review": "\nSo much waiting, so little pay-off.\nI truly wanted to love this book. The powerful #MeToo movement our country has seen surface the past few years had me desperately wanting to root for Lulu...but it was so hard. Her character was fake, belligerent, and a tad narcissistic. I know others will disagree, and that's okay. I just had a hard time feeling anything about her at all. As for Katie...yuck. She was aggravating. In this day and age, when EVERYTHING is splashed all over the internet, we're really supposed to believe she didn't even know who testified at her father's rape trial? Really? Unless she's an ostrich with her head buried in the sand, it's simply not plausible. I don't mind suspending belief a bit, but come on. Charlie and David could have added so much texture and insight, but the author instead chose to make them meaningless, secondary characters who added nothing at all to the tapestry of the story. The main problem for me? The book was just horribly boring and anti-climatic. Nothing happened except page after page of Katie's internal dialogue--long, rambling, tedious passages. The story also jumps back and forth over multiple time periods, but the changes aren't identified in any way at the start of the chapters. Makes for a bit of confusion. Overall, I give this book 1.5 stars. I had such high hopes, but what a disappointment."}, {"Review": "This was a new release that was provided to me from Kindle First. It had an alternating timeline between the past and the present which I liked, but it didn't really flow well between the two. I thought the topic was spot on with the things going on in the world, but the story didn't move along well. It was very slow to start, but got better in the middle. The characters, Charlie, David, jack, seemed flat and didn't seem complete. John, the father, was just creepy in every way - Yuck, even when the reader doesn't know whether he is guilty or innocent. I did finish the book, but didn't think the ending was that great. It was an OK book, but I don't know that I will be recommending it to others."}, {"Review": "Riveting. If I had to sum up this debut book in one word, that would be it. What would you do if your father went to jail for statutory rape of your best friend? Who do you side with? What if your choice might be wrong? I admit that I feel a lot of overwhelm from the #metoo news of the world today, and wasn't sure how I was going to feel about this novel, but Schumann pulls you into Katie's world and wraps you in all the emotions from each character in such a way that you literally can't put the book down. There are often many sides to a story and relationships can be incredibly tough and complicated and Schumann deftly shows you all that nuance. I'm going to be thinking about this book for a long time to come. Thanks, NetGalley and Lake Union for the early peek at this book! "}, {"Review": "THE FORGOTTEN HOURS is a stunning novel that moves seamlessly between the aftermath of a trauma that shattered one family and a summer evening that ruined many lives. As current events clash with truths Katie Gregory has kept hidden—from her lover and herself—she’s forced to return to memories she’d rather forget. Memories that tug loyalty in conflicting directions and question everything she knows about trust and love. Was her father guilty of the crime for which he was convicted? Who’s lying, and how much does Katie remember of that tempestuous night when she was fourteen and fighting with her best friend over a boy? Trying to unravel the answers before the heart-pounding finish kept me up way past bedtime. A must-read for book clubs! "}, {"Review": "2.5 STARSIt took too long for things to get moving. The book is so focused on Katie, and she's such a frustrating character! It would have been better for the story to be set further in the past, it just didn't seem believable that Katie was so sheltered and naive about everything that happened. As it was, the chapters set at the lake house felt like they could have been from the 70's.Katie's a woman in her mid-20's, a college graduate, and yet she comes across as someone unable (maybe just unwilling?) to think like an adult. She never heard anything about the trial? She never looked anything up online? She never once thought to not blindly trust in her father? She was exhausting!So much focus on Katie meant that other interesting characters got shortchanged: namely Lulu, Katie's mom and Katie's brother. I would have liked some chapters from their POV. I'm a little disappointed in the ending, I thought what happened with Katie's dad was kind of taking the easy way out."}, {"Review": "An okay readI bought this book from the blurb. It was touted as a book of the year, and held the promise of so much, and in parts it did deliver, but overall it wasn't anywhere near as satisfying as I expected.I found Katie, the main character, tiresome and incredibly juvenile with her constant introspection and total self absorption. As a teen this seemed reasonable, if tedious, but for a woman in her twenties, too damn naive to be believable, the deliberate way she hides her head in sand is not credible, especially as she goes to university and gains a degree and yet fails to gain any sense of self - she is still so naively trusting as to be convinced of her father's innocence and this really stretched my credibility. I kept thinking, hell at Katie's age I was a mother who had buried a child - and here's a university educated woman who deliberately shuns learning the truth of her father's trial and conviction - The other characters, Katie's mother, her brother who could all have contributed so much to the story were mere cardboard cutouts without any real substance and yet they could have added so much more richness to the story.The only character that came alive on the page was Lulu, she was painted with such vivid strokes that showed up all the characters. This book holds the threads to be so much more but for me it fell sadly flat and left me disappointed. At times I wanted to shake Katie and tell her to grow the hell up, and to kick her mother in the shins and wake her up out of her apathy, she was certainly sadly lacking as a parent to shield her children from the narcissistic tendencies of a man who was little more than a charismatic Peter Pan, a man who never wanted to grow up and be a father to his children."}, {"Review": "Katrin Schumann, Author of “The Forgotten Hours” has written an emotional, intense, suspenseful, and captivating novel. The Genres for this Novel are Fiction and Women’s Fiction. The timeline for this story starts in 2007 and the present and goes back to the past when it pertains to the characters or events in the story. The author describes her characters are complex and complicated. This is a story of coming of age, of friendships, of loss, and betrayal. It also is a story of family, disappointment, memories , forgetting, love and hope.Katie Gregory, now twenty-four years old, with a successful job, a considerate boyfriend who is an Artist, often thinks back in time to an earlier time when she would be with her best friend Lulu at Eagle Lake having fun. Life seemed to be less complicated, and there were boys, fun, and parties. Unfortunately, Katie now waits for her father to be released from prison, where he has been for six years, accused by her best friend of an unspeakable crime. Katie has to go back to the lake and fix up the cabin for her Dad to live in. She dreads the trip, because of many memories, and some things she has forgotten.Katie needs to make sense of everything that has happened. When she has asked for information from her parents, she has been put off. What exactly happened? Katie must go back to the past if there is any hope for the future. The omissions of information and Katie’s ignorance encourage her to look again at the pieces of the puzzle. What information will Katie find? I would recommend this novel to readers who enjoy a suspenseful and emotional novel."}, {"Review": "Thought-provokingWow. This book was a really good read. Reading from Katie’s POV really puts you in the middle of the story and makes you feel what she’s feeling. I liked reading how bit by bit her willful ignorance melts away and how she’s forced to confront the truth. It couldn’t have been easy thinking that either her father was a rapist or that her best friend lied about it. When she started to really see the truth you were hyperventilating with her. Not wanting to see the truth that her father was a drunk who had multiple affairs and slept with his underage daughter’s best friend. Even I wasn’t sure what I believed to be the truth. "}, {"Review": "\n“Don’t all girls say no at first?”\n THE FORGOTTEN HOURS is a novel that shifts between the aftermath of a trauma that ultimately becomes the destruction of Katie Gregory and her family and the summer evening that triggered it all. Six years on and Katie Gregory has kept her father’s secret from everyone new in her life, even going as far as changing her last name (although she believes in her father’s innocence without question at the start of the book?) only to then be forced to return to memories she’d rather forget when her father’s release date is mere weeks away. Memories that overshadow her unwavering loyalty, blurring the lines between reality and fiction and suddenly, without warning, Katie’s questioning everything she knows about trust, love and truth that belies it all.(view spoiler)[Was her father guilty of the crime for which he was convicted? Who’s lying, and how much does Katie remember of that night when she fought with her best friend Lulu over a boy? How reliable is the testimony of a teenage girl when she’s accusing someone thirty years her senior of rape? How can an educated twenty-four year old woman have next to no knowledge of the trial that sent her father to prison for six years?This book is touted as a #MeToo novel that intricately displays the concept of consent and the consequences that can unravel in the aftermath—except, in reality, it’s not. Consent or the lack of it hardly pays a part in this novel at all. It’s briefly talked about; a paragraph here and there as Katie struggles to find a grip on the catalyst that tore her family apart (not that there was much of a family to destroy in the first place—her father was a serial cheat, liar and unreliable in every instance and yet to her, completely trustworthy?) For a book to rely on the #MeToo message to attract a particular reader, then I’d almost expect a much broader discussion on consent, the consequences of the word NO and far less victim-blaming (which was definitely in abundance, although albeit subtle in its projection).Not to mention that Katie Gregory is by far the worst character I’ve ever had the displeasure of reading about, let alone seeing the world through her tinted, and yet very biased, eyes. She is a rather tiresome character and incredibly juvenile in her warped thoughts and feelings based around a trial she has very little evidence and knowledge of. She’s far too naive for a woman in her twenties, with the way she constantly sidelines the reason behind her father’s sentencing and fails to acknowledge—almost to the very end of the novel—that there is always two sides to every story. Surely no one can blindly trust someone else, regardless of who they are to you. It’s reckless and entirely immature.(At one point, there’s even a section where it’s insinuated that maybe Lulu invented the rape as revenge for Katie stealing Lulu’s crush away but let’s not get into that or I’ll be here all night.)With the blurb and previous reviews, this novel held the promise of so much, and in parts, the writing was astounding—rape is a topic that should be addressed with care while also raising the subject of consent—but it wasn’t blown away with it. Part of it fell rather flat and to me, I simply can’t enjoy a book like this where the real victim is nothing more than a secondary character while Katie Gregory is the one that parades herself around like the victim. (hide spoiler)]"}, {"Review": "https://thebookloversboudoir.wordpres...This is my first time reading the author. I thought The Forgotten Hours was great, pretty dark at times but a great read. I was hooked from start to finish. I really felt for Katie, struggling to hold her life together, so blindly believing her father’s innocence. The book moves back and forth between now with Katie preparing for her father’s release and the fateful night ten years ago when her world blew apart. Katie discovers there are things about the past and her, now divorced parent’s life she never knew and her world starts to come apart again. The final few chapters of the book really rattle along as Katie edges closer to the truth about what happened that night between Lulu and her father as she lay asleep on the couch."}, {"Review": "The Forgotten Hours was y choice from Amazon FirstReads selections available in January (details here >> https://www.amazon.com/firstreads ). I chose it simply because it seemed like my kind f boks, although I admit that I didn't have a whole lot of hope for it as a whole. Fortunately, I was wrong. Schumann tells the story of Kate and Lulu, young girls growing up together in a cabin during the summers of their youth. The summer before everyone heads off to college proves to be quite a clusterfuck in that that both girls are maturing and realizing just how different they are. Told mostly from the perspective of Kate in the present, we often see flashbacks of the many summers she spent with Lulu as she attempts to figure out just what went wrong that last summer, and whether or not she has been believing a lie for the last half of her life.***/5A breakthrough novel that mixes coming of age with misunderstandings and the devastation they can bring. For fans of Liane Moriary or Madelaine Wickham, you should definitely grab your free copy before January ends and the new reads are listed!Rather buy it? Order here >> afflink: https://amzn.to/2VrFRom"}, {"Review": "This is an immersive tale where the protagonist finds her family loyalties and trust are put to the test. At first I was reluctant to read this book based on the subject matter revealed in the blurb, but I am so glad that I did.This novel draws you in from the beginning, with the Prologue establishing the setting for the fateful night where Katie’s life crumbles. Cleverly written in the present tense, this is a reflection of how Katie continues to relive these memories and cannot let go. This is because she firstly cannot believe what it did to her family and her relationship with her best friend, but also because, deep down, she is trying to understand the bigger truth about what happened. Such haunting memories continue throughout the novel until the climax at the closing so that we, as readers, are journeying on the same path of discovery as Katie. I don’t normally pull quotes from novels in my reviews, but I think the following reflects the plot beautifully: “to move forward, she was going to have to keep going backwards”. As Katie returns to the lake to prepare for her father’s return, she uncovers more information about his trial. Katie is determined to learn the real truth about what happened between her father and her best friend, Lulu, and, once she begins reading the interrogation scripts from court, does she find that something is not quite right. Katie’s relationships are tested throughout the story and this mirrors her difficulty in coping with her father’s imprisonment, to the extent that it is significantly impacting her currently relationship with Zeb, her causal boyfriend. Like Katie, readers also want to know the truth. It is easy to understand why Katie is so reluctant to uncover this because it tests everything she has believed in. Schumann carefully covers the issue of rape and it does not make you feel uncomfortable at all, instead allowing you to immersive yourself in the thrilling plot. With the prevalent #metoo campaign, you cannot help but sympathise with Lulu, particularly as more is revealed about her difficult childhood. You can only hope that some resolution is met between the two girls, and Schumann leaves readers until the epilogue to discover whether this actually happens.Smoothly moving between the past and present, you feel the internal conflict that Katie experiences with her feelings towards her father. He is her hero, wrongfully accuses of something he could not have done. Therefore, her reluctance to find about more simply reflects her natural reluctance to question her father’s role in her life. I could not put this novel down as the story progressed. At the same time, I didn’t want to read it too quickly because I was enjoying it so much! The revelations at the end and the plot development made me actually gasp out aloud, and I think this is a sign of a great read. A powerful journey to find the truth, I really enjoyed this immersive, thrilling read and felt the ending was as satisfying as it could have ever been. A brilliant read."}, {"Review": "Meh. So much hype, equally much disappointment. Schumann writes very well in some instances but struggles with character development in others. Charlie and David were very one-dimensional and could have added so much more depth to the dynamics of the story. Katie was absolutely annoying as an adult and seemed to be stuck in childhood, refusing to move forward and grow up. The Jack storyline and 'big reveal\" fell flat for me and was just another indicator of Katie's immaturity and stunted development. I felt that Lulu was the strongest character but I couldn't really connect with any of them. But the book gets a lot of rave reviews, so you still may want to check it out. If you do, stop back and let me know what you think!"}, {"Review": "Wow. First of all, Schumann is an excellent writer. Second, trigger warnings: Statutory rape (graphically described in court documents), neglect, and child abuse. This story features difficult family dynamics, lots of drinking (underage and adult), drugs, language, and sex. Schumann does an incredible job at exploring how blind loyalty can lead to an inability to see or recognize the truth. In the book, Katie is in her twenties, the only one in her family who is regularly visiting and speaking with her father who is in jail for the statutory rape of Katie's best friend, Lulu. Katie stopped speaking to Lulu after the accusations came to light, and has fiercely defended and supported her father. Through various flashbacks and vignettes of Katie's current life, we watch as she makes the difficult journey of discovery while simultaneously preparing for her dad's release from prison. It can be a difficult book to read, though it was very compelling. I had a hard time putting the book down to go to sleep.I knocked off a star for what happens to Katie's father in the end. (view spoiler)[In some ways it's a sort of satisfying comeuppance for the erstwhile villain, but to me, it felt too tidy. I know that's an awful thing to say about a human being's untimely death, but real life is messier. If this were a memoir, the author would be writing about distancing herself (and her new family) from his toxic behaviors and learning to grapple with his ongoing antics, not having the problem of his existence wiped out so soon after his release from prison. I know books aren't real life, but this book could have been an artful sort of memoir and the ending kind of spoiled it for me, though it was satisfying to see Katie more happily settled. (hide spoiler)]"}, {"Review": "This is one of the January First Reads. It had a lot of potential with a meaty story about a girl whose dad goes to jail for the rape of her best friend. Lulu, the best friend, was a wonderfully drawn character but the main character Katie was rather frustrating. She was rather immature and self-involved. The dad is is richly drawn and complex but the other family members are cardboard cutouts. It went downhill toward the end and stopped grabbing my interest. It still had it's thought-provoking moments. I would recommend for Kindle Unlimited subscribers. "}, {"Review": "After a bit of a slow start, I thought this book was going to be a 4 star for me. But the last 40 minutes (which felt like 4 hours) just killed it. Didn't care anymore and just wanted to finish. Not the way I like to end a book. Sorry, not sorry☹️"}, {"Review": "I really loved the first two parts of this book and burned through them. The insightful portrayal of complex emotions and nostalgic memories, the kinds of realistic feelings and internal conflicts swirling around loyalty to our loved ones when they fail, the weight of what happened and the denial, the way all of the characters carried pieces of it with them, the symbolism of the tattoos... all of it was such a strong start. But the strength of it came from the promise of a strong payoff, and it just wasn't there. The end of Part Two was a cathartic punch in the gut. The end of Part Three left me feeling like I had just wasted my time.I think parts of this book are still really important and poignant in the way it unflinchingly portrays victim blaming, along with the internal feelings of growing through young adulthood and the uncomfortable process of learning your parents are adults with full lives. But I recommend it only conditionally.(view spoiler)[This felt like a prize-winning novel that somehow got shoved into a blender with an afternoon soap opera. The melodramatic climax, the altercation at the cabin ending in Katie's injury and John's death, seems so emotionally mismatched with the emotional beats of the novel. John's realistic character became a flat drunk villain. The whole sequence and its aftermath felt somehow slapped together, and in part a desperate attempt to make Zev seem like a worthwhile love interest. Which, frankly, is symptomatic of the overall problem with Zev in the story, who is symptomatic of the structural problems with Katie's character development. Does Katie love Zev? Katie's mother says she does, so Katie decides she does. Katie's mother tells her to not worry so much about her father's approval, but all she's done is supplanted that with her mother's approval. At no point prior to the epilogue do I get the impression that Katie is in love with Zev. And frankly their narrative seems misplaced within a narrative about statutory rape, in which they call repeated attention to the age difference with Zev and how she feels like it's thrilling and forbidden and physical; he pushes Katie's boundaries by coming to her house without asking, unannounced, and telling her he wants to move in. To clarify, I don't think Zev is a rapist or sexual abuser in any way, it just seems like an inappropriate choice considering how he's portrayed within the story in light of the greater themes. It's just a little weird and uncomfortable, knowing that he referred to her as a young girl when they first met, and that Katie never seemed to be in love with him. Especially in the context of her relationship with her father, he seemed like an older man whose attention and validation she desperately craved, just as she did with her father growing up. Highly realistic under the circumstances, but hardly appropriate for her happily ever after.The only person Katie seems actually in love with is Lulu. Which the author briefly acknowledges via Jack in exactly one line and otherwise does not examine. I don't think they should have ended up together, but I do think it's important to note.Speaking of Jack, I actually really liked how his part was handled. It seemed a little too overly-saccharine for Katie to hook back up with her childhood sweetheart and get a happily ever after with him, so finding out that she was in love with an idea of him and not the real person - and subsequently deciding she didn't want to be around the real person - was a satisfying subversion. I think she should have ended up single. Even if she kept the baby - which felt like a cliche plot device but that's neither here nor there - what Katie needed was to learn how to make her own decisions without the approval of anybody, especially any parent or other authority figure. The complexity of the early portions of the book was done a disservice by the simple and melodramatic ending where there's a big conflict and John dies. It frees Katie not through her growth and maturity, but through situation. I'd prefer to see a version where John lives, the conflict with him isn't particularly dramatic but quietly satisfying at best, and Katie learns to live with the reality and ongoing presence of a parent she has decided, of her own accord, to cut off. We're told that Katie is more mature and independent but we don't really see it.Ultimately I don't think it needed a neat resolution. Parts of this book wanted to engage with the messiness of life, while other parts wanted to be clean-cut. One thing I do really appreciate is that it's communicated quite clearly that John did rape Lulu, but in a realistic way where it's all a mosaic of evidence rather than a single confirmation within the narration. (hide spoiler)]"}, {"Review": "I can't really make my mind up about this one......it was one of my Kindle First choices this month. It brought to mind a true-life case I read about once which was fascinating. I found it dragged quite a bit for the first part and then seemed to get going and get more interesting as it progressed. I read till the end and things weren't as they seemed and there were surprises along the way but it was all a bit too deep for my liking. There seemed to be a LOT of writing and not much happening, if you know what I mean. It might've gripped me more if it was condensed a little or had more dialogue. It all got a bit touchy-feely towards the end. I didn't really like Katie all that much; she came across as a little too insipid for my liking, though I think this is how the author meant her to be. I didn't warm to her dad very much, either. It was also never really made clear as to WHY Lulu stayed with the Gregorys all summer every summer !! I found that pretty peculiar.I thought it was odd, too, that The Spotlight Team were mentioned near the start as I was under the impression they were the people investigating the Catholic priests......There were a few mistakes.....this sentence didn't need the but....\"Though Katie couldn't remember now what she'd asked, but she could feel the grit.....,\" there were a handful of apostrophe mistakes, dream self needs hyphenating, close in should be closing in, this sentence lost the, \"It was the strangest thing, having her father move around in space next to her,\" but for a debut novel there weren't tons of errors, which was good. It's interesting she references another couple of books I've tried but just didn't get on with (and I packed both of them in) since I ended up being in two minds about this one as well."}, {"Review": "The complexity and raw emotion make this a compelling read. Katie, at the start, is a young teen with her best friend, Lulu, at the summer lake house. She adores her father and Lulu, and Jack, a boy both girls are interested in. The summer is contains one of the pivotal moments of her life, the next chapter switching to years later and slowly unfolding from there between both times, in memories both clear and hazy. Katie's recollections, allegiances, and world are shaken and torn asunder as she discovers the truth of what happened. While there is a hopeful ending, this is an emotionally rich book that may be difficult for some to read. The women and girls are often treated as many often are, in times and societies past as well as now - given only information they need, and there for the men's amusement. Katie's discovery of the many truths of this is brutal yet rings with such sincerity that it's a compelling read. The characters are not entirely one sided by gender, which is a nuanced blessing some authors forget. Some women are good but long suffering, others neutral or awful. Some men are abusers, others are the rescuers. Much is revealed along the way, showing monsters in many forms as well as forgiveness. I'd like to read more from this author. The novel is a rich psychological look at so many aspects of society: sexuality, marriage, friendship, abuse, the court system, and more. An example of the writing: \"But she had not been tempted to look him up back then. She’d become accustomed to the sense of herself as separate from all others, and there was something comforting about that. It was best to keep the past just out of reach, hovering a little more than arm’s length away. While she knew it was there, could sense it, she carefully kept those memories out of her grasp, and she sometimes seemed to forget the past entirely. But that was an illusion. Her memories of Jack, of Lulu—of life before—were not actually gone and forgotten; they lived on inside her, shadows of a bleached-out stain.\""}, {"Review": "(Kindle)I'm ambivalent about this book. I feel like the attempt to tackle such a difficult topic should encourage me to give it a higher rating. It comes down to, would I recommend this book to others to read? If yes, then it should be at least a 4 or a 5. I don't recommend this book, so I'm giving it a 3. It tried. It made a good effort. I didn't hate the book, but I don't recommend it.The story is told sometimes in the past and sometimes in the present. It's a difficult tale. A family tragedy and a mystery. Katie's father is about to get out of prison and she's dealing with her feelings of loyalty, embarrassment and shame as she tries to come to terms with the crime that sent him away: He statutory raped her high school friend Lulu.The idea that this really happened is beyond Katie's imagination and she returns to the location, meets up with her old boyfriend who had also been a witness in the case and goes to the courthouse to read the transcripts of the trial. Much had been kept from her at the time. Afterwards her mother divorced her father and moved away.This is a story about relationships and trust. There weren't really any surprises. Life is complicated. The end of the novel resolved little. We know what happened that long summer ago. but what about today? How did any of this journey teach, or free, or inform, or help Katie grow emotionally?I was more interested in Lulu's story. Or even Katie's mom's story.Katie felt like she was numbed by grief or shame...and she never really came alive for me.Not recommended."}, {"Review": "A solid 3. Amazon Kindle First for January 2019. First of all, this is a very promising debut novel. However, it’s not an easy book to review as reading it resembled the peaks and troughs of the isobars that have the knack of lurking around the UK. The start was a trough - it took so long to get going that I wondered whether I’d made a wise choice in picking this as my AKF. I also questioned why Katie took so long in trying to establish the truth of her fathers conviction for the rape of her friend Lulu several years previously. I found her frustrating as a character as her lack of decisiveness and burying her head in the sand for so long was an irritant. I also found the flitting backwards and forwards through time broke the flow but I think the author shows genuine potential and so I would think that with more books under her belt she will be able to develop techniques that allow a book to be more seamless. There was also a lot of unnecessary detail especially about the landscape which didn’t add to the story. I think the focus on Katie was perhaps a mistake as I would have been intrigued to hear more from Lulu. So what of the peaks? There were some really lovely descriptions and some that I felt were very original. There were some sections that were really good. When her father met Zev for the first time, when they were all at the cabin, when she begins to uncover the truth through the court transcripts to name but a few. So then the pace would pick up nicely but unfortunately it wasn’t consistent enough. Overall, the concept of the book was good and I would say it’s worth reading to see a promising author at the beginning of her literary journey. "}], "Genre": "Thriller", "ID": "41574593", "Desc": ""}