{"Name": "Judgment", "Image": "https://images.gr-assets.com/books/1526144378l/40108808.jpg", "Reviews": [{"Review": "3.5 Stars* (rounded down)A Complex, Intense Thriller! Juliana is a married Superior Court Judge. While at a Conference she meets a handsome man and for the first time in her life, Juliana cheats on her husband. Little does she know, it’s a set up. Juliana is presiding over a sexual harassment case - and some powerful people would like for her to rule in a very specific way and will do whatever it takes to get her to rule in their favor. That includes, blackmail and even murder. If Juliana doesn’t comply, she can kiss her career and possibly her life, goodbye. What starts out as a game of cat and mouse, quickly becomes a game of conspiracy so complex my head was spinning. The storyline started out strong and quickly became so complicated, which I felt became the novel’s downfall. “Judgment” was however, a quick, easy read with relatable characters. The initial storyline of a legal battle was quite interesting and will have me going back to read other Joseph Finder’s other novels. This was another buddy read with Kaceey! Thank you to Edelweiss, Penguin Publishing Group - Dutton and Joseph Finder for an ARC of this novel in exchange for an honest review. Published on Edelweiss and Goodreads on 11.11.18. "}, {"Review": "Finder’s Judgment explores how even the most sacred institutions could become susceptible to blackmail and how doing the wrong thing is like drowning in quicksand that you keep falling deeper and deeper into. The story features a career-minded Massachusetts Judge who hopped into the wrong bed while at a conference and suddenly finds her marriage and career dangling from a thin thread as her misdeed is used to bend her will and her rulings in a sex discrimination case. From there, it’s a cat and mouse game with a seemingly all-powerful conspiracy. Part legal thriller and part action thriller, it’s a fast paced read that is sure to have wide appeal. That being said, there are many such thrillers available on the bookshelves and this one rarely seemed realistic, believable, or down to earth enough. Many thanks to the publisher for providing a copy for review."}, {"Review": "Judgment has an interesting premise: an up-and-coming judge based in Boston has a one night stand while at a conference in Chicago. A marital risk? Yes, but Judge Juliana Brody decides that since it's very clear it's a onetime moment, it's a minimal risk.Obviously, her judgment is flawed on that. (Sorry, couldn't resist!)Juliana is immediately blackmailed over the one night stand regarding an ongoing case she's presiding over and suddenly she's in a dangerous place where not just her career but her life and the life of her family is in danger. The villians are menacing, with a reach so long it's a wonder that they even needed to go after Juliana at all. Of course, if that hadn't happened there'd be no book. So overlook that thought!The chapters are short, the pace is quick, and the writing...well, Judgment opens with the weather. Which, okay, sets the scene but it feels forced--like a \"start with the weather and then move on to the Big Moment\" kind of thing. It's clunky. Judgment is fast, and it throws a lot of stuff at you, but you know exactly what's going to happen and characters are so predictable that some are 90-99% clothing descriptions, as if giving them even a semblance of personality would take too much time. The whole thing reads as if everything in between 'The Next Moment in Plot' is a waste of time, as if every character is like the weather. Mention, and move on. And that--non-stop action as plot, characters, everything--it isn't enough for me. Fast pace? Awesome. But not when, as with Judgment, that's all there is to be had. I need more.One star because I did read the whole thing. And case dismissed!(I know, I'm shaking my head at me too.)"}, {"Review": "I have been a fan of Joseph Finder for quite some time now so when I was approved for a review of Judgment I broke into the requisite approved dance and got to reading ASAP. Like other reads by this author, the suspense does not letup and before long, the last page is turned, and the last sentence is read. I always look back like what the hell? I wasn't ready for it to end.Judgment introduces us to the honorable Judge Juliana Brody who usually plays it safe until one night, against her better judgment, she has a one-night stand. Determined to move on and get back to walking the straight and narrow path, Juliana is blind-sided when she sees the man she had the one-night stand with in her courtroom as counsel for the defendants. Because the case she is presiding over is a high profile Enter the requisite blackmail notice and readers might suspect Judgment will be unoriginal... but everyone makes mistakes. It's OK. That's why we have judges to make it right.Juliana Brody proves her self to be a formidable adversary for the extremely bad powers that be. Knowing that any move she makes could lead to either death or humiliation, she charges forward with her plans to tilt the scales of justice in her favor. What Finder makes work here in Judgment is that he provides a heroine that you can't help rooting for. Plus, the bad guys are really shitty bad guys that will hesitate at nothing to get what they want. In order for Judgment to work as well as it does is to have a protagonist that has the right connections. Once the antagonist is discovered, it's hard seeing how an every-man has a chance.Although I objected to finally coming off this roller coaster with Joseph Finder and Judge Brody, I am excited to tell other fans of his work that Judgment is a great, fast-paced thriller, that I have come to expect from Finder. I find in favor of Finder's fans. Copy provided by Penguin Group via Netgalley"}, {"Review": "“Judgment” by Joseph Finder poses the question “How much will a mother, wife, judge, do to protect her family?” It is a story rich in complexity and moral challenges. Judge Juliana Brody is Chicago on a business trip when she meets Matías Sanchez. It was just one night, but a night that will change everything about her life forever. Juliana’s husband, Duncan, is a professor at New England Law. There were a few problems in their marriage, if she were being honest, that were bigger than that one incident, three years previously. Daughter Ashley, eighteen, is working in Africa during a “break year” between high school and college. Jake, sixteen, is in remission from childhood leukemia, but like a shark’s fin in the water, the possibility of a relapse always lurks around. He is in academic trouble at school and is using marijuana via a vape pen. Very soon, none of these problems will matter.Judge Brody is handling several cases, but one, “Rachel Meyers v. Wheelz,” is complex, troubling, and taking too long. A young woman is suing a hot new ride‑hailing start‑up for sex discrimination. In the midst of the proceedings, a new member of the defense team is introduced, Matías Sanchez. She slowly understands that she has been used, seduced, set up. Then, someone is dead.The plot revealed as Juliana Brody sees the world. Readers learn about her, her family, and her work. Little details make the characters come alive, what they wear, what they eat, and what they like to do. Finder creates tension that permeates even everyday activities; fear and danger hang on every page, over every mundane event, in every conversation, and around every corner. Readers connect with Brody, become part of the process, make discoveries, weigh choices, and fear the outcome. The body count rises as layer after layer of deception is peeled away to find the rotten evil core. Readers keep turning pages searching for clues, and looking for options and solutions. Then, there is a plan.Finder has created a complicated web of double cross, espionage, financial impropriety, and international conspiracy at the highest levels. “Judgement” is a compelling story of corporate misdeeds, corruption, and just plain dirty work of the utmost nastiness. Readers should plan time wisely because once one starts reading, it is impossible to put down. I received a review copy of “Judgement” from Joseph Finder, Dutton, and Penguin Publishing Group."}, {"Review": "I was amazed at both how much I enjoyed this book as well as how incredibly topical it is. It is the story of Judge Juliana Brody, a judicial star whose life was upended by the mistake of sleeping with a stranger. This proves to be the catalyst for the rest of this totally engrossing thriller. That night becomes her KOMPROMAT, as her life is swallowed by threats from the Russian MAFIYA, demanding that she must obey their wishes or she and her family will be murdered. So much like the stories that we are now seeing investigated by Robert Mueller. During this ME TOO year, the case in question is one that involves sexual harassment in a company controlled by Russians. Finder creates a totally enthralling story with a heroine, who is brilliant, cunning and fearless. Of course there are moments when we must strain credulity, but I was so engrossed, I barely noticed these moments. I confess that I could not put this book down. This is simply a terrific read and one which truly resonates at this moment. Thank you NETGALLEY for the opportunity of reading this very enjoyable novel."}, {"Review": "I enjoyed reading this book! I finished it in two days! I was in such a reading slump finally I picked this book and I completely devoured it! The Judgment by Joseph Finder was a complete thrill ride, Juliana Brody is a Superior Court Judge in Boston. While attending a legal conference she decides to have a few drinks at the hotel bar. This is not a normal act by her she usually stops at one and leads a pretty scheduled life and she prides herself on that. She meets the handsome man Matias he’s a stranger and she commits an indiscretion. This wouldn’t be a problem except she’s married and a mother of two. The next day she heads home and decides this was a mistake and she puts the incident behind her. The next day she heads into court on a huge sexual harassment case against a large corporation. The handsome stranger ends up being a lawyer for the large corporation that’s being sued and she’s the judge! Soon she’s being threatened to out her affair that was video taped, threats against her life and her families unless she rules a certain way on the case. Juliana soon realizes she can’t trust anyone and whose behind the threats and can anyone in her life be trusted or do they all have a motive. This book had it all for me, murder , mystery thriller and I highly recommend it! Four stars! "}, {"Review": "Joseph Finder’s bibliography cuts a wide swath, from his addictive series featuring corporate investigator Nick Heller to his high-concept, stand-alone financial and legal thrillers. His latest novel is set primarily in the legal arena and seems so close to the real world that the reader doesn’t wonder if something like the events portrayed in the book happened, but when.JUDGMENT begins with an interesting setting and quickly ratchets up the suspense from there. Juliana Brody is a highly respected Boston judge for whom even greater things --- a federal judgeship, no less --- are anticipated and expected. She is in Chicago at a law conference and considers a final evening drink alone when she meets a charming and innately vulnerable gentleman named Matias Sanchez, who is there on vacation. One thing leads to another, and Juliana, who is married to a law professor and is the mother of a high school student, does something she never does. Going with the moment, she finds herself having a one-night assignation with the handsome stranger she has briefly met. They both make it clear that what has occurred can never happen again.The next morning, Juliana returns to her life and her judicial docket in Boston. That docket includes a gender discrimination case involving an up-and-coming ride service company. Juliana is conducting a hearing concerning a protective order when defense counsel introduces an addition to their team in the form of Matias Sanchez. One does not need to have a legal degree or any knowledge of the judicial system to be aware that Juliana has a significant problem, particularly when Matias begins instructing her in private on how she is supposed to rule on certain motions. Juliana is in a terrible bind. She most certainly cannot tell her husband what occurred in Chicago, and she is also unable to recuse herself, as her secret will be revealed if she does. Her career is on the line as well.There are a number of other issues that Juliana is trying to figure out, including why the defendant is willing to go to such extraordinary lengths to win the case. She has to do some investigation on her own and then act upon it if she is going to save, or at least somewhat preserve, the professional and personal sides of her life. However, the situation is going to get worse before it gets better. Juliana is not the only person involved who is being threatened, and she soon learns that there is the possibility that her family and career aren’t all that is at risk for her. Ultimately she has to outmaneuver a powerful adversary but may not be able to do so. Things don’t end exactly as one might expect, but then again, they rarely do. Still, you’ll race to the conclusion to find out what happens.JUDGMENT is a bit of a change of pace for Finder, but he displays his usual sure-footedness as he balances plot, character and pacing throughout this engrossing novel. While a legal thriller, it’s also a cautionary tale for those who are tempted to believe that the rules of conduct and fidelity change when they are outside of their area code. The piper, as Finder demonstrates, always gets paid.Reviewed by Joe Hartlaub"}, {"Review": "You know you have a good thriller when your legs keep tapping on the ground from anxiety about what will happen next. A good combination of a courtroom procedural with escalating tension that enthralls the reader to read at a fast pace. When Judge Juliana Brody steps out of her normal rule filled life and has a one night affair with a stranger, she learns the hard way the cost of her bad decision. However, when he walks into her courtroom after they had promised never to see one another, she grasps the high cost of entrapment as he produces a video of their encounter. Threats begin to escalate not only threatening her but her family as she determines to shun blackmail attempts. Though I questioned some of her decisions not keeping in accordance with her intelligence level, it did not interfere with my absolute enjoyment of this cliffhanger."}, {"Review": "The tension builds from Chapter 1 right up to the final chapter in this terrific novel by Joseph Finder.Juliana Brody, a highly respected Massachusetts judge has to confront an error in judgment that threatens to destroy her family (professor husband, 16 year old son, and 19 year old daughter) and her reputation in legal circles. Her indiscretion brings out unknown enemies with the aim of forcing her to decide in their favor in a case currently before her.Of the 15 Finder novels I have read, 6 have received 5***** from me. Judgment had me, a senior citizen, shaking throughout the whole book. It is highly suspenseful....a great read."}, {"Review": "Joseph Finder is a widely read author in the thriller genre and \"Judgement' does not disappoint. I found this book compelling and I highly recommend it.Juliana Brody is a judge in Boston and is sitting on a demanding case: a uber-like startup, Breezi, is being sued for sexual harassment by a former female employee. While at a law conference, Juliana makes a bad decision and sleeps with a man who unknown to her is working for Breezi. Their rendezvous is videotaped and Breezi threaten to expose her if she does not rule favorably in the case. The blackmail takes a new dimension when she discovers that the Russian mafia are the real owners of Breezi. Does she compromise her principles and give in to the threats to her and her family, or does she resist?Juliana is a complex character; a wife, mother, judge and plain determined woman. She does not give in to some really scary people and tries to disentangle herself for the web of blackmail around her. A strong woman character, Juliana is really threatened; so much so that I winced at times at what a bad position she was in. This book will grab you and not let go. Highly recommended. 5/5 stars. Read this and other reviews of upcoming books at bookgeist.blogspot.com."}, {"Review": "Thank you to the Penguin Group and Netgalley for a chance to preview this title. Joseph Finder opens this thriller explosively and with intrigue, one of the best beginnings I’ve read in a long time. Judge Juliana Brody doesn’t think much about having a one-night stand while at a conference in Chicago. Then her partner in lust shows up in her courtroom and everything goes sideways. I’ve always enjoyed Finder’s books. In this one he inserts some political references that mirror what’s happening in our current political landscape. Honestly, I read to get away from what’s actually going on, so this bothered me a little. However, the writing was taut and smooth. The characters all had their individual idiosyncrasies and home life went on for Juliana even while she was in the throes of mental torture.A good read, nonetheless. I highly recommend this title. My issues are just my own. "}, {"Review": "Can one choice change your life? You bet! Just ask Juliana Brody. Superior Court Judge, and the star of Judgment. The new suspense legal thriller from the master of fiction entertainment - Joseph Finder.A single choice. A lapse in judgment. Just one change your life. Just ask Juliana Brody. Superior Court Judge, wife, mother of two, and the star of Joseph Finder's latest stand-alone, suspense-legal-thriller.Far from home, attending yet another boring conference Juliana will discover she forgot to pack her good judgment. Sitting at the bar, two drinks in, talking to a hot stranger. You already know where this is going, don't you? Yep! Straight to his place. Their lust spent and the benefits of alcohol long since evaporated, the two part company. Juliana assumes she can return home, rededicate herself to her family, and never think of the stranger again. Amid all the hustle and bustle of an up and coming judge's world, a case on her docket was gaining national attention. Breezi (the fictional equivalent of Uber) CEO was being sued for sexual discrimination and the spotlight was on Juliana. Calling the courtroom to order the judge notices a familiar face at the defense table. Could it be? Yes it could and it was -- seated at the defense table was the hot stranger from the bar. Now things get really interesting.It was all a setup. Their hot dalliance had been videotaped. Breezi intended to win this case and they wanted the judge to make sure they did. As long as Juliana played along the tape would remain confidential, and no one would ever be the wiser. However, if she refused, her career, her family, life as she had known it would be gone. She had no choice-- right? She had to rule in their favor and keep her family safe. But could she really do that? Would she? What follows is a cat and mouse game that will keep you ferociously turning pages to find out what is going to happen next. Joseph Finder's stories have an ounce of realism, for every three ounces of fiction. Judgment's plotline could easily be the lead story on the six-o-clock news tonight. Finder is able to erase the line between fact and fiction. He weaves a beautiful web that ensnares you. Then silky thread, by silky thread, he deconstructs the web revealing the bad guys and their true motivations. It is a hypnotic, fun, action-packed journey second to none.Ever since I read Paranoia, I have been hooked. (That was way back in -- well, it has been a few years.) Joseph Finder does his homework. His books are always relevant in some way. His writing is smooth and fluid. No hiccups or stop and starts. The short, crisp chapters add to the tension, giving the dialogue a sense of urgency. The characters are well thought-out, three-dimensional, and genuine. Like 'em or hate 'em, the good, bad, and the ugly too - all of them feel real. While there are times when reality must be suspended in order to fully enjoy the ride, that's what good fiction is supposed to do - take us away from our reality and entertain us for a couple of hours. Joseph Finder does that better than most. He is a master entertainer. I always look forward to his books. Even though I have to wait a year, sometimes longer - his writing is worth the wait.Happy Reading,RJ"}, {"Review": "My rating: 4.5 StarsJudge Juliana Brody made a decision that would most certainly threaten her judgeship, family and her very life. While away at a conference, Juliana makes the errant decision to sleep with someone. Once in a lifetime. They will put it behind them. Not so. Back on the bench, Juliana has a difficult case ahead of her. She is presiding over a sex-discrimination case. This case has garnered national attention. What’s more is that Juliana has been set up. The man that she had the one-night stand with shows up in her courtroom making the most unreasonable demands. Make a certain decision in her current case, or a video of their sex-filled night will be released everywhere. It is not just the man she had an affair with has something against her, what Juliana has to be aware off is that strings are being pulled that could bring everything crashing down. Something stinks at a very high level. People are dying. Is Juliana safe? What of her family? No doubt her judgeship pales in comparison to those very people that are close to her heart. Other than here glaring indiscretion, Juliana is fairly happily married and she will do just about anything to protect her marriage. The case involves the most nefarious of individuals, Russian Mafia. The head of the organized crime family will go to any extent necessary to get Juliana to make a certain ruling. The interests concerned are directly related to the sex-discrimination case and if Juliana doesn't rule as they are blackmailing her to, far-reaching effects will be felt in more than one way.I thought I knew how this book would end up and was prepared to go for a lower rating. However, the twists and turns were nothing less than chilling and this indeed flavored my rating. Not only was I impressed by the writing of Joseph Finder - the plot, the characters, the ending - the acknowledgements led credence to this well-crafted tale. I certainly look forward to reading much more by this prolific, bestselling and very masterly author again. Many thanks to Penguin Group Dutton and to Edelweiss for this ARC to review in exchange for my honest opinion.Please see all of my reviews on my blog at www.robinlovesreading.com."}, {"Review": "Finder's books, like those of Simon Lelic, are always easy to read and engaging but difficult for me to review afterwards, because when I stop to think about the plot I realize how many times I had to suspend disbelief just to keep reading. This leads me to the concomitant realization that, while they are engaging and generally quick reads, they have a lot more holes in the final analysis than one notices whilst in the midst of the reading... That isn't to say the read itself isn't an enjoyable one. They usually are, and this one was no exception. But there are so many times that these characters pull off amazing feats that would be utterly beyond believability if someone were to try to explain them outside of the pages of the story, that they become more difficult to defend once one tries to explain them to others... Judge Juliana makes one epic mistake. The rest of the book is about the aftermath, which of course is much more convoluted than it first seemed. I can accept that, we all make mistakes all the time and life has a habit of throwing curveballs. What I can't quite wrap my mind around is the way she ultimately extricates herself so seamlessly with very few lasting consequences, after pulling off Herculean Feats and mind-bending acts of deception that it seems like the people she was up against would have seen through every step of the way. I rolled my eyes quite a bit, even while continuing to turn pages to see what magic rabbit she'd pull out of her hat next. Ultimately, I suppose it boils down to the fact that I did continue to turn the pages and I did want to see what would happen next. I would not consider this one of my favorites by Finder though. It felt a little more forced and formulaic then, for example, The Switch, which I more thoroughly enjoyed even though it too had some eye rolling moments. Still, I suppose the \"average Joe wins the day\" trope is a trope for a reason - there is an undeniable bit of glee to be found when a regular person defeats The Machine in whatever form it appears, and that's likely what keeps readers coming back for more - even if that more is starting to lose some of its shine for me...Thanks to Penguin First to Read for my review copy."}, {"Review": "Joseph Finder's (GUILTY MINDS) expert thrillers are like bullet trains; they immediately shoot out of the gate and provide breathtaking twists and turns at an adrenaline-pumping pace. Finder boasts a distinctive skill for creating characters of depth and complexity. His forte is spinning tales of ordinary people suddenly thrust into extraordinary situations that require them to outmaneuver trained killers and spies.JUDGMENT's heroine is Massachusetts Superior Court Judge Juliana Brody, who is presiding over a sexual harassment suit. At a conference, she meets a charming widower and they have a passionate one-night stand. This mistake leads to her being blackmailed by a shadowy entity that wants her to dismiss the harassment case. A video of her tryst threatens to break up her family and destroy her career. As one confidant tells her, \"When men make mistakes, the mistakes are forgotten. When a woman makes a mistake, the woman is forgotten.\" Brody hires a private detective and the two discover that her office is bugged, she's being followed and she's been implicated in a murder. The bodies begin to pile up as Brody discovers that the all-knowing villains behind her nightmare are hand puppets for a Russian oligarch. Much like a Russian doll, JUDGMENT continually reveals twists within twists within twists.Not content with writing a superior nail-bitter, Finder adds gravitas to Judgment as Brody continually grapples with legal and moral issues involving her breaking the law to save herself. This is another high-octane winner from Joseph Finder. Joseph Finder's JUDGMENT is a fast-paced thriller with emphatic characters and twists and turns that make it impossible to stop reading."}, {"Review": "I couldn't put Judgment by Joseph Finder down. This thriller by Joseph Finder grabs you from the start and takes you on a thrill ride. Finder introduces you to Judge Juliana Brody a Superior Court Judge in Massachusetts. Judge Brody is on the rise. She is on a short list being considered for federal court. Finder lets you know Judge Brody is a straight arrow until one night when her judgment lapses and she sleeps with a man while on a trip. Judge Brody is married and has a family. Once Juliana returns home she is blindsided in her very own court room when the man from the conference appears as an attorney on a high profile case. This is where Finder really takes the book on a roller coaster ride that will keep your attention till the very end. You will root for Juliana and her supporting characters. Judge Brody is a strong woman that won't back down and let the bad guys win. Finder created a complex character in Judge Brody. You really see her struggle with her guilt and her quest for right and wrong. She will not let the bad guys win but at what cost? Will Juliana lose her family? Will she lose her job? Will her transgression be exposed? The bad guys are men you will love to hate. They are men that will stop at nothing to get what they want. No one is safe from their reach.Grab this book to find out if Justice prevails. I loved every minute of this roller coaster ride of a book. Thank you Dutton Books and Joseph Finder for my free review copy of this book. I was gifted a copy of the book in exchange for an honest review. "}, {"Review": "I won an online contest and received an advanced reading copy of this book and was delighted to discover that is was autographed by the author. How cool!Finder uses a formula he's used a number of times before. Hero does something compromising and then is under pressure as he tries to find his way out of challenges brought about by his foolish conduct, only to have bad guys further squeeze him. Eventually, the horrified hero concocts a plan that will allow him to evade that pressure. Although this is s tried and true formula, Finder finds a way to draw the reader into being concerned for the hero, despite their shameful lack of judgment. In fact, Finder finds a way to make his characters very, very, real! This reality is best demonstrated in the relationship between the Judge, her husband, and their teenage son. A moment of harsh reality takes place towards the end of the book when the husband tries to explain his apparent leniency towards their teenager. Nowhere in the book do these characters seem more REAL then when they struggle with his misbehavior and dialogue about it. Finder touches a real nerve and demonstrates a real comprehension of parental angst and manages to make his characters come to life with a realistic presentation of that angst that nearly brings tears to a reader's eyes. Finder applies his formula, which brings the climax to the story about, in an ending that seems a bit too rapid and too simplistic, even if satisfying. "}, {"Review": "I’m a big fan of Joseph Finder, so was happy to receive a copy of Judgment from Penguin Group Dutton and NetGalley in exchange for my honest review. This is a standalone novel featuring Judge Juliana Brody, a happily married up-and-coming judicial star goes to a legal conference and does something out of character: she has a one-night stand. She and the man agreed it was a once-only thing, and they would never see each other again…then he waltzes into her courtroom, an attorney in a huge case she is dealing with.  That one-night stand turns out to be Kompromat, as she is soon threatened with blackmail by Russian organized crime, and her fears expand as her family is threatened. Judge Brody is a likeable heroine, and the story is compelling as it combines elements of two current issues that are much in the news: Russian criminals and #MeToo.  The story has some aspects that require some willing suspension of disbelief, but I was totally ready to be swept up in a thriller, and willing to just go with it as long as it entertained me all the way through. It definitely did! Four stars. (And I'd like to see more from Finder featuring Judge Juliana Brody. )"}, {"Review": "Finder is known for writing plots that could, at least in theory, happen to anyone. The idea being that the protagonist isn't someone of extraordinary means who does something outlandish to trigger the events of the story. In this case, it's the story of a woman's single lapse in judgment that causes a series of peripheral events that threaten to send her life spiraling forever out of control. And the \"mission\" being, what can one normal person do to pull that life back from the precipice and bring order to the chaos. Maybe even stay out of prison.Mr. Finder continues to excel in this niche as Judgement is another thriller that kept me reading long into the night. It was also something of a blend of my favorite concepts from his early books, titles where CIA spooks lurked in the shadows and government intrigue was at the heart of the plot. The CIA and government-related motivation isn't front and center in this book, but it's hiding in the shadows. All in all, a fun and intriguing thriller."}, {"Review": "Juliana Brody is a judge in the Superior Court of Massachusetts. She is as strait-laced as they come until one fateful night a legal conference in Chicago. She meets a handsome man who seems quite vulnerable and they spend the night together. They part with the understanding that this must never happen again. But once back in Boston, Juliana learns that this was not a random meeting. Matias Sanchez, the man from Chicago, is clearly involved in a sex discrimination case which she is presiding over - someone wants the case to go away and will go to any length to see that it happens. Judge Brody must turn away from her past and make decisions to protect herself and her family. While it may be difficult to imagine a judge putting herself in this position, the tension that Finder injects into the story is non-stop. Some of the transitions from event to event are choppy and some of the actions the Judge takes are hardly what one would expect, but the whole package will keep your attention. My sincere thanks to Penguin Random House and Edelweiss for the ARC of this novel."}, {"Review": "Thanks to Edelweiss and the publisher for providing this book in exchange for an honest review. I have been a fan of Joseph Finder ever since I read Paranoia many years ago. His books are super fast paced and always suspenseful. You never know who is telling the truth and what is around the next corner. I enjoyed this book but I don't think it was his best. This book is about a married judge who has a one night stand with somebody who turns out to be associated with the case she is presiding over. She is blackmailed and it turns out to be a much bigger situation that anyone would have comprehended. As other reviewers noted, you definitely had to be willing suspend disbelief at times, but this was fast paced as expected and entertaining. I think my biggest problem was that the more we got to know this judge, the less I believed she would have an indiscretion like the one that prompted all of the trouble. Nevertheless, I will look forward to reading Joseph Finder's next novel."}, {"Review": "Thank you to Firsttoread with Penguin Random House for giving me a chance to read this ARC! This book was absolutely amazing! I could not put it down. I read it in thirteen hours. A whole Saturday of reading. It had some expected turns and some predictability but also a lot of asking yourself \"what's going to happen next?!\" Which is probably why I couldn't stop reading it. There were some parts where things happen and you know what's going to come next and that it's going to play part in the bigger scheme of things or turn into a problem but there were also a lot of unexpected twists and turns. Really great read for those who like mystery and thrillers, especially things about Russia and conspiracies. I liked the happy ending even though I did not see it coming. Great character development too. You can really feel connected to the family and other characters in the novel. I can't wait to read more by this author."}, {"Review": "Thank you First To Read for selecting me to read Judgement by Joseph Finder. This is another hit for Finder. The plot is very current and relevant - a story from the headlines so to speak.A judge who is on her way up the ladder - Julianna Brody is married, has a family, and a good reputation. She makes an error in judgement, which is out of character for her. She thinks this is a risk, but it is over and she is moving on. That's until this lapse of judgement leads to her being bribed and worse yet, having her face (and body) all over the internet.Julianna is not going to take this and she is willing to take on whoever is \"gunning\" for her. But she has no idea who or what that will be - she thinks she knows who is on her side, but does she really - and can she literally survive when so many are after her.Fast paced and well written. Recommend."}, {"Review": "Thank you to First to Read for the ARC I received of this book.Judgment is Juliana Brody’s story. She is a judge in Boston, and while out of town at a legal conference, acts completely out of character and has a one night stand. Upon returning home to her life, job, and family, she is attempting to put this behind her when this same man enters her courtroom. The book was fairly fast paced but I had a little bit of trouble staying engaged with the story because, to me, Juliana seemed a little erratic and wasn’t all that likeable of a character. As a reader, we are told repeatedly what a “good girl” Juliana is and that the law is her life, nothing is more important to her than her family and the law, etc. Then basically all of her behavior is the opposite of this. I didn’t find the ending satisfying and didn’t think it was as strong as the beginning of the book."}, {"Review": "A fast paced legal thriller featuring a topical subject with the tables turned. Juliana is a judge but frankly she's got some pretty bad judgment! Her one night stand turns out even worse than she could have imagined. The man she had sex with is involved with a case she's presiding over which involves sex discrimination and harassment at Breezi- an Uber like company. Even worse, she's been videotaped and now she's being threatened by, wait for it, Russian organized crime. There's a complicated (a little too complicated) conspiracy that leads to a murder but there's also some interesting family vignettes. Julia's kids, especially her son Jake, are typical challenging teens. You gotta feel for her husband. Thanks to Edelweiss for the ARC. Try this one for a turn on the usual blackmailed judge novel. "}], "Genre": "Thriller", "ID": "40108808", "Desc": ""}