{"Name": "As Long as We Both Shall Live", "Image": "https://images.gr-assets.com/books/1531176675l/37638016.jpg", "Reviews": [{"Review": "4.5 stars\n\"So here's the thing: if you want to kill your wife, don't. Don't kill her, don't touch her. Ditch the bitch if you have to, get on with your life.\" \nWhat a fantastic, fun, twisted, entertaining read!One man. Two dead wives. How can that be? Matt and his wife, Marie, had gone away for a romantic weekend. They have been married for twenty-four years and have two daughters in college. Time away is precious and they have decided to go hiking. Some exercise, some fresh air, time alone, what could be better? But then Marie disappears off the side of a cliff! As Matt summons help, a search party is gathered. Matt joins in the search for his wife, but as the search goes on, the local authorities begin to investigate the couple's lives, their relationship, and their marriage. They are shocked to learn that Matt was married before and his first wife died under questionable circumstances and that Matt was a suspect for some time. Hmm....now a second wife is missing and presumed dead.One of the officers investigating this case is also being investigated as well. Like other reviewers, I don't think his back story was necessary. I didn't really mind it but at the same time, I also don't think it added anything to the story. It seems that more than one person in this book has secrets and something to hide. So, I did a little happy dance about 56% though and thought \"By George, I think I've got it!\" and I was about 75% right! Yes, I am tooting my own horn as this is a twisty fun read full of secrets, deception, and lies. Nothing too overly shocking as it doesn't need to be. I was captivated by this wickedly fun married couple who could give the couple in the war of the roses a run for their money. There really is a thin line between love and hate! \"It was so easy, she thought, to keep your hate to yourself. To let it simmer like acid in your stomach. You started to live on it after a while. It fed you, kept you going, until you started to get hungry for it, and it became an active craving. A diet of anger and hate could slim anyone's thighs.\" This book is told in alternating time lines and each chapter is headed with clever song titles/sayings and noting the year the action takes place. Chaney keeps readers on their toes, giving a little bit more info as the story progresses. She had me wanting more and more. With each little tidbit, she takes the reader closer to the truth. She lets the reader believe one thing and then quickly turns the table and has the reader believing something else. Detective Spengler points out in the book: There is HIS story, there is HER story and then there is the TRUTH! That about sums it up right there. Readers will yearn for the truth in this book because this married couple has secrets. Secrets can tear a marriage apart, but sometime secrets are the glue that hold it together.I thoroughly enjoyed this book. I was sucked in and found this to be a clever and incredibly fun page turner. Not the-edge-of-your-seat-with-nonstop-action page turner but an what-the-hell-is-this-person-going-to-do-next type of page turner. I really enjoy deceptively wicked characters. The ones who have you fooled - up until that second when they no longer have you fooled. I like to do a silent little chuckle and recall this quote \"Oh, what a tangled web we weave, when first we practice to deceive!\" by Sir Walter Scott. I said it before and I will say it again: What a fantastic, fun, twisted, entertaining read! There is mystery, suspense, witty passages, doubt, lies, betrayals, scheming, deception- all of which make for a captivating book which did not disappoint this reader.Thank you to Flat Iron books and NetGalley who provided me with a copy of this book in exchange for an honest review. All the thoughts and opinions are my own."}, {"Review": "This book was so much fun! Matt and Marie have been married for 24 years. They have two lovely daughters that are away at college, money, and a beautiful home. What more could someone want?\n\"There are two dilemmas that rattle the human soul. How do you hold on to someone that won't stay? And how do you get rid of someone who won't go?\" ~ Danny DeVito, The War of the Roses\nMatt and Marie decide to take a weekend away in hopes of rekindling their marriage. While out hiking Marie decides to take a selfie at the cliffs edge only to lose her footing and she plummets to the raging river below. A tragic accident. Detectives Loren and Spengler think that Matt isn't being completely truthful with them and once they find out that Matt had been married before to a woman that also died in mysterious circumstances they no longer suspect he knows more, they know that he does, and they will stop at nothing to prove his guilt. Of course there is way more than meets the eye with this one. If you think you have it figured out then I assure you that you do not. JoAnn Chaney will keep you on your toes for sure! \n\"Men kill their wives, women kill their husbands - you can't be tied to someone for any significant amount of time without at least considering knocking them over the skull with a baseball bat.\"\nNow I'll admit that we get a lot of backstory on Detective Loren about an incident that takes place twenty years prior. These chapters took me out of the story a bit but the reason for the backstory does become clear toward the end so it isn't all for naught.  ~ Final Thoughts ~If you aren't married - rejoice! If you are - you will be side-eyeing your spouse throughout this entire book! Enjoy! 4 Entertaining stars! Thank you to NetGalley and Flatiron Books for providing me with a digital ARC in exchange for my honest review."}, {"Review": "I knew I was in for a treat with JoAnn Chaney's opening paragraphs:\"So here's the thing: if you want to kill your wife, don't. Don't kill her, don't touch her. Ditch the bitch if you have to, get on with your life.\"Man.. phew was this a ride! I think we've all be in a relationship and we've wanted to throw something at our partner's etc. Well.... I don't know about you but I CERTAINLY have! Chaney's writing is dark, complex, witty, and darkly funny with a mix of sassiness. I don't think I've ever read a book that's marketed as a thriller that actually made me laugh. But, my friends Chaney will leave you on your toes.... with this deliciously giddy and evil thriller.The novel begins with two wives each decades apart the were married to the same man Matt. Each wife is about to have their ultimate fate at the hands of no other than their loving husband Matt. OR is he?! So... the book sets up a portrait that you think Matt has killed his wives.... how can he possibly get away with murdering not once but twice?! But, is this dark web of lies true... can it be that plainly obvious that the husband is the killer?The story alternates between 1995 and 2018 with dual perspectives of multiple characters which include Matt, his wife Marie, and Janice his other wife. Let me tell you this NOTHING is what it seems in this ride. Secrets, betrayals, and just enough of a twist that will leave you wanting more.My only tiny issue with this one... was the story had a sub plot that in my opinion wasn't necessary to the storyline. It was a tad confusing and threw me off a little bit.I think if you enjoy domestic thrillers and are a fan of secrets, lies, and deception than this is the perfect book for you.Thank you to Netgalley and Flatiron Books for the opportunity to read this in exchange for my honest thoughts.4 sassy stars!Published to GR: 10/7/18Publication date: 1/15/19"}, {"Review": "While this book incorporates some of the more trendy type elements found in today's mysteries and thrillers, it actually manages to still feel a bit different than the rest. I wouldn't say I was in love with all aspects of the story, but overall I was pretty darn satisfied.Matt's first wife died under suspicious circumstances. Twenty some years later, he is hiking with his wife, Marie, and according to Matt, she falls off a cliff. While investigators search for her body, they have more than a few questions for Matt. Is he just really unlucky? Is he a murderer?This one was a pretty crazy ride. Yes, some of the twists and turns aren't exactly surprising. However, this is an example of a book in which predictability works in the reader's favor. I was way more interested in watching the story unfold the way I thought it might rather than wanting to be shocked. That's not to say everything in the book you can see coming a mile away, there were one or two times I felt like saying \"well-played, JoAnn Chaney, well-played\". I only have a few criticisms of the book. I didn't particularly care for Loren's backstory. I get why it was included, but I can't say I felt all that invested for most of it. I also thought some of the dialogue and writing was little over the top and felt like it was written just for shock value. It's not like I haven't heard most of it before, it's more of a case of in certain instances it was too much and didn't sound natural. Overall, I think think this book is worth taking a look at if you like mystery/thrillers. It's not perfect and it definitely fits in the dark and disturbing category, but I found it to be a pretty entertaining read!I won a free advance copy of this book in a giveaway but was under no obligation to post a review. All views expressed are my honest opinion."}, {"Review": "After binge-reading \nAs Long As You Both Shall Live\n, JoAnn Chaney, I'm excited to continue on this writing journey with you. Matt and his wife Marie decide to take a hiking trip in the woods in order to salvage their deteriorating marriage. As they are hiking, they decide to climb up a nearby cliff and check out the scenery. When Matt steps away for a bathroom break, he hears his wife scream. When Matt returns, his wife Marie is nowhere to be found. She must've jumped or tripped, he thought, so he calls the police to report the accident, in hopes of finding her. The police are not as optimistic about finding Marie alive, but are also not convinced that this was indeed an accident in the first place. Matt's first wife died in 1995, under similar suspicious circumstances. Detectives Loren and Spengler are assigned to this case and have lots of questions for Matt. They are hesitant to pursue Matt, but also believe that this case is more disturbing than just foul play. The two must dive into Matt's past to really see what he's about. Is this man a full-fledged murderer, or just a guy who's had terrible luck? I know what you are all thinking right now. This sounds like a light domestic mystery with an obvious unreliable narrator—but, you are wrong! The mystery behind Marie's death is very intriguing, as was the mystery behind the death of Matt's first wife, Janice. The story really goes the extra mile that you wouldn't expect in a domestic thriller, and really dives into the lives of Matt, Marie, Janice, Loren, and Spengler. It's a lot more police procedural than I expected it to be, but the story is definitely gripping from the first chapter. The procedural aspect behind Loren and Spengler may not be as delicious as Matt's relationships with his wives, but the pay off is so much greater than I anticipated. I caught myself churning through the last section of the book in record speed. I ignored errands, chores, and my fiance, just to find out what exactly is going on! \nAs Long As You Both Shall Live\n will be one of those polarizing books of 2019 that we will all have an opinion about, that's for sure. Some of you will love it, and some of you will hate it. It's one of those books that will not leave you unmotivated to discuss. #BookClub2019 I do think that this book could definitely evolve into a series, since Loren and Spengler are both fun, and multifaceted. Even Matt making future appearances would be fun! Thank you Flatiron Books for my advanced copy in exchange for an honest review. \nAs Long As You Both Shall Live\n will be released January 15, 2019."}, {"Review": "Matt and his wife Marie may have some issues, but they've been together for over 20 years. When they go for a hike, and Marie goes over the cliff, Matt is the first suspect in her death. In questioning if Marie's death was an accident or something more sinister, the detectives discover Matt's first wife was murdered. Either Matt's a terribly unlucky guy, or he's hiding something.A twisty psychological thriller full of secrets. It seems everyone has something to hide. The main story of Matt and Marie is very engaging. In addition to their story, there is a subplot with an investigation into one of the police officers. This part of the book was not as interesting, and probably could have been left out.The mystery seemed fairly straightforward, but then it got more and more twisted. This is not an obvious story, and I love that it kept me guessing. A page-turner for sure. Dark, intriguing, and clever. A good read for fans of domestic thrillers.I received an eARC of this book from the publisher via Netgalley in exchange for an honest review."}, {"Review": "Tl;dr: The thriller that doesn't have the bells and whistles hype--but totally should as it's one of the best books of 2019. As Long As We Both Shall Live is a must read for fans of twisty and twisted psychological thrillers. And at the risk of sounding like every blurb/marketing copy that makes me roll my eyes: Think Gone Girl all grown up.Yeah, I know, but hear me out!As Long As We Both Shall Live is a bitter, biting, bracing read--a long hard pull at the rot that can fester not just within a marriage, but within oneself. The summary goes like this--Matt's wife Marie has just died after falling off a cliff during a hike. Accidents happen, it's a tragedy, etc. Except Matt's first wife died in a fire. A fire only he escaped from.The detectives assigned to the case--bitter, more than a little unhinged Ralph (Ralphie) Loren (who has his own past of secrets) and relative newbie Marion Spengler--aren't so sure that Marie's fall was an accident.The thing is, the more they investigate, the more they realize there's more to Matt--and to devoted Marie--than meets the eye.Who wants someone dead? Who is willing to do whatever it takes to get out of Matt and Marie's marriage?And what did happen to Matt's first wife, Janice?This summary? Only a surface scratch. There's a lot more going on here than meets the eye.Now, I'm going to get into spoiler-light territory by talking about how I think As Long As We Both Shall Live is like Gone Girl--but all grown up.SPACEJustIn CaseOk. In Gone Girl, Amy and Nick weren't exactly characters you rooted for, right? But Amy did have an entire childhood of being not just the longed for and only child, she was dissected on the pages of her parents' books--you can see where she got her crazy from to some extent, you know?And Nick? Well, Nick had the capacity to love--once Amy, sort of Andi, then Amy in again (in an obsessive, terrified, and murder-y way)--and he had his mom and the memory of her, and, of course, Go--the rock who loved and supported him no matter what. Plus Boney was there to (eventually) be on Nick's side. As Long As We Both Shall Live tears all of that away. Matt has no family, lived off his first wife while he was getting a college degree and then is with Marie, who spends two plus decades raising their daughters, keeping the house, always running the whole day to day thing that's life. And Marie? No family either. And happy about her life? Not by a long shot. Not with any of it. Especially Matt.The kids? They aren't too broken up about Marie. But they're even less fond of Matt, not even staying with him when Marie is gone. They are and were long gone, checked out of it all as soon as they could.So, no family for Matt and Marie. Nothing and no one but each other for over twenty years. And those twenty plus years have bound them into one big nightmare of a couple. Who do they hate more? Each other or the world?And Loren and Spengler? Dealing with their own stuff and the case. No time--or inclination, more importantly--to find a connection with Matt. Or Marie. They are out to solve the case. Or one of them, at least. Matt and Marie aren't going to haunt them.So we have that twisted thing--that marriage--that Matt and Marie had. And it's an all consuming storm of hate and destruction and all they care about is leveling the other.This is Gone Girl stripped down to its raw livewire nub. There's no one to root for anywhere, no character to lean on, no past to partially explain away the destruction that two people can and will create for each other. Every secret exposes only more desire for annihilation between Matt and Marie. (Janice is a force of chaos too--and she has a long, long reach, claws sunk deep into Matt and Marie)In short, this is what Nick and Amy Dunne could be in twenty years--minus anyone or anything to make them softer. (Aside: there is a cool girl here (Riley) but let's just say she's not of lasting interest. She's there to play a role--for Marie, but for Matt too.)One of my fave quotes:\"\" I started noticing she was watching a lot of true crime on tv. And there was that book that came out a few years ago, when the wife fakes her death and frames her husband for murder? You know the one? She read that thing over and over. Kept it on her nightstand. I finally went a picked up my own copy and read it myself.\"\"So your wife watches crime tv and reads some books, and that's how we know she's faking her death?\" Loren looked incredulous. \"Dude, I've been around the block more than a few times, and I've never heard anything quite as stupid as this.\"\"And there we are.As Long As We Both Shall Live pays homage to Gone Girl even as it rips all the niceties of that book away. There's nothing but the cold, brutal, beating hard of love ripped open, ground down, and poured into a one-upshipman game of who can hurt who more to win.Last line: \"Are we having fun yet?\"Oh yeah, we are."}, {"Review": "It’s official, this book is the very first one that I’m adding to my best of 2019 shelf! Yes, I realize that we’re just days into a new year, however this was such an original, engaging read I’m confident about adding it so early!While I really loved the story itself, (I’m a sucker for a domestic suspense) what really made this one stand out for me was the authors style. There was something darkly humorous about the writing, black comedy at it’s finest that just reeled me in and never let go. Diving into Matt and Marie’s marriage was wickedly fun, they’re a unique couple to say the least and then there’s a heavy police procedural vibe as you also hear from two detectives working the case, Loren and Spengler. It was a nice balance and the whole book flowed really smoothly and just when you get settled in and think you know where things are going, you get knocked on the ass with some twists. I never would’ve worked out the end on my own which I love, highly recommended if you want something that reads fresh.As Long As We Both Shall Live in three words: Wicked, Addictive and Unpredictable."}, {"Review": "This book is a thrill ride from the beginning, and one I didn’t want to finish! I thoroughly loved both reading the written word and listening to the audiobook expertly narrated by Christina Delaine, in a spirited and lively audio performance that is a perfect fit for the book. The writing has energy and charge, with earthy dialogue between an unhappily married couple in which the disgust and contempt ring all too true. Joann Chaney plucks real life stories from the newspaper headlines and totally runs with it, weaving a creatively mind blowing backstory, while maintaining a complex, thrilling murder investigation throughout. Smart, tough, no nonsense women abound, with sharp observations on marriage, on living and on working in a man’s world. The many nuances of long term marriage are explored, from the mundane to the deep, dark secrets that often lie hidden under picture perfect facades. Her characters are multifaceted and quirky. Wives for the most part didn’t embark upon marriage with ill intentions, but grew resentful over disrespectful behavior and hurtful, shameless indiscretions. One deputy in particular enjoys nothing more than dishing out raunchy, outrageous put downs, yet he proves to have a caring side also. Joann Chaney doesn’t shy away from a good laugh, has a firm grasp on the investigative process, long term marriage, and is determined that her characters be real, flaws and all.What more could I ask? It doesn’t get much better than this!"}, {"Review": "\"If you try to kill your wife without a plan, you will fail. There are plenty of assholes who do just that, men who decide to murder their significant other on the spur of the moment because they're angry or drunk or jealous or just plain tired of the nagging or they don't want to go through the hassle of a divorce, and they get caught. They always get caught.\"And with that beginning, I was hooked and found myself spiraling my way into this crazy read. Men are known to be aggressive, conniving and manipulative at times. Cheating on their wives, making their wives feel they are going crazy and start questioning themselves. They think they're so clever.. but really, it's the women you don't want to piss off. Women are patient, calculating and when they have their minds set to something... well, you don't want to be on the bad side of their anger.When in a relationship for a long time, particularly a marriage, things can start to get dull, complacent. The cute things you loved at the beginning are now nothing more than tingles under the skin that get more and more irritating. But then there are moments where you remember why you married that person... why you fell in love with them. And those are the things you grasp onto... for better or worse, that's a marriage, no? Matt and Marie take a hiking trip - a romantic trip to try and flame the embers of their long dilapidated marriage. Next thing you know Marie has fallen off the side of a cliff. Matt's wife has died... again. This isn't his first marriage where his wife has died and he has been exonerated. But where does the truth begin when the lies start to fall apart around him?This book is all over the place but in a good way. I really enjoyed Spengler - and the advice her mom gives her \"You squeeze all their balls now.\" Maybe I related to her because we're both 1/2 Korean and I understood the hassles she went through. I can only imagine how hard it is to be in the law enforcement field as a woman who doesn't get taken seriously enough. Her bite made me giggle on more than one occasion. I'm not sure if the background or side story within that field was really necessary but I also enjoyed it - along with the camaraderie between her and Loren.There's a lot going on within this story. I found myself going AHA at around page 180 thinking I knew what was going to happen and I was half right... which hell, I gave myself a pat on the back for. But nope - it went just a tiny bit in a different direction. Look, for avid thriller readers, this will be nothing too new. However, this is most definite binge worthy read. Short chapters, page turners and well, damn... I do love some crazy ass people so for me, pure love for this story. I also enjoyed the different headings for each section. Kept me singing in my head - like I need more noise there. ;)Thanks so much Flatiron for this book."}, {"Review": "The synopsis of As Long As We Both Shall Live Sounds like something I would love - it seemed to be a twisty domestic thriller with untrustworthy characters. I don't know why the marketing team is trying so hard to present it in this genre. Although I was hooked at the beginning, this one ended up not working out for me. This book is much more focused on the procedural aspect than the synopsis let on. I very quickly lost interest after pages and pages of cop politics. I occasionally enjoy procedurals, but they are definitely not my favorite. The back stories of the cops received a lot of attention, and I just didn't care. After a while, the chapters start alternating with something else going on in one of the cops' lives, which left me skimming a decent amount of the book. I feel like this book tried way too hard to have 500 twists, and many of them felt inspired by two other popular thrillers from recent years (not going to name them to avoid spoilers). This story would have been more effective if it was simplified even a little bit. I wasn't a fan of the ending, and everything that I had been waiting for was all smushed together. It felt rushed after everything else had dragged."}, {"Review": "I received this book from the publisher in exchange for an honest review.As someone who has been married for a number of years, and actually experienced a divorce, this book is a really interesting reflection on the ups and downs of being married, and the complications and hurdles that every couple experiences in a partnership. Of course the complications are dialed up to 11 in this one, but other than the over-the-top characters and their insanely complex machinations, this book will hopefully remind readers to appreciate their marriage and hopefully make them feel even closer to their spouses. There's complicated, and then there's just flat out crazy.Chaney chooses to explore the crazy side of marriage in As Long as We Both Shall Live. Matt Evans is visiting Rocky Mountain National Park with is wife Marie when she falls to her death off of a cliff. A frantic Matt runs to the park rangers to help them search for his wife in the river that flows beneath the cliff, but most likely she didn't survive the fall. After the search continues for a couple of days the police are brought into the investigation. They quickly learn that Matt was married to another woman in 1995, and that she died too under mysterious circumstances. Suddenly, everyone is wondering if Marie fell, or if Matt pushed her from that ledge.What follows is enough twists and turns to make your head spin. I kept trying to guess where Chaney was taking the story, but she was always one step ahead of me. Without giving anything away, I feel as if this book is an homage to a popular thriller from a few years ago. However, Chaney takes that concept and turns it on its head more than once. This is a fast-paced, well written thriller that will keep you guessing until the very end."}, {"Review": "I'm between a 2.5-3 stars I really enjoyed the beginning of this book. The first sentence pulled me in and I had to know what was going on with a husband that would say that about his wife. WE soon meet Matt ,who's married to Janice, and we quickly learn they aren't happily married. Janice makes a discovery that leads them both in directions quite unexpected. Fast forward 20 years later and Matt is married to Marie who just happens to fall off a cliff while they are on a trip for their 20th wedding anniversary. Question is, is Matt killing his wives? If he is, will he get away with it? Enter the police and the story has a subplot involving one of the detectives, Loren, who's a real creep. I have to say, I wasn't interested in the backstory of Loren and whether he killed his partner 30 years ago. Going back and forth between the 2 storylines felt disorganized, almost as if I was reading 2 separate books tossed together to make one story. I also became less invested in caring about Matt and Marie as the story went on. It very much felt like the author was trying to write a story similar to Gone Girl. In the end, I found it pretty predictable "}, {"Review": "Read this if you are in the mood for a seriously twisted, totally warped and fiendishly crazy book about the marriage from hell!\"...that's how marriages were -- like a private room for two, where no one else could see inside.\"Matt and Marie have been married for over 20 years and they've definitely had their ups and downs. Now wealthy with two college-aged daughters living away from home, they find themselves face to face, alone with each other and returning to some old habits. Current status: they both love -- and hate -- their spouse but what can be done since divorce is so expensive and out of the question. They've been working on their marriage for years, seen therapists, tried to make it together. So when the couple decides to go on a hiking trip to Estes Park they find some inspiration in the mountains. But! Tragedy strikes when Marie falls from a cliff into the roaring river beneath. Things go from bad to worse for Matt when he becomes the prime suspect as the police begin to think the fall was no accident. It seems that Matt has a history: his first wife died under some very suspicious circumstances. Detectives Spengler and Loren (a mismatched pairing if there ever was one) are investigating the death and come to some very surprising conclusions. NO SPOILERS. What a fun book that is chock-full of some of the most unlikeable and outlandish characters ever! I found it almost laugh-out-loud funny at times, especially with the aside observations. I liked the style of the narrative as it switched between the characters and the use of the second person point of view was masterfully handled. I really enjoyed this one more than I expected, thinking I'd had it with twisty psychological thrillers that seemed just like all the others, and I had a great sigh of satisfaction at the ending. So, suspend your disbelief and go along for this rocky ride without thinking too much about tedious little details or tiny things like realism! And don't let it put you off from the idea of marriage LOL, it's doubtful you'll find a soulmate in each other as this couple did. Thank you to NetGalley and Flatiron Books for the e-book ARC to read and review. It kept me thoroughly entertained!"}, {"Review": "A wicked page-turner sprinkled with dark humor that should be the hit thriller of 2019! You're going to want to be ahead of the hype. So preorder, be first on your library hold list, mark your calendar. I absolutely adore JoAnn Chaney’s wicked brain. Her writing is sharp, insightful, and darkly funny. And wow can she write a deliciously evil and giddy page-turner! The novel starts with two wives, decades apart, same husband. Each wife about to reach her fate at the hands of her husband. But how can a spouse possibly get away with murder? Twice?! Enter the first detective who doesn’t believe the husband’s story and then decades later two more detectives who don’t believe the husband’s current story when they find out the first story. The book brilliantly gives you slices into each characters life and brain while not only giving you the two focal mysteries but one of the current detectives is accused of murdering a previous partner. I know! I am so excited for everyone to get to experience this ride of a book!!!!--from Book Riot's Unusual Suspects newsletter: https://link.bookriot.com/view/56a820..."}, {"Review": "As Long As We Both Shall Live by JoAnn Chaney is an adventurous romp through the ups and downs of marriage with a dash of murder thrown in. When Matt claims that his wife, Marie, plunged to her death at Estes State Park, Matt is immediately pinned as a suspect. After all, his first wife also died under suspicious circumstances. All is not what it seems, however . . .This audiobook was so much fun to listen to! I really enjoyed the twists and turns in this novel, and let me tell you, it’s delightfully twisted! As Long As We Both Shall Live is well-written and fast-paced. It has a wonderful unputdownable quality. Once you crack this book open, get comfortable! You won’t want to put it down.The book jumps back and forth between present and past and delves into the minds of Matt, Marie, and the two detectives, Loren and Spengler. I appreciated the dynamic changes of perspective. These shifts helped shape the overall story and provided the full picture of Matt and Marie’s bizarre relationship.And can we talk about Matt and Marie’s bizarre relationship? They take “as long as we both shall live” literally. Very literally. They love each other. They hate each other. They can’t stay away from each other. Reading about their relationship had me cringing at times, imaging the stress of so much drama.I loved learning about Matt’s first wife and all the circumstances that led to her death. Again, the twists and turns were incredible!The build up to Marie’s fall was well done. At the beginning of the book you’re led to believe one thing, but by the middle of the story, you’re second guessing everything you know about the situation. I like having my assumptions challenged.While the overall story was excellent, the ending was a little abrupt for my taste. I’m not sure what I was expecting, but I think I needed more explanation about where everyone landed to feel warm and cozy about how the book wrapped up.The characters in the book were nicely written. While the characters themselves didn’t have a lot of depth, the situations and circumstances really shaped the characters. I enjoyed getting to know Matt and Marie throughout this story.If you enjoy reading books with lots of twists, consider picking up As Long As We Both Shall Live. I had a lot of fun reading this book!Thank you to MacMillan Audio for providing the audiobook version of this book in exchange for an honest review."}, {"Review": "Ok any book that begins with the line “so here’s the thing, if you want to kill your wife, don’t , don’t kill her don’t touch her. Ditch the bitch if you have to get on with your life”. This was a twisted dark psychological thriller when you think you have figured everything out you really haven’t. The novel begins in 1995 Janice and Matt were married. One year later Janice would be dead. Matt has been cheating on Janice after less than a year of marriage. She decides to go to work late one day to catch matt in the act with another woman. She walks to door and a single gunshot is heard and the house ends up in flames and the firefighters find a woman’s dead body in the bed. Only surviver Matt. Fast forward to 2018 on trip to Estes Park Colorado. Matt and his now wife of 20years Marie are taking a hike for their anniversary. While Matt is “taking a leak” Marie is heard screaming “please don’t stop”!! Matt runs to find a park ranger and tells him Marie fell from a cliff! Now Matt joins the search party looking for Marie. Det Spangler and Det Loren are put on the case to investigate matt and his now two dead wives. The only issue is that detective Loren has a shady past he may have three possible murders from 30 years ago that can not be proven. Loren heads to Matt’s office and finds a map with an x where Marie fell. The insurance was upped on Marie. Evidence is piling up on matt. But when a body shows up in the river below where Marie fell and it’s not hers but a woman from Matt’s office he was having an affair with where is Marie’s body? How can matt have two dead wives is it just bad luck? Did he also murder his girlfriend? This book had everything for me and I could not believe the sudden twisted ending! Anyone who loves dark twisted novels with tons of dark psychological turns pick this book up on January 15 2019! "}, {"Review": "Talk about twisty, creepy goodness! When Matt's wife Marie falls from a cliff to her death on the couple's weekend getaway a horrific accident quickly becomes so much more. Immediately following the incident, police officers piece together that this is actually Matt's second wife to die under less than kosher circumstances! With the suspicion turned on Matt, he is thrust into the spotlight and threads begin to unravel. Is Matt really unlucky or is there more here than what meets the eye? Chaney mastered the art of pacing and dropping the \"twist hammer\" in her second novel. I was genuinely shocked as the twists revealed themselves and finishing this book had me desperately wanting to run back and grab her first novel!I received an advanced copy. All opinions are my own."}, {"Review": "Holy crap! This was a fun ride to read. Matt and his wife, Marie, are hiking when an accident happens. Matt believes his wife is dead. His first wife also died under suspicious circumstances. The police have a lot of questions for Matt.It's amazing that a book labeled as a thriller had me laughing (in a good way) during certain parts. JoAnn Chaney has crafted a thriller that will have you turning the pages with anticipation as you wonder what the next part of the story is going to be. I finished it in a few hours because I just had to know. I was sorry when it ended. I don't want to give too much away, but you'll be questioning each character's actions as the story unfolds. I know a lot of books get labeled as the next Gone Girl and then disappoint. I believe future books in this category will be labeled as the next ALAWBSL. Thank you NetGalley and Flatiron books!"}, {"Review": "“As Long as We Both Shall Live”Written by Joann ChaneyReview by Diana IozziaI received a free copy of this book in exchange for reviewing purposes. I personally think I missed the mark when I read this book. This mystery / thriller book is best suited for fans of true crime news and media. I am one who very rarely enjoys watching and reading about these types of stories, so I felt that this book was not my type of thriller. I disliked the way that this story is told. We first read from before both Janice and Marie are presumed dead. I have to warn: this book is nothing like you think it will be. There are twists upon twists in a way that was not entirely pleasant. We also read in perspectives about the detectives. There are so many different aspects that I cannot tell, because this review is spoiler free. I might eventually plan to write a spoiler version of this review, but for now, you should be safe.Matt’s two wives have mysteriously disappeared and been assumed dead. First, twenty some years ago. We have the most recent disappearance as our catalyst. We follow Matt protest his interest, but we learn less than comforting secrets about him and the wives.My least favorite aspect of this book is the detective investigation. Detective Ralph Loren (ha ha, so funny) is the nastiest, most inappropriate and irritating cop I’ve read so far. His boys’ club narrative is full of filthy language and just stupid dialogue. In this day and age, why would it be entertaining to write or read a character like this? We do not love to hate him, we just hate him. I would have much preferred the story to be completely apart from the detectives, just focusing on Matt, Janice’s, and Marie’s perspective. About half way through, we are clued in on the secret. I do not think it’s a great secret, but it goes to show how many thrillers this book was ‘inspired’ by. I enjoy one of the characters that comes out of this revelation. We also choose to sympathize or feel completely apathetic, while also questioning our moral stance on certain topics. Would you make the same decisions as these characters if you were placed in this situation?In all, I did not enjoy this book. There were too many aspects I did not like. Too many twists led to an anticlimactic ending. I would read Joann Chaney’s writing again, but I would hope it would be different from this. She has a great writing style, but I believe she focuses on too little of what I like to read in a thriller. Some readers might enjoy this, but I just did not like it. I do not think it is a ‘bad book’, but it is certainly not my type. As I mentioned earlier, I recommend this to fans of true crime. I felt the stories were reminiscent of the case of Drew Peterson and possibly also Scott Peterson.I received a free copy of this book in exchange for reviewing purposes. "}, {"Review": "It has been said that love and hate are equally intense and that transitioning from one to the other is easier than one would think. In Joann Chaney’s As Long as We Both Shall Live, a couple remain fused together in a tangle of passionate antagonism and attraction. Matt and Janice are only married about a year when Janice suspects that Matt is having an affair. As the novel opens, she is about to confront the lovers, unsure which of the two should receive the brunt of her rage. Tragically the night ends in death, but Chaney leaves the details a mystery. The author instead flashes forward twenty-three years later as Matt and a second wife, Marie, are on a hiking getaway attempting to reset a relationship that has gone seriously awry. This time, one of the pair winds up missing- could this be an unfortunate coincidence? Investigators Spengler and Loren are suspicious about the two circumstances connected to Matt and they begrudgingly work together to dissect layers of secrets forged over many years. As they pursue the case, one of these officers is also being hunted by a former colleague who is convinced that he/she killed a former partner. Full of unexpected twists and relentlessly vicious repartee between characters, As Long as We Both Shall Live is an exciting novel that will keep Chaney fans riveted and guessing right up to its last sentence."}, {"Review": "From the opening pages I knew I was going to be hooked. I found myself cozying up in my chair with my coffee and saying, \"OoOoOoH, this is going to be good!\" Yes. I said it out loud. Here is what I read:\"If you try to kill your wife without a plan, you will fail. There are plenty of assholes who do just that, men who decide to murder their significant other on the spur of the moment because they're angry or drunk or jealous or just plain tired of the nagging or they don't want to go through the hassle of a divorce, and they get caught. They always get caught.\"Epic. The whole book was fast-paced and had twist and turns sprinkled throughout that kept me on track. I never had a chance to slow down with this one because every time I thought I was about to figure it all out I had another curve ball thrown at me.I highly recommend this one if you love a good domestic thriller! 4.5 but rounding up my star rating on here! Can't wait for more from JoAnn Chaney.Thanks to Flatiron Books for the advance copy in exchange for an honest review."}, {"Review": "I think perhaps JoAnn Chaney and I are not a good fit. In some ways, I liked this book better than her last one. The plot was fun and twisty. But it was grounded in the same universe, including a major subplot with one of the same characters, and I felt like the balance between the stories, and the pacing of the main plot suffered.This is mostly a twisty murder mystery that's one of the more accurate GONE GIRL comps I've seen in several respects. (So many books claimed to be the next GONE GIRL when they were just books where bad things happened to women.) I don't think the way Chaney jumps backwards and forwards, often from character to character, works completely. It's better in the first half of the book than the second, where things start to feel stitched together in a rush.It still could've been a 4-star book for me with the central plot, but in addition it has a major subplot (that wants to be full of surprises but is too obvious to work) with Detective Loren from Chaney's last book. I do not like Loren. At all. He is my least favorite kind of cop trope, there is nothing interesting or good about him, he is full of bluster and bullshit, he's terrible towards women and pretty awful to men, too. He sucks and I didn't enjoy any part of the book he was in, which made it hard to enjoy the book. The thing is, Loren is not even the primary detective on the main case, he's thrown in at the last minute. Before he's on scene we meet Marion Spengler, who's actually very interesting but as soon as Loren shows up she's relegated to the sidelines and I really missed her. I would have liked a book with just her and no Loren where we had some time to really let the twists play out so much better.Ultimately I think with Chaney and I it's a tone issue. She has this very specific dark abrasive tone that rubs me wrong in a way I can't quite describe. I like her ideas, her plots are solid, her structures are interesting, but I just don't enjoy the time I spend reading her books. It's very much a me thing, this may not be an experience others share, but it still impacts my enjoyment pretty significantly."}, {"Review": "Fans of Jane Doe by Victoria Helen Stone, rejoice! \"As Long as We Both Shall Live\" by JoAnn Chaney is a fun, stay up all night type of read. The set-up of the novel is Matt, the husband to two wives, twenty years apart, both wives who appeared to have died under mysterious circumstances. Was he responsible for their fates or was he simply unlucky in love? This book will keep you turning the pages until you get to the end. I don't say that lightly, either. It's been rare for a thriller or mystery to keep me invested until the last page, simply because there's so many of them and most of them don't tend to stand out. But I really enjoyed this one, I thought it moved quickly, had some sassy, darkly comedic moments in it, and didn't have an overreaching, convoluted plot. One thing I could have done without was a subplot involving one of the detectives, however.Thanks so much to NetGalley and MacMillian Publishing for the opportunity to read this ARC, out on 01/15/2019."}, {"Review": "Thank you, Raincoast Books, for the advanced copy of this delicious domestic suspense thriller/police procedural, in exchange for my honest review. On sale January 15.Think: Gone Girl, but better. Way better….It’s 1995 and Janice is newly married to Matt Evans and in just under a year of being together she catches him with another woman in their bed. Tired of his nonsense, Janice decided to take matters into her own hands and put an end to Matt’s indiscretions. But her actions backfire and she winds up dead…Fast forward to 2018, Marie has been married to Matt Evans for 20 years and they have two beautiful daughters. Life is uneventful for the Evans’ until they decide to embark on a hiking trip together, a much-needed romantic getaway in hopes of rekindling their spark. But only Matt returns home…Two wives. One husband. Twenty-three years apart. Both wives dead.; each dying under suspicious circumstances in the presence of their beloved husband who claims he did not murder them. Coincidence or bad luck?!To say I loved this book would be an understatement. Joann Chaney nailed it with this domestic suspense thriller, which she craftly peppered with police procedural and LOTS of dark humor (I found myself chuckling throughout this one). Short chapters and engaging writing, I flew through this book in less than a day. With so many unexpected twists and turns, this book had me guessing right until the end. Speaking of which, that ending – OMG – THAT ENDING! A highly engaging page turner, this book will knock your socks off. I stayed up all night binging this one because I just could not wait to find out what the heck was going to happen next! I won’t giveaway any plotline because I would hate to ruin this read but you will definitely be questioning each character and their motives and roles in the mysterious deaths of Janice and Marie Evans.I predict this read to be thriller of the year for 2019 (or at least one of Top 3), and the topic of heated conversation among bookworms and book clubs alike. This book is at the top of my list for book recommendations. TRUST ME, you will want to read this addictive page turner. Do yourself and your 2019 TBR a favor and drop what you’re currently reading and pre-order this one ASAP and be ahead of the game once it’s released – you’ll thank me later. "}, {"Review": "There was a point, about a 1/3 of the way into the book that I was worried that there had been a bait and switch with the jacket blurb- luring me in with a tale of a potentially murderous husband, and instead delivering a lot of story about an unlikeable cop who has a knack for using the most repulsive vernacular possible. At which point, I almost stopped reading the book. But I'm glad I kept reading because it's one of man interesting facets of this story.Detective Loren is hard to spend time with, as is the world of the police department. The language used certainly paints a vivid picture, and likely an accurate one at that, but it's not necessarily one I'd actively chose to spend any time with. But that's kind of the point. What does it take to keep stepping, or even running, into scenes of the worst kind of human brutality? Who do you have to be to survive that, and to maybe even still be a good person.The story of Matt the murdering husband does come back front and center. And like the gold-star seeking nerd that I am, and given all the mysteries and thrillers I read, I was happy to discover that one of my initial guesses about the reveal turned out to be true (view spoiler)[(Janice and Marie being one and the same) (hide spoiler)] But there were still more twists and turns to be had, and I for one, enjoy spending time with cunning people who revel in one-upmanship of the craziest degree."}], "Genre": "Thriller", "ID": "37638016", "Desc": ""}