{"Name": "The Suspect", "Image": "https://images.gr-assets.com/books/1541352170l/39699779.jpg", "Reviews": [{"Review": "3.5 starsARC provided by Berkley.\nThe mystery of 2 missing girls abroad was interesting, especially with a journalist's own son missing as well. Didn't realize this was part of a series, so may have had a higher rating had I gotten 2 other books to connect to these characters.For me, too many reveals happened too early, then 200 pages of nothing that interested me, ending with a quickly wrapped up conclusion and overused convenient monologue. Was relatively engaging, but with too many side stories and characters to care about. One reveal in particular impressed me, bumping this up an entire star.\n"}, {"Review": "3.7 Stars* (rounded up) Be Careful What you Get Yourself Into - You May Just Regret It! Kate Waters is a Reporter. Getting the story has always taken priority above all else, including her family. Lesley’s daughter Alex went to Thailand for summer vacation a few weeks ago with Rosie, the neighbor’s girl. Alex has been saving for the trip for an entire year and has everything planned out. Truth be told, Rosie has no intention of following Alex’s itinerary and her agenda is very different from Alex’s. When the girls go missing after a few weeks - it becomes apparent that something is wrong. Detective Inspector Bob Sparkes, once again agrees to investigate. After their bodies are found in a club in Thailand, Kate goes after the story. When she decides to make herself an integral part of the team by getting close to the families, Kate has no idea what she is getting herself into. Soon this story becomes bigger than Kate ever imagined and it’s one even she wishes she could run away from. “The Suspect” by Fiona Barton is a slow moving suspense with very intriguing characters who quickly drew me into this book. While I had an idea of where this mystery was going fairly early on, I was compelled by the intricacies of the storyline and the craziness of the characters’ actions and was excited to see if my suspicions were correct. This was another awesome buddy read with Kaceey! Thank you to Berkley Publishing Group and to Fiona Barton, for an advanced readers copy of this novel in exchange for an honest review. Published on Goodreads, Twitter and Instagram.*Will be published on Amazon on 1.22.19."}, {"Review": "4.5 starsReally enjoyed this one and I'm kicking myself for not reading anything by the author before now. Will definitely go back and read her previous novels. This is the third book in the series but can easily be read as a standalone. A little bit of backstory is provided for some of the characters but it enhances the current plot rather than feeling like information overload for those of us who haven't yet read the first two books.Reporter Kate Waters hasn't seen her son in two years although she occasionally receives a brief phone call. He is never far from her mind especially as she works on covering the story of two eighteen year old girls who have gone missing in Thailand. I'll admit my first thought before reading was wondering if this was going to be like the movie Brokedown Palace. Thankfully it's not, although I totally wish Claire Danes and Kate Beckinsale were younger so they could play these girls in a movie.It didn't take long for me to get caught up in the story. I loved how the story went back and forth between the reporter, the detective, one of the missing girls, and one of the mothers. The book might seem at first glance just a simple story about two missing girls, but there's a lot more to it than that. One of the more interesting themes explored in the novel is a mother's love for her child. This book was pretty darn close to perfect for me, and I highly recommend for fans of Fiona Barton or readers that just looking for a good, solid mystery. I received a free advance copy of this book from Berkley Publishing but was under no obligation to post a review. All views expressed are my honest opinion. "}, {"Review": "3.5*How well does a parent actually know their child. When that “child” turns 18 and goes out into the world do your worries end? Or are they just beginning?Kate Waters is an established reporter. She is used to covering on all the late breaking stories but soon she is going to find herself right in the middle of her next feature.When 2 young women, Alex and Rosie decide to go to Thailand before starting university. Their trip quickly spirals out of control as each had their own agenda and plans for the trip.Told through multiple POV’s. I found the transitions flowed effortlessly. We witness the panic and devastation of the mother’s as they wait for information on their children. The media, as they chase the next best story with no concern over who they step on in order to get the scoop.This is the second book I have read by Fiona Barton. And while I enjoyed her previous novel The Widow more... I will be looking forward to reading more from this author in the future.A buddy read with Susanne!🍁Thank you to Elisha at Berkley Publishing for an ARC to read and review."}, {"Review": "The Suspect by Fiona Barton is a 2019 Berkley publication. Two young ladies, casual friends with one another, travel to Thailand together. It was supposed to be the trip of their lives, but once they arrived, things went horribly awry. After failing to contact their families for a while, their parents sound the alarm, bringing the case into the spotlight.Kate is instantly intrigued by the story and pursues it with her usual gusto. She then discovers her own son, who hasn’t touched base with his family for a long time, is also in Thailand. This gives her even more of an incentive to travel to Thailand, hoping to contact her long lost son, as well as discover what became of the two missing girls. One thing that really threw me off course was the cohesiveness of the story itself. It didn’t gel and seemed to meander as though the author wasn’t quite sure in which direction she wished to travel. As a result, the story didn’t grab me, didn’t entice me to keep turning pages, or keep me on the edge of my seat wondering what would happen next. The characters were tepid, and not all that interesting, except when they got on my nerves. I really didn’t care for any of them. The adults behaved like spoiled children half the time, and their offspring proudly carried on the tradition. The conclusion was very weak, in my opinion. Kate’s dilemma and her flimsy rationalizations nearly made my eyes roll back in my head. But I can’t really expound on that without giving anything away. Overall, I finished this one mainly to see how things would turn out, and although I did get my answers, they left me feeling more exasperated than satisfied. 2 stars"}, {"Review": "3.5, a tedious build up but worth the payoff stars!! Full review featured on my blog Recipe & a Read! Kate Waters is a dedicated, passionate journalist. Always seeking to be first on the story, with the best information. Kate Waters also struggles with her wayward son, who left for Phuket, Thailand two years previous to the story, and calls once or twice a year at most. Alex is finishing up in school, she’s young, vibrant and full of a zest for life and a will to travel the world. Her bestie Mags may have dropped out of their planned trip to Thailand, but an acquaintance Alex might not have always seen eye-to-eye with named Rosie, isn’t enough to deter Alex from her excitement to spread her wings and taste a new found freedom.They’d never had to ring the police before in all their married life. The police belonged to another world – the world they saw on television or in the papers. Not theirs. Alex is a good kid, she’s as responsible as a kid her age can be. Her parents have allowed her to take this gap year and they’ve arranged specific times and dates there is to be communication from Alex – to ensure she’s doing alright. When Alex doesn’t check in with her parents – their worst fears are realized and they have to contact the police to report their daughter missing. She’s not just missing either, she’s a missing child internationally. This is when we are introduced to DS Zara Salmond and DI Bob Sparkes. Not only has Alex not reached out to her family, but the regular social media posts and emails have abruptly stopped. As the days slip by one by one, family and friends become more frenzied as they realize the girls have disappeared without a trace, and in Thailand no less.She wrote a Things To Do, just like she would if she were at home. But instead of writing phone bank, buy cat food, DRY CLEANING!, she put Find out how the fire started, Who else was in the hostel? Was there a party? Where were Alex and Rosie? WHY DIDN’T THEY GET OUT?Not only are these parents worst fears realized but they’re thrust into immediate limelight in the worst way. As they're grappling with the reality of their situation, they’ve also become a worldwide source of entertainment. The Suspect is told from multiple POVs – Kate Waters, DI Bob Sparkes, Alex’s mother Lesley and Alex herself. Switching up the perspectives really kept the stories forward momentum chugging along in a way that was at times sluggish and at others built suspense like Jenga blocks waiting to be toppled. As I’ve mentioned in many of my other reviews one thing I adore, that takes place most often in thriller novels, is little breakups in formatting. Barton dealt these out in spades with Facebook posts, emails, and police communication.While I enjoyed Barton’s storytelling, her writing and her ability to build some serious suspense I still found myself a bit let down by this novel. The start of this book was achingly sluggish for me and I kept putting it down and reading other books instead because I found I just couldn’t connect with the characters or the story right off the bat. As the story progressed and the tension and suspense built up, and the forward progression sped along I found myself enjoying it much more than I had anticipated. I did enjoy this and once it got moving I found it quite compelling, I just wish that it had been a bit more developed and had grabbed me from the start.Thank you Netgalley for a copy of this ARC. Traveling Sisters Read."}, {"Review": "What drew me to this book was the premise, young people taking a “gap year” or vacation far from home, in this case Thailand. The world can be a very scary place particularly if you have led a somewhat sheltered life and young people make decisions based on emotions often without thinking far ahead of possible consequences. These girls are quite young, just graduated from high school, to be traveling alone in a dangerous country with no back up plan should things go awry. Alex is a great student who has saved for a long time for this trip. She has it planned down to what they would be doing every day, what she hopes to see in Thailand, the trip of a lifetime. However at the last minute her good friend Mags tells her that she really can’t go, she doesn’t have the money. Alex is disappointed, so when Rosie, just an acquaintance, not really a good friend, offers to go with her, the trip is back on. Her best friend cautions her about Rosie, she is known to make bad decisions in the past but Alex is desperate to go on the trip she has planned for so long.Things go wrong very quickly and the girls parents are alarmed. They haven’t heard from the girls in 3 days or more. Soon the police are involved and Kate Waters, a journalist, wants to cover the story. She has a very personal reason, her own son, Jake, has been in Thailand for two years with very little communication between Jake and his parents. She arrives on the scene of a terrible fire in a hostel where the bodies of two young women have been found, they are soon identified. The only known witness is in the hospital, but Kate is too late, by the time she arrives the witness has fled.Soon Kate herself is part of the story as her son Jake is identified as the lone witness. There are so many questions that she wants to ask him, but he will not contact her no matter how hard she tries.There were lots of things I liked about this book. It had a great premise, the characters were interesting, if not quite believable, and there was a mystery to be solved. I do think that this book will have you turning the pages to figure out the mystery of what happened. It is a complicated, well written mystery. I do feel as though the characters could have been more well described. We know very little about the girls and Jake except for what is taking place at the time. I think if I would have known more about them I would have cared more about the story.For me this was a mediocre read, not one that I will rave about but still a good read.I had trouble believing that Kate would let two years pass without checking on her only son but then she flies off to Bangkok quickly when in pursuit of a story. I don’t really get a feel for her personality as a mother or wife. Her husband plays little part in the unraveling of the story.I had the same feeling with Ms. Barton’s other books, her strength lies more with the mystery than the characters.I received an ARC of this mystery from publisher through NetGalley."}, {"Review": "One of my goals this year is to be pickier about the thrillers I read. Not that this is a thriller, despite the publisher’s blurb calling it one. But it still reminded me of why I made this a 2019 goal in the first place. This book fell very short of my expectations. The premise is a promising one...kids on a trip to Thailand go missing.... and the setting is well described, but the execution was lacking. Without going into the plot details, as those are easily found, I thought this was going to be more about the investigation than teenagers behaving badly. I was wrong. These were my issues:-     the alternating chapters slowed the story down to a crawl with a lot of repetitiveness. Several characters were so similar I had trouble keeping them straight. Others were in the periphery and not developed at all. -   they were the most annoying bunch of people I’ve come across in my reading in quite a long time. I easily become emotionally invested but here I could not have cared less what happened to any of them. Even death didn't evoke an emotional reaction other than relief they were gone from the pages. And then disappointment that they were brought back to life in flashbacks.-   I love dysfunctional families in novels but parents behaving badly and blaming themselves for badly behaved children left me cold. Poor me, my parents are pressuring me to go to college so I’m going to run away and act like a spoiled brat, binge drink, do drugs, and have sex with anyone with a pulse…wah, wah, poor me. And the parents bought it. Can you imagine being such a terrible parent that you want your child to go to college? -   Errors and plot holes abound- I don't know when I will learn to not read books that have teenage characters. I can tolerate them only from a handful of authors. - Would most parents really be ok with letting their teenage daughter go off to Thailand with a virtual stranger? A country where danger is everywhere especially for less than savvy tourists (like a teenager)?-   The behavior of those who were grieving left me baffled (and yes, I do have experience in this area).-   The middle of the book was such a slog I speed read it and missed nothing In short, kids behaving badly, parents behaving badly, plot holes, and a poorly executed resolution left me unsatisfied. But many have loved this book so I'm with the outlier club.*This was a buddy read with my good friend Marialyce. *I received a copy of this book from Edelweiss in exchange for an honest review."}, {"Review": "4.5 stars! An extremely addictive, twisty and fast-paced journey.Kate Waters, a determined and successful reporter, travels to Thailand to investigate the disappearance of two eighteen-year-old girls from her home town. The girls were on a backpacking trip, with a jam-packed itinerary and plans to be in touch with their parents every couple days. Their parents notified police after several days of not hearing from either girl. This leads to an investigation by the Thai police and then involves local Detective Inspector Bob Sparkes and his team who travel to Thailand to pick up the pieces that seem to be missing.I am so sad to be finished this novel. I thoroughly enjoyed reading this thrilling and suspenseful story, where I hungrily devoured every single word in extreme anticipation of what would happen next. The characters, setting and storyline pulled me right in from page one. Each chapter left me feeling an urgent need to continue on and fit another chapter in. I loved Kate Waters and DI Sparkes! I enjoyed their personalities and thought their personal side stories really enhanced the novel.When I downloaded this ARC, I didn’t realize it was part of a series. I read Book #1 “The Widow” a few years back and enjoyed it, but didn’t love it. I haven’t read Book #2 “The Child”. This, being Book #3, is completely fine to read as a standalone. I feel that the author, Fiona Barton’s, writing is much more smooth and engrossing in this novel, compared to “The Widow”. I look forward to picking up “The Child” to see how it is in comparison and I look forward to Book #4!Thank you to Edelweiss, Penguin Books and Fiona Barton for providing me with an ARC to read and review. Expected date of publication: January 22, 2019."}, {"Review": "3.5 Stars! Intriguing premise, short chapters & a suspenseful mystery!Can you enjoy a book even if you don’t connect with the way a book is written? Fiona Barton is an author that I always find myself a little excited to read but I wouldn’t necessarily say that I enjoy the way she narrates her stories though. I find the narrative a little bit indifferent and challenging but I wouldn’t say that it hinders my reading experience all that much though. If so, it’s minimal and it definitely doesn’t stop me from picking up her next book offering. Weird I know! THE SUSPECT by FIONA BARTON is a slow-building suspenseful crime thriller that takes you on quite the intriguing journey that clips along at a nice swift pace. I was immediately intrigued within the mystery here and the short chapters definitely helps to move this story forward quickly. I absolutely love short chapters because they make me feel like I have to read just one more chapter. FIONA BARTON delivers an entertaining and interesting read here that is told through multiple perspectives with chapter headings labeled “The Reporter”, “The Mother”, “The Detective” and “Bangkok Day ?” from Alex, one of the missing girls. I really enjoy and love this format but I felt like there was something missing though to make me really connect and feel for these characters. I found Alex’s perspective the most interesting and would have liked to have read more of her story. Even though I didn’t love this one I was still entertained and thoroughly enjoyed the premise of this novel.*This was a Traveling Sisters read*Expected Publishing Date: January 22/19 Norma’s Stats:Cover: Eye-catching, intriguing, mysterious, and a fitting representation to storyline. Title: I really like the title of this book and how it played obscurely into storyline. Writing/Prose: I am not going to elaborate on the writing because I wasn’t able to connect and fully enjoy it. I read this with my Traveling Sisters and I was the only one that felt this way. Plot: Interesting, intriguing, predictable, fast-paced, and entertaining.Ending: Satisfying but I have questions and wonder what is next in store for Kate.Overall: There is something about her books that I just find so appealing and readable. Would recommend!Thank you so much to Elisha at Berkley Publishing Group and to Fiona Barton for the opportunity to read an advance reading copy of this novel.Review can also be found on our blog:https://twosisterslostinacoulee.com"}, {"Review": "Told from the perspective of three different characters, one being posts from one of the dead girls. There was just something about this format that kept me from totally connecting to the story. There were many positives, a reporter who becomes part of the story, a moral quandry pertaining how far one would go to protect her child. One big twist in the story that I didn't see coming. The format though, read more like a documentary, which made it difficult for an emotional connect. I just never really felt the characters. Was more a tell not feel. So for me, this was a good story, different plot, a locale, Thailand, that I have read little about, just wish I could have felt more.ARC from Netgalley."}, {"Review": "2.5/2.75ish stars rounded up to 3Two eighteen-year-old females (Alex & Rosie) go missing on their gap year in Thailand. When both fail to call home to get their A level results, their parents become concerned and call the authorities. Kate Waters, a journalist, has not seen her son Jake in years. he too went traveling to Thailand. She hears from him from time to time but doesn't really know what he is doing or where he is. When she learns about the missing girls, her interest in piqued and she also wants to use this time to find her son. She gets close to the two families to get the story and quickly learns that this case is going to hit closer to home than she realized.For me, this book was slow as in S-L-O-W. The format did not work for me. Plus, I really didn't connect with any of the characters and frankly, I wanted more of the girls and less of their parents. At least the girls were more entertaining.Sadly, this one just wasn't for me. The premise is great - two girls go missing on a gap year. But unfortunately, I found this hard to get into, I struggled with the middle and even the twist at the end didn't do it for me. I really like when a book can draw me in, and I care about the characters. This was not the case here. Thank you to the publisher and Edelweiss who provided me with a copy of this book in exchange for an honest review. All the thoughts and opinions are my own."}, {"Review": "This was an intriguing story that kept the mama bear in me on the edge of my seat!This is a story guaranteed to make any parent squirm... Leslie and Jenny receive the call that no mother ever wants to receive, they need to head to Thailand to identify their daughters bodies...Being a parent is a tough job, and being the parent of adult children is sometimes even harder... i’ve read so many reviews that state that they don’t know anyone who would allow their children to go to Thailand at the age of 18? And that’s fine if you don’t believe you would allow your children to go to Thailand, but it does not mean that a parent that would allow their children to go to Thailand is a bad parent.... I also think that a lot more UK kids in their late teens early 20s travel, the gap year is much more common... I personally don’t know anyone here in America who had a gap year? With the exception of Malia Obama, who I guess I don’t know personally...It is more than likely I would not want my kids to go to Thailand, but there comes a point in your child’s life that it is up to them... in this book Alex has graduated is about to head off to university and has saved her money for an entire year for this trip, in hindsight probably not the greatest idea, but... well I went off on a bit of a tangent there, sorry about that.... back to the book!When two 18-year-old girls Alex and Rosie go missing while on holiday in Thailand it stirs up all kinds of emotions in Kate.... Kate’s son Jacob dropped out of university and went traveling to Thailand to “find himself“ with very sporadic communication with Home... Kate who is a reporter instantly gets herself on the case, and when the families travel to Thailand she is compelled to go too... but Kate has no idea what awaits her in Thailand, secrets and deceptions that will turn the reporter into the story!This book really was more of a mystery/police procedural/family drama than a traditional thriller... but I was still completely engrossed in the story wanting to know what happened to these girls... I really liked Alex and I loved getting to know her through her Facebook posts and communication with her BFF back home... Rosie on the other hand was much less sympathetic, to say the least.... my heart broke for these parents and I really felt their pain and their need for justice and truth.... I can only imagine how hard it would be as more andMore truths were revealed about your daughters’ horrifying last days...A perfectly paced story that was propelled forward by short concise chapters... i’d say this book was more plot driven then character driven, and generally I do like a story to be more character driven, but this one completely captivated me.... as I said my mama bear was on high alert... I just needed to know what had happened to these girls, and how these parents coped with living my worst nightmare....A well constructed story with a large dose of mystery and a splash of thriller! Recommend!🎵 OK I’m going to start doing something a little different with all my reviews. I love music and I always have a song going through my head as I’m reading... so I’m going to start sharing with you lyrics and a link to the song running through my head while reading. At least until I run out of songs or inspiration!Bangkok, Oriental settingAnd the city don't know that the city is gettingThe creme de la creme of the chess world In a show with everything but Yul BrynnerTime flies doesn't seem a minuteSince the Tirolean spa had the chess boys in itAll change don't you know that when youPlay at this level there's no ordinary venueIt's Iceland or the Philippines or Hastings orOr this place!One night in Bangkok and the world's your oysterThe bars are temples but the pearls ain't freeYou'll find a god in every golden cloisterAnd if you're lucky then the god's a sheI can feel an angel sliding up to me- Murray Head 1984https://m.youtube.com/watch?v=rgc_LRj...*** Big thanks to Berkley for my copy of this book ***"}, {"Review": "\nNo one wants to hear that their child has a dark side. Especially when she’s dead.\nWell, or thought to be. It is every parent’s nightmare. Eighteen-year-old Alexandra O’Connor (Alex) and Rosie Shaw have been out of touch for a week, and Alex’s parents are alarmed. Her A-level results are in, a source of great interest, and stress. She had promised to call and this was not something she would have willingly put off. Not necessarily a huge big deal if dear daughter were closer to home, but Alex and Rosie had been backpacking in Thailand and the margin between fear and action narrows in inverse proportion to the number of miles separating parent and child. I can relate, having had a son who worked in China for a spell, and a daughter who went to school in France for a semester.Fiona Barton - image from Connexion FranceDetective Inspector Bob Sparkes, returning from an engagement in Barton’s two previous books, gets the assignment. He has pressing concerns of his own, centering on a wife with terminal cancer. The main look at events here is through the eyes of Kate Waters, a veteran reporter, who can identify with the frightened parents as she has some issues as well. Her #1 son had unexpectedly dropped out of college to do humanitarian work in Phuket. Might not be a problem if the little turd ever phoned home, but he is practically as missing as Alex and Rosie. Maybe mom can kill two birds with one stone by digging in on this story and giving herself an opportunity to check up on junior.Where the detective may have the greater authority, the reporter has more freedom\nWhat Kate Waters gives me is the freedom to go in any direction – a freedom I loved when I was a reporter. One week I’d be interviewing a rescued sailor in Australia, the next, talking to the Mother of Martyrs in Gaza or in a Glasgow flat with a man accused of online child abuse. While police officers are drowning in a sea of forms in triplicate, she can pick up her notebook and go. - from WHSmith blog interviewIt is Kate who gets most of the ink here, the third novel in which she has been featured. (after The Widow in 2016 and The Child in 2017) That is probably because writing about a reporter is something to which Barton brings decades of personal experience. She was a senior writer at the Daily Mail, news editor at the Daily Telegraph and, as chief reporter at the Mail on Sunday, she received the Press Association’s 2002 Reporter of the Year award. Among other benefits, being a journalist offered her many opportunities to study body language and speech patterns at the many criminal trials she covered.\nthe interview is her primary narrative tool, the scalpel that gets words, both spoken and thought, emerging from her characters. - from Hazlit interviewWe follow the events in chronological order, alternating perspectives among The Reporter, Kate, The Detective, Bob, and The Mother, Lesley, Alex’s mom. There is a fourth look as well, a third person omniscient chronology of the actual events in Thailand. The timeline for the last begins earlier than the other three views and overlaps with those, but is also a straight chronology. One thing Barton is fond of is looking not merely at the victims and potential perpetrators, but at their families. The impact on Alex’s family is given considerable attention, as is the impact on Kate and her husband of Jake having inexplicably stopped communicating with them. The family impacts share space with the usual procedural steps one expects in a suspense novel of this sort. Where there are cops there are questions to be asked, people to speak with, clues to be found, explanations to be considered, assumptions to be made, corrections to assumptions to be made, shifting direction and theory with the emergence of new bits of information. What gives the straight and narrow of find clue-examine clue-proceed to next clue that permeates mysteries of diverse sorts a needed jolt is the twist. Barton delivers. There are more bends than a plate of Pad Thai. If the characters are not engaging, the rest of the story suffers. Not having had the pleasure of reading Barton’s two prior Kate Waters books, I did not arrive at this book with the character’s personal history in my head. No familiar ticks to look for, no unresolved personal or professional challenges from the prior two that made me want to follow along to see what would turn out. Ditto for Bob. That could be an impediment, if the author decides to spread out the inners of a protagonist over too many volumes. Thankfully, I did not feel at a loss in The Suspect. Kate Waters was a nicely drawn character. You do not need to know her prior cases and experiences to be able to plunge right in. Go ahead. The water’s fine. There is less of Bob, but it is enough to keep him human. The young’uns are nicely painted as well. Alex is a pretty decent sort, Rosie less so, and the people they encounter in Thailand are a mixed lot. Caring about Alex, in particular, adds the engagement you want in this sort of work. What happened to her? Will she be ok?Secrecy is a major motif. There is a core concept in the book about parents not really knowing their own children. \n…as I grew and started reading books from my parents’ bookshelves, I discovered the thrill of finding out other people’s private thoughts and actions. It began with detective stories—Sherlock Holmes and his powers of deduction, and the shoals of red herrings in Agatha Christie’s novels. The “ta da!” of a heavily concealed denouement.But it was Daphne du Maurier’s Rebecca that stopped me in my tracks. From the hypnotic first line—“Last night I dreamt I went to Manderley again”—I was drawn deep into this tragic love story and its gothic horror. I was no longer the observer of amateur detectives’ cleverness; I lived every moment of the tense, unsettling, and compelling narrative and was caught in the fabric of lies and silence that surrounded the real story. I was hooked. It was the first time I had been faced with the revelation that we can never really know anyone completely—even, or perhaps especially, those we love. - from the PW articleThe hush-hush is not limited to the victims’ parents. This is a particularly strong element, one that offers considerable oomph on top of the satisfaction of a this-then-that-to-resolution story-telling, a willingness to look at how good people can sometimes overlook bad behavior, in inverse proportion to the closeness of the sinner. There is also a powerful look at what it is like both dealing with the press and being among the reporter scrum howling outside your door. A look at the frenemy clot of reporters vying for ways in to a story they have all been assigned is both dark and delightful. Colleagues or competitors? Add to that a look at some elements of life in Thailand that may push it down your bucket list a few rungs. I do not really have any major gripes with the book. One minor gripe is the title. Maybe it should have been The Story. Fact is there is no suspect at all until well into the book. I suppose if the publisher had dropped the The from the title, it might have been more justifiable, as there are many elements in the book that can be considered suspect without linking that word to a person. But a pretty small quibble in the scheme of things. The Suspect was immediately engaging, a page-turner even. Fast-paced, logical, with relatable characters, offering excellent payload about the news business and life in Thailand, with content about parents’ perceptions of and relationships with their kids, while offering a pretty good story. Nothing at all suspect about that. Review posted – January 11, 2019Publication date-----USA - 1/22/2019-----UK – 1/24/2019I received an ARE of this book from Berkley Books. There was no demand that a review be written, but I strongly suspect they prefer one be posted. =============================EXTRA STUFFLinks to the author’s personal, Twitter and FB pagesInterviews-----Hazlitt - ‘There’s No Mitigation for Killing a Child’: An Interview with Fiona Barton By Naben Ruthnum – on the reporter or cop interview with a subject as a duel – pretty interesting-----WHSmith Blog - Fiona Barton: The Development of Kate Waters and the Decision to Make her an Investigative Journalist -----The Daily Mail - My light bulb moment: Best-selling author Fiona Barton reveals what inspired her to drop everything and volunteer in Sri Lanka - - by Liz Hoggard-----Omnivoracious -The Amazon Book Review - \"Writing Is a Weird Job\"--Kate Hamer in Conversation with Fiona Barton - forget the wording in the source, this is not a book review,but a back and forth between Barton and Hamer-----Shelf Awareness -  Fiona Barton: The Strength of Secrets - by Kerry McHugh – the interview follows a review of Barton’s book The Widow-----The Connexion – French News and Views - The Accidental Novelist - by Jane Hanks-----The Globe and Mail Fiona Barton: ‘Writing is not just about putting words on a page’ - by Jenny LewisItems of interest-----Publishers Weekly - In My Own Words: Fiona Barton Spills a Secret -----What’s the Matter with Kids Today - from the film Bye Bye Birdie-----Secrets - One Republic-----Secrets - Israel Houghton (feat. Adrienne Houghton)"}, {"Review": "4 stars to my first Fiona Barton book! ⭐️ ⭐️ ⭐️ ⭐️ I’ve not read the other books in Fiona Barton’s Kate Waters series, but The Suspect is billed as a standalone, and it certainly does stand alone. Two eighteen-year-old girls go missing in Thailand, and their families are thrown in front of the press with all their emotions at play. Full of worry and frantic as the time passes by, their parents just want their daughters home. Kate Waters is a journalist and a motivated one at that. She jumps to cover the events in this disappearance; however, this case becomes personal to her because her son has been missing for two years, also while traveling. Kate becomes close with the families as her means of getting at the true story, but she has no idea what she has stepped into by making this move. The story takes a huge turn that no one sees coming, and Kate begins to regret her closeness to the story. The Suspect is a slower burn tale of suspense. I found myself caught up in and consumed by the story and how it would all unfold. I enjoyed the structure and how we were able to hear from Kate, the detective, one of the mothers, and also one of the missing teens. There is added depth in the presentation of the mother-daughter relationship. The writing is effortless, and the pacing is smooth. I definitely enjoyed my first foray into Barton’s storytelling.Thanks to Berkley for the complimentary ARC. All opinions are my own. My reviews can also be found on my blog: www.jennifertarheelreader.com"}, {"Review": "3.5 STARS\nTwo eighteen year old girls traveling alone to an  exotic Thailand destination might mean trouble and it does...\nI was immediately drawn into the story of these teens- Alex and Rosie, who traveled to Thailand for their \"gap\" year from college. The parents and one of the girls closest friends had been keeping up with Alex through phone calls and Facebook posts, until they suddenly stopped. I thought the chapters with the posts gave the story interest and Alex's posts to her bestie added some information she withheld from her parents (we all know teens do that).\nWho lets their teen\n\ns go to Thailand without a responsible adult around? \n  insert - FEARI really enjoyed the first half of the book, but the story did lose some steam in the second part. Once I figured out the villan, I was ready to wrap it up.This is a police-procedural with an intriguing setting. Read it to see if you can solve it before the villain is outed.Thanks to the publisher/NG for my review copy! Blog post closer to publication date."}, {"Review": "I absolutely loved The Widow by this author and then she came out with The Child and I liked it well enough. I am disappointed to say that The Suspect, for me, was her weakest offering yet. I didn't find this to be a page-turner at all. It was a slog beginning to end. We have two teenage girls, Alex & Rosie, taking a gap year in Thailand. Alex was supposed to phone her parents on a specific day at a specific time and when the call doesn't come through and her phone continues to go unanswered her parents notify authorities. It appears the two girls have vanished. Kate Waters, journalist, returns in The Suspect to investigate the whereabouts of the girls. Coincidentally, her own son, Jake, is in Thailand as well to discover himself but sadly it's been years and she hardly ever hears from him. Her curiosity is piqued by the case but it's truly the idea of flying to Thailand to possibly find Jake that is just too hard to resist. This book made me want to rip my hair out at times. The constant arguing throughout this book was driving me insane. Alex and Rosie did nothing but scream at one another. In fact, Rosie may be one of the most annoying fictional characters I have ever read. Talk about an obnoxious, spoiled brat. Then you have the girls parents. ANNOYING! The whole lot of them. Bickering back and forth playing the blame game of which girl was the bad influence. The ending was a surprise but for me it was not a satisfying one and that's all I have to say about that. NEXT! Thank you to Edelweiss and Berkley Publishing Group for providing me with a digital ARC in exchange for my honest review."}, {"Review": "EXCERPT: She should have been on a beach by now but Rosie wouldn't budge. She was having too good a time to leave. And Alex was too nervous to continue alone. So she carried on writing variations on Alex O'Connor. . . is having the time of her life on her timeline and counted the Likes, the Loves, the funny comments from her friends and passing strangers. They helped bolster the fiction. She kept Alex O'Connor wishes she'd never come  to herself. ABOUT THIS BOOK: The police belonged to another world – the world they saw on the television or in the papers. Not theirs.When two eighteen-year-old girls go missing on their gap year in Thailand, their families are thrust into the international spotlight: desperate, bereft and frantic with worry. Journalist Kate Waters always does everything she can to be first to the story, first with the exclusive, first to discover the truth – and this time is no exception. But she can’t help but think of her own son, who she hasn’t seen in two years since he left home to go traveling. This time it’s personal.And as the case of the missing girls unfolds, they will all find that even this far away, danger can lie closer to home than you might think.MY THOUGHTS: It is 3 am. I couldn't go to sleep until I had finished this book. I didn't want to go to work yesterday. I wanted to stay home and read. I played hookey from the Friday staff lunch meeting to go sit in the Japanese garden and read. OMG! The Suspect by Fiona Barton is an absolutely delicious read. And having just finished, my head is still spinning. Every time I thought I knew something, Fiona Barton turned me round and sent me off in another direction. Brilliant!Barton deals with a whole host of different issues while providing us with a slow burning, suspenseful story of two girls who go missing on their gap year OE: the fake lives we post on social media, the pressures we place on our children to 'succeed', the tourist scams that occur in countries like Thailand, the easy availability of drugs, drink spiking, identity theft, the lengths we go to to protect our children . . . the list goes on. The story is told from multiple points of view: from that of Alex (this was her dream trip), the Mother (Alex's mother and, by extension, Rosie's mother), the Detective (who has a major drama going on in his own life), and the Reporter (who has a personal connection to the story). As the current story of the search for the two girls is told, it is interspersed with Alex's story of what really happened. The Suspect is the first book of my reading year where I am going to be saying 'OMG, you just have to read this!'I read and adored Barton's first book, The Widow. I somehow missed her second book The Child. But after finishing The Suspect, the first thing I did was order a copy. Fiona Barton is firmly on my favorite author list. 💖💕💖💕💖THE AUTHOR: My career has taken some surprising twists and turns over the years. I have been a journalist - senior writer at the Daily Mail, news editor at the Daily Telegraph, and chief reporter at The Mail on Sunday, where I won Reporter of the Year at the National Press Awards, gave up my job to volunteer in Sri Lanka and since 2008, have trained and worked with exiled and threatened journalists all over the world.But through it all, a story was cooking in my head. As a national newspaper journalist covering notorious crimes and trials, I found myself wondering what the families of those accused really knew – or allowed themselves to know.My husband and I are living the good life in south-west France, where I am writing in bed, early in the morning when the only distraction is our cockerel, Sparky, crowing.DISCLOSURE: Thank you to Random House UK, Transworld Publishers, Bantam Press via Netgalley for providing a digital ARC of The Suspect for review. All opinions expressed in this review are entirely my own personal opinions. Please refer to my Goodreads.com profile page or the about page on sandysbookaday.wordpress.com for an explanation of my rating system. This review and others are also published on my page sandysbookaday.wordpress.com https://sandysbookaday.wordpress.com/..."}, {"Review": "The Suspect by Fiona Barton is a thriller with quite a few twist and turns. When two girls on their gap year go missing in Thailand, Kate a reporter starts looking into this.Her son is in Thailand and she sees this case as a way of reconnecting with him. When the girls bodies are found in suspicious circumstances Kate's son is one of the suspects. This is the third book I have read by this author and I have enjoyed them all and I am looking forward to her next book.Thank you to NetGalley and Random House UK, Transworld Publishers for my e-copy in exchange for an honest review."}, {"Review": "This was my first book by Fiona Barton and I can see why she has many fans!The Suspect was marketed as a thriller but I think I would lean more towards family drama. I found myself very intrigued at the beginning of the book with finding out what happened with these two eighteen year old girls in Thailand. I don't know about you... but I don't know any parents that would let their teenage daughters travel alone to a place like Thailand. I really enjoyed the facebook posts and the background we see leading up to the reveal of the two missing girls. I had some issues with how the story was narrated.. and it was challenging for me to read at times. But, I still was perked with interest! This is definitely a slow building family drama and would say that the second half of the story lost my interest. It was a bit long for me and once I found out who the villain was... I wanted the story to come to a close.There was something that bothered me about the villain and the \"excuse\" that was used to blame why they did what they did. I don't really understand why so many use foster care as a means to commit a crime? I really didn't like this and it caused my rating to go down a little bit.Despite minor flaws..... I still enjoyed this one! 3 stars for me on this one :)Thank you to Berkley pub for the copy in exchange for my honest review.Published to GR: 1/16/19Publication date: 1/22/19"}, {"Review": "This is the third book I’ve read, and liked, by this author. Each features the journalist Kate Waters, who specializes in ingratiating herself with distressed or grieving parents in order to get a story. In this book, she has two sets of parents to handle when their 18 year old daughters go missing while vacationing in Bangkok. Kate can empathize with the parents, since her own eldest son Jake has been doing volunteer work in Thailand for two years, and he hasn’t been good at keeping in touch with his family. I have ambivalent feelings about Kate. She seems like a nice enough person, but on the other hand the nature of her work is so intrusive and duplicitous that I feel like I’ve been slimed when I read about her - even when the outcome for the parents is a positive one. In this book, Kate becomes more entwined with the story of the missing girls than she expected. While you can sort of see where this book is headed, there are a few surprises along the way. I liked the mix of the newspaper business with a police procedural. The characters were realistic and the plot was plausible. There was a side story about a detective with a dying wife that seemed to serve no purpose. That story became intrusive at times and skipping it would have shortened the book, but that is a quibble. Overall I enjoyed this book and will continue to read this author. I received a free copy of this book from the publisher. "}, {"Review": "Because of my fear of missing out on everyone thoughts, we read this one with a few of our Friends on Instagram and our Sisters and we had some mixed feeling here among us. We first read and discussed this story in our Instagram group and then we followed the thoughts of our Traveling Sisters as they read it. We really enjoyed seeing a few different thoughts on this story and I have added a few different thoughts from our group members.The Suspect explores one of a parent’s worst fear here, however, taking a bit of a different premise to it with the missing children being adult children. They go missing after taking a gap year and traveling to Thailand. I was intrigued right from the start as it played on one of my worst fears of the reality that we can’t keep our adult children safe and the fear of them becoming lost to us. Not only by the dangers around them but also lost to us by not knowing where or how they are really doing. This lead to a very interesting discussion with some of us who shared the same fear. We connected a bit differently to the story then others did.The story started off a bit slow and the suspense builds as we start to see some twist and turns. We could see some coming and a few that we didn’t that left us thinking oh that’s a great twist. Adding some fun and entertainment to the story and our discussion.We see a personal side to our main character here Kate Waters and I really enjoyed the personal conflict she had with her loyalties that left us questioning what we would do in her place.Overall we all enjoyed this story however a couple of us struggled a bit with the way the story was written. It took on a documentary feel to it. The chapters are short and the POV change often. For some us that made it bit harder for them to connect to the story and the characters. For the rest of us, it added some suspense to the story that drove the story forward for us. We recommend giving it a try and see where you might fall with your feelings on this one.Thank you so much to Elisha at Berkley Publishing Group and to Fiona Barton for the opportunity to read an advance reading copy of this novel.For more thoughts from our friends and Traveling Sisters https://twosisterslostinacoulee.com/2..."}, {"Review": "Alex and Rosie go travelling to Thailand together, Alex had planned to go with best friend Mags but when she pulled out Rosie persuades Alex to let her go instead, even though secretly Rosie does not want to follow Alex’s itinerary. The holiday of a lifetime soon turns sour!!The parents panic when they haven’t heard from their daughters in over a week, and they haven’t been in touch as planned to find out their A level results. So they contact the police who at first do not take it seriously.Journalist Kate flies out with the missing girls parents to find out what happened to the girls. She reluctantly soon becomes part of the story, the hunter finds herself becoming the hunted!!The chapters are told by the points of view of ( the mother, reporter, Alex and the detective) which works perfectly and keeps the tension building.Beautifully written, whilst reading it I could feel the panic of not knowing what had happened to the daughter and the need for answers. Another great book from Fiona Barton and I will be waiting with bated breath for her next one.Thank you to Netgalley for my copy in exchange for a review."}, {"Review": "\"The Suspect\" is Fiona Barton's best book yet!She burst onto the scene in early 2016, with her book,\" The Widow\", a book that I enjoyed, but one that did not quite live up to the hype for me. Then in Dec. 2017, her sophomore effort, \"The Child\" was released, one which I found to be the more satisfying of the two.\"The Suspect\" which will be released on Jan. 22. 2019 reunites journalist Kate Waters. and DI Bob Sparkes, both characters from the previous two books, though this book can be read as a stand-alone.In this book, two eighteen year old girls, Alex and Rosie, go missing in Thailand, during their \"gap year\". At first, regular reports, are posted to Facebook, by Alex O'Connor, beginning with \"Bangkok Day 1, Sunday, ( July 27. 2014) \" depicting the girls having a fabulous time. The posts and emails end abruptly on Saturday, Aug. 9th, despite the fact that Alex was excited to call home at about that same time to have her parents open the envelope containing her A list results with her on the phone...\"Like the Oscars!\"The police are called and the families are thrust into the National spotlight.Kate Water is a relentless journalist. whose son, Jake, dropped out of University, to go to Thailand two years earlier. Contact with him has been sporadic at best. She decides to cover the story, and maybe locate Jake, at the same time.Once again, she finds herself, working with detective Bob Sparkes, a DI she has a good working relationship with, who is facing some personal challenges of his own. The story unfolds, through alternating chapters, labeled as either, a Facebook post or email, from Alex, or chapters labeled \"The Reporter\" or \"The Detective\", as the desperate search for the two girls plays out.This is a slow burn novel of suspense, with well developed characters which will not disappoint fans of her previous work! I do feel however that Mystery/Thriller and Police Procedural are better labels for the book than Psychological Thriller. I was SURPRISED more than once, and I read a LOT of thrillers, so kudos to Fiona Barton for that!I would like to thank Edelweiss, Berkley Publishing and Fiona Barton for the ARC I received in exchange for an honest review!QUOTE from the book: Never let the truth get in the way of a good story-Unknown"}, {"Review": "3.5 StarsI'd like to thank Fiona Barton & Berkley Publishing for providing me with a copy of this book. This is the 2nd Fiona Barton novel I've read and I still don't know if I like her books. A couple years ago I read The Widow, it was okay but something was missing. I felt the same way about The Suspect. Something is missing from this story but I don't know what it is. The premise is interesting enough. Two teenage girls go missing while vacationing in Thailand and their families are thrust into the spotlight. The story told from the prospective of journalist Kate Waters, one of the girls mother's, Alex one of the missing teens, and detective Bob Sparks. Its entertaining but it was also predictable. It also takes forever to get going. So much like The Widow I liked it well enough but I doubt I'll spend much time thinking about it now that its over. No rec."}, {"Review": "Seasoned reporter Kate Waters is assigned the story when two 18-year-old girls are reported missing by their parents. But a gap year spent backpacking through Thailand is sure to have episodes of spotty communication with parents. Kate and her tag-along intern plan to get a story out there that will prompt the girls to pick up the phone. Easy, right? But when Kate finds her own name in the headlines, she must step aside. There is a major conflict of interest now. The girls aren't just missing, they're dead. And Kate's son is the suspect.The Suspect is told through 4 points of view: The Reporter, The Detective, The Mother, and correspondence from one of the girls' facebook accounts. I found it very interesting to watch a news reporter become the story in question and suddenly feel like a stranger when around the people and process she is so familiar with. This situation showcased ethics and authenticity within journalism, but it didn't stop Kate from continuing to investigate on her own time. The job just got real personal, and she can't stop until she knows for sure what happened to these girls...and her son. One mother's grief meets another mother's protectiveness and the conflicting emotions are palpable. This book asks thought-provoking questions about how well we know our friends, our children, and ourselves. Check it out. My favorite quote:\"But I know now that protecting our children changes who we are. Who we seem to be.\""}, {"Review": "What a great way to ring in the New Year! My first book of the year The Suspect was a win! I read this as a group read with my fellow Traveling Sisters. As a whole everyone really enjoyed it.This was a slow burn for me that increased with intensity which each page. I found that a little before the halfway point I could not put it down. I think one thing that made it so interesting was that you can easily imagine this whole scenario actually happening. Two young girls go missing in Thailand after they embark on an adventure of a lifetime. Wanting to experience the world before tying themselves down to college. Alex and Rosie set off for a experience they should remember for a lifetime. Except things were not exactly going as planned. The girls lose contact with their parents, will they ever be heard from again?I tell you what, if I had a child traveling in another country while reading this book, I would be having a bit of a breakdown right about now. It was so realistic, it drew me right in. There were several twists that caught me off guard and had me frantically trying to contact my fellow Traveling Sisters for a \"freak out\" moment. This was my first Fiona Barton book and it was a winner for me! I found it to be a page turner and suspenseful right up until the end. I can see more of her books in my future for sure. Thank you to Edelweiss, Fiona Barton and Berkley Books for this ARC."}, {"Review": "The threads that make up this mystery don’t really start to get particularly interesting until about halfway into this novel. We’ve met reporter Kate in the first two books of this series. She’s the only character who tells her story in first person, letting us know that her oldest son dropped out of school two years ago and has barely kept in touch with his family since, obviously leaving Kate, her husband, and her younger son to worry. So Kate throws herself into work. It’s August, and everyone is on holiday, so the newspaper she writes for is desperate for any story that might sell papers. When two eighteen-year-old girls disappear in Thailand, it’s as good a story as any, even though the Thai police and the British police try to assure the girls’ parents that they almost always show up.Another point of view is of the mother of one of the girls who is missing. Another POV is before the disappearance from Alex, one of the now-missing girls, and is told via her Facebook posts and her private emails to her best friend back home. This is a decent mystery, but if you are looking for a breathless page-turner, this isn’t it.Thanks so much to NetGalley for the opportunity to read this novel. For more reviews, please visit http://www.theresaalan.net/blog"}, {"Review": "Recently, I have found a number of book that have been for lack of a better word mislabeled. The book I have just finished is one of them. Labeled as a thriller, it was more of a family drama, and unfortunately, was not a family drama that I much enjoyed.In The Suspect, we meet a group of adult enablers, parents who have allowed their children to embark onto avenues that are not only fool hardy but dangerous. It is as if if the parents have passed on their \"no consequences\" gene onto their offspring.We witness the parents, one of which has seemed to cover for her son, making excuses, granting him his poor behavior even up to the ultimate of protecting him from punishment for his deplorable actions. Other parents allow their eighteen year olds to embark on a trip overseas to a land where danger lurks, while not really knowing the person their daughters travel and spend their time with. The children, or more young adults, make disastrous choices, one to the point of emerging in the drug and alcohol culture and free wheeling her way through a number of men she beds, while the other knowing full well that what she is involved in is absolutely wrong, does nothing to allay her situation. You see, for them, life is a party and that party should never end. One of the young men in the story, drifts into a state of feeling sorry for himself, wallowing in the \"my parents pressed me to be successful mantra\", while a second young man thrown around a system of various foster homes and parents, becomes a mad human being, a drifter. While all of this seems to be the making of a good book, unfortunately, this outing fell flat.The book meanders, it never really lets you know most of the characters and develop empathy for them. I found this very sad that while we see people in trouble, we also see glaringly the reasons why they are the way they are. It's like that proverbial accident waiting to happen. However, this \"accident\" was avoidable if only... The story line has quite a few holes in the telling and situations that don't lend themselves in any way to the book. The book became dull in its middle, so much so, that a book that should be building the excitement became one I couldn't wait to finish.It is ever so hard to write a review for a book that one didn't care for. So much easier, indeed, to write those glowing gushing reviews of book we have admired. So, to sum things up, I do not recommend this book. There are a multitude of really well done thrillers out there. Unfortunately, for me, this was not one of themThanks go out to my friend, Jan. We suffered our way through this one, feeling bad that a book that ultimately had promise did not live up to it.Thank you to the author, the publisher, and Edelweiss for a copy of this book in exchange for an honest review.My reviews can also be seen here: http://yayareadslotsofbooks.wordpress..."}, {"Review": "This is the 3rd book in the Kate Waters series by author Fiona Barton and for me they improve as you progress through the books. They can be read as stand-alone novels.Kate Waters is a Reporter who thrives on her work and has always put it number 1 priority sometimes at the detriment of her family. Her latest story is following up a report of two teenage girls who have gone missing while on a holiday in Thailand. One of the girls Alex had everything meticulously planned but her friend Rosie had different ideas and had no intention of following Alex's carefully laid out plan. When the girls go missing after a few weeks, it becomes apparent that something is wrong and Detective Inspector Bob Sparkes agrees to investigate. When their bodies are found in a club in Thailand, Kate travels to Thailand to follow up the story and makes excellent progress by getting close to the girls families. Unknown to Kate there are further secrets to be discovered that will have a deep impact on her family and the story becomes bigger than she ever thought possible.An excellent read.I would like to thank Net Galley and Random House UK for supplying a copy of this novel in exchange for an honest review."}], "Genre": "Thriller", "ID": "39699779", "Desc": ""}