{"Name": "An Anonymous Girl", "Image": "https://images.gr-assets.com/books/1546956642l/39863515.jpg", "Reviews": [{"Review": "Twisted. Intense. Deviously fun. Why was it that I skipped this co-author's debut?This writing duo—composed of Sarah Pekkanen and Greer Hendricks—wields some kind of power with their combined words. That elusive  “it”  factor present, allowing readers to succumb all too easily to the manipulation. It’s the very experience I hope for each and every time I pick up a book—realistic or not. Life effortlessly fading into the background as the intensity and promise for something truly twisted takes over—no matter how loud the tv might be, who’s begging for attention, or the myriad of things niggling on your conscience. Believe me, none of those things will matter in the face of this devious page-turner. In fact, at times, coming up for breath might not feel optional. Looking back, there are a few reasons I chose to pass on The Wife Between Us. Number one being the hordes of hype. The overwhelming availability, constant marketing and utter feed domination turned me off. Bottom line, hype leads to grandiose expectations, which typically leads to disappointment. Something I’ve become all too familiar with in the literary world as of late. I’m sure there’s bound to be an exhaustive campaign here as well; getting in front of that the only way I was able to keep my expectations at a manageable level. With that said, in my humble opinion, An Anonymous Girl deserves any and all of the hype that’s put out there. If this book is any indication of the sheer cleverness involved in The Wife Between Us, count me in. Sarah Pekkanen and Greer Hendricks introduce readers to Jessica—or Jess—just another anonymous girl working in New York as a freelance makeup artist. Eager to earn some extra cash, Jess manages to finagle her way into a psychological study she overhears one of her clients bailing on. Referred to as Subject 52, Jess is asked to answer a serious of moral and ethical questions honestly, via a lone laptop in a barren classroom. \nI'm not used to expressing myself like this. Writing about hidden thoughts is like washing off makeup and seeing a bare face.\nMuch like Jessica’s theories surrounding the study, this book is nothing like what I had envisioned going in. This is so much more than just another anonymous title, floating around faceless in what’s become a saturated genre. Addictive, original, gasp-inducing, An Anonymous Girl meets all of the requirements necessary to be tagged as a memorable suspense read.*Thank you to St. Martin’s Press for providing a copy in exchange for my honest review."}, {"Review": "My reviews can also be seen at: https://deesradreadsandreviews.wordpr... I really enjoyed Greer Hendricks and Sarah Pekkanen’s previous novel “The Wife Between Us”. So as soon as I saw the cover for this novel and read the synopsis, I knew I just had to read it. I devoured this novel in just a few hours, ignoring everything and everyone as I read.  The book opens as twenty-eight-year-old makeup artist; Jessica Farris is heading to her last appointment of the day. She travels to her clients instead of them coming to her. Even though she doesn’t always know who will answer the door, Jessica doesn’t fear strangers. She’s learned that “more harm can come from familiar faces”. Jessica enjoys what she does. Her appointment is with two young women who are going out to a club that evening. As she applies their makeup, she loses herself in her work, barely hearing the women chatting to each other. But then she overhears a voicemail message one of the women plays…\n“This is Ben Quick, Dr. Shields’s assistant. I’m confirming your appointments this weekend, for tomorrow and Sunday from eight to ten a.m. The location again is Hunter Hall, Room 214. I’ll meet you in the lobby and take you up.” \n Jessica doesn’t know that this message will change her life completely.A psych professor needs subjects for a study on morality and ethics. Applicants will be paid to answer questions. Jessica could really use the money. So when she hears that her client likely won’t be attending, she decides to go in her place…She’s accepted into the study and will be bound by a confidentiality agreement. Jessica is told there are no right or wrong answers, she just needs to be completely open and honest. The questions are personal and may trigger very emotional responses….\n“Could you tell a lie without feeling guilt?”\nBut Jessica surprises herself and the doctor when she doesn’t shy away from the questions. When the sessions are complete, the doctor asks if Jessica would consider expanding her participation in the study. It would mean more would be asked of her….\nSIGNIFICANTLY MORE. \nIt would also mean more money.Jessica really opens up to the doctor. She talks about the pressure she’s under and the secret she’s kept for so many years. \n“Guilt is always the heaviest thing I carry”. \nWith Dr. Shields, she’s able to reveal things she’s never talked about before.But as the project expands, Jessica starts to wonder what the doctor is doing with all of the information collected. What will the doctor do with Jessica’s innermost thoughts? Her confessions? Her mistakes? Then the assignments take a strange and unexpected turn. Is she just being paranoid or is something sinister going on?“An Anonymous Girl” was a thought-provoking and phenomenal read. It pulled me in from the beginning and wouldn't let go. The chapters are a nice length and alternate between Jessica and the doctor's point of view.In my opinion, Greer Hendricks and Sarah Pekkanen knocked this one out of the park. This was a fascinating psychological suspense novel with a great storyline, excellent characters, and twists and turns that kept me flipping pages at a rapid pace.A wonderfully dark and suspenseful novel about love, anger, betrayal, morality, and obsession.I'd like to thank St. Martin’s books for giving me the opportunity to read this book in exchange for my honest review."}, {"Review": "Happy Pub Day!You're Invited: Seeking women aged 18-32 to participate in a study on ethics and morality conducted by a preeminent NYC psychiatrist. Generous compensation. Anonymity guaranteed. Call for more details. Ok, so you know how every year there are books that come out of the gate hyped up? I'm talking a full calendar year before publication, these books are already being shoved in our faces and by the time they come out we are underwhelmed and sick to our stomachs of seeing said book floating around social media to the point we scream and rip out our hair? Don't worry, this isn't one of those. That's not to say we won't see it floating around prominently for the next six months, simply that it is in fact worthy of every bit of hype it's already receiving. In all honesty, I was a bit nervous picking up the sophomore novel following readers' beloved The Wife Between Us, simply due to the high bar that was set with this author duo's debut. In my humble opinion, An Anonymous Girl was even better than TWBU, and I mean that as the highest compliment that I can give!We all have reasons for our actions. Even if we hide the reason from those who think they know us best. Even if the reasons are so deeply buried we can't recognize them ourselves.This is one you need to go into the plot blind folks. Where The Wife Between Us is known for that massive twist (you know the one I'm talking about), An Anonymous Girl slams you over and over again. It's not comprised of a single, WTF twist; this one hits you time and again with OMG-Oh-No-She-Didn't whiplash. Every time I thought I had this one figured out, it turns out I had misjudged and things kept changing. It was the type of complex, thrilling novel of suspense that I have't come across in quite awhile. It's getting harder as an avid reader of mysteries to find ones that I can't figure out immediately, and this one proved to me that there ARE still new tricks and writing techniques that can be used to fool readers while keeping them engaged with the characters. And talk about some wicked nasty characters... My favorite!I'm going to shut up now and let you decide if this is a book you're interested in, but just know that I enjoyed it so much that I'm contemplating re-reading it before publication date just to see if I can catch any of the clues that I missed the first go around; it was that good. I even bumped my initial 4 star rating up to a banging 5 because I can't stop thinking about this book. If you are able to get your hands on an early copy, don't put it off until publication date. If you are the type to pre-order, PRE-ORDER THIS BABY. Seriously, it's such a fun read with a sly and delicious cover; your bookshelf will thank you! Your family, your boss, and your to-do list however will not; they'll be sorely disappointed that you stayed up until the wee hours of the morning binging this juicy drama. Many thanks to the publisher for providing a copy for review."}, {"Review": "FIVE STARS\nI don’t know their secret, but whatever it is (SUPREME TALENT), authors Pekkanen and Hendricks need to bottle up their magic Mojo and spread it like fairy dust over readers around the world. Their ingenious writing technique is guaranteed to pull you up by the bootstraps - out of any debilitating reading slump you may occasionally find yourself in. Believe the hype. It is real. The dynamic duo is currently hard at work on a sure-to-be third mega hit-- 🙏PRAISE YEEZUS!This is what you need in your life, people. Their blockbuster debut,The Wife Between Us, is a soon to be feature film and this currently unreleased An Anonymous Girl is already in development for a television series by the same people that slayed HBO's Sharp Objects. And as readers know, YOU MUST READ THE BOOK FIRST TO HAVE PROPER BRAGGING RIGHTS TO YOUR FAVORITE SCENES! So hop to it.Synopsis: When Jess signs up for the psychology study conducted by the mysterious Dr. Shields, she thinks all she’ll have to do is answer a few questions, collect her money, and leave. But as the questions grow more intense and invasive and the sessions become outings where Jess is told what to wear and how to act, she begins to feel as though Dr. Shields may know what she’s thinking…and what she’s hiding. As Jess’s paranoia grows, it becomes clear that she can no longer trust what in her life is real, and what is one of Dr. Shields’ manipulative experiments. Caught in a web of deceit and jealousy, Jess quickly learns that some obsessions can be deadly.Oh my gawwd, read the fine print before you innocently sign up for a paid research survey! Even if you really need the cash. Especially if you really need the cash.This book is I M P O S S I B L E to put down! You will be sneak reading it under your work desk and dining table, it is so freakin’ addictive! I swear I developed a physical need to figure out what was going on and solve this puzzling plot. There aren’t huge in your face twists, but subtle ones that lead you in different directions than you thought you were going in…an anagram of a story that is told in a refreshingly modern and streamlined way. Unreliable narrators, interesting and unlikable characters, and a realistically creepy story of obsession (without graphic violence)- these things I love. I know you will love it, too. It is set for release on January 8, 2019. Pre-order yourself a New Year’s gift!Thank you to my book fairy, Jordan, at St. Martin’s Publishing for my early copy. You guys are killing it over there! As always, all opinions are my own and you know I’m not afraid to write a negative review🔪."}, {"Review": "I really enjoyed this book! Deceptive, creepy, and unsettling.CW: sexual assault, suicide, deathI devoured An Anonymous Girl. This book was so easy to engage with. I really enjoyed that the book is actually told in two perspectives; One in first person, one in second. This element really added to the creepy factor of the novel, as it’s almost disturbing to think of someone’s internal monologue constantly being geared towards the actions and thoughts of another character without their knowledge. I would totally recommend the audiobook for this reason as the voice actors did a fantastic job.One issue I took with the novel is the theme of morality and ethics was too oversaturated. I had a similar issue with Riley Sager’s The Last Time I Lied with the theme of lies. I can’t stand it when a book is shoving a certain subject matter at me from all angles and does not allow me to pick up the subtext myself. The way morals decisions are integrated into the storyline was obvious and clever enough until the characters constantly started referring to the topic in plain conversation. It was repetitive and tiresome. I think the book would have benefited from more subtlety.Additionally, I felt Jessica was too skeptical as a character. She’s not particularly clever or smart, but is constantly questioning the motives and truth of EVERYTHING without any sufficient reason to in the beginning. It created a real contrast between how Jessica prepared herself for conflict and how she attempted to actually resolve it. It seemed as if the authors were insecure about the audience’s inquisitive abilities and spoon-fed readers questions to consider before they could form them themselves. This is another huge pet-peeve of mine and I likely would have enjoyed the book more if I spent less time questioning the authenticity of Jessica’s thought process.Finally, An Anonymous Girl is not the most shocking, horrifying novel I have ever read. It’s pretty light on gore and violence, which I feel makes it a great choice for those who want to read thrillers without being scared or grossed out. The twists were sometimes clever, but mostly unsurprising when not expected. I would have liked more shock factor, but the charm of this story is more the overall ambience of the novel. The disconcerting vibe that follows you from beginning to end. It was not the most unbelievable mystery I’ve ever read, but it was twisted, unsettling, and unique. Would definitely recommend!!"}, {"Review": "4.5 compulsive, page turning stars ⭐️ for An Anonymous GirlI must start off by simply saying I thoroughly enjoyed this story. I'm a fan of cat & mouse type thrillers and this played right into that captivating me from the start and never letting go!\n\"In every lifetime, there are pivot points that shape and eventually cement one's path.\"\nJessica is a make-up artist, living in NY, struggling to make ends meet. While working on a client she hears about a morality and ethics research study that pays its subjects lucratively. Knowing the client will not make her appointment Jess makes the decision to take her place. Not knowing much about the study, she walks in and becomes simply \"Subject 52\". The rules are simple: Be open and truthful, and avoid pivoting away from any embarrassment or pain the questions provoke. Soon Jess finds herself divulging her deepest secrets via questions posed on a computer screen. Dr. Lydia Shields, the psychiatrist conducting the study is equally drawn in by Jess' responses to her questions. At the end of her two sessions, Jess is invited to expand her participation in the study for higher compensation but at what cost?What ensues, told in alternating POV chapters between Dr. Shields and Jess was a fast-paced, twisty, scheme filled story that you simply won't be able to get enough of. It was like a guilty pleasure, walking in each of these women's minds. Every time you think you have it all figured out - a new piece of the puzzle is dropped into your lap. \n\"You can't judge someone's internal state by their external attributes.\"\nThis was my first book by Hendricks & Pekkanen but it certainly won't be my last. They know how to hook their readers and keep them wanting more. This book has made me a fan of this writing duo and I can't wait to see what else they create together.Many thanks to Greer Hendricks and Sarah Pekkanen, St. Martin's Press and NetGalley for an arc of this book."}, {"Review": "Loved it! Devoured it! \nDevious to the max!\nI devoured this book in two days and didn't want to put it down! A riveting story of psychological suspense.  I was quickly questioning every move every character made. From beginning to end, I was all in! Yes!With a promise of anonymity and a fat paycheck, Jessica weasels her way into a study on morality and ethics. She was assigned the name of Subject 52 and presented with numerous questions.  I could feel her tension growing as the questions progressed into the realm of \nwhat would you do? \nI quickly got the feeling that this test was quite a \nmind game!\nDr. Shields may go done as one of the most perplexing doctor characters I've encountered.  What was her motivation for recruiting these women? Jessica wonders how the doctor seems to know her thoughts.I had some adrenaline surging moments as the tension amped-up and the plot unfolded. Everyone seems to have something to hide. The ending was just so perfect!Highly recommend this suspense filled mind game that pushes all the boundaries.Thanks to SMP for my Arc.  Review will post to my blog on 1/08/18"}, {"Review": "Wow! Five big stars. For once, the hype and buzz are deserved. Remember the rules: Be open and truthful, and avoid pivoting away from any embarrassment or pain these questions provoke.This book grabbed me from the get go. A twenty eight year old woman sneaks herself into an ethics and morality study in order to earn some extra income. I was able to immediately put myself in her shoes. The initial questions had me wondering how I would answer. The chapters alternate between the woman and the doctor heading up the study. It quickly becomes a fast paced ride. Definitely entertaining. There are some real twists so that the tension keeps getting ratcheted up. It’s a hard book to put down. I can even see this being made into a movie. Don’t look for believability here. But that doesn’t mean there aren’t some interesting concepts being explored. Power. Trust. Jessica is such a well thought out character. Out of her depth, but a real fighter. No dummy, but she’s up against a master. I was entranced trying to figure out how she would extract herself from this game of cat and mouse. I would love to know how Hendricks and Pekkanen write together because the finished product is seamless. If you like dark psychological thrillers, this one’s for you!My thanks to netgalley and St. Martin’s Press for an advance copy of this book. "}, {"Review": "Completely unbelievable, yet totally enjoyable!A psychological study on morality turns into a game of cat and mouse. Who will come out on top? The subject of the study or the doctor who is playing much more than a game. That’s all I am going to say about the plot. It’s best to go into this blind.I didn’t love The Wife Between Us due to the number of twists and some other elements. I decided to go into An Anonymous Girl with an open mind. I knew this was going to be over-the-top, but I decided to suspend my disbelief over the plot. Once I did, I had a lot of fun reading this. The narrative alternates between doctor and patient. I found the former to be cartoonish, but the latter was intriguing.This is a fast-paced, entertaining read that requires one to suspend disbelief. There might have been a few times where I was laughing out loud at moments that probably were not meant to be funny, but I found them so. With that being said, the plot is original and engaging. There were a few threads that felt incomplete and I was left with some questions. However, in spite of these moments, the entertainment factor won out in the end. I received an ARC of this book from St. Martin's Press and NetGalley in exchange for an honest review."}, {"Review": "\n\"How do you know if you can really trust someone?\" I finally ask.\"If you need to ask that question, then you probably already know the answer,\" he says.\nWOW! First book of 2019 on record and WOW, I loved it!An Anonymous Girl follows two main perspectives:\nJessica:\n A single-gal, late 20s, living in NYC and working as a make-up artist. Jessica lives a fairly solitary life. She has a sweet little dog and a couple of close friends but most of the time, she's alone. She is a bit haunted by her past. Back when Jessica was a teenager, an incident occurred with her little sister and she has a lot of residual guilt stemming from that. Also, due to this incident, she can find it painful at times to be with her family and they are under extreme financial distress.\nDr. Lydia Shields:\n Dr. Shields is a wealthy and successful psychiatrist and author who works at a local college teaching seminars and performing research studies, mainly on morality. Her perspective is written in second person which I did find jarring at first but eventually became used to and even enjoyed.Jessica and Dr. Shields become acquainted when Jessica lies her way into participating in one of Dr. Shields psychological studies. Motivated exclusively by money at first, Jessica eventually finds herself drawn deeper and deeper into Dr. Shields web.The relationship lines are extremely blurry with Jessica and Dr. Shields. I was so confused as to who was the predator and who was the prey. They both seemed so enamored with one another.To add to the complication we get Dr. Shields husband, Thomas, thrown into the mix. Again, is he good or is he bad?Everyone in this book is just too damn smart for their own good! Manipulation FACTOR 10!!!The story is extremely fast-paced, with a lot of twists and turns and ups and downs....Someone pass the dramamine! There was mystery, investigation, a spectacular game of cat-and-mouse...I ABSOLUTELY LOVED IT! In my opinion, this could definitely be one of the top Adult Thrillers I read in 2019...if not, the top. I know it is early but I have pretty much lost my mind over this book.Thank you so much to the publisher, St. Martin's Press, for kindly providing me with a e-copy to read and review. I always appreciate the opportunity to provide my feedback. This book is definitely a winner. The Greer Hendricks & Sarah Pekkanen combo is something very special! I hope they continue to write books together in future, as I would certainly love to read them!When money and morality intersect, the result can illuminate intriguing truths about human character."}, {"Review": "5 mind blowing stars! ⭐️ ⭐️ ⭐️ ⭐️ ⭐️ Did you ever have a book you saved, even though you got a copy really, really early, because you knew it would be good? I didn’t want An Anonymous Girl to be over long before I ever started reading it. The year-long wait until another book from this dynamite duo feels longer than a year! That’s a great thing in this case; these two authors are perfection together. The Wife Between Us by these Hendricks and Pekkanen is my favorite thriller of 2018, and An Anonymous Girl is already vying for top position for 2019! Sarah Pekkanen and Greer Hendricks have topped themselves with this smashing effort. Wow! It’s written how all thrillers should be, with page-turning, effortless writing, and characters that keep you on your toes. A villain like no other. A fallible but relatable victim. This book is remarkable. Gosh!A few details about the story just to pique your interest…Jessica Farris is a make-up artist living paycheck to paycheck in NYC, and money is an issue for her like it is for many people. She finds herself participating in a paid psychological study on ethics…But from the start, something doesn’t feel right with it…But then again, Jess needs the money. The study keeps going, becoming more invasive, and eventually Jess begins interacting directly with the psychiatrist in charge of the study, Dr. Shields. Jess develops a strong amount of paranoia early on, which never wanes though she doubts herself, again, because money is an issue. An Anonymous Girl is a story of obsession, right versus wrong, and betrayal. There are creepy characters that will make your skin crawl, a character you may champion (I know I did), and a few characters in the middle that you just can’t figure out. The chapters are the perfect length. The writing flows perfectly in a race to the finish of the book, and the tension builds at a nice pace. I was hooked very early, and I never lost my connection to this book. The storyline is massively original, full of twists and turns, and I will never forget this dark tale of suspense, deviousness, and questioning morality. Thank you to St. Martin’s Press for the complimentary ARC. All opinions are my own. My reviews can also be found on my blog: www.jennifertarheelreader.com—-(From my teaser review in December) This was the book I read on my actual birthday earlier this week. It’s unputdownable, tense, completely original, and written with the easy flow I wish all thrillers had because it makes me flip through the pages that must faster, keeping the suspense going. I will have my full review up in January on pub day, but until then, I have to say, The Wife Between Us by these authors is my favorite thriller of 2018, and An Anonymous Girl is already at the top of my list for 2019!"}, {"Review": "4 stars! A gripping and thrilling page-turner!Struggling to make her rent payments, Jessica Farris, finds herself involved in a well-paying psychology study revolving around ethics and morality. The compensation is too good to pass up. Upon attending the first study meeting and completing the initial questionnaire, Jess is offered the opportunity to proceed further into the depths of the examination with the mysterious Dr. Shields. Tension builds as Jess begins to feel paranoia and anxiety about her involvement and she begins to question what Dr. Shields objectives truly are.This was extremely well written! I was glued to these pages, devouring every single word with curious and hungry eyes. The pace, flow and narration were excellent! Told in alternating chapters between Jess and Dr. Shields, I felt the urge to read ‘just one more chapter’ from start to finish – I simply couldn’t get enough of this unique and mysterious story. The characters were well developed and each one kept me curious as to their true intentions throughout the novel. After the intensity of the storyline build up, the ending was a bit of a let-down for me. It didn’t fit with the excellence of the rest of the book, which took away one star. I still would highly recommend this novel as it kept me highly intrigued and guessing all the way through. To find this review, please visit our blog at:https://twosisterslostinacoulee.com/2...Thank you to NetGalley and St. Martin’s Press for providing me with an ARC in exchange for an honest review. An Anonymous Girl is available now!"}, {"Review": "4 Stars.Completely Intriguing and Totally Unexpected! Jessica is a makeup artist in New York City. After hearing about a paid ethics and morality case study, Jessica jumps at the chance to participate even going so far as to take a spot from a client of hers, who canceled last minute. Is it a choice Jessica will live to regret? Jessica is Subject 52. As a part of the study, questions are posed at a computer terminal: “Could you tell a lie without feeling guilt?”; “Describe a time in your life when you cheated?” Her answer are such that little does she know, at the end of the two sessions, she is the only subject left. Her answers are intriguing and unsettling. Dr. Shields, who is in charge of the study sees something in Jessica and hopes that she will not fail in her role... her doing so would be less than ideal. For both of them.“An Anonymous Girl” is book that took me by complete surprise - the premise was a breath of fresh air - it was unexpected and honestly it made me feel, well, dirty, slimey and scared, if I’m telling you the whole truth and nothing but the truth (ha ha, get it, I mean this book is about morality and ethics, right?!). It gets under your skin and makes you wonder how you would answer the questions posed and makes you fearful, terrified even, when you realize what Dr. Shields has in mind for Subject 52 (and no, I’m not going there, in case you were hoping I’d give you a clue!). This is a fast-paced crazy novel whose twists and turns made for a heart stopping novel. I highly recommend it for mystery / suspense lovers. It’ll keep you on your toes for sure. This was another fabulous buddy read with Kaceey!Thank you to NetGalley, St. Martin’s Press, Greer Hendricks and Sarah Pekkanen for an ARC of this novel in exchange for an honest review. Published on NetGalley, Goodreads and Twitter.*Will be published on Amazon upon release. "}, {"Review": "4.5 stars!Jessica Farris takes a friend's place in a psychology study of morals and ethics ran by Dr. Shields, since she needs extra cash. She thinks it will be easy money and that all she has to do is answer a few questions. But the questions become more and more intense. She begins to feel that Dr. Shields may know what she is thinking and what she is hiding. Jessica becomes constantly concerned and fearful and doesn t know what she can trust. She is fearful that her life could be in jeopardy.I love these two authors! I loved the book The Wife Between Us.Discover the next blockbuster novel of suspense, and get ready for the read of your life.I can not say that I was hooked straight from the very beginning. This one has a slow burn going into it. Once I got into it though I couldn't put it down. It was like a rollercoaster ride filled with twists and turns. I found this psychological thriller to be very addicting once I got to the suspense. The chapters are very short, so it is a fast paced read. This book is very well written. I loved the dialogue, and the writing style. The characters were so well developed. This one kept me on the edge of my seat and kept me intrigued to find out what was going to happen next. This was an unpredictable read for me. It was so surprising. I could not put it down and kept wondering what was going to happen next. The book ended very well. It kept my attention and amazed me. It has several jaw dropping moments. I recommend it. I want to thank Netgalley, St. Martin's Press and the author for the copy of this book in exchange for an honest review."}, {"Review": "I'm between 4 and 4.5 stars.The next time you consider signing up for a research study, you might want to think twice—and you will after reading this book!You're Invited: Seeking women aged 18 to 32 to participate in a study on ethics and morality conducted by a preeminent NYC psychiatrist. Generous compensation. Anonymity guaranteed. Call for more details.Jess is a makeup artist who came to New York dreaming of a career in the theater. She has a lot of secrets she's kept hidden, which has led her to become totally self-reliant, although money is one of the biggest sources of anxiety she has to deal with. When she overhears a client thinking about not showing up for a research study she was supposed to participate in—and it pays $500—Jess decides there's nothing wrong with pretending to fill in for the young woman, since $500 would really help with this month's rent.Jess figures all she'll need to do is answer some questions, collect her money, and leave. She wasn't expecting the questions to be difficult, like Could you tell a lie without feeling guilt? Describe a time in your life when you cheated, or Have you ever deeply hurt someone you care about? But more than that, she wasn't expecting the psychiatrist conducting the study—whom she never met—to give feedback on her answers, and encourage her to be more honest and more in-depth.As the sessions continue, and the payoff increases, Jess can't help but wonder what the study really is all about. While she is utterly unsettled when the psychiatrist, whom she finds out is the renowned Dr. Lydia Shields, asks whether Jess would be willing to expand her participation in the study. But when Jess learns that the compensation would be significantly higher, there's no way she can turn Dr. Shields' request down.Expanding her participation in the study is definitely not what she expected. Dr. Shields starts to tell Jess where to go, how to dress, and whom to meet—and in some cases, that entails striking up a conversation with a specific man. Jess begins feeling uncomfortable, and wonders exactly what Dr. Shields wants to accomplish. More and more, she questions whether she can trust the doctor—and then Jess discovers a disturbing coincidence that she needs to hide from her, or the doctor could destroy her life.\nAn Anonymous Girl\n is a pretty wild book, full of twists and turns. You wonder how you might react in the same situation, but at the same time I found myself shaking my head in disbelief at times that Jess could be so clueless. There were definitely some surprises thrown in, but ultimately I had my ideas about how the plot would unfold. I just kept hoping that things wouldn't go completely awry, and I was pleased they didn't.Greer Hendricks and Sarah Pekkanen, whose last book, \nThe Wife Between Us\n, contained some shockers but didn't quite click for me, definitely kicked it up with \nAn Anonymous Girl\n. I didn't love some of the characters (and I wondered whether some of this stuff could and does really happen) but the pacing of the book was terrific, and I was hooked from start to finish. I was also glad that the twists they threw in fit with the plot rather than just be included to confuse and shock.I know this book will be everywhere when it's released in January, because it's the type of book you can't put down, and it definitely will keep you wondering what comes next. Hendricks and Pekkanen mesh well together, and I can't wait for their next book.NetGalley and St. Martin's Press provided me an advance copy of the book in exchange for an unbiased review. Thanks for making this available! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"Review": "Ooh! So addictive! You will not be able to put this one down!Moral choices. No definitive right or wrong, a grey area that’s never that simple. Choices we make everyday. Choices that effect not only ourselves but everyone around us.Jessica is a struggling make-up artist in New York City. When a chance opportunity for quick cash falls in her lap she just can’t refuse! She fibs (just a little bit) to be included in a University psychology study. Simple enough - answer a few questions and receive some quick, easy cash! Can’t be easier than that. But come on, we all know everything in life comes with a price.Jessica is quickly in over her head and has no idea how to get herself away from the study or the psychiatrist who’s running this study.This was a gripping read that I basically read in only a few sittings. I developed my own theory on what was going on, only to discover I was completely out in left field!An entertaining thriller! I would recommend.A buddy read with Susanne!Thank you to NetGalley, St. Martin’s Press, Greer Hendricks & Sarah Pekkanen for an ARC to read in exchange for an honest review."}, {"Review": " Whoop!They did it again!!! Even better than the first book this writing dual wrote together!💥An intense twisty story that will make your head spin and your heart race! A book that made me check behind me just in case somebody creepy was watching! An absolute must read my psychological thriller loving friends, the hype is real!Jess is a struggling makeup artist trying to find her way in NYC... in need of money she fakes her way into a psychological research project... The research soon begins to spin out of control, leaving Jess bewildered and concerned... soon lines become blurred and research becomes reality.... A naïve girl, a creepy doctor, and a question of ethics... how much money would it take for you to compromise your morality? And how vulnerable does that make you?Jess was such a sympathetic character, I really adored her, and oh how I felt for her! She really wanted to help her family out and I think that might have blinded her to some huge red flags when it came to good old Dr. Shields... dr. Shields, yikes! SO creepy! I don’t even want to use a pronoun, because I think it is best to go into this book not even knowing if the doctor is a he or a she.... just know they are one manipulative disturbed SOB! There were so many times during this book I was on pins and needle’s, just waiting to see what the doctor would do next!This book was an intense ride until the very last word! A different and unique approach to the psychological thriller a twist to the twist! Absolutely recommend, this is one of the best!*** A big thanks to St. Martin’s Press for my copy of this book ***"}, {"Review": "It's more than a little treacherous to steer your ship with a broken moral compass. Navigating through the raging waters of life leaves many a shipwreck in the aftermath.Jessica Farris knows this first hand. She's a twenty-eight year old makeup artist still trying to find her niche in New York City. She struggles to pay the rent on her studio apartment and her bookings from BuzzBeauty are hit or miss. Finding extra money to send home to her parents and special needs sister is coming up short each month.While at one of her beauty sessions, Jess overhears one of the girls regreting an early Saturday morning appointment with a university professor, Dr. Lydia Shields, who is running a volunteer lab on ethics and morality. The first pay-out is $500. A no brainer and Jess shows up in her place. Our girl is in the door. Alone in a room, Jess hovers over the computer screen answering questions about being untruthful in life. The questions begin simply and then escalate in intensity. Certain scenarios are set up and Jess must answer either honestly or how she assumes the good doctor expects.As the pay checks roll in, Jess sinks deeper and deeper into Dr. Shields' world. She is called upon to complete tasks outside of the lab. And here is where Greer Hendricks and Sarah Pekkanen excel. The motivating factors are laid out with the reader in mind. We ask ourselves just how far and how deep would we get involved here? What motivates us in our own lives to make the moral choices that we do? Is there ever a line drawn and set in concrete or is it a moveable barrier depending on odd circumstances? Is bartering an option?The main character of Jess is a winner with the writing reflecting her dilemmas in decision-making opportunities. Peeling back the layers of Dr. Shields and others will keep you glued to this storyline. I have to leave it here, folks. You've got to crack this one open for yourselves. I'm leaving you at the threshold of quite the intriguing read. I received a copy of An Anonymous Girl through NetGalley for an honest review. My thanks to St. Martin's Press and to Greer Hendricks and Sarah Pekkanen for the opportunity."}, {"Review": "Dark, captivating, and twisted–nobody pulls off a psychological thriller quite like the amazing duo, Greer Hendricks and Sarah Pekkanen!I just finished their newest thriller An Anonymous Girl and I’m shocked and delighted by this twisty novel! This book is SERIOUSLY twisted, in the best possible way. Without question this is one of my favorite psychological thrillers I’ve read–and I don’t just mean this year!Full review is now on PhDiva!ReflectionThis is one fun ride, and if I may say, a ride that I had no idea where I'd end up. With a tantalizing writing style, this book pulled me in until the final delicious ending scene. I am blown away!!!Jessica is a fantastic leading character, because from the beginning I wasn’t sure if I could fully trust her accounting of events that transpired. Jessica has plenty of secrets and finding out what they are and watching her learn her own opinions on ethics, morality, and honesty were completely captivating for me!And then Dr. Shields… OH DR. SHIELDS!! I can’t say much because you’ll have to learn more about the enigmatic Dr. Shields as you read, but suffice it to say I considered from the very beginning whether I should call the IRB on Dr. Shields! Is this research IRB approved??? I need to see the signed approval letter, Dr. Shields!But jokes about research ethics aside, the premise of this study is so interesting. I’m not going to talk even a moment about where the study heads, but in the opening when we see Jessica answering the survey on the computer—I couldn’t look away! The questions are fascinating, as is the research protocol. But the real thrill I had was in reading Jessica’s thought process as she answered the questions. What was Jessica willing to divulge? And how did she reason through her journey of self-discovery? You’ll have to read the book to find out!And then—and I promise I’m keeping this entire review spoiler free—there are some truly amazing characters in this book aside from Dr. Shields and Jessica. From the two girls whose make up Jessica is crafting in chapter 1, straight to the end of the book. I won’t even name these characters because I truly believe that every reader should experience this book themselves without any pre-conceived idea of who is and isn’t relevant to the story. But if you’ve read it or once you do, I hope you reflect back on the outstanding cast of characters that Hendricks and Pekkanen created in this book. I’m positively itching to read An Anonymous Girl again, and savor each of those small moments and characters that comprise this wonderful story. I’ll say that despite this being a longer book, there is not a single scene, plotline, or character that is a throwaway. Every single moment is expertly plotted and woven together, into what I’ll be the first to say is one of the best thrillers I’ve read. I hope you are able to cancel all plans when you pick this one up!!!"}, {"Review": "I didn’t care for The Wife Between Us it was too over the top for me but given the hootin’ and hollerin’ about An Anonymous Girl I decided to give it a go. I did, in fact, like this much more than the authors’ previous novel but I couldn’t shake the feeling that I’ve read this before. Finally, I decided that my sense of déjà vu had to do with the power psychologists and psychiatrists wield over those held in their thrall which surfaces frequently in thrillers. The interesting part of this thriller is that the study in which the main character, Jessica, becomes enmeshed is about ethical behavior and morality. What is right? What is wrong? Or, more importantly in this novel, who is right and who is wrong. This is a quick read that is contorted, confounding and electrifying."}, {"Review": "Happy pub day!!!!HOLY GUCAMOLE! This was SOOOO unbelievably devious and good! I devoured this book in a day and a half. This was my first read by Hendricks/Pekkanen and WOW I can definitely see why everyone strongly recommends their novels. Talk about jaw on floor supreme talent her ladies and gents!! I was very impressed by this book and it's about DAMN time that I was able to get an excellent thriller! Watch out.... this is going to be THE thriller of 2019. No if's, and's or but's to that statement.... This was THE shit. This book is IMPOSSIBLE to put down and trust me you won't want to!! Unreliable characters, supreme creepiness to the tee, and unlikeable characters that will make you cringe (in the best way possible).... exactly what I needed! What a fantastic Christmas gift!! :)I would recommend going into this story blind... therefore I'm not going to share anything about the plot. Trust me... it will make the novel that much more addicting and one fun ride for you.That ending... also was perfect. Ugh... can't give these authors enough praise!!! I'm so excited to see what they come out with next... and will be obsessively stalking my goodreads account to see when their next book will be published.Also.. I'm going to get my bootay reading their first novel!!5 addicting and wild stars!!!!Huge thank you to Netgalley and St. Martin's Press for the arc in exchange for my honest thoughts.Pub date: 1/8/19Published to GR: 12/13/18"}, {"Review": "An Anonymous Girl was a twisted, suspenseful story that bordered on unbelievable, yet was still a fun read!Jessica, a young makeup artist in New York City, sneaks into a morality study at NYU, enticed by the promise of a large payment for participation. Jessica agrees to take part in a special project following the initial study. She is promised additional large payments for her participation. Jessica is instantly drawn to Dr. Shields, who she will be working for in the special study. Dr. Shields is pretty, always put together, and always maintains her composure. Soon, Jessica is in way over her head and not even sure what the special study is really about. An Anonymous Girl had me rushing through the pages to see what would happen next! Filled with deceit, it was interesting to try to guess which characters were trustworthy and which ones were not. Some of the situations in the story bordered on too far-fetched, and there were numerous points in the story where I felt Jessica was just too “green” and naive. Neither of these things detracted from my overall enjoyment reading the book though. Recommended for fans of fast-paced, suspenseful drama."}, {"Review": "I picked up this novel because I enjoyed the authors’ previous book THE WIFE BETWEEN US, and as soon as I learned about it, I became interested in reading it.What if you sign up to be part of a psychological study and you end up entangled in a lot more than you asked for? That is the premise of the book, and let me tell you, it does not disappoint.“One of them is lying. But who?” This is the question you’ll be asking yourself again and again as you read it. The novel is addictive and suspenseful, the plot kept me turning the pages wanting to know more. The authors did a great job at building and maintaining intrigue throughout the novel, at every chapter you will be wondering which character to trust.Overall, I enjoyed it and recommend it to readers of psychological thrillers, mysteries and contemporary fiction,.Received ARC from the publisher via Netgalley"}, {"Review": "\"Seeking women ages 18–32 to participate in a study on ethics and morality. Generous compensation. Anonymity guaranteed.\"The plot for this story is incredibly original and is what initially piqued my interest in this book. But that's where it ends for me. I already know that I'll be in the minority with my opinions as this book will no doubt appeal to the masses.Told in two points of view, that of Dr Shields, the alluring, manipulative therapist conducting a survey on ethics and morality, and Jess, the unlucky participant that has drawn the attention of Dr Shields. Dr Shields finds Jess is most suitable for a personal agenda and begins the process of grooming and manipulating her. Its clear that the chapters narrated by Dr Shields are meant to have a creepy feel but the atmosphere falls flat. Jess is likeable enough, devastatingly flawed and a victim of her own secrets.I'm all for a slow burn but this book burns so slow it extinguished itself by the 40% mark and never really becomes engaging throughout. The synopsis for this book paints a picture of a story more psychologically frightening than is actually between the pages. The story is totally implausible, which I could forgive if only the narrative had been told in a more captivating way. There are no twists in this book, no gasping moments, no real sense of mystery. The ending is just blah and completely farfetched. I found the story to be pretty lackluster throughout.I would be remiss in not mentioning that clearly the authors are fans of fashion because nearly every scene includes a detailed description of what the characters are wearing down to the tiniest of details. These details lend nothing to the storyline and become laughable at points because of the absurdity of their inclusion in the book. I'm giving this one 2.5 ⭐ rounded up for plot originality and the fact that I was able to finish the book despite it's failings.I was provided an ARC of this book by NetGalley in exchange for an honest review."}, {"Review": "LONG....but NO SPOILERS......Greer Hendricks and Sarah Pekkanen are on their way to becoming co-author psychological thriller legends. They had a break-out sensation hit with “The Wife Between Us”, last year in 2017. “An Anonymous Girl”, will be released in January, 2019. Greer and Sarah are an exciting team. There is something very appealing about two skillful stunning women holding us captive - as awed spectators -waiting to see who we can trust - who to believe- who’s the stalker -and who’s the prey. In “The Wife Between Us”, we never knew the complete truth until the end. New secrets were revealed...and we were still wondering who was manipulating who up to the final chapter. In “An Anonymous Girl”, once again - if you are sure you know what’s happening in a scene, think again. There are many layers to peel back as we turn the pages. I purposely slowed down my reading. I had no interest to race through this book. I thoroughly enjoyed thinking about issues and questions presented. Like panning for gold.... when searching for INTELLIGENT- PSYCHOLOGICAL THRILLERS .....( cream of the crops) ..... “An Anonymous Girl”, synonymous with Greer Hendricks and Sarah Pekkanen, and “The Wife Between Us”, ......these two books make the cut!!! ....... “An Anonymous Girl”............”Ethics and Morality” is a ‘hot topic’. It’s at least worthy of a few lifetime discussions. I found it exciting and refreshing to center a psychological suspense novel around a study of this inquiry. .....The first few chapters ARE SERIOUSLY PAGE TURNERS!!! We follow the set-up story between Dr. Shields, adjunct professor at NYU, psychiatrist, and Jessica Farris, 28 year old makeup artist. Jessica works for a company called ‘BeautyBuzz. She goes to clients homes and gives them a makeover for events like Proms, Bar Mitzvahs, birthdays, and anniversaries. ( she misses working in Theater). Jessica lives alone with her dog Leo. We get back story about Jessica’s parents and younger sister Becky. Becky is a few years younger than Jessica, but lives with her parents and requires special needs. Jessica becomes a paid participant in the study on Ethics and Morality. Right off the bat, Jessica lied her way into the study. Jessica- *Subject 52*, agreed to be bound by confidentiality. She wasn’t allowed to discuss what she was doing with ‘anybody’. While answering questions that pop up - one at a time - on a computer screen - we can imagine sitting in a private room - in a sterile setting ( in Jessica’s chair), wanting to shy away from feelings of vulnerability- but Jessica is asked to surrender to the process completely- answer the questions honestly- for the process to be successful. We sense Jessica wants to put her entire heart into the study. Even when uncomfortable- we sense she wants to please Dr. Sheild’s. Dr. Sheild’s notices. A trust begins to grow. The Rules are simple and clear. “Be truthful - avoid pivoting away from embarrassment or pain that the questions provoke”. Intimacy begins to grow between Jessica and Dr. Shields. Proper boundaries are questionable. The questions - themselves - in the study were intriguing: “Could you tell a lie without feeling guilt?”, “Describe a time in your life when you cheated?”......AND MANY MORE......Over weeks- Jessica will be digging deeper - going beyond the superficial....EVENTUALLY......The original study falls off an honorable grid. Dr. Shields prepares an unorthodox experiment. Jessica Farris, becomes a pawn for Dr. Shields own purposes. .....It wasn’t until about half way into this novel - or a little more- when I felt a genuine thriller edge elevate. I ENJOYED BOTH HALVES OF THIS NOVEL.....yet - we feel a change. As Jessica’s anxiety grows into anger —I started noticing more tension building in my own physical body.....( YET WITH GREAT RESPECT & DIGNITY FROM OUR AUTHORS- THERE ARE NO GRAPHIC DISTURBING SCENES).....I really love these women authors!!!! THEY ARE SETTING AN EXAMPLE OF WHAT I HOPE TO SEE MORE OF when writing novels in this genre. I started thinking about those one or two times when my entire life changed in less than 5 minutes. If we are honest - each of us have moments like this. Jessica did too.  “Only six weeks ago, Jessica worried about how she would pay for her sister, Becky’s occupational therapy and hoping her makeup business with BeautyBuzz would align so she wouldn’t have to lug her makeup case too far. Her life was quiet, her problems ordinary. Then came an impulsive moment - all of 10 seconds that changed her life”. A simple innocent - cheating lie - changed the course of her life.Jessica isn’t the only person in this story who cheated - and lied .....But ‘who’ is most dangerous? ALL the characters are memorable- supporting ones too. You’ll meet many more. I haven’t SPOILED ANYTHING! Disasters and consequences - warnings — who’s in control - doubts - how do you know if you can really trust someone - the tone of a text message - are thoughts to chew on.  “Every family generates it’s own particular dysfunction. Many people believe that once they cross the threshold into adulthood, legacy can be shed. But the maladjusted dynamics that have been imprinted upon us, often since childhood are tenacious”."}, {"Review": "Riveting, absolutely unputdownable & totally mind-blowing stuff!This was an absolutely fantastic psychological thriller novel that I devoured in less than 24 hrs. This books unique storyline immediately drew me in and had me on the edge of my seat for the entirety of reading this book. The pacing and short chapters made this an extremely fast read. AN ANONYMOUS GIRL by GREER HENDRICKS AND SARAH PEKKANEN is a compelling, thrilling, twisted, and rapid-paced read that was so darn entertaining and exciting to read. The intensity level of this novel was so high that my thoughts and feelings never wavered once while reading this book. GREER HENDRICKS and SARAH PEKKANEN delivers quite the fascinating, intriguing, suspenseful and well-written read here with great characters, a unique premise and an extremely enthralling storyline. There was this deep suspenseful undertone to this novel that gets more exciting, intriguing and intense as the novel progressed. I absolutely loved the way that this story was told and thoroughly enjoyed both perspectives equally. The cat and mouse game between our main characters was probably one of the most unnerving that I have ever read which made it all the more exciting. Seeking women ages 18–32 to participate in a study on ethics and morality. Generous compensation. Anonymity guaranteed. The psychology study was one of the most clever, intriguing and entertaining hook that I have yet read and I applaud the authors for immediately absorbing me in this storyline and making this another all consuming read for me.Publishing Date: January 8, 2019Norma’s Stats:Cover: Eye-catching, intriguing, alluring, and ominous. Definitely a creepy feeling happening here with this cover which represents the storyline extremely well.Title: Appealing, suspenseful, intriguing and absolutely love how the title plays so fittingly into storyline. Writing/Prose: Well-written, engaging, captivating, and smart.Plot: Creative, thought-provoking, suspenseful, gripping, fast-paced, absorbing, enjoyable and extremely entertaining. I absolutely loved how thrilling this storyline was with all of its subtle twists and turns!Ending: Wow an absolutely perfect resolution that I was extremely satisfied with. Overall: A fascinating read that had me totally engrossed from start to finish! I absolutely loved being caught up in the web of deceit and had no clue how this one was all going to play out. Would highly recommend!Thank you so much to NetGalley, St. Martin’s Press and Greer Hendricks and Sarah Pekkanen for the opportunity to read an advanced copy of this book in exchange for a review!Review can also be found on our blog:https://twosisterslostinacoulee.com"}, {"Review": "Having really enjoyed reading The Wife Between Us by Greer Hendricks and Sarah Pekkanen, their talent is confirmed here with this hugely intense, compelling and addictive An Anonymous Girl, which moves in a rather different direction. This is a story set in New York City, of deception, betrayal, obsession, jealousy, where we are given two different protagonists, the naive and vulnerable 28 year old Jessica Farris and the clinical and detached psychiatrist Dr Lydia Shields, an academic at NYU. Jessica is a freelance make up artist who visits her clients at home, she is struggling financially, not to mention she has a younger sister, Becky, with special needs that require financial support for the help she needs. When she sees the opportunity to get on to a research study that pays, she has no compunctions about lying her way on to it, despite the irony of the topic. It is seeking women between the ages of 18-32 to participate in a study on ethics and morality with anonymity guaranteed.Subject to a confidentiality agreement, Jessica, as subject 52, embarks on the study at Hunter Hall, answering demanding personal questions on a computer screen, guided to be truthful. After the sessions, Jessica is asked to get further involved for further lucrative financial rewards. Jessica trusts Dr Shields with her secrets and has no problem with continuing with the study. However, Jessica's new assignments are out of the classroom and venturing into strange and disturbing territory. Jessica's paranoia levels begin to rise as she finds herself in the hands of a controlling Lydia, who has a estranged husband, Thomas, and is operating from her own hidden agenda. The slow reveals in this twisted, character driven and fast paced story of secrets and lies are expertly done by the authors. This is a wonderfully thought provoking read, it will have you pondering over the moral and ethical dilemmas posed within it with its great character studies. This novel with its unreliable narrators is a salutary lesson for all of us in not blindingly trusting any professional, not everyone is worthy of trust. A brilliantly entertaining and creepy read from authors that are establishing themselves as must read storytellers. Many thanks to Panmacmillan for an ARC."}, {"Review": "4.5 Stars! \"Not everyone is brave enough to face their demons.\"  I really like an author who can spin a twisted tale and Greer/Pekkanen do it again in AN ANONYMOUS GIRL. 28 year old Jessica is a hardworking makeup artist who could use a few extra bucks to help her family back home....and pay her rent, so when she sees what seems to be an easy opportunity to make a fast $500 just by answering a few questions, she sneaks into a highly confidential morality and ethics survey that turns her life into a dangerous game of truth or consequences. The dual narration is fast moving with a constant underlying sense of danger that bring out a myriad of secrets and lies. Many thanks to St. Martin's Press and NetGalley for the arc in exchange for an unbiased review."}, {"Review": "This novel gets a lot of points for originality. It starts with Jessica, a makeup artist who’s struggling financially, finding out about a psychology study about morality. Answer some questions and make five hundred bucks. What could go wrong?A whole lot, of course. The story gets creepier and more tense the deeper into the book you go. Is Dr. Shields dangerous or just strangely manipulative? How much can Jess trust the doctor and other people she encounters as the study moves from the laboratory in front of a computer into real-life tasks. At every turn Jess is asking herself what Dr. Shields’ real agenda is. Though portions of the book are told from the doctor’s perspective, we the readers aren’t sure if the doc is giving us the full story. That part bothered me—having one reliable narrator and one unreliable one. The tension gets particularly strong from the middle to the exciting conclusion. Thanks to NetGalley and St. Marten’s Press for the opportunity to review this book, which RELEASES JANAURY 8, 2019.For more reviews, please visit: http://www.theresaalan.net/blog"}], "Genre": "Thriller", "ID": "39863515", "Desc": ""}